{
    "symbol": "VCSA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 21:08:04",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to Vacasa Second Quarter 2021 Earnings Call. Good afternoon, everyone, and thanks for joining us today for Vacasa's Second Quarter 2022 Earnings Call. This call contains information that speaks only as of today's live broadcast, and redistribution of this broadcast is prohibited. Also, the strong traveler demand we experienced in the first half of the year has continued to date. Like all of you, we've been paying close attention to the macroeconomic environment over the past few months to understand how any changes could impact our business. On the cost side, inflationary pressures had no discernible impact on our business during the second quarter. Our value proposition is focused on marketing vacation homes, striving to optimize rental income, and servicing reservations while our homeowners enjoy the benefits of owning the vacation home and earning rental income to help offset the cost of ownership. Additionally, vacation home guests have the option of eating in versus dining out or even sharing homes with friends, both of which can significantly lower overall travel costs. We believe we are well positioned given our focus on the vacation home vertical, diverse selection of markets, asset-light business model, variable cost structure, and positive operating cash flow over the last 12 months. We believe that our technology focus creates a truly differentiated value proposition for homeowners, making us the vacation rental manager of choice in the markets we operate. We aim to generate homeowners more rental income than peers through our advanced yield optimization, which combines broad listing distribution with our proprietary dynamic pricing engine. The listing for every home we manage is distributed across Airbnb, Booking.com, and Vrbo plus more than 100 other channels to maximize visibility and, in turn, guest demand. Our individual approach, which is a direct sales model where predominantly local sales representatives sign up individual homeowners, continues to account for the majority of our home additions. Similar to prior quarters, our CAC has remained stable, which combined with stronger lifetime value lands us above our target range. We continue to add sales executives throughout the quarter, reaching the targeted sales force size for 2022 that we set out at the beginning of the year. In the second half of 2022, we intend to maintain its current size, back filling with additional hires as needed. On the portfolio approach, we were active in the second quarter, bringing on 16 portfolios. In the second quarter, while maintaining our disciplined approach to evaluating portfolios, we came across a number of opportunities that fit squarely into our framework. We look for portfolios that either open new markets, add scale to thin markets to build density or unlock differentiated high-quality inventory. For example, there's a market in the Florida Panhandle with more than 1,000 vacation rental homes. When one of the two leading portfolios in this Florida market became available as the owners approach retirement age, we were able to add that 250-plus unit portfolio and immediately establish a market-leading position. From a growth perspective, this portfolio addition also unlocks a new market for the individual sales effort, which will be led by a local employee that we retained from the prior company and supported by the broader Vacasa platform. The portfolio program is a very powerful strategy that allows us to enter new markets profitably and importantly, unlock substantial opportunity for our individual approach. Finally, I want to spend some time covering recent updates to our technology platform, a linchpin of our business, which helps improve the vacation rental experience for guests and homeowners, drives efficiencies in our local market operations, and enables us to scale. In addition to the internally developed purpose-built products we've introduced, such as our pricing algorithms, the homeowner app, and the clean inspection tool, just to name a few, we've also implemented a number of enterprise-grade systems over the past six months. Importantly, these tools can support immense scale and our long-term ambitions of managing hundreds of thousands of vacation homes and facilitating tens of millions of nights sold on an annual basis. In addition to increasing the number of sales representatives over the past year, we also launched a new customer relationship management tool in the second quarter. While we don't expect an immediate step function change in productivity, our sales leaders now have greater insight into the sales force, enabling those leaders to manage the team effectively as it scales in the years ahead. We've customized the platform to tie directly in with our vacation rental management system, which houses all the information about reservations and owners. With the new system in place, we've been able to offer guests and homeowners more ways to communicate with our support teams and resolve their questions more quickly, which has resulted in operational efficiencies. Our deep technology experience and overall scale allow us to invest in these leading technologies, which in turn supports our ability to provide superior customer service and continue to efficiently add homes to our platform. In closing, our business is well positioned from an industry business model and capital perspective. I'm confident the team can continue to execute across all facets of our business, positioning us well for continued growth against the market opportunity of more than 5 million vacation homes in the United States. As we review our financial results, unless noted otherwise, I will be comparing our second quarter results to the second quarter of 2021, and I'll be referencing the operating expense line, excluding the impact of stock-based compensation and business combination costs, which you can find outlined in both our press release and shareholder letter. Also, recall that we completed our strategic acquisition of Turnkey Vacation Rentals on April 1, 2021, which does affect the year-over-year growth rates of our key business metrics and revenue relative to the first quarter. Gross booking value, which is the combination of nights sold and gross booking value per night sold reached  in the second quarter, up 32% year-over-year. Nights sold reached $1.6 million in the second quarter, up 17% year-over-year, with the increase primarily driven by the addition of new properties to the platform. Gross booking value per night sold reached $411 in the second quarter, up 13% year-over-year. Revenue, which consists primarily of our commission on the rents we generate for homeowners and the fees we collect from guests was $310 million in the second quarter, up 31% year-over-year and above our guidance range of $280 million to $290 million, driven by strong guest demand. Cost of revenue was 49% of revenue in the second quarter, with slight year-over-year operating leverage due to the growth of gross booking value. Sales and marketing expenses were up 58% year-over-year, with the increase due to our significantly larger sales force compared to a year ago and, in turn, greater homeowner-focused advertising spend to drive more leads for our larger sales force. Sales and marketing expense is also higher due to the higher fees paid to distribution partners, driven by the growth of gross booking value. General and administrative expenses were up 61% year-over-year, largely due to hiring to support the increasing scale of our business. On a sequential basis, general and administrative expenses increased by $6 million, and the bulk of that due to nonrecurring items, including higher professional service fees. Adjusted EBITDA was connected $2 million for the second quarter, ahead of our guidance range of negative $20 million to negative $15 million. In the second quarter, we on boarded 16 portfolios for a total consideration of $74 million. In aggregate, the portfolio we on boarded in the second quarter tended to be higher performing on a revenue basis, resulting in a higher purchase price per unit, but the average multiple paid was in line with our valuation target. Model units are created equally, and our focus remains on evaluating the resulting revenue and profitability that a portfolio contributes relative to its cost. Given we found substantial opportunities to deploy our planned 2022 spend through the first two quarters of the year, I would expect less spend on new portfolios in the second half of 2022 relative to the first half. So our operating cash flow in a given quarter has some variability due to the seasonal nature of our business, we have generated positive operating cash flow on the last 12-month basis for six consecutive quarters. For the 12 months ending June 30, 2022, our operating cash flow was $110 million, and we had capital expenditures of $18 million. We believe that we remain well capitalized and fully funded with $759 million of cash, cash equivalents, and restricted cash. We also have $102 million of borrowing capacity under our $105 million revolver, with a $3 million difference due to outstanding letters of credit. We believe that our consistent ability to generate sustained positive operating cash flow, minimal capital expenditure requirements and current cash balances allow us to execute on the growth opportunities ahead of us. We also have a high percentage of our expected August booking confirmed at this point, which is our second strongest month of the year. With July complete and high visibility into August, we are confident in our third quarter guidance. And while we have less visibility into the fourth quarter, given it's only August, we are currently pacing well against our expectations. Our fiscal year guidance assumes that for the second half of 2022, the combination of gross booking value per night sold and nights sold takes a slight step back from the record levels reached in 2021, but remains meaningfully above pre-pandemic levels. We understand the importance of reaching adjusted EBITDA profitability, especially given the broader macroeconomic environment and increased investor focus on balancing growth and profitability. So rather than reinvesting our second quarter adjusted EBITDA out performance to accelerate various discretionary investments, as we have done in the past, we are instead of letting that flow through and are raising our adjusted EBITDA guidance for the full year. The midpoint of our full year 2022 adjusted EBITDA guidance is now negative $4 million, which is nearly $40 million higher than the negative $42 million we outlined in our initial projections back in July 2021. It's definitely logical to think we'd see a benefit in terms of new homes coming on to the platform and owners that are already on the platform, opening up more availability, as you mentioned. Well, we had a great quarter in terms of adding 16 portfolios, some great ones, too, that fit squarely into our overall strategy for that playbook of growth. But we run it very much like a sales process, if you will, but it's more relationship based. So we're a great fit for somebody that's looking for an exit from their business for the example , the folks who were retiring. So that's the general approach we run it very much like a sales pipeline, if you will, but it's much more relationship and long-term focused than maybe the individual approach would be. The communications platform is Twilio -- and both of those are enterprise-grade, very respected best-in-class solutions that many companies have chosen to use -- well, actually, I'd say many larger companies have chosen to use. It's really the integration of those into our proprietary systems as the sum of the parts really creates the best overall platform in the industry, and we are able to invest millions of dollars in these solutions, but we don't have to build everything. That's where the platform becomes incredible and also can scale to our ambitions, hundreds of thousands of homes, tens of millions of nights sold the year. We're not anywhere close to done in terms of the ability for us to do that optimization of listings, and that's what we do on a daily basis. Well, it's the things that I mentioned, and it's interesting because it's -- there's not an individual large gap that we're trying to fill right now. So the absolute -- we added -- we had a great quarter for adding sales reps because we reached our number -- our target -- our planned target number for the year in the second quarter, which we had planned to do. Of course, we'll continue to be adding sales reps, but between back filling performance management, et cetera, on the net basis, we're roughly staying in this size. As far as the focus for us is really about getting that productivity improvement because that, coupled with the size of the sales force is really what gives you the overall compounded lift to the individual approach. And then just the tenure, we headed a lot of salespeople over the last year and newer sales reps are not as productive as tenure sales reps. Obviously, we have all the data down to the ZIP code and the city block, but there's nothing that I would call out on a regional basis. And Matt, I know you know you've had a lot of experience building out sales force teams. And then my second question is, I appreciate you guys reiterating your guidance for EBITDA positive next year. In terms of training, we've had to on board a number of -- quite a few new sales reps. And then you get to the refinement of the sales process, and that is where this data from Salesforce is really going to come in handy to help our sales leadership team develop even more precise role-playing, et cetera, objection handling, et cetera. Specific tactics that we're taking, we're not necessarily interested in sharing -- but sharing those broadly because we're still in a competitive industry, but I'm incredibly proud of the sales leadership team and the progress that they've made over the last 12 months, really six months in particular, to really boost the understanding of our sales team on how to sell a value proposition in a very compelling way. We've seen a lot of strength that's given us the ability to realize the homes on our platform at a higher rate, which has driven better gross booking value and higher gross booking value per night sold. I'd also just reiterate, we feel really good about our third quarter guidance, our back half guidance. We mentioned July 40% to 50% of the third quarter revenue in gross booking value, which is now in our rear view year. And August is the second largest month of the quarter and the year, which we also have great line of sight into. So feeling really good about the back half and the visibility that we do have into the fourth quarter, even though that's a bit further off. In terms of the demand environment, obviously, a bit out of our control, but we are confident we can manage the business to meet that guidance of positive adjusted EBITDA. We know 40% of travelers say they choose vacation rentals over hotels because of the value, not to mention that they can dine-in instead of dine-out, share homes with friends and really make it a bit more cost-effective. From a homeowner acquisition perspective, Matt touched on this a little bit, but potentially gets a little bit easier as homeowners might need us a little bit more, free up a bit more availability or you might see some churn reduction just given homeowners need income and there might be fewer sales of real estate. In terms of the business model, specifically, one, we don't commit capital in order to earn revenue. And then second is our cost structure, where 70% of our expenses are cost of revenue and operations and support, which are largely variable on consumer demand. And I'd also just remind you, we've had positive trailing 12-month operating cash flow for the last six quarters and -- which means all of the portfolio spend that we do is discretionary. So I really feel strong that the business is resilient given the structure that we have, and we'll see what happens from an overall environment perspective, but feeling really good and seeing great trends right now. And again, to our homeowners for entrusting us with their homes and with the income generation that they seek."
}