{
    "symbol": "TMST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 16:43:11",
    "content": " Turning to our second quarter results, net sales totaled $415.7 million and net income was $74.5 million, or $1.42 per diluted share. On an adjusted basis, net income in the second quarter improved to $67.4 million or $1.29 per diluted share. Adjusted EBITDA improved to a record at $84.2 million in the second quarter, an $18.9 million sequential increase. Compared with the same quarter in 2021, adjusted EBITDA increased by $13.2 million reflective of higher base selling prices and improved mix. Comparatively, second quarter shipments decreased by 5,300 tons or 2% from the second quarter of last year as a result of lower industrial and mobile shipments, partially offset by increased energy customer demand. Lastly, from an end markets perspective, continued momentum in energy demand drove shipments of 21,400 tons in the second quarter, a sequential increase of 8,800 tons or 70%. Net sales of $415.7 million in the second quarter increased 18% compared to the first quarter, and improved 27% compared to the second quarter of last year. Costs increased sequentially by $13 million in the second quarter, driven by higher plant spend primarily related to maintenance as well as higher variable compensation expense. In comparison to the prior yearâ\u0080\u0099s second quarter, manufacturing costs were $26 million higher given the current year inflationary cost environment as well as higher maintenance costs. From an SG&A expense perspective, in the second quarter, SG&A increased $3.2 million on a sequential basis to $21.7 million. During the second quarter, operating cash flow was $50.7 million driven by quarterly net income, partially offset by a use of cash to fund working capital requirements. During the second quarter, the company repurchased approximately 438,000 common shares at a total cost of $9.3 million. In the second quarter, we negotiated the early repurchase of $15.2 million of convertible notes due in 2025 at a total cash cost of $40.8 million. Lastly, from an operational perspective, planned annual maintenance shutdown costs are estimated to be approximately $10 million in the second half of 2022, with approximately 25% incurred in the third quarter, and approximately 75% incurred in the fourth quarter. Given these elements, the company expects adjusted EBITDA to remain strong in the third quarter, but lower than the second quarter, primarily driven by a market decline in scrap prices, which will reduce surcharge revenue per ton, as well as impacts from the melt shop operational downtime."
}