{
    "symbol": "VRTV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 13:45:29",
    "content": " This morning, we announced record adjusted EBITDA, adjusted EBITDA margin, net income, and diluted earnings per share for both the fourth quarter and the full year 2022. We achieved record adjusted EBITDA of $518 million for the year, representing growth of more than 50% compared to the prior year. Adjusted EBITDA was a fourth quarter record of $121 million, reflecting growth of slightly more than 4% as compared to the prior year. Net income of $72 million was also a record for the fourth quarter, reflecting year-over-year growth of 26%. The resulting diluted earnings per share for the quarter was $5.20, which was a fourth quarter record and represented growth of 42% versus the prior year. The packaging segment reported fourth quarter adjusted EBITDA of $95 million, representing a decline of 16% compared to the prior year. Packagings fourth quarter adjusted EBITDA margin was 10.4%, which was a 70 basis point decline over the prior year. The fourth quarter adjusted EBITDA for facility solutions was $16 million, reflecting a decline of 9.8% compared to the prior year. Our reported adjusted EBITDA margin for the fourth quarter was an all time high of 9.0%, which was a 150 basis point improvement over the prior year in part due to the divestiture of the lower margin Canada business. Fourth quarter reported revenue declined 2.1% to $572 million, while organic revenue increased 7.3% compared to the prior year. Full year 2022 adjusted EBITDA was a record $240 million, representing growth of over 100% compared to the prior year. We expect to retain a majority of the adjusted EBITDA margin improvement relative to our pre-pandemic levels due to the commercial and operational efficiency initiatives this business has undertaken over the last several years To summarize, we expect full year 2023 adjusted EBITDA to be in the range of $430 million to $490 million and net income is expected to be in the range of $265 million to $305 million."
}