{
    "symbol": "MOR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 21:33:06",
    "content": " My name is Julia Neugebauer, Senior Director Investor Relations at MorphoSys, and it is my pleasure to welcome you to our first quarter 2022 financial results conference call. Joining me on the call today are Jean-Paul Kress, Chief Executive Officer; Sung Lee, Chief Financial Officer; Malte Peters, Chief Research and Development Officer; and Joe Horvat, U.S. General Manager. Before we begin, I'd like to remind you on Slide 2 that some of the statements made during the call today are forward-looking statements, including statements regarding our expectations for commercialization of our products and our development plans, expectations for the compounds in our pipeline as well as the development plans of our collaboration partners. These forward-looking statements are subject to a number of risks and uncertainties that may cause our actual results to differ materially including those described in the Form 20-F and annual report for the year ended December 31st, 2021, and from time to time in other SEC documents of MorphoSys. On Slide 3, you will find the agenda for today's call. Joe will provide a commercial update, and Mark will provide an update on our development pipeline before turning the call to Sung for a summary of our first quarter 2022 financial results. In the first quarter, we continued to make progress on our mission to become a leader in hematology oncology. Our first commercial product, Monjuvi, the cancer immunotherapy treatment, remains the market leader in new patient starts for second line DLBCL. We have a robust and mature pipeline, and we are seeing strong patient enrollment in our pivotal Phase 3 studies. For Monjuvi we see the largest opportunity in first-line DLBCL, where there remains a large unmet need. Our pivotal frontline trial continues to enroll very well with significant interest from the medical community, and we are confident in our approach, focusing on high-risk patients with an IPI of three to five. We are very excited about the potential opportunity of pelabresib in first-line myelofibrosis, which is being studied in our pivotal manifest 2 trials in combination with ruxolitinib. In addition to our late-stage pipeline, we are advancing our mid-stage programs, the EZH2 inhibitor CPI-0209 in a basket oncology trial; and felzartamab in autoimmune diseases. For both programs, we are expecting data later this year. The major focus this year is to drive Monjuvi sales and to continue to rapidly enroll our pivotal studies, which are our largest potential value-creating opportunities over the long term for the benefit of patients and our shareholders. As we look to data this year, we are excited about two potentially significant readouts of our partner programs. Most importantly, Novartis is expected to advance ianalumab for Sjogren's syndrome and lupus nephritis; and Anthos Therapeutics to advance abelacimab for the prevention of venous thromboembolism. Also, Mereo and Ultragenyx are investigating setrusumab in a Phase 2/3 clinical study for the treatment of osteogenesis imperfecta. On these programs, we tend to receive potential royalties, which could provide us with attractive future income streams as we execute on our commercial efforts and late-stage pivotal trials. As we look at our financial position, we have a very strong balance sheet, and our cash runway takes us through our pivotal elaborative data in first half 2024. Monjuvi net sales in the first quarter were $18.7 million, representing a 21% year-over-year growth. Coming out of the first full year of launch with a novel immunotherapy, we are pleased with the continued gradual uptake for Monjuvi in this aggressive disease. We continue to expand our reach with more than 1,100 sites of care ordering Monjuvi since launch through the end of Q1. In the first quarter, approximately 80% of orders from sites of care were repeat orders, which reflects the ongoing use of Monjuvi. As we penetrate more sites of care, we would expect the repeat order rates to continue to be high, as physicians prescribe Monjuvi more consistently due to its attractive and uniquely differentiated profile. In March, Monjuvi was designated as a preferred regimen by the NCCN guidelines for approved second-line label. An important part of this education effort is the emphasis on the importance of keeping patients on treatment until progression, which is consistent to how other immunotherapies are utilized in the outpatient setting. We believe these education efforts will lead to an increase in treatment duration over time and more importantly, a benefit to patients. Based on latest data from Arm 3 of the manifest trial, our Phase 2 study of pelabresib in myelofibrosis, we believe pelabresib may have the potential to change the standard of care in the first-line treatment of myelofibrosis. We will be presenting new clinical and translational data from the manifest trial at an upcoming medical conference this summer, including data on pelabresib's disease-modifying potential. The enrollment of manifest two study is progressing well, and we expect to report top line data from this trial in the first half of 2024. For our other important program, tafasitamab, we have two Phase 3 studies underway, frontline and in-mind, - expanding the potential of this cancer immunotherapy to patients living with first-line DLBCL and patients living with relapsed or refractory indolent lymphoma. The frontline study is examining tafasitamab as a first-line treatment for DLBCL, an area where there is a significant need for new and more effective treatment options. We are confident in our trial design that focuses on high-risk patients with an IPI score of three to five, and we believe tafasitamab plus lenalidomide may have the potential to enhance the current standard of care. Our partner, Xencor, is investigating the combination of tafasitamab and their CD20xCD3 antibody, plamotamab and lenalidomide in patients with relapsed or refractory DLBCL. Supplemental to this, we are also close to treating the first patient in our MIND weight trial, a study that is investigating an optimized treatment schedule with a reduced number of administration for patients with non-Hodgkin's lymphoma. We also have two mid-stage assets: CPI-0209, our EZH2 inhibitor is in clinical development for oncology; and transatumab, our anti-CD38 antibody is in clinical development for autoimmune indications. In the second half of this year, we expect data readouts from both assets. Finally, we expect some of our partners to release data and programs - clinical programs this year. First, in the fourth quarter of this year, Roche is planning to announce data from the two pivotal graduate studies with gantenerumab in Alzheimer's disease. Also, this year, we expect GSK to share data from its Phase 3 study of otilimab in rheumatoid arthritis. Novartis recently shared plans to advance ianalumab, an antibody directed against the BAFF receptor into pivotal studies this year, exploring it as a treatment for Sjogren's syndrome and lupus nephritis. And lastly, Ultragenyx and Mereo are investigating setrusumab in a Phase 2/3 clinical study for the treatment of osteogenesis imperfecta, a genetic bone disorder also known as brittle bone disease. So over the next several years, we expect to deliver a steady flow of clinical data. As Joe stated earlier, Monjuvi sales were $18.7 million in the first quarter of 2022, reflecting year-over-year growth of 21%. On a sequential basis, sales declined by 21%, largely due to the inventory dynamics and clinical trial purchases that occurred in the fourth quarter of 2021, in addition to the effects of omicron on demand. We continue to be excited for the Monjuvi opportunity outside of the U.S., which our partner Incyte is responsible for. While it's early days in the launch there, we recorded EUR 0.7 million in royalty revenue for Monjuvi. Total revenues in the first quarter of 2022 were EUR 41.5 million, compared to EUR 47.2 million in the same period a year ago. Total cost of sales was EUR 7.9 million in the first quarter of 2022, compared to EUR 5 million a year ago. R&D expenses in the first quarter of 2022 were EUR 65 million, compared to EUR 33.3 million for the first quarter of 2021. Selling expenses decreased to EUR 21.9 million in the first quarter of 2022, compared to EUR 28.2 million for the same period in 2021. G&A expenses in the first quarter of 2022 were EUR 14.6 million, compared to EUR 10.3 million in the first quarter of 2021. For the first quarter of 2022, we reported a consolidated net loss of EUR 122.7 million, compared to a net loss of EUR 41.6 million in the first quarter of 2021. We ended the first quarter of 2022 with cash and investments of EUR 847 million, compared to EUR 977 million at the end of 2021. This amount is sufficient to take us through the collaborative pivotal data readout, which is anticipated in the first half of 2024. As a reminder, we also have access to development funding bonds from Royalty Pharma in the range of $150 million to $350 million. Your line is now open. And then also sort of related to that, in your guidance, so can you give us an idea of what the impact is of the Phase 3 trials. Again, I noticed early in the year, but given where you came in, I'm just trying to get a sense of - if there's any possibility that R&D actually won't come in below the range, and if that could have a positive impact on cash flow. Joe will take the first part of your question, and then Sung will answer your R&D. So as it relates to new patient starts, what we see is both one out of every two, one of every three patients are prescribed Monjuvi in the relapsed/refractory setting. So as we look to this year, it's still early days. But as our teams continue to have strong success with in-person engagements, and we're leveraging a large broad multichannel approach that deliver our message to support our uniquely differentiated profile as an outpatient immunotherapy of choice, we feel that we'll continue to make gradual increases in duration of treatment as the year goes along. And James, this is Sung, your question with respect to R&D expenses and the phasing of that for the remainder of the year. And if you just look at the year-over-year increase for Quarter 1, R&D expenses increased about 95%. Now with regard to the composition of our R&D expense, the majority, and this is well over 50%, probably closer to 60% of R&D expenses are for CRO-related expenses, clinical materials, everything that goes into running a Phase 3 pivotal studies. And then we also have some mid-stage studies ongoing as well, but the vast majority of our R&D expenses gear toward our development. Your line is now open. I guess a follow-up on the Monjuvi commercialization So you have a couple of positive factors, the high reorder rate, and the leading market share. And our focus is to continue to penetrate the market and continue to raise awareness and the understanding of using Monjuvi as a novel immunotherapy with this uniquely differentiated profile, so we can continue to increase the new number of patients to ensure that our key stakeholders and patients understand what to expect from their response and how to manage treatment so that patients can remain on therapy as long as appropriately possible. I guess, can you remind me how - what percentage of the target physicians you've marketed to so far is getting out of there or where you're seeing the physicians, I guess. Obviously, there's always opportunities to increase, but - and we continue to get out. And we are going to be excited to show where the data is currently at, and we will share updates on both studies toward the end of the year. Your line is now open. So the first one is that, I mean, Q4 last year, there were some positives like inventory effect on Monjuvi. With regard to the impact of the inventory buy-in and clinical trials that happened in Quarter 4 to Quarter 1, it was within our range of expectations in terms of the sequential decline, and we communicated that as such. So if you look at the overall decline in absolute dollars, we're down $4.9 million quarter over quarter, and $3 million of that is related to the inventory swing as a result of the buy-in Q4. But it's safe to assume that similar to last year, we do expect the second half to be proportionately larger than the first half. The academics are important, and we continue to see good support with the academics representing almost 30% of our sites of care. As we mentioned in the past, Monjuvi does have a uniquely differentiated profile as the outpatient immunotherapy choice for those patients in the relapse refractory study. Your line is now open. Thanks for taking my question. First of all, I think we are happy to say that we do not see any impact on the ongoing studies, frontline, and in mind because they do not have a PI3K kinase inhibitor. But I think it's clear that for the PI3 kinase delta development situation, FDA's opinion did have some impact, and it's clear that the bar has gone up. So recall the announcement that we made at the start of the year where we did have a consolidation of our research organization where that's all consolidated in Planegg, Germany now. Your line is now open. Thanks for taking my question. As Sung mentioned before, as we move forward, we continue to focus on penetrating more accounts and broadening the utility of Monjuvi. Your line is now open. I think, Zane, I heard you ask - the first part of the question is the potential of any further COVID outbreaks and the impact to our guidance. And going back to the comment that Joe made, while we do expect gradual sequential increases, in the second half we would expect that to be the growth there to be outsized relative to the first half. And then I think you had a question on peak sales, if I heard correctly, with regard to Monjuvi. It's our goal to achieve that $500 million to $750 million range, albeit with the start that we've had, with two COVID headwinds in two consecutive years, it's safe to assume we're probably trending toward the bottom end of that peak range and also the peak has been pushed out years. Your line is now open. So we do have data from the first six months of last year, last six months of last year, and we're collecting the data from this year. But - and we continue to work at extending the duration of treatment by managing expectations, and we fully expect that that will increase as the year goes on. I believe we reported at the last call that we've got now over 2,000 patients that have been prescribed Monjuvi since launch. So we continue to penetrate and get strong new patient starts, and that's reflected in our leading market share. So the great news here is that it's possible - it's possible that in - actually in the real life in the market, we can produce what we have seen in our L-MIND study. It's a question, as Joe articulated and as we said earlier, - it's a question of educating on the opportunity to treat longer, to leverage the strength of our immunotherapy regimen. And we're focused on, as I said, the uptake of Monjuvi increasing the number of sites of care in terms of penetration and extending the duration of therapy."
}