{
    "symbol": "KE",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-07 16:24:17",
    "content": " Net sales in Q2 were $437 million, a 39% increase compared to the same period last year and 8% better than Q1, which was previously our best quarter. Turning now to the medical vertical market, net sales were $125 million, a 39% increase compared to Q2 of last year and 29% of total company sales. Net sales in the industrial vertical market totaled $105 million, a 27% increase over the recasted second quarter of last year and 24% of total company sales. As Don highlighted, net sales in the second quarter were $437 million, a 39% increase over Q2 last year and an all-time record high for the company. The growth margin rate in Q2 was 7.8%, a 120 basis point improvement compared to the second quarter of fiscal 2022, with our record sales volume driving operating leverage versus a year ago, when production was more significantly constrained by part shortages. Adjusted operating income for the second quarter was $17.8 million, or 4.1% of net sales, which compares to last year's Q2 adjusted results of $7.3 million, or 2.3% of net sales. Adjusted net income in the second quarter of fiscal 2023 was $11 million or $0.44 per diluted share, compared to adjusted net income in Q2 last year, a $5.1 million or $0.20 per diluted share. As Don noted earlier, we are raising our guidance for net sales in fiscal 2023 and expect full year results to be in the range of $1.7 billion to $1.8 billion, a 26% to 33% increase year-over-year. In terms of what our customers are seeing, obviously we turned up the robustness on our sales and operations planning, just to make sure that we understand how they see 2023 calendar year forming up for their business, and that's a key part of how we then set our business, not only capacity, but how we drive demand onto our suppliers, and I would say that there is some caution that's factoring into the updated forecast that we're getting from our customers, I think itâ\u0080\u0099s prudent. Please go ahead, your line is now open. Please go ahead, your line is now open."
}