{
    "symbol": "KE",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-11 09:42:05",
    "content": " For the third consecutive quarter, net sales surged to a record-breaking level setting another all-time high for our company, and operating margin improved compared to the same period last year. We expect sequential quarterly increases in a stair-stepped fiscal year 2023, and we are affirming our guidance for the full year with the results expected at the high end of the range for sales and operating margin. For the first quarter, net sales were $406 million, a 39% increase compared to Q1 last year and 9% better than Q4. Net sales in Medical were $115 million, a 35% increase compared to Q1 last year and 28% of total company sales. Net sales in our industrial vertical totaled $101 million, a 35% increase over the recasted first quarter of last year and 25% of total company sales. As Don highlighted, total net sales in the first quarter were $406 million, a 39% increase over Q1 last year and an all-time record high for our company. The gross margin rate in Q1 was 7.2%, a 190 basis point improvement compared to the first quarter of fiscal 2022, with our record sales driving a higher level of absorption this year versus a year ago when production was more significantly curtailed by part shortages. Adjusted operating income for the first quarter was $13.3 million or 3.3% of net sales, which compares to last year's Q1 adjusted results of $3.3 million or 1.1% of net sales. As Don noted, we are affirming our guidance for fiscal year 2023 and expect full year results to be at the high end of the range, with net sales of $1.6 billion to $1.7 billion, a 19% to 26% increase year-over-year. We're forecasting sequential quarterly increases for the balance of fiscal 2023 with emphasis on aligning production forecast with material availability and manufacturing capacity, increasing cash flow through inventory management and driving additional and sustainable operating leverage at even higher levels of revenue in a quarter."
}