{
    "symbol": "PL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-31 22:57:05",
    "content": " For the fiscal year ending January 31st, 2023, we expect revenue between $170 million and $190 million, representing 30% to 45% year-over-year growth, up from 16% in the year just completed, a significant acceleration as we invest behind key initiatives and grow our market share. Our adjusted EBITDA loss is expected to be between $50 million and $75 million as we continue to scale our global sales organization, increased software investments to accelerate the build out of our Earth Data platform, develop our next generation satellites, as well as make the required investments in G&A to support our operations as a public company. No, I mean, obviously, slide 18, we tried to highlight a lot of these metrics, because I think it should be fun for employees as well, to just see how the work that they're doing, whether that's the software teams building some of these new tools, or the customer success teams that are driving that early time to value for customers, how that has real impact on our business. So, we are taking up our investments in software, we are investing in our Pelican program, which is the next generation high res as well as some of the improvements across all of our fleets to improve the time to market -- or sorry, the time to value for our customers and increase the analytical capacity to expand into some of the new markets we talked about, like finance and insurance. And that's because we're seeing this demand across the board, from current customers expanding, new customers in current vertical markets, even new vertical markets, as I mentioned, a couple of examples. In terms of the pipeline, I'd say that, as I believe I mentioned in the prepared remarks, we're seeing really strong growth in some of these newer markets, which is why we're leaning into some of these software investments that we've talked about, is seeing that growth and pipeline in finance and insurance."
}