{
    "symbol": "RGA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 15:04:03",
    "content": " RGA reported pretax adjusted operating income of $245 million for the quarter and adjusted operating earnings per share of $2.99, which includes the COVID-19 impact of $0.78 per share and a foreign currency headwind of $0.22 per share. Turning to the quarterly segment results, starting on Slide 7 in our earnings presentation that can be found on RGA's Investor Relations website, the U.S. and Latin America Traditional segment results reflected both unfavorable Individual Mortality experience and COVID-19 claims that totaled approximately $48 million. Turning to our Asia Pacific Traditional Business, Asia results reflected favorable underwriting experience across the region, absorbing COVID-19 claim cost of $13 million. The Corporate and Other segment reported a pretax adjusted operating loss of $89 million, higher than our expected quarterly range due to higher general expenses and some elevated financing costs. Individual Mortality business, estimated COVID-19 claim costs of $44 million, which is $13 million per 10,000 general population deaths was at the lower end of our rule of thumb range. And right now, the pipeline looks very active around our different geographies and I think if you look back historically, it's â\u0080\u0093we've pulled all the different levers between capital deployment into the transactions, the share buybacks and dividends and I think you'll see us continue that going forward, but we do intend to be active to the extent there are not attractive transactions to deploy the capital, we will look to bring down that excess capital level over time through share repurchases and the dividend level. I would say that going forward, as our business grows and as we mentioned, there is some elevated of financing expenses, including interest expense, we do expect the corporate loss average run rate to increase and for now, the size that I would say going forward, I would expect it to be more in the average quarterly loss rate to be more in the range of, call it, $30 million to $40 million and we can revisit that as we go forward. I think in the past, you've talked about a $60 million to $65 million or so expected quarterly earnings range for the U.S. asset-intensive business. You've mentioned in the past that quarterly results should be smoother under LDTI accounting, so is this an example of a quarter where under LDTI, you wouldn't have seen this material decline in the U.S. traditional earnings since the variance in actual versus expected mortality doesn't affect your future assumptions for claims?"
}