{
    "symbol": "HBAN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-21 10:10:27",
    "content": " Loan growth continued to be broad-based and combined with the benefit from higher interest rates, net interest income again expanded at a double-digit rate from the prior quarter and fee income also expanded sequentially. We now expect core net interest income on a dollar basis, excluding PPP and purchase accounting accretion to be up in the high 20s to low 30s percentage growth rate for the fourth quarter on a year-over-year basis. Please proceed with your question. I think, in terms of loan growth, we continue to see quite a bit of momentum as we discussed in the prepared remarks, even as we're taking opportunities here in the fourth quarter to optimize where we're driving that incremental production for higher capital returns. As it relates to hedging, we â\u0080\u0093 sort of taking a step back, we purposely took a series of actions in 2021 as we discussed to increase the asset sensitivity of the business, and to benefit from higher rates that really or through over the course of the last several quarters, just in Q2 and Q3 of this year, 55 basis points of total core NIM expansion and there's more opportunity ahead. Please proceed with your question. Please proceed with your question. Please proceed with your question. I expect that we'll continue to see rising yields out of the securities portfolio, partly as a function of that just continued reduction in premium amort, the hedge portfolio should continue to benefit us as well as the rate curve has ticked up just a bit incrementally from the end of the third quarter here and new money yields are pretty attractive relative to existing portfolio yield. Please proceed with your question. Please proceed with your question. Please proceed with your question. I expect that to continue into the fourth quarter before that -- the surge balance, a downdraft sort of start to wane and the underlying growth that we're seeing in that core activity within consumer start to come to the fore."
}