{
    "symbol": "STRM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-15 13:06:05",
    "content": " Beginning with the financial overview as of October 31, 2022, bookings for the 9 months ended October 31, 2022 totaled $15.9 million, $14.1 million of which was attributable to our SaaS products. As a reminder, we estimated we would average $3 million to $5 million of TCV per quarter in fiscal 2022. However, we successfully grew total revenue 13% to $6.2 million during the third quarter and our SaaS revenues were up 14% or $0.4 million. As of October 31, booked SaaS ACV was $14.9 million as compared to $10.3 million as of January 31, 2022. And as of November 30, 2022, our total booked SaaS ACV was $15.9 million. Finally, on November 29, 2022, we expanded our relationship with Bridge Bank to allow access to an additional liquidity through a $2 million non-formula line of credit. In addition, with the operational benefits from the alignment, we expect to realize a total $3 million of annualized cost savings, $1.5 million of which was executed on November 1 and the balance of which we expect to execute through the course of the next fiscal year. As Tee mentioned, we remain confident in our achievement of $17 million of booked SaaS ACV by the end of fiscal 2022 and expect to exit fiscal 2023 with $30 million of booked SaaS ACV. Total GAAP revenues for the third quarter of fiscal 2022 were $6.2 million, a 13% increase over the comparable period of last year. For the 9 months ended October 31, 2022, total GAAP revenue increased 60% to $18.1 million. During the third quarter of fiscal 2022, SaaS revenue grew $0.4 million or 14% compared to the third quarter of fiscal 2021. During the 9 months ended October 31, 2022, total SaaS revenues increased $3.8 million or 72% compared to the first 9 months of fiscal 2021. We have $4.5 million of annualized contract value that is unimplemented as of November 30, 2022. For the 9 months ended October 31, 2022, total operating expenses were $27.1 million as compared to $20 million during the prior year period. Adjusted EBITDA for the 9 months ended October 31, 2022 was a loss of $3.6 million compared to an adjusted EBITDA loss of $1.7 million for the 9 months ended October 31, 2021. Moving to the balance sheet, as of October 31, 2022, we had $11.7 million of cash on hand compared to $9.9 million at January 31, 2022. The first payment was made on November 22, 2022, subsequent to the end of the quarter and totaled approximately $5 million in total value. $500,000 is required in the second year following the close, which equates to $41,667 monthly, which began this quarter in the balance of our term loan as of October 31, 2022, was $9.8 million. Our booked SaaS ACV as of November 30, 2022, is $15.9 million and $4.5 million of that booked SaaS ACV has not been implemented. So today, we stand at $15.9 million of total booked SaaS ACV with $4.5 million of that unimplemented. And I think you also heard in my remarks, I think we will be fully implemented on that $17 million of booked SaaS ACV by Q2 or Q3 of 2023. I mean that implies that youâ\u0080\u0099re exiting next year, somewhere in that $5 million per quarter in SaaS revenues."
}