{
    "symbol": "STRM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-08 10:52:10",
    "content": " Beginning with the financial overview of second quarter 2022, we ended the quarter with $5.2 million in new bookings, $4.4 million of which were SaaS bookings, at the upper end of our $3 million to $5 million quarterly SaaS ACV goal. Bookings for the six months ended July 31, 2022 totaled $14 million, $12.5 million of which was attributable through our SaaS products. Total GAAP revenue for the second quarter of 2022 was $6 million, 109% increase from the second quarter of 2021. Second quarter 2022 adjusted EBITDA was a loss of $1.1 million, compared to an adjusted EBITDA loss of $800,000 in the second quarter of 2021. Total GAAP revenues for the second quarter of fiscal 2022 were $6 million, a 109% increase over the comparable period of last year. For the six months ended July 31, 2022, total GAAP revenue increased a 105% to $11.9 million, $5 million of the increase was attributable to the acquisition of Avelead. And for the six months ended July 31, 2022 SaaS GAAP revenue increased $3.5 million or approximately 139%. Total revenues for the second quarter of fiscal 2022 and year-to-date were $6 million and $11.9 million compared with pro forma revenues of $5.1 million and $10.5 million, respectively for the year-ago periods. Moving back to our GAAP numbers, second quarter 2022 operating expenses totaled $8.6 million compared to $5.2 million for the prior year period. For the six months ended July 31, 2022 total operating expenses were $17.8 million as compared to $10.7 million during the prior year period. Loss from continuing operations for the three months ended July, 31, 2022 was $3.3 million compared to loss from continuing operations of $100,000 for the three months ended July 31, 2021. Loss from continuing operations for the three months ended July 31 2022 included $49,000 of acquisition related cost and $425,000 related to evaluation adjustment on acquisition related liabilities. Loss from operations for the quarter ended July 31, 2021 included $2.3 million of income associated with the forgiveness of the company's PPP loan. For the six months ended July 31, 2022 loss from continuing operations was $6.1 million compared to a loss from continuing operations of $2.5 million for the six months ended July 31, 2021. Loss from continuing operations for the first half of fiscal 2022 included a $139,000 of acquisition related costs, while loss from continuing operations for the first half of 2021 included $0.8 million of acquisition related costs and $2.3 million of income associated with forgiveness of the company's PPP loan. Adjusted EBITDA for the second quarter of fiscal 2022 was a loss of $1.1 million compared to an adjusted EBITDA loss of $800,000 in the same quarter of fiscal 2021. So we're clearly seeing an expansion of new clients being layered into the business from all the recent contract win announcements and recurring revenue metric of 71% versus 84% a year ago, and it sounds like the investments into the eValuator commercial team are really driving a lot of this presumably with the existing relationships that the sales reps have, but I just wanted to get a sense of the magnitude of some of the other drivers, you talked a little bit about this, but I think you can talk more about other drivers, such as hospital referral there we've seeing that or even the rollout of your services to new facilities within growing hospital systems that are consolidating or even hospitals that have kind of in a holding pattern in your pipeline and are now kind of moving forward."
}