{
    "symbol": "AREC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 23:25:28",
    "content": " On that point, we've had early success in developing partnerships such as the ones we've established, with USA rare earth magnets, in establishing the first complete domestic lifecycle for rare earth magnet manufacturing here at the United States and recycled force with aggregating and pre-processing high value materials to be recycled, while also addressing the social needs to the individuals recycled force works with. With thermal coal prices selling above metal prices you're seeing met coal producers, which met coal represents about 15% of the world's production being sold into the thermal market entering into long term contracts, which ultimately means suppliers coming out of the Met market and moving into the thermal market. With the issuance of two non-dilutive capital sources, we're excited to showcase how we will position this complex to be the first of its kind, advancing carbon and RE processing facilities by combining the premium mid volume met carbon production, and the unique rare earth capture and process technology on site fully integrated. Let's talk a little bit about our ReElement division and expand upon Mark's recent comments I firmly believe as the first commercial producer of isolated and purified critical and rare earth elements in the United States market, that we are extremely well-positioned to capitalize on the growth that we see coming online in 2024, and 2025, as well as 2023 on the rare earth element side. That being said these federal initiatives hit right at the heart of what we're doing at ReElement and the fact that we've already proven our process and our technology on a commercial scale puts us in a great position to be the value added domestic supplier of sustainable critical minerals to the EV and clean energy sectors, as well as the DOD. Please proceed with your question. That provides significant working capital and development capital to fully ramp up not only the mining operations, but also the electrolysis technology, which will tie into the back end of our processing plant and utilize that what that processes the slurries, the waste material coming out of the prep plant to capture the rare earth elements, and that's producing concentrate, which will then feed our chromatography technology. Please proceed with your question. Please proceed with your question. Please proceed with your question. And so we're the beneficiaries of that capital, but also the mines that can feed that complex like 15A and 17, to Carnegie 3, there's a rapid amount, there's a vast amount of opportunity and growth at the McCoy complex to ramp up to, I mean, internally, our target is around 2 million tons a year that we can ramp them up quite complex up to it and current market, that's a phenomenal number. We've done, we brought all the internal leaching in house since last time, you've seen the facility it was obviously quite different need to get you back to Indiana, when you're around the region, because it's looks completely different than when you saw it last with the battery drain in there with the full leaching and house at scale now. Please proceed with your question. And so it's I mean, we're one of the only people in this space, the unique thing about our business having the ability to produce both rare earth elements and battery elements using cryptographic separation is the opportunity to fully leverage the platform. Please proceed with your question."
}