{
    "symbol": "AREC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 02:02:03",
    "content": " As such, we feel we hold a significant value-add position with our ability to economically refine and recycle material as battery chemistry has evolved within the energy storage space as well as define our value-add and competitive advantage beyond just the production of black mass or black sand within the battery recycling market, while not having to try to make conventional high cost refining methods similar to those used in China work here domestically. We have made substantial investment into our complexes to position them for one, low-cost production, but two, long-term production, including some investments we made in the fourth quarter, which resulted in substantial downtime of expanding the mines and positioning the mines and then also in the first quarter of setting up the mines for the long-term growth, including adding the second section at Carnegie 2 which will be talked about here going forward as well. With the issuance of two non-dilutive capital sources, we are excited to showcase how we positioned the complex to be the first of its kind advanced carbon and rare earth processing facility by combining premium mid-vol met carbon production with unique rare earth capture process technology, utilizing electrolysis onsite to treat your water and your waste material coming off your plant, and then further capturing and monetizing byproducts that are coming off of that is the first of its kind and a unique structure that a low cost structure by utilizing the processing capacity to generate the rare earth elements. And given that unique technology has enabled us to enter into numerous partnerships and MOUs and conversations within the African environment, one of the most resource richest nations, accessing the ports where we are currently in discussions of building and refining facilities on the West Coast of Africa as well as on the East Coast of Africa to be able to access the lithium reserves and the current lithium production that is being exported in raw form bringing that value set to the African community bringing in partners within the African community that are on a world stage in terms of their knowledge as well as their experience. We have also commenced several pilot programs to recycle these critical minerals from feedstocks such as consumer power tools, wind turbines, black mass producers, battery manufacturers as well as industrial battery sources on energy storage platforms, which is predominantly LFP chemistries, which would not have been very challenging to recycle using traditional legacy technologies very cost effectively to recycle utilizing our technology. We will continue to add top talent, interviewing top talent daily from within the industry as well as outside the industry and bringing them in from a technical perspective, which we believe will have the worldâ\u0080\u0099s best chromatography experts and team behind our ReElement division, whether itâ\u0080\u0099s with university partners at Purdue as well as engineering teams and longstanding success developing the technology and operating such as Eli Lilly and Dr. Yi Bing, thatâ\u0080\u0099s joined our team internally as well as our Chief Commercial Officer who joined us recently has done a phenomenal job, Chris Moorman. As we have continued to expand our business and to keep ReElement as a pure-play refining division, we are in the process of developing American Metals into a world-class shredding operation, the ability to not only shred end-of-life batteries very efficiently and safely and working with the leading industry partner to help ensure that we are the standard for battery shredding in a safe way to reduce the combustible events that take place in the battery shredding as well as being able to shred magnets and shred the products that magnets come with it. The ability to do that within American Metals will enable us to keep ReElement as a pure-play refiner, which will not compete against our other customer bases that provide us end-of-life products already today, but also enable us to capitalize on the ability to take both not only magnets and batteries from our partners that want us to recycle these materials to get them back into the circular economy. We believe we are well-positioned to capitalize on opportunities as they come to us to monetize assets and bring assets online in cost effective ways as we continue to expand the McCoy complex, which ultimately will generate the cash flow to continue to support the business as a whole in its entirety in a very profitable way as well as our Wyoming County Complex, which is probably one of the most attractive virgin opportunities in the market today. And thankfully we are â\u0080\u0093 we own and possess not only the newest, but also the largest processing capacity in that region, I think thereâ\u0080\u0099s going to be some pretty significant growth for our business, not only the existing production that we have coming out of the mines right now, which is good, very good. And thatâ\u0080\u0099s why our technology, the flexibility of our technology fits really well within and solves those constraints in the supply chain, because we can navigate it, we can co locate abroad where we can add value of producing purified resources, as well as growing congruently with the market on the recycling side, where we donâ\u0080\u0099t have to make massive CapEx that hope that the supplies â\u0080\u0093 those feedstock supplies pick up, or if there is a big chasm there between deploying that capacity and not having the feedstocks to feed it, which is going to â\u0080\u0093 which we think will probably cause a problem in the recycling space as other refining methods attempt to be deployed, if that makes sense."
}