{
    "symbol": "AREC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 19:36:27",
    "content": " And that's something that our team is actively looking at, given where the strength of the operations are and the production growth that we're seeing out of the McCoy Elkhorn Complex and the stability of the operations is that we have to look hard -- we have to work really hard at that of looking at putting in place a stock buyback program soon. It's going to get -- I think the market is going to get extremely volatile and I think there's a huge amount of upside potential in carbon prices in general over the next year or two years, given the tightness of supply and the lack of capital being invested in the space because, ultimately traditional bank financing has gone. But from our shareholders' perspective, it's a cash flow machine at this point, and we're excited to help them anyway they can to get up and running, but they have trains scheduled in September and we're excited about the development and the progress that they've made, and the way that they've navigated this market to get these facilities in a position to start generating revenue and scaling that revenue pretty aggressively, which is great for us. Magnets make sense and then establishing partnerships, including the one I was visiting earlier today, a phenomenal company on the preprocessing side for our magnet production train that we're developing a really solid relationship with, which is -- I mean, it's just a good win for everybody. But -- if you look at the value of it, it's innovative technology, low-cost feedstock in a hugely growing market where carbon nanostructures are highly valuable to concrete additive, asphalt additives, new energy applications, graphene batteries. But we've signed -- I mean, even on the sublicense we did with Kanai, they've already signed a $2.7 million deal I believe it was the Air Force for concrete additives and developing the technology for concrete additive for think about forward operating bases when you need to land plans on concrete, you need really strong countries to land these type of planes with the takeoff and velocity that they're landing at and power that they have."
}