{
    "symbol": "CNP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 11:21:09",
    "content": " 05:02 We continued working with our customers to identify their needs for increased safety, reliability and clean, sustainable investments, including Houston's master energy plan called Resiliency Now, which is helping us to determine further capital planning decisions and we will have more to say on that in future quarters. Our 10-year plan is still currently expected to be $40 billion plus of investments to support the safety, resiliency and growth across our system to benefit our customers. 07:08 In the first quarter of 2022, we invested approximately $1 billion, including the mobile generation leases and are now tracking slightly ahead of our capital plan for the full year. 07:43 As we execute on the capital investment plan we outlined, we also continue to work closely with our customers to serve their needs, including safety, increased system resiliency and growth to drive further incremental capital investments that are not currently in the $19.3 billion. 14:14 So in summary, before I turn the call over to Jason, we are meeting our customers' growing needs across our system due to both organic growth and by upgrading the current system safety and resiliency needs, which we expect will likely lead to incremental capital above our $40 billion plus over the course of our 10-year plan. 26:48 We have now utilized $1.8 billion of the combined LDC and Energy Transfer proceeds to reduce debt, including the $1.2 billion discussed on last quarter's call, as well as paying down CenterPoint parent level debt including $600 million of high coupon senior notes this quarter. We currently expect that this process will result in a one-time cash tax benefit approximately $300 million in 2022 and at least an incremental $25 million annually in future years, which over the five-year period would equate to at least $400 million of capital that we can redeploy into our business for the benefit of our customers and our shareholders. Your line is open. I think if you set a track all the way back to our Analyst Day and what we've talked about since then the proceeds of the enabled transaction, the original LDC sales when matched up against our $40 billion plus plan, don't really require us to go into the market for any equity, which is a sort of a north -- a North Star for us right now and nor does it require us divesting of any LDC, so we have sufficient cash flow to meet this plan. Your line is open. And then increase the overall plan by about $100 million really that increase relates to routine work and our gas and electric businesses that we have the luxury to pull-forward because as mentioned in our prepared remarks, we have an efficient way to fund that for our shareholders, in terms of higher incremental proceeds from the tax repairs deduction, as well as higher incremental proceeds from the securitization that's anticipated in Indiana. Your line is open. Your line is open. This is discrete work that we had planned in 2023, moving forward to 2022 and then plan, the incremental $100 million over the five years is really a component of that $1 billion of capital that we hold in reserve to make sure that we have the opportunity to fold in when we can efficiently execute and fund that works. Your line is open. So if we did nothing else, I think you would see that 62% creep up over the five and 10-year plan that we have clearly as we've indicated, if we find a big slug of incremental capital to invest in that generally is going to be focused on the electric side. Your line is open."
}