{
    "symbol": "CNP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 14:02:06",
    "content": " We are also reiterating full year 2022 non-GAAP EPS guidance of $1.37 per share to $1.39 per share, which represents a 9% growth rate at the midpoint versus the comparable 2021 non-GAAP utility EPS of $1.27. For reasons to be discussed next, at this time, we are now only incorporating $2.3 billion of this additional $5.3 billion in capital into the balance of our existing 10-year investment plan through 2030. The initial $2.3 billion in capital now being added to our investment plan reflects the subset of opportunities, we believe we can currently and confidently execute efficiently and is comprised of the following, $1.6 billion to $1.8 billion of this new capital will be dedicated toward our distribution system resiliency, reliability and expanded grid modernization. Furthermore, the $3 billion in additional future capital spend I mentioned earlier, does not fully include the potential impact of increased or accelerated EV adoption. As I stated today, we are only including $2.3 billion of investments in our updated capital plan, which we believe we have the crews and materials can efficiently finance, while remaining focused on overall affordability, at the same time, customers are facing rising energy costs. As a result of customer driven initiatives, we have identified $2.3 billion of new capital and $3 billion of future capital to increase resiliency, grid modernization, as well as to facilitate expanded electrification that will drive additional potential earnings power. As Dave mentioned, we are initiating non-GAAP EPS guidance of $1.48 to $1.50 for 2023, which represents 8% growth over the midpoint of our previously increased 2022 non-GAAP EPS guidance of $1.37 to $1.39. Through the third quarter, we spent $3.2 billion, which represents nearly 70% of the updated current year $4.6 billion capital plan target. As Dave already touched upon, we are updating our capital investment plan to include an incremental $2.3 billion of customer driven capital, which now totals nearly $43 billion of capital to be deployed through 2030."
}