{
    "symbol": "CNP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 14:23:06",
    "content": " Our 10-year plan is still currently expected to be $40 billion plus in investments to support the safety, resiliency and growth across our system to benefit our customers. We raised our 2022 non-GAAP EPS guidance to $1.37 to $1.39, a 9% growth over 2021 and from that increased number project to grow at 8% annually in 2023 and 2024, and at the mid-to-high end of 6% to 8% annually thereafter through 2030, an industry leading growth rate. As Dave mentioned, we are raising our full year 2022 guidance range to $1.37 to $1.39 of non-GAAP EPS, which reflects 9% growth over the comparable $1.27 and non-GAAP EPS results for 2021 when using the midpoint of this new range. Beyond 2022 and from our new and higher $1.37 to $1.39 baseline, we continued to expect to grow non-GAAP EPS 8% each year for 2023 and 2024, and at the mid to high point of 6% to 8% annually through 2030. Your line is open. We clearly have the organic growth that we highlighted, the jobs growth 2%, residential growth quarter-over-quarter, certainly weather is helping us at this point in time and helping us really because the margin we are getting from that will allow them to pull O&M forward from 2023 to benefit our customers in 2022. Your line is open. Your line is open. Your line is open. I think to put it in context, if you remember back to our discussions last year where we did reduce our O&M 1% year-over-year, even though we brought forward $20 million plus of O&M from 2022 into 2021, basically to attack things like vegetation management and opportunities like that. And we really are sort of in a rinse and repeat year here in 2022 taking advantage of the margin that the hotter weather has provided us to pull some O&M forward from 2023 to 2022 to address the very exact issues that we have talked about, more vegetation management and really spending that money for the benefit of our customers, while still being able to reduce O&M 1% to 2% over the 10-year average that we have. Your line is open. I think another way to think about it is the stat that we gave at our last Analyst Day where it could be another 1% organic growth driver on top of the 2% organic growth we have at this point in time, which really would be sort of extraordinary baseline growth in your organization all point into why for the benefit of our customers. Your line is open."
}