{
    "symbol": "TAK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 14:09:05",
    "content": " This growth continued to be driven by Takeda's 14 global brands with underlying growth of 12% year-to-date, which we expect to rise to the mid-teens for full year results. Based on the strong third quarter result, we are upgrading our full fiscal year 2021 forecast for revenue, reported and core operating profits reported on core EPS and free cash flow. Our strong margins will continue to drive important cash flow, which allow us to invest in our growth drivers, while also paying down debt towards our target of  , net debt to adjusted EBITDA by the end of fiscal year 2023. We also continue to generate robust free cash flow with ¥671.3 billion year-to-date, and opportunities in unlocking working capital have enabled us to raise our full year target to ¥700 billion to ¥800 billion. Q3 year-to-date reported revenue was almost ¥2.7 trillion up 11% versus the prior year, benefiting from ¥133 billion booked as revenue from the sale of our Japan diabetes portfolio in quarter one. Operating cash flow was ¥747.5 billion up 22.6% versus prior year, while free cash flow was ¥671.3 billion a reduction of 6.4% due to higher non-core asset sales in the previous year. Reported revenue for Q3 year-to-date grew at 11% almost ¥2.7 trillion, including ¥133 billion or 5.5 percentage point benefit from the sale of the Japan diabetes portfolio. In total, these products generated over ¥1 trillion or U.S.$9.3 billion of revenue year-to-date, with growth of 12% on an underlying basis. To highlight a couple of brands in particular, ENTYVIO performance remained strong as our number one product, with ¥395 billion in sales a year-to-date and underlying growth of 17%. Slide 20 emphasizes the momentum of these 40 global brands as they delivered 12% underlying growth year-to-date, and remained on track towards full year guidance of mid teen growth. As shown on the previous slides, we paid off approximately $5.5 billion of debt in the first nine months of the year, including all remaining debt during fiscal year 2021 as well as prepayments for fiscal year 22 and fiscal year 25 maturities. Furthermore, our abundant cash flow enables us to call additional U.S.$1.5 billion of debt maturing in fiscal year 2023, which we expect to pay in March. On margins and profitability, our year-to-date core operating profit was ¥757.9 billion and when we're raising full year forecast to ¥970 billion, our year-to-date underlying core operating profit margin is 29.4% in line with our projections for the full year."
}