{
    "symbol": "AZRE",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-31 14:24:03",
    "content": "  Operator: Ladies and gentlemen, good day, and welcome to the Azure Power Fiscal First Quarter 2022 Earnings Conference Call. As a reminder, all participant lines will be in the listen-only mode and there will be an opportunity for you to ask questions after the presentation concludes. I now hand the conference over to Mr. Vikas Bansal, Head, Investor Relations at Azure Power. And good morning everyone, and thank you for joining us. On Monday evening, the company issued a press release announcing results for the first quarter fiscal 2022 ended June 30, 2021. With me today are Ranjit Gupta, CEO; Murali Subramanian, COO; and Pawan Kumar Agrawal, CFO. Ranjit will start the call by going through recent key highlights; Murali will then follow up with an update on our projects under construction, technological innovation and an industry update. After this, we will open up the call for questions. Please note, our Safe Harbor statements are contained within our press release, presentation materials and available on our website. Also contained in our press release, presentation materials and annual report are certain non-GAAP measures that we reconciled to the most comparable GAAP measures, and these reconciliations are also available on our website in the press release and presentation materials and annual report. Thank you, Vikas, and a very good morning, everyone. At Azure we have stood by our employees and stakeholders in this fight against the pandemic through several initiatives focussed on supplementing medical supplies, tracking the health and wellbeing of team members and their families, organizing awareness and mental wellness talks, and providing whatever support was needed by team members. Moving on, I’m happy to report that we became signatory  through human global compact this quarter. We have fully aligned ourselves to the strength and flows  on human rights, labor, environment and anti-corruption. Our ESG risk score by Sustainalytics has further improved, and Sustainalytics now puts us in the low risk category, compared to medium risk category. MSCI, the leading ESG rating agency, rated Azure Power as AA, which places us in the top quartile of all global utilities they cover and probably the highest amongst our peers in the country. We also recently retired verified carbon unit VCU to offset our scope 1 and 2 emissions of 2019, 2020. IFC and IFC GIF, which have been long-time supporters of Azure since our early days and has a major role to play in our journey recently sold their entire balance 19.4% stake in the company to almost one of the largest Canadian pension funds with net assets of over C$100 billion. We also recently paid our third green bonds in the debt capital markets, primarily to retire our first green bond. Continuing with that, we participated in a few auctions in last couple of months and have won some capacity for which we are awaiting federal  law. We firmly believe that as the industry moves towards providing dispatchable renewable energy to the grid, wind and storage will be two important technology additions we have to plan for our portfolio. On the 4 gigawatts project, for which we have a Letter of Award from SECI but are yet to sign Power Purchase agreements. Despite the pandemic, power demand recovery in India has clearly bounced back, with peak demand dropping 200 gigawatts last month. Today, we have 23% more megawatts operating than we did at the same time last year, excluding the Rooftop portfolio. There has been an 11% year-on-year increase in EBITDA from operating assets, and a 12% increase in cash flow to equity from operating assets during the quarter period. India recently achieved 100 gigawatts of installed renewable energy capacity in the country, making it the fourth largest in the world. Honorable Prime Minister, at his Independence Day speech from the ramparts of Red Fort reiterated government’s mission of 450 gigawatts of renewable energy capacity by 2030. And more importantly, announced the path towards India's self-reliance in energy by 2047.i.e. In another significant positive development, a recent landmark judgment from the Appellate Tribunal for Electricity in the country allowed compensatory tariff for solar power curtailment in the state of Tamil Nadu. For the first time in India, the Appellate forum for electricity has laid down the law that the developer will have to be compensated on account of illegal curtailment even in the absence of a compensation clause with a power purchase agreement. With that, I would like to turn it over to Murali. As we last reported, the second -- the second wave of COVID at its peak, infected our projects under construction, not only disrupting the supply chain, but also impacting construction activity at several of our sites. Subsequently, however, both COVID and the supply situation have improved significantly. As of today, we have completed and commissioned 400 megawatts in our 600 megawatts Rajasthan 6 project and another 100 megawatts has also been completed and is now awaiting commissioning. Thanks to the MNREs notification granting extensions to all projects with commissioning due dates on or after first April 2021, we don't expect to incur any penalties for delays. Work in Assam, that has picked up after the initial COVID related delays again took a hit due to the second wave of COVID and inclement monsoon weather. Despite this, after the initial 25 megawatts, we have commissioned another 12.5 megawatt capacity in May. As Ranjit mentioned earlier, we received a AA rating from MSCI for ESG and our ESG risk score by sustainalytics has improved the low risk category. We highlighted our ISO 45001 certification earlier this year, which demonstrates Azure’s focus on occupational health and safety. Our carbon fee generation has avoided about 1 million tons of CO2 equivalent this quarter, bringing the total to 10.5 million tons equivalent since inception, we remain net carbon neutral. We have planned for planting 15,000 trees in the immediate vicinity of a 600 megawatt Rajasthan 6 project sites during this year. We also remain actively engaged with the communities where we operate and provide proactive support towards medical and health facilities, especially on the pandemic front. On the technology front, Azure continues to be an early adopter. And we have just started construction of another large scale project using bifacial tracker technology, where we expect yield in excess of 30% for our Rajasthan 9 projects. Looking at industry and regulatory updates on page seven, India's achievement of 100 gigawatts installed renewable energy capacity has been a big milestone, and the country continues to offer solid growth opportunities along with adequate confidence measures for investors in the sector. The Government of India announced recently details of the US $40 billion reforms linked package for distribution companies, which will improve the health of the financially weaker DISCOMs. It is also expected to help clear the backlog of PSAs that the power supply agreement to be executed with DISCOMs who have not been signing PSAs, which was accentuated by the second COVID wave and falling tariffs. The good news is that overall power demand in India has started to grow now, as the country emerges from the second wave. We continue to believe that we will be able to obtain the core gigawatt PPAs at value accretive tariffs, which would add to a contracted pipeline and provide returns about the cost of our capital. With that, I turn it over the button to Pawan to discuss the quarterly results. Turning to page 9, as of 30th June 2021, we were operating 2052 megawatts on our PPA or AC basis, which is 23% higher than what we were operating a year before. Our portfolio of 6,955 megawatts remained stable from the previous quarter. While this portfolio megawatt numbers excludes Rooftop portfolio, which is in the process of getting transferred to Radiance, our financials number continue to consolidate Rooftop till the transfer process is completed. On page 10, looking at the quarter, our revenues continue to increase as we construct more projects. After adjusting for stock compensation expenses, our EBITDA has been 50.7 million US or 14% higher against 13% increase in revenues from the same quarter in the prior year. Excluding non-cash items, the G&A was flat year-on-year. As you remain focused on controlling our costs, we continue to expect our FY 2022 cash G&A to rise about 10% from FY 2021 levels. As already said, we have recently issued a green bond of 414 million US at the lowest ever coupon in highest segment out of India. All our recent refinancing, both in the domestic as well as overseas markets have resulted in substantial savings in interest rates, thereby improving our equity return. Turning to stock compensation expenses, as the sales price rise, our stock compensation expenses will increase when trading out G&A. For first quarter of fiscal 2022, we had -- expenses of US$1.3 million. Just like the challenge in the past few quarters, our DSOs have been fairly consistent, at around 120 days on an average in the recent quarters. On page 12, you can see that EBITDA from operating assets increased about 11% year-on-year, and that cash flow to equity from operating assets rose about 12%. Net debt for operating assets was about $1.19 billion, and EBITDA for the last 12 months was about $182 million, resulting in net debt EBITDA ratio for operating assets of around 6.6x as of 13th June 2021. Finally, looking at page 13, providing balance sheet information. As a reminder, for those that are calculating our debt ratios, the hedging assets of $105.8 million included in other assets on our balance sheet should be netted against our total debt as this is directly linked to the foreign exchange hedges we have put in place related to our green bonds. During the second quarter, we have used parts of these assets related to our first green bonds to reduce the leverage on the green bond portfolio. With this, now I pass on to Ranjit to provide some commentary on our guidance. Even though we have just started on the recovery process from the second wave as of now, we would reiterate our numbers for the current system. For second quarter of 2022, we expect the revenue to be between INR 3600 and INR 3800 million and the PLF to be between 20.5% to 21.5%. With this, we will be happy to take questions. Thank you very much. Thank you very much. Hi, everyone this is Justin Clare on for Phil today. Hey Justin, thanks for the question. We are very, very happy that SECI has signed this 800 megawatts of PSA. So one third of 800 megawatts, which is our allocation, two thirds will go to our peers. So one third will come to us, the one third allocation of 800 megawatt PPA, there is nothing being negotiated or anything or anything of that sort. And, it's the question of today; tomorrow day after when they will invite us to sign the PPA is what we have been told. So SECI is going through their internal process for approval, and then they will invite us for the power purchase agreement. So then I wanted to understand, it sounded like you might have to take markdown on that PPA, or at least there was that possibility. Definitely, there is no negotiation going on whatsoever. So, Justin, whenever a PSAs signed, we expect to get one-third. Apart from the 800, there is another 1150 , which has been approved by the respective boards of the distribution company. And another 1000 megawatts, there are two other 500 megawatt distribution companies that SECI's in talks with where the initial approvals are being taken at the distribution company board. So those will take a little bit longer, maybe a few weeks. Thank you so much and congratulations, Ranjit. Thanks for the question, Puneet. So, as far as the manufacturing is concerned, right, there is a manufacturing contract agreement that needs to be signed with SECI. So, as soon as the manufacturing contract agreement is signed, then I think we have two years from that date to build the plant. So, once the manufacturing contract agreement is signed, then we will -- I guess, the order placement, et cetera will take place. And I would think that the investments will happen about a year or 15 months after the manufacturing contract agreement is signed, Puneet. So, this is the discussion that we are doing with SECI. So, we will have to see it. I am sure, it cannot be done for example, in 50 megawatt kind of boxes . So, we'll have to figure out what is the right size which we can actually set up. So, the SECI has also told us and we have also told SECI that let's get the PPA sign first and then we will discuss this. And therefore, SECI also understands that that it is going to help us if we do the manufacturing capacity. So, they are happy to discuss this first after getting the PPA signed. And my second question is, you said, even at INR2.61 minus maybe INR7.00, I'd say, it is still attractive enough. But when I look at the project costs, which you disclosed this time it was $0.02  on DC basis. Back in September 2019, it was about $0.46. So, it's unfortunate that the DC cost is being portrayed that they have been portrayed. And this number is actually an accounting number, given whatever as on March 31, what was capitalized in that book. On June 30, what is capitalized on a book, you take that two numbers divide that by the number of megawatts that have been commissioned, then you come out with the number. So that number doesn't fully reflect the cost of -- when the numbers are small -- when the commission numbers are small, it doesn't fully reflect the actual cost of the project. Because if you see the AC costs per megawatt in this quarter is $0.53, right. So, the AC costs and DC cost is almost the same. So, its just unfortunately, the way the accounting is done. You see, the thing that's happening is -- you can't just .do a like-for-like DC costs, because what constitutes a DC has also changed. Today, we are looking at monopod modules. So, the yield per megawatt has also gone up. But if the technology changes and the yield change, then there will be -- we have to account for this. The second thing, of course, is that -- as we all know, interest rates have dropped since what it was two years ago, but of course, that's a different discussion. So, the current project that is -- which is under commissioning, of which 400 is commissioned, 100 is ready, and another 100 is on the way. So, we would expect a PLF in the range of 29% to 30%. And then the next project, which is coming up with trackers and bifacial will be well north of 30%. And because its trackers, it would go up. And so that's why, just looking at the cost per watt may not be fully -- it probably wouldn't give the entire picture. Thank you so much. So, the interest cost of this bond that you've raised, is that -- actually the coupon is coming closer to 8% is less than 8%. And then, we -- as you speak refinancing projects and after it became majority and almost being dead. So in the process of refinancing, we're getting interest rates for our new refinancing at as low as 7.5%. Thank you so much. Thanks for taking the questions. So the first 60,000 megawatts tranche is likely to be at the INR2.61 status. The 1,000 megawatts or the 850 megawatts that I'm talking about are still that has -- we are told they have been approved by the respective boards of the distribution companies are at the INR2.61 mark. Because the solar plus wind hybrid which you won recently this month was signed at INR2.35, right? Once the first 3000 megawatts assigned, then SECI starts the process of marketing the next trend. Because I guess, the projects at that time, whatever is the solar tariff around at that time, let's say four or five months down the road. That's how SECI will look at, because that's what the distribution companies will ask . And when we do the new tranche, the second tranche, it will be reflective of the solar tariff around there. And maybe in terms of the timing here, I know that all of these signings or auctions of PSAs with the SECI, and it's obviously a lot when the government has to deal with this right now. So, Maheep, as far as the construction is concerned, right, as soon as close to 300 megawatts of the first tranche with the 800 megawatts we get one-third get signed, we will start the process of financial closer and so on. As I had mentioned in my last call, we have already started acquiring the land. So, we are in a very great position to start planning the product construction on the ground as soon as the power purchase agreements are signed. As you know, we have two years to build this project. So, that means that typically the equity requirements, it don't happen about nine to 12 months before the project is commissioned. So therefore, the equity need for us would come about a year from now, assuming that the power purchase agreement is signed this week. So, well before that, we should go out to the investors, to the shareholders, to the stakeholders and figure out how we want to raise the money. As far as the wind turbine module prices are concerned, wind turbines, sorry, wind turbine machines are concerns, the pricing is a little bit more stable. As far as the modules are concerned, we understand that they are heavily dependent on the cost of polysilicon. And at the moment, we are seeing some stabilization in polysilicon pricing. So, that is what we have -- that is what we have to go on. We are going to -- I mean, in India, most of the modules which are going to be procured over the next year or so, will be done through Indian manufacturers. And everybody seems that within a couple of quarters as the polysilicon manufacturing comes online, we will see a moderation in pricing. Actually just follow-up on that, if I may. And yes, and that's last one from me. So, I would like to pass on that, Maheep. Sorry, I got to take up that offline. Thanks for taking the questions. So when we built the 600 megawatt Rajasthan 6 project is located in Bikaner where the installation is the 2% or 3% lower than a couple of 100 kilometers west, where we are building our eight project. So over there, we dropped it from 1.5 to 1.4. The other parameter is of course, the cost of everything involved. And then, on your next question, which is on the bifacial side, yes, the module costs are a little bit more expensive. Sorry, I thought there was a question on thin film. So on First Solar, I think, let them come on. And at that time, depending on the market we'll take a view how that would sort of fit in. Should we think of that 1.3, 1.4 range as a better assumption beyond April 2022, when a good portion of what you're building is going to get affected by the safeguard duties? Because it's largely driven by the sites conditions and the yields and the cost of panel, bifacial, tracker, etcetera. If you go to the southern latitudes, say, in Karnataka or Tamil Nadu, you might still go with 1.5, because the overall radiation is a bit low. So the effective energy which is flipped, maybe a little lower. Although, I don't know how to model some of these things. But there is a phrase that's commonly used, the risks adjusted return. So what we do is in case of wind project, we -- the way we model the wind, we build in for the fact that wind can have certain more uncertainties compared to solar. Whereas in wind, the deviation can be a little higher. So to account for this additional deviation, the energy yield estimates are slightly lower. That's already factored in the EYA study, the yield assessment study. So once that is taken into account, the construction risks are fairly similar. In fact, solar, the land acquisition chances can be a little more because you need continues land. So therefore, once you account for the resource variability in wind, which is slightly higher than solar, then beyond that point, I would assume that the returns would be similar for solar or a wind a bit. Of course, this is for projects that are in the upper range, because they're using bifacial already from the cost profile. And unfortunately, over the last six to eight months, we have seen very significant rise in steel prices. So, if I didn't account for the increased increase in steel, then the incremental cost would have probably been in the range of $0.05 or $0.06, which steel probably be a center. Ladies and gentlemen, there are no further questions. On behalf of Azure Power, that concludes this conference. Thank you very much."
}