{
    "symbol": "AZRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-28 13:17:08",
    "content": " The biggest news for us since the last call has been signing off 2,333 megawatts of PPA, taking the total PPA, Power Purchase Agreement signed to 2,933 – 2,933 megawatts of the 4,000 megawatt SECI manufacturing capacity. 05:15 As we begin to implement these projects starting next fiscal, we reached out to our shareholders around end of this quarter to raise $250 million via our first Rights Offering, which is completed post quarter end. We continue to aggressively pursue digitalization and automation at our plants and construction sites, with large scale construction projects now operationalized, the next few years of growth firmly in hand with one of the largest and most value accretive pipelines in the industry and with the addition of new businesses in the form of energy transition, storage and green hydrogen, we truly think Azure is a top and compelling investment story. 16:07 On our Rooftop sale update, we have closed transfer of 64 megawatts circuit across 7 SPV’s subsequent to quarter end and are in the process of completing transfer of balanced 89 megawatt capacity, which is awaiting recruited approval and we expect to close by end of March 2022. Prime example is our largest project, Rajasthan 6 of 600 megawatt SECI project, which you fully refinance in just over a month of commissioning at the lowest interest rate for any projects in our portfolio at 7.2% per annum which will be fixed for these 32 months. 22:12 Our fourth quarter fiscal ‘22, we expect revenue to be between INR5.1 billion and INR5.2 billion or $68 million to $70 million at the exchange rate as on December 31m 2021 and the PLF to be between 22.5% and 23.5%. For our initial guidance for the next fiscal, as of now, we do not expect that we would commission incrementally megawatts in AC term by the end of March 31, 2023, while we expect revenues to be between INR22 billion and INR23 billion or $295.7 million to $309.2 million at the exchange rate as on December 31, 2021. There were some other capacities, Justin, which were yet to be signed up and I believe SECI is focusing on those first because our capacity there is about 300 odd megawatts, which has left to be signed up for November 23 commissioning whereas about 700 megawatts is left for commissioning in four fiscals now. 28:33 So that's a very important question, Justin and all along, right in the last two years and two and half years, we have been very conservative in our outlook and we have always said that we have the capability of doing between 800 to 1,200 megawatts a year and it was on the back of the fact that we had this large portfolio to commission and we were still struggling through that part because of COVID and everything else."
}