{
    "symbol": "AZRE",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-13 12:57:10",
    "content": "  Operator: Ladies and gentlemen, good day, and welcome to Azure Power's Second Quarter Fiscal 2022 Earnings Conference Call. As a reminder, all participant lines will be in the listen-only mode and there will be an opportunity for you to ask questions after the presentation concludes. I now hand the conference over to Mr. Vikas Bansal, Head, Investor Relations at Azure Power. Good morning, everyone, and thank you for joining us today. On Friday evening, the Company issued a press release announcing results for the second quarter of fiscal 2022 ended September 30, 2021. With me today are Ranjit Gupta, CEO; Murali Subramanian, COO; and Pawan Kumar Agrawal, CFO. Murali will then follow up with an update on our projects under construction, operational innovation and an industry update. Pawan will then provide an update on the quarter, and then we will wrap up the call with Ranjit providing quarter three fiscal year 2022 and fiscal year 2022 guidance. After this, we will open up the call for questions. Please note, our Safe Harbor statements are contained within our press release, presentation materials and available on our website. Also contained in our press release, presentation materials and annual report are certain non-GAAP measures that we reconcile to the most comparable GAAP measures, and these reconciliations are also available on our website, in the press release, presentation materials and annual report. Thank you, Vikas, and a very good morning, everyone. I'm happy to report that we have steadily transitioned some work from home to our office desks this quarter, while following COVID-appropriate protocols. Worldwide, we do see disruptions continue due to COVID and its variance, but hope that severity remains contained. On the ESG front, we have taken a number of significant steps this quarter towards improving our ESC standards. As part of this policy, any new vehicle that the Company purchases going forward for company used will only be electric vehicle. Further, we have adopted our Social Accountability Policy to enshrine socially acceptable and responsible practices in our workplace. Through our Social Accountability Policy, we have committed compliance to SA 8000 standard requirement for ourselves and our vendors. Beyond ESG, my most important business update is signing of 600 megawatts of power purchase agreements from the SECI manufacturing capacity of 4 gigawatts. We further understand that SECI has signed 7,000 megawatts of PSAs, power sale agreements, with the state of Andhra Pradesh, which will translate to another 2,333 megawatts of PPAs getting signed for Azure very soon. Given the work we've already done with land acquisition and securing transformation connectivity, we will strive to complete these projects before time. Apart from the SECI manufacturing PPA, we received Letter of Awards for 120-megawatt wind project and 150-megawatt wind-solar hybrid project with SECI subsequent to quarter end. These are first steps beyond solar for Azure, and we firmly believe that as the industry moves towards providing dispatchable renewable energy to the grid, wind and storage will be two important technology additions in our portfolio. We have already developed significant organizational capabilities for these in-house, and are looking forward to implementation on the ground with our teams already working on developing large wind sites across the country. Further, we are actively developing our capabilities in new operating areas for renewable energy, be it energy transition for corporates or new technologies like green hydrogen. On operational front, while Murali will talk in detail, I'm extremely proud of our procurement and construction teams given the challenges this year from COVID disruptions in the first quarter followed by volatile supplies and module pricing more recently. I also commend the stellar work done by the Capital team in raising the lowest cost Green Bond and refinancing older projects, driving down our cost of debt by almost 200 basis points in these projects. India recently announced 150 gigawatts of installed renewable energy capacity in the country, including hydro. These include: number one, increased non-fossil energy capacity target of 500 gigawatts by 2030; number two, to meet 50% of the country's energy requirement through renewable energy by 2030; number three, to reduce economy's carbon intensity down to 45% by 2030; number four, reduce 1 billion tons of carbon emissions from the total projected emissions by 2030; and number five, achieve net zero emissions by 2070. These announcements, along with India's goal of self-reliance in energy by 2047, i.e., 100th year of Indian independence, clearly demonstrate the vast growth opportunity this sector presents for Azure. We are looking at our addressable market size of approximately 40 gigawatts per annum going into this decade, considering India's target of 500 gigawatts by 2030. In consonance with this ambitious target, the government has recently taken a series of very significant reform measures to strengthen operating framework and boost investor confidence in the sector. After the landmark judgment from the Appellate Tribunal for Electricity allowing compensatory tariff for solar power curtailments in the state of Tamil Nadu, Ministry of Power recently brought a notification reinforcing Must Run status for RE power plants and allowing developers to sell unscheduled power due to curtailment because of technical constraints, directly on exchanges. Ministry of Power recently notified rooms that paved the way for overhauling of transmission system planning and provides for easier access to transmission network across the country, termed as General Network Access in the ISTS system. This provides flexibility to the states as well as the generating stations to acquire, hold and transfer transmission capacity as per their requirements. In addition, net zero and RE100 announcements by corporates is driving a resurgence in interest in energy transition through round-the-clock RE contracts. On our organizational update, as you all know, around the end of this quarter, Mr. Alan Rosling joined our Board as the new Chairman and replaced Mr. Barney Rush, who served as Director on the Board for six years, including last two years as Chairman. Mr. Rosling brings an inspiring mix of great leadership and hands-on industry experience himself, and we, at Azure management, are already deeply working with him in taking our company toward greater accomplishments together. With that, I would like to turn it over to Murali. As we last reported, the second wave of COVID impacted construction activities at our sites. Subsequently, however, both COVID and the supply situation improved significantly. As of today, we have completed and commissioned 500 megawatts out of 600 megawatts in our Rajasthan 6 project and balance 100 megawatts to be commissioned in this month. Even though construction work on the 300-megawatt Rajasthan 9 was impacted due to supply-related challenges, the team has rallied and we are confident that we will meet the promised time lines. As Ranjit mentioned earlier, we are extremely proud to adopt our EV policy this quarter, which provides a direction towards reducing our Scope 1 emissions. Further, to encourage adoption of electric vehicles at a personal level, we are providing interest cost subsidy to our staff. And together with our path towards electric vehicles, we hope to reduce that requirement in the coming years. I'm happy to report we have also recently won the Greentech Effective Safety Culture Award for 2021 from the Greentech Foundation and the OHS Award from Grow Care India in these areas, which signifies the efforts we have put in to ensure safety culture, which is now embedded across the project locations and sites. Further, we have also successfully completed the surveillance audits for our ISO 9001 and ISO 14001 certification, signifying our continuous focus and improvement on our quality and environment management systems. Our carbon regeneration has avoided about 0.9 million tons of CO2 equivalent this quarter, bringing the total to 11.5 million tons equivalent since inception. We are in the process of planting 30,000 trees in the immediate vicinity of our 600-megawatt Rajasthan 6 project this year. We also remain actively engaged with the communities where we operate and provide proactive support towards medical and health facilities, especially on the pandemic front. On the technology front, Azure continues to be an early adopter. We were among the first companies in India to install a large-scale project base on monoperc panels, and we are also constructing now a large-scale project using bifacial tracker technology, where we are expecting yields in excess of 30% for our Rajasthan 9 project. Further, on the operations side, all our projects are now fully connected with our central monitoring system, which has accessibility through the mobile application as well. We are gradually phasing out laptops at our sites and have provided tablets to our site engineers who are now always connected with the Head Office staff and monitor at a granular level, the performance of each of our plants on a real-time basis. Looking at industry and regulatory updates on Page 8, India's big announcement at COP26 and the fact that we recently reached 150 gigawatts installed renewable energy capacity continues to ensure a solid environment filled with growth opportunities in India. As we discussed during our previous call, we have recently developed organizational capabilities to implement our plans in wind and the hybrid space. Our recent wins in this regard, the 120-megawatt wind project and the 150-megawatt hybrid project, both with SECI, provides us an opportunity to kickstart this process of diversifying the portfolio and move in line with the industry, which is increasingly looking at dispatchable power as the sustainable way forward in Indian RE. We want to assure you again that we shall only bid for projects at commercially viable tariffs, one which provides returns above our cost of capital. With that, I will turn it over to Pawan to discuss the quarterly results. I'm happy to report that we have exceeded upper end of our revenue guidance for this quarter, with revenues, excluding rooftop at $56.9 million, against the guidance range of $49 million to $51.7 million. However, even after excluding this contribution, the revenue is at the upper end of the guidance. Significant developments during the quarter and in the period subsequent to the quarter end have assured all of us of the tremendous opportunities in the sector that we, at Azure, are well placed to leverage. Ours is a simple business that needs strong and impeccable execution, which we have been focusing at. With these projects in motion, I believe we have widened the road for our stakeholders on value accretion. As of September 30, 2021, we were operating 2,210 megawatts on a PPA or AC basis, which is 31% higher than what we were operating a year before. Our portfolio was stable at 6,955 megawatts at the end of quarter, which further increased to 7,255 megawatts subsequent to the quarter end with our recent wins. While these portfolio megawatt numbers exclude rooftop portfolio, which is in the process of getting transferred to Radiance, our financial numbers continue to consolidate rooftop, until the transfer process is completed. On Page 13, after adjusting primarily for stock compensation expense, our EBITDA has been $48.7 million or 29% higher against 25% increase in revenues for the same quarter in the previous year. On Page 13, our G&A increased by 6%, in line with our expectation we communicated earlier. On our recent refinancing, both domestic as well as overseas, have resulted in substantial savings and interest costs for us improving our equity returns. Over 70% of our total project debt at present, including our outstanding bonds, have fixed interest rates for a period of at least two to three years. As we refinance our project debt on completion of new projects this year, we will endeavor to have almost 100% of project debt to be under fixed rates. Refinancing at lower costs and fixed rate reflects strong credit profile of the group, supported by strong sponsors, such as CDPQ and OMERS. Further, we expect that India may not see much impact from global interest rate increase apprehensions in the longer term. As India progresses economically and with events like India's sovereign debt inclusion in the global bond indices, we expect India to significantly gain from long-term inflows of global capital much larger than previous years, which may be expected to keep the rates in check. For second quarter 2022, our share price decreased from $26.92 as on June 30, 2021 to $22 as on 30th September 2021, resulting in reversal of SAR expenses of $3.3 million. Despite challenges in past few quarters, our DSO has been fairly consistent at around 116 days on an average in the recent quarter. We believe there will be further improvement in our DSO days in future with commissioning of projects with high creditworthy counter-parties, and also expected improvement in collections due to favorable awards in Karnataka discount. You can see that EBITDA from operating assets increased about 28% year-on-year, and cash flow to equity from operating assets rose about 32%. Net debt for operating assets was about $1.2 billion and EBITDA for the last 12 months was about $194 million, resulting in a net debt-to-EBITDA ratio for operating assets of 6.2x as on September 30, 2021. Finally, looking at Page 16, providing balance sheet information, we had about $128.3 million of cash and cash equivalents and our net debt stood at approximately $1.41 billion. As a reminder, the hedging assets of $17.2 million included in Other Assets on our balance sheet should be netted against our total debt as this is directly linked to the foreign exchange hedges we put in place related to our Green Bonds. During the current quarter, we have used part of this asset related to our first green bond to reduce the leverage on the green bonds at the kind of refinancing. Now, I pass on to Ranjit to provide some commentary on the guidance. We reiterate here our numbers for the current fiscal, and will keep the market posted in our coming updates. For the third quarter financial year 2022, we expect the revenue to be between INR4,100 million and INR4,300 million and the PLF to be between 19.5% to 20.5%. With this, we'd be happy to take questions. With the progress that's being made with Andhra Pradesh on signing PSAs for 2.3 gigawatts, I believe you have about 1 gigawatt remaining on the entire 4 gigawatt manufacturing like tender, in which you would want to sign PPAs if you consider both Andhra Pradesh in the 600 megawatts you've already signed PPAs for. Thank you, Justin, for this question. As far as the remaining about 600-odd megawatts of the fourth tranche is concerned, at the moment, SECI has I don't think started offering that capacity because that capacity is to be commissioned four to five years hence. And then post that, SECI will try to close the remaining 67 megawatts. I think that 600 megawatts, the commissioning date was goal Q3 of 2024. So Justin, you're absolutely right. Though the requirement as per the contract is to commission the 600 megawatts in quarter three fiscal '24, which means November 2023, our endeavor would be to try and compete the 600 megawatts before then, because of the fact that we already have made significant progress on the land and connectivity. And hopefully, we will have some guidance around when we expect to commission soon enough. The remaining 2,300 megawatts will be commissioned 1,000 megawatts, assuming that the PPAs get signed in this month. We'll be then required to commission one year hence, one year hence and one year hence. So therefore, we do have some time on our hands. So we will obviously want to do it earlier than later, so that everyone is comfortable that we have the money available with us. So we are working on that, though we do have plenty of time on our hands at the moment. So -- like I was responding to Justin, that we do need to commission these projects by November of 2023, which means that if we aim to commission the project, then we do need to order the module six to seven months ahead of that. However, we are working on a schedule wherein we can try and commission these projects earlier. So obviously, currently, the pricing of modules is high. One, with the readiness, our readiness is in good shape, I would think. Well, as far as the financial closure is concerned, the financial closure -- we do have time for financial closure. We cannot open LCs without financial closure, obviously. My next question is on the Punjab issue, which has risen. In fact, there was -- if you recall, there were some pending payments from Punjab for a dispute that they had created in -- at the onset of the pandemic at the beginning of 2020. We -- as an industry, that the award was in our favor. And Punjab has, from what I understand, paid part of that money also. So once it becomes a law -- if it becomes law, then there will be a process of determination of tariff and missing that and others. So hopefully next couple of months, we should have all approvals everything in place, and we should be able to conclude transactions definitely during this fiscal year. Yes, we expect to receive funds of in the fiscal year. We're also looking at kind of trying to see if you can transfer into two phases, Puneet, because, as I said, large order the tools have received. So, there is a possibility that we can for one part for each, everything is in place. And then for remaining, it might take a couple of months. But definitely, we expect to receive a time produced within this fiscal year. Good evening to everyone here, and then thanks for taking the questions here. As you know, the market has been fairly depressed over the last several years. So, as the pundits are still figuring out how exactly will that impact, or the initial understanding is that this does not have an impact from the carbon pricing as far as Indian projects are concerned, but the devil lies in the details as usual. So given that the world is moving towards extracting a larger carbon price from industry and from other participants, one would expect that carbon pricing will stay from, but it is difficult to predict what exactly the pricing will be. And then just in terms of guidance here, the revenue guidance was flattish. For the full year, because I think you disclosed 6.3 of cash received in Q3 as well, right? So, the revenue that we booked in last quarter that was received in this quarter, so I just want to clarify that it is the same revenue we booked in last quarter, we've sold in the last quarter, and we realized this in subsequent to that. It depends on the -- it depends -- yes, it will be difficult to predict at the moment might. So, Maheep, we are very, very strongly of the opinion that there will be no impact of the move that Punjab state has taken. There is absolutely no question that what they are trying is against the contract act, against  against the Indian constitution. We have spoken to the Central Ministry, and everyone is super supportive. And there is no doubt in our mind that even if by any chance, first of all, we believe that this has not become -- then will not become an act. And the legal advice we have is that even if there is any chance of this will be coming in, it will not stand scrutiny in court. And then apart from that, I think like in the past, we talked about potential discussions at the Supreme Court level on some of the other state discussions. So apart from Andhra Pradesh, which is in the final leg, so to say, by end of December, we are hopeful the next round of hearing and which is expected to be the final ground caring is on 29th and 30th of December on the Andhra Pradesh matter. At the moment, there is no other -- and this Andhra Pradesh matter unfortunately has been going on for the last couple of years. And then just the last one for me here, and then I follow up later on. It's just around the project construction over here, like schedule. Like we have the, call it, roughly 3 gigawatt, which you have outlined will be completed in the next few quarters here. So yes, so as this question was alluded to even before, we are going to see if we can start constructing and commission some capacity before the scheduled commissioning of November, December of 2023. So, we'll see how much capacity we can bring up ahead. So, we don't want to speak specifically about dates, but there is a reasonable possibility that we will bring some capacity before the scheduled commission. As there are no further questions, on behalf of Azure Power, that concludes this conference."
}