{
    "symbol": "FFIV",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-25 20:43:06",
    "content": " While we had a strong pipeline for new multiyear subscriptions headed into the quarter, customers' macro concerns led to lower close rates and lower software growth than we expected. First, with portfolio and consumption model diversification, we drove our product mix to 51-49 software hardware, a noteworthy accomplishment in our transformation journey and very different from where we were just 5 years ago when software represented less than 15% of our product revenue; second, with the expansion of our application security portfolio and increasing demand for securing applications and APIs, we have grown our security business to $1 billion in revenue. Security-related revenue now represented 37% of our FY '22 total revenue; third, 69% of our total revenue was recurring in FY '22 with a double-digit 3-year compound annual growth rate. With the February launch of our SaaS-based F5 distributed cloud services, we are now an attacker in a rapidly growing segment of the overall security market; third, we expect the combination of a resilient systems business and gradually improving component supply will contribute to drive systems revenue growth in fiscal year '23. Near term, we also see the opportunity to take share from traditional hardware competitors undergoing structural change; fourth, our breadth of form factors and consumption models makes us an ideal partner for customers who are likely to be prioritizing their investments, optimizing costs and may want to shift from one consumption model to another, whether hardware, software, SaaS or managed service, perpetual license or subscription via an OpEx or CapEx budget approach, we are flexible. We delivered fourth quarter revenue of $700 million, reflecting 3% growth year-over-year with 3% product revenue growth and 2% global services growth. Subscription-based revenue, which includes term subscriptions, our SaaS offerings and utility-based revenue totaled $131 million or 76% of Q4's total software revenue, the remaining 24% or $41 million came from perpetual license sales. We believe we are positioned to deliver FY '23 revenue and earnings growth, we are well aligned with our customers' most pressing application challenges, including easing the complexity of protecting increasingly distributed applications and managing and scaling complex hybrid IT environments. But is there a way to think about how each of these three buckets finished the year in aggregate, and as we're thinking about this 15% to 20% growth, you had mentioned that still over half the business in software is on new."
}