{
    "symbol": "PUMP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 15:23:12",
    "content": " Our steady focus on achieving full cycle cash-on-cash returns across our operating fleet paired with additional operating leverage in the form of a 15th active fleet in the fourth quarter of this year, gives us confidence to guide to a full year 2022 EBITDA expectation of at least $300 million, and over 100% increase from last year. That said, we think it's going to be prudent for the top tier pressure pumpers like ProPetro and its larger peers to be pulling equipment into the system that plays to that industrialization and is more efficient, cost effective and brings better emissions profiles. I think our addition of more dual field units, our commentary around e-fleets next year is really directed towards what we believe is happening in the broader market and maybe even more so directed towards what we think the medium and long-term circumstances are going to be in the North American pressure pumping market for really the years to come. We're extremely confident about what the market is going to look like really the back half of this year and going into next year and beyond that, the - and this is no news to most informed people listening to this call, but the structural undersupply of oil and gas globally, we think is going to take many years to fix. So we feel like we've got the best services in basin and we've proven that, and we're going to take advantage of that going into what we think is going to be a very tech market in the latter half of this year and into 2023. So I think what's happening at ProPetro is a recapitalization of the fleet where we're going to be providing very relevant assets to the marketplace, along with the efficient and effective frac performance that we've delivered historically to top providers, top operators. So in terms of completion performance and our overall capital spend, I think it's going to be trending in a very favorable way getting into 2023, as we're able to take advantage of those investments that we made this year and prior to that."
}