{
    "symbol": "ASLE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 21:10:07",
    "content": "  Welcome to AerSale Inc., Second Quarter 2022 Earnings Conference Call. Before we discuss this quarter's results, we want to remind you that all statements made on this call that do not relate to matters of historical fact should be considered forward-looking statements within the meaning of the federal securities laws including statements regarding our current expectations for the business and our financial performance. Important factors that could cause actual results to differ materially from forward-looking statements are discussed in the Risk Factors section of the company's annual report on Form 10-K for the year ended December 31, 2021, and filed with the Securities and Exchange Commission on March 15, 2022, and its other filings with the SEC. We produced another record quarter for AerSale with total sales of 139.6 million, which was up 51.9% compared to the prior year, and adjusted EBITDA that was up 35.2% to 41.1 million. Notably, this higher profitability was achieved despite the absence of 8.4 million in CARES Act payroll support proceeds that were received in the prior year as a result of the pandemic. This exceptional performance was achieved primarily through the broad-based success of our Boeing 757 passenger to freighter conversion program, which I'll refer to as P2F, combined with an improving backdrop of commercial demand for use serviceable material, which I'll refer to as USM parts. This notwithstanding, we think it is important to remind investors that our business can and will be lumpy quarter-to-quarter depending on flight equipment transactions during the period. Second quarter sales were 114.5 million, which marks an increase of 90% over the prior year. We sold a total of 92.5 million of flight equipment during the period, which included three aircraft, two of which were AerSale P2F converted 757s, a 747-400 freighter and three engines. While we do expect the pace of flight equipment sales to moderate substantially in the second half, based on delivery schedules, we remain positioned to continue the 757 P2F program through early 2024. Besides the six P2F conversions utilizing AerSale's Goodyear facility, we have committed to perform another 12 P2F conversions on 757s by third parties, with seven aircraft already owned by AerSale and available for conversion and an additional four in the final stage of purchase negotiations. Upon completion of these additional 12 aircraft AerSale will have sold, leased or have available for sale or lease 18 P2F converted 757 freighters. Beyond the 757 P2F program, our feedstock pipeline has continued to markedly improve over the past several quarters, and current flight equipment purchase opportunities are the strongest we've seen in years. These are generally smaller packages of less than 10 aircraft or engines and include platforms such as the Airbus A320, A330, A340, and Boeing 737, 757, 767 and 777. We view this change in the market backdrop as a significant positive tailwind for our medium-term outlook, as it will enable us to leverage the approximately $347 million of cash and revolver capacity to increase our USM parts feedstock and aircraft available for sale or lease. In our USN parts business, airframe and engine parts sales also grew compared to the prior year, reflecting the benefit of a stronger commercial backdrop, and recent feedstock acquisitions. As we look out beyond the next couple of quarters, we anticipate feedstock availability will improve further as we're able to execute on the broadening aircraft availability in the market. During the quarter, our leasing revenue also increased for General Electric CS6-ADC 2 engines, due to strong demand from wide bodied freighter operators utilizing these engines. In consideration of the current soft lease market for older passenger flight equipment, we purposely reduced our aircraft leasing portfolio down to just one 737-400 freighter aircraft with a 747-400 freighter we previously had on lease being sold during the quarter at an exceptional price. With plenty of dry powder and utilizing our multi-dimensional value-added capabilities, we believe there will be ample opportunities to rebuild our specialized aircraft lease portfolio as the leasing market improves. In our TechOps segment, total sales were 25.1 million, which declined approximately 6.6 million compared to the prior year. This reallocation of resources results in a deferral of any revenue and associated margin for the work performed until the aircraft is subsequently sold, at which time, the value-added benefit will appear on the asset management side of the ledger. Our sixth and final AerSale converted 757 is expected to be completed by the end of the third quarter, which will open up that capacity for third party work in the fourth quarter. As we're nearing the commercialization phase of AerAware, we've stepped up our marketing efforts with airline operators and have received favorable feedback across the board. We've been hearing positive reviews about the system following our many demonstration flights, with pilots frequently noting that AerAware's advanced technology is â\u0080\u009cDecades ahead of anything existing todayâ\u0080\u009d. Importantly, AerAware product availability could not be timelier for airline operators, and other commercial air travel stakeholders, as the global airline industry struggles to meet higher passenger volume amid airport congestion and increasing weather related delays. To that end, in July, we ordered $33 million of the AerAware components from Elbit Systems, subsidiary universal avionics, so that we can begin installations at the earliest time. Regarding our business development efforts, we're progressing toward commercialization of AerAware and continue to actively seek feedstock opportunities, with nearly $350 million of capacity ready to deploy, comprised of nearly $200 million of cash on the balance sheet and $150 million undrawn on our revolver. Our second quarter revenue was 139.6 million, which included 92.5 million of flight equipment sales. Within our U.S. and parts business, we see an increasingly favorable market for feedstock availability, against the backdrop of growing demand for airframe and engine parts as airline USM parts consumption expands. In addition, demand for 757 P2F converted aircraft is expected to remain strong, and we are well positioned to monetize on an additional 12 aircraft 10 in 2023 and 2 in early 2024. Second quarter revenue from TechOps was 25.1 million, compared to 31.6 million in the second quarter of 2021. In addition, we have reduced third-party capacity at our Goodyear facility due to the company 757 P2F conversion program. As you're aware, we have been able to generate higher margins from the sale of five internally converted 757s since the second half of 2021 as a result of this reallocation. We expect one additional internal conversion to be completed and sold in the remainder of 2022, after which we will transition to a third-party provider to perform an additional 12 conversions, which will allow us to increase our capacity for third-party work at Goodyear. Second quarter gross margin was 39.4% compared to 33.4% in the second quarter of 2021, driven mainly by a favorable product mix comprised of high margin flight equipment sales. Selling, general and administrative expenses were 23.5 million in the second quarter, compared to 8.6 million in the second quarter of 2021. We also incurred 3.9 million of non-cash equity based compensation expense in the second quarter, which was de minimis in the second quarter of 2021. Income from operations was 31.5 million in the second quarter, versus 22.2 million in the second quarter of 2021. Net income was 26.5 million in the second quarter, compared to 16.5 million in the second quarter of 2021. Adjusted for non-cash equity-based compensation impairments and mark-to-market adjustments related to our Private Warrants, adjusted net income was 31.7 million in the second quarter, versus 21.8 million in the second quarter of 2021. Diluted earnings per share was $0.47 for the second quarter, compared to $0.38 in the second quarter of 2021. Adjusted for non-cash equity-based compensation impairments and mark-to-market adjustments related to our Private Warrants, diluted earnings per share was $0.56 for the second quarter of 2022 compared to $0.50 in the second quarter of 2021. Second quarter adjusted EBITDA was 41.1 million or 29.4% of revenues, while adjusted EBITDA in the corresponding year ago period was 30.4 million, or 33.1% of sales. In addition, adjusted EBITDA for the second quarter of 2021 reflected the benefit of 8.4 million in Payroll Support Program proceeds, for which there were no corresponding proceeds in the second quarter of 2022. Year-to-date, cash flow provided by operating activities was 41.2 million in the second quarter, compared to 8.6 million in the second quarter of 2021. At quarter end, AerSale had 197.2 million of cash on its balance sheet, and an undrawn revolver of $150 million. As a result of a strong second quarter performance and a supportive outlook for the remainder of the year, we are reaffirming our 2022 guidance for revenue of 420 million to 450 million and adjusted EBITDA of 80 million to 90 million. The implied reduction in performance in the second half as compared to the first half reflects an earlier than anticipated sale of our 747 400 freighter at the end of the second quarter, which was planned for the third quarter. Looking forward beyond 2022, we expect flight equipment deliveries on our 757 P2F program to accelerate in 2023 coupled with meaningful contributions from AerAware as product deliveries ramp up. However, the components other than an installation set to certify the aircraft, we don't need to have the components in hand or at least a large order of components to start delivering on AerSaleâ\u0080\u0099s half of sale of an AerAware converted aircraft. We just need to have enough -- we just need to have our installation kit, modified radon, et cetera perform and several sets of components so that we can certify an aircraft. And then, if it's a large order, and it may take several months or depending on the size of the order, it could take years to develop enough to build enough hardware to comply with an order of potentially 1000s of aircraft, that wouldn't affect our ability to start doing our portion of the conversion. Once the hardware became available, we think on an overnight once the aircraft were certified, had all of the -- was setup basically to accept all of the components that Elbit Universal remanufacturing, then we believe we could do the reinstallation of just the hardware on an overnight. But it makes sense that before an operator would release a new system into their operation, that they would have all the pilots trained on the system, they would have enough equipment installed in the aircraft so that as pilots are rotating from one aircraft to another, that they hop into an airplane with AerAware installed, they already been trained, they know how to use it, and there's enough aircraft flying around out there to get some proficiency using it. So whether it's an FAA requirement or not, I think it's prudent that the airlines, wait until they get half their fleet modified before they start using the system. So a few weeks ago, we conducted another round of familiarization flights with the Human Factors area of the FAA what those guys do is, those are engineers working for the FAA that actually verify that the pilots wearing this head wearable display, can wear it comfortably that they can use it doesn't interfere with their operation other systems in the aircraft. And the reason that they had requested that the human factors people had requested us to do to take them up on some demonstration, familiarization flights, is because they want it to be ready, so that when we actually started our certification flights, they were already familiar with the system, because we've already that was our third set of tests flying with different people from the FAA, some out of the Atlanta region, some out of the Seattle region, and now the Human Factors people. So we think that all of the required engineers and test pilots with the FAA that are going to participate in our certification place, we believe that they've already seen the aircraft and understand how it works. Leasing companies and airlines that have looked, trying to determine what to do with their idle equipment, leasing companies now who have kept aircraft in storage, and have not found customers to operate those aircraft. Again, our after 2.5 years of writing them down, have gotten them to the point where they're going to keep whether it be engines or APUs, or landing gear or whatever they're going to take -- going to take the equipment that they feel that they're going to need in the near term off those aircraft, and they're going to sell those aircraft into the into our market. So we're seeing that more and more we're getting whatever, it could be a whole aircraft, it could be an aircraft with one engine, it could be an aircraft with no engines and no landing gear, or run out landing gear. Because we or had to run out landing gear that's coming with it because we have overhauled capability for the landing gear, we're putting engines through the shop that we're buying on serviceable, we've got the infrastructure to basically restore an aircraft that still has life left, based on the multi-dimensional infrastructure that we've created over the last decade. And that's what sets us apart from our one dimensional competitors or financial buyers who want to come into this space, they have cash, maybe they have somebody that has some experience in the market, but they don't have the overall breadth of capacity that we do. And so their ability to find profitable outlets for a less than a whole aircraft or an aircraft on lease, they can't do that as well as we can in an integrated fashion where we've got multi-dimensional capability. So it's a combination of time, aircraft leasors, who have had aircraft on lease for 2.5 years to nonperforming leasees, and they didn't take them back, because, candidly, there was no storage capacity to put them. But we're seeing definitely a recovery of aircraft storage, with aircraft coming out of leasing companies -- coming out of airlines that that were not performing. So when you look at all of that together, we're well situated to take advantage of flight equipment that's coming back off lease going into storage that from non-performing leasees, and then with all the other things that we do to extract greater value out of all this equipment than our peers do. But we're just performing exactly as we expected, maybe a little ahead, because we were able to close the 747 transaction that we thought was going to take place in the third quarter and instead, it happened at the very end of the second quarter. And we're well situated, we've got the largest backlog of available equipment that we've had in the history of the company, with basically a 10, 757 freighter conversions under contract to be converted next year and two, in 2024. So with that sizable amount of equipment, we've never had that much available equipment that we knew that we'd be able to take to market in the coming year. There were also two, 757, that we thought we would sell this year that we pulled from a transaction that we felt was undervalued, and we would get a greater return, not selling that aircraft as a whole aircraft not converted to -- didn't have a P2F conversion. But rather for us to hold that aircraft, put it as one of the 10 that we're going to convert next year, and then, sell or lease that aircraft in '23 or '24 as a converted freighter getting a much higher margin. So we've actually pulled revenue from '22 into '23, so that we could gain more margin, that ought to give you an indication of the confidence that we have in hitting our guidance, despite the fact that we have taken things out of our fourth internal forecast and move them to next year where we expect to have a higher return. The fact that we placed an order for $33 million worth of equipment, ought to give all of you good idea how confident we are that we're going to have this system certified in the short run, and that we're going to have multiple number of customers that will be waiting to take that equipment. We're happy -- we're not patting ourselves on the back yet, we always have a lot of work to do, but we are confident about how we'll finish '22 and the future of '23 and '24 with the amount of 757 conversions that will be completed and available and the commercialization of our AerAware product which we are confident."
}