{
    "symbol": "ASLE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 20:31:17",
    "content": " As we do every quarter, we believe it's important to remind investors that our financial results are typically uneven quarter-to-quarter and we advise investors to analyze our performance over a full-year based on the patterns of expected feedstock availability and whole asset sales. As a result, our fourth quarter revenue in 2022 was $95.1 million, including $51.4 million of whole asset sales, compared to $116.8 in the prior year period, which included $73.1 million of whole asset sales. Fourth quarter earnings per diluted share was $0.17 with adjusted EBITDA of $17.7 million, compared to the prior year period earnings per diluted share of $0.21 with adjusted EBITDA of $28.6 million. In the fourth quarter, sales were $67.9 million, compared to $93.6 million in the same period in the prior year as a result of lower whole asset sales during the period. If we exclude flight equipment sales, revenue would have been $43.7 million in the fourth quarter of 2022 and 2021. Fourth quarter asset management revenue decreased 27.4% to $67.9 million, largely due to lower flight equipment sales. Fourth quarter USM parts sales were similar to levels seen in the fourth quarter of 2021. technical operations or tech ops revenue was $27.2 million in the fourth quarter, which was an improvement of 17.2%, compared to the fourth quarter of 2021. Adjusted for non-cash equity-based compensation, inventory write down, mark-to-market adjustment to the private warrant liability, gain on an aircraft insurance claim and secondary offering and facility relocation costs, fourth quarter adjusted net income was $12.3 million versus $22.3 million in the fourth quarter of 2021. Adjusted for non-cash equity-based compensation, inventory write downs mark-to-market adjustment to the private warrant liability, gain on an aircraft insurance claim and secondary offering and facility relocation costs, fourth quarter adjusted diluted earnings per share was $0.23 versus $0.41 for the fourth quarter of 2021. It's possible as we have kits in stock, but it's impossible to predict when we would get our first -- until we get this FCC approved and we have a first order, we're not going to speculate on when we might have sales, we did not put any sales in our guidance, not that we don't think that that's possible."
}