{
    "symbol": "OGI",
    "quarter": 1,
    "year": 2023,
    "date": "2023-01-12 12:10:04",
    "content": " SG&A, excluding non-cash share-based compensation, increased to $15.7 million in Q1 '23 from $12.6 million in Q1 '22, while our total spend increased as a percentage of net revenue, SG&A expenses decreased to 36% from 42% in the previous year's quarter. Q1 '23 was our fourth consecutive quarter of positive adjusted EBITDA, based on our outlook for revenue, including international sales and improved efficiencies primarily achieved through scale, we expect this trend to continue. Before we open the call to questions, I would like to reiterate that our success in the first quarter of fiscal 2023 resulted from the strategic investments we made in our business in fiscal 2022 that helped improve our margin and enabled us to compete profitably in today's competitive industry. Your line is open. And when we factor that in, notwithstanding, we do believe that we can continue to decrease our cost of production as a consequence of just the continued flow through of the higher yields and in terms of our cost of cultivation that will help our flower margins and as well with the  CapEx spends around automation, et cetera and the extra margin we should be able to get from Lac-Superieur based on having an improved cost structure there post expansion. And of course, as we continue to grow, which we would expect, knowing the innovation that we continue to do as sales move up will be more gross margin dollars, But the guidance we've given is specific to the rate of 30%, which we haven't historically provided, but we are comfortable that this is the new normal for us in the climate of the current market and again, with an offset for some price compression. Your line is open. Your line is open. Your line is open. But there are some creative ways that people are looking at that market, and we continue to explore opportunities that would be compliant to our listings and we'll -- if we find one, you'll hear about it, obviously, but it's something we're looking at for sure because it is an important next evolution for our business. Your line is open. Your line is open."
}