{
    "symbol": "TDS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 14:19:03",
    "content": " At this time, I'd like to turn the conference over to Colleen Thompson, Vice President of Corporate Relations. We want to make you all aware of the presentation we have prepared to accompany our comments this morning, which you can find on the Investor Relations sections of the TDS and U.S. Cellular websites. With me today and offering prepared comments are from TDS' Vicki Villacrez, Executive Vice President and Chief Financial Officer; from U.S. Cellular, LT Therivel President and Chief Executive Officer; Doug Chambers, Executive Vice President Chief Financial Officer and Treasurer; and from TDS Telecom, Michelle Brukwicki, Senior Vice President of Finance and Chief Financial Officer. We provide guidance for both adjusted operating income before depreciation and amortization or OIBDA and adjusted earnings before interest, taxes, depreciation and amortization or EBITDA to highlight the contributions of U.S. Cellular's wireless partnerships. As shown on Slide two, the information set forth in the presentation and discussed during this call contains statements about expected future events and financial results that are forward-looking and subject to risks and uncertainties. In terms of our upcoming IR schedule on Slide 3, we are attending the Raymond James Technology Conference in New York on December 07 and the Citi Communications Media and Entertainment Conference Scottsdale on January 05. And as always our open door policy can now be an open door phone or video policy, so please reach out if you're interested in speaking with us. Importantly, our business -- our balance sheet strength also positions us well to manage against the interest rate increases that we are currently seeing. In addition to opportunistic short-term financing to help fund our network modernization investments in both businesses, and expansion into new markets at TDS Telecom. I also want to highlight that during the quarter, we repurchased a modest amount of stock at both companies. As a result, we have spent $55 million in stock buybacks this year, $26 million and $29 million at TDS and U.S. Cellular, respectively. If I think back to our last quarter call, we recently launched a number of new pricing and promo offers that were designed to address the subscriber challenges that we saw in the first and second quarter. And while I'm encouraged with the early results of these promotions, you can see our all-in postpaid subscriber results are still challenged. But we are seeing a number of leading indicators moving in the right direction, and I'm going to expand on that shortly. But since many of our promotional efforts are designed to address churn, we know it's going to take some time for those efforts to translate into overall improved subscriber results. From a competitive perspective, substantially more investment is required in promo expense compared to several years ago. And although our exposure to cable is lower than the national average, bundled wireless with wireline adds another competitor into the mix in parts of our footprint. What we're seeing is that although the percentage of defaults are consistent with prepandemic levels, the rate per default is greater than in the past. And we anticipate that these macro factors are going to continue through the remainder of the year, so we've lowered the high end of our service revenue and profitability guidance for 2022. As part of those strategies, during the third quarter of 2022, we've been executing our Any Phone Free For Anyone, new and existing customers, that's a mouthful. And as a result, our percentage of postpaid handset connections that are in contract is now at 62%. And not only is that up from 59% at the end just of last quarter when we initially launched the promotion, but it's also the highest percentage in contract that we've seen since 2019. We also have a cost optimization program that remains strong, and it's helping to mitigate the effects of inflation, though it's not apparent in the face of the third quarter financials due to increased loss on equipment and bad debt expense in the quarter. Other areas of the business, we see momentum in our growth initiatives. We've also launched promotional offers that bundle fixed wireless and mobility together, and we're going to have further opportunities to expand this product as we launch our mid-band spectrum in late 2023 and early 2024. Towers produced another quarter of double-digit revenues, up 14%, that's due principally to a 17% increase in the number of colocators. Brief comment on the network, our network modernization program and our multiyear 5G deployment has progressed nicely. We've completed the modernization of sites that carry 75% of our total traffic, and we have plans to expand 5G coverage to over 60% of our POPs by the end of 2023. And where we've modernized our network to 5G, we see better performance and better customer perception of network quality. In addition, we successfully won 34 wireless licenses in auction 108, and that helped us fill in some mid-band gaps at a really attractive price. I also want to highlight that U.S. Cellular is once again refreshing its Board, appointing Xavier Williams to the Board effective January 1, 2023. With over 30 years of telecommunications experience, the U.S. Cellular Board will benefit from Xavier's significant experience, and we really look forward to his contributions. And so to summarize, while we've seen postpaid subscriber growth challenges, I'm optimistic we have the right strategy and we have the right initiatives underway, especially as we head into the busy holiday season. So I'll now turn the call over to Doug, who's going to take you through the operating and financial results in more detail. Postpaid handset gross additions increased by 2,000, driven by increased out-of-line activity, as LT mentioned previously. Postpaid handset net additions were down 17,000 driven by an increase in churn, which I will discuss in a moment. However, compared to the first and second quarter our ongoing promotions drove improvements in both gross and net additions. Connected device gross additions increased by 4,000 driven by fixed wireless additions, while net additions decreased by 6,000, primarily due to higher defections, which I will discuss on the next slide. Overall, we are very pleased with our momentum in fixed wireless, and we now have a base of 66,000 customers with this product, up 40% from the prior year and 16% from the prior quarter. Total postpaid churn, combining handsets and connected devices, increased due to higher handset churn and certain business and government customers disconnecting connected devices, many of which were originally activated during the pandemic in conjunction with government and agency funding that has subsequently ended. In response, we've launched new pricing for certain prepaid plans in July, which is driving sequential improvement in both gross and net additions, which were positive in Q3 for the first time in 2022. Now let's turn to the financial results, starting on Slide 11. Retail service revenues were relatively flat as higher average revenue per user was offset by a decrease in average postpaid connections, combined with the discrete adjustment related to the timing of recognition of regulatory fee billings that increased revenue in 2021. The largest driver of this rate decrease is the renegotiation of terms with other carriers, which also has the impact of decreasing our roaming expense. LT mentioned the strong increase in average revenue per user, and this increase, along with the increase in ARPOM, was driven primarily by favorable plan and product offering mix, an increase in cost recovery surcharges and an increase in device protection revenues. At the end of the quarter, 38% of our handset customers are on our two highest tiers of unlimited plans, and we are very pleased with the consistent growth that we've seen in this area. Adjusted operating income declined 23%, driven by increases in loss in equipment and bad debt expense. As LT commented earlier, we ran our new and existing promotion throughout the third quarter in the majority of our footprint. This promotion is designed to reward our existing customers, reduce churn and ultimately increased service revenue from increased customer volumes and ARPU over time. As previously discussed, in the near term, this promotion drove a high upgrade rate in the third quarter and was the primary driver of a $28 million increase in loss on equipment. Further, bad debt expense increased $29 million as our involuntary churn rate has returned to prepandemic levels and the average write-off has increased as a result of customers selecting higher-priced devices, partially attributable to promotional incentives. As a reminder, bad debt expense was unusually low throughout 2021 as a result of the continuing impacts of the pandemic, including government stimulus payments and high consumer savings rates, which resulted in strong customer payment behavior in the prior year. We expect loss on equipment and bad debt expense to remain at higher levels than the prior year in the fourth quarter as we plan to continue our new and existing promotion, and we expect involuntary churn and bad debt expense to continue to follow prepandemic trends. LT mentioned our ongoing cost optimization program, and this continues to deliver results. Despite our current inflationary environment, excluding cost of equipment sold and bad debt expense, other cash expenses decreased $14 million year-over-year. However, we are lowering the top end of the range for service revenues, adjusted operating income and adjusted EBITDA. Further, the adjusted operating income and adjusted EBITDA ranges are also impacted by the promotional investment we are making in our new and existing promotion and relatively higher levels of bad debt expense. We believe it will take time for our promotional offers to drive subscriber results, but we are encouraged with the positive trends we've discussed previously. Further, we have been taking actions to mitigate bad debts and, as always, are balancing those measures with our subscriber growth objectives. As a result, we have narrowed our guidance by decreasing the high end of the range of service revenues by $50 million and both adjusted operating income and adjusted EBITDA by $75 million. For capital expenditures, we are maintaining our guidance range as our investments in 5G and network modernization, targeted millimeter wave build-out and initial preparation for mid-band spectrum deployments remain on track. We are pleased with our results at TDS Telecom for the third quarter, and I'm also pleased to report that we are continuing to grow our business by providing quality, high-speed broadband. TDS Telecom grew its footprint by 7% from a year ago, now serving 1.5 million service addresses across our markets. This quarter, we added 33,000 marketable fiber service addresses to our footprint. In our expansion markets, we began offering service in Billings, Montana, and Green Bay, Wisconsin, and announced fiber expansion into 18 additional Wisconsin communities. In total, today, we have nearly 100 communities in our fiber expansion program at various stages of development. In our cable markets, we have upgraded to offer 1 gig speeds across our footprint and have achieved superior market share. In these markets, we are also deploying fiber in opportunistic areas. Likewise, in our incumbent wireline markets, we are very pleased that we have achieved superior market share where we've invested in fiber. In addition to our own funding, we drive faster speeds in our more rural markets by building to meet our A-CAM obligations and utilizing state broadband grants. In fact, TDS Telecom just successfully won a grant in Tennessee. As we do continue to face challenges that present cost pressures and stress our ability to meet our address delivery time lines in the short term, we are actively managing and mitigating the impacts of inflationary increases, labor shortages and supply chain challenges. And with the actions we are taking, we are well positioned to achieve our longer-term strategic plans. Year-to-date, we completed construction of 72,000 marketable fiber service addresses, deploying 33,000 in the quarter. And as we've previously shared, we expect to serve approximately 60% of our total footprint with fiber by 2026. In line with our growth objectives, service addresses grew 7% year-over-year. In the third quarter, we increased our availability of 1 gig speeds to 64% of our total service addresses, up from 57% a year ago. We also see positive trends in our broadband penetration rates for fully developed markets, and we still anticipate 40% to 50% consumer penetration in a steady state. Now although we're pleased with the 72,000 fiber service addresses we deployed so far this year, our service address delivery is slower than planned due to some industry-wide headwinds, such as labor shortages and permitting complexities, which are putting pressure on our service address targets. If we continue on our current trajectory, we will deliver around 120,000 addresses for the year, a 40% increase over last year. As we've previously mentioned, our fiber program is a long-term strategy. And although service address delivery might shift between years, we're still confident of meeting our goal of 1.2 million fiber service addresses by 2026. On Slide 19, you can see the broadband connection growth across all markets. Shown on the graph on the right, we see demand for greater broadband speeds, with 69% of our customers taking 100 megabits per second or greater, up from 65% a year ago. Our one-gig product, along with our 2-gig product in certain markets are important tools that will allow us to defend and win new customers. In areas where we offer 1-gig service, we are seeing 24% of our new customers taking the superior product. And finally, our focus on fast, reliable service has generated a 10% increase in total residential broadband revenue. As shown in the chart on the left, expansion market revenues increased year-over-year following the timing of service address delivery. Residential wireline incumbent and cable revenues increased year-over-year due to price increases and growth in broadband connections, partially offset by declines in video and voice connections. Commercial revenues decreased 5% in the quarter, primarily driven by lower CLEC connections, and wholesale revenues decreased 2%. As shown on Slide 21, cash expenses increased 9% year-over-year due to additional cost to support current and future growth, which is not yet reflected in our revenues. Cost to support our fiber expansion includes direct costs such as sales, marketing, real estate and technicians in addition to shared service costs. As anticipated, the increase in cash expenses resulted in an adjusted EBITDA decline of 13% from the prior year. Capital expenditures increased 82% from last year as we increased our investment in fiber deployments, including accelerated equipment purchases. On Slide 22, we've provided our updated 2022 guidance. Now that we're closer to the end of the year, we are narrowing our range for adjusted EBITDA to be between $270 million and $290 million. In closing, I want to thank all of our associates for their continued dedication and hard work, and I look forward to sharing our final 2022 results with everyone in February. LT, Doug, you guys mentioned you've seen increasing in upgrades. As we mentioned, we're running our new and existing promo throughout the end of the year, and that's driving a lot of upgrades. Yes, I'll start by saying we've always lost and gained more customers from Verizon just by virtue of their market share. But with respect to trajectory as far as how that's headed, the loss share and win share, it very much reflects what you're seeing in the national trends. When you see the carriers report the winners and losers on a national basis, I would say are also -- that's reflective in our markets as well. I would -- increasing -- well, a little bit from AT&T, what I would say is that, on a relative basis, we're losing less to Verizon than we have historically. On the fixed wireless side, obviously, some nice success there as others in the are starting to tap that. So I think, generally, where we're selling this product and where we're seeing success, if you think about the product that we're selling, much of the sales is still on a based product. Some of it is 5G, where we've upgraded our network, but much of it is LTE. And so although we don't have the exact figures because we don't see kind of reporting in the same way that we do -- the wireless moves, my expectation is that's generally who we're taking share from. Next year, when we fire up mid-band, which will be at the end of next year, I expect that mix to move more towards taking share from cable companies. But at least, right now, it's primarily, I would say, DSL and  . And the last one, we've seen a lot of movement on the DISH side as they look to hit their bogey for population coverage. I mean, certainly, from the tower side of our business, we continue to see increased interest, both from DISH, from other players as well. I've mentioned before, we kind of opened the towers up for business about 1.5 years, two years ago, and we're seeing the benefits of that. From a deeper partnership perspective, I think things like network sharing and so on, we continue to engage in those conversations. I do think, in the long run, this concept of building out four or five, duplicative 5G or duplicative 6G networks in rural America doesn't make sense economically. I think you started the call talking about this is a period of investment, both on the fiber side and on the wireless side, but that's putting strain on the balance sheet on leverage. And we've got Mike Irizarry, our CTO here, he'll add some more color and specifics, and then let me answer briefly the question on leverage, and then I'll ask Vicki to chime in since I imagine she'll have more specifics. And so I think, from an overall balance sheet health perspective, I believe we're in good shape, and that was reinforced by conversations that we had here fairly recently with the rating agencies. I think that we're in a position to be able to fund the requisite 5G investments mid-band build-out in a way that doesn't particularly further strain the balance sheet, but I'm sure Vicki can give more details. And so our goal is to be able to, for lack of a better word, flip a switch towards the end of '23, early '24 and already have a substantive amount of that mid-band spectrum deployed that will help us in two areas. The first, it will help us from an overall wireless perspective, improved speed, improved quality. And we do have our millimeter wave-enabled product out there in the marketplace of 300 megs, you can expect to see something similar from a mid-band enabled product. And so excited about that mid-band deployment and switching that on at the end of the year, both for both sides of that business. Mike, maybe you can give a little bit more detail about the deployment time line and when we expect to see what from the mid banner. So LT gave a number for the end of 2023, and we're on track to light those sites up. And as we've done with other large capital-intensive complex project, we break it over multiple years. We will pick up speed after 2023 and look to activate anywhere between 800 to 1,000 sites per year, very strategically targeted where we can improve the customer experience, offload capacity and also synergize that with the fixed wireless opportunity that LT talked about. As you know, TDS is always had a disciplined financial policy and maintained a conservative balance sheet. And as I think about leverage, we don't have targeted leverage ratios per se. And as LT said, and I said in my opening comments, both our businesses are going through an investment cycle at the same time because they're taking advantage of a window of opportunity that we think is really important to position us for the long-term growth that both -- that everybody has been talking about going forward. I'd also say that we have increased our leverage to support our businesses, but our intent is to stay at levels that we feel comfortable managing the business at, which is moderate really for our industry overall. And as LT mentioned, our -- Moody's and S&P reaffirmed our credit rating because they're supportive of the type of investments that we're making. It's -- these investments are for the long-term sustainability of our business, and they're critical. We've got room, and our plans incorporate the capital spending that we've got going forward. Operator, we're ready for the next question. Now Verizon is matching them, giving away handsets to existing customers. It is how do we try to stabilize the postpaid consumer side of the business, while investing in growth areas of the business and while driving increased levels of operating efficiency and capital efficiency. Last year, and up until the first two quarters of this year, we struck, I believe, a really good balance of profitability and subscriber growth. The first two quarters of this year, coming out of the pandemic, we saw substantive increase in voluntary churn. The more you can get customers under contract at a really high level, you can think of in-contract customers churning at half the rate of out-of-contract customers. And so the calculus is, we need to go get more aggressive of getting customers upgraded, and you've seen that in our numbers. 54% increase in upgrades, and that's driven a substantive growth in the number of customers in contract, 59% to 62%. The bear case is, well, these are customers that would have upgraded any way, and consequently, we simply accelerated those upgrades. The bull case is these are customers that might have churned in the future, but, instead, now that we have them in contract, they will not churn. It's something that we generally, as a company invested, in the long term. We've been comfortable with long-term strategies, and that's what we're doing. That being said, the leading indicators, I think, are strong for bringing customers in contract, and thus bringing churn down over time, couple that with some more aggressive gross add actions. Where we've run flat rate pricing, for example, in some of our lower share markets, we've seen very good progress, lines up substantively. And so the one piece of the equation that I think is disappointing for this quarter, and you see it in our numbers, is our LOE is up because we've had to spend to get those upgrades, and we haven't yet seen the improvement in voluntary churn. I expect it to come, and so I'm confident in the strategy, and we're going to stick with it. The second piece of the strategy is, okay, while you are working to stabilize postpaid, we have growth areas of the business. We invested in towers, 14% increase year-over-year in revenue. We invested in high-speed Internet, 82% up gross adds year-over-year. Digital, B2B, we're seeing growth in those areas as well. And finally, where, other than LOE, which Doug talked about in his comments, we're seeing continued improvement in overall expense discipline and expenses across the company. And so the challenge, as you've accurately highlighted is, from a competitive perspective, stabilizing postpaid. And so I do expect churn to improve going into the fourth quarter, going into next year, while we continue to improve gross adds. Cable companies are expanding, but there hasn't been a dramatic change in competitive intensity in this last quarter. Doug mentioned, it's fairly steady and it's fairly consistent with trends we've seen in the past. The change is, we've decided to go invest heavily in upgrading our customers and get that back -- get them back into contract, and you see that in our results. At this pace of upgrades, when does that start to impact ARPU because it sort of builds over time, and we've seen that at AT&T for the last few years. However, the way that we've structured the offer, and if I take you back to the regional strategy, we trialed a number of these types of approaches in our different regions before we launched this across the majority of our footprint. But the promotion is moving people up the rate stack, and that is having -- that is offsetting some of that negative future ARPU trend. In fact, we think we're going to be able to continue to expand ARPU. Maybe not exactly at the rate that you've seen this year, but we don't forecast ARPU dilution. The reality is, as LT and I both mentioned during the call, the frequency of write-offs is back to pre-pandemic levels, and the rate per write-off is up about 15% since prepandemic levels. We've been implementing additional anti-fraud measures in our stores, and we've been changing some of our collections strategies and tactics as well. First, I think back to the history of U.S. Cellular, I think back to a time where the company should Chicago and St. Louis because the performance in those markets weren't matching other parts of the portfolio. And then just separately, just kind of curious, LT, where you're standing on the strategic front these days in terms of the urgency to try to take some strategic actions along the lines of ideas you've talked about in the past to try to change the narrative for U.S. Cellular over the longer term? Mike, so -- as in any business, you're going to see some variability in terms of the profitability of our geographies. So where we have a strong spectrum position and we deliver a strong network experience because of it, we generally see higher profitability, better levels of network efficiency and so on. And so there's certainly a range, but I don't think there's anything surprising in terms of what's driving that range. From a strategic perspective, that's a really broad question. In terms of sense of urgency, I think we have a consistent sense of urgency in terms of executing the strategy that I articulated in my answer earlier. And so in terms of investing in areas of the business where we see attractive growth, we absolutely have urgency behind that. If we are going to serve customers with lower costs in a more variable fashion, serve people the way they want to be served, certainly coming out of the pandemic we have to invest more in a strong digital experience. And we're seeing that. Two years ago, our average score on the App Store was 1.5 stars, we are north of four now. And I think the last thing that you want to be doing is being desperate when you enter into that, and we're not. And so although I'm eager to find ways to reduce capital intensity over time, we're not going to do so hastily. Another area that I've talked about, however, is government infrastructure funding. That's a strategic opportunity for us, particularly because the administration has been very clear. And so both companies, I'll speak here for -- briefly for TDS Telecom as well. So the current time line around that, it looks like the maps will come out later this year. But I expect at some point in the middle towards the back end of the year -- of next year, you'll start to see those funds flowing from the states. And we're optimistic that a chunk of those funds will go to rural fiber, where I think telecom is well positioned. And also to fixed wireless, where we are well positioned. And in those investment conversations, we think we do so with credibility, and you talked about the history of U.S. Cellular. The history of U.S. Cellular is one of investing in these areas and providing connections where others don't, and states value that. And by the way, that's before they even have some of the clarity of the bead funding and before those dollars start to flow. I've talked in the past the average tower costs between $600,000 and $1 million in rural America. And where we don't have towers, it's not because we don't want to have towers. Well, if the government can help co-invest and take $600,000 and make it $100,000, now we have the opportunities to serve customers in a very different way and do so at a much more attractive capital intensity. Michelle, I'm not sure if you want to chime in any more about how you guys are thinking about those programs, but I know telecoms invested in them as well. As I mentioned in my comments, TDS Telecom is very excited about the funding that is available, both at the state level and at the federal level. We are part of the A-CAM program today and are very excited about where that A-CAM extension program could take us that certainly could provide additional funds to take even higher speeds to many, many customers in our most rural areas. And as LT mentioned, we anticipate and hope that a lot of that money does go towards funding fiber for those unserved or underserved customers that are out in our territories. LT, maybe the first question is on your differentiated market approach and some of the offers that you try in those markets. Sergey, so if I break out our local offers since we -- just put a bit of math behind it to give you a sense of how much trialing we do. Since we regionalized about 18 months ago, I think we've run over 75 different promotional permutations of whether it's upgrade offers, or whether it's offers that are more designed to drive gross adds. In our lower-share markets, where we're running our flat rate offers, we're seeing very good performance from a gross add perspective. In our existing same as new markets, we've seen attractive add-a-line improvements. In the markets that we trialed them in previously, it took us 6 months or so, 6, 7 months to see the improvements in voluntary churn. And so if you forecast that forward, that helps explain why we are cautiously optimistic that we're going to see that voluntary churn trend turn in the fourth quarter and into early next year. The bet on upgrades is that the bull case will prevail and not the bear case, and that the people that are upgrading are doing so, they might have been future churners, but we've been able to put an attractive offer in front of them. They have confidence in the customer experience that we provide, and they're choosing to stick with us. And we've seen that in the markets that we trialed this in, and we expect to see it across the footprint. And we've done that because of the regional trials, and you can expect to see that continue through the rest of the year. When we get into the holiday season, we tend to have ubiquitous offers across the footprint. And then as we get into early next year, you can expect to see those regional trials kick back off again so that we're operating with a strong information as we possibly can. maybe I'll ask a follow-up question to Mike's question around strategic actions, but maybe just a different permutations of that. So in terms of the timing, I'm actually -- I think that, from a strategic perspective, if I look at the growth investments that we've made and the performance of those growth investments, I think it's right on track. I think from a stabilizing postpaid, it's a very challenging competitive environment out there. You used the word financial engineering, and that's what I want to avoid it. I don't see, in the near term, new spectrum auctions on the immediate horizon. We have a good plan that Mike articulated about building out C-band, making those investments on the network modernization that we need to make. And so, luckily, I don't feel the need to engage in that financial engineering because we took advantage of an environment of cheap debt. Sorry, I'll be quick because I think we're out of time. But briefly, we continue -- I talked in the last quarter in more specifics about some of the momentum that we were seeing on the private networking side, on the IoT side. At a very high level, we have three trends that we're working through on the business side. The first is a negative trend, which is we have connected devices that were gross adds that were driven by government subsidies that happened during the pandemic, and we're seeing people disconnect those. They were to port them to a competitor, I would be worried, but they're not porting them. On the postpaid handset side, we want to see revenue stability, and, generally, we're seeing that -- and then where we're seeing -- where we want to have upside is on those new areas of growth, IoT, private networking. And we're seeing that. So we're seeing the interest from enterprise clients, from small business clients. We're being brought into deals that I don't think we would have been brought into before, before we had invested in that distribution and invest in those operational capabilities. And so I'm comfortable with that balance because if you think about the negative drag, we're on the back end of that negative drag in terms of connected device disconnects from the pandemic, whereas, I believe, we're only at the beginning of what we're seeing from IoT, private networking and some of these enterprise 5G use cases."
}