{
    "symbol": "ACOR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 19:49:02",
    "content": " During the Q&A today, we will first take calls from our analyst, and then we may take questions from that other investors have written in when they registered for the call. On our agenda, we will be presenting the Q3 highlights and focus a good deal on INBRIJA and AMPYRA. Iâ\u0080\u0099m also going to provide some summary of the long-term business plan, a high level summary of the plan that we released in detail last week. Mike Geer, our CFO will cover the financials and guidance, and I will touch at the end on our upcoming special meeting of stockholders this Friday. That is a 1% increase over Q3 2021, and 104% increase over the first quarter of this year. Now, I recall our Q1 sales this year were severely reduced by both the Omicron surge and the extra large buy-in, in the fourth quarter of 2021. You can see here in INBRIJA net sales, total prescriptions and dispensed quarters in the first three quarters of 2022. However, all of these metrics improve dramatically across the subsequent two quarters of this year. Regarding INBRIJA XUS sales, recall that in June, we recorded $1.9 million in sales from ESTEVE for the initial launch shipments for Germany, and we received an additional $960,000 in the third quarter for Germany. ESTEVE reports high receptivity by patients and physicians in Germany, and they expect to launch in Spain in the first quarter of 2023. In addition, Biopas is continuing to work toward launches of INBRIJA in the nine largest Latin American markets, including Mexico and Brazil. We are also in continued discussions for INBRIJA partnerships in additional territories around the world, including in Asia and other EU territories. So moving to AMPYRA, AMPYRA net sales for the third quarter were $21.1 million. And on this slide, you see illustrated the continuing leveling of the decline in AMPYRA sales year-over-year since loss of exclusivity. With regard to AMPYRA XUS revenue, we received royalties of $2.6 million from Biogen, which markets AMPYRA, which is the XUS name of AMPYRA. First, we expect to be able to accelerate Andreâ\u0080\u0099s growth in the US and we are also on track to expand into additional XUS markets. And while we expect that AMPYRA will continue to decline, the rate of decline has slowed over time, and we expected to continue to stabilize, still providing meaningful revenue over the next five years and beyond. And especially with the courtâ\u0080\u0099s recent arbitration award from Alchemies, we are well capitalized to execute this plan, and we expect to be cash flow positive in 2023. Finally at the end, I will touch on the need for shareholder approval of the Companyâ\u0080\u0099s reverse stock split proposal that will be key to ensuring that the company is not delisted by NASDAQ in December. Now, our commercial team has done an excellent job, establishing INBRIJA as the preferred on-demand treatment for people with Parkinsonâ\u0080\u0099s Disease and off periods. And independent report shows that INBRIJA now has two thirds of the market for on-demand therapies and Parkinsonâ\u0080\u0099s and our market research shows that healthcare professionals or HCPs are more comfortable with levodopa based treatments, which INBRIJA is and this is against the two other competitors in the market. But the key here is that only about 2% of the addressable population now, which is about 380,000 people with Parkinsonâ\u0080\u0099s who take daily levodopa and experience off periods, only about 2% are currently receiving any on-demand therapy. Now, this represents a substantial opportunity for us to expand the market, and you can see that even a modest increase in penetration will result in significant value creation, right. First we will be launching a new brand campaign this month, emphasizing the emotional impact of off periods on everyday activities for patients and their care partners. And then as soon as ten minutes after they inhale INBRIJA, for those of you who would be interested in seeing them, I will give you some coordinates later about how you can see those. This reduces friction in the prescribing process so the prescriber can use, whichever platform they prefer rather than the more time consuming prescription request forms that have to be faxed in. And in the last few months that we have implemented this, we have already found that, the fulfillment rates and which is the percent of prescriptions that are actually resulting in drug being delivered to the patient has increased by about 30% using the e-prescribing options. Each is authored by a group of leaders in the Parkinsonâ\u0080\u0099s field, but they are independent papers and yet all three conclude that, there is a need for the field to adopt on-demand treatments substantially more than they are already. On the left you will see the person with Parkinsonâ\u0080\u0099s during an off period and then on the left, excuse me, on the left. And then on the right, 10 minutes after they have inhaled INBRIJA, the platform for this investor call doesnâ\u0080\u0099t allow for us to play video. So I encourage you to view these at inbrija.com I-N-B-R-I-J-A .com, or if you are a healthcare professional, you can also view them at INBRIJA-hcp.com. Sales are at about 13% of our sales in 2017, which was the last full-year before AMPYRA lost exclusivity. Now, very interestingly note that about 200 doctors have already written prescriptions for branded AMPYRA in 2022, who had not written since the medication went generic in 2018. That includes our first step program, which gives the initial two months of AMPYRA free for commercially insured payment of patients, and we are mitigating down commercially insured co-pays to no more than $10 a month, which is often lower than what they would pay for generics. INBRIJAâ\u0080\u0099s net revenue was up over Q3 2021 by 14.1%, including outside the U.S. sales. Just the U.S. INBRIJA net revenue is up about 1% compared to Q3 2021, and peer revenue was up over Q3 2021 by 5.5%. Cash of $34.2 million is aligned with our expectations, but I would like to point out does not include the cash from our settlement with Alchemies. Last month, an arbitration panel issued the final decision in the dispute between a court and Alchemies regarding the licensing of royalties relating to AMPYRA. At panelâ\u0080\u0099s decision in the quarter was awarded $15 million plus a prejudgment interest of $1.5 million, as I said, were received in October. In addition, a quarter will no longer have to pay alchemy any royalties on net sales for license and supply of AMPYRA. We expect savings of $10 to $12 million in reduced cost of goods sold for AMPYRA in 2023 depending on volume, and that savings depending on volume continue in the future. As we release on October 27th, Acorda is providing financial guidance on many elements of the business in addition to the AMPYRA net revenue in OpEx that we have in the past. As Ron noted, we are holding our previous guidance for AMPYRA and we are also holding our previous guidance on OpEx. As we have previously announced, the ending cash balance cash flow for 2022 includes the settlement for ALS of $16.5 million. In addition, we will not pay the December 2022 note interest in shares as we have announced. We continued to work on expanding our outside the U.S. INBRIJA sales, and that is also reflected here, although in clear net revenue continues to decline the face of generic competition, as Ron said, we believe that that curve is flattening and a decline is lessening. The AMPYRA royalty, which now we receive a 100% of the cash from since June. The cash guidance is a result of growing net revenue, the favorable impact of empiric cost to get sold from the  (Ph) settlement and continued OpEx cost management. So, to summarize on our business plan and long-term focus, we are continuing to focus on building long-term value through execution on the key goals we have discussed and that you see summarized here, accelerating and INBRIJAâ\u0080\u0099s growth, maintaining AMPYRAâ\u0080\u0099s strength continued financial discipline, and also leveraging the ARCA platform as we have discussed in the past. Now, before we go to your Q&A, I will touch on the special meeting of stockholders that is taking place this coming Friday, November 4th. In order to provide us with the runway that we need to allow us to execute on the business plan, we had a key proposal on the ballot for this meeting, proposal two, to give the board the ability to implement a reverse split of Acordaâ\u0080\u0099s stock as needed. Now, this is critical to ensure that we donâ\u0080\u0099t become de-listed from NASDAQ in December because if that were to happen, we could be in default to our bond holders. And in any case and in case any share shareholders who are eligible would like to vote, we are going to put up a slide with the ways you can vote while we open the call for your questions. Well, as we will continue to point out that, you know, forward looking statements do have risk of variability. However, I will say this about AMPYRA, it has been a rather well-performing drug and a well forecasted drug over the years. What we find is that, reduction of people who are on our drug typically do a cliff fall you could say between the end of one year and the beginning of another as they are moved off of our product onto a generic or forced off our product to a generic. We have analyzed how we believe this drug will continue to perform as that curve flattens and we reach the parity that you see in many, many, many markets, where a generic is competing against a branded drug. The generic is light-branded drugs in the market if it sets the price, we are very conscious about our patients that take our drug and their need for our drug as opposed to generics. The ranges that we provided you, they do contain a normal price increase from year-to-year and they do include a reduction in our taking population year-to-year. But I will tell you that as part of our affirmative strategy and tactics, we have been adding the sales force call on more of the MS prescribers, because it became apparent that, there are many out there still who were actually not aware that we are still supporting the product, and that has been a disincentive to them to prescribe the brand versus the generic. I think you know, we built up a huge amount of goodwill and loyalty with all of the behaviors and programs that we had when it was branded. This was very appreciated by the field, very appreciated on behalf of their patients, and when we tell them, when we alert them that actually yes, we are still doing first step, we are still providing reimbursement support and so forth. And also by the way to pushing back on insurance companies, if they believe for whatever reasons that they prefer to have the brand for their patients. I donâ\u0080\u0099t know that, we expect that to change dramatically, but again, that is difficult to project because that is a matter for each generic company to decide whether they want to stay in the market or not. But right now, as far as we can tell we donâ\u0080\u0099t see it changing dramatically. By the way, I do want to say that in addition to the reps going to visit MS Docs more, we have increased media outreach as well, social media outreach and so on. And what we have found is that when the doctors are made aware that we are still very much active from supporting them, supporting the brand, this goes a long way with them. With respect to INBRIJA, I was just wondering if you could just describe a little bit more in detail some of the barriers to prescribing that the e-prescribing approach overcomes. So the traditional way for prescribing, specialty drugs and certainly INBRIJA and even AMPYRA has been to have specialty pharmacies. So right away it is a departure from most of the prescriptions that the doctor or people in the office nurse practitioners, PAs are writing. That includes not just the e-prescribing software and platform, but a specialty pharmacy that is specifically geared to this kind of activity, because if we are going to one of the big major specialty pharmacies, we donâ\u0080\u0099t get a lot out of it other than data and then obviously fulfillment. But here you have the extra step where the specialty pharmacy itself is aware of the drug, they are aware of the prior authorization requirements of each given insurance company. And in many cases, they are able to address those prior authorizations without bothering the doctorâ\u0080\u0099s office further or if the prior office such that they need the physicianâ\u0080\u0099s office to do something, they will call them or the contact them and say, hey, we need you to do such and such. It is a busy practice and they donâ\u0080\u0099t really have the office, doesnâ\u0080\u0099t necessarily have the time to focus on these individual details. So this system and our particular e-prescribing system helps, and you can see the results with the about 30% improvement in fulfillment rates. Also one last question with respect to the possibility of affecting a reverse stock split, Iâ\u0080\u0099m assuming that at this time Acorda has made no determination regarding the nature of the ratio, the split ratio. And by the way, I just wanted to just sort of roll back and clarify something just to make sure everyone understands that with respect to the Alchemy Arbitration award that was not - I want to make sure everyone understands it wasnâ\u0080\u0099t a settlement. We have a few questions that were written in by shareholders when they registered, and I will just read them out. The first one is, I have been an investor for the last three years, I have a lot of confidence in the management team and the future of the company. Now, with an injection of another 16.5 million and that there is a risk of delisting, why doesnâ\u0080\u0099t the management declare a buy plan for the amount received in the award? Well, I appreciate the supportive comment, and I will say on a professional basis, in general, I think stock buybacks are a very useful tool. So, hopefully at some point in the future that all gets resolved, but right now we are just not able to do it. We are currently feeling the full effect of our actions over the last year by reducing OpEx by $20 million year-over-year from 2022 to 2023, as I talked about. Specifically we moved out of our 20,000 square foot facility in Ardsley to a 20,000 square foot facility in Pearl River, that full effect will be felt in 2023 and is reflected in numbers going forward. We are actively working on becoming more efficient in our internal processes, significantly changing our IT structure and platforms to a more modern cloud based approach to reduce cost and improve performance. We are maximizing the value investment on our marketing programs, ensuring that a thoughtful and targeted approach to outreach will have long-term effects of both reducing out of pocket for those, as well as increasing revenue. And finally, we are leveraging our existing capacity of both people and systems to support our outside the U.S. activity in both business development as well as support and delivery. That is increasing our economies of scale, but it is also increasing our economies of scale as we have been able to add that revenue stream with no significant additional operating expense costs. This is one of those answers as a finance guy I could probably talk all day, but I donâ\u0080\u0099t want to take away from some other questions and I hope that answered your inquiry. The next question is, inside our video Q&A, you mentioned on-demand is a fairly new modality. So, yes, I donâ\u0080\u0099t know how to do that on the phone, but I will suggest to you if you just write to or e-mail to investor relations@acorda.com and no punctuation. Now we are not able to send the actual papers out, because of copyright restrictions, but we can give you the citations so that you can look them up. Well, I guess I guess the answer to that is that, the urgent immediate need is for the reverse split or at least the authority for the Board to do it, so that we donâ\u0080\u0099t get delisted in December. Now looking ahead longer-term, what we would like to do we want to do with the time that would buy us is to execute on the business plan that we have just discussed and that we put out in more detail last week. And we believe that, if we execute on that, we should build substantial value back in the company, and then the Board will look at the fact patterns as we go forward, and make decisions on whether and when a split would be a benefit to shareholders. Right now, I have to emphasize that the immediate issue is not the split, but a reverse split and that in the future, it is certainly something that the Board would continue to consider as part of its overall responsibilities. The next question is, since we are cash flow positive, we retailers are hoping for no more dilution. First of all, we expect to be cash flow positive in 2023, based on the plans that we have discussed today and also last week. With respect to dilution, we have said already publicly that we will not pay the upcoming interest payment on the debt in stock the one that is coming up this December. Now, the only caveat I will put on that is that, obviously, the Board has to make decisions in real time depending on what is happening at the time. From where we are right now, we certainly hope that we donâ\u0080\u0099t pay it in cash in the future - excuse me, in stock, Iâ\u0080\u0099m sorry, that we donâ\u0080\u0099t pay in stock in the future. And we can definitely say that right now, based on our assessment of where we are and our projections, we will not be paying it in stock for this coming payment. If the stock price is not above $1 for 10 consecutive trading days, then we will have run out the clock on delisting on the NASDAQ in December, and we would be facing delisting at that time. So between now and then, the Board will be assessing where we are, what the issues are and if needed and they have the authority given by Proposal Two, they would decide at that time whether to do the split then or not - a reverse split then or not. Well, we appreciate your joining us, everyone."
}