{
    "symbol": "CF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 13:08:02",
    "content": " Your line is open. But just based on our recent experience, both at Donaldsonville and Port Neal, adjusting for inflation that's taking place, it wouldn't surprise me if we -- for a greenfield facility, we're in the neighborhood of $2 billion plus or minus for this. So think about that from our perspective as even though the money doesn't go out the door ratably like that, but you're talking about $200 million a year in terms of capital over the next five years. But given the fact that we generated $2.8 billion of free cash flow in the last 12 months, it's imminently affordable and not a crazy amount, and I feel really good about the prospects for that plant having a fantastic return profile for shareholders. Your line is open. And so for us, as we announced at Donaldsonville, we're looking at roughly $200 million for dehydration and compression and it's probably going to be in the neighborhood of $5 to $10 per ton of CO2 of incremental utility costs down there. I think if you were doing blue gas capture or other things, you're talking about probably $120 to $150 a ton that you need the credit to get to in order to justify it based on today's technologies. Your line is open. Your line is open. How should we think about, let's say, over a rolling two to three year period, the balance of capital allocation versus projects versus return to shareholders versus the last three to five, it seems like you're still juggling a lot of opportunities. And so as Chris said, even if we're ultimately decided to move forward on this new blue ammonia project, it adds roughly, as I said, kind of $200 million plus or minus per year to a range that's $500 to $550 million of capital per year. Your line is open. But we're focused right now on the first $1.5 billion of repurchase authorization that the Board's put there given that our debt is now where we want it to be and we're generating so much cash, our expectation is we'll get through that in pretty short order here. Your line is open. Your line is open. Your line is open."
}