{
    "symbol": "CF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 11:55:21",
    "content": " And I think that's going to bode really well for us, not only in the near-term based on what demand and margin opportunities look like, but also when it becomes spring time in the Northern Hemisphere next year because all of those skill tons are not going to be sitting in the system and the channel in the US. With what's going on globally in Europe, as we just explained and what we believe are low inventories coming out of -- especially at the retail level coming out of our spring in North America, coupled with delayed purchasing in other places such as India with their most recent tender, just 600,000 tons. And I think it's really going to be an interesting proof point when all the harvest information is tallied globally around where yields come in, but our expectation is we're going to be in a deficit situation for quite a while and that just provides a longer runway relative to ag demand. It's $100 -- $70 to $100 to move product out of Russia and freight costs, overall, even coming out of the Middle East position CF as a domestic producer in a wonderful position, and there's not a lot of new tons coming on to add capacity to the market. But our focus is less around UAN per se, and it's more around what's the best margin opportunity once you've made ammonia, and that might be selling it as ammonia, might be making into granular urea, might be making UAN, but we're not fixated on UAN per se, and that's one of the reasons why, as Bert said, not only are we exporting, but we're heavily focused on ammonia right now because the value prop is better for us right there. And I think that will limit industrial production in Europe, and there's many discussions going on with what can be cut, what levels for power or like BASF importing ammonia and they're not needing that gas for that type of their component or of their industrial footprint. And Vince, I would just add that the longer you see high gas prices globally, the bigger the snap is going to be when it comes in terms of the price move because, first of all, with North American customers showing a little bit of hesitancy and the export book that we've laid on and the lack of availability of tons elsewhere in the world, it's just going to make it that much bigger of a price impact when the realization hits home."
}