{
    "symbol": "SSTK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 14:58:04",
    "content": " Good morning, everyone and thank you for joining us for Shutterstockâ\u0080\u0099s fourth quarter 2022 earnings call. Joining us today is Paul Hennessy, Shutterstockâ\u0080\u0099s Chief Executive Officer; and Jarrod Yahes, Shutterstockâ\u0080\u0099s Chief Financial Officer. Please note that some of the information you will hear during our discussion today will consist of forward-looking statements, including without limitation, the long-term effects of investments in our business, the future success and financial impact of new and existing product offerings, our ability to consummate acquisitions and integrate the businesses we have acquired or may acquire into our existing operations, our future growth, margins and profitability, our long-term strategy and our performance targets including 2022 guidance. For more information, please refer to todayâ\u0080\u0099s press release on the reports we file with the SEC from time-to-time, including the risk factors discussed in our Form 10-K for discussions of important risk factors that could cause actual results to differ materially from any forward-looking statements we may make on this call. We will be discussing certain non-GAAP financial measures today, including adjusted EBITDA and adjusted EBITDA margin, adjusted net income, adjusted net income per diluted share, revenue growth, including by distribution channel on a constant currency basis, billings and free cash flow. Today, we'll be discussing Shutterstock's 2022 results and 2023 outlook. Shutterstock closed out 2022 with $828 million in revenue, and $218 million in EBITDA, well ahead of our expectations and guidance. Overall, despite growth in North America and rest of world, we saw weakness in Europe, where growth was negative 4% for the year. Overall, our E-commerce channel was up 2% in 2022, with revenue growth in North America offset by a decline in Europe and rest of world. Meanwhile, our enterprise channel grew 15% in 2022, a second consecutive year of double-digit growth. This growth reflects continued momentum driven by our multi-asset and multi-touchpoint relationships with large enterprises across North America, Europe and rest of world, as well as continued innovation in our product offerings. As an end-to-end Creative Partner, Shutterstock is well-positioned to ultimately offer more value to our customers and to achieve sustained growth. Since joining as CEO last year, I've been talking about our content library, our Creative Flow platform, our enterprise capabilities, and our highly engaged team is the key drivers of differentiation and value creation at Shutterstock. This quarter, we leverage these strengths to bring differentiated value to our customers. Today, I want to talk about how Shutterstock is not only embracing AI, but also commercializing it for the benefit of both our E-commerce customers within our Creative Flow suite, and our enterprise customers with our Computer Vision offering. Furthermore, I'd like to provide a few examples of how our broader end-to-end Creative platform has really resonated with our enterprise customers. In January, we formally launched our AI image generation platform to all of our customers across both our E-commerce and enterprise channels. Shutterstock AI image generator allows anyone to create high quality visuals ready in seconds, simply by describing what they're looking for. There are there are three truly unique differentiators which set Shutterstock apart in terms of bringing this innovative capability to our customers, namely ease and quality, convenience, and confidence. Our image generator has been designed for creative use cases to produce unique, varied and high quality images from just a single word input or short simple phrases. We offer the ability to discover and licensed stock content and generative content in the same platform with a single plan, which is a unique capability in the market today. We have immediately integrated this capability and put it into the hands of existing customers, making generative available in all our subscriptions, path products, and enterprise offerings. Also, our customers know that we're paying creators and have uniquely structured our contributor fund to compensate artists for the revenue generated by Shutterstock in connection with the licensing of generative AI content, and of our training data. In short, we believe that Shutterstock's AI image generation platform is uniquely positioned at the intersection of creativity, and productivity. Beyond the ease of use and peace of mind I described just now, we also have integrated our generative -- generative AI platform with Creative Flow for E-commerce customers. As a result, AI image generation is a seamless part of our customer's creative journey. To illustrate, after creating a generative AI image, a customer can edit it in our Creative app, tag, store and search for them in catalog and amplify them on various social channels using our calendar in plan. Our early reads that we're seeing about 75% of the generative AI traffic come from potential new customers, and 25% from existing customers engaging with the new technology. While we're excited by this large scale and early engagement, we're currently focused on incremental monetization opportunities. Also on the E-commerce front, I'm very excited about the newest addition to our leadership team with John Kane joining us last week as the Global Head of E-commerce. John will be focused on driving growth in our E-commerce channel, and as such, we'll be partnering closely with our product marketing and business operations team. With its unique combination of workflow applications and content, including now generative AI content, Shutterstock has a solid foundation upon wish to continue building and evolving and we look forward to John's contributions. We continue to see sustained growth in our enterprise channel underpinned by, one, extremely strong customer retention, which is now in the mid 90s. Two, solid growth in our subscription bookings, which were up 27% for the year, and three, an acceleration and large enterprise deals valued at more than $100,000, which grew 24% for the year. We're also investing in high profile branding events such as Con , Sundance and South by Southwest to drive awareness and demand for our enterprise offering. Clearly, our performance in enterprise in 2022, and in the fourth quarter was exceptionally strong, and our end-to-end creative platform is resonating with our enterprise clients. To that end, Shutterstock studios produced a collection of 32nd animated videos to highlight how these customers and partners use AWS to solve business challenges. Shutterstock partnered with Allergan in its initiative to promote inclusion and aesthetic medicine, by producing a collection of images that includes a range of people of varying gender, color, race, age and abilities. On the editorial front, Shutterstock provides must have content in connection with breaking news and celebrity entertainment news, often on an exclusive basis. Since our acquisition of splashed news, we're seeing increased demand for our content and coverage from the global media companies like The Daily Mail, News UK in Ireland and the New York Post, and TMZ. Subsequent to establishing our partnership with open AI and LG, which I discussed last quarter, we've been announced an additional partnership with Meta, in which our data content library and associated metadata is being licensed to train their generative AI models into enhance their machine learning capabilities. Today Shutterstock AI content library that we use for model training consists of 600 million images, 45 million videos, 2 million music tracks and over a million 3D models. Looking ahead, we believe we can leverage our leading position as the licensing partner to commercialize our data across more use cases that go beyond generative AI applications. In closing, as this management teams drives the business forward, we're striking a prudent balance between investing for growth during this time of massive innovation in AI in our industry, and remaining nimble in the event of continued economic challenges. Looking ahead, I'm excited for what's in store in 2023 as we continue to deliver value to our customers with the content, tools and data in our end-to-end Creative platform, spanning generative AI Computer Vision, and much more. For the full year 2022, our revenue growth was 7% or 11% on a constant currency basis, with our E-commerce channel growing 2% and our enterprise channel growing a robust 15%. In the fourth quarter, E-commerce revenue was down 5% on a reported basis, and down 2% on a constant currency basis. The growth rate in our E-commerce channel continues to be meaningfully impacted by ongoing weakness in Europe, where macro uncertainty is having a more pronounced impact with weak new customer demand exacerbated by FX pressure. To give investors a sense of the weakness in Europe, our E-commerce business in North America grew 4% in the quarter. By contrast, our E-commerce business in Europe and the rest of the world combined was down 12% or a 16% differential relative to North America. It's clear that Europe has gotten worse from the third to the fourth quarter, whereas North America has remained stable. Enterprise grew 25% on a reported basis, or 30% on a constant currency basis. Enterprise growth in the fourth quarter was driven by growth in our multi-asset flex product offerings, multiple Computer Vision deals, strong momentum and studios and editorial and the contributions from our acquisitions of Pond5 and Splash. For both the full year and the fourth quarter gross margins were flat excluding non cash M&A, amortization. Sales and marketing expense in the fourth quarter was 22% of revenue compared to 30% in the fourth quarter of 2021, which included over $6 million of linear television ad spend. For the full year, sales and marketing expense was 25% of revenue, compared to 26% in 2021. Product development was 8% of revenue, flat with the fourth quarter of 2021, reflecting continued investment in our product offering and the integration of our acquisitions. For the full year, product development increased 8% of revenue from 7% in 2021, GNA expenses were 18% of revenue, compared to 17% in the fourth quarter of 2021, driven by an increase in bad debt expense. However, for the full year G&A expenses decreased to 16% from 17% in 2021. We are continuing to see operating leverage in our business, per our expectations, and that's manifesting itself in the G&A line. As part of rightsizing our office footprint, in the fourth quarter, we recognize the non-cash impairment charge related to lease and related assets of $18.7 million associated with our decision to close or consolidate certain office spaces that have been underutilized. In the fourth quarter, adjusted EBITDA was a record of $58 million. Shutterstock grew EBITDA by 13% this year from $193 million to $218 million, and EBITDA margins meaningfully exceeded our target for margin expansion, increasing 138 basis points to 26.3% from 25% in 2021. Turning to our balance sheet, we had $115 million of cash at the end of the quarter, and exhibited strong cash flow generation. On January 31, we announced a 13% increase in our quarterly dividend to $0.27 per share, which will be paid on March 16. This increase was attributable to the strengthen our cash flows, zero debt on the balance sheet and our competence in the business for 2023. During 2022, we repurchased 984,000 shares for $73 million and completed the $100 million repurchase authorization. Our deferred revenue balance was $187 million, an increased $13 million from the third quarter of 2022, primarily due to growth in enterprise. On our key operating metrics for the quarter, subscriber count was 586,000 from 343,000 last year, driven by the inclusion of Creative Flow Plus and PicMonkey subscribers. Consistent with what we're seeing in our revenues, paid downloads were up in our enterprise channel and down in E-commerce largely due to weakness in Europe. Revenue of $836 million to $853 million, representing 1% to 3% annual revenue growth, adjusted EBITDA of $220 million to $228 million, with margins ranging from flat to up 50 basis points and adjusted earnings per share between $3.90 to $4.05 per share. Our revenue guidance is based on recent spot rates for the euro and pound and FX is expected to be a 1% headwind to revenue growth, while the additional months contribution of Pond5 adds 2% to revenue growth. We are not factoring into our guidance, any upside from the rollout of generative AI, or from additional Computer Vision partnerships beyond the deals we've already signed. From a margin perspective, we are targeting up to 50 basis points of EBITDA margin expansion in 2023, driven by operating leverage in G&A, and our ongoing focused on cost management. Other modeling assumptions include stock-based compensation of %55 million, depreciation and amortization expense of $68 million, capital expenditures of $45 million and an effective tax rate percentage in the high-teens. Before opening up for questions, I'd like to formally invite everyone on the call to our Investor Day to be held in the Empire State Building on February 28. We plan to have an immersive extended reality experience for investors, including deep dives into Generative AI and Creative Flow and multiple other business opportunities. Your line is open. You talked about strength within multi-asset flex, Computer Vision deals editorial Pond5 and Slash while contributing. And then, you talked about just not including the pipeline of Computer Vision assets for 2023. We'll try and remember all those three questions to the best of our ability, but you may have to get us back on track if we lose focus. So look, turning to our enterprise business, we turned in a spectacular year. Paul gave some of the, really compelling metrics around how we grew our subscription bookings, which were up 27%, the acceleration, the large deals, which grew 24%, and the strong customer retention, which was in the mid 90s. So all of those, fundamentally, when you think of the core of the enterprise business, we're moving up into the right. There are multiple business lines in our enterprise business, which don't comprise 10% of the revenues of the business. We don't break out the quarterly or annual contribution of those individual business lines, but there are a number of different pockets of growth, and it resulted in fantastic growth for the year, and great growth for the quarter. So, in terms of the Computer Vision deals that we signed, these are large partnerships. Those partnerships positively impacted the fourth quarter, they will positively impact 2023. These deals do have somewhat of an upfront revenue composition, but they're also tells of revenue that continue on through the long life of the contract. And internally, we've really proven our ability to use these as leverage points to develop larger and more multi prong relationships with the clients. So, we're starting to really have strategic level engagements with customers and enterprise in a way that we never have before. Your line is open. Maybe just to start, the 75% of traffic from new customers that are using generative AI and Creative Flow. So, you mentioned in the prepared remarks, 75% of traffic for new customers, are new to the platform. As I mentioned, we're seeing lots of good engagement. We don't know if that's a sustainable mix or representative of what that will be four weeks out, eight weeks out, and six months out. Bernie, I think the biggest piece is, you've seen some of the weakness in our E-commerce business. So, it's really a function of the weakness in E-commerce, which really is driven primarily by that significant differential in the performance of Europe as compared to the rest of the world and the U.S.\n Got it. If I just take paid downloads and multiply by revenue per download, and look at that relative to 3Q. It seems like there was like a, call it $13 million step up in ancillary. I think Bernie, we don't consider that ancillary revenue, it's not the right way to think about it. I would call out Computer Vision business as acting that, and there are multiple other revenue streams that sort of encompass that, so. And one moment for our next question. Your line is open. Clearly, that's still the biggest piece of the business. And then, back to this AI relationships, can you help us maybe understand how the money flows from deals like OpenAI or Meta, for instance, beyond just the upfront piece, I think Jarrod, you talked about the residual annual revenue there. Hopefully what you're seeing and it's very apparent of what we're doing with E-commerce is we're getting very, very busy. We are focused on everything from process improvement, product development, tool set delivery for our customers, additional content to lift conversion, and we're bringing in as we mentioned, more resources to focus on a very strategic part of our business called E-commerce. And I'd say at the same time, we're laser like focused on being customer centric, so that we're listening to exactly what our customers needs, building products and services for them and bringing content to bear, so that they can find what they're looking for and action their business objectives. I can tell you that by June 1 or September 1, there's going to be a magic event that suddenly E-commerce is going to magically start growing at the rates that we would be excited about. And as Jarrod said, we believe that there's some potential upside to that guidance, because of the things we did put in and we didn't put in. And Youssef, to the second part of your question just on the money flow is pertaining to our Computer Vision partnerships. And when our partners train their AI machine learning models using our metadata, as we confer that data, that is used for model training, and the money would flow. And so, effectively, they're contracting for a long-term period to continue to ingest and pay for that metadata and that content. We have typically leverage those partnerships to also get some access to some technology, which we've done in the case of an LG or an OpenAI. So for example, OpenAI, we do not have a Rev share with all the deals that OpenAI is going to do in the growth of their business. So we're able to monetize the core metadata, plus we're able to charge within our core subscription impact products for generative AI, which we hope will have incrementality associated with the revenue growth in our business. And as Paul mentioned, the early engagement is quite strong, and we're really excited about what we're seeing thus far. So for the fourth quarter of 2022, the organic growth excluding Pond5 was 3.3% on a constant currency basis, and flat on a reported basis, excluding Pond5. If you were to include Pond5 on a constant currency basis, the growth was 9.5% for the fourth quarter. Your line is open. First, just wanted to confirm the upfront Meta and LG partnership revenue was booked in the fourth quarter. So, the good news is that the LG and the Meta partnership deals did positively impact the fourth quarter. They will positively impact the first quarter of 2023, the second, third and the fourth quarter of 2023, and into 2024 and beyond. So, this is something where we are seeing an immediate contribution, but we're also going to be seeing a positive contribution in the quarters to come from these deals. I can also confirm that these are the deals that we put out press releases around, and we've put out -- we've had public permission to put up the names around. But there are 20 plus other customers that we've been working with in this area, some of which are extremely large companies, the names of which, we see around us each and every day, but we've not disclosed those partnerships. And so, there's a lot of momentum in this business. There's a fairly sizable number of deals that we've signed, and we feel quite good about the pipeline. So, we're enthusiastic, because these can be large deals though, and this is a new nascent business for us, that's sort of coming to us in real time. There's a great pipeline, but this is all really so new and sort of happening to us in real time, so we're going to be a little bit more cautious from a guidance and forecasting perspective on this one. And one moment for our next question. Your line is open. You see the level of engagement that we've described in two weeks, and that tells us that we are fishing in the right pond in terms of our development, by listening to our customers and reading the tea leaves of which way this industry is going. And we believe that this is just scratching the surface of use cases for AI, where our minds go in a world where we are fine tuning search queries, to be able to generate content on behalf of our customers, that depending on the level of detail of those search queries, you start to enhance and maybe even replace some of the existing tool sets that are out there that are doing some of the basic editing and modification of images, because customers can actually create the very specific thing they're looking for. It's early days on all of those things, but there's a lot of avenues that we're exploring, and when you can leverage our platform, and I know, I think I dropped off when -- to answer the end of Andrew's part three of his question, when you build a platform like we have, assembled the content, breadth and depth that we have, layer on the product innovation, leverage our contributors, and by the way, our employees and many of which are best-in-class sales force that are sitting in the offices of our small, medium and large scale clients, innovation happens, new products happen and new opportunities happen. So, it's still the first pitch of the first inning for AI and its use cases. And I love that you used I don't know, as an answer, because that's the only honest one. And one moment for our next question. Your line is open. That business is a little bit more heavily tilted towards E-com, than enterprise from a revenue distribution. So, a simple back of the envelope way to think about it would be a 2% contribution to the E-commerce business and a 1% contribution to the enterprise business. So 586 in the fourth quarter, I think the figure in the third quarter was 607. I think, the subscriber decline is really -- the year-over-year, there's obviously very significant sequential -- year-over-year, very significant subscriber growth. There is a quarterly sequential subscriber decline, the subscriber count is largely driven by our E-commerce business. And so, some of the weakness that we've seen in Europe has really been the impetus for the subscriber decline. But one of the things you'll also notice is, if you look at subscriber revenues, subscriber revenues were up 9%, year-over-year, and the subscriber revenue number also takes into account the subscribers we have in our enterprise business. And so, you have an interesting phenomenon where you have smaller subscribers, that were sequentially as a result of Europe, but you also have subscriber revenues that have been very, very strong. I think, as Paul mentioned, we're not baking into our guidance any kind of a return to growth in our E-commerce business this year itself. Seemed multiple months of trends moving in the right direction, in particular, in Europe, to sort of to make that call. And we're going to continue to focus on doing what we can do in terms of improving the value for our customers, and growing our E-commerce platform. We're bringing in the right talent, the right tools, and really taking the right marketing strategies to be able to grow that business."
}