{
    "symbol": "ALC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 12:54:03",
    "content": " In contact lenses, our full year growth of 9% was driven by our portfolio of innovative lenses which continue to receive favorable market feedback as well as select price increases. Implantable sales were $434 million in the quarter, up 11% year-over-year, primarily due to market recovery in most international geographies, increased demand for our PC-IOL portfolio led by Vivity and sales of Hydrus. In equipment, sales were $204 million in the quarter, up 7% year-over-year, primarily due to continued strong demand for our cataract equipment and service, particularly in international markets as we upgrade older generations of equipment to Centurion and Legion. Accordingly, we expect 2023 net sales of $9.2 billion to $9.4 billion which corresponds to 6% to 8% constant currency sales growth versus the prior year. And on pricing, I think the way to think about it, at least is most of our pricing is in contact lenses, a little bit in ocular health but really, it's -- our Surgical business, we take it where we can but it's largely contracted and those contracts are multiyear. What we've seen on this year was the Surgical business on a full year basis, the market was roughly around 4% the Vision Care business, the contact lens care market was roughly around kind of 3%, 4%. A little softer on Vision Care than we would have expected probably for the full year -- sorry, for that was the fourth quarter but the full year was also on the U.S. was 4%. So directionally, I think we feel like -- in the fourth quarter, we saw a little bit of softness with unit growth, where most of the 4% was in Vision Care was made up of price and mix. We think eye surgery and eye disorders don't go away and that directionally, we're going to see historical growth rates in the kind of we've always said kind of 4% to 5% range is the market depending on which 1 we're talking about. Obviously, equipment for the full year grew 10% mid-teens in international and pretty close to what we expected, really not great -- not much growth in the U.S. And I do think that all that strength was offset by a decline in the refractive equipment which, again, I think hadn't been even flat, we'd have done better than we said. So if you think let's call it, 4% to 6% as the market, you back out organic -- inorganic growth from the 6% to 8% on Aerie, you'll pull off 2 points."
}