{
    "symbol": "YTRA",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-21 11:06:05",
    "content": " Given the highly fragmented nature of the market, we believe we will continue to take market share going forward and that our corporate business should accelerate growth to levels higher than where we were pre-pandemic, as we see an accelerated shift towards online bookings, especially as contracts come up for renewal at the end of their life and rebilling. There might be a slight lag however in terms of recovery of corporate travel compared to consumer travel, but we believe that our technology-enabled corporate travel solution will continue to thrive in the post-COVID world as companies adapt to a more hybrid approach to working which will be difficult for them to do without the use of technology. When we come out of the pandemic, on the back of the secular growth in Indian travel, the mid-teens signing growth we have seen during the pandemic in new corporate customers and in the growth of our hotel network, our digital platform business that is completely additive and has the potential to grow to the size of our pre-pandemic corporate travel business in the coming years, we believe we should be on a significantly better revenue trajectory. We believe potential benefits of this listing which would support Yatra's ongoing strategy and value creation opportunities include access to an additional pool of capital, including retail and institutional investors in India who are already familiar with Yatra's business and brand, but who are currently restricted from participating in the U.S. capital markets. But having said that, we are optimistic about the future and we believe there is a tremendous amount of growth potential for this business and the strength that we have seen in the recovery of travel in the month of October and November give us that confidence, give us that belief that travel will come back strongly. We will obviously go through these cycles where new variants we are likely to emerge and could impact business in the short term, but we have seen the strength of the Indian market and we believe that the domestic Indian travel market is quite resilient and will continue to grow strongly despite all these hiccups that happened for shorter periods of time. The only difference which is there, I think corporate travel, on a per customer spend basis, might recover only to between, let's say, 85% to 90% of pre-COVID level, if I look at it from a weighted average point of view, right."
}