{
    "symbol": "VYGR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:22:05",
    "content": "  Operator: Good morning, and welcome to Voyager Therapeutics Third Quarter 2022 Conference Call. I would now like to turn the call over to Peter Pfreundschuh, Chief Financial Officer. Accordingly, we are going to provide a brief summary of key highlights from the quarter and reserve the majority of time for your Q&A. Before I do this, I want to remind everyone that during this call, Voyager representatives may make forward-looking statement regarding future expectations, plans and prospects. You are encouraged to review and understand a number of the material risks and uncertainties facing the company as described in the companyâ\u0080\u0099s annual report on Form 10-K filed with the SEC, as updated by subsequent SEC filings including the companyâ\u0080\u0099s most recent quarterly report on Form 10-Q filed this morning. Now it is my pleasure to turn over the call to Voyagerâ\u0080\u0099s Chief Executive Officer, Dr. Al Sandrock. Thank you and Pete, and good morning, everyone. At Voyager, we are leveraging cutting edge expertise in capsid discovery, and deep neuro pharmacology capabilities to address these constraints, which we believe will ultimately create significant value for patients and shareholders. First, our TRACER capsids discovery platform is generating breakthrough capsids to fuel both our own pipeline and that of partners including Neurocrine, Pfizer and Novartis with significant potential for future partnerships. We have started by targeting the central nervous system, and in preclinical studies, we have demonstrated more than 100 fold higher trans-gene expression in the brain compared to conventional AAV9 capsids. We have also demonstrated blood-brain-barrier penetration across multiple species, including mice and non-human primates, which increases our confidence that we may be able to translate these properties to humans. At ESGCT last month, we presented data on a novel capsid that demonstrated high levels of CNS gene expression when administered intravenously in a range of  (Ph) of the doses used by conventional capsids, potentially improving the therapeutic window of gene therapies. Further, we presented data characterizing a novel cell surface binding receptor for one of our capsids families and we confirmed the analogous function and expression of this receptor in humans. In the near-term, this discovery further increases our confidence that the preclinical results we are seeing may translate into human clinical trial. In the longer-term, this receptor could enable reverse engineering to further enhance the capsids generated by our TRACER platform. In addition, we have begun experiments to explore whether we may be able to leverage this receptor to enable the delivery of therapeutic modalities such as protein and oligonucleotide across the blood-brain-barrier, which if successful could constitute a new platform for CNS drug development. The novel capsids derived from TRACER have attracted the interest of multiple partners, including Pfizer and Novartis, and additional discussions are ongoing with multiple pharmaceutical companies. As we said in our Q2 call, we expect to identify these candidates later this year, and into the first half of next year laying the foundation for IND filings in 2024 and 2025. We also note, we are targeting serious life-threatening diseases that create significant burdens for patients and caregivers, Alzheimerâ\u0080\u0099s disease, Parkinsonâ\u0080\u0099s disease and amyotrophic lateral sclerosis or ALS. Our third pillar of value is our sound balance sheet, enabled by our track record of generating non-dilutive partnership revenue. As of September 30, 2022, we reported cash, cash equivalents and marketable securities of $132 million. Additionally, the potential option exercise by Novartis prior to the option expiration date in Q1 2023 would enhance the companyâ\u0080\u0099s operating runway further. I want to make one more point here, which is that our capsids licenses are structured around this target, not the capsids. Once our partners select their gene of interest, we donâ\u0080\u0099t work with anybody else on that gene, but it is entirely possible that multiple partners may select the same tests and we may also select that tests for some of our own internal programs. First, because these deals are not exclusive to the capsids, we have the optionality to continue to pursue partnerships. Second, some of our partners do choose capsid that we also utilize in our own programs, they may provide initial clinical validation of our capsids. Voyager continues to advance our three prioritized programs, as humanized anti-tau antibodies for Alzheimerâ\u0080\u0099s disease, SOD1 gene silencing for AOS and GBA1 gene replacement for Parkinsonâ\u0080\u0099s disease. In addition to these three programs, I want to remind you that we have a collaboration ongoing with Neurocrine to develop a gene therapy for free Friedreichâ\u0080\u0099s ataxia, which Neurocrine is currently funding through Phase 1. At that point, Voyager has an option to co-develop and co-commercialize the asset in the U.S. at a 40/60 cost and profit split with 40% coming to Voyager or to grant Neurocrine full global commercial rights in exchange from milestones and royalties. Our tau antibody program is being developed as an IV delivered passive immunotherapy, research has shown that tau pathology propagates across certain vein regions in a well-known pattern in Alzheimerâ\u0080\u0099s disease. The spread of tau pathology can be monitored with PET imaging, and we plan to use this biomarker to establish early proof of biology. Our antibody is differentiated from other antibodies that have not demonstrated clinical efficacy in that our antibody targets the C terminal rather than the N terminal region, and it has been shown in preclinical models to significantly reduce the spread of pathological travel. Moving now to GBA1 Parkinsonâ\u0080\u0099s disease up to 10% of Parkinsonâ\u0080\u0099s disease patients have a mutation in GBA1, the most common genetic risk factor, increasing the risk of disease approximately 20-fold. GBA1 encodes the lysosomal enzyme, glucocerebrosidase or GCase, and we believe restoration of GCase in Parkinsonâ\u0080\u0099s patients with GBA1 mutations will have therapeutic benefits. GCase levels can be measured in CFS, as can substrates of GCase that are abnormally elevated in GBA1 carriers due to the loss of function mutation. These biomarkers provide a potential path to early clinical development derisking our approach combines a GBA1 gene replacement with a CNS tropic BBB penetrant, novel TRACER derived capsids. We believe that by silencing expression of the SOD1 gene in the CNS, we can provide therapeutic benefit to ALS patients with SOD1 mutations. Proof-of-concept for this approach has been demonstrated by , an investigational drug sponsored by Biogen and IONIS, which is currently under review by FDA. Our approach combines a potent siRNA constructs with a CNS-tropic blood-brain-barrier penetrance, novel TRACER derived capsids. I also want to note on this slide that, we have several partnerships using novel TRACER generated capsids. As I mentioned above, any progress by our partners may provide even earlier clinical validation. In summary, we believe Voyager has demonstrated strong validation with our ability to execute during the third quarter and the subsequent period. Looking forward, we continue our work to break through the barriers constraining the fields of gene therapy and neurology. We look forward to identifying lead candidates for our pre-prioritized pipeline programs between the end of this year and the first half of next year, and we will keep you updated as we advance towards INDs. With that, we are happy to take any questions you may have. Joining me today for Q&A are Peter Pfreundschuh, our CFO and Dr. Todd Carter, our Chief Scientific Officer. Thank you so much for taking the questions, and congratulations to the team on the progress throughout the quarter and Pete and Todd for the new roles as well. This is Al, and I will start and Iâ\u0080\u0099m sure Paul will want to jump in. But look we have capsid profiles for each of our programs, where the scientists said, these are the characteristics that are ideal for this disease, depends on which cells need to be transduced, what regions in the brain, et cetera, and also the targeting issues. Now it may be that there are obviously advantages, if we use the same capsid for multiple diseases, certainly manufacturing for example. But I think our approach is - we want to use the very best capsid for the patients, so that we can treat the patients in the most optimal way. You made another remark on the call that you have ongoing conversations, and then those conversations seem to have been going on for quite a bit. Well, I mean, we are having ongoing conversations with multiple parties, and we are open to business. We are open to partners certainly on our capsids, because I mean, look everybody else sees that we are breaking barriers too for gene therapy. And we are also open to partnering on our programs, either programs or capsids, we are open to anything really. One moment for our next question. So yes, the answer to your question is we are looking at a number of things. So when we go in with the gene therapy, we look at vector distribution, where does the therapy go. So we are looking not only where the vector goes, the level of - in the case of GBA, key case activity, the protein, the enzymatic activity. In addition for something like the GBA, we can look in the fluid compartment such as the cerebral spinal fluid for delivery into that space, as a marker and a correlate for how much transduction or delivery we get it to the brain. So for our novel capsids, They are novel capsids. We have identified a receptor for one capsids family, which we think gives us increased translatability in the human. But until we actually do the human experiment, we wonâ\u0080\u0099t know for sure. I think that the delivery of the - in the case of something like GBA will get a correlation between our brain delivery and CSF delivery, which we think should be translatable to humans. In terms of, I think your question, Phil, was about the whether or not we can rely on the biomarker readouts that we are getting from the NHB studies. And I think we can in large part except - I mean for these kinds of things, we need to use larger animals using rodents can be a fooler because the distances, volume just donâ\u0080\u0099t match up very well. But non-human primates, because of their larger size, the dimensions are relatively similar to volumes for example, CSF space, brain approximate the human better than mice, but there is nothing like a real human experiment to get to be absolutely sure, as Todd said. One moment for our next question. Hello, thanks for taking our question. I have two questions, one on receptor, you identifying one on the capsids. So on the receptor, Iâ\u0080\u0099m going to ask Todd to answer that, and then later I will ask Pete to answer the question about the capsids. The receptor is responsible for the BBB penetration in terms of the delivery, what we are seeing in animal models and the animal primates and rodents we are seeing expression in those species. We do know that it is expressed and expressed in the endothelial cells and in the CNS of humans, as it is in the animal model species as well. I mean, maybe I could just add, I mean, I think, you are asking a second order question which is a really interesting question, which I think relates to individual variability within a species. And that is a second order question and we will get there, but we donâ\u0080\u0099t know the answer to that yet. And then with respect to the second question I was going to ask Pete to talk about it, because it relates to the actual agreement I think between the companies. And my understanding is that, after they choose a capsid, they have up to two years to switch out to another capsid. So as we iterate, and develop more and more sort of second third generation capsids, they will - of course we share that data with them and they have the option to choose a newer one, which may more fit their purposes. Al, I think you have captured it quite well with regards to the way that deals were actually structured themselves. One moment for our next question. First one, actually you recently release final CNS gene therapy guidance. And then second, you mentioned the cash runway and some of the possibility there around potential milestone payments. So I think what we are seeing and what we have seen over the past several years is particularly in the past couple, the consistent theme from the field in general and with the FDA. So Laura, with regards to your second question, with regards cash runway. We believe that those additional Pfizer monies in addition to potential reimbursements associated with Neurocrine and other potential milestones that could come downstream, specifically associated with the Novartis option agreement, which comes due to in March of next year, but you could potentially extend the cash runway as you were alluding to. As we have described to the Street, the Novartis option, they do have an option on three separate capsids programs. We believe that potentially those could be struck, although we are not guiding to any of those at this time. So those could be for an additional $18 million for each of those options, so that is a total of $36 million. As we guided in the quarter, we still believe that we have got a fair cash runway to take us into 2024. And I do believe Al, earlier on also alluded to that we are having some ongoing conversations with regards to business development opportunities, all of those things could potentially add to the cash runway as well. I do want to highlight for all the analysts that are on the call today, we did put up a new shelf today as well as an ATM. And again, all of those things could help us as we think about future of the business and finance from the organization. Maybe if I could sneak one more and then just how should we be thinking directionally about R&D expense in 2023 relative to 2022 still early stages, but kind of ramping up some efforts. I think you can most probably see from our operating results for the first time this year that we are basically on a trajectory to kind of close this year somewhere between call it $75 million and $80 million, basically operating burn for fiscal 2022. I think as we think forward towards 2023, we donâ\u0080\u0099t provide definitive guidance with regards to 2023 operating burn. But I do think the one thing I could say to the street is that, we are going to be very mindful of our cash runway and our burn. So for now, at least to start next year, I think we can think about 2023 kind of following suit with 2023, but again no specific guidance there. One moment for our next question. And so our liver and DRG toxicity - sorry, de-targeting built into the capsid, sorry. And so we do think it is important attribute of the capsids that we have identified so far that, while they increased tropism and delivery into the CNS. And you are right, the reason why we added AAV5, AAV9 is the sort of the king of neurotropic capsids. And we can actually - your question about the immunogenicity of novel capsids, we can actually test that too. Everything Al said, I will add that with the changes that we are making to the, AVV capsids, AVV9 and AAV5 in this case. We are excited by the prospect, though that TRACER could be our platform for identifying these novel capsids. One moment for our next question. So somewhat in the similar vein of questions, but I will ask it kind of a different way, which I think might be helpful. Although the SMN protein really was more localized, in expression around the spinal motor neurons. No, that is central to a lot of what we are thinking about in terms of safety. And we actually look at DNA, mRNA and protein, when we get to the point of choosing capsid. And as you pointed out, some of the toxicity is expression related, and some may be SMN protein expression related as pointed out by the paper from Columbia a few years ago. And if we combine that with promoter selection, we can certainly really fine tune expression to a level that is potentially unprecedented. And so we are not just looking at DNA delivery, what is making us successful with the TRACER platform is we really hone in on that mRNA expression level in addition to the DNA delivery. So we look at multiple tissues, all the tissue you would imagine and probably some more, when we evaluate our capsid and build our caps profiles for different indications. The other component is, there are a couple of different ways when we think about targeting a particular tissue or cell type and de-targeting others. The other context is, if we can improve the potency getting to the target tissue, then we can lower the dose, which also in and of itself reduces the delivery to our off target tissues. One moment for our next question. So right now, we donâ\u0080\u0099t know of anything that we would need to manage around. One moment for our next question. I know it is hard to comment for your partners, but as it relates to getting proof-of-concept data I would love to hear any thoughts you may have. And Iâ\u0080\u0099m sure they will tell all of us, when the time is right and when they get more specificity around the timelines. So I do think that, I have only read the press release from Biogen and it does - and it does sound like very exciting times for Alzheimerâ\u0080\u0099s disease treatments. I think - personally, I think we are on the dawn of new treatments for Alzheimerâ\u0080\u0099s disease, which I think is very welcome because certainly the patients need something more than currently available therapy. What I would notice is that, in the field of Alzheimerâ\u0080\u0099s disease R&D, there has always been learnings from previous studies that we use and that the field has benefited from both failures and successes in the past. And so, Iâ\u0080\u0099m looking forward to bringing the data at CTAD in a few weeks. Well, I just wanted to say thank you everyone for joining us and for asking us some very interesting and important questions."
}