{
    "symbol": "HLTH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 22:32:06",
    "content": " I am pleased to report that Cue's financial performance for the fourth quarter delivered $146 million of total revenue, and $54 million, excluding $92 million of deferred revenue, which exceeded our prior financial guidance. While all of this has been done predominantly with our COVID-19 product, we are executing well on our strategy of expanding our test menu, along with increasing the scope of our integrated care platform to have greater actionability on diagnostic test results, and menu expansion of the types of tests and treatments that can be delivered quickly and conveniently through Cue. In addition to support our goal of having a robust test menu, which adds the utility of the Cue Health monitoring system, we are pleased to report that we have completed clinical studies and submitted an EUA for high sensitivity molecular and pox test, formerly known as Monkeypox to the FDA component care use. I'm pleased to share that with the recent launch of Cue Care, a virtual care delivery solution, the Cue Integrated Care platform is now reality, allowing individuals to test from home, talk with a clinician immediately and get treatment delivered to their home within hours. I'd also like to highlight an important recent product category launch, leveraging our integrated Care platform and a Cue Care building block, we have further expanded our testing menu by recently launching 13 at-home test kits. Scripps is conducting a remote trial utilizing Cue's test integrated platform including Cue's diagnostic tests, Cue Care and home medication delivery, aimed at reducing COVID hospitalization rates for immunocompromised individuals. In summary, I'm extremely proud of the trials the team has made during 2022 with four regulatory submissions to expand our test menu, the nationwide launch and subsequent expansion of treatment value  Cue Care and new strategic partnerships in support of our mission to enable personalized, proactive and informed health care that empowers people to live their healthiest lives. Cue's fourth quarter total revenue was $146.8 million, including the recognition of $92.4 million of deferred revenue, which was the remaining balance associated with our agreement with the U.S. Department of Defense. I think as we look forward, we do think the public sector remains active in wanting to mitigate the effective transmitted infections, including respiratory infections, including sexual health infections, we're seeing various states stepped up and into the role of helping protect their citizens by offering services like Cue Care, for example, in Minnesota."
}