{
    "symbol": "LNSR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 10:57:05",
    "content": " Good morning, and welcome to the LENSAR first quarter 2022 financial results conference call. Earlier this morning, the company issued a press release providing an overview of its financial results for the quarter ended March 31, 2022. Joining me on the call today is Nick Curtis, Chief Executive Officer of LENSAR, who will review the Company's recent business and operational progress. Following his comments, Tom Staab, Chief Financial Officer of LENSAR, will provide an overview of the company's financial highlights before turning the call back over to Nick for closing remarks. Today's conference call will contain forward-looking statements, including those statements regarding future results, unaudited, and forward-looking financial information, as well as the company's future performance and/or achievements. These statements are subject to known and unknown risks and uncertainties, which may cause the company's actual results, performance or achievements to be materially different from any future results or performance expressed or implied in this presentation. We have achieved an impressive start to 2022 by returning to our historical growth trends, as well as delivering on our previously-promised critical strategic milestone with the submission, and the FDA subsequent acceptance for substantive review our 510(k) filing for ALLY. In addition to steady growth in procedure volumes, we continue to see increases in both system sales and lease placements for our current generation LENSAR Laser System with Streamline IntelliAxis Refractive Capsulorhexis by increasing systems placed on a worldwide basis to approximately 255 systems. These additional system placements and the associated year-over-year procedure increase represent a strong foundation upon which to launch ALLY, and continued validation of the core feature technology advantages of the current LENSAR System in comparison to other femtosecond lasers available in the marketplace. Furthermore, we intend to continue leading innovation by giving refracted cataract surgeons even greater technology performance and procedure efficiencies with ALLY. This provides LENSAR surgeons the opportunity to broaden use of their lasers to treat more patients, because they have the confidence that they can deliver on their patients' acceptance in these advanced cataract surgical procedures. We also had the opportunity to invite attendees to LENSAR experts meeting, which consisted of three comprehensive sessions covering a deep dive and the user experiences with our current LLS, new clinical data, and review of the first human cases performed with ALLY. For the first time, we opened attendance to include a small group of non-LENSAR KOLs interested in the adoption of LENSAR with ALLY. The turnouts for these interactive sessions was very encouraging, and expanded awareness of LENSAR System's capabilities and the ability of our system to play a key role in facilitating better patient care. Market Scope recognized the LENSAR booth as one of the busiest at the ASCRS, as gratifying recognition of our commitment to delivering cutting-edge technology and the enthusiasm surrounding ALLY. ALLY has the potential to be the first platform in the market to combine a next generation dual pulse femtosecond laser with a world-leading Swiss-made phacoemulsification technology in a fully integrated system, allowing surgeons to prep the patient wants to perform a sterile flax and cataract procedure. ALLY is a transformative system that integrates current LLS core features, including cataract density imaging, customized fragmentation and energy settings, optimized incisions with proprietary astigmatic guidance technology to adapt to every patient condition, surgeon treatment preference in the work environment. I look forward to the remainder of 2022 at LENSAR as we have been able to build off the momentum generated in 2021, and the excitement surrounding ALLY and the SDRS, is confirmation of our beliefs that we're on the verge of revolutionizing the cataract surgery market. Our first quarter 2022 financial results are included in our press release issued earlier this morning, but I'd like to take this opportunity to expand on that information by adding some color to those remarks. Revenue was $9.3 million in the first quarter of 2022, compared to $7 million in the first quarter of 2021. All individual components of revenue, product, lease, and service increased from the first quarter of 2021. In the first quarter of 2022, there were 38,901 procedures sold, compared to 28,122 procedures sold in the first quarter of 2021. Gross margin for the quarter was $4.7 million or a 50% gross margin percentage and represents an approximate $800,000 increase compared to the $3.9 million realized in the first quarter of 2021. By all measures, the first quarter of 2022 was a strong quarter for us, with a 33% increase in revenue and a 38% increase in procedures, both representing impressive performance. Looking to the rest of the year, 2022 represents a transition year for us and we expect our gross margin percentage for the year to approximate 50%, with the latter part of the year having a higher gross margin percentage than the first-half of the year. The transition of our manufacturing from our first generation system to ALLY and supply chain challenges which include difficulty in obtaining inventory, and a higher cost of raw materials lead us to expect a lower gross margin percentage in 2022 than percentages achieved previously. Approximately $600,000 was incurred to replace expensive parts in several installed systems, the replacement of these expensive parts and the magnitude that occurred in the first quarter is considered unusual. Total operating expense for the first quarter of 2022 was $11.4 million, compared to $9.1 million in the first quarter of 2021. The increase in R&D expense for the first quarter of 2022 was related to additional cost for the continued development of ALLY as well as materials purchased for the manufacture of ALLY, which amounted to approximately $2 million. Adjusted EBITDA for the first quarter of 2022, which excludes the effects of stock-based compensation expense mentioned earlier, was a $4.2 million loss compared to a $2.2 million loss in the first quarter of 2021. As of March 31st, 2022, we had cash and cash equivalents of $29 million as compared to $31.6 million at December 31st, 2021. With $29 million in cash at March 31st, a cash burn of less than $10 million for fiscal 2021 in our ALLY 510(k) accepted for review by the FDA, we have a strong balance sheet in which to launch ALLY and have positive momentum going into the second quarter. And it continues to grow really nicely, and the procedure volumes are very encouraging to see. So, we kind of look at things like once a customer has had a system for, let's just call it, six months because there is a ramp up period. And the ramp up period usually consists of getting into a new account, getting the staffs trained -- support staff is very important, getting the clinical operators trained, getting people comfortable with the system, getting the doctors trained to the point where they understand the features and the differences primarily between the LENSAR System and the system that they may have been using prior to the LENSAR  . And so, there is sort of ramp up period, which in that first 90-day period where we look at going from very little revenue to where we were generating good procedure volumes. After that 90-day, they start to get to the procedure volumes that they were at prior to putting LENSAR in there, and then by the time we are in that about four to six month -- four to six months out, we're usually operating very efficiently within the practice and beginning to see procedure growth. You know, given any real shutdown, to your second question, any real slowdown as a result of any COVID variances or something unusual that we can't predict, we see that procedure volumes will continue to be strong, particularly as there -- it appears that there still is a backlog from COVID in just surgical -- available surgical time for doctors to be able to do their cases. And Ryan, just one other thing to add to Nick's comments is, outside the United States, procedure volume was really, really strong in the first quarter. All in all, you're seeing a slight downtick from the first quarter, but it's still a very robust procedure volume, and you'll see procedures increase from the second quarter, or we would expect you'd see that they would increase from the second quarter of '21. Thanks for getting on the call today, and thanks for coming by at ASCRS and seeing the system as well. That said, it would be imprudent on our part, particularly with a brand-new piece of technology that's moved from an R&D into a full  manufacturing, that we're cautious and that we control our launch. And so, we're looking at putting those 10 sites in place, and then following those sites for a few months in order to be comfortable that everything is performing exactly how we expected that we understand what we're doing from a training perspective, that the surgeons are adapting to it, that we're getting what we advertise, so to speak. And then, when thinking about utilization, just following up on Ryan's question there, utilization on the current system versus how we should think about utilization on ALLY. And I know it hasn't launched yet, so I guess TBD, but theoretically, you have to think that utilization could move significantly higher with ALLY, given the improved efficiencies on the system. So, we're working in a couple of different situations here, because you may recall that in past, I've said that most of these systems today, no matter what company they're from, sit outside of the operating room. And that with ALLY, you have the opportunity to move into the operating room, if you want to take advantage of full efficiency of the system to perform a sterile procedure to be able to switch even if you weren't using the LENSAR phaco system and you're using whatever phaco system, you're using today to switch from the Femto to the phaco in a sterile environment, certainly, from a flow perspective becomes much more efficient and faster. And so, we see this happening in part of what we're going to be doing in these 10 accounts is that, you'll likely have a few accounts that will continue to put the laser where they have the laser today in order to just really become comfortable with the system. And we have a private equity group, one of the private equity groups that we're working with actually wants to study and to do some flow analysis with us, because they're interested in ALLY on a much broader basis for more of their practices, and on ORs if you will, so we'll have an experiment where we put one in each of two operating rooms. I alluded to the fact that in our first clinical patients that we had done, the doctor was reporting that we were saving in the treatment time, about two minutes, and in the transport time and prepping the patient another eight minutes, or about 10 minutes with each patient in their cataract journey there, and so really, the next months are going to be in those three scenarios, really testing those things out."
}