{
    "symbol": "NAVI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 11:17:03",
    "content": " FFELP NIM of 94 basis points, private NIM of 290 basis points and originated $447 million of private education loans with $216 million from in-school origination, a 41% increase from a year ago. In addition to the incremental prepayments that were processed in the quarter, this impact includes an estimate of an additional $1 billion of loans that have applied for consolidation in response to potential loan forgiveness prior to quarter end, but these applications have not yet been processed by the Department of Education. While credit trends continue to be below pre-pandemic levels, we are seeing charge-off rates that are in line with our guidance of 1.5% to 2% for the full year, with $28 million of provisions in the quarter included $13 million related to new originations and $15 million related to our $20 billion portfolio as a result of our forecast for a deterioration in the economy in 2023. This was comprised of $216 million of new install volume, representing a 41% increase compared to the prior year and $231 million of private education refinance loans. This reaffirmed outlook excludes regulatory and restructuring costs, assumes no gains or losses from future loan sales or debt repurchases, includes the $0.05 loss from incremental consolidation activity, reflects a continued rising rate environment and the expected expiration of the CARES Act on December 31, 2022. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. In addition, we have future cash flow expectations over the quarter, as well as the ability to tap into our $1.8 billion of private unencumbered loans and the $150 million of FFELP unencumbered loans. Your line is open. But when we look at like trends, for example, in our private loan portfolio, about $3.8 million worth of loans took advantage of COVID-related pandemic relief programs that we offer during the pandemic. Your line is open."
}