{
    "symbol": "GPRE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 14:21:06",
    "content": " United's offtake for this product demonstrates the urgency of developing pathways to decarbonize aviation fuel, and we believe the use of decarbonize ethanol as a low-carbon feedstock, which Green Plains has a supply agreement into the joint venture as well, could be transformational, not only for our company and our shareholders, but also for the whole industry. Your line is open. When we look at our asset values today, obviously you're going to have to watch whether you're subscale or not, but when we look at that today, our view is that the people that are showing up in some of these data rooms from what we understand are really taking the view of sustainable aviation fuel and decarbonization and looking at the IRA and thinking to themselves the optionality that's available in this industry has never been stronger based on all of the different aspects that this industry is heading down. Whether what we are doing on protein, oils and sugars, whether what others are doing around other technologies that they're deploying, whether we're going to do combined heat and power systems on co-generation to reduce our -- not only our carbon, but our energy costs all the way through this sustainable aviation fuel initiative, the optionality in getting a hold of these systems seems to be something that many new players and many other entrants are looking at the U.S. ethanol industry that traditionally they may have looked past it. How are we make a little more than we need every single day, but I think that's going to -- as we see every year, we sat last year at this time, literally on this call, not knowing what Q2 was going to look like and thinking to ourselves, it's going to just going to continue. But a lot of people think they know what's going on in protein pricing because they hear A, B, or C. But we're here to tell you right now, we are effectively sold out for the first -- almost the first half of this year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}