{
    "symbol": "GPRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 10:57:18",
    "content": " During the third quarter, we experienced a challenging margin environment, resulting in a negative $0.09 a gallon margin, some of which were onetime events and the rest largely driven by the record corn basis we experienced across to the Midwest, Southern Indiana and Tennessee, with impacts from the drought lowering corn yields, which tightened ending grain stocks as a result of three lower-than-average crops in a row in the north, the south and again, the Northern Hemisphere. We continued to realize consistent performance, earnings and cash flow, realizing net income of $10.2 million and an adjusted EBITDA of $13 million for the quarter, which is slightly lower than the $13.5 million reported for the same period a year ago, with volumes now trending upward because of higher run rates at the parent, we expect volumes well above MVC levels. The uplift, specifically in yields and corn oil values, is included in our MSC margins, but the base corn of our Gen-1 platform produces just under 300 million pounds, which add $0.70 or $0.80 a pound gross price could generate approximately $150 million to $180 million of consistent earnings above base ethanol. So, when you talk about 560 million gallons converted, today, what we're seeing, basis current values on 50 pro is somewhere between kind of a $0.12 and $0.17 a gallon margin available today and oil share is a strong part of that. So, as we kind of go into the year and we're thinking about 2023, the starting point, this 560 million gallons converted, with margins ranging from $0.12 to $0.17 a gallon, depending on what we sell and potentially upside from there. So, from that standpoint, the fourth quarter looks pretty solid from the ability to begin to generate free cash flow again notwithstanding the fact that we're going to continue to execute on our build program by ending the year with the liquidity we have and again, starting to see some opportunities to generate free cash flow and bringing on things like ultra-high protein next year as well as these higher prices in corn oil pricing. So, I just want to be clear, is that $0.12 to $0.17 purely the high protein value, or is it high protein value plus corn oil on the 550 million gallons that's been converted. And what we're seeing right now is even with higher corn oil prices, obviously, we feel better now that our systems will run with a higher oil share and even potentially with the shrinking at times, and now today, it's not like that between a distiller's value and a high-protein soybean meal value, those spreads will move in and out. But on top of that, we can do things like combined heat and power where it's a $0.02 per point again there, and you can maybe reduce your intensity by 5 to 10 points and your capital is kind of a one to two year payback on that basis of this program because you're getting - basically, the U.S. government has put a program in place to incent you to do this."
}