{
    "symbol": "GPRE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 19:12:02",
    "content": " Today on paper, second quarter margins exceed $0.25 per gallon in the crush margin and that’s factoring in strong renewable corn oil values and our protein business. Green Plains’ consolidated revenues for the first quarter of $781.4 million were higher than the same period a year ago of $553.6 million, driven mainly by higher prices and run rates. Your line is open. Your line is open. And so, while bio fuels is going to have some spikes and obviously like we’ve seen as well as some weaknesses like we’ve seen, when we look at our dextrose and glucose business that we believe will develop over the next several years, those are going to be recurring, predictable cash flows and non-volatile, because we believe we will enter into partnerships and supply agreements and co-location opportunities with potential partners. Your line is open. I think it’s really what baselines – besides what we are doing on protein, oil, sugar and then obviously decarbonization, I don’t think today it’s as easy to buy in ethanol plants than it was five years ago. Part of it is also the ability to move products right now still remains challenging although we’ve done better this quarter that our plants – in terms of getting service in some of our plants last quarter, but we still see challenges across the industry, which is providing opportunities for us for some dislocations at some of the destination markets including the ability to just sell export. Your line is open. Your line is open. So we are seeing that right now and we saw it – we are seeing it as we speak and I think going forward, that’s really going to help to lower the volatility of our operating platform and just so we can just focus on rolling these technologies out, grinding as much corn as we can to get as much of the oil and the protein out of it and letting our plants just run after the investments we’ve made in our Project 24 modernization plans. And so, what we are seeing in the spot market versus the end of the year, you see soy bean oils is somewhat backward dated, but we are starting to see bids show up in the last half of the year and it’s a little bit driven by what you talked about some new demand coming on, others worrying where are they going to get some of the corn oil and the low carbon feedstocks after basically their own UCO or kello supply chain. Your line is open. You can see what the possibility is and so if you get to 2024, on a billion gallons or so, and you are making 60 Pro and oil prices are sitting at $0.80 or $0.85, I think you could see that – those numbers that we’ve outlined in the past would probably be low. And so we just think we are in a unique position notwithstanding some of the volatility that we’ve seen, but it’s not stopping us in order to even sway anything that we were doing, because ultimately, even in Q1, at a low run rate, if we had all of our protein running at 60 Pro and all of our oil running at $0.85 a pound and maybe sugar here and there, we wouldn’t even be having the discussion about ethanol margins anymore."
}