{
    "symbol": "PLAB",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-22 14:42:15",
    "content": " Joining me this morning are Frank Lee, our Chief Executive Officer; John Jordan, our Chief Financial Officer; Chris Progler, our Chief Technology Officer; and Eric Rivera, our Chief Accounting Officer and Corporate Controller. Comments made by any participant on today's call may include forward-looking statements that include such words as anticipate, believe, estimate, expect, forecast, or in our view. I'm pleased to report we achieved revenue of $211.1 million in Q1, which exceeded our expectations. This was against a backdrop of macro challenges and uncertain industry conditions, showing that Photronics was able to navigate a difficult environment very well. Indeed, the IC photomask market has been mixed, with strong demand in certain nodes and softening demand in others. On the positive side, we received strong order flow from Asian foundries for mid-range nodes, from 65 to 45 nanometer, mainly for the smart card, LED driver, automotive, image sensor, IoT and other specific applications. Our customer long-term purchase agreement that we entered over the last few years benefitted us by preserving market share and providing a good mix of product demand, helping us maintain revenue. On the FPD side, our Q1 fab utilization remained at a high level, with smartphone displays showing particular strength for China panel makers. Gross margin and operating margin were slightly softer than Q4 last year, but still maintained at a strong level through continuous cost control management and pricing strategy. Based on current order trends and ongoing input from our customers, we anticipate demand to remain stable in Q2, resulting in guidance that is roughly in line with our first quarter operation results. While demand uncertainty beyond Q2 is higher than usual, we continue to work closely with our customers to understand their demand and ready to support their business. In many cases, photomask demand can remain steady even during an industry downturn as photomask demand is design-driven and not always on the same cycle as wafer starts or display production. Longer term, we believe photomasks are a great place to be in the semiconductor and FPD supply chains. Moreover, the global drive toward regionalization of IC supply will be a positive long-term driver of photomasks, as these new fabs require masks. We believe our global presence, broad technology portfolio and close customer relationships position us well to capitalize on this market trajectory over the long term. We have made a good start in 2023, which will be a challenging year. I have full confidence in Photronics' global team, and we will continue to support our customers by navigating through dynamics as they evolve and by executing with world-class performance in capability, cost and delivery. Before turning the call over to John, I would like to offer a few comments on the continued evolution of export control laws. This may create additional risk for us as we rely on some Japanese firms for material, tools and services necessary to manufacture photomasks. We continually review our import and export practices to ensure compliance with regulatory requirements and work closely with our partners, vendors and suppliers to create plans that best serve our customers. Revenue increased slightly in the first quarter as both IC and FPD were up somewhat from the fourth quarter and successfully offset typical seasonal trends, particularly for high-end technologies. Design activity continued reasonably robust, our commercial teams have done a great job working with customers to understand their technology road map and win orders, and our global team executed well and delivered. IC revenue was $156.6 million, up 0.2% sequentially. An increase in high-end demand, particularly in Asia, offset limited softness in mainstream. The supply/demand imbalance continues to support a favorable pricing environment, and for the most part, we're able to maintain ASP pricing exclusive of premiums established over the last 2 years. Again, growth in high-end revenue more than offset lower mainstream demand. Many times, the production capacity dedicated to strong demand for high-end masks can lead to reduced production of mainstream masks. Gross and operating margins were about 2 percentage points less than fourth quarter margins due to less favorable mix, and somewhat lower expediting premiums that customers pay to accelerate deliveries. Although the revenue increase was in high end, both IC and FPD, not all high-end business is created equal. Difference in mix, including nature of the product, product pricing and margins and location of manufacture, especially related to memory, all affect operating margin outcome. SG&A increased from first quarter last year due to overall higher salaries and wages, driven by labor market conditions and healthcare costs. Nonetheless, operating expenses remained well below the 10% of sales implied in our target model. Due to the degree of variation in the fourth quarter and first quarter amounts, we provided a non-GAAP presentation to demonstrate that operating results, excluding the FX loss, were in line with expectations. On an adjusted basis, net income was $24.4 million and diluted EPS was $0.40. Last quarter, non-GAAP net income and EPS were $31.2 million and $0.51, respectively. For full year 2023, our CapEx forecast remains at approximately $130 million, primarily for increased high-end and mainstream IC capacity. Our cash balance, including short-term investments, was $374 million at the end of the quarter or $340 million net cash after $34 million in debt. Before I provide guidance, I'll remind you that our visibility is always limited as our backlog is typically only 1 to 3 weeks, and demand for some of our products is inherently uneven and difficult to predict. And as this segment of the business grows, a relatively low number of high-end orders can have a significant impact on our quarterly revenue and earnings. Given those caveats, we expect second quarter revenue to be in the range of $205 million to $215 million. We anticipate that the current revenue level will be sustained in the second quarter, and the ability to maintain revenues at this level ratifies our belief that the industry's cyclical phase is not necessarily reflected in demand for photomasks. Based on those revenue expectations and our current operating model, we estimate earnings per share for the current quarter, the second quarter, to be in the range of $0.38 to $0.48 per diluted share. Photomask demand has been stable, and our commercial and operating teams are performing well. Despite near-term uncertainty, we remain optimistic with a positive long-term view of increasing photomask demand. We believe we are the market leader, and we plan to continue to grow and carefully manage margins to keep moving toward attainment of our long-term financial targets. I think I'll defer that one to Frank, who's much more an authority on Chinese New Year and the order rate. Typically, a lot of tape-outs happen before Christmas or Chinese New Year. This year, it's slightly different because of the overall industry environment. But according to the input from our customers and from our sales, we believe the tape-outs may start to happen later in the quarter, but we need to continue to monitor the situation. As far as when that might materialize, I think you have to look at probably a 3-year -- 2- to 3-year horizon at minimum, probably 4 to 5 years, to really achieve the full entitlement of those kind of government-initiated programs. I think for the most advanced nodes, the EUV in particular, I don't see that having a large impact on us. On the midrange nodes, of course, today, I think as you know, the scanner companies are still selling mid-range scanners. If that was severely curtailed, then that has a major impact on future capacity at those nodes because a lot of our key midrange products fit into those nodes. I think everything you said is accurate, and we're still waiting to see the -- what actually Netherlands and Japan finally agree to. And then final question, John, you've talked about CapEx of $130 million this year. But as we mentioned, I think at the beginning of last year, there are still point tools that we can supplement our existing lines with, and to the extent that those are available. We have made a good start in 2023, and we are working hard to serve our customers and control our operations so we can maintain our revenue and margins."
}