{
    "symbol": "INVH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 17:11:07",
    "content": " Your line is now open. I think it's before thinking about models, it’s right to see that we likely have a long runway of above trend growth because we're comparing against a difficult year from last year rather than the residential space aren't last year others in the residential space have concessions. Your line is now open. Your line is now open. It also is a nice complement to our partnerships with our builders and the partners in that space, where they have communities that might be talked a little bit more infill at higher price point and segments with which would be well beyond what our average rents are today and so we view it is completely complementary to what we're doing as we've looked at the customer these higher price points of our own portfolio. Your line is now open. Your line is now open. Your line is now open. 35:51 But as we look forward, we're building partnerships that we think are going to be real win-wins for our residents, as we think about whether it's gym memberships or our convenient food memberships, in terms of thinking about high-speed Internet, which are attractive things to our residents, these are parts of the business that we hope to have a suite of things that we're building over time that's going to help to get to that run rate. And so we're bullish about where that's going, it's early in the process as we disclosed at the end of the first quarter, we had call it our first 50 homes kind of in that program, partners are learning a lot about the customer and I think we'll continue to see some of these shifting opportunities. Your line is now open. We're doing better on the rate side than we expect to both on new lease, as well as on renewals we had high expectations, but we've exceeded those expectations in the first quarter and they continue to trend that way and we've done a little bit better on occupancy as well for the reasons I just described. Your line is now open. Your line is now open. Your line is now open. Your line is now open. You want to make sure that from an operating perspective, keep your square footages in check, so that you don't get into trouble having bigger homes that cost more to turn and obviously on your rent on a per square foot basis you're going be a little bit more elevated, but from a total yield perspective, from a customer perspective, from an ancillary opt in, kinds of services perspective, we're really intrigued by this customer. Your line is now open. Your line is now open. Our residents clearly like the experience of the mobile app, in terms of you reduce the number of trips as Ernie talked like, that's a quantitative difference that we're seeing at our -- ratings are always high on our work orders in the kind of 4.6, 4.7 maybe higher and we're close to 4.9 on the mobile maintenance app, which is really great. Your line is now open. Your line is now open."
}