{
    "symbol": "INVH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:59:06",
    "content": " And I think it's something that, obviously, we've spent quite a bit of time looking at over the years and paying even maybe more attention to, in light of recent volatility around mortgage rates and some of the home price appreciation metrics that are out there. We would like to probably be measured in our approach and just making sure that we feel like -- we're not trying to call a bottom, but I think we'd want to average in over time if there are new valuations that could give us on a risk-adjusted basis a much better return profile. And then, obviously, we've talked over the last couple of years about the need to expand our investment management businesses, because we look at that as extremely accretive growth when, at times, maybe the REIT's cost of capital isn't as good as we'd hope it would be. So we would expect going forward maybe a similar type thing, where you see rent assistance continue to drop off and fade away and likely be gone as we -- it may be a little bit trickles into the first quarter of 2023, but we're not counting on very much there at all. As I mentioned, geographically, California, Southern California specifically is where we're seeing both the kind of slowdown in the rental assistance, as well as the slowdown in the court systems, where historically it might have been 60, 90 days; it's taking 180 to over 200 days. The other markets that we're seeing a little bit of a change -- again, this isn't necessarily behavior of the residents, but it's around the process to move non-payers through are in Georgia, where it used to be 90 days its 150 days-plus. And those are the categories that are really driving, based on what our guidance is you're trying to interpolate what fourth quarter looks like, certainly the highest number we've seen all year, mainly driven by real estate taxes, but also because of some of the other issues. And obviously as we go forward as we look at new opportunities, we're also going to spend more time looking at just call it price volatility and how it could relate to the overall markets over the next year or two. Now that being said and I think it's important to emphasize, we're not seeing anything that's suggesting wholesale changes in the housing market right now outside of maybe new listings coming into the space and decelerating, which should support home prices in the near-term. That being said I think we're also early in where the impact of mortgage rates are and what that could mean for our business both in how we capture existing demand in the marketplace, because one could obviously argue if the cost of owning a home is 60% higher today than it was in January of earlier this year that's a net windfall to single-family rental one would assume."
}