{
    "symbol": "LXRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-03 13:32:18",
    "content": " These risks include uncertainties related to our NDA for sotagliflozin in heart failure and our discussions with the FDA regarding sotagliflozin relating to heart failure and type 1 diabetes; the success of our commercialization efforts with respect to any approved products; the timing and results of clinical trials and preclinical studies of sotagliflozin, LX9211, and our other drug candidates; our dependence upon strategic alliances and other third-party relationships; our ability to obtain patent protection for our discoveries, limitations imposed by patents owned or controlled by third parties; and the requirements of substantial funding to conduct our planned research, development and commercialization activities. Fourth quarter 2022 was another active period for both our lead programs, sotagliflozin, our dual SGLT1 and 2 inhibitor that we're developing for heart failure and LX9211, our AAK1 inhibitor that we're developing for neuropathic pain. As a reminder, this past November, new data from the SOLOIST Worsening Heart Failure trial were presented at the American Heart Association Scientific Sessions demonstrating sotagliflozin significant effects on reducing cardiovascular mortality and the risk of hospital readmissions at 30 and 90 days following discharge after initial event. I will now turn the call over to Craig to provide a reminder on the unique data presented in November by Dr. Bertram Pitt at the American Heart Association Scientific Sessions, assessing sotagliflozinâ\u0080\u0099s effects in reducing cardiovascular mortality and the risk of hospital readmissions at 30 and 90 days following discharge from a heart failure hospitalization. The primary endpoint for the trial was achieved with a statistically significant and clinically meaningful reduction of 33% in the composite of total cardiovascular death, hospitalization for heart failure and urgent heart failure visits with the need to treat only four patients for one year to avoid one endpoint event, finding, which is unsurpassed within the SGLT inhibitor class. This includes an important paper on the time to clinical benefit of sotagliflozin in heart failure patients, transitioning out of the hospital in the SOLOIST-Worsening Heart Failure study by Dr. Verma, which concluded dual inhibition of SGLT2 and SGLT1 with sotagliflozin leads to an early and sustained reduction in outcomes in patients with heart failure that is apparent by 27 days post randomization. As announced at the 16th Annual Pain Therapeutics Summit in Washington, D.C. this past November, not only did LX9211 achieved the primary objective of the study by reducing patientsâ\u0080\u0099 average daily pain score, but the final data demonstrated significant positive effects of LX9211 on measures that are meaningful to patients suffering from diabetic peripheral neuropathic pain, including burning pain and sleep interference, which have a direct impact on patient quality of life, as is shown in the attached slides. As we announced in December during our call, reporting the top-line results from the trial, LX9211 achieved a reduction in average daily pain score of 2.42 points from baseline at week six and compared to a reduction of 1.62 points in the placebo arm with a placebo-adjusted difference of 0.8 points and a p-value of $0.12. Research and development expenses for the fourth quarter of 2022 decreased to $14 million from $16.5 million for the corresponding period in 2021 and for the full year decreased to $52.8 million from $55 million in 2021, primarily due to lower professional and consulting fees in 2022 related to preparation for submission of our application for regulatory approval to market sotagliflozin for heart failure. Selling, general and administrative expenses for the fourth quarter of 2022 increased to $16.3 million from $8.8 million for the corresponding period in 2021 and for the full year, increased to $48.1 million from $32.3 million in 2021, primarily due to increases in salaries and benefits, professional and consulting costs and marketing costs relating to preparations for the commercial launch of sotagliflozin in heart failure. And one of the reasons why these studies in neuropathic pain are so difficult is patient variability, and we actually received quite a bit of positive feedback in the medical and scientific community for the design of the trial with prequalifying the patients with the run-in period, which as weâ\u0080\u0099ve shared with this group before, actually undercuts the overall efficacy because by reducing variability, you are starting the patients already on placebo, which actually lowers their pain score because there is a strong placebo effect."
}