{
    "symbol": "LXRX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:34:04",
    "content": " These risks include uncertainties related to our NDA for sotagliflozin and heart failure and our discussions with the FDA regarding sotagliflozin relating to heart failure and type 1 diabetes; the success of our commercialization efforts with respect to any approved products, the timing and results of clinical trials in preclinical studies of sotagliflozin, LX9211 and our other drug candidates; our dependence upon strategic alliances and other third-party relationships; our ability to obtain patent protection for our discoveries; limitations imposed by patents owned or controlled by third parties; and the requirements of substantial funding to conduct our planned research, development and commercialization activities. As expected, the third quarter of 2022 was an active period for both of our lead programs sotagliflozin, our dual SGLT1 and 2 inhibitor that we're developing for heart failure and LX9211, our AAK1 inhibitor that we are developing for neuropathic pain. Just this past weekend, unique new data from the SOLOIST-WHF trial was presented at the American Heart Association Scientific Sessions demonstrating sotagliflozin significant effects in reducing cardiovascular mortality and the risk of hospital readmission at 30 and 90 days following discharge after an initial event. As Lonnel mentioned, Dr. Bertram Pitt presented an important post hoc analysis of some unique data from the SOLOIST-WHF trial at the American Heart Association Scientific Sessions this past weekend assessing sotagliflozin's effects in reducing cardiovascular mortality and the risk of hospital readmissions at 30 and 90 days following discharge from a heart failure hospitalization. The primary endpoint for this trial was achieved with a statistically significant and clinically meaningful reduction of 33% in the composite of total cardiovascular death, hospitalization for heart failure and urgent heart failure visits with the need to treat only four patients to avoid one event, a finding which is unsurpassed within the SGLT inhibitor class. As a reminder, there were no differences between these two groups for baseline characteristics or the primary endpoint, presented here are the results for cardiovascular death and heart failure related events for the first 30 days post-discharge. The authors concluded that sotagliflozin significantly reduces the 30 and 90 day rates of cardiovascular mortality and heart failure related events, as well as total mortality by 90 days post discharge when administered prior to hospital discharge after an episode of worsening heart failure. So on Monday we really hope to present a more fulsome summary of the overall efficacy results, really putting a qualitative metric around the type of pain and the impact across a range of additional factors that are clinically meaningful to patients as we hear from our experts and providers also will be demonstrating or showing data looking at what happens to the patients after they finish treatment because the current standards of care have some liabilities even after youâ\u0080\u0099ve stopped treatment, that it takes a long time for the side effects to resolve."
}