{
    "symbol": "LXRX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 23:30:37",
    "content": " These risks include uncertainties related to our NDA for sotagliflozin and heart failure and our discussions with the FDA regarding sotagliflozin relating to heart failure and type 1 diabetes; the success of our commercialization efforts with respect to any approved products, the timing of results of clinical trials in preclinical studies of sotagliflozin, LX9211 and our other drug candidates; our dependence upon strategic alliances and other third-party relationships; our ability to obtain patent protection for our discoveries; limitations imposed by patents owned or controlled by third parties; and the requirements of substantial funding to conduct our planned research, development and commercialization activities. As expected, the second quarter of 2022 was a pivotal time for with major milestones achieved for both our dual SGLT1 and 2 inhibitor, sotagliflozin for heart failure and our AAK1 inhibitor, LX9211, for neuropathic pain. Our regulatory interactions have given us confidence in seeking a broad label in heart failure, including patients with and without type 2 diabetes, expanding on the potential opportunity for sotagliflozin. The overall heart failure market is already a very large multibillion-dollar market and is anticipated to further grow at nearly 20% per year for the most of this decade driven primarily by the SGLT inhibitor class and newly adopted guidelines for heart failure in the U.S. We believe that our unique mechanism of action, clinical data in a growing market offers an opportunity for sotagliflozin to achieve blockbuster potential. As Lonnel mentioned, the market for heart failure medications is expected to grow rapidly over coming years as a result of newly adopted guidelines recommending SGLT inhibitors as an element of the standard of care across a broad range of heart failure patients. The guidelines recently adopted by 3 major cardiology societies in the United States, the American Heart Association, the American College of Cardiology and the Heart Failure Society of America, adopt SGLT2 inhibitors as standard of care for heart failure with reduced ejection fraction, with a recommendation at the highest level of confidence and provide a similar recommendation notably with a higher level of confidence than for any other class of therapy for heart failure with mildly reduced ejection fraction and heart failure with preserved ejection fraction which collectively represents 60% of all heart failure patients. Based on the results of our SOLOIST-WHF and SCORED Phase III outcome studies, we are seeking a label that encompasses indications for reducing the risk of cardiovascular death, hospitalization for heart failure and urgent heart failure visits in adults with heart failure, with and without type 2 diabetes, including those with acute or worsening heart failure and reducing the risk of cardiovascular death, hospitalization for heart failure and urgent heart failure visit, nonfatal myocardial infarction and nonfatal stroke in adults with type 2 diabetes, chronic kidney disease and other cardiovascular risk factors. Finally, we believe that with our unique SOLOIST-WHF data, a strategy that is focused on heart failure and even more specifically on the transition of care for patients hospitalized for heart failure and the specialized and concentrated prescriber base that treats these patients, we can be highly competitive in our target market with a modestly sized field force of around 100 reps. And just to summarize the evidence, for the benefit of everyone listening, you showed a 37% relative risk reduction on total CV death,  heart failure in SCORED and SOLOIST versus the much lower 21% on that composite endpoint in the EMPEROR-Preserved trial."
}