{
    "symbol": "GRCL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 14:23:12",
    "content": " Good morning, and welcome to Gracell's First Quarter 2022 Corporate Update Conference Call and Webcast. Please note that for certain information discussed on the call today, including financial data, clinical data, future plans of our programs, Gracell's management will be making forward-looking statements. Actual results could differ materially from these stated or implied by these forward-looking statements as a result of various important factors, and please refer to the Risk Factors section of our latest 20-F filings with SEC for a full disclosure of these risks and factors. Gracell undertakes no obligation to revise or update any forward-looking statements to reflect events and circumstances after the date of this conference call, except as may be required by securities laws. Thank you, Kevin, and again, welcome, everyone, to our first quarter 2022 corporate update conference call. Gracell has made substantial progress over the past quarter, and it continues to deliver across corporate, clinical, and operational initiatives. Following this, I will turn the call over to our CMO, Dr. Martina Sersch, to discuss our clinical development, and then turn to our CFO, Dr. Kevin Xie, to discuss financial results. We are dedicated to developing our rich clinical pipeline, with multiple clinical trials underway, including two R&D approved trials and several investigator-initiated trials, or IIT for short. We continue to advance the IITs for GC012F our autologous CAR-T therapeutic candidates, based on our FasTCAR, next-day manufacturing platform. And currently, we plan to file INDs in the US and in China for GC012F for the treatment of relapsed/refractory multiple myeloma or RRMM for short, during the second half of 2022. We are pleased to - that updated data from ongoing IIT evaluating GC012F for the treatment of RRMM, was selected as oral presentations next month at both conferences, ASCO 2022, and EHA 2022. At EHA 2022, we also plan to present initial data from an ongoing IIT evaluating GC012F for the treatment of relapsed/refractory B-cell non-Hodgkin’s lymphoma, (R/R B-NHL. Turning to the off-the-shelf TruUCAR platform, GC502 is our TruUCAR-enabled CD19/CD7, dual-directed allogeneic CAR-T cell therapy candidates. Mid-April, at an AACR annual meeting, we presented early results of a first in-human clinical study of GC502 for the treatment of relapsed/refractory B cell acute lymphoblastic leukemia, R/R B-ALL. In addition, we’ll be presenting updated data from its IIT study in a poster presentation at EHA 2022 on June 10. Our lead asset, 12F on the FasTCAR platform, has expanded into second indication B-NHL. The second candidate utilizing our allogeneic TruUCAR platform, GC502, which is also our first dual-CAR allogeneic candidate, has presented promising early data at AACR. We're very pleased with the progress so far, and look forward to presenting with three data sets at ASCO and EHA in June. Starting in late February 2022, due to the spread of the highly contagious Omicron variant in China, the Chinese government imposed stricter restrictions, including lockdowns in certain cities and districts, which include Shanghai. We believe that the continued lockdown may temporarily impact our business, but at this point, our clinical development targets and the timelines remain unchanged for the full year. During the first five months in 2022, we demonstrated continued advancement of our clinical programs. Currently we have two R&D trials, and three IIT studies ongoing, and also, two recently completed IIT studies. Meanwhile, we're advancing our early pipeline candidates, and are on track to bring our first SMART CART candidate for solid tumors into clinical stage this year. We also plan to expand our manufacturing capacity by developing a second facility in Suzhou, China, in addition to our state-of-art, 66,000 square feet GMP manufacturing facility. Now, I will hand over the call to our CMO, Dr. Sersch, to discuss the pipeline and our clinical programs. As William mentioned, we were able to expand clinical development of our lead candidate, GC012F, a-dual targeting BCMA CD19 autologous CAR-T into a second indication, B-NHL. Moreover, GC012F is the first BCMA CD19 dual-targeting CAR-T in the clinic for this indication. We had applied for and received US FDA orphan drug designation for relapsed and/or refractory multiple myeloma in 2021, and previously reported interim clinical data from the IIT in relapsed/refractory multiple myeloma at conferences in previous years, including ASH, ASCO, and EHA. We are very excited that the updated data on our multicenter IIT study in RRMM, was accepted as oral abstract presentation for both ASCO and EHA 2022. This data is subject to embargo, and we will be able to provide more details on May 26 after the embargo is lifted and the abstracts go online, as well as after the presentations take place on June 6 at ASCO and on June 12 at EHA. As William mentioned, we are also planning to hold update calls shortly thereafter to discuss the data. We believe the preliminary data holds high promise and remains very competitive, both from an efficacy and safety standpoint in the landscape of autologous CAR-T therapies, as well as the key differentiator of next-day manufacturing, which may lead to a fast availability of treatment to patients, while also potentially avoiding or shortening the need and duration for bridging therapy. Most B-NHL cells express CD19, and there are several CD19-targeted CAR-T therapies already approved in the United States and currently moving into earlier lines of therapy. By simultaneously targeting BCMA and CD19, GC012F is designed to improve efficacy outcome in relapsed/refractory B-NHL patients, while maintaining an acceptable and manageable safety profile. Moving on to the allogeneic TruUCAR platform, our CD19/CD7 dual-directed allogeneic CAR-T candidate, GC502, is the second candidate in clinical stage on our TruUCAR platform, and the first candidate was the dual-directed CAR design. The early results demonstrated the potential of our allogeneic off-the-shelf CAR-T therapy for patients in B-ALL, including those who had previously received autologous CAR-T treatments. Through TruUCAR, it’s designed to reduce risk of rejection of allogeneic CAR-T cells by patients’ immune system, without the need of additional immunosuppressive therapies after the lymphodepletion. In the preliminary data set presented at AACR last month, four relapsed/refractory BLL patients were enrolled and treated in an open-label, non-randomized prospective IIT study in China in two different dose levels between September 2021 and January 2022. As of January 28, all four patients had received a single dose of GC502, including one patient at a dose level 1(DL1) 1.0x107 cells/kg, and three patients at dose level 2 (DL2) 1.5x107 cells/kg. Being the second product candidate from our allogeneic TruUCAR platform, GC502 further validates TruUCAR’s platform approach and potentially wide applicability. The other candidate from the TruUCAR platform is GC027, a CD7-targeted CAR-T cell therapy for the treatment of T-cell acute lymphoblastic leukemia, T-ALL. We have previously reported the promising efficacy and safety data at AACR 2021, and have since added more patients to the study. In addition to our IIT program in multiple indications, we have two IND studies open and enrolling patients in China, including GC019F, which is also manufactured on the FasTCAR platform. Our most advanced program is GC007G, currently a registrational Phase 1/2 clinical trial under a China IND, is ongoing for the treatment of R/R B-ALL patients. Beyond the programs discussed today, we have an exciting early-stage pipeline of product candidates based on our FasTCAR and TruUCAR technology platforms and SMART CART-Technology modules for several indications, including solid tumors and hematological malignancies that we continue to evaluate to move forward into the clinic. We are on track to commence enrolling in a China IIT study for GC503 in mesothelin-positive solid tumors in 2022, and plan to commence a China IIT for GC506, in CLDN18.2-positive solid tumors. As of March 31, 2022, the company had RMB 1.694.7 million, or US dollar $267.3 million in cash and cash equivalents and short term-investments. We expect the cash use for this year to be approximately $100 million to $120 million US, primarily to fund our R&D and the clinical programs in the US and China, and to support expansion of our GMP manufacturing facilities in Suzhou. Net loss attributable to ordinary shareholders for the three months ended March 31, 2022, was RMB 158.6 million, or US $25.0 million, compared to RMB 99.7 million for the corresponding period in the prior year. Research and the development expenses for the three months ended March 31, 2022, were RMB 121.8 million or US $19.2 million, compared to RMB 65.4 minutes in the corresponding period in the prior year. The increase was primarily due to the increased spending on R&D and the clinical trials, as well as higher payroll and personnel expenses attributable to increased headcount and the higher facility-related costs. Administrative expenses for the three months ended March 31, 2022, were RMD 37.9 million or US $19.2 million, compared to RMD 31.8 million for the corresponding period in the prior year. Your line is open. Maybe one first on the GC012F planned US IND, and whether you've had any recent discussions with the FDA, and what would be the appropriate starting dose. And maybe along those lines, where you stand at potentially tying back the US-generated product back to the data you've generated in the China IIT. The intention was not, correct me if I'm wrong, to be able to tie back the product manufactured out of Lonza in the US site, back to the China IIT data. And I guess, I'm just wondering sort of where the process stands along those lines in terms of, Lonza’s sort of manufacturing runs and being able to demonstrate, I guess, comparability to the product you generate out of China. And then maybe on the 012F myeloma update you guys expect in June, maybe you could just help frame up what we should expect to see there. So, what we hope to see is for any big indication, particularly for solid tumor, the response has to be deeper than temporarily shrinking down a tumor and 40%, 50% PR, and trying to wear a patient's shoes after going through a long process and then pay very expensive, not just the CAR-T, also expensive related to the healthcare. Your line is open. So, for the US IND filing of GC012F in the second half, will (indiscernible) for myeloma also potentially including NHL, or the NHL will just come later. So, we are not discussing the B-NHL strategy at the moment, but we are definitely actively looking into all available options to shorten our development timelines for the totality of the program. Yes, let me just take that one because we asked - it's still early, Kelly for the SMART CART. Your line is open. Just a question on 502, given that we saw data, the initial data at the AACR last month. I'm just wondering what we should expect at the update, perhaps in terms of follow-up on those original patients, but also new patients, different doses. Our clinical trials are progressing and we look forward to presenting data from three ongoing IIT trials at ASCO, and EHA, in early June. Our R&D and clinical teams in China continue to timelessly advance our trials and treat patients, given the backdrop of the lockdown restrictions that have been in place in Shanghai since late March. Over the next few quarters, we are focused on securing developing partnerships as one of our key goals of this year and preparing the US and China on the filings anticipated later this year. In conclusion, Gracell is well positioned to deliver breakthrough CAR-T cell therapies capable of overcoming major industry challenges, by leveraging our proprietary FasTCAR and TruUCAR technologies platform. And we look forward to further advancing our clinical programs, and we’ll keep everyone updated along the way."
}