{
    "symbol": "AZEK",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-29 08:27:05",
    "content": " For the fiscal year, we delivered $1.36 billion in net sales, generated $301 million in adjusted EBITDA, representing increases of 15% and 10% year-over-year and delivered $0.97 in adjusted diluted earnings per share. Now turning to our segment results, residential segment net sales for the quarter were $254 million, down 16.7% year-over-year, driven by the previously mentioned channel inventory calibration impact, which was largely in our deck, rail and accessories business. Our planning assumption of a 10% decline in volume, drives us to a target range of approximately $250 million to $265 million of adjusted EBITDA for the full year fiscal 2023. Your line is now open. From an assumption perspective of what's embedded, the way we're thinking about and how you should think about, what's embedded in the EBITDA profile as we expected about $50 million of annualized deflation, of which about $30 million of that will actually hit fiscal 2023 EBITDA with the remainder being a carryover favorable deflation to 2024. Your line is now open. And just one other point on it, as it relates to the first quarter and the $85 million, that's up almost half of the entire year down 10%. Your line is now open. But I believe you mentioned 50% decremental if I heard right for the first half of the year, when you look at your first quarter '22, you did about $60 million -- $59 million of EBITDA. And so, if you're talking about roughly $50 million less revenue in first quarter '23, you've added 50% decremental $25 million, what's the gap between that decremental and some of the other variables that gets you down to your guidance. You're going to have a similar profile for M&A, which again supports and points of that kind of $85 million in volume impact and that's where we're saying that $85 million is really not flowing through it, maybe traditional 38%, it's closer to 50%. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And we haven't really formalized the target externally for working capital, but we know that over the last year, year and a half, we probably put $40 million to $45 million inventory on the balance sheet that we'd like to eventually over the next four quarter or five quarters get off. Your line is now open."
}