{
    "symbol": "AZEK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-03 17:28:14",
    "content": " Your line is now open. Your line is now open. The ability to have a product that's going to sell and also the ability to continue to work with them to grow their business and I would say in a lot of cases, those are the major drivers, the combination of service, the right product and the ability to drive their growth in the marketplace for the long-term, and that's really - with our more realistic looking decking product in our better wood conversion exteriors products. Well, look, I think in the back half of the year, we will continue as we have through the first half to make strategic investments in sales and marketing, we are a growth company, and so that has stepped up a bit in the first quarter year-over-year, especially with a more normalized kind of TimberTech Championship event and again, as we see creating our own demand in the back half of the year. Your line is now open. Your line is now open. Your line is now open. If you look at the dynamics of the interest rate environment we're in., it is still at historically low levels, we see a historically low level of inventory on the market, we see really strong housing values and we continue to see the demographic dynamics of more homeowners coming into the market, and for the foreseeable future from what we can see from the data we are the housing sector in the repair and remodel sector is in a nice position to continue focus and growth in the future and I think more specifically, at our sector you're dealing with a increased focus on outdoor living and you're also dealing with the opportunity that we have that I mentioned on the call that we will talk about probably on every call, which is, there is a lot of sales right now in products that should be our types of products, right? So against that, we continue to invest in new products, we continue to invest in channel expansion and we continue to invest in our downstream sales and marketing efforts with not only with consumers, but the other elements of the chain, and as I pointed out in my prepared remarks, we're really seeing benefits of that once people get used to using our types of materials in new geographies, they tend to it's not a one-time purchase, they tend to use that material and then they tend to expand the use of that material and so we're excited by the beachheads that we need to establish over the last year and expect to continue to establish relative to specific growth rate. Your line is now open. Your line is now open. Your line is now open. So, we've said on previous calls teams have really done a nice job continuing demand, it's sure no matter what the environment is and so we think we're well prepared from our own visibility here in January or as we get to the first week of February, it feels like from an absentee perspective, most of our - of the varying impacts on of Crest wood in the third week of January, and we're starting to now see that taper off so long so we think the worst of it is behind us and we're optimistic about the second quarter. Your line is now open."
}