{
    "symbol": "MCB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-21 11:34:05",
    "content": " Hosting the call today from Metropolitan Commercial Bank, are Mark DeFazio, President and Chief Executive Officer; and Greg Sigrist, Executive Vice President and Chief Financial Officer. During today's presentation, reference will be made to the company's earnings release and investor presentation, copies of which are made available at mcbankny.com. And good morning, and welcome to MCB's third quarter earnings call. I am pleased with MCB's strong and sustained performance, as evidenced by 17.1% return on average tangible common equity this quarter, powered by the strength of our sustained loan growth and NIM expansion. Amid a backdrop of rising interest rates and increasing economic uncertainty, the MCB team has remained engaged with our clients and that commitment shows in our financial performance. In doing so, managing the funding side of our balance sheet by adding optionality has been the cornerstone of successful net interest margin management. Fast forward, MCB remains focused on the management and the development of our diversified lower cost funding base, while looking out two years or more to expand our funding strategies to support the balance sheet growth we have seen over the past 20 years. We saw total deposit growth apart from expected crypto-related deposit outflows, as we were able to source lower cost deposits that were more than offset outflows from the positive seeking treasury rates are looking to substantially reprice existing arrangements. Margin management is reflected in our ability to drive top-line growth in net interest income, with high quality loan growth, funded by lower cost and scalable deposit verticals. As a reminder, we provide basic retail banking services to our digital currency clients, which we often referred to as being crypto-related businesses. For sake of absolute clarity, the services we provide do not include custody or lending against any digital assets, nor are we involved in any stable coin issuances. Revenues from this sector currently represents roughly 2% of MCB's total revenues, or 13% of our total deposits. Total loans were up $1 billion or 28%, total deposits were up $274 million or 5%, including DBAs, which were up $254 million or 9%. Net interest income of $63.3 million, was up 55%. As mentioned, the return on average tangible common equity was 17.1% in the quarter, and our efficiency ratio improved the 45.1% from 47.1%. We reported strong third quarter net income of $25 million, or $2.23 of fully diluted earnings per share. Loan growth and NIM expansion led net interest income higher in the third quarter, with NII increasing 15% to $63.3 million as compared to the prior quarter. Commercial bank performance remains strong, with net loan growth of $242.1 million or 5.5%, bringing year-to-date net loan growth of 23.7%. They're down from the record second quarter, loan originations remain strong at $424 million, bringing total originations for the first nine months of 2022 to $1.4 billion. As expected, crypto-related deposits were down $486 million, led by the effort to promptly return funds to void your customers once approved by the bankruptcy court. This was our second consecutive quarter of measurable inflows of retail deposits, including those with loan customers, with an increase of $151 million in the third quarter. Loan yields  I mentioned more than offset the expected outflows from deposit categories seeking higher yields, which is consistent with our disciplined approach to deposit pricing and margin management. Importantly, the total cost of funds increased a modest 20 basis points, while remaining low at 45 basis points, given our patience and ability to hold the profit betas low to this point in the cycle. For loans, we have taken out a bit more duration, which is evidenced by a modest decline in the floating rate portion of the portfolio, to 41% at September 30, as compared to 44% to begin the quarter. This also shows in our net interest income sensitivity modeling, which has come in a bit this quarter, particularly in the rates down scenarios highlighted in our IR deck. The structural benefits are important elements of our margin management, which provides stability, as rates continue to move up and will provide a significant level of NIM protection when rates inevitably begin to back down. GPG revenues were down $1.1 million quarter-over-quarter, given the expected decline in crypto-related GPR card volumes, partially offsetting this decline with FinTech banking-as-a-service revenues, which were up $312,000 or 14% in the quarter on an 11% increase in related transaction volumes. Overall, expenses continue to be well managed as we are building per scale with a focus on generating near term returns on the investments we make. This has been clearly evident in human capital, where compensation and benefits has continued to scale along with the MCB's growth and profitability, reflecting the continued investments being made particularly in control and infrastructure functions. Apart from our total run-rate, professional fees did increase in the quarter. The primary driver was legal fees, which were elevated by approximately $4 million, with outside counsel engagement focused on Voyager's bankruptcy proceedings as well as other matters. We do expect legal fees to moderate back to historic levels as we move through the fourth quarter, with our expected first quarter run-rate for legal fees in-line with historic trends. We would expect the effective tax rate for the balance of the year to be in the range of 31% to 32%, excluding discrete items recognized in the first quarter. As Greg mentioned, we think as the legal fees will start to normalize through the fourth quarter and we should -- we hopefully we'll be behind it starting in the first quarter in 23. And we also have one other matter, that is a 2020 matter, which we're working through as well. Yeah, but there's only a portion of that line, which is licensing fees, it's subject to any sort of rate variability. And we'd substantially hedge that rate risk out with the interest rate capital that we disclose, Chris. So, I think what you're really going to see in the fourth quarter should largely be in-line with third quarter. That rate cap, the $12.7 million net we referenced in the earnings release, that will come in to P&L on that line over the remaining balance. The hedge period, which I think was in that 28 to 30 month period, it's probably down to closer to 25 months at this point in time. And then on the loan growth side, the balance sheet. No, we're very fortunate, as a commercial banks and as you see the level of diversification we have in our loan portfolio. And when we're not pulling back on any asset class at the moment, and we're just a bit more careful in certain decisions we make regarding certain asset classes. But no, we see very little headwinds ahead of us and looking forward to continuing to support our commercial clients. And then obviously, there's a conversation. But one of the things, I think we benefit from it then being a commercial bank and having significant optionality of diversification on a commercial loan side. Our clients are very high net worth individuals, and we're assisting them in generating significant internal rate of returns on their investments. So they acknowledge that, funding costs are going up, and therefore, loan yields have to rise. And someone told me once it's not a cost of money, it's a cost of not having it. So yes, it was a discussion about it, but I wouldn't suggest in any way, it's a headwind. And then I may have missed it, but I know in the past, you guys have assumed roughly a 70% beta in interest rate sensitivity tables. We just the first to confirm we -- for interest bearing deposits, we do -- we're -- our NII sensitivities with our 70% beta. To this point, our betas have remained low,  I think trying to triangulate when we get to 70%, pf course, it's more of an issue. We do have not only funding options on the table right now, but a pretty robust pipeline of deposit opportunities we're looking at. I still think we're going to stay inside of that, what I still think is a fairly conservative 70% beta. Because, again, to Mark's point, I think it's a key theme this quarter, just the optionality, we have as we kind of think about managing the balance sheet in the margin. So I mean, based on your commentary, I mean, it's safe to assume, at least for the next couple quarters pretty fairly positive NIM trends going forward. And to play back in other way, I mean, even if that deposit beta on interest bearing deposits does trend into the 50 to 60 year slightly higher range. I still think we're going to continue to see some opposites on them, just again, given our disciplines and what we're able to do on the asset side of the sheet as well combined with just overall deposit pricing initiatives. And last one for me, just any update you could give on where you think the $1.6 million of GPG fees, relative to digital currency business and the 762 remaining of the digital currency related deposits. As it relates to the crypto deposits, I think a bit stable at this point. We're seeing a bit pickup in crypto-related transactions, but we play such a small role in that space in any event, so the transaction volumes, therefore the revenue generated from it won't be significant either way, up or down. And on the deposit side, I think that stable. Our volatility last quarter came from Voyager, which is obviously a bankruptcy, that speaks for itself, but GPG excluding crypto, we continue to see expansion there. It's a retail digital bank, within a commercial bank. So it's in a marathon, it takes a lot of time. But once you have those clients, they're here for a while. And if market conditions are such where it puts the economy NIM compression, that is not going to generate the kind of top-line revenue that we expect to achieve, perhaps we would do less lending. We're expecting, as I mentioned earlier, our clients are very active in this market. We are in many different markets, and we have a lot of optionality on the lending side. So we will be in control of that, but we're very conscious of our capital and preserving it and making sure we get the right operating leverage for generating returns. And if market conditions as such, we're talking about margin, if market conditions, somewhat change, where it puts a bit of a concern on asset quality. On the deposit side, outside of the crypto-related balances, there's some good growth in the FinTech deposits. They're executing on their business strategy in the form of the client acquisition strategy, so we're seeing the benefit of their growth, when we sharing in that. We expect to onboard new FinTech companies at a pace that we can manage the risk, because that's the cornerstone of this business is managing the operational risk. And on the property manager and bankruptcy trustee deposits, they continued to decline another quarter. And I think in a couple of cases, the clients were really looking to achieve more of a treasury rate return. Unfortunately, we have the optionality to manage our margin, and we're still very engaged with these clients. So fortunately, we have the optionality around our balance sheet that provides us the ability to say no. And then on to crypto deposits, just to clarify on the $486 million outflow. It was around 70% was Voyager to be candid, and the rest just I would characterize as normal flows in the crypto space. So to the extent that they become useful and less costly than other options, we would consider it. We have the optionality on the rest of the deposit verticals, we have the other strategies we're working on. and I think, the other side of it is, we continue to just in the overall -- continuously funds in client perspective, just to increase our options where you might have seen our FHLB capacity picked up as well. You add it all together, I think we're getting closer and a little more comfortable, but we have options. Yeah, I think as we move through this rate environment, you've heard from every other bank that's reported, Alex. I mean, I think there's definitely competition out there. I think for a lot of folks, you're starting to figure out anyone that wants to be indexed, who -- we have the deposit pricing index is probably, there's some sensitivities, I think, in everyone's book. I think, in the money market side, keep in mind, we have a lot of longer term relationships that are also tied in with lending relationships. Spot rates, I know, you've probably seen some of the spot rates out there around 150 or so. But again, we've stayed focused on the conversations with our clients and continuing to drive the margin management that we're known for. So, I think it's hard to predict what's going to happen to the GPG -- I mean, to the to the crypto side. It's Mark's earlier comment, we're still a very small part -- player in that space. I think for us, though, our banking-as-a-service, retail, FinTech partners, are really starting to hit their stride. And, we're starting to see the uplift now that we knew was going to start happening. So I think, will it completely replace the crypto in the near term, my crystal ball is broken, but we are very excited about the what we see as a continuing trend there. We're just not careful when we are conservative, and we're fairly diversified. And after 23 years of having, virtually no losses and having the kind of balance sheet growth we continue to have, I think being more careful than conservative has played well for us. We're not looking for quick profits, they're looking to build generational wealth. Some asset classes that we do, like quite a bit, obviously is healthcare that continues to serve as well."
}