{
    "symbol": "PEBO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 14:48:14",
    "content": " Our net interest income was up 13% compared to the linked quarter and has benefited from the recent rise in market interest rates, coupled with the accretion income from the leases acquired from Vantage Financial. There were some onetime items reported within our results for the second quarter, which included acquisition-related expenses totaling $602,000, which reduced diluted EPS by $0.02 and the recognition of a death benefit of the cash surrender value of a bank-owned life insurance policy, which added $248,000 or $0.01 to diluted EPS. Our allowance for credit losses comprised 1.1% of total loans at quarter end compared to 1.2% at March 31, 2022, and 1.4% at year-end. Moving on to our loan portfolio, our loan balances increased by nearly $41 million or 4% annualized compared to the linked quarter end, excluding purchase accounting adjustments related to branches and PPP loans. The majority of growth compared to the linked quarter was in consumer indirect loans, which increased $38 million or 29% annualized. Our criticized loans declined by nearly $9 million or 5% compared to the linked quarter end, while our classified loans grew by almost $6 million or 5%. Our net interest income grew 13% compared to the linked quarter, and our net interest margin expanded 43 basis points. Accretion income net of the amortization expense from acquisitions was $3.9 million compared to $2.7 million for the linked quarter, adding 25 basis points and 17 basis points, respectively, to margin. Compared to the second quarter of 2021, net interest income grew 55% and net interest margin expanded 39 basis points. Compared to the prior year quarter, our total noninterest expense grew 25% and was up 30% for the first half of 2022 compared to 2021. Compared to March 31, 2022, the accumulated other comprehensive losses included stock â\u0080\u0093 included in stockholdersâ\u0080\u0099 equity grew by $31 million or 50%. For the remainder of 2022, here are our current expectations: we expect loan growth between 4% and 6%, excluding PPP loans; we continue to anticipate stabilization in credit costs and believe that our annual gross charge-off rate, including leases, will likely return to a more historic level of between 20 to 30 basis points as a percent of the balances for the second half of 2022. From a net interest income perspective, if we get seven rate increases of 25 basis points, five of those being in the third quarter and the remainder in the fourth quarter, this would result in a benefit of approximately $3 million for the last half of the year. We are maintaining our projected quarterly total non-interest expense guidance of between $50 million and $52 million, which includes the cost of Vantage and insurance acquisitions, and we are still on track to have an efficiency ratio below 60% for the full year of 2022."
}