{
    "symbol": "PEBO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 14:56:04",
    "content": " For the full year of 2022, we grew our total revenues by 37%, while growing our expenses by 13% compared to 2021, resulting in positive operating leverage. We had record pretax pre-provision net revenue as a percent of total average assets, which was 2.06% for the fourth quarter and 1.77% for the full year of 2022. Our fourth quarter return on average assets improved six basis points from the linked quarter to 1.51% and we maintained our fourth quarter total noninterest expense, excluding acquisition-related expenses within the range we previously had guided. Our allowance for credit losses stood at 1.1% of total loans at quarter end, slightly lower than the linked quarter end and a decrease from 1.4% at prior year-end. Moving on to our loan portfolio, for the fourth quarter, we grew balances by $96 million or 8% annualized compared to the linked quarter end. Accretion income, net of amortization expense from acquisitions was $2.2 million, adding 14 basis points to margins, compared to $2.8 million and 16 basis points respectively for the linked quarter. Compared to the prior year quarter, net interest income grew 29% and net interest margin expanded 107 basis points. For the full year, our net interest income grew 47%, while our net interest margin expanded 56 basis points compared to 2021. When adjusted for non-core expenses, our efficiency ratio was 55.9%, a decline compared to 56.6% for the linked quarter and 61.5% for the prior year quarter. Compared to the linked quarter, our fee-based income declined 4% while interest income grew, the overall decrease was driven by lower commercial loan swap fee income, which is included in our other non-interest income, along with lower lease and electronic banking income. Lease income grew considerably totaling $1.3 million compared to $600,000 for the prior year quarter. Moving on to expenses, compared to the linked quarter, total non-interest expense increased 2%. Compared to the prior year quarter, our total non-interest expense grew 11%. For the full year of 2022 compared to 2021, our total non-interest expense grew 13%. At year end, our investment securities comprised 24.1% of our total assets, compared to 23.1% for the linked quarter end and 23.8% for the prior year end. However, our demand deposits as a percent of total deposits were still at 48% at year end consistent with the linked-quarter end and prior year end. We grew our book value and tangible book value per share by 13% and 25%, respectively, on an annualized basis, compared to the linked quarter. With that being said, we believe net interest margin for 2023 will be between 4.5% and 4.65%, which assumes relatively flat rate for 2023, as compared to year-end 2022. We anticipate a 20% increase in our total non-interest expense for 2023, excluding acquisition-related expenses, compared to the full year of 2022."
}