{
    "symbol": "ALLT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 13:38:06",
    "content": " Following managementâ\u0080\u0099s formal presentation, instructions will be given for the question-and-answer session. If you have not received it, please contact Allot Investor Relations team at EK Global Investor Relations at 1212-378-8040 or view it in the News section of the companyâ\u0080\u0099s website at allot.com. Mr. Green, would you like to begin, please? With us on the line today are Mr. Erez Antebi, President and CEO; and Mr. Ziv Leitman, CFO. Before we start, Iâ\u0080\u0099d like to point out the Safe Harbor statement. Actual events or results may differ materially from those projected, including as a result, changing market trends, delays in the launch of services by our customers, reduced demand and the competitive nature of the security systems industry, as well as other risks identified in the documents filed by the company with the Securities and Exchange Commission. And with that, I would now like to hand the call over to Erez Antebi. Our third quarter revenues reached $25 million, 35% lower than comparable revenues last year. In September 2022, our SECaaS ARR was $6.9 million, same as June 2022. This was a challenging quarter for us and while these are the results we anticipated for the quarter, I am not pleased with them. As we look into the fourth quarter and into 2023, I definitely expect to see significant improvement and I remain optimistic on the fundamentals and the future. During todayâ\u0080\u0099s call, I will discuss the challenges we are facing, the opportunities we see and why I am confident in the future. Before discussing in detail our different product lines, I would like to address some corporate news, I think, are important. Today, we issued a press release announcing our deal with Verizon business to provide network-based security to provide -- to Verizon SMB, Small and Medium Businesses and IoT, Internet of Thing customers. I believe this is the most significant SECaaS contract Allot has signed to-date, and I am very proud that the Allot has been chosen by Verizon to be the technology solution behind their intended security service. In another press release, which made public today, we announced that Allot Board of Directors has decided to nominate Cynthia Paul to serve as a Director on our Board, subject to shareholder approval. Having known her over the last years, I believe our capabilities, vast experience and business expertise will greatly benefit Allot and I look forward to her joining our Board. One, as anticipated in our previous earnings call, in early September, we implemented some cost-cutting measures that also included reduction of our workforce. Two, exchange rates have fluctuated significantly during this year. Future fluctuations in exchange rates are, of course, hard to predict and may have impact on us going forward as well. The main use cases we see today in CSPs continue to be in traffic management, congestion management, quality of user experience, especially for video, policy and charging control and digital enforcement. As governments look to fight crime and terrorism, we see a growing interest globally and being able to block illegal activities such as drug trafficking, child phonography or terrorism. As they do so, we see multiple opportunities globally where CSPs currently using our competitorâ\u0080\u0099s product are considering a change. In addition, we are working on expanding deals that we won before. In the previous earnings call, I discussed several sizable deals that we expected to book and be able to partially deliver in the second and third quarters and that were delayed. We did not lose any of them and we believe they will close during the coming months, but we cannot be assured of that. As I mentioned in the previous earnings call, given the delay in closing the deals and uncertainty regarding the exact time when we will close the deal and the exact terms required to recognize revenue, we cannot be assured that the revenues we expected from them in 2022 will be recognized this year. Looking at the DPI market in general, we see many opportunities and an overall solid DPI market. However, these opportunities are larger than average and make revenues more concentrated and lumpier. In part, this may be due to the larger size of the deals, it may also be related to the general economic environment and we do not know if this will be a continuing trend. However, it is becoming much clearer to me that our challenges are more on forecasting the timing rather than on the market size or our share of the market. As I have said in previous calls, Allot is transforming into a cybersecurity company and this is where we see most of our future growth coming from. As we look at the market, we see that the direction and momentum of operators interested to launch network-based security services continues to be very positive. The various operators provide services that are on par on speed, coverage and reliability. As they look for differentiation, network-based security is emerging as an important element. There are several Tier 1 operators who have reached the conclusion of providing network-based security to their customers is a significant and important to them, and they are discussing with us how to do so. As we announced earlier, we recently signed a SECaaS deal with Verizon. As Verizon said in their quote, this offering paves the way for a network-based portfolio that will simplify their customer experience and help provide their customers peace of mind. Allot has been working with Verizon, both technically and commercially on this opportunity for quite a while. We are, of course, hopeful that, perhaps, sometimes in the future, after we have proven ourselves in a practice, there may perhaps be opportunities to address some other segments with our offering, but we cannot be assured of that. In our previous call, I mentioned that we have signed deals with three  awarded and in contract negotiation with the fourth. For sake of clarity, Verizon is this fourth operator. While the Verizon deal is extremely important on its own, I am confident that other CSPs globally will consider Verizonâ\u0080\u0099s decision when they make their own decisions on providing network-based security to their customers. In addition, negotiations with several other operators in North America, Latin America, EMEA and APAC, we were awarded deals, but have not signed the contracts yet. On top of that, we are also in serious discussions with additional operators where we have not been awarded yet. This process involves many stakeholders on the CSP side, technical, operational, marketing, purchasing and more. During the year, we increased our efforts to assist in those processes, and in some cases, we managed to help and expedite the process. As discussed in the previous earnings call, we unfortunately concluded that while in some cases, we managed to speed up things, overall, our ability to positively impact the launch date is very limited. As a result, we changed our approach and we will focus our future efforts of speeding up launches mainly on few targeted larger opportunities that we believe can contribute significantly to revenues. During the third quarter, no CSP launched a new SECaaS service with our technology. As of September 30, 2022, of the 25 signed customers, only 11 launched commercially. We do, however, expect one or two additional launches before the end of 2022. While the number of subscribers grew during the third quarter, this revenue growth was offset by negative impact of currency exchange rates, leading to flat quarter-over-quarter SECaaS revenues and ARR. In the fourth quarter, we expect continued growth from existing customers and some modest revenues from new networks. Therefore, we expect SECaaS revenues to be higher. Aggressive go-to-market approaches can include among others, proactively offering the service in every customer interaction, bundling the security offering in the price plan for some or all of the customers, et cetera. Unfortunately, we have learned that merely adding revenues to the CSP is not a strong enough motivation. CSPs have multiple value-added services and these typically have low penetration rates, which CSP seem to be content with. If security is perceived as another value-added service, the expectations of it will be low, the targets given to the working level and the CSP will be low and the results will be low. On the other hand, when an operator sees security as presenting a strategic value, the motivation and results change. What is strategic will change from one operator to another and this can include elements such as, differentiation in the market compared to competitors or motivation to transition customers from 4G legacy service to a 5G service or overall brand perception of the operator as a quote, secure broadband provider, unquote, or motivation to transition the customer from a low tariff plan to a more expensive one and others. The willingness of the CSP to commit to an aggressive go-to-market approach and the contract is to a degree, an indication of how strategic this services to them. These discussions sometimes take time and further delay the launch, but I think they are important to our long-term success. Bringing all the above into account and in line with what we discussed in the previous earnings call, we changed certain elements of our approach to the market. One, going forward, we are shifting our focus from quote, land grab, unquote, for market share and number of CSPs to CSPs with revenue potential in the next couple of years. I can share with you that during the third quarter, we decided not to close with a certain CSP where we were awarded, because we felt the potential revenues were too small compared to the commitment we needed to make. Two, we will push very hard to have CSPs we engage with, contractually commit to an aggressive go-to-market. In fact, we are discussing today with multiple CSPs, including Tier 1s, the possibility of launching the security service as part of the regular price plans to a whole segment of customers, such as all premium plans, for example, in exchange for a lower sub price to Allot. As CSPs try to differentiate themselves and as they understand the importance of network-based security, we find some of them very receptive to the idea. If implemented, it will mean many more customers much faster without necessarily reducing the overall future revenue potential of that CSP to Allot. Of course, we will not always be able to get such a commitment, and we remain pragmatic as we may have to agree to a different approach depending on the CSP. Three, CSPs have medium size that will not commit to an aggressive go-to-market approach and small CSPs regardless of their planned go-to-market approach, our offer commercial terms where our revenues are not dependent on their marketing success. However, it will allow us to focus our resources on the smaller number of CSPs that see more strategic value in the SECaaS service and it will ultimately drive our revenues. As I look at the deals we have done and those that are in the pipeline, I am convinced that the size of this market remains huge. While I am disappointed with the current pace at which our revenues are materializing, I remain very confident in our ability to achieve our long-term goals. In the previous call, I spoke about the challenge of integrating our HomeSecure router agent in specific routers and our efforts to simplify this process, and therefore, help expedite launches of HomeSecure solutions with CSPs. As part of this continuing effort, we announced recently that Allot has joined forces with Vantiva, formerly Technicolor to become part of their ecosystem and pre-integrate our solution on Vantiva Home and SOHO routers. Looking ahead, I want to summarize our expectations for 2022. For the remainder of the year, the SECaaS revenues and ARR are composed at this point almost entirely of the projected performance of the 11 networks we launched plus some projected revenue of new networks yet to be launched. We continue to forecast SECaaS revenues for the whole of 2022 to be approximately $7 million and our December 2022 ARR to be approximately $9 million, with the main risk being possible exchange rate changes and new launches. Despite the change in our approach to future SECaaS deals as I explained before, we expect to achieve approximately $180 million of new MAR in 2022. It is important to note that while MAR is a good indicator for long-term market opportunity, it is not a good predictor for short-term revenue. We still expect the full year 2022 revenues of $125 million to $130 million, trending towards the lower end. As I stated, we have already implemented some cost-cutting measures, and as a result, we expect our OpEx for the year to be between $109 million and $111 million. Likewise, we believe our net cash reduction for the year will also be as previously guided between $35 million to $38 million. While 2023 guidance will be provided in our February 2023 earnings call, I do want to give you at this time a peek into the direction we are looking at. In 2023, we currently expect growth in both CapEx revenues and SECaaS revenues. This will be achieved by some revenue growth, mainly on SECaaS business, but also through tight expense control. Thus, we expect loss in 2023 to be significantly lower than in 2022. While our SECaaS revenues are happening later than we would like and later than we expected, I remain convinced of the very large potential of this business and I am confident that we will grow very significantly in the coming years. I have full faith in our company, in our team and our products, and I believe the actions we are taking makes these goals achievable. And now, I would like to open the call for questions-and-answers, and Ziv and myself will be available to take your questions. Unfortunately not, Eric, as much as I would like to, but itâ\u0080\u0099s a significant operator and we hope for a good and positive impact, but I canâ\u0080\u0099t share any numbers or commit to them. I know you are not -- well, letâ\u0080\u0099s just talk about 2023 and the opportunity for a 10% growth there. Obviously, 2022 is going to be a down year for you as we look to a return to potential double-digit growth in 2023. Itâ\u0080\u0099s coming, I think, from both areas of the business, both some from DPI and some from the SECaaS. And then you -- last quarter, the disappointment around the CapEx deal delays really took the wind out of 2022. Right now, I would like to close them this year. They may or may not close this year, but I have been -- as you understand -- as you know and understand, I have been incorrect in forecasting when they will close previously hence the delay. Like many things in the guidance, there is a -- there are several options that will happen. Some of them will happen, some of them wonâ\u0080\u0099t and we take that into account we build -- when we build our forecast. I think thatâ\u0080\u0099s probably better left for the -- for a more detailed guidance on 2023, when we discussed it in February. Unfortunately, we cannot relate to a specific number since we didnâ\u0080\u0099t provide guidance for next year. So if we take, letâ\u0080\u0099s assume that this year, the revenues will be $125 million. So it means that the revenues next year would be 137.5%, if I am not mistaken by the calculation. Well, given that you have guided the FX down and you are comfortable talking about a double-digit growth rate, we can assume that thereâ\u0080\u0099s leverage on that growth that we wonâ\u0080\u0099t be returning to -- wouldnâ\u0080\u0099t be growing OpEx by the amount that we are growing revenue. â\u0080¦Iâ\u0080\u0099d like to -- I agree with what Ziv said, of course. But I would like to reemphasize, again, we are fully committed to becoming profitable full year in 2024, okay. Now I am not saying that each and every quarter, but for the full year of 2024, we will be profitable. Unfortunately, I think, everything has to do with Verizon intentions on go-to-market or their timing or anything like that is confidential, competitive information for Verizon and I cannot relate to any of it. So I think from your Investor Day from like two years ago, you had presented a top down view of your opportunity. I think at the top down view, it shouldnâ\u0080\u0099t change it, not necessarily, because itâ\u0080\u0099s doing better or worse or exactly on that number, but because, again, itâ\u0080\u0099s one deal with a single operator for a specific sub-segment or subset of their customers. So I donâ\u0080\u0099t see this -- overall, does it change my view of the overall market, I think not. This is on average how much according to our experience with many customers, how much they are willing to pay percentage wise out of the connectivity charge or out of the current ARPU. So now as Ziv -- thank you, Ziv. I talked during this call, I think, I said it quite a few times, that we are trying to work with operators where they bundle security-as-a-service as part of their pricing plans and so on. Something like that happens, then an operator will be offering a plan that is, I donâ\u0080\u0099t know, X dollars per month, whatever. And including that plan there will be so many as, such speed, so many gigabytes of data and security and maybe other things. Now there is -- if we do such bundling, I think, it will be itâ\u0080\u0099s great, I think, both for the operator and for us, but there is no distinct line item that says this is how much the customer is paying for security. So yesterday, you did a press release based on some survey of 1,000 SMB customers of 50 employees or less. It wasnâ\u0080\u0099t the part we were focusing on, honestly, in the survey. Yeah, certainly, we run surveys like this, our marketing department run surveys like this for -- in different countries globally for different segments of the market and we published the results from time-to-time. Yeah, what we see consistently in all these services is that, a majority percentage-wise changing, but basically a majority of customers, whether they are consumers or SMBs or so on, understand that they need to be secured and they understand that there are threats that they understand somebody needs to help them secure and that a very, very large portion is looking at the operator is the one who will secure them. If you ask me to guess, I am here, I am just guessing and the others either donâ\u0080\u0099t think they need security or they think that they can take care of themselves or a variety of other things like that. On the DPI side, the large deals that have been got delayedâ\u0080¦\n Yeah. So we can have a deal of $300,000 and we can have a deal of $3 million and more. We are seeing that we are -- we are seeing today more large deals, I think, than we saw a couple of years ago. I will add on to the group, congratulations on the Verizon deal. It just gives your technology a lot of credibility, and hopefully, that will open up more doors to future deals. So on your -- on previous calls, you have talked about on your traffic management and analytics. Some of them could be because, for example, itâ\u0080\u0099s a think of a mobile operator that wants to launch a 5G network and they want to go to a real 5G network, a standalone 5G core. Another example, it could be that they have made a strategic decision as an operator to move from their own data centers to some sort of shared environment maybe on cloud and so on. And again, they will need to deploy new tech -- different technology than what they have got, because what they have got doesnâ\u0080\u0099t cut it. They have currently a certain product, whether itâ\u0080\u0099s from our competitor or in other fields and that product has reached end of life and thereâ\u0080\u0099s no more support for it. So they canâ\u0080\u0099t get security upgrades, et cetera, for its, et cetera. They canâ\u0080\u0099t live with the product that has no more support, security updates, et cetera. All these reasons open up the issue of, okay, if they are going to do that, now they can make a choice from scratch. And therefore, they canâ\u0080\u0099t be -- and these and there are other probably examples of why they would have to do something and they canâ\u0080\u0099t stay with what they have got. I donâ\u0080\u0099t say if thereâ\u0080\u0099s going to be a global recession, itâ\u0080\u0099s going to be really bad, then the company that decided to launch a 5G network is going to say, okay, we are going to delay for a couple of years. But the strategic reason to move to make these changes is not tied to, okay, they just got tired of this platform and they really have excess money and they want to spend it. They are trying to do something strategically different, each and every operator with its own -- with their own rationale and direction and that necessitates new equipment for them. And I think that, in general, I think that the telecom industry, while recession will hit -- if there is a recession, we will hit everyone. I think the telecom industry is a little bit less -- the hit will be a little bit less dramatic, just because, we -- maybe we will change our iPhone less frequently, but we are not going to give up our connectivity. So at the end of the day, I doubt we will see a huge impact on telecom -- the telecom operators. In your second quarter conference call, you announced that you signed a SECaaS deal with Vodafone to launch security services to fixed broadband customers using Allot HomeSecure products with the intention to deploy in seven different European countries. This is -- itâ\u0080\u0099s -- we are providing the Allot HomeSecure -- under this contract, we are providing Allot HomeSecure to Vodafone and they will install it in for -- in these seven countries, like, I said last time. Vodafone has been a long-time customer of Allot for many things, for DPI, for network security, for other things. And just to be clear, so your new -- original deal with Vodafone was obviously that they just paid upfront and that was basically it. The original deal, the -- for many years ago was for network secure that was used to -- that is being used today to protect their mobile customers. They paid us upfront, and of course, they pay us for expansion, support and maintenance and so on, on an ongoing basis. Even on the network secure deal, they were -- they did different go-to-market approaches in different countries. My last question is, so I just saw that DISH is seeking $2 billion in financing for network build-out in Q1 of 2023. They had some -- they had, I think, some milestone that they had to -- regulatory milestone they had to reach and I believe they announced they reached it. I am not talking about the, I forget the brand nameâ\u0080¦\n Called LOOSE . But on the new network, itâ\u0080\u0099s -- they still have a very small number of subscribers and I am not sure when that number will start growing dramatically. Thank you for taking my question, and hopefully, the Verizon deal will start with something exciting. So if I am looking at fourth quarter revenues, about a $10 million to $12 million gap from where we are in the third quarter. Usually, in our business, most of the revenues are coming towards the end of the quarter. But currently, this is our best estimation of the revenue that we will achieve this quarter. And just a follow-up there, with macro deteriorating, that still gives you guys the confidence to say that we think $35 million is going to be the right number to guide to. Again, according to our forecast, our weighted average right now is around $35 million. Mr. Antebi, would you like to make your concluding statement."
}