{
    "symbol": "ARMK",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-07 13:52:08",
    "content": " Workplace experience group growth levels led the way with a year-over-year increase of more than 40%, driven by client pricing, higher meal participation rates and greater in-person activity in addition to solid new business openings. International organic revenue is higher by 28% year-over-year driven by consistent net new business performance, pricing and ongoing base business volume recovery, particularly within the B&I portfolio where we experienced greater lunchtime participation rates and a return of catering activity for special events, including holiday celebrations and work -- networking gatherings. Organic revenue in our Uniform Services segment increased 7% compared to the first quarter last year, due to solid new business sales and retention rates, as well as the implementation of additional pricing strategies. For the total company, organic revenue of $4.7 billion was 18% higher year-over-year, and consisted of more than 4% from net new business, roughly 6% of pricing and approximately 8% related to higher base business volume. Improved profitability during the quarter compared to prior year was due to leveraging higher sales volume from broad-based net new business growth, pricing and base business recovery primarily within the B&I sector and sports and entertainment business, as well as disciplined operational and administrative cost management, all of which more than offset inflation, a tight labor market, and new account start-up costs. Your line is now open. I -- the first quarter is always probably our slowest quarter from a new business development perspective, as you would expect, particularly in education, most of the sales activity occurs in the latter half of the year as accounts go out for bid and then awarded typically towards the springtime. Your line is now open. Your line is now open. Ladies and gentlemen, please standby. Ladies and gentlemen, please standby. Ladies and gentlemen, please standby. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. We said at Analyst Day, our medium-term algorithm is 5% to 7% top-line growth, that's what we'd expect from the business on an ongoing basis, once the COVID recovery and the base volume recoveries subsided and that also included 1% to 2% pricing. So if you strip it all the way back to that that net growth number, we would continue to expect to see that anchor that 4% -- sort of that 5% -- 4% to 5% as we exit the year and going into 2024 and 2025, the variables are what's pricing. Your line is now open. Your line is now open."
}