{
    "symbol": "CEQP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 10:23:03",
    "content": " Cutting across both years, we built the Continental Express pipeline to connect all of Continental's acreage in the Powder River Basin, which dramatically improves the long-term outlook for the PRB and we successfully integrated all of our acquired assets with our legacy assets in the Williston and Delaware Basins, which gave us cost savings, operating synergies, significantly more processing capacity, new commercial opportunities, and made our capital program much more efficient due to the larger scale in each of these basins. And we're going to continue to carefully and efficiently spend growth capital to expand backbone infrastructure of our strategically located systems and plants and make new well connections, primarily in the Williston and Delaware basins and we have budgeted more than 8% increase in cash flow year-over-year at our mid-point in the guidance. For the fourth quarter of 2022, Crestwood generated adjusted EBITDA of $200 million, and distributable cash flow of $111 million, year-over-year increases of 34% and 22% respectively, driven by our M&A activity over the past year. For the full-year of 2022, our assets generated adjusted EBITDA of $762 million and distributable cash flow of $467 million, year-over-year increases of 27% and 26% respectively. Looking at the segment results, in the Gathering and Processing North segment, fourth quarter 2022 EBITDA totaled $141 million, an increase of 21% over the fourth quarter of 2021, driven by higher natural gas gathering, natural gas processing and water gathering volumes from the expanded operations of the Oasis Midstream assets. In the Gathering and Processing South segment, fourth quarter 2022 segment EBITDA totaled $45 million, an increase of 53% year-over-year. If you adjust our 2022 results for the acquisitions and divestitures completed in both 2022 and 2023, Crestwood would have generated 2022 adjusted EBITDA of approximately $778 million, which incorporates approximately $80 million of EBITDA additions from acquired assets for the periods that we did not own the assets in 2022 and backs off approximately $65 million of EBITDA for divested assets that are recorded in our 2022 reported earnings from last year, including the 2022 contribution from the recently announced divestiture of Tres Palacios. In 2023, compared to the 2022 M&A adjusted number, we are forecasting approximately 5% year-over-year EBITDA growth at the mid-point of our guidance range, which is primarily driven by gathering volume growth on our system and partially offset by lower commodity prices. Although we ended 2022 with a lower volume exit rate than we had previously expected, we are forecasting sizable quarterly EBITDA growth from Q1 of 2023 to Q4 of 2023, driven by approximately 260 new wells to be connected across our G&P systems throughout the year."
}