{
    "symbol": "USPH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:58:22",
    "content": " They've been working extremely hard, along with our regional presidents in conjunction with our partners and our local staff who work every day to provide outstanding care, while we work to make ongoing adjustments during what has been a rather continuously evolving environment in this year to include a rather sharp and significant inflation across all cost areas, coupled with some employee scarcity, which I think we're beginning to deal with more effectively at this point. Injury prevention revenue was at an all-time high for this third quarter at just over $20 million, which was more than 92% improvement compared with our 2021 Q3, and the 27.1% same-store organic growth rate in that business. And our Medicare rates, they dipped in the first and the second quarters of the year, but then they increased in the third quarter due to the adoption of remote therapeutic monitoring, which is new in 2022 and other hard work on the ops team side. Our physical therapy revenues were $117.5 million in the third quarter of 2022, which was an increase of $4.4 million or 3.9% from the third quarter of 2021. Our physical therapy operating costs were $95.5 million as compared to $86.2 million in the prior year, and our margin in physical therapy was 18.7%. Our gross profit was $26.8 million in the third quarter of 2022, and that compares to $29.8 million in the third quarter of last year, and our gross profit margin was 19.2%. Our interest expense increased from $268,000 in the third quarter of 2021 to $2 million in the third quarter of 2022 due to an increase in our debt, primarily related to acquisitions closed since the third quarter of last year and also higher interest rates in the third quarter of this year than last year. In our statement of comprehensive income in our financial statements, you can see that our swap agreement currently has a mark-to-market value of almost $6 million, meaning that the current expectation is it will pay $6 million less in interest expense over the remaining term of our 5-year swap agreement that we would have paid without the swap at a variable interest rate. With solid volumes and rates, we expect our full year results to be within our previous guidance ranges for operating results, which was $2.65 to $2.75 per share and EBITDA also, which was in a range of $73.5 million to $75.4 million, but most likely on the low end of those ranges."
}