{
    "symbol": "USPH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 11:34:03",
    "content": " For the first quarter of 2022, we reported operating results per share of $0.65 as compared to $0.64 in the prior year’s first quarter. And as Chris noted, our reported adjusted EBITDA was $17.9 million for the first quarter of ‘22, an all-time first quarter high for the company and a $2.3 million or 14.2% increase over the prior year, which was the previous first quarter high. Our net rate for our Physical Therapy operations was $103 in the first quarter of 2022, which compares to $104.72 that we reported in the first quarter of last year, which was our highest quarterly net rate in 2021. Our first quarter ‘22 net rate reflects the 0.75% Medicare rate cut and a 15% decrease in rate for care provided to Medicare patients by Physical Therapy assistant, both of which went into effect of January of this year. Our total visits increased by almost 116,000 in the first quarter to 1,063,519 visits, that’s an increase of 12.2% from the first quarter of 2021 to the first quarter of 2022. As Chris noted, our same-store volumes increased 5.9% in the first quarter versus the prior year and we had 40 more clinics on average open in the first quarter of 2022 than in the first quarter of 2021. Our Physical Therapy revenues were $110.4 million in the first quarter of 2022, which was an increase of 10.6% than the prior year. Revenues for the Industrial Injury Prevention business were at an all-time high, $19.1 million in the first quarter of this year, which was a 90.5% increase over the first quarter of 2021. Our operating costs were $105.1 million in the first quarter of 2022 or 79.8% of net revenues, which was up from $86.5 million in the first quarter of 2021. So, that was an $18.6 million increase in costs from the first quarter of the prior year and that was mostly due to the significant increase in visits that we had year-over-year year. When you look at it on a same-store basis, our Physical Therapy operating costs per visit were $81.08 in the first quarter of 2022, up only 0.4% from the first quarter of 2021. And our total Physical Therapy operating costs were $83.09 in the first quarter of 2022, up only 2.4% from $81.18 per visit in the first quarter of 2021. Looking specifically at salaries and related costs, our salaries and related costs for all operations were 57.1% of revenues in the first quarter of 2022, only slightly higher than our 56.8% for the first quarter of 2021. For our Physical Therapy operations only, salaries and related cost were $58.74 per visit in the first quarter of 2022, up only 1.6% from $57.83 in the first quarter of 2021. Our gross profit was $26.6 million in the first quarter of 2022, which compares to $25.9 million last year. And as Chris noted, the lower margin profile of the IIP business that we acquired in November of last year, which had a margin of 18.3% in the first quarter. As a percent of revenue, our corporate costs were 8.8% of revenues in the first quarter of 2022, which was down from 9.7% in the first quarter of last year. The total liability was originally $3.5 million, and it’s now at $2.9 million after recording this change in value in this first quarter. Our net income attributable to non-controlling interest was $3.2 million in the first quarter of this year, which is less than the $3.7 million in the first quarter of last year, even though our operating income from our PT and IIP businesses was higher in the first quarter of this year than last year."
}