{
    "symbol": "USPH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 12:15:19",
    "content": " All things consider, our team produced a really good result for the second quarter with operating results per share of $0.90, which as Chris noted was the second highest quarterly amount in our companyâ\u0080\u0099s history. Our total visits increased 5.7% in the second quarter from 1,084,070 visits in the second quarter of 2021 to 1,145,554 visits in the second quarter of this year with the addition of 41 clinics through both acquisitions de novos net of a few normal course sales and closures since the second quarter of last year. Our physical therapy revenues were $119.1 million in the second quarter, an increase of $5 million or 4.3% from the second quarter of last year. On a per visit basis, out total physical therapy costs were $81.09 in the second quarter of 2022 compared to $76.50 in the second quarter of 2021, which is an increase of 6%. Salaries and related costs were $58.29 in the second quarter of 2022 compared to $55.95 in the second quarter of last year, which is an increase of 4.2%. Our revenues for the industrial injury prevention business were at an all-time high, $19.4 million in the second quarter of 2022, which is a $9.4 million or 93.7% increase over the second quarter of 2021. Excluding our IIP acquisition in November of 2021, our IIP revenue still increased 25.5% in the second quarter versus last year. Our corporate costs were $10.7 million in the second quarter of â\u0080\u009822 as compared to $12.1 million in the second quarter of 2021, with a decrease due primarily to lower estimated bonus expense this year. Our interest expense increased from $237,000 in the second quarter of last year to $987,000 in the second quarter of 2022 due to an increase in our debt, primarily related acquisitions that we have closed since the second quarter of last year and higher interest rates in the second quarter of this year than last year. Our net income attributable to non-controlling interest was $4.1 million in the second quarter of â\u0080\u009822, which is less than the $5 million in the second quarter of the prior year. So over the next 5 years, is that â\u0080\u0093 do you looking out of the next 5 years, do you feel like- seems like there is room for volume growth, but Iâ\u0080\u0099m just trying to â\u0080\u0093 certain one quarter doesnâ\u0080\u0099t make a trend and they are all â\u0080\u0093 itâ\u0080\u0099s still difficult time â\u0080\u0093 there is like you said COVID maybe more fortunately in most cases, a nuisance, as opposed to, not that itâ\u0080\u0099s not serious, but people are just â\u0080\u0093 so things are not a hundred percent efficient. I think for the second half of this year, itâ\u0080\u0099s probably going to be closer to 8.5% to 9% range as a percent of revenue and then probably back to more normal patterns in 2023."
}