{
    "symbol": "WOOF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-30 12:56:11",
    "content": " In a challenging macroeconomic environment, we delivered our 16th consecutive quarter of comp sales growth, added customers for the 15th consecutive quarter accelerated our Vital Care member sign-up rate, made progress in scaling our growth drivers of vet and digital, continue to see product mix shift towards premium and launch landmark partnerships leading brands. And to further our mission of ensuring as many pets as possible, get the best care available, this quarter, we announced our ability to build on our existing double-digit growth insurance business with a new multiyear partnership with the number one player in pet insurance nationwide. While our premium mix differentiates Petco from mass and grocery players, our agility also means we can drive affordability through Vital Care and our Perks programs and with demand continuing to outstrip supply in many parts of the category, the promotional environment remains rational, where we use promotions surgically, not only to remain competitive, but to drive specific outcomes such as BOPIS and loyalty program conversion. Looking at the quarter specifically, net revenue was $1.5 billion, an increase of 4% year-over-year, comparable sales driven by sustained strength in average basket trends grew 4% year-over-year and 20% on a 2-year stack. Gross margin was 39.8%, down 139 basis points year-over-year and 34 basis points quarter-over-quarter, driven primarily by the mix impact of consumable strength and transitory supplies pressure combined with elevated supply chain and associated capitalized freight costs from the first half that are cycling through the P&L. On an absolute basis, SG&A expense was $550 million, up $17 million or 3.1% from prior year, including continued investments in our pet care center partners as we continue to take both a short- and long-term view of managing costs, enabling us to improve retention and positioning us to invest strategically and sustained future growth. So, why would that be the case or are pet parents paying â\u0080\u0093 feeding their animals less or your growth in new customer additions did moderate from 6% in the second quarter to the only being up 0.8% year-over-year in the third quarter?"
}