{
    "symbol": "WOOF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-24 13:38:04",
    "content": " The average pet parent can save over $300 annually and from Petco's standpoint, we capture a far greater share of wallet with around 30% of Vital Care customers due to  and 40% new to services, both up versus Vital Care 1.0. The value of loyalty membership is significant, especially when combining Vital Care with our existing 1.6 million booming and nutrition Perks members, we continue to increase visits and spend by almost 50% and 40%, respectively, year-over-year, and they have over two times higher LTV than average customers. Finally, on digital, our advertising network is now firmly a jewel in Petco's crown with over 200% growth year-over-year, our platform and bespoke data capabilities provide a compelling offering for vendors connected pet parents and convert them down the marketing funnel. Looking at the quarter specifically, we delivered yet another quarter of strong net revenue at $1.48 billion, up 3% year-over-year with comparable sales of 4% or 23% on a 2-year stack with continued strength in average basket trends. Gross margin was 40.1%, down 170 basis points year-over-year and 110 basis points on a quarter-over-quarter basis driven by the mix impact of consumables, onetime Thrive integration-related costs and elevated freight costs. Excluding Thrive, SG&A would have been $540 million, up $14 million or 2.7% from prior year as we remain adept in managing costs while continuing to invest for sustained future growth through infrastructure and our people. Looking at cash flow for the first half of the year, we generated strong cash from operations of $100 million and had $136 million in capital expenditures which increased 36% year-over-year as we continue to reinvest in future sustainable growth across vet, fresh frozen and digital infrastructure. So programs like Vital Care, where I said 30% new to food, 40% new to services with us higher retention, perks programs, repeat delivery going up significantly, 54% growth in recurring growth from recurring revenue customers."
}