{
    "symbol": "ARKR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-15 14:23:13",
    "content": "  Operator: Greetings, and welcome to the Ark Restaurants First Quarter 2022 Results Call. I would now like to turn the conference over to your host, , Secretary for Ark Restaurants. Good morning, and thank you for joining us on our conference call for the first quarter ended January 1, 2022. With me on the call today is Michael Weinstein, our Chairman and CEO; Anthony Sirica, our Chief Financial Officer; and Vinny Pascal, our Chief Operating Officer. For those of you who have not yet obtained a copy of our press release, it was issued over the newswires yesterday and is available on our website. To review the full text of that press release, along with the associated financial tables, please go to our homepage at www.arkrestaurants.com. We refer everyone to our filings with the Securities and Exchange Commission for a more detailed discussion of the risks that may have a direct bearing on our operating results, performance and financial condition. We had a really strong quarter, as you've seen in the press release, as Michael will discuss. As of the end of the quarter, we had approximately $20 million of cash. Of that, $4 million is still outstanding PPP loans, of which we expect $3 million to be forgiven within the next 2 to 3 months. So the balance of that, the $1 million would be repaid over 10 months. We expect our cash based on our current thinking to grow, continue to grow through year-end as we hit the spring and summer months, which we expect to be very strong based on our projections. So our balance sheet is really strong, and we think it will get stronger as the months see progress. We still have a -- in addition to what we have on hand as far as the cash reserves, we still have a $2.5 million receivable on the books for our tax refunds, and we will be applying for additional refunds once we receive those refunds. I think we've discussed these before, but we have not received those funds yet from the IRS, but we are actually working with the tax advocates' office to obtain those refunds. So the quarter was strong, but within the quarter, within our venues, not everything was strong. Alabama was normal, no bump up in revenues from prior years, just the usual. In New York, we were still dealing with Omicron and hesitancy for people to eat indoors, a lack of event participation in the restaurants. So given rest of the country that -- and the weakness in New York, the final results were very satisfying. However, if we can get New York back to where it used to be, I think you will see some very strong results from the company. As I have been in touch with all our managers, we're not just raising prices because we think we can because everybody else is doing so and customers could be accepting it. So for instance, at a Blue Moon in Florida, that's a very high-end restaurant, entrees high $30 to low $40. There, we've been able to raise prices because there's no customer that we're going to get a backlash from. They seem to be well heeled and accepting and -- of the increases, understanding the environment. But when you get to JB's, we have -- or Rustic, we have a very mixed demographic. So some of our restaurants are benefiting from people's knowledge of inflationary pressures, but some of them can't take full advantage of that. And so the price increases have been more modest than you would expect, especially from what your -- the publicity is about restaurant prices. We're also very concerned about the future in terms of as things get normal, cross our fingers, we hope they get normal. When there are other entertainment opportunities for disposable income, will people all of a sudden look at restaurant prices and say, \"This is crazy\" because honestly, they are crazy in many instances. Our labor costs are going up significantly, well beyond minimum wage for certain functions that used to be minimum wage. Example, in New York, we used to pay hostesses around $16, $17 an hour. We can't find them at $24, $25 an hour right now. In Vegas, for instance, we're short 50 people in New York, New York, seems to be continuous. It's very, very hard to find competent people. For instance, in Robert in New York, we're only open 6 days. Our back-of-the-house kitchen employees are all working 6 days, and they're all being paid overtime. So what I'm trying to express, I think, is the framework of how strong our business was given even the weakness in New York and the inflationary pressures we're facing on food cost and labor costs, our hope is, at some point, we see some normalization of food prices. They're not going up anymore, by the way. For us, they're pretty much stable or, in some cases, coming down a little bit. But I do think as people come back into the job market, we will not be paying these excessive overtime fees. We got a distribution this year, a small distribution, basically the equivalent of what our tax bill will be on the -- our share of the  earnings. Our share was approximately $1 million this year, of which we got $200,000 as a distribution. New York State just started sports betting, Internet betting. If they do that, we think that will be a big impetus for Jersey to once again revisit putting in a casino in the north. As I've said in the past, the facility we have at the Meadowlands is already set up to house a casino, a first phase of the casino. Not much else to report, sort of similar to what we were doing last year in these various quarters. The only thing else I should mention is our Vegas leases, as most of you know, they expire January 2023. We've been in lease negotiations with MGM for our various leases at New York, New York. We think, in essence, we've had meeting of the minds, nothing has been signed yet, but I think those extensions are likely. I think interest will probably go up maybe $100,000 to $200,000 a year. We're talking to the bank, but I don't think we'll be refinancing anything in the near future. So obviously, we have, for a company of our size and given the history of the company, we have a lot of cash available to us now, and that's growing. And if there's another variant, what that might do to our business. That may be ultra conservative, but we've been through a lot here, especially in New York City. But if those leases were not signed, that would change our mind about what needs we have for our cash. If you look at when we bought Rustic in, I'm repeating this for people who might not be aware, we paid $7.5 million for a restaurant. At the time, we figured it was making $1.5 million a year. So 5x, but it came with the land, and the land was appraised at $4 million. And we looked at that deal and said, you got to do the deal, number one. And number two, if you, at that point, wanted to do a sale leaseback and give somebody $1 million without an Ark guarantee in rent, probably could have gotten $10 million for the restaurant paying $1 million in rent. So you put $2.5 million in your pocket, and you still own $500,000 a year in cash flow on top of that. And those deals basically dried up, especially in the South, which were -- which is a focus for us. When the pandemic restrictions were removed in Florida, so essentially, everybody rushed to restaurants. Volumes were higher than anybody expected, and everybody who had gotten PPP money to save themselves were all of sudden doing land office business. And those deals were not available to us anymore, even though we were searching. What's interesting to me is I think those deals become available now that we're further away of the pandemic because those restaurants that were for sale where everybody was saying, wait a minute. I have an 88-year-old owner, but the cash flows are excessive. Now those deals are starting to come back a little bit as sales become normalized and sort of the extra sales or revenues that were available to these restaurants because people were rushing out, there was this overhang of demand. As that subsides, these owners are getting to the point where they're saying, \"Well, maybe it's now time for me to exit.\" So all of a sudden, in the last month, we've seen 3 or 4 deals that are sort of interesting, and we're investigating. But to summarize, it's in our interest historically to pay a dividend, and I think that's likely at some point. And I guess we hadn't realized that those kinds of deals in Florida could become available again because if they do, to be able to do another Rustic Inn deal at those kinds of multiples or JB's, then that's first choice for sure over a dividend or buyback from our point of view. Our next question comes from the line of Roger Lipton with Lipton Financial Services. I was going to ask about the dividend, but that's been covered. About $1 million to $1.5 million, we believe. Our next question comes from the line of Jason Walters, private investor. At the last call in December, I believe there was $24 million in cash and $25.8 million in debt. And I think you said, Anthony, that now we're looking at $20 million in cash and $30 million in debt. Well, I think the difference in the cash numbers today, the numbers after float. I think the previous number was probably before float because when you look at the balance sheet, the cash is essentially the same. It was 19.1 at year-end, and it's 20.1 at the end of the quarter on the balance sheet. So I think maybe last quarter, I might have -- the cash balance is on hand as opposed to after float. And now it's $30 million, but the -- well, that's total debt. Oh, the long-term debt, yes, well, I'm talking about the total debt today. And last quarter, it was 25.5. Those would reflect the principal payments that we made, our bank debt we paid quarterly on December 1. And we repaid about $500,000 or $600,000 of PPP loans that were not forgiven. So we think that without an guarantee, that real estate is a 7 cap right now. Within a guarantee, we could get more. And privately, if we syndicated the deals, we get much more. If you look at Rustic and you said, \"Hey, I'm prepared to give up $1 million of cash flow to rent.\" In this interest rate environment, with an Ark guarantee, where we feel very, very comfortable guaranteeing that transaction, I still think you can get $10 million. If interest rates go higher, maybe you get a little bit less. Without an Ark guarantee, you're probably getting $7.5 million, $7 million, $7.5 million for it. If I syndicated and we've done syndications before with our Hollywood and Tampa Hard Rock deals, we syndicated those. That same group, which has gotten enormous returns, would be interested in doing that for probably an 8% return. So I would say conservatively on the pieces of property we own, which are the 2 Alabama properties and the Rustic and the Shuckers property, those 4 properties, probably $25 million right now, give or take a few dollars based upon how you go about structuring the deal, whether with third-party sale leasebacks, syndicating it ourselves. Yes, I think $25 million is pretty easily achievable goal. Our next question comes from the line of Steve Olson, private investor. Regarding restaurant-level operating margins, the last few quarters, they've been very strong, some of which may be the challenges in finding staff. First of all, I think the pressures on food costs will subside somewhat, not so on labor costs. I think where we have rental deals, we're going to see a substantial -- I'm going over the cost in general, not just margins, gross margin. Obviously, our -- the impact of new Vegas lease requirements are going to be greater than what our lease requirements were in the past. However, with increases in revenue in Vegas and more aggressive pricing where we feel comfortable with that pricing, and we've already tested it and we have no pushback whatsoever. Insurance premiums, this insurance market, I am told this is the worst that it's been in decades. We have trouble finding companies that want to bid on a liability package that we're just renewing our insurance, and that's coming up the mid-6 figures. I wish I could tell you with confidence that those price increases will -- menu price increases will stick, and we won't lose headcounts. But so far, I would say to you that I'm optimistic, and I do think wholesale prices will come down. We're doing something new here that -- a matter of fact, we have a meeting today that we really haven't -- we haven't been smart enough to do in the past. But now what we're doing is before we put those menu items into place, we're going to our purchasing department, which is really very sophisticated. We purchased not only for ourselves, but for 100 other restaurants that pay us fees to do so and saying, hey, what would be a substitute for this product on the plate, which is maybe too expensive, and the customers who will accept another product equally as well, where we -- where there's not supply chain problems. I mentioned to people a couple of months ago, there were 3 or 4 days in Southern Florida where you couldn't get French fries because they can't find truck drivers to deliver them. My letter in the annual report, which went out a couple of days ago said, we've been managing chaos every day. I mean, every day, I got a call yesterday from JB's that they got to give increases to some of our line cooks because they're being poached by the restaurant next door to us. They're long-term employees, but $3 an hour more, another $120 a week in their pocket, plus some overtime is significant to them. The problem has been in New York, by the way, where the volumes, I mean, we used to do -- I mean, we do $800, 000 a week at Bryant Park in the summer and good weeks. That drops down to 120,000, 140,000 in the winter when all the outdoor areas are closed. This year, we weren't doing $120, 000 or $130, 000 a week. We were doing $40,000 because of corona, because of some cold weather, the cold weather we always get, because of the lack of events, because there's no one in the office buildings to have lunch, to walk across the street and have lunch. So we're doing $40,000. No, can't cut payroll because if we tell people you're on furlough, they go get another job, and we never see them again. And the chaos of supply chains, it's been mind-boggling. And the only reason we're here, honestly, with these kind of results is the people in the restaurants who have been doing an extraordinary job. But the front-of-the-house people because they're working double shifts and instead of having 6 tables at lunch or dinner, they have 9 tables at lunch or dinner. And when I say exhausted, I really mean exhausted. In addition to managing chaos, they're trying to manage their health and in many cases, not as successfully as we would like to see them. And I know these results look good to you, but believe me, we're inefficient as opposed to where we have been historically. We'll get it efficient again, and the results will improve. And I think the margins will improve, but it's going to take a while. But we've been good at managing chaos, we’ve learned. Well, based upon the results, you sure have been because when I look at your labor as a percent of sales, it's a few percentage points less than what it's been historical. Well, that's because of the bump in revenues in Vegas and Florida and the fact that we're short staffed. Well, we were keeping people on payroll without the revenue. So as the revenues go up as a percentage of total revenues, the payroll comes down, has been coming down a little bit. Our next question comes from the line of Roger Lipton with Lipton Financial Services. I don't have those numbers in front of me, but it's way down. Well, and secondly, it sounds to me like as things normalize, people come back, you do less overtime, but still price rises have probably lagged the increases in minimum wage and so forth. So it sounds like there's a good chance that industry-wide, price rises are yet to come. Is that…\n So I would tell you, I'm not looking at the industry. But you get to the point, and we can use Bryant Park. There are people that have reservations for a table every day of the week, and they use it. If I lose them, I'm losing 10%, 15% of my customer counts. Certainly, when you get to Hollywood and Tampa, the food courts, where you have a captive audience and because with the food courts and what's happened to restaurant prices, in the Hard Rock Hollywood, we're the cheapest alternative by far. So all of a sudden, you can get almost $6 for a slice of pizza, which is ridiculous. The food is good in those restaurants, and they fill up because of the volume of people that go through that place every single day. But for a certain number of people, the food court is the option, and our food is really, really good there and in Tampa. I mean, it's restaurant-quality food in a quick-serve environment. There, we could be aggressive because our customer doesn't have another choice other than to pack their own sandwich, and they're not doing that. But again, other than Gallagher's Steakhouse, we're in a middle-income environment with New York, New York. The whales are not coming to New York, New York. We got to keep our eye on the guy that's driving from somewhere to New York, New York to sleep in a $100 or a $98 room, not in a $350 room. And if you stand at a reception in New York, New York, you'll be amazed at how many people walk in with rice cookers. Right now, I can tell you, at Rustic, that's a restaurant that used to make $80, 000, $90, 000 a week every week. I mean, we're doing great volumes, but the problem is 1 out of 4 people that go to a restaurant or to King Crabs legs. And we're about at the point where half a customer base, if we raised another $1.50, I think would leave. So, yes, we're making nothing. And somewhere along the line, the price of King Crab legs will -- as supply chains loosen up and as the fisheries go out and fish again. Last year, by the way, and we did it again this year, but there was a point about a year ago, my manager said to me, \"Look, these things are going way up. And we said, if you get to me and do it, and we got $1 million. Right now, we probably overpay because the market is softening. You said $180, but we don't have them. And part of that equation, certainly it’s quality of the product, it's service, but price is part of it. You won't lead the way, but if the industry -- if everybody is charging more elsewhere, you'll inch up along the way to cope. Historically, the March quarter is a very rough quarter for us because of bad weather in the Northeast. And we have these 1,000-seat restaurants in Sequoia and Bryant Park that don't have very many events during that time of year. With Omicron extending its way into January, that was a really rough month for us. People are out in New York, although again, the office community is not there. The same thing could be said at Sequoia in Washington, D.C. Sequoia in Washington, D.C. has $400,000 weeks. Right now, they're having $40,000 weeks. If we break even during the March quarter, that would be an achievement. That I think would all be hugging each other here saying, \"Hey, we did a great job.\" And obviously, when you get into the June quarter and the September quarter, that's gangbusters for us, especially if New York comes back. And if there's not another variant, New York will come back. I have a friend of mine, my college roommate, , who runs considerable amount of money, $60 billion right now, I think. He has 200 people in his office, and he cannot yet enforce that people have to come back into the office. People are reluctant, and I think a lot of companies are facing that. But on the other hand, for the first time, I'm seeing some big companies saying, \"You have to be in starting February 28.\" So there is some improvement, we hope, in New York and Washington, D.C. as offices start to be populated again, as people get comfortable that they can do events. I mean, I think there was one company, a big huge company that had a big event scheduled at Bryant Park, and the CEO got COVID. The good news, I would say, in terms of one area where we can pretty well predict what's happening to demand, obviously, it would be interrupted if there was another variant to COVID that got in the way. But our event business, our people are really, really busy right now with phone calls. They've been in the office every single day when the office was empty, just trying to handle an overflow of phone calls. So we think that when we get into especially the September quarter and the first quarter of 2023, which saw this -- the calendar December quarter that the event schedule bookings are going to be enormous. So again, I think we're doing well with chaos and in very difficult times. I'm just hoping that there's no further COVID interruptions, and then I think you're going to see this company fly in terms of what we bring down to the bottom line. And hopefully, that becomes some opportunities to acquire some very good institutional quality restaurants, where owners have just decided to monetize their positions. I hope you've got a good flavor for what's going on, and we'll see you next quarter."
}