{
    "symbol": "VSTO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 12:52:12",
    "content": " Sales were up 38% from Q3 last year, driven by double-digit growth in both our reporting segments, with Sporting Products and Outdoor Products, up 60% and 17%, respectively. Our CamelBak brand drove revenue up over 30% year-over-year in the third quarter, marking the fourth consecutive quarter with growth over 30%, driven by strong demand for bike products, hydration packs and custom bottle designs. Our back country electric bike brand, QuietKat, which we acquired last May reported another record quarter and has been significantly expanding its distribution across the U.S. We have also leveraged our shared resources to help QuietKat continue its rapid growth, most recently by opening a larger and more strategically located shared distribution center in Arkansas with our other brands. Within outdoor products, Q3 sales increased 17% to $335 million driven by growth in outdoor recreation led by Golf and CamelBak as well as Outdoor Accessories and Action Sports led by growth in QuietKat. EBIT margin was 13%, down roughly 70 basis points driven primarily by higher SG&A from acquisitions as we continue to invest in these brands to drive future growth as well as higher selling and marketing expenses as our teams return to events, including trade shows. As we mentioned last quarter, we believe that our Sporting Products segment can continue to operate at high EBITDA margins driven by the lean cost structure in our legacy facilities and opportunities to drive continued growth and operating efficiencies at our Remington plant. We know that as we continue to innovate with new products, as we continue to build out our centers of excellence, as we continue to leverage the synergies within the company that's how you see the outsized margins that we're generating and the strong free cash flow that we're generating that will fuel continued cash flow to drive stock repurchases or however we want to invest in it."
}