{
    "symbol": "VSTO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-05 12:56:09",
    "content": " In the past few fiscal years, we have grown sales from $1.8 billion to over $3 billion, net income from a loss in FY '20 to a net income of $473 million in FY '22, adjusted EBITDA from $114 million to $739 million, adjusted EPS from $0.24 to $8.29 while our share price has appreciated from approximately $10 to $36. Outdoor Products will be a high-growth platform continuing its proven track record of strategic acquisitions of complementary outdoor businesses, furthering its reputation as the acquirer of choice in the outdoor recreation products marketplace and reinvesting in organic growth through new product development, marketing and expanded e-commerce and international sales. Sales rose in Outdoor Products 15% to a record $345 million in Q4, and fiscal year sales for Outdoor Products increased 18% to a record $1.3 billion year-over-year driven by double-digit growth in Outdoor Recreation, Action Sports and Outdoor Accessories. Our outdoor accessories business unit, which includes Stone Glacier and our hunting brands, grew in the low single digits in Q4, marking its eighth consecutive quarter of year-over-year growth in March, which now wrapped up a 12-month 25th anniversary marketing campaign for its hunting laser range finder, a category that Bushnell created. Sales for the segment were up 56% to a record $464 million and up 55% to $1.7 billion for Q4 and fiscal '22, respectively, year-over-year. Q4 sales increased 36% to a record $809 million, the first quarter to exceed $800 million, reflecting growth of 56% and 15% in our Sporting Products and Outdoor Products segments, respectively. Q4 EPS increased 100% to $2.04, and full year EPS rose 127% to a record $8.29, mainly driven by higher sales, gross margin expansion, operating leverage and a lower share count, partially offset by a higher effective income tax rate in the current year. Our strong balance sheet and free cash flow of $292 million enabled us to invest in organic growth, acquire leading high-growth outdoor brands, repurchase $113 million or 5% of our outstanding stock and preserve a net debt to adjusted EBITDA below our 3-year target. For the full fiscal year, we expect sales increasing to $3.15 billion to $3.25 billion, up 5% year-over-year compared to the midpoint, sporting Products sales growth in the mid-single-digit range and Outdoor Products sales growth in the high single-digit range. But as you start to think of our businesses today and where we finished on a last 12 months basis, you've got a shooting sports business and an Outdoor Products business that are $1.7 billion, $1.3 billion, if you will. So I would expect both businesses to be in that $1.5 billion to $2 billion in kind of revenue by the time we look to spin both businesses, when you think about a cash flow and you think about a growth rate, as we've talked about our capital allocation, our Sporting Products business is going to be a lower growth business based upon the accelerated growth we've seen over the past couple of years, but it's in one of the healthiest categories. And so as you go forward here, a lot -- you should think of our Outdoor Products businesses every one of our brands, we expect to grow in our fiscal year 2023, and we expect in total that our margins will expand year-over-year."
}