{
    "symbol": "IFF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:11:06",
    "content": " As a result of these efforts, we are building a stronger financial profile for IFF and are targeting sales growth of 4% to 6% and adjusted operating EBITDA growth of 8% to 10% on a comparable currency-neutral basis over 2024, 2025 and 2026. In 2022, we delivered $12.4 billion in sales, a 9% growth over the previous year on a comparable currency-neutral basis. Adjusted operating EBITDA was approximately $2.5 billion, which equated to comparable currency-neutral adjusted EBITDA growth of 4% versus the prior year. Now on Slide 10, Iâ\u0080\u0099m pleased to share that IFF delivered $12.4 billion in revenue for the full year, representing 9% growth in year-over-year currency-neutral sales. Looking at our overall profitability in 2022 on Slide 11, despite the combination of inflation and global supply challenges, pressuring our profitability margin, IFF delivered 4% growth in comparable currency-neutral adjusted operating EBITDA. For the full year, Nourish achieved currency-neutral sales growth of 11% compared to the previous year, with $6.8 billion in overall net sales. Although, impacted by lower volumes, price increases in Health and Bioscience enabled the business to deliver 4% currency-neutral sales growth in 2022, primarily driven by strong performance across all segments, particularly in culture and food enzymes and animal nutrition. Our Scent division performed particularly well in the quarter, delivering 6% year-over-year sales growth on a comparable currency-neutral basis that was supported by double-digit growth in Fine Fragrance and mid-single-digit growth in Consumer Fragrance. Our Pharma Solutions segment again delivered excellent performance in the quarter, totaling $221 million in sales, a 15% increase on a comparable currency-neutral basis, driven by another quarter of double-digit growth in our core pharma business. For the fiscal year 2023, we expect revenue to be approximately $12.5 billion and adjusted operating EBITDA to be approximately $2.34 billion, representing comparable currency-neutral sales growth of approximately 6% and comparable currency-neutral adjusted operating EBITDA flat versus prior year."
}