{
    "symbol": "STEM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 21:41:05",
    "content": " While the solar side of our business underperformed from a revenue standpoint in 2022 with relatively flat revenue versus 2021, the business continues to generate high gross margins ending the year at 60% and is well-positioned to take advantage of the expected snapback in the solar industry. The backlog increased approximately 19% on a sequential basis from the third quarter of 2022, the largest driver of the backlog increase was the $458 million of new bookings in the quarter offset by revenue recognized as well as $137 million contract cancellation that we disclosed in early January. And because of the -- that's a 60% gross margin business in general, if that doesn't materialize though, we expect that much like in '22, that'll have a negative impact on us for 2023. So, I mean, I think the most obvious is going to be what's going on at the top there, so that's that 17% sequential growth, and I think that's the kind those are kind of be the high-level sign post that you and the other folks should be looking for is -- what are we able to do in terms of total service revenue, just in general. So we'll have to see, which is why in part why I think we're a little bit conservative in terms of the gross margins and some of the revenue growth is that we want to actually have that turn into, revenue and gross margin as opposed to just having good feelings about what's going happen. How are we going to speed up the conversion from a deal when it gets from a booking to equipment delivered to the system actually being operational, and I think that, because that's really, as we all know, that's when the software kicks in, that's where -- and that's the highest gross margin part of the business. And so that's where I'd say, like, when you look at the growth rates that we've had so far, put 9% in the third quarter, 17% in the fourth quarter, that's where you are seeing the actual operating assets being able to generate actual revenue and then gross margin. And AlsoEnergy, of course, and you can see from what they from the tables that are in the back of the PowerPoint deck, which posted, you can see kind of what the software and hardware component of that business is, which we think is what makes it particularly interesting in what's driving that 60% plus margin across that business. I mean -- and I think that is, as we have discussed like as we move up the size graph in terms of how big of size projects that we are working on, it's less and less likely that will supply the hardware, which is all around the project that Mike is leading on the unit controller, the unified system that we are working on and are going to ship here this quarter."
}