{
    "symbol": "TECK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 14:31:06",
    "content": " We now expect QB copper production to range between 170,000 and 300,000 tonnes per year in 2023 to 2025, and compared with the previous range of 245,000 to 300,000 tonnes per year with 2023 at the lower end of the guidance range. As a result, to better reflect the increasing frequency of these adverse events and associated risk of impacts to our operations, we have reduced our 3-year production guidance commencing in 2023 to 25 million to 26 million tonnes from 26 million to 27 million tonnes previously. While we continue to expect our capital expenditures for 2023 to be lower than 2022, with the increase in QB2 capital guidance and continued inflationary pressures, we no longer anticipate a reduction of $2 billion as compared to 2022 projected spending levels. Across the business, inflationary pressures have increased our operating cost by 14% compared to the same period last year with similar and persistent pressures on our capital costs. As Jonathan noted earlier, we have updated our capital cost guidance for the project, and we continue to target first copper from Line 1 in the latter part of this year, followed by completion of Line 2 and ramp up through 2023. The inflationary cost pressures discussed by Red increased our Q3 operating costs by 14% compared to last year, approximately half of the increase relates to diesel costs at our operations and in our transportation costs. Gross profit in the third quarter decreased by 50% compared to last year, primarily driven by an 18% decline in realized copper prices and a 9,000 tonne reduction in sales volumes resulting from the timing of shipments. We reduced our 3-year Highland Valley copper production guidance range to 110,000 to 170,000 tonnes per year as a result of delayed pre-stripping in the Lornex pit, which reflects maintenance-related issues and high rates of absenteeism, particularly in the skilled trades. Compared to last year, adjusted site cash cost of sales increased by 46% to $92 per tonne from $63 per tonne due to lower production and inflationary cost pressures across all major operating cost input categories, a 30% increase in the WTI oil price accounted for 24% of our cost increase year-over-year. We expect upward pressure on our full year guidance for adjusted site cash cost of sales of $87 to $92 per tonne, and we increased our transportation cost guidance to $46 to $49 per tonne due to the expected impact on volumes and demurrage costs. And as Jonathan noted earlier, while we continue to expect our capital expenditures for 2023 to be lower than 2022, we no longer expect a reduction of $2 billion given the increase in QB2 capital and continued inflationary pressures across our business. Clearly, oil sands, carbon an opportunity there to reduce weight in the portfolio through that divestment, something we're very pleased to agreed and have gotten the way Secondly, as you highlight, really, the key approach for us is the growth around copper with the doubling of copper production as we bring QB2 online next year."
}