{
    "symbol": "TECK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 15:50:42",
    "content": " We delivered record adjusted profit attributable to shareholders of $1.8 billion, which is more than 5 times higher than Q2 last year and record adjusted EBITDA of $3.3 billion, driven by strong profitability across each of our businesses. Our results reflect meaningful contributions from each one of our business units, particularly steelmaking coal, of course, which delivered record EBITDA of $2.7 billion in the quarter. On slide 9, our steelmaking coal business unit delivered yet another record quarter with gross profit of $2.5 billion, surpassing the record set last quarter at $1.8 billion. Steelmaking coal EBITDA was $2.7 billion, which was a six-fold increase compared to $435 million last year. Our energy business generated $174 million of EBITDA in the second quarter, driven by strong Western Canadian Select prices, and higher sales. Realized blended bitumen prices in the second quarter averaged US$98.42 per barrel, which was a 72% increase compared to last year. Looking forward, adjusted operating cost guidance for the full year increased to $33 to $36 per barrel from $28 to $32 per barrel previously due to higher natural gas and diesel input costs as well as an increase in contractor costs, but production guidance remains unchanged. Our capital cost guidance remains unchanged, while our COVID-related costs have increased to $1.4 billion to $1.5 billion due to the impact of inflation on labor costs, the ultimate impacts of the Omicron wave that we experienced in Q1 and ongoing inefficiencies, including as a result of COVID-19-related absenteeism, which continues to run at approximately 10% levels. Adjusted EBITDA of $3.3 billion in the quarter represents an increase of $2.3 billion compared to last year, largely attributable to the strong commodity prices I mentioned. In the second quarter, we generated significant cash flow from operations of $2.9 billion compared with $575 million a year ago, driven by record steelmaking coal prices."
}