{
    "symbol": "DBI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-31 12:06:06",
    "content": " We are very pleased with our second quarter results and our continued momentum against our long-term plan of doubling sales of our owned brands by 2026, while maintaining sales levels of national brands as we continue to strengthen relationships with our top partners. We ended the quarter with net sales up 5% compared to the second quarter of 2021, which is on top of last year's record net sales gain of 67% and reported a healthy adjusted diluted EPS growth of 11% compared to the second quarter of 2021. In the second quarter, owned brands sales grew 40% compared to the same period last year. Additionally, our owned brands represented 23% of DBI revenue compared to 17% in the second quarter last year, continuing the significant increases we saw in the first quarter. We have reacquired approximately 2 million clearance customers year-to-date, resulting in clearance sales being up 5% in the quarter compared to being down 5% in the first quarter of this year, a showcase of strong sequential growth. Within this growth, owned brands were up 40% in the second quarter compared to last year, with notable growth in both direct-to-consumer and wholesale channels. Additionally, we continue to see higher freight costs impacting all of our segments, which increased roughly $12 million compared to the second quarter last year as well as some elevated costs related to the consolidation and optimizing of our fulfillment centers. In the second quarter, consolidated adjusted SG&A was $227.7 million, up 4.5% versus last year. Our adjusted SG&A ratio for the second quarter was 26.5% of sales compared to 26.7% of sales last year, an improvement of 20 basis points. Second quarter adjusted net income was $46.1 million or $0.62 per diluted share compared to $43.4 million or $0.56 last year, an increase of 11%. So that we are reaffirming and feel pretty good about as has always been the case, and as we've been signaling all year, we did expect to see some margin deleverage in the back half because most importantly, because we are going after reacquiring that lapsed clearance customer, which is exactly what we started in Q2, and you heard Doug talk about almost two million new customers, incremental customers who have returned to the fold buying clearance and that assortment is building and is really pretty much in place now in the third quarter."
}