{
    "symbol": "DBI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-02 11:40:18",
    "content": " Taking a closer look at the top brands, sales of our top 50 brands of footwear within our U.S. retail segment were 77% of total sales for the first quarter of 2022 versus 57% in 2019. Within our own brands, we saw significant growth in both our wholesale channels, with revenue up 78% versus the first quarter last year and through our direct-to-consumer channels, which saw revenue up 64% to last year. As mentioned at Investor Day, we relaunched the Vince Camuto brand, which has been well received, and we saw strong performance in the first quarter with revenue up 80% across all of DBI versus the prior year period, driven by substantial growth, both in our direct-to-consumer and our wholesale businesses. As Roger mentioned, net sales of our own brands increased by 68% in the first quarter versus last year with significant growth in both the direct-to-consumer, which includes DSW and vincecamuto.com and revenue from wholesale. Owned brands have been a major focus for our company, representing 25% of Designer Brands revenue for the first quarter, a notable increase to last year's level of 18%. Our consolidated gross margin increased 250 basis points to 33.2% in the first quarter versus 30.7% in the prior year, driven by strength in full price selling of product coupled with a shift in mix as our customer is looking for fashion, which historically has had some of the highest margin rates, especially given our core expertise and fashion in our own brands. In the first quarter, consolidated adjusted SG&A for all of our businesses was $222.8 million, up 12% versus last year, with most of the increase coming from the strong return of the customer to our stores, driving up selling expenses along with a smaller increase in our marketing investments. Even with these increases, our adjusted SG&A rate leveraged substantially for the first quarter and was 26.8% of sales, well below last year's level of 28.3%."
}