{
    "symbol": "ATEX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-20 14:25:03",
    "content": " Ma’am, the floor is yours. Good morning, everyone, and welcome to the Anterix fourth quarter fiscal year 2022 investor call. I’m Natasha Vecchiarelli, Vice President of Investor Relations and Corporate Communications at Anterix. Joining me on today’s call are Rob Schwartz, our President and CEO; Ryan Gerbrandt, our COO; Tim Gray, our CFO; and Chris Guttman-McCabe, our Chief Regulatory and Communications Officer. Before we begin, please note that during today’s presentation, we may make forward-looking statements either in our prepared remarks or any associated question-and-answer session. In addition, at the conclusion of today’s call, a replay and transcript of our discussion will be posted to our Investor Relations website. With that, I’ll turn the call over to Anterix’s President and CEO, Rob Schwartz. This morning, I’ll give you an update on our industry progress and customer pipeline, and Tim is going to take you through our year-end financials, and then we’ll open up for questions. As we pursue our goal of being the de facto private broadband solution for the utility sector, I know at times how difficult it is to measure Anterix’s progress beyond the closing of lease contracts. To start with, I’m happy to share that we have three signed letters of intent with utilities in our pipeline, one of which was signed in the past two weeks. As these larger deals are strategically important to our plan, it’s helpful to highlight that some of these very large deals involve expanded processes with utility, adding an increased complexity to help them bring them to completion. Overall, we’ve also seen a positive seasoning of our pipeline. We are using every tool in our toolbox to continue our progress, which now includes our new platform that I’ll describe shortly. In addition to the movement within our pipeline and the LOIs we have secured, the launch of a platform yesterday is another indication of growing market support for offering. Two of the utility industry’s largest trade shows are taking place this week and next, the Utility Technology Council Convention and DistribuTECH. Our team on the ground has shared that the initial response we are getting to this news is exceptional, and while this is no substitute for a signed contract, from an industry perspective, it can’t be overstated how this is further significant endorsement of our goal to drive nationwide utility adoption of 900 megahertz. Built on the foundation of our Anterix Active Ecosystem Program, six initial C-level executives have committed to oversight of this industry cooperation and collaboration to drive 900 megahertz solutions. And while we’ve talked about the significance of our Anterix Active Ecosystem Program, it bears repeating that it’s a great illustration of the support we’re receiving for our offering. This platform is designed to meet the needs and requests of our customers, and we expect the platform to further differentiate our offering in the marketplace, expand our competitive advantage and continue to drive the leasing of our valuable spectrum asset. For our customers, the platform will provide Anterix with the ability to identify utility needs and match those needs with the Anterix Active Ecosystem community we have gathered, harnessing the power and scale of that combination. Amarin, Dominion, Evergy, Exelon, Southern Company and the Utility Broadband Alliance, which represents numerous additional utilities and technology developers. Focusing Anterix and those innovators on real-life industry needs and the development of solutions that will drive economies of scale, lower risk and complexity and accelerate the availability of products. As part of the launch of the platform, five targeted initiatives have been identified, including a 4G, 5G cloud core hosted by AWS, an enhanced multiband communications module and integrated cybersecurity offering, a connected lab environment and a public network roaming management solution. And while the focus of our business remains on monetizing our spectrum asset, the platform will enhance and simply the solutions set for utilities and as a result, drive adoption. From total cost of ownership studies to spectrum valuation, development of business models, rate case strategy, use case development, applying for infrastructure funds and more, the adoption of private broadband has become a strategic decision for these utilities, not simply a replacement of a communications capability. Yes, it takes time, but the outcome of this partnership effort supports not just our near-term customers, but also the entire base of our pipeline, and the resulting multi-decade relationships. And with that, I’ll turn it over to Tim. I’m pleased to announce that for our fiscal year 2022, for the first time on an annual basis, we yielded positive cash flow before share repurchases. Further, we expect receipt of an additional $55 million of contracted proceeds from the SDG&E and Amarin contracts through mid-2026, which will continue to strengthen our balance sheet. As we previously guided, we expect to spend roughly $70 million per year through fiscal year 2024, including approximately $40 million of OpEx and $30 million in spectrum clearing costs. For fiscal year 2022, we spent approximately $35 million in OpEx and $25 million in spectrum clearing costs, which includes returning costs, spectrum acquisitions and anti-windfall payments. Current fiscal year-to-date, we have an additional $10 million in committed funds for contracts not yet closed to clear spectrum. I’d like to note that in the two years since the Report and Order was issued, our spectrum clearing efforts have increased the number of counties where Anterix fully meets the FCC’s broadband licensing requirements to over 2,000 counties throughout the United States. Our business plan continues to be fully funded with approximately $106 million in cash on our balance sheet as of March 31, 2022, and no outstanding debt, providing ample capital and balance sheet flexibility to continue to support our business initiatives. Total activity during our fiscal year 2022 included approximately 215,000 shares repurchased at a cost of $15 million. I’ll conclude by saying that as our spectrum asset continues to increase in value as we converted it to broadband, combined with the overall strength of our pipeline and balance sheet, I am pleased with the foundation we have heading into our fiscal 2023. As we’ve talked about in the past, there’s all kinds of points of entry that utilities have shown, those who have transacted with us and those who are on the process of doing so. I think it’s also worth looking at all of the names of folks – when you saw the press release about the platform, the C-suite C-level folks that are showing the level of support they are for the collective action of the industry is really another indication of how these utilities are stepping forward. As far as the point of timing, I’m going to pass to Ryan in a second, but we’ve said in the past, predicting the precision of timing we know is something that is virtually impossible with the kind of counterparties that we’re working with. To me, the macro indications of what’s happening in the marketplace just continues to give us confidence about the scale of the opportunity and the demand that’s developing for 900 megahertz. And the specific timing, I think it’s still a jump all for us to be able to say how fast those specific LOIs will convert into contracts, but we have confidence if they will. So what makes it – what gets a utility to the point of – I mean when you say LOI, presumably, someone is literally e-signing at least or signing a piece of paper. Like what’s on that paper, that person is willing to sign, as opposed to just saying like, \"Hey, we’re going to continue to work this out and then sign an ultimate contract. Look, again, I know you’ve been through this yourself. In some instances, it’s valuable to frame up a transaction and start with a letter of intent. But again, we’ve done deals, we’ve gone straight to contract and haven’t done letters of intent from them as well. I mean there’ll be multiple ways since we talked about, I don’t see this as the exclusive way that we’re going to see this process progresses, but these are complex processes. As we’ve said before, these are sophisticated procurement teams that we’re working through a lot of the details of these pending transactions. And these types of vehicles can be nice way, be able to begin the process as we’re starting to flesh out kind of key aspects of the delivery, the spectrum transaction, and ultimately work our way incrementally towards the larger deal. I mean what it looks like to me is like, hey, I’m a utility, I’m going through this lengthy process of evaluating it. Maybe some of them are LOIs on that list, I don’t know, but I guess they’re basically – if you bring them together in this manner, it reduces their risk that they commit to something that ultimately an ecosystem doesn’t broaden out in terms of the utilities. So clearly, our 900 megahertz spectrum is part of the 3GPP standard, and there is an ecosystem that exists and companies like Amarin, STG and Evergy are deploying it. This is about how do we create a process for continuous innovation on this 3GPP standard of 900, and how do we create an ecosystem around not just the infrastructure and the devices, but going up the vertical stack of applications, the cybersecurity offering is called out there as an example. And so for us, it’s not about getting customers to contract with this, although it’s clearly going to be a catalyst for that, it’s about how do we create an environment that creates a continuously valuable solution over the multi-decades that we’re signing these agreements. And Rob…\n If these people are in some type of forum where they’re having these discussions, shouldn’t that make it easier for you to try and get a services business off the ground or maybe you create some type of cloud based core,  Web DISH is doing and enable that to be shared across multiple utilities. If you noticed the five initiatives that we’re putting forward, the first is a 4G, 5G cloud core, and we’ve talked about that we’re doing it in conjunction with AWS. And it’s not just about having a cloud core for an individual utility, it’s about what that does collectively. So when – and I mentioned cybersecurity, if you’re coming in at a collective effort to be able to connect to these utilities, being able to detect the threat landscape across utilities and be able to use that broader information to be able to react to those kind of issues across the board is so much more valuable. I mean scale is an overused word, and yet when you think of this new platform and you think of apply the word scale to both sides of the equation, on the utility side, we’ve got a half dozen executives. And then obviously, on the other side, you’ve got the 80 companies poised to deliver on those needs. And so it’s – and in between, you have five products right now with what we expect to be dozens and dozens more going forward. And it really drives – again, overused word, but it really drives scale to all sides of the decision-making, both before utility contracts and then after the contract. We can’t forget that, and Amarin started their efforts in advance of us having an FCC ruling. We do think there’s absolutely – as pioneers break the ice here, there’s going to be – it makes it easier for others to move forward. But you are correct that the complexity of these transactions is, I would say, more significant now that we’re getting into it because of the strategic rationale. But specifically within the utility sector, I touched on cybersecurity and needless, you don’t have to open a paper to understand that every day, there’s increasing threats from what’s going on in the global landscape that utilities are one of the primary focuses. It is now a nationwide risk issue, and we’ve demonstrated and San Diego Gas & Electric has publicly talked about and work with Schweitzer about the value of being able to use these to prevent wildfires. It’s not a telecom question, it’s a strategic decision about how they use these to be able to mitigate wildfires. And now with the decarbonization objectives of all utilities and our global commitments, the need to be able to have two-way communications out to all these distributed energy sources is also happening, but that’s a very complicated problem utility to trying to solve. And so we’re now integrating to solving these top strategic issues for utilities, and those take time from a planning standpoint, of which we’re a component of it, but we’re not driving solely. And so it’s not just about purchasing spectrum or leasing spectrum or building an LTE network, it’s about solving these macro problems and that does increase the complexity and timing, but these are issues that must be solved by utilities. So that’s why when we say, it’s not if but when. We’re certain that the communications systems for providing are going to help solve these, but the complexity of the decision-making absolutely is elongated because of the strategic nature. In the past, you’ve said that the final stage of the pipeline, there was about $400 million in there. Obviously, we’ve got some activity as Rob hit on in the prepared remarks, too, in terms of the developing through both Phase 2 and Phase 3. As we said, obviously, we’re focused – laser-focused on the next deal, but the ability to move the volumes through is really where the critical mass comes from as we’re also keeping our eye on the fiscal year 2024 goal and how we continue to progress those through. I think, Phil, we’re still seeing a preference for prepayment for most of our utilities. So I think, generally, we’ll continue to see that trend. We are, as I mentioned in my comments and some of the responses earlier, still see lots of signs of why this growing demand, while the processes individually take a lot of time, everything is moving forward in a really strong and powerful way. And I think this platform announcement and support is just another sign of that, and as we see this collective solution coming together, we think it makes it even easier for utilities to understand and transact. Letters of intent we’re talking about didn’t really touch on it yet, but the federal funding, we see as a coming stimulus as well. The speed of each individual transaction absolutely frustrating that it doesn’t go as fast as we’d like, but we haven’t seen anything indicating that there isn’t forward movement across the board. Yes, I’d like to add one thing. I want to come back to – we talked a little bit about kind of the evolving strategic imperative as it relates to the complexity in terms of how we’re engaging the deals, but there’s a flip side to that, that I think is very positive to your question, Simon. That strategic imperative and the fact that we are seeing this elevate into a C-suite issue and private LTE and broadband being directly relatable to the solution set that utilities are exploring for reliability, for clean energy goals, for providing cyber protections, only further reinforces the logical outcome and the critical importance that private LTE is playing, both in their near-term tactical plans and in the broader strategic plans. So those indicators are critical as we’re seeing the general trajectory – time aside for a minute, but in terms of the big picture of how we see adoption ultimately play out. No, that’s a little bit of a moving target as we deliver spectrum, but based on the parameters of the contracts this fiscal year, we should receive those dollars. As you know, we’re working with numerous utilities that either have CBRS licenses or using unlicensed CBRS. And we see the integration of that, as we’ve talked about for a while as being a really strong complement having a communications module, and this is – for those who don’t know this, it’s the card that gets slotted into most communication devices, especially those that are used for fixed wireless like a Cisco or GE device that puts it with – on a cellular network. Those – the commonality of those cards to have multiple bands, CBRS and 900 plus other bands of carriers, so we have the ability to deploy it immediately, start on carrier network and evolve onto your private network as it gets built out. So we see that as being a highly functional product, and it’s a great example of kind of the crowd sourcing that we did across the ecosystem of the vendors that all needed this, utilities that we’re asking for it, but there was no one at a central point that was going to take the collective action to help develop it and create the economic benefit for the industry and for us and our shareholders. So to the LOI’s range and what in them, contained in them, and they’re all under NDA. So I can’t really reveal the specifics, and – but in general, there are indications of directional interest in getting the contract and contract specifics, including pricing as well. So – and so for us, it’s just, again, another indication directionally of the volume of utilities. Not the only path forward, Mike, and we see it as just a good indication from those three utilities about their commitment to move forward. Yes, we’re still confident, Mike, about fair market value being in that range for sure. From our experience to date, as you know, it’s a wide range, but it is what defines fair market value for us and that includes the conversations with the parties that are in those non-binding LOIs. I don’t have it offhand, Mike, but happy to share that with you from the information we have. There’s service territories, as you know, is public information. And it’s really a question of timing of how we convert that to cash flow, but the asset remains on our balance sheet. And every day that goes by as we see more and more interest in private networks, we see that, that – the value of that asset continues to increase from our perspective."
}