{
    "symbol": "FATE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:56:06",
    "content": " We will focus today's discussion on upcoming clinical and preclinical data presentations for our off-the-shelf IPS-derived CAR NK and T cell programs for the treatment of cancer, and how we expect our first-in client pipeline to advance and evolve in the coming months, including through our collaborations with Janssen and ONO. At SITC, we plan to report clinical data of the first three patients treated with FT536, as monotherapy, in the first dose escalation cohort at 100 million cells per dose. At ASH, the initial clinical data presentation for FT576 will include approximately nine patients, six patients in the single-dose escalation cohorts of 100 million cells and 300 million cells is monotherapy and three patients in the single-dose escalation cohort of 100 million cells in combination with daratumumab. During our R&D Day, we plan to review clinical data of approximately 30 patients with relapsed/refractory AML treated in three dose escalation cohorts, ranging from 100 million cells to 1.5 billion cells per dose. In addition to our program reviews, we also plan to share feedback from the FDA under our FT516 RMAT designation where our interactions to date have spanned the entirety of our iPSC product platform from iPSC generation, engineering and cell banking, routine GMP production and drug control strategy, clinical development considerations, including optimized dose and dose schedule and pathways to approval for patients with aggressive B-cell lymphoma. In September, we received positive feedback from the FDA, regarding our production, characterization and release of clonal master iPSC bank for use in the routine manufacture of drug product, as well as potential registrational pathways for the treatment of patients with relapsed/refractory aggressive lymphomas, including for patients who have relapsed or refractory to FDA approved CD19 targeted CAR T cell therapy. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}