{
    "symbol": "FATE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 23:53:05",
    "content": " With respect to our FT516 program in combination with rituximab, multiple disease-specific expansion cohorts are currently ongoing as we continue to assess a multi-dose, multi-cycle treatment schedule of three once weekly doses at 900 million cells per dose. In addition, we continue to enroll a two dose multi-cycle cohort at 900 million cells per dose with FT596 administered on days one and 15 and intend to dose escalate this two dose multi-cycle cohort to 1.8 billion cells per dose. We continue to believe that the post-CAR T cell setting represents a potential fast-to-market development pathway based on the critical unmet need and we are working to launch a pivotal study, whether that be with FT516 or FT596 by the end of 2022 for patients with aggressive lymphomas previously treated with autologous CD19-targeted CAR T cell therapy. With respect to our FT538 program in combination with daratumumab, the multi-dose treatment schedule of three once weekly doses at 100 million cells per dose, cleared with no dose-limiting toxicities and enrollment is now ongoing at 300 million cells per dose. In addition, with respect to our FT576 program, the single-dose cohort as monotherapy at 100 million cells cleared with no dose-limiting toxicities  and we have now treated the first patients in the single-dose cohort in combination with daratumumab at 100 million cells. In the setting of AML, the company's Phase 1 study of FT538 which is designed to assess three once-weekly doses of FT538 as monotherapy in relapsed/refractory patients is currently enrolling patients at 1 billion cells per dose. In addition, an investigator-initiated study of FT538 in combination with the CD38-targeted monoclonal antibody daratumumab which is designed to assess the therapeutic potential of targeting CD38 positive leukemic blasts is also enrolling patients at 1 billion cells per dose. These preclinical data provide proof of concept that much like our hnCD16 Fc receptor that enables synergy with monoclonal antibody therapy, our CD3FR enables armed iPS-derived CAR NK and CAR T cells to effectively combine and synergize with CD3 bispecific engagers for a multi-pronged attack on heterogeneous solid tumors. And I think if you look at the approved CAR T cell therapies in DLBCL patients, aggressive lymphomas, the dose that is often given to those patients is probably in the 100 million to 200 million cell range. So just curious, based on everything you know about 596 NK cell biology and NK cell persistence, just wondering and asking you to speculate which do you think would be more effective, the single-dose 1.8 billion or the multi-dose 900 million given twice which you believe is likely to be superior or do you think they could just end up being very similar? So back to Daina's question, I mean, the history of donor-derived NK cell therapy in order to try and drive even modest efficacy, folks have been delivering a multiple of the NK cell compartment that actually just exists within your body which obviously, now when we've always said and others in the industry will say the same thing, if you really want to make an NK cell efficacious, you're going to have to engineer in functional elements. And I think with those engineering in functional elements, whether it be a CAR or CD16 receptor or what have you, I do think you'll see dose levels of NK cells, lower dose levels of NK cells be more efficacious but clearly, they are going to be at dose levels I think that are higher than T cells."
}