{
    "symbol": "FATE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 10:55:04",
    "content": " Our top near-term focus remains our T cell malignancy franchise, where we are seeking to advance into late-stage development for relapsed/refractory aggressive lymphoma and to assess the feasibility of treating newly diagnosed patients in a community setting with FT596+R-CHOP without CY/FLU conditioning chemotherapy. The agenda includes a discussion of multiple registrational pathways that may be available for our off-the-shelf iPS-derived NK cell programs for relapsed refractory aggressive B-cell lymphoma, including in patients whose disease is refractory to or have relapsed following prior treatment with FDA-approved CD19-targeted CAR T cell therapy. In addition, as part of our quest to substantially reduce or eliminate their requirement for conditioning chemotherapy in the field of cell-based cancer immunotherapy and reach patients earlier in care, we continue to research new synthetic functional elements for integration into our product candidates that can harness a patient's intact immune system to potentiate the activity and persistence of adoptively transferred cells. At SITC, we look forward to highlighting our clinical progress and innovation under our solid tumor franchise where we continue to invest in building a deep pipeline of multiplexed engineered IPS-derived CAR NK and T cell product cadets, including through the development and incorporation of new synthetic elements designed to overcome critical barriers that limit the effectiveness of cell therapy, such as cell homing, tumor escape and immunosuppressive tumor microenvironment. We believe the product candidate's novel mechanism of action, including its ability to target other antigens in combination with monoclonal antibody therapy  IPS-derived CAR-T cell product candidates for solid tumors that are advancing towards IND-enabling studies, which include an iPS-derived CAR T cell product candidate that incorporates 7 synthetic modalities to overcome tumor heterogeneity, promote trafficking and induce activation in response to repressive signaling in the tumor microenvironment. In the setting of relapsed/refractory AML, we look forward to sharing clinical data with FT538, both as a monotherapy and in combination with daratumumab in the high dose, multi-dose cohorts, where we are now treating the first patients in 3 dose cohorts at 1.5 billion cells per dose. And finally, in setting of relapsed/refractory multiple myeloma, while dose escalation with FT576 is ongoing in the low-dose cohorts and with single-dose treatment schedules, we look forward to seeing the initial activity profile of our novel BCMA binder and to assess the multiple potential benefits conferred in combining FT576 with daratumumab, including enabling multiantigen targeting of BCMA and CD38 as well as reducing competition from endogenous immune cells for cytokines to further potentiate the functional persistence of FT576. And I think when we think about target product profile, we're certainly keeping the T cell engagers in mind, whether that be in late-line patients or actually in earlier line patients, where we also expect the T cell engagers to make inroads. So I do think, quite honestly, while there was a study certainly run in a second-line setting, I continue to believe that post CAR T-cell therapy will have substantial challenges moving it to the second line in the community setting. And so I think as we think about continuing to innovate a technology, for instance, or an approach like ADR, where we think the cells can be absolutely potentiated by leveraging an intact immune system is highly differentiating, very unique, and that technology if successful would allow cell therapies to be used early and often in treating patients, whether that be lymphoma, myeloma or cellular tumors."
}