{
    "symbol": "SPCB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 17:11:05",
    "content": "  Operator: Ladies and gentlemen, good morning, and welcome to the SuperCom Third Quarter 2022 Financial Results and Corporate Update Conference Call. With me on the call today is Ordan Trabelsi, SuperCom's President and Chief Executive Officer. I'd like to remind that during this call, SuperCom's management may be making forward-looking statements, including statements that address SuperCom's expectations for future performance or operational results. Forward-looking statements involve risks, uncertainties and other factors that address SuperCom's actual results to differ materially from those statements. For more information about these risks, uncertainties and factors, please refer to the risk factors described in SuperCom's most recent periodic reports on Form 20-F, Form 6-K and SuperCom's press release that accompanies this call, particularly the cautionary statements in it. Today's conference call includes EBITDA, a non-GAAP financial measure that useful in evaluating its performance. For a reconciliation of this non-GAAP financial measure to net loss, a comparable GAAP financial meets the reconciliation table located in SuperCom's earnings press release that accompanies this call. The conference call contains time-sensitive information that is accurate only as of today, October 26, 2022. Expect as required by law, SuperCom disclaims any obligation to publicly update or revise any information to reflect events or circumstances that occur after this call. It is now my pleasure to turn the call over to SuperCom's President and CEO, Ordan Trabelsi. Earlier this morning, we issued a press release on our financial results for the third quarter of 2022. We continue to maintain our commitment to time to quarterly reporting and for our quarterly review, I'll start with a brief update on our recent business highlights, strategy and Q3 results, followed by a Q&A session. We won several important contracts in the U.S. and Europe, and we're excited at the reception and early traction of our newest product, Pure1, highly innovative and investor-breed IPPI tracking device I'll go into more details in a few moments. For those new to SuperCom, since our founding in 1988, 34 years ago, SuperCom has been a trusted partner providing cutting-edge electronic and digital security solutions dozens of governments worldwide. As part of our mission, we strive to revolutionize the public safety sector worldwide, the proprietary electronic monitoring technology, data intelligence and complementary services. We always lead with our technology and enter in 2022, we continued to invest heavily in research and development to ensure our product remains the most competitive in the market. We're continuing to introduce new features and technologies through our proprietary platforms, such as unique biometric and communication capabilities and much longer battery life. In parallel, we launched an entirely new solution for domestic violence. In recent years, we've become more and more aware of the merch challenge, which is that nations and governments worldwide face when dealing with our funded populations. First, many countries are from high recidivism rates, people relapse to more incremental behavior after finishing their senses, causing the criminal justice system. Second, overcrowding is a key contributing factor to poor prison conditions worldwide, resulting in prisoner sleeping shifts on top of each other or sharing bed. Third, in 2022 about $80 billion were spent in the U.S. to keep roughly 2.3 million people in incarcerated, nearly 1% of the entire U.S. population. Unfortunately, these issues aren't unique to the U.S. and are prevailing globally. To help meet these challenges, we have leveraged our technology and services expertise and government security and experience team focus on the public safety sector. And in just the past few weeks, we announced that we won and launched a $33 million National Electronic Monitoring project in Romania. As part of the project, the SuperCom IoT solution on one hand, the security for those getting hit or hurt by their own family members with an immediate notification of the police and to the victim the offender has come with a close range, posing a threat to their safety. With up to 15,000 monitored offenders per month, this project will help protect so many people and we feel honored to have the opportunity to do this. We also recently announced that SuperCom was awarded Croatia's first National Electronic Monitoring project, which we have already launched. In addition, we secured a new contract for Sweden's Juvenile National Electronic Monitoring Project. In parallel to our success in the EU in the past quarter, we continue to expand into the U.S. and we won three additional new contracts across three different U.S. states, Texas, Southern California and Idaho. These wins are great for SuperCom, and they further increase SuperCom's footprint in the U.S. facility in more growth in the future. Furthermore, the recent win in Idaho represents our third win and certain customers in Idaho last year adding to organically growing customer base and signaling just how rapidly our technology is tried to new adjacent customers. Our strategy has been a build amazing technology, expand our presence and deliver outstanding services. Our proprietary electronic monitor technology scores highly and competitive RFPs and supports various programs such as house arrest, GPS monitoring, rehabilitation services and more. With each customer win and project deployment, we further strengthen our reputation, making us even more competitive. Lastly, our strategic focus and manger's attention have shifted to our IoT tracking business with recurring revenues in developed countries. In Europe, we have recently seen an uplift in RFP activity with an expected over $200 million in upcoming bid opportunities in the next 18 months. Altogether, these successes and opportunities have resulted in a growing pipeline of business and a recurring revenue rate of above 80%. More broadly, we see a global trend of government turn into innovative solutions and alternatives incarceration to ensure public safety. In addition, it allows them to significantly reduce the associated costs of housing an inmate. For example, the total daily cost for monitoring an offender on home confinement through GPS monitoring is approximately $10 to $35, substantially lower than the $100 to $140 cost of a daily in correctional facilities. Throughout the year, we've announced many new project wins, some in the U.S., some in Europe, where we have been continuously displacing incumbent vendors in an over 65% run rate in the European competitive RFPs. In 2022, we strengthen operational infrastructure grew our workforce and maintained our technology leadership. For example, amidst the ongoing instability in the global economy in the past few months, we successfully finalized the development of a new product the Pure 1, which we mentioned earlier. In addition, we have further owned our business plan, secured new contracts and raised the needed financial resources to support our company during the time of volatility and uncertainty in the capital markets. We've also stated the company's global sales division, including a new sales team with industry expertise as we continue to shift in from passive bidding to an active outreach sales strategy. As part of our growth plan, we believe there's opportunity to enhance our growth in the U.S. through strategic acquisition of local electronic monitoring service providers who have developed a strong reputation and customer base in the respective local communities. In our last conference call, I know that we expect revenue from the project mentioned above to continue to our financial results - to contribute to our results in Q3 and Q4 financials as mentioned before. As a reminder, the legacy business comprised of onetime project revenues in Africa and South America, which is a sharp contrast to our IT tracking business in developed countries, which generates recurring revenue of about 80%. Compared to the corresponding quarter last year, we increased our research and development investments of $333,000, while we continue to develop new products and improve existing ones, keeping us at the edge of innovation and technology leadership in our face. Our sales and marketing expenses increased by $195,000, which for the company's new productive growth strategy and general administrative expenses increased by $262,000 as we continue to expand our management team. The company had a positive EBITDA of $413,000 compared to $53,000 loss in the corresponding period last year, reflecting the benefits economies of scale associated with deploying new IoT projects and the continued shift away from legacy business. We ended the third quarter with $3.1 million in cash and cash equivalents and restricted cash, which includes cash from approximately  million gross proceeds raised in July due to exercise warrants by stable credit and institutional investors. This cash provides us with the liquidity we need to continue investing in sales, marketing and R&D to drive revenue growth and expand our global footprint. In closing, as reflected in our financials, we are starting to recognize a significant return on our years in the safety sector. We believe that we are well positioned for continued growth and capitalizing on new opportunities fueled by these multiple drivers, including a strong presence and reputation in the U.S. and European markets. The countercyclical nature of our industry, policy shift to monitoring and federal incarceration and returning to post-COVID levels of business activity. With that, I'll turn the call over to operator to open for questions. In the U.S., the market is more fragmented instead of bidding on large projects like Romania, which are $3 million  or Sweden, which is $10 million. Some of it comes because we have good results in our previous projects and some comes from reaching out to new customers either way, we need an active sales team with an active proactive strategy. And they've been doing demos, evaluations and ensuring customers just how unique technology is that's reading to wins, and we've been announcing them to share with the rest of the public. Many customers are waiting for it in the U.S., many resellers are waiting for our focus naturally has been to provide it first to the regions with larger revenues like the $33 million projects versus smaller ones. So it's in the process, and there's very high demand for it from what we see thus far. Our bracelet, as you may remember, the battery launched for a very long time over a year. So if someone is hit - there's violence in the family, and they have a complaint - in many countries, they change in law to allow an immediate application of our bracelet, which is small and long battery life on their leg. So if someone hits say his wife, for example, he gets the bracelet -- and any time he comes within 100 meters of her, her phone will notify her and the police immediately, such that we are effectively and dynamically enforcing straining orders, which never been done before. Our people have the safety and peace of mind that they actually complain somebody hits them, and they'll be protected with the use of this, I think, amazing technology. So we have our 2P solution, which is a small bracelet that runs for a very long time without charging communicates with the smartphone. We developed, of course, like everything else, we're trying to make it the most cutting edge of the industry, so we have the best features, the latest way, long as battery life, best connectivity and security. In Europe earlier this year, and we already won a project with it in Sweden that we announced earlier this year. In the U.S., it's also very exciting and many, many customers are asking for it because together with this, they will have a full suite of tools they have domestic. It's very, very helpful and effective for the officers who are using this technology rather than having to go to different software tools for every different hardware here they have all in one, and they may so work much easier, much more effective. Well, basically - it's I think you're deficient in meeting the exchanges, listing requirements. Well, when you say it's an operational issue, I mean the stock is $0.26 and you say requirement, its $1. And secondly, obviously, it's a tough market out there in a tough environment, but the company has a market cap of $9 million. Right, good question in the past, we had more time to meet with more investors and conferences and do more institutions and get the word out there. Lately, we've been extremely busy, as you can see, and we try to first focus on our operations. We just announced a few weeks ago, the largest project in Europe this year, we won it, $33 million that we just announced this quarter, double the revenues from last year and from the previous quarter. I think not, but that creates opportunities for investors to come in at this time and hopefully grow with the company as the stock over time will adjust to the proper value. I'm at a conference right now at LD Micro Conference in California, where we'll be meeting investors all day. But again, our focus will be on operations and we have to create the long-term value of the company, which is more important than the - general strategy than maintaining the immediate stock price at every good moment. I mean, obviously, it seems like this quarter was a breakthrough quarter for you. In other words, it seems that you're gaining traction in and you're hitting some of the goals you set out. I think we have a strategy to grow our revenues from where they've been -- so at a high level, we had a business of e-Gov, which had revenues of close to $30 million and IoT was close to nothing. That being said, we don't control the growth in every quarter, right, depending on the time lines we adjust to government customers. We're dependent on them choosing when to launch the contracts, when to launch a project, and when to finish a significant milestone. We just launched a project in Romania, we've done a lot of work in this quarter. We continue to do work in following quarters, but we would not be able to control exactly what work will be done in each quarter that also depends on our customers. Furthermore, we're bidding on many, many, many other projects around the world, in Europe and the U.S. and we expect to win many of them. And as we win, they will layer on to our recurring revenue base, which is over 80% and continue to grow our revenues. So our strategy is consistently to grow our presence with that, we'll grow our revenues. This is just a nice example for people to see what can happen and much more than this going to happen and how it immediately impacts our profitability, thanks to operating leverage because we don't need to grow our operating cost structure significantly to add more projects and more units. We could add tens and tens of thousands more units without changing almost anything to our operating structure, maybe adding in a person here or there. But everything will result from operating leverage and profitability will come and the contribution margins of each additional race rates, let's say, is very high. But in time, we'll be able to handle it and they believe that as well. Let's open up the PR, but things around $13 million. I think it's around $13 million, I have to get the exact number. Well, the way that works is a little different than a normal business. The way that typically works, we have large project deployment. And we're deploying a large project, you get paid when you reach certain milestone. So for example, we can deploy in one quarter, a ton of the work recognize some revenue for that work, and we still don't get paid. This is one of our goals for moving to the developed countries away from Africa and South America, where we had more delays. Probably one of the fastest go-live projects in the world in the space, and it's a brand new country, the brand new EM countries, they've never done electronic monitoring. Not just great technology and great services, but also great execution with a very timely deployment. At the times if they talk to us, and they usually do once they talk to us, we get comfortable. They're usually much larger companies, telecom providers, IT providers, taking up with them a financial look perfect. Congratulations on the Romanian win, I know how valuable that is to your business. As it relates to, you said that, that you're already generating revenues. I don't have the information readily available, but we did start recognize in Q3, we'll continue recognizing in the following quarters. So it takes a little bit of time into cash, but also have to meet certain milestones to get that. Is that -- was the Romanian project the biggest driver of the increase sequentially in the accounts receivable, the receivables went up by about $1.2 million sequentially. I mean, Romania is the biggest driver of change in this quarter. It's the biggest project we have, and we just started launching it. So year-to-date, you have a 33% increase, give-or-take on the top line, but gross profit was essentially flat. If you look at the cost structure of our hardware and the data cost and the cloud cost, contribution margin of every additional brace that is way above 50%. Over time, with economies of scale and operating leverage, those will be the gross margin for the business. And everything else will just be the contribution of the variable cost, which is every digital bracelet, above 50%, significantly above. At this point, we're deploying new projects. And just like in our past business also in this one, during the project deployment stage, there's hardware to buy, there's servers to buy. There's communication sent, there's IT, and those eventually have lower margins. You're paying IT person to come in and sell servers and connect cables, you can't get a 50% margin off of this work, you get 15% or 20%. So when you're launching a new project at the initial stage, we'll have a lot of lower-margin components, and as everything starts to run seamlessly and you're more into natural flow of recurring revenues and margin offenders, the margins will be higher. So in these three quarters, new projects started, especially this big one, and that impacted the margins. But over time, we will continue to convert into the same core of our business is higher margin. And then as it relates to domestic miles, which seems it could be a very, very attractive new market for you. Obviously, that was included in the Romania project. Off the top of my head, there's at least one or two other countries in Europe that were doing domestic client. The different technologies, different needs or different processes, different laws, and we just have to update it. But yes, it is something that we believe can -- considering the core of our technology and the core of what we can do and the core need of domestic violence is something that we will be able to do probably better than anyone else in a significant manner. And the last question is, you had a press release regarding an e-Gov contract for around $1.7 million. Can I presume that -- \n Not, this one. We're not focusing as much e-Gov, as you noticed, especially not the ones you're going to give us challenges and collections. e-Gov is there to support our requirements and request for cash is much more stringent than it was in the past, again, because we're not focusing on this. A lot of it upfront, and we have leverage and getting cash from this customer, for example. I love your excitement, by the way, I can tell you -- I saw your webcast and your smile all the things that you say are quite amazing. I can tell attitude, I wanted to ask a question about -- so I know you've had a numerous contract wins over the past year. Maybe I'm going to understand your question a little better, which 10 contracts are you speaking of -- we have many contracts in different locations. Like so I know there were like five or six in the United States going into the end of last year and then in quarters one and two, and then numerous here going throughout 2022. Since I think 2018, we won 50 new projects, the latter. We started with a smallest one, $100,000, $300,000 project and grew in size to $1.8 million. In Canada, $3.7 million, in Czech, Denmark and Sweden S7 million. We aim to continue growing the scale in the latter, and we just won a project of $33 million, our largest project in the past decade and larger EM project now in Europe. In some projects, it's the majority of the component. Like in the U.S., almost everything is charged and billed per unit per day. in Europe, that's also prevalent the structure, but sometimes they want to purchase units. That being said, we've been launching projects consistently at different start dates. Every month or two, we keep launching and they add on to a recurring revenue base. Goals and structures, and we're here to support it. Q4, we have Romania and other projects, it's also rolled in. And because of the recurring revenue structure, they keep on adding on top of each other. The reason why you sometimes see a slowdown in revenue growth is also because we are still phasing out the e-Gov business, which is the business used to be $30 million back in 2015. So yes, we are -- this revenue does reflect -- this quarter does reflect many revenues from many different projects, and we expect to continue to reflect these revenues and to have new ones with new projects we will launch. In the webcast that I heard, you had said, basically, like I got -- if I understood correctly, you -- the electronic monitoring works on land, obviously, in subways, so underground and in buildings, high up in the air. Like is -- like if the -- because I know like on phones and my cell phone, sometimes I'll go into an area where it's a little bit dark or whatever, and I might have trouble with like the loading of the service. And let me get a little bit technical, if you don't mind. So everyone else has been developing their own proprietary location tracking technology for the past 10, 15, 20 years. And these are small companies with $100 million, $200 million in value of revenue. Obviously, it's not much competition. We developed our own location as well, but we also integrate all the location services from all the largest companies in the world. If you're underground, we do not using GPS, we're using WiFi networks through the Google network. So you could track someone underneath the ground in the subway, which almost nobody else can in our industry. When you're in the building, we also have in monitoring technologies, where we have low frequency signals and we're able to look at it for somebody precisely within the floor. So not just hints building, we've done the 12 floor, we done the 20th floor and so forth. So when it comes to testing our technology or allocation capabilities, I feel the customers are blown away. When they test the weight of our product, I see the customers are blown away when they take the security of our products, many of our employees and staff have been in the military in intelligence and security, and we bring top non-security and products. So once again, I believe our customers are blown away. And I think the more projects we deploy and more customers will see why we are unique, and that will allow us to grow even faster -- throughout the world. Awesome, it's very exciting like Star Trek stuff to be almost like I can see the possibilities are pretty - vast and they keep going like there's -- I don't really see a lack of need for things that not just people, but also places and things that need monitored on a continuous basis. And then that leads me to my next question with, do you foresee in the future this being just limited to I know it may in May tracking - in the house rest is an amazing market for that. Opportunity to application market yes for application like I was wondering, I don't know, like maybe -- because I know like I know they monitor like athletes, need monitoring, sometimes when they're doing their practices, military, obviously, when they're in training or in the field. Senior citizens, maybe monitoring send -- another question. First of all on the application, I'm a big believer in focus -- focus, and we have to understand the size of our company and the resources that we have. And while our technology is great every application, every industry requires a sales force product team, marketing team, you have to understand the nuances for every different market, if you want to be addressed. In the past, since 2005, we've been developing the patent technology, and we have components which will work great in almost any market, just like we're tracking offenders. We can track livestock and medical equipment and 00:44:09 and children and athletes, and we could take all the signals that are being, let's say, amplified and projected from people's bodies. And right now, we're looking at a $1.6 billion industry. $1.6 billion our annual revenues recently, were $12 million. Now they're growing when we get a larger market share, which you know for more companies. And our technology it is more prevalent throughout the world, and we know that we are creating a huge impact, just like we're doing with Romania right now for tens of thousands of families, then we'll be ready to move on to the next industry and the next industry, next industry, leveraging exactly the same technology, but using a different application. The second, in terms of heart rate data, anything that you see that you've seen online or on TV, any technology that has been advertised, we have the access to it. But all the heart rate beats even brain signal, DEG, energy -- other things that you see on wearables that we have that just like any other company would. But we're not there yet, and we're focusing first on this current market, and we don't need the heart rate to track offenders -- that's not part of our solution today. I love it, though, your vision, I like that you had the focus. A great question -- thank you very much, Have a good day. Good morning, congratulations like everybody, is missing. I mean I know the company is going well, but there's always a short seller and won. December 13, the time line we have - the prices has been reached on its own. So you guys are working on something, but there's nothing that has been decided so far. Nothing that's been announced yet, but of course, we will work on in the back then. It's â\u0080\u0093 a very common and well-known situation at a metric to us, happens to the company sometimes, especially when our stock was only around $1.10, $1.20 before the market conditions came, which impacted many stocks around the world hit us as well. And another question just related to that, just considering, I mean, the price that is so low have you guys consider doing like buybacks before starts going up or that's not part of the plan. Right now, as you see, we need our cash because we're launching new projects and with the manufacturing new equipment consistently. That being said, sometimes insiders like our Chairman,  have been buying back and we announced that at the market once in a while, as you could see in the press releases in the last year or two, you'll see some announcements of insiders buying. We are doing big things and making a big impact, and we look forward to sharing our progress on our next conference call, filings and press releases. You may disconnect your phone lines at this time, and have a wonderful day."
}