{
    "symbol": "SPCB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 12:55:36",
    "content": "  Operator: Ladies and gentlemen, good morning, and welcome to SuperCom's First Quarter 2022 Financial Results and Corporate Update Conference Call. During this call, SuperCom's management may be making forward-looking statements, including statements that address SuperCom's expectations for future performance or operational results. For more information about these risks, please refer to the risk factors described in SuperCom's most recently filed periodic reports on Form 20-F and Form 6-K and SuperCom's press release that accompanies this call, particularly the cautionary statements in it. Today's conference call includes EBITDA, a non-GAAP financial measure that SuperCom believes can be useful in evaluating its performance. For a reconciliation of this non-GAAP financial measure to net loss, its most directly comparable GAAP financial measure, please see the reconciliation table located on SuperCom's earnings press release. We maintain our commitment to timely quarterly reporting, and today, I'll provide a brief update on recent business highlights and strategy followed by a Q&A session. With every quarter that passes, we get further along and capitalize on the transition from the legacy business to our new focus with IoT tracking business, serving public safety government customers in developed countries. Thirdly, in 2020, about $80 billion were spent in the U.S. to keep roughly 2.3 million people behind bars, meaning that nearly 1% of the entire U.S. population is incarcerated at any given time. For example, the total daily cost for monitoring an offender on home confinement through GPS monitoring is approximately $10 to $35, substantially lower than the $100 to $140 of a cost of a daily offender in correctional facilities. With the strong price and certification in both markets, we are well positioned for continued growth and capitalizing on new opportunities. For example, we recently announced that we launched Croatia's first full-scale electronic monitoring project, and we'll deploy our PureSecurity Electronic Monitoring Suite. In the U.S., we announced that our fully owned subsidiary, Leaders in Community Alternatives, launch projects that at up to over $5 million over 5 years to provide various programming and rehabilitation services. In addition, we secured contracts in 3 new states: Texas, Idaho and Wyoming for the PureTrack GPS tracking platform serving adult and human, thus further expanding our footprint in the U.S. We actually just secured an additional contract in Idaho based on a good referral from our first customer in the state. We attribute our wins mainly to our proprietary technology, which scores very highly in the competitive RFPs and our strong reputation recognition as a premier provider of electronic monitoring technology and services. Our electronic monitoring technology supports various programs such as house arrest, GPS monitoring, rehabilitation services and more and has won over 40 multiyear government projects since 2018 alone. Also, our strategic focus shifted from our legacy business with onetime project revenues in Africa and South America to focus on our IoT business with recurring revenues from developed countries. In addition, we acquired an electronic monitoring and criminal justice business in 2016 named LCA, headquartered in Oakland, California, with a strong presence in the state since 1991. Through this acquisition and integration, the large references, relationships and experience we inherited in California have allowed us to enter the region with our new technologies and capabilities effectively unleash valuable synergies and generate a continuous stream of new multiyear recurring revenue project. Since this acquisition, we have won over $25 million worth of new projects in California. We have strengthened the company's global sales division, recruiting a new VP of Sales and Sales Managers with industry experience and a shift from passive bidding to an active outreach sales set strategy. Moreover, we continue to invest in our R&D division, including a new VP of R&D and experienced engineers, product managers, quality assurance, and support personnel to serve the growing government customer needs for leading state-of-the-art technology in the space. The new wins, combined with our improved sales teams, are the first step in executing the company's U.S. market strategy. Our strategy has always been to lead the technology, as mentioned, and entering 2022, we continue to invest in research and development to ensure our products remain the most competitive in the market. And our R&D teams continue to innovate and disrupt the status quo, whether there's new features and biometric capabilities, battery life, communication capability or entirely new solutions for domestic violent, alcohol monitoring and smartphone electronic monitoring within dense hard-to-monitor urban areas and subways. We believe there's opportunity to enhance our growth in the U.S. to the future acquisition of local electronic monitoring service providers, who have developed a strong reputation and a customer base in their respective and local communities. As mentioned, in our previous earnings call and apparent now, the company has invested in its financial reporting resources and returned to timely quarterly reporting. This quarter, we've also acted to strengthen our balance sheet on March 1, 2022, raised approximately $4.65 million gross proceeds in a registered direct offering with a similar credit institutional investor, providing us additional capital to execute on their business plan. When comparing Q1 '22 results with last year corresponding period, we see gross margin of 42.3% compared to 55.3%, also reflecting traditional costs associated with the deployment of new IoT projects ahead of the current revenue streams to come. Our sales and marketing expenses increased by $300,000 to support the company's new proactive growth strategy. The company had an operating loss of $1.5 million versus an operating loss of $200,000 and an EBITDA of $200,000 -- negative $200,000 compared to a positive $600,000 in the previous period, reflecting an increase of investment in R&D by 30% and an increase of 90% in sales and marketing. We will continue to invest in our sales and marketing as well as R&D to drive revenue growth, expand our global footprint and execute on our business line."
}