{
    "symbol": "SPCB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 10:20:10",
    "content": "  Operator: Ladies and gentlemen, good morning, and welcome to SuperCom's Second Quarter 2022 Financial Results and Corporate Update Conference Call. I'd like to remind you that during this call, SuperCom management may be making forward-looking statements, including statements that address SuperComâ\u0080\u0099s expectations for future performance or operational results. For more information about these risks, please refer to the risk factors described in SuperComâ\u0080\u0099s most recently filed periodic reports on Form 20-F and Form 6-K and SuperComâ\u0080\u0099s press release that accompanies this call, particularly the cautionary statements in it. We continue to maintain our commitment to timely quarterly reporting and for our quarterly review, I'll start with a brief update on our recent business highlights, strategy and Q2 results followed by a Q&A session. The second quarter was another good quarter for SuperCom, we won several important contracts in the U.S. and Europe and we're excited at the recession and early traction of our newest product, the Pure 1, a highly innovative investor breed one piece GPS tracking device. Those new to SuperCom, since our founding in 1988 34-years ago, SuperCom has always been a trusted partner, providing cutting-edge electronic and digital security solutions to dozens of governments worldwide. Our strategy has always been to lead with our technology and in 2022, we continued to invest in research and development to ensure our products remain the most competitive in the market. Our R&D teams continue to innovate and disrupt the status quo, whether it's new features and biometric capabilities, battery life and communications capabilities or entirely new solutions for domestic violence, alcohol monitoring and smartphone electronic monitoring within dense, hard to monitor urban areas and subways. Third, 2022 about $80 billion were spent in the U.S. to keep roughly 2.3 million people incarcerated, nearly 1% of the entire U.S. population. And in just the past few weeks, we announced three additional new contracts across three different U.S. states, Texas, South California, California and Idaho. And just this morning, we announced a fourth contract win this time in the U.S. state of Kentucky, this is a great win for SuperCom, as this new partnership with a leading probation service provider to facilitate our strategic expansion into the Southeast U.S. Furthermore, the recent win in Idaho represents our third win and third new customer in Idaho invest in a year, adding to our organically growing customer base and signaling to just how rapidly our technology can spread to new adjacent customers. Alongside our expansion in the U.S., we have recently also announced two new contracts in Europe. We believe that our growing success is based on these key factors, including our proprietary electronic monitoring technology, which scores very highly in competitive RFP that support various programs such as house arrest, GPS monitoring, rehabilitation services and more. SuperCom is one of our 40 new multi-year government projects, since 2018. In addition, we acquired an Electronic Monitoring and Criminal Justice business in 2016 named LCA, headquartered in Oakland, California with a strong presence in the state since 1991. Through this acquisition and integration, the large reference based relationships and experience we inherited in California have allowed us to enter the region with our new technologies and capabilities, effectively unleashing valuable synergies and launching, it continues to renew multi year recurring revenue projects. Since this acquisition, we have won over $25 million worth of new projects in California. Last, our strategic focus and manager's attention has shifted to focus on our IoT tracking business with recurring revenues in developed countries. This increase reflects the growth of the electronic monitoring market, which was valued at about $1.1 billion in 2020, and is estimated to reach $1.6 billion by 2025. Broadly, we see a global trend of government turning to innovative solutions, alternative to incarceration to ensure public safety and our Pure Security Technology Solution provide an effective way for institutions to enforce home confinement, while easing overcrowding in prison. For example, the total daily cost for monitoring an offender on home confinement or GPS monitoring is approximately $10 to $35 a day, substantially lower than a $100 to $140 a day cost at a correctional facility. Throughout the year, we have announced many new projects wins, some in the U.S. and some in Europe, where we have been continuously displacing common offenders with an over 65% win rate in the European competitive RFPs. We are proud to have won so many new contracts in such a short period, especially in times of uncertainty and volatility in the market due to the looming charter recession and unstable geopolitics. In addition, we owned our business plan, secured new contracts and raised the needed financial resources to support our company during the time of volatility and uncertainty in the capital markets. We have also strengthened the company's global sales division, recruiting a new VP of Sales and several sales managers with industry experience, as we continue shifting from passive bidding to an active outreach sales strategy. We continue to invest in R&D division, including new experienced engineers, product managers, quality assurance and support personnel to serve the growing government customer base for a leading state-of-the-art technology. We believe there's an opportunity to enhance our growth in the U.S. strategic acquisition of local electronic monitoring service providers, but develop a strong reputation and customer base in their respective local communities. An example of this strategy is reflected through our $3 million acquisition of LCA, in California in 2016 and the amend strategic value and new project win that has provided us. And as we mentioned before, we are dedicated to a transition away from the legacy business to our new focus on the IoT Tracking business that serves public safety, government customers and developed countries. Last year for the first time in five years, we achieved growth in annual revenues, overcoming the decline of the legacy business. And in the second quarter of 2022 as well, we were able to offset the decline in legacy business with higher growth from the IoT Tracking business, generating a total year-over-year and sequential quarterly revenue growth in Q2 of 2022. Since we only recently won the numerous projects I mentioned earlier, we expect that revenue from there will begin to contribute to our financial results in Q3, Q4 and quarters following from there. As a reminder, the legacy business was comprised of one time project revenues in Africa and South America, which is a sharp contrast to IoT Tracking business in developed countries with better payments and collections that has recurring revenue of approximately 83% in the past few years. Revenue in the second quarter of 2022 was $3.2 million, a 4% increase compared with the corresponding period last year and a 5.5% increase, compared with the first quarter of 2022. Gross margin of 40%, compared to 58% in the second quarter of last year, which reflects the high transitional costs required with deployment of new IoT projects ahead of the startup of the associated recurring revenue streams. During the quarter, we increased our research and development spending by $340,000 and continued working on the development of new products and improving existing products, which keeps us at the edge of innovation and technology leadership in our space. Our sales and marketing expenses increased by $380,000 to support the company's new proactive growth strategy and general and administrative expenses decreased by $370,000 as we continue to expand our management and global team. The company had an EBITDA loss of $721,000, compared to a profit of $684,000, reflecting the transitional costs associated with deployment of the new IoT project ahead of the associated recurring revenue streams and the temporarily higher cost of material and shipping due to the disruptions of global supply chain. We ended the second quarter with $3.9 million in cash, which includes cash from the approximate $4.65 million in gross proceeds you raised in registered direct offering with a single credit investor in March of 2022. In closing, the strong presence and reputation in both the U.S. and European markets, we believe that we're well positioned for continued growth and capitalizing on new opportunities. And coupled with the countercyclical nature of our industry, public policy shift to monitoring federal incarceration and returning to post-Corona levels of business activity, we expect these drivers to fuel our business growth going forward. A recent announcement of new contracts in Europe and the U.S. are compelling examples of our successful business plan, execution, with a vertical in which we have a strong presence and an excellent reputation."
}