{
    "symbol": "FIVE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-31 19:30:04",
    "content": " And then we did call out, I know it's unusual especially on the negative low-single digit comps to be seeing the, what I'm calling out is, operating margin expansion for the fourth quarter but that's solely due to the work that we've done internally here to adjust our cost structure and really go after tighter cost controls and expense reductions. And the majority of those are taking place in the fourth quarter, we started there a little bit later in the year, so we're really going to see the benefit in the back half especially the fourth quarter and the magnitude of those are going to more than offset any type of deleverage is going to happen on fixed costs due to the negative low-single digit comp. And then two, even if the business is flat next year, given some of the cost reduction initiatives along with all the large increase in new stores, is it possible that Five Below could experience margin expansion, like I said, even on a flat comp, just considering that this year is on pace to have an 11% operating margin versus an 11.8% operating margin in 2019 and there is a $1 billion of increased sales this year versus two years ago? And I don't think any of us are looking at '23 and beyond as not being back to positive comps, let's forget even flat, but everything is pointing towards a cleaner environment, there's yield saying that sales clears all, but it's also true that sales exposes things and I think, in some ways, it's helped to make us a leaner organization. I think when we sat back, let's call it, April, May a year ago and you're planning out when your goods are going to come in for fourth quarter, I don't think anybody that far back expected the severe and unprecedented backlog that went on for months and months and months. We've seen a very positive reaction, even in these really tough economic times we have not seen a slowdown in, and I think that points to the question I was answering to John a few minutes ago that value is becoming more relevant and as our customer walks in our stores even though it's over five they recognize the value and that's just as important as the one to five having to deliver value. But Squish, on the other hand, will probably continue to be with us at least through the balance of this year and teams have done a great job with that, we've created the Squish events on Sundays, still continue especially when there is new Squish to see lines in the stores and that's just a great example of Five Below has been known as the place to go when a trend starts to emerge."
}