{
    "symbol": "ELF",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-25 23:36:05",
    "content": " You’re expecting double-digit growth in fiscal Q1 despite the toughest comp by far on a one or two year basis, and then for the full year you’re expecting 11% revenue growth, so really not much more in the balance of the year. And I know you guys typically start conservative and don’t assume everything goes right, and you’ve done a great job ending up sort of beating those initial numbers, but you know with another year of strong growth on top of strong growth last year, maybe you can talk about if you’d assumed sort of some wiggle room or some areas that don’t go right given the external volatility. So one, I’ll just start by saying that I’m very pleased with our fiscal ‘23 net sales guidance range of 10% to 12%, and additionally, the momentum that we’re seeing behind our brands, as you see in tracked channel data as well. Okay, that makes sense. And then on supply chain, you know just given there’s so much occurring in China and a lot of companies have struggled with supply chain, how do you think about the level of risk this year to your business, particularly with very robust top-line guidance and maybe sort of mitigating plans if you do see issues emerge in terms of supply chain. I think that we want to have a couple more weeks here to read the data before we take all of that and say this is what it’s going to be, and so probably by the August call we’ll be able to give more clarity around what we’re expecting to see from a pricing standpoint, but your initial thoughts on $1 and maintaining those entry price points are correct. Not only the leverage we got in the non-marketing parts of SG&A in fiscal ’22, but also as we take a look at the cost environment going forward, we feel we’ve done a pretty good job of capturing the known costs or the costs that we know, and depending on what ends up happening with the tariff environment, with some of these other transportation costs over time, we think there’s tremendous leverage in the business, but we like the formula we’ve been having. Over the last three years I think we’re the only company and only brand in our space that’s grown share all three years, that’s had 13 consecutive quarters of net sales growth and is now starting to see pretty strong profit growth in addition. Okay, that makes sense. In terms of reconciling sales results versus scanner data, I think I mentioned this in our prepared remarks, but there has been a lot of just volatility between what you see on the scanner data from a week-to-week basis, kind of how our shipments have flowed, just given kind of the things that we’re cycling, stimulus and then before stimulus there were store closures at Ulta and internationally that were kind of in the base. And then if you look on a fiscal year basis, the scanner data would basically indicate you’re growing faster in non-track channels than you are in tracked channels, and so obviously some noise in the more recent, but if we took that on an annual basis, I think we feel good about growth across our enterprise. I’m really proud, even with the cost environment we faced in fiscal ’22, to be able to do 23% top line growth and 22% adjusted EBITDA growth. I’d say I’m particularly bullish on e.l.f Color, e.l.f Skin, given my previous commentaries on mass versus Prestige, but particularly given that both W3LL PEOPLE and Keys Soulcare are still kind of in their early days, we see there’s plenty of growth regardless of the broader economic environment."
}