{
    "symbol": "ELF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-02 21:44:05",
    "content": " In addition, the company's presentation today includes information presented on a non-GAAP basis. Today, we will discuss the drivers of our Q3 results and our raised fiscal 2022 guidance. We delivered Q3 net sales of $98 million, up 11% versus a year ago, and 20% on a two-year stock basis. As a reminder, we proactively scaled back our holiday program to prioritize container capacity for our core products, which continue to be in high demand. With our continued momentum, we're raising our full-year guidance, which Mandy will discuss. Our innovation, digitally led strategy, core value proposition, and ability to adapt at ELF speed, continue to fuel our performance. For calendar year 2021, we were the only top-5 color cosmetics brand to grow share above pre -pandemic levels by a wide margin. This quarter, we created our first-ever TikTok native movie to celebrate the holiday season. The movie garnered 400 million press impressions, over 32 million campaign views, and built upon our  on the platform. The competition called Rising Stars seeks up and coming creators from colleges across North America, and ELF is the first brand to co-create the series. We're among 14 other brands that TikTok highlights is doing the best, most engaging, and entertaining work on the platform. Building upon our entertainment chops, we recently teamed up with TikTok and American Idol creator Simon Fuller to find the next big music group. Together, we launched a search culminating in the creation of a first of its kind pop group called The Future X. is leading to bring together two things our community loves, beauty and music. Keys Soulcare, our groundbreaking lifestyle beauty brand with Alicia Keys, garnered 7 billion global press impressions this quarter. We're incredibly proud of what we're building with this brand, which has been recognized across the industry with over 20 Awards this past year. We continue to see a channel shift between digital and brick-and-mortar in Q3 in line with our expectations, digital channels drove 14% of our business in Q3 as compared to 16% a year ago, and 10% 2 years ago. Our follower base across social and digital platforms is now over $12 million, helping to fuel our growth. On elfcosmetics.com, approximately 50% of our shoppers in Q3 were new consumers. Our Beauty Squad Loyalty Program now has over 2.7 million members, up over 20% year-over-year. Beauty Squad as an integral source of first party data, and we'll continue to look for ways to enhance the consumer experience. Our superpowers centered on our ability to deliver 100% cruelty free, premium quality beauty products at accessible price points with broad appeal continue to resonate with consumers. Cosmetics are ongoing success in our core segments: brushes, primers, concealers, brows, and sponges, which make up approximately half our sales. We recently launched the Camo powder foundation in 30 shades, packaged in and sleek compact with a mirror and sponge, and price at $11 versus a prestige equivalent, $38. Building upon our strength in brows and tools, we recently launched brow lift and an accompanying brow lift applicator priced at $6 versus a procedure equivalent at $23. This item quickly sold out online and over 15,000 ELF fans signed up for Notify me anxiously awaiting its return. Our new glossy lip stains are there to meet the call, priced to just $6, versus the prestige equivalent at $38. Skin consumption was up 29% compared to a category that was up 9%, propelling e.l.f. And we're excited to start with five plant-powered, derm-developed Clean skincare products. We plan to further extend the W3LL PEOPLE shade ranges to bring plant-powered, high performance, clean products to a wider audience. Turning to Keys Soulcare, we innovated further in the body category three new offerings to praise your Body: Melting Body Balm, Mind Clearing Body Polish, and Energizing Dry Body Brush. We're also quite pleased with our spring resets, which we're rolling out in the coming weeks. As previously reported, we're pleased with the space expansion we've secured with CVS, in fall of 2021, and Walmart in spring 2022 in a subset of their doors. Internationally, we're expanding our shelf space with Boots and Superdrug in the U.K. this spring. at number 8, up from number 12 last year, and continues to be the only top 10 brand to post growth. This is an indulgent, limited edition 13-piece collection featuring cosmetics and skincare products. Cookies and Dreams will be available exclusively at Walmart in the U.S., at Superdrug in the UK, and in selective  markets in Europe. We've launched the brand in 10 countries to date with four major retail partners; in the U.S. with Ulta Beauty, in the UK with Cult Beauty and H Beauty, and in 8 countries across Western Europe with the gloss. We're excited to announce our newest retail partner, Sephora. We'll be launching Keys Soulcare and Sephora Canada online and in stores this spring, this marks ELF Beauty's first brand entry into Sephora. As we spoke about in recent quarters, and like many other companies, we're facing a global container imbalance and port congestion, which is slowing shipments and increasing our transportation costs. Our operations team has executed with excellence, managing SKUs at the store level to sustain in-stock rates around 95%. Given the uncertainty around how long the supply chain challenges will persist and the inflationary environment, we made the decision to increase prices on the majority of our portfolio, effective mid-March. Cosmetics SKUs, as well as certain items within Keys Soulcare and W3LL PEOPLE. While this round of pricing is broader than previous rounds, our opening price points on e.l.f remain unchanged, enabling us to continue to deliver high-quality products at an extraordinary value. Before I turn the call over to Mandy, I want to give an update on our clean and sustainability efforts. Over the past several months, our team reformulated over 350 SKUs on the ELF brand. While it will take a number of months for these new formulations to roll out, we're excited to add clean to our existing superpowers. With ELF, consumers can have premium quality beauty products at accessible price points that are clean, vegan, and cruelty free. On the sustainability front, we reached another milestone this quarter with Project Unicorn, eliminating more than 1 million pounds of packaging materials since launch. We're evolving Project Unicorn to Project Green Unicorn with a focus to eliminate even more packaging, adopt friendlier environmental practices, and explore sustainable materials. Our clean and sustainable practices will continue to rise in importance, and I'm glad that we're positioning e.l.f. We delivered Q3 net sales of $98 million, up 11% versus prior year, and up 20% on a two years stack, driven by strength in our national and international retailers. Consumption was strong this quarter as well, up 17% year-over-year and up 15% on a 2-year stack basis. We saw gross margin benefits from cost savings and margin accretive mix, specifically from consumers switching away from holiday kits into higher margin core products. These gross margin benefits were partially offset by FX and elevated transportation costs, which flow through the P&L at a lesser rate than previously expected. Given the rate of flow-through on these freight costs and overall favorable mix, we now expect gross margin for the back half to come in flat to last year. On an adjusted basis, SG&A as a percentage of sales was 50%, up approximately 70 basis points versus prior year. Marketing and digital investment for the quarter was approximately 15% of net sales, slightly ahead of Q3 last year. Q3 adjusted EBITDA was $22 million, and adjusted EBITDA margin was approximately 22% of net sales. Our liquidity remains strong with the combination of our cash balance and access to our revolving credit facility, sitting at approximately $130 million. Our current cash balance reflects a complete pay down of our revolving credit facility, reducing our overall debt by $13 million in the quarter. As a reminder, last quarter, we spoke about carrying higher inventory levels due to the combination of longer lead times, higher transportation costs, the addition of Keys Soulcare and W3LL PEOPLE, and our continued business momentum. We now expect net sales growth of approximately 17% to 19% versus fiscal 2021, up from 14% to 16% previously. We expect adjusted EBITDA between $70 million and $72 million, adjusted net income between $40 million and $42 million and adjusted EPF of $0.73 to $0.76 per diluted share. As Tarang mentioned, our business momentum remained strong throughout Q3, up 20% on a 2-year stack basis. Despite not having most of our holiday program, we expect Q4 to look similar to Q3 on a 2-year stack basis at approximately 23% growth. As a reminder, in Q4 and into Q1 of next fiscal year, we will be lapping the largest round of stimulus related spending we've seen to date. This has implications on our net sales, as I just noted, as well as what you'll see in the Nielsen data. In the four weeks ending March and April of 2021, we posted 40% and 52% growth respectively in tracked channels, and we expect cycling these numbers to cause volatility in Nielsen data during those periods. Therefore, we're anchoring on a 2-year stack comparison to better capture trends. We're proud of how our team has navigated these logistics to date, and it remains a dynamic environment. That said, given our sales momentum, we are raising our adjusted EBITDA expectations to $70 million to $72 million, up 15% to 18% year-over-year. As we discussed earlier in the call, we're taking pricing actions next month to mitigate the impact of elevated shipping costs and inflationary pressures on our financial performance, which we believe will help us as we enter fiscal 2023. Overall, we're very pleased with our Q3 results and are excited about the opportunities ahead in fiscal 2023. Our performance over the last 12 quarters, both on an absolute basis and relative to the category, demonstrates how our five strategic imperatives are driving results, and we remain confident in the long-term growth potential for our portfolio of brands. First to Tarang, on the Keys Soulcare entrants in Sephora, Canada, again, congrats on that. Is there a plan to expand into the U.S. and Europe, given obviously, Alicia's strong international following? And then for Mandy, it's obviously great to see you've raised guidance for the top line, but it doesn't flow inside the done EPS. On your question on Keys Soulcare, we're really pleased with the progress on the brand, including entering Sephora Canada. We've high hopes for our launch in Sephora Canada, and we definitely see Sephora U.S. as a potential future partner. As a reminder, we are still in the exclusivity period with Ulta Beauty in the U.S., so we're starting with Sephora Canada. And I think, the prospects of additional distribution on Keys are quite bright, particularly given the level of engagement we're seeing with that brand. On in-trend, the W3LL PEOPLE entrance on Ulta, Is that a separate shelf from e.l.f.? Yeah, no, the Ulta distribution on W3LL PEOPLE is incremental to e.l.f. And again, we're quite excited about that as well, given the momentum that we have on W3LL PEOPLE after our brand -- our re-branding as well as the innovation program we have on that brand. So essentially, we've taken our guidance up from 14% to 16% on the top line up to 17% to 19%. And on EBITDA we've raised our guidance from $66.5 million to $68 million, up to $70 million to $72 million, so $4 million on the top end on EBITDA as well. Q3 beat by roughly $4.55 million, and so we are flowing through most of that to the full year. Actually, it translates to 15% to 18% growth on the year, even with the cost headwinds that we're seeing, so I'm really proud of that EBITDA expectations. And then the ultra exclusive, when it runs out, do you -- just sorry for going back to that. Obviously, we continue to discuss Keys Soulcare with Ulta. But at some point, that exclusivity will run out and we'll evaluate whether we extended or whether we continue to expand distribution on Keys Soulcare. The first -- maybe Tarang, it's best for you. I'm wondering if you can quantify, help us think through the gains in the domestic market with CVS and Walmart and internationally. So on the pricing actions, we're using a very similar approach that we used in 2019, which proved quite successful, where we've really gotten SKU by SKU and really taken a look at the SKUs that we have, the most pricing power on. And when you take a look at a lot of our range, the comparable product is a prestige product, so I will give you a couple of examples of things we just launched. Our power grip primer, which I talked on the call, is already our top selling new item or actually top-selling item period on elfcosmetics.com. That's priced at $10, the comparable prestige item is $34. There's still quite a big gap there, as are many of our other core holy grail. Equally important, we're not taking pricing up on many of our opening price point items. So the ones that we have the most extraordinary value on, many of our $2, $3, $4 items remain at that price point. It allows us to really focus on where we feel we have pricing power, while maintaining that strong value equation. And we saw great things after our 2019 pricing, even the more limited pricing we took back in 2021 in the U.S. with broader pricing. So we always are cautious with pricing, given the extraordinary value we have, but feel we're well-positioned for the pricing we're going to take in mid-March. We're not quantifying the percent space gains, but I will tell you to give you a little bit more color on the CVS space gain that we had in a subset of their doors. We went from a 3-foot end cap gondola to 6 and 10 foot of it space, a pretty sizable increase in space, and we've been really pleased with the productivity of that space gains. And so, I think, beyond kind of building up for chain, we're also seeing pretty sizable space gains there as well. What I'll tell you, our first focus is always going to be on our productivity, the space that we currently have making that work harder, and we've got really good track record with Project, now, Green Unicorn being able to aid that and I'm particularly excited about our spring sets that are being set right now. And then, perhaps, just a bit of update on category growth so far this fiscal year. Perhaps, as that fiscal support and stimulus benefits fade. And also, beyond the category, maybe potential impact on e.l.f if we do see weaker consumer spending here? I'd say in Q4, we saw mixed results on the category. Even when you look at the sub category level, Lip is having a moment right now, its consumers seek more color. specifically, we're seeing strength across all of our core segments. We're growing sales and share in all five of those segments, as well as within skincare. In terms of the relationship of consumer spending, particularly kind of the inflationary environment, I feel we are well-positioned within that. I think we've proven that over the last 3 years, growing 12 consecutive quarters, regardless where the category was. And I'm feeling really quite bullish on our business, even relative to the category. Particularly given I think we have a much richer portfolio now, with not only e.l.f. Skin, W3LL PEOPLE, Keys Soulcare, and then even better presence between color cosmetics and skincare, which continues to be a major whitespace opportunity for us. And as we look forward, we were able to maintain 95% in stocks. And lot of that has to do with the proactive decisions we made earlier in the year, kind of foregoing a lot of our holiday kits for our core items proved to be a very good decision. We saw a migration from kits to our core products, which also aided gross margins. We've talked before, taking up our inventory levels, which really gave us that installation on the longer lead times that we're seeing. Now we're still seeing longer lead times and normal volatility that, I think, others are experiencing right now. On the revenue upside in the quarter, as we talked, really, Q3 exceeded our expectations on the consumption side of the equation, and really foiled consumers shifting from our holiday kits, which we had a very scaled back program this year into our core product. So, in flagging, the guidance is a better outlook on Q4 as well. And still both quarters, second half is going to be very strong for us, we expect from a two-year stack basis as well. In terms of the price increases, this round of price increases that we're taking in March, it covers about two-thirds of our portfolio, and it also includes a portion of Keys and W3LL PEOPLE in that as well. But as Tarang mentioned earlier, really balanced that with wanting to maintain the value proposition for our consumers. So, we're not touching our opening price points and really want to make sure that we stay -- continue to deliver that value proposition for our consumers. In terms of Omicron, I would say that's hard to parse out from the data, given other moving parts. I mentioned the Power Grip Primer, particularly excited about building on our Camo Franchise with our Camo foundations. All of them are phenomenal values relative to prestige equivalent, as well as our Pure Skin line. So there might be some noise in the Nielsen data, but overall consumption trends are actually stronger than what we expected for Q3 and I think bode well for the rest of our fiscal year. I'd say longer-term, we're really pleased with what we saw in Q3 this year. They definitely have a role, and there's consumer excitement, particularly as we're able to engage them online and with some of our key retailers. And so I think that will be our -- at least for the time being, our plan for the future. It is much more focused on our core, with some limited holiday kits to drive excitement. Just kind of learning this 24-months end, I think that's right. We acquired the brand really the thesis there, it was a real pioneer in plant powered, clean beauty. And we felt we could add a lot of value to that brand, both with the innovation platform. We did a re-branding of W3LL PEOPLE, almost a complete renew brand from a consumer presentation standpoint, we really energized the innovation program, getting W3LL PEOPLE into skincare, and we're seeing really good momentum. And in addition, what W3LL PEOPLE brought to us is real capability and clean beauty. W3LL PEOPLE -- came one of the co-founders of W3LL PEOPLE was Dr. Renee Snyder, a board-certified dermatologist. She was instrumental with our innovation team to launch Keys Soulcare as a clean brand, re-platforming W3LL PEOPLE gave us a lot of knowledge where, in the last six months we reformulated over 350 SKUs on the e.l.f brand, where its all avail formulations are now clean. They'll take a few months to roll out, but we feel great the progress we've got both in terms of what we could do for W3LL PEOPLE, and the knowledge we learned. In terms of future M&A, I'd say we continue to be interested in other brands that we can bring onto the platform, under a similar construct as being able to bring capabilities into the company that we don't have as well as leveraged incredible platform we've created here. In terms of scale, I would say, W3LL PEOPLE was intentionally small when we did it as our first acquisition, we're highly disciplined. As for future acquisitions, we would look to -- for them to be a bit larger, but we're highly disciplined. I mean, you'll see in the notes as you take a look at some of the adjustments. And I'd say, the things that appeal to us or other high-growth brands, not only on the top line, but also on the bottom line. But either in an adjacent category or something that would bring a different capability to the company, I'd say we remain open to that, but we'll remain disciplined in taking a look at potential targets. No, I would say we're feeling good about the supply chain from a risk standpoint. I'd say over the last few months, we've been able to get all the containers we wanted. It was one of the impedances for us to decide to take pricing is we expect some of those elevated costs will be with us for some time, so that's one of the reasons we priced. But in terms of overall availability, our capacity, our ability to get product, we're highly confident of our ability to do that and meet demand that we're seeing. I'm just wanting a little bit more detail or quantification on the gross margin because it was really a spectacular performance, even accounting for the holiday mix issue that you talked about. But you're taking more price, so it seems to me that that gross margin has even higher to go. Gross margin as we talked in the quarter, I think, what came in better than we expected at two things. One, I would say the shift into our core product from not having that holiday mixed. The holiday product is at a lower margin, so people shifting into our core product actually drove a benefit for us on a year-over-year basis. The other part is, I think, generally, we're mixing out a little bit better even with the higher freight costs, we're not seeing that impact the P&L in the way we expected. And so, that's why for the second half, I've now called out that we expect gross margin to be flat to last year. So not -- because we won't have that holiday benefit in those numbers, but I think that our outlook has improved from that standpoint just based on what we're seeing from a mixed perspective. In terms of pricing and how that's going to impact gross margin, I think we'll have more color to give on that once we give our fiscal 23 guidance in May. According to the guidance, you are still guiding to down a little bit year-over-year in the fourth quarter against a hard comparison. So to your point, even the guidance implies a little bit negative for Q4, but on a two-year stack basis, it's still very strong, up 23% it's what is implied. And then when I look at the full year of fiscal '22, 19% on the top end, it's still north of 30% on a 2-year stack basis. In terms of what to expect when we get into the first half of next year, again, we're just going to have to wait until we give guidance for fiscal '23. But what I can say into Tarang's earlier points, we do feel very confident on our spring innovation. The signals that we're seeing is that, that will continue to be strong even before it's in broad distribution. So really seeing some positive signals there, and things may be volatile as we talked about, in March and April, very strong consumption results in Nielsen data, and so we expect some volatility there. Just curious, it looks like e.l.f Skin care is really gaining a lot of momentum. But going forward, do you think that's the right level to think about, especially as you're lapping Keys Soulcare launch. In terms of skincare, we are seeing great momentum. I mentioned our consumption trends for the quarter, it was also the first quarter that e.l.f. In terms of how we manage shelf space, I'd say we are dramatically under space in pretty much every retailer we do business with. The way we manage it is basically, seek greater shelf space and get more of our skincare assortment in. I would say our most developed skincare business is probably at Target, where we've been the longest and we have the biggest footprint. Skin within our existing sets and as Target over time has given us more space, has given us greater opportunity to get more skincare in as well as many of our other products. At Ulta Beauty, they've given us incremental space for skincare in their skincare set. And so we'll be taking a look there depending on what happens with space over time, whether we integrate it in within our existing e.l.f. So I think we're going to continue to learn our way there, but the unifying theme is as we pick up more space, it gives us even more opportunity to get more Skin and more of our other innovation into retailers, and that's what our real focus is. And then on your question on marketing spend, we feel great about that 15% to 17% range. And I think what you'll see from us is continuing to balance investing in marketing and digital with our desire to grow EBITDA, just as you've seen us do this year. And so, that 15% to 17% feels right to us right now. You mentioned, your Beauty Squad membership is up, I think 20% year-over-year. And Tarang, you talked to the importance of the first-party data that provides. Just in a kind of a big picture way, trying to understand what that's helping you do maybe better or faster than you've done in the past. Well, Beauty Squad is a critical program for us. We're proud of the 2.7 million members we have, the 20% growth year-over-year, but also the experience that program is generating for our core users. We've often talked about many of our unique collaborations that we do, whether it be the e.l.f./ Chipotle collaboration or one I'm particularly excited about right now is the partnering that we've done with Simon Fuller and finding the next big pop group on TikTok, the future  our latest hashtag challenge there, #elfitup. In a week after placing that hashtag challenge, I think it's up to 7 billion views. A lot of the inspiration for the things we do come from that Beauty Squad Loyalty Program, and what we're hearing our core user base wanting. So it's not just the behavior that we're seeing them from shopping standpoint, but we also engage them. Part of how they earn points is the level of engagement with the brand, including insights on our new products, including some of the things that they are most interested in. So you'll continue to see us nurture that program, build in additional functionality in it, and enhance the dataset that we got. It really drives all of our activities, including with international retailers. With respect to the digital shift -- you mentioned earlier that the digital portion of the business has come down a little bit, I think to 14% in the current quarter versus 16% a year ago. It's a pretty neutral impact to operating margin, so it would be a benefit as we shift more into digital on the gross margin line. And Mandy, you pointed out the kind of the balance -- the strength of the balance sheet, the strong liquidity position you're in. So you're absolutely right, Jon. We'll be focused on our strategic imperatives, and continuing to support those. And so as Tarang gave a little bit of color around, we have looked at targets more recently, and we'll continue to do so. I think that anything that expands our capability or brings us new capability like we've picked up with the W3LL PEOPLE, or allows us to go into different category adjacencies would be interesting to us. And so, I think, that you will continue to see that from us. We're going to be looking at things, but only where it makes sense, cultural fit, and things of that nature are super important to us, and we don't want to move too quickly on something and take a look back and not love it. And as Tarang mentioned, W3LL PEOPLE was intentionally small. As we look forward, we may look at things that are a little bit bigger than that, something with more scale, and really looking to expand our top line and bottom line with any other acquisition that we bring into the portfolio. The acquisitions you're making, it's not like you're bringing in brands that then you just incubate and they operate independently. Tarang and Mandy, it feels like you've got your fingers and tentacles in each of these brands, and I think W3LL PEOPLE has taken a little while to really ramp up. In terms of our strategic extensions, the way we manage them is very similar to other consumer environments I've been in. Most of us have multi-brand experience of portfolio of brands, and we make sure that the consumer-facing part of those brands we've resourced for. We have an incredible operations chassis, same with our innovation platform, where we feel we could take on a few more brands without any serious issues from a managerial standpoint. But from a focus standpoint, you obviously see the momentum over the last three years on the ELF brand and that becomes our biggest area of focus. But we like what we've seen in terms of the strategic extensions we've done, we've been able to manage them well, be able to leverage the chassis where it makes sense, and then let them live on their own. On the other hand, in terms of how they go-to-market and what we're able to do. Fair enough that's reasonable, certainly. But the other question I had just in terms of that statement, e.l.f. I mean, I remember the days I think, once upon a time, you guys priced everything out of the e.l.f brand at$3. Obviously, the brand has just exploded in terms of consumer awareness and relevance, and you've done a phenomenal job in the innovation side. Well, like everything at e.l.f., we move at e.l.f. And I'll take you back to our 2019 price increase, which I mentioned was quite successful. In that price increase, we had some items we had taken up $2 and quickly concluded that was too big a price increase and we quickly rolled those back down. And so if we found that we overextended ourselves on certain items, it's very easy for us to adjust those items back to where they need to be and we can move. Now our, our hope is the way we've approached this, which is really looking item by item relative to its key competitor. We've been able to prove that even in a bad market, we're going to want to do that and a good market as the category improves. And so we feel done right, pricing can be a good tool in the. I think if you look at the last couple quarters before the December quarter, that your growth was decently in excess of what we saw in the scanner data. This quarter, it was below even taking into account the holiday step. So in Q3 last year, we posted a positive 10% net sales growth with consumption down 2%. When you take Q3 on a two-year stack basis, we were up 20% and up 15% in consumption. Sales pacing a bit ahead of consumption, which I think is more in line with what folks expect to see. I think over the long-term shipments and consumption will balance out, but sometimes there are those nuances between quarters. International growth still remained strong for Q3, and we continue to see growth in those markets and with those customers. We don't typically see anything like that, like a forward buyer or anything like that from our customers. So no, we don't really expect to see anything like that. Hi, thanks for taking the question, and congrats on the quarter. As I mentioned, we innovate across each of our core segments and skincare, W3LL PEOPLE and Keys Soulcare. I would say the cadence of that innovation you typically see, it's really continuous throughout the year. The big seasons, our spring season when spring resets happen, but we're launching new products all the time on elfcosmetics.com, keyssoulcare.com, w3llpeople.com. I take a look at the pipeline across really all four of our brands, and they are quite robust. But I mentioned on a couple of our other brands, W3LL PEOPLE, our first entry into skincare. And so I feel it's an area we've really focused on over the years and I'd say particularly in the last 3 years, really strengthened the innovation capabilities not only in skincare, but our ability to have the breadth of innovation that we do have as we go forward. But Lip for our business, we're seeing strength across each of our core segments. Certainly, I think we're well-positioned. We have strengthened the Face category, particularly with our latest innovation on Power Grip and our Camo foundation. I like what we're doing on Eye, Eye Brow Lift is off to an incredible start. And even in lift, our glossy lift sustains, I think, again, phenomenal value at $6 versus the prestige equivalent at $38. We're starting to see some good things on contouring, we have a very good business from our contouring pallets in a number of things there. So Rupesh, similar to what happened in 2019, we led pricing. And so, I don't think that many people followed us in 2019. I don't have specifics on who else is potentially taking pricing, but we were not the first, and nor I believe we will be the last. It really is on that relative value that we see in the marketplace, even if no one took their pricing. So, as we talked in our prepared remarks, and I will take it back actually to 2019. When we take pricing, it's usually in reaction to something, a macro event. So in 2019 when we decided to take pricing, it was in response to tariffs. In May 2021 when we decided to take pricing, that was in response to some of the FX headwinds that we were feeling. So this time around, it has been driven by those elevated freight costs that we're seeing. And overall, cost inflation that we anticipate will be with us for a little while longer. Again, I think we'll have more color on that when we come back in May with our fiscal '23 guidance. Well, thank you, everyone, for joining us today. I -- again, I'm so grateful to the incredible team we have at e.l.f. We look forward to seeing some of you at some of the upcoming investor meetings and speaking with you in May, when we'll talk our fourth-quarter results in fiscal 2023 outlook."
}