{
    "symbol": "BWA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 12:30:07",
    "content": " Even though our revenue and margin outlooks are unchanged, we're now expecting full year adjusted EPS of $4 to $4.40 per diluted share. I think the right way to think about it big picture, 50,000-foot level, is as you look at the first half versus second half, the material cost headwinds that we're expecting kind of on a year-over-year basis when you look at both the commodity side of the equation and the other inflationary costs coming through from our suppliers and the recoveries we're getting, it's somewhat of a push first half to second half in terms of the total magnitude on a year-over-year basis. I think what it implies -- I'm not sure -- I mean it's somewhere in that high single digit to maybe low double-digit ZIP code when you look at the second half of the year, depending if you're at the low end or the high end of our guidance. So we're actually at about $80 million year-to-date on a year-over-year basis which implies now that we're saying about $145 million to $155 million for the full year, there's another $70 million year-over-year headwind in the back half of the year. On the e-R&D question, the second quarter, we were up $56 million in eProducts related R&D, which means we're up a little over $80 million in the first half of the year, which is right in line with our guide for the full year being up $145 million to $160 million on a full year basis. Yes, I was going to say, I think Pat will come back to you on maybe some ways to think about CPV, but as we've mentioned, the market looking after 2030, we think it's about an $18 billion global market opportunity, of which about half of that is in North America and Europe, where we're positioned to play right now. And the second question was the -- out of the $3.7 billion, we expect, I think, in my prepared remarks, it was about $150 million for Rhombus and overall, I think, $175 million to $200 million overall, including our organic exposure in these devices. But on the other hand, as our EV revenue grows like we're seeing now $850 million, our expectation for the full year 2022, that gives us incremental contribution, which is a tailwind."
}