{
    "symbol": "WTTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 20:46:07",
    "content": " Our Water Services segment saw quarterly revenues grow 20% during quarter two, getting back to levels not seen since quarter one of 2019, well before the pandemic began. Underpinned by growing activity, strong commodity prices, further price increases and continued operational efficiency gains, we expect to see further improvements to our financial performance, including meaningful free cash flow during the second half of 2022. Despite working capital headwinds free cash flow returned to positive territory at $1.1 million on $11.1 million of cash flow from operations as the company continued its targeted recycling and infrastructure development program, while cycling out unneeded equipment and real estate related to our recent acquisitions at a favorable time in the market. The Water Services segment exceeded our expectations in the second quarter, growing its revenues by 20% to $196 million, while advancing gross margins over 3 percentage points to 19%. About 30% of the $32 million revenue growth was derived from the full quarter presence of Nuverra assets versus a little over a month of activity in the first quarter, while the segment benefited more broadly from pricing improvements that took place from late Q1 onward. Looking forward to the third quarter, we expect mid to high single-digit revenue growth supported by activity growth and continued pricing gains with margins reaching 20% on fuel cost relief, coupled with pricing improvements and continued operational efficiencies. Water infrastructure revenue increased by 3% to just over $60 million in the second quarter, with higher recycled volumes offset by seasonal restraint in the Bakken. And so whether it's a greenfield projects or existing underutilized, if youâ\u0080\u0099re talking to the Permian, for us that would largely be an Agua Libre asset, we  (ph) a lot more opportunity to further commercialize tie into other operators or other operator systems and it's something that we're actively focused on daily and it really developed a team focused on the -- team specific to the Permian, focused on those opportunities."
}