{
    "symbol": "AEY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-15 16:02:08",
    "content": " Well, I listened to you guys before, as I've mentioned, and isn't it time to maybe upgrade that presentation, it's kind of very stale, to give us some vision of the company in writing that people can review, and maybe do a couple of dog and ponies with some brokerage firms out there to get your name. I really think it's time that really, instead of waiting for profitability, start to tell people about it, since you already expanded on your -- on the revenue growth, the possibilities, the potential, you're increasing the size of your workforce and the crews. The recent $13 million day was I mean, there's, I don't think there's any real explanation for something you start to get some growth and some activity going and you're trigger some algorithms in some of the investment houses and trading firms and all hell breaks loose. And there's probably other people on the call that are more advanced in trying to explain that but --\n Well, I’ll be interested in hearing that but yes, but the normally I mean 12 million shares, you see this price go up, I mean, sure, would have gone through the roof. When someone takes a look at this, it looks as if they're been raised privately maybe, at that particular time reflected in the 12 million but –\n Yes, we, I mean, we still have an active S3 registration that's about two years old now. And one question and talking about telco and that whole segment, which has done very well, I mean, it's, you don't hear too many people congratulating you all and the work that went through and building your new equipment, warehousing and operation in Florida and outside North Miami, and how that's all going. Yes, it's going to make it a lot easier for Brett and his team, to market the company, when they're able to introduce the company as a company that is, a, cheap on an asset basis, sales basis, whatever you want to call it, and at the same time be able to say, hey, not only is it cheap, but insiders, of showing their confidence by buying the stock at current level, sort of ironic, the stock trading at a 52 week low and yet your sales are just getting to what looks like ramp up significantly."
}