{
    "symbol": "BRT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 10:32:19",
    "content": " Turning to our results, for the second quarter of 2022, net income attributable to common shareholders was $35.6 million, or $1.91 per diluted share, compared to $6 million, or $0.34 per diluted share in the same quarter of 2021. Average rents for the portfolio in the second quarter of 2022 were $1,252 per month, up 10.9% compared to the 2021 quarter. During the second quarter, we completed the purchase of the remaining interest in joint ventures that owned five multifamily properties with an aggregate of 984 units for an aggregate purchase price of $34.2 million. Subsequent to quarter end, we completed the purchase of the remaining interest in the joint ventures that owned five multifamily properties with an aggregate of 1,572 units for an aggregate purchase price of $63 million. After giving effect to the purchases including those completed subsequent to the second quarter, we estimate that our consolidated balance sheet will reflect real estate assets of approximately $668 million and approximately $426 million of mortgage debt. We retired $30.1 million of mortgage debt and BRTâ\u0080\u0099s share of the gain on sale was approximately $17.4 million, excluding our share of debt prepayment fees of $686,000 and This transaction provided us with an IRR of over 20% over the 6.5 years it was owned. Weâ\u0080\u0099re retired $31.4 million of mortgage debt and BRTâ\u0080\u0099s share of the gain on sale was approximately $22.7 million excluding our share of debt prepayment fees of $787,000 and this transaction provided us with IRR of over 40% over the three plus years it was owned. Also during the second quarter, we agreed to sell Waters Edge at Harbison, a 204-unit multifamily community in Columbia, South Carolina in which BRT holds an 80% equity interest for $32.4 million. We expect that our share of the gain will be approximately $11.5 million, excluding our share of debt prepayment fees of $263,000 and we estimate that our IRR will be approximately 20% over the six years it was owned. The aggregate mortgage debt at June 30 for our wholly-owned properties, combined with our pro rata share of mortgage debt for our unconsolidated joint ventures totals $536.6 million with a weighted average interest rate of 3.95%, and a weighted average remaining term to maturity of 7.8 years."
}