{
    "symbol": "IDT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-12-05 21:40:25",
    "content": " In todayâ\u0080\u0099s presentation, IDTâ\u0080\u0099s management will discuss IDTâ\u0080\u0099s financial and operational results for the 3-month period ended October 31, 2022. After Mr. Jonasâ\u0080\u0099 remarks, Marcelo Fischer, IDTâ\u0080\u0099s Chief Financial Officer, will join Mr. Jonas for Q&A. Any forward-looking statements made during this conference call, either in the prepared remarks or in the Q&A session, whether general or specific in nature, are subject to risks and uncertainties that may cause actual results to differ materially from those which the company anticipates. In their presentation or in the Q&A session, IDTâ\u0080\u0099s management may make reference to non-GAAP measures, including adjusted EBITDA, non-GAAP net income and non-GAAP earnings or loss per share. A schedule provided in the IDT earnings release reconciles adjusted EBITDA, non-GAAP net income and non-GAAP earnings or loss per share to the nearest corresponding GAAP measures. After my remarks, Marcelo Fischer, IDTâ\u0080\u0099s Chief Financial Officer, will join me and we will be available to answer questions. My discussion today focuses on the first quarter of our fiscal year 2023, the 3 months ended October 31. For a more detailed discussion of our financial and operational results, please read our earnings release filed earlier today and our Form 10-Q that we expect to file with the Securities and Exchange Commission by Monday, December 12. This quarter, please note that our NRS business is now a separate reportable segment by greater visibility into its financial performance. The Fintech segment, which previously included NRS, now compromises BOSS Money and several smaller financial service offerings and businesses that were previously included in our Traditional Communications segment. In the first quarter, we achieved our second consecutive quarter of record adjusted EBITDA. Our rapidly expanding NRS, BOSS Money and net2phone businesses contributed 25% of our consolidated adjusted EBITDA in the period and their continued expansion positions us for significantly enhanced profitability in the coming years. And this quarter, both net2phone and the Fintech segment, which now primarily tracks the performance of our BOSS Money remittance business turned the corner and generated positive adjusted EBITDA. NRS also had another very good quarter, more than tripling its adjusted EBITDA contribution compared to the year ago quarter. As I discussed last quarter, NRS advertising data sales, which contributed over half of NRSâ\u0080\u0099 first quarter recurring revenue is always impacted by seasonal factors and of course industry-wide trends. In the first quarter, we benefited from sales of political advertising and we expect to see a significant amount of holiday and year-end spending in the second quarter. Looking ahead, we are planning to increase our available advertising opportunities by expanding the number of screens in our network and by adding digital windows signs in high-traffic areas, menu boards in busy food service establishments and by opening a variety of other advertising venues, included across our various apps and websites and of course, for NRS retailer sites that we manage. Over the next couple of months, we will launch our kiosk ordering and beta version of an app downloadable POS tablet for â\u0080\u0093 POS for tablets as well as POS is customized for specific retail verticals with significantly higher SaaS monthly recurring charges than the level we realized in our current retail base. Thinking about longer term NRS growth initiatives, we are also expanding our e-commerce offerings, which we conceived us to help NRS level the playing field for independent retailers who must compete against the expansion of national and regional retail chains. On the supply side, we just announced a B2B e-commerce initiative to help distributors and suppliers access NRSâ\u0080\u0099 extensive nationwide network of retailers, while enabling NRS retailers to order the right items and the right amount of inventory to maximize sales and cash flows. Together, we are providing home delivery at no cost to our retailers when customers order through our BR Club app. BOSS Money continued to perform very well in the first quarter with solid year-over-year increases in transaction volumes, revenue and revenue per transaction. This quarter, we beta launched a new digital wallet aptly named Wallet by BOSS Money, which I am personally very excited about. Our wallet has tremendous potential, particularly for the immigrant communities we serve and we expect it to become the ecosystem for many of our payments and financial service offerings over time. net2phone reached a significant milestone this quarter, achieving positive adjusted EBITDA even more quickly than we had expected. We have significantly simplified and streamlined the processes for our partners to onboard and provision their SMB customers making experience intuitive, quick and hassle-free while at the same time lowering our onboarding costs and their onboarding costs. In Q1, net2phone sold approximately 1,000 cloud-based contact center seats, leveraging the CCaaS platform that we acquired earlier this calendar year and about which we continue to be super excited. During the quarter, we sold CCaaS to enterprise call centers and contact center customers in three new markets. Turning now to our Traditional Communications segment, our IDT digital payments business, primarily our Mobile Top-Up offerings, was again impacted by the decline of the key corridor. Removing the impact of that corridor, digital payments revenue would have increased 5% year-over-year. However, we are not satisfied with the results to date, and we are hard at work enhancing the product and in some cases, changing team members helping night growth in this business. BOSS Revolution Calling and IDTâ\u0080\u0099s global wholesale carrier revenue continued to decline, but we were able to substantially mitigate the bottom line impact. To wrap up, we continue to benefit from strong performances from our growth businesses. Iâ\u0080\u0099ll try to give you, call it, a 50,000-foot view of what I would like to see the B2B opportunity become. To start with, I mean, we already have an NRS marketplace, which, again, is not a huge business for us, but we do tens of thousands of dollars already through it. And â\u0080\u0093 again, this is not an exact number, but we expect that, that will save retailers anywhere from 10% to 20% on the cost of their goods, which will help with their margins. Some retailers have a problem that they need, obviously, stuff from lots of different distributors. It also just generally speaking, opens up their eyes, Iâ\u0080\u0099ll say, and I mean the retailers eyes to the fact that there is lots of different suppliers that they can get products from. And I do believe in general that when you have a competitive market, thatâ\u0080\u0099s good for customers and in this case, retailers because their costs get brought down by the fact that there is more that there is more suppliers available to them and more opportunities for goods that they never carried before, which is another big thing. I mean some of these stores havenâ\u0080\u0099t really changed, Iâ\u0080\u0099ll say, at least dramatically what they have carried over the past 10 years, while markets in terms of what customers want have changed. And eventually, we have lots of, Iâ\u0080\u0099ll say, grander ideas that we think could be layered on top of this, but we first have to get through, Iâ\u0080\u0099ll call it, the basic before we get to the grander vision. So even though it might not be our biggest profit generator in the near-term, it really will help, we believe, stores over the long-term, which again helps us. We really try to fully understand the need of our retailers, participate in all their problems kind of own the store, the supply concern, the delivery concern, create that level of stickiness and dependency and do that relationship that there is no match to us. I mean again, I think we view ourselves really as a trusted partner like through good times and bad times. And yes, we are not embarrassed that we want to make money by providing value to our stores. The Uber partnership actually hasnâ\u0080\u0099t like officially, I will say really launched. I mean we signed the deal with them, but it doesnâ\u0080\u0099t start rolling out, I would say until I believe â\u0080\u0093 I believe early in January, right after the holiday season. Itâ\u0080\u0099s a great option for customers as well because again, we are not really trying to make a lot of money on the specific product. Again, this is another example of us doing something that retailers need where we will make a profit. Our goal is to bring it to them for as close to the cost that they pay for it in the store and allow retailers to sell stuff to customers even when they are not in the store, like that is our goal, and thatâ\u0080\u0099s what we intend to do. I think we were initially thinking about net2phone being closer to EBITDA breakeven at the end of this fiscal year, and thatâ\u0080\u0099s obviously tracking well ahead of what we initially anticipated. But is there anything we should be aware of from like anything one-time, or do you think itâ\u0080\u0099s sustainably going to be profitable from here, or I just want a little bit of color on that. I mean listen, my personal opinion, is it sustainable, I mean listen, the beauty of the net2phone business is it has very, very low churn â\u0080\u0093 and its revenue is pretty predictable. And as long as you manage your costs well, which again, I think that we are really good at, you are going to see continued improvement in the bottom line from that business. I mean we are really focused on how we are deploying capital, acquiring customers in the countries that generate most ROI. So, hopefully, in order to continue this way, we will be able to be coming back to calls later this year and start saying when we are going to become actually free cash flow positive, not just EBITDA positive, as you know, net fund spends are a large number of dollars in CapEx acquiring the IP phones that we give to customers. Every day, we really â\u0080\u0093 again, like we focus on optimizing the business to make sure that, again, we are bringing on customers for the right price and the right kind of customers in the right areas where we get the right paybacks. And itâ\u0080\u0099s great to say that the business is still spending about $20 million a year or so acquiring customers, and they are very close to be completely self-funding. Well, that leads into my next question, which is, I think multiples in UCaaS well and in point of sale, too, so across basically everywhere that you are competing, multiples have come down quite a lot. And we are â\u0080\u0093 right now, we are focused on improving the business."
}