{
    "symbol": "FGI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-15 11:35:03",
    "content": " Our first full quarter as a public company got off to a solid start as we exceeded our initial expectations for both revenues and adjusted operating income, highlighting the strength of our overall business model and key strategic initiatives, including the strength of our product portfolio, our commitment to our channel partners and consumers, our ongoing margin recovery and the stability of our key end markets. Our first quarter revenue increased by 20% on a year-over-year basis, driven by volume growth across both our Sanitaryware and Bath Furniture categories, as well as continued strong momentum in our newer product lines, such as our custom kitchen cabinetry and shower systems business. We generated first quarter adjusted operating income of $0.9 million, which was down from $2 million in last year's first quarter, as our strong organic revenue growth was offset by supply chain issues, inflationary pressures and public company costs. Revenue totaled $43.6 million during the first quarter 2022, an increase of 20% compared to the prior year, driven by 3% volume growth and a 17% benefit from price mix. Sanitaryware was $28 million during the first quarter of 2022, an increase of 24% compared to the prior period, driven by 3% volume growth and 21% benefit from price mix. Bath Furniture revenue was $10 million during the first quarter 2022, a decrease of 12% compared to prior period, as volume growth was offset by less favorable mix. Other revenue was $5.3 million during the first quarter 2022, an increase of 153% compared to the prior period, driven by volume growth of our Jetcoat Shower Wall System and the improved price mix. Gross profit was $7.5 million during the first quarter 2022, an increase of 3% compared to prior year period, as strong revenue growth was offset by supply chain disruptions and inflationary pressures. Excluding one-time IPO bonuses and stock-based compensation expenses of $0.2 million, adjusted operating income was $0.9 million during the first quarter, compared to adjusted operating income of $2 million in the prior-year period, as strong revenue growth was offset by gross margin pressure, higher selling, and distribution costs, and public company costs. GAAP net income was $0.5 million, or $0.05 per diluted share, during the first quarter 2022, down from $3 million or $0.42 in the same period last year."
}