{
    "symbol": "FGI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 03:00:09",
    "content": " Demand trends remained steady across our key product categories during the second quarter, with total revenue increasing by 13% on a year-over-year basis, driven by a strong demand for Sanitaryware and continued growth at our newer product categories. Our Sanitaryware business grew over 50% in the second quarter, with both the wholesale and retail channels generating strong growth, while our Other product category, which is primarily our Shower Systems and Custom Kitchen Cabinetry business grew 35% in the quarter. While are adjusted operating margin was down year-over-year in the quarter, we saw roughly 150 basis points of sequential adjusted operating margin improvement from the first quarter of 2022 and we expect to see continued margin improvement in the back half of the year, as a result of ongoing pricing actions, increased scale, improved mix and efficiency gains. Revenue totaled $47.8 million during the second quarter 2022, an increase of 12.5% compared to the prior year, driven by strong volume growth and the continued benefit of our strategic pricing action, offset by negative mix. Sanitaryware revenue was $32 million during the second quarter of 2022, an increase of 56% compared to the prior period, driven by strong volume growth in both our wholesale and the retail channel, as well as the benefits our price increase. Other revenue was $7.9 million during the second quarter of 2022, an increase of 35% compared to the prior period, driven by volume growth of our Custom Kitchen Cabinetry business and our Hajoca shower system coupled with pricing gains. And for the inventory, as you can see, we already dropped from the pick time during year-end first quarter $21 million to $18 million so far and we fully expect just like, Dave mentioned, this -- the continue will be the trend for the back half of 2022. So weâ\u0080\u0099re going to see, not only are we going to see that growth continued in the second half of this year, but weâ\u0080\u0099re going to see material growth sizably next year as we enter into some newer programs with some new customers with that business."
}