{
    "symbol": "GKOS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 22:26:17",
    "content": " These include statements about our plans, objectives, strategies and prospects regarding among other things: sales products, pipeline technologies, our US and international commercialization integration and market development efforts, the efficacy of our current and future products our competitive market position our regulatory strategies and reimbursement for our products financial condition and results of operations as well as the expected impact of the COVID-19 pandemic on our business and operations. During the third quarter, we were delighted to announce positive top line data for both Phase III pivotal trials of iDose TR that successfully achieved the prespecified primary efficacy end points through three months and demonstrated excellent tolerability and a favorable safety profile through 12 months. The powerful Phase 3 results also demonstrated that 93% of slow-release iDose TR subjects remain well controlled at 12 months, an encouraging trend that is fully -- further supported by the three-year results observed in our Phase 2b clinical study in which 73% of patients remain well controlled on a single injection of iDose TR using the same or fewer baseline medications. And the third thing I'll mention is iStent infinite, given as we've talked about for a while the six to nine -month MAC process for establishing coverage the pro fee et cetera, I think that people need to be thoughtful about the way they integrate that in their 2023 models and understand that it will be a more meaningful contributor in the second half of 2023 versus the full year. And both in the combo-cataract segment where we've got the core stents, but also increasingly hopefully iPRIME, as well as iAccess and iStent infinite driving those results both in combo-cataract and stand-alone there's a lot of opportunity there for us, but we've got a lot of execution both on the reimbursement side as well as on the field side to ultimately deliver in 2023. Now it's important to note that our Epi-on procedure is very different from those that the FDA cites because our procedure includes a continuous perfusion of oxygen across the cornea during the procedure, which yields greater production of oxygen free radicals and thus thermal penetration and that results in more extensive cross-linking and leads invariably to the efficacy results that we demonstrated in our Phase III pivotal study. And clearly, we continue to build the business on the excellent safety and efficacy results of our Photrexa product and our Epi-off clinical design which I'll just remind the community is the only FDA approved cross-linking procedure that's available today."
}