{
    "symbol": "CXM",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-29 23:20:04",
    "content": " In addition, during today's call, we will be making forward-looking statements about the business and about the financial results of Sprinklr that involve many assumptions, risks and uncertainties, including our guidance for the first fiscal quarter of 2024 and full fiscal year 2024, and our actual results might differ materially. With our continued commitment to operational efficiency, we generated a record $14.3 million in non-GAAP operating income for the quarter due to strong revenue growth and greater operational discipline company-wide. As of the end of the fourth quarter, we had 108 customers contributing $1 million or more in subscription revenue over the proceeding 12 months, which is a 32% increase year-over-year. Turning to a quick summary of financial results for the full year FY2023, a year in which we posted material improvements and strong growth across the board, including total revenue, gross margins, non-GAAP operating income, free cash flow, and our key performance indicators. Our non-GAAP operating income improved by $41.5 million over FY 2022, which coupled with the incremental $125.8 million in revenue, demonstrates the inherent operating leverage in our business and computes to an incremental operating margin of approximately 33%. As of the end of FY 2023, total remaining performance obligations or RPO, which represents revenue from committed customer contracts that has not yet been recognized was $719.5 million, up 26% compared to the same period last year. For Q1 FY 2024, we expect total revenue to be in the range of $168 million to $170 million, representing 17% growth year-over-year at the midpoint. For the full year FY 2024, we expect subscription revenue to be in the range of $644 million to $648 million, representing 18% growth year-over-year at the midpoint. For full year FY 2023 â\u0080\u0093 2024, we estimate non-GAAP operating income to be in the range of $41 million to $45 million, equating to a non-GAAP net income per share of $0.13 to $0.15, assuming 273 million weighted average shares outstanding. Your line is now live. Your line is now live. We have a product called Sprinklr Community that we deploy alongside your contact center and apply a lot of the learnings that we have in the contact center and make it available to consumers from the outside  model, then thatâ\u0080\u0099s an ongoing real time optimized way of just making sure that your customers are getting better experience. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}