{
    "symbol": "CXM",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-14 22:09:03",
    "content": " Q1 total revenue grew by 31% year-over-year to $145 million, and subscription revenue climbed to $127.3 million, an increase of 32% year-over-year, coming off a strong finish to our FY '22. For the first quarter, total revenue was $145 million, up 31% year-over-year, and above our previously announced guidance range of $140 million to $142 million. This was driven by subscription revenue of $127.3 million, which grew 32% year-over-year, and was also above our previously announced guidance range of $123 million to $125 million. And we now have 90 customers contributing $1 million or more in subscription revenue over the preceding 12 months, which is a 30% increase year-over-year. During the first quarter, total non-GAAP operating expenses increased 41% over the prior year to $115 million representing 79% of revenue, up from 73% of revenue during the same period last year. To that end, I'm very pleased to report that in terms of free cash flow, we generated a positive $6.2 million in adjusted free cash flow during the first quarter, compared to a burn of $12.6 million in the same period last year. As of the end of Q1, total remaining performance obligations or RPO, which represents revenue from committed customer contracts that has not yet been recognized was $585.8 million, up 34% compared to the same period last year. Starting with Q2 FY '23, we expect total revenue to be in the range of $146.5 million to $148.5 million, representing 24% growth year-over-year at the midpoint. As a quick reminder in deriving the net loss per share for modeling purposes, a $9.4 million in tax provision for full year FY '23 needs to be added to the non-GAAP operating loss range just provided. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}