{
    "symbol": "AON",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 14:41:02",
    "content": " Over 1,100 basis points of margin expansion or about 90 basis points per year, while adjusted EPS and free cash flow increased at a compound annual growth rates of 12% and 13%, respectively. Looking ahead, we continue to expect mid-single-digit or greater organic revenue growth for the firm, margin improvement and double-digit free cash flow growth for the full year 2023 and over the long term. We delivered strong operational improvement in Q4 with adjusted operating margins of 33.2% an increase of 40 basis points driven by organic revenue growth and efficiencies from Aon Business Services, overcoming expense growth, including investments in colleagues and technology to drive long-term growth and some ongoing resumption of T&E. Our outlook for free cash flow in 2023 and beyond remains strong and we continue to expect to deliver double-digit free cash flow growth for the full year and over the long term, driven by operating income growth and working capital improvements. And it's really driven by revenue growth, the portfolio mix shift to higher margin areas and the productivity benefit we're getting from Aon Business Services. And so we're extremely confident with that track record at least for our financial guidance which is mid-single-digit or greater organic revenue growth, margin expansion for the full year 2023 and double-digit free cash flow growth for the full year 2023. I do think it's worth on this point, in particular, understanding and maybe taking a minute to step back and say, listen, when you think about our ability to drive organic growth, to drive margin improvement, to drive free cash flow improvement, fundamentally, Christa and I both highlighted the role the Aon United strategy plays in that. And frankly, it's allowed us to distinguish and differentiate our clients and the work that they're doing around cyber protection to be able to bring them to market in a way that gives them individual views but it's become quite a market in terms of size, probably approaching about $10 billion of premium and both from an insurance and a reinsurance side, I consider Aon a market leader in the space."
}