{
    "symbol": "BOSC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-29 10:27:07",
    "content": " Following managementâ\u0080\u0099s formal presentation, instructions will be given for the question-and-answer session. As a reminder, this conference call is being recorded and will be available on the BOS website as of tomorrow. With us on the line today are Mr. Ziv Dekel, Chairman, Mr. Eyal Cohen, CEO, and Mr. Moshe Zeltzer, CFO. Before I turn the call over to Mr. Cohen, I would like to remind everyone that forward-looking statements for the respected companyâ\u0080\u0099s business, financial condition, and results of its operations are subject to risks and uncertainties which could cause actual results to differ materially from those contemplated. Such forward-looking statements include but are not limited to product demand, pricing, market acceptance, changing economic conditions, risks in product and technology development, and the effect of the companyâ\u0080\u0099s accounting policies, as well as certain other risk factors which are detailed from time to time in the companyâ\u0080\u0099s filings with various securities authorities. I would now like to turn the call over to Mr. Eyal Cohen, CEO. Our competitive advantages are client trust, quality service, comprehensive and relevant offerings and innovation. Second, to increase market share by joining new clients. Second, we expand our business offerings in our core business. By that, we increase the revenues per customer and join new clients. We implement our strategy to achieve our goals in two ways, mainly internally, by investing substantial managerial resources to identify client needs and trends and to match the relevant technologies. In the background, we keep an open eye for M&Aâ\u0080\u0099s opportunities of companies that meet three criteria, first expand our offering in our core business. Second, profitable third has a robust business system. Hey, congratulations first on a great quarter and great year. So altogether we have good visibility for $31 million out of the $45 million projected revenues for year 2023, and we are just in the first quarter. I noticed that the revenues for the robotics division are, are ticking up and itâ\u0080\u0099s almost at breakeven. Along the years since the acquisition, we, we reduced significantly year by year the losses and improve the results and our outlook for the next year is to, to be profitable. And we had the very good system in place how to, to provide our client the components in a very good, in a, in a fair price for us. I donâ\u0080\u0099t see that this trend will change in next year, although we, the shortage in components is recovering gradually, but I donâ\u0080\u0099t think that the defense budget in the next year will be reduced. I would now like to turn the call over to Mr. Ziv Dekel, Chairman to make a concluding statement. This was -- this year was characterized by a continued execution of our plan for business improvement capability build up, and solution offering expansion which Eyal and the team are successfully leading and will lead for the year of 2023. Looking forward to 2023 and onwards, I trust Eyal and the management to further implement BOSâ\u0080\u0099s strategy to yield up a top line growth and increase profit margin, market share, and competitive position."
}