{
    "symbol": "MET",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 12:49:04",
    "content": " And our Latin America segment enjoyed both strong top and bottom line results, particularly in Mexico, as a heightened awareness of the importance of the products we offer, coupled with a flight to quality, drove sales up 26% on a constant currency basis, pushed persistency higher and added to adjusted earnings. On Page 4, you can see the fourth quarter year-over-year comparison of adjusted earnings by segment, excluding $140 million of notable tax items that were favorable in the fourth quarter of '21 and accounted for in Corporate and Other. Adjusted earnings in 4Q of '22 were $1.2 billion, down 28% and down 26% on a constant currency basis. Adjusted earnings per share were $1.55, down 23% year-over-year and down 21% on a constant currency basis. Moving to the businesses, starting with the U.S. Group Benefits adjusted earnings were $400 million versus $20 million in 4Q of '21, primarily due to significant improvement in underwriting margins aided by lower COVID-19 life claims, as well as higher volume growth. Regarding non-medical health, the interest adjusted benefit ratio was 69.4% in Q4 of '22, slightly below its annual target range of 70% to 75% and below the prior year quarter of 74.2%. For the full year, Group Benefits adjusted PFO growth was 3%, while underlying growth, excluding excess premiums from participating contracts in 2021 versus 2022 was up 5% and within the 2022 target range of 4% to 6%. Latin America adjusted earnings were $181 million, up 45% and up 51% on a constant currency basis. LatAm's top line continues to perform well as adjusted PFOs are up 20% year-over-year on a constant currency basis, and sales were up 22% on a constant currency basis, driven by growth across the region. EMEA adjusted earnings were $70 million, up 67% and up 112% on a constant currency basis, primarily driven by favorable underwriting versus Q4 of '21, which had elevated COVID-19-related claims, particularly in the U.K. EMEA adjusted PFOs were up 2% on a constant currency basis, and sales were up 13% on a constant currency basis, reflecting solid growth across the region. We estimate that our total U.S. statutory adjusted capital was $18.3 billion as of December 31, 2022, a decrease of 3% sequentially, primarily due to derivative losses and dividends paid, partially offset by operating earnings and investment gains. We are increasing our expected effective tax rate range by 1 point to 22% to 24% to reflect our expectation for higher earnings in foreign markets and lower tax credits in the U.S. At the bottom of the page, you'll see certain interest rate sensitivities relative to our base case, reflecting a relatively modest impact on adjusted earnings over the near term. For Group Benefits, excluding the excess premium from participating group life contracts of approximately $750 million in 2022, adjusted PFOs are expected to grow at 4% to 6% annually. We expect Asia's adjusted earnings, excluding $270 million of COVID-19 claims in 2022, to grow at mid-single digits over the near term. We expect EMEA run rate adjusted earnings to be roughly $55 million per quarter in 2023, reflecting the impact of currency headwinds and then grow by high single digits in 2024 and 2025."
}