{
    "symbol": "AOS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 12:55:22",
    "content": " Despite the destocking activity, North America sales were up 11% compared to 2021 primarily due to inflationary pricing and strong demand for our commercial and residential boilers and water treatment products. North America water heater sales grew 10%, in 2022, due to 2021 pricing actions implemented in response to rising material and logistic costs, and acquisition-related revenue that was partially offset by lower residential volumes. After two years of greater-than-average growth, residential unit industry demand decreased approximately 12% compared to 2021 primarily due to a wholesale channel inventory destocking that occurred during the second and third quarters. Turning to fourth quarter performance, we delivered sales of $936 million in the fourth quarter of 2022, down 6% year-over-year, driven by lower residential water heater volumes in North America and lower consumer demand in China that more than offset inflation-related pricing actions. Moving to slide 11, fourth quarter, rest of the world segment sale of $250 million decreased 13% year-over-year, primarily driven by the impacts of unfavorable currency translation and lower consumer demand in China due to COVID-19 related restrictions. In China, lower incentives and selling expenses offset lower volumes and currency translation headwinds resulting in segment operating margin of 12.7%, a significant improvement over segment operating margin of 10.6% in the fourth quarter of 2021. We project approximately 5% to 7% growth in sales of North America water treatment products, which is lower than our growth expectation of 10% per year, largely as a result of a reduced backlog as we exited 2022. Our fourth quarter 2022 North America adjusted operating margin, of 23.3%, improved over previous quarters as we exit the year with a favorable price-cost relationship and our plants are running more efficiently after the third quarter volume adjustments. Your line is open. Your line is open. Your line is open. Hey, good morning, everyone. Your line is open. Your line is open. Hey, good morning, everyone. Yes, I mean, we did had some great growth in 2022, on the boiler side, and again particularly in the fourth quarter was helped by drawing down our backlogs which we exited the year pretty normal, in that 10% to 12% growth that we see for next year, at 50% to 60% of that is price. Your line is open. Your line is open."
}