{
    "symbol": "AKTS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-12 10:55:14",
    "content": "  All statements other than statements of historical facts included in this conference call, such as expectations regarding our strategies, operations, costs, plans and objectives, including the timing and prospects of product development and customer orders, our expectations regarding achieving design wins from current and future customers, the possibility of entering into collaborative or partnering relationships, potential impacts of the COVID-19 pandemic, litigation matters, guidance regarding expected revenue, product orders and milestones for the current and future fiscal quarters, and expectations regarding the integration of acquired business operations are forward-looking statements. We expect to see this number continue to grow throughout calendar 2022, including two new expected Wi-Fi 6E design wins in the current September quarter. Such funding would position Akoustis to manufacture and deliver billions of XBAW filter chips annually and position us to service both Tier 1 and Tier 2 mobile companies for 5G smartphones, as well as other high volume end markets, including 5G networks, high frequency Wi-Fi devices and other wireless markets. We now have over 15 announced Wi-Fi design wins and we expect to add both additional customers in production, as well as new design wins throughout the balance of calendar 2022, including the two expected new Wi-Fi 6E design wins I previously mentioned. I am also pleased to announce that we fully qualified four Wi-Fi 6E, Wi-Fi 7 XBAW filter products during the June quarter, in line with the milestones we set at the end of March, we expect to release into production these four Wi-Fi 6E, Wi Fi 7 filters in the current September quarter. This includes the new Fortune 100 Internet company customer that we announced on August 24th, which has given us a development order for two new Wi-Fi 7 XBAW RF filters for the AR/VR markets and wearables and other mobile devices. Moving on to 5G mobile, we continued our momentum in 5G mobile during the June quarter, getting closer to our goal of entering production in the 5G mobile market by late calendar 2022, early calendar 2023 with the first of three Tier 1 customers with whom we are currently engaged. We initiated the next phase of this development with new engineering samples expected by the end of calendar 2022, these new XBAW filters incorporate the customer's designs, and we are targeting production ramp in late calendar 2024 early 2025. In the current September quarter, we expect multiple new Wi-Fi 6E and network infrastructure customers to ramp production. The ongoing semiconductor chip shortages and supply chain delays that are impacting the broader industry continue to impact our customers, while our design win momentum continues to grow driven by Wi-Fi 6, Wi-Fi 6E, Wi-Fi 7, 5G mobile, 5G infrastructure and our other markets, our ability to grow revenue is being negatively impacted in the near-term given the broader market disruption. Further, we expect to secure at least two additional Wi-Fi 6E design wins during the quarter and we expect a development order from a Fortune 100 Internet company for two diplexers for design into next generation AR/VR headsets and other consumer devices, a milestone we have already achieved and announced in late August. In addition, we expect to iterate the original filter design for our first Tier 2 RF front-end module customer and receive a purchase order for two additional XBAW filters for development, a milestone we have already achieved and announced in late August and we expect to receive a volume order from our first Tier 1 mobile customer for the 5G XBAW filter that is expected to go into preproduction in late 2022, early 2023. So the revenue is slowed down at least for the next two quarters as we layer in the new programs, this quarter and the following quarter, but then picking up again with not only the Wi-Fi 6E design wins that we're in process with and executing, but also the ramp of the production and also the new Wi-Fi 7 programs that we expect with the new designs that we have coming out."
}