{
    "symbol": "XMTR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 14:34:11",
    "content": " We had a strong Q1 with revenue of $83.7 million, driven by robust marketplace growth and expanding supplier services with the addition of Thomas. On top of strong revenue growth, gross profits grew 235% year-over-year in Q1, driven by significant improvements in marketplace gross margin and the addition of higher-margin supplier services. On top of strong financial results in Q1, we released new products and services to improve our marketplace experience for buyers and suppliers and made further progress in our integration plans with Thomas. We generated Q1 revenue of $83.7 million, up 90% year-over-year, driven by strong marketplace growth and the addition of Thomas in supplier services. Q1 total non-GAAP operating expenses increased 145% year-over-year to $45.7 million, driven by the addition of Thomas for a full quarter, continued investment in the business and incremental public company costs. For fiscal year 2022, we are raising the bottom end of our revenue guidance and now expect revenue in the range of $392 million to $400 million, representing year-over-year growth of 80% to 83%. We expect our adjusted EBITDA loss to be in the range of $32 million to $36 million, reflecting strong revenue and gross profit growth, the anniversary of our public company costs from our June 2021 IPO and continued operating leverage. But what's great when you see the year-over-year growth and as we sort of mentioned in the call, we've raised our guidance overall for the year as we're seeing with the increased data that we're getting and the increase in the number of active sellers or suppliers that are taking work from Xometry, we're seeing some better-than-expected increase in gross margins, and that's driving why we raised the bottom half of our gross margin for the year. So again, we're going to be reporting out marketplace versus supplier services, and we said marketplace is, historically, almost all of the Xometry business, excluding the financial services, those 90% gross margin businesses in suppliers and supplies."
}