{
    "symbol": "XMTR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 14:15:04",
    "content": " In Q4, revenue increased 46% year-over-year to $98.2 million driven by marketplace growth and expanding supplier services with the addition of Thomas. In Q4, average order value in the U.S. marketplace declined approximately 8% quarter-over-quarter, negatively impacting revenue by $6 million to $7 million compared to expectations. We generated Q4 revenue of $98.2 million up 46% year-over-year, driven by marketplace growth and the addition of Thomas and supplier services. Q4 total non-GAAP operating expenses increased 53% year-over-year to $50.3 million driven by the addition of Thomas, continued investments in the business and incremental public company costs associated with Sarbanes Oxley. This increase in non-GAAP sales and marketing expenses on a year-over-year basis was driven by the addition of Thomas sales and marketing costs, continued investment to expand our network of buyers and suppliers, and hiring of additional salespeople to support strong growth in our land and expand strategy. So now, as we're taking those learnings we've been optimizing prices, and so even on, so let me just look at that, just from the price perspective, you're seeing that we're, very selectively raising prices and optimizing it also trying to make sure that we're going to maintain that very strong order growth that we've been seeing. But we've taken those and now you're going to see the AOVs grow as a result of us  testing and picking those learnings and optimizing pricing, as we said, raising prices, where we think we have the room to do that without impacting this healthy growth in orders that we've been experiencing. One moment for our next question. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. Your line is open. One moment for our next question. Your line is open."
}