{
    "symbol": "RE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:42:14",
    "content": " We have improved the company's risk profile across both Reinsurance and Insurance, reducing our cat exposure with a more durable, resilient portfolio capable of absorbing a historic industry loss like Ian and containing it to an earnings event at just 1% of our estimated industry loss and with our Reinsurance segment being below 1%. The combined ratio for the group was 112%, including the previously announced pretax catastrophe losses net of recoveries and reinstatement premiums of $730 million, primarily from Hurricane Ian. The impact of natural catastrophes, primarily Hurricane Ian, led to a $110 million pretax catastrophe loss net of recoveries and reinstatement premiums in the quarter and resulted in a combined ratio of 103.5%. Net income stands at $101 million year-to-date, while total shareholder return, or TSR, was minus 1% year-to-date, given the cat losses as well as continued volatility in the equity markets. The combined ratio of 112% for the quarter includes 27.4 points of losses from previously announced natural catastrophes, primarily from Hurricane Ian as well as European hailstorms, Hurricane Fiona and several other cat events around the globe. Group attritional loss ratio was 60.2%, a 70 basis point improvement over the prior year's quarter, led primarily by the Reinsurance segment, which I'll discuss in more detail in just a moment. The combined ratio for the quarter was 103.5% up modestly year-over-year due to the cat losses I mentioned earlier, but the attritional combined ratio improved 50 basis points to 89.8% for the quarter and 120 basis points year-to-date as rate and exposure continued to outpace trend, further supported by our focus on risk selection and favorable loss experience. The other thing I would sort of say to put this in some concrete terms, I mean I think our view would be if the loss ends up being smaller than we've indicated in terms of total industry loss, our view is that our share would remain relatively stable over a reasonable range. But in terms of your point, look, I think what Ian shows, if you look at our current loss estimate, and $55 billion, and our net P&L statistics, it's showing more like a 1 in 41 than 50. Our expectation, you know, as Mark has indicated, to give you that number is if PCS catches up to our view of the ultimate industry loss, there's going to be a meaningful cap on recovery, which would lower our net loss, which would square with our P&L our published P&L."
}