{
    "symbol": "SOLO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 19:10:05",
    "content": " SOLO production for the third quarter was 103 vehicles, a drop sequentially from this year's second quarter as our manufacturing partners and vendors were impacted by pandemic aftershocks and China's Zero COVID policy, but roughly the same as production a year ago. Revenues were correspondingly slightly lower at 1.44 million versus 1.55 million during the prior quarter, but roughly 12 times higher than the same quarter a year ago. Finally, and while we have a lot of work to do on this front, I want to highlight that we also improved our gross margins by roughly 55 points from last quarter. We expect margins to be volatile from quarter to quarter, given the unpredictable macro environment but directionally, we are headed in the right way, and I want to give credit to everyone in ElectraMeccanica who's working hard to make sure that we're running our business as efficiently as we can. First, while we produced and delivered fewer vehicles this quarter than Q2, we don't see a slowdown in either demand or in our ability to scale in order to capture our horizontal market opportunity. Our manufacturing partners who faced a Zero COVID policy headwind are back on track and at the same time right now, we are activating a new marketing campaign across multiple channels that we expect to have a significant impact at every point of our sales pipeline. It will allow us to dramatically shorten our supply lines and associated lead times, reduce costs, avoid unforeseen tariffs, give us direct control over manufacturing and operations, place us in the heart of what we expect to be a key market and not least the potential to create hundreds of jobs in our home market, the United States. As Kevin said earlier, our revenues in the third quarter were $1.44 million, up over 12 times from the previous year and a slight 6.9% decline from the prior quarter, reflected by the reduction from our 68 SOLO deliveries to 64 our production, as Kevin mentioned, was 103 vehicles. Over time as we complete the process of onshoring our manufacturing facility in Mesa, this will enable us to have a greater control of our supply chain, avoid unpredictable tariff policies and expect that this will positively contribute to our gross margins. Our operating expenses, which include SG&A and R&D, increased 14.2% sequentially over the prior quarter to $20.9 million, reflecting higher costs to support our expanding operations. Finally and importantly, our balance sheet remains healthy with a working capital of just over $173 million at the end of the quarter. Over the course of the 13-week pilot, which ends in December of this year, AWRG will have put at least 12 of our SOLO Cargo vehicles through their paces, delivering pizza in its temperature controlled, custom-built cargo area across Los Angeles and other southern California counties. When I took over as CEO almost a year ago, I said that I wanted our company to be understood as an OEM, because that was how we were going to operate our business and deliver returns to our investors, making and selling great vehicles."
}