{
    "symbol": "PRCT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 10:25:23",
    "content": " Total revenue for the fourth quarter of 2022 was $23.8 million, representing growth of 135% compared to the fourth quarter of 2021. Thus, we do not expect the capital risk added in the fourth quarter of 2022 to start meaningfully contributing to U.S. system sales until the second half of 2023, which is factored into our 2023 guidance. We exited the fourth quarter of 2022 with an installed base of 167 systems in the U.S. We estimate approximately 2,700 total hospitals in the U.S. are performing in PPA surgeries, of which 860 are high-volume targets, averaging over 200 BPH procedures per year. Total revenue for the fourth quarter of 2022 was $23.8 million, representing growth of 135% compared to the fourth quarter of 2021. U.S. revenue for the quarter was $21.8 million, representing growth of 149% compared to the prior year period. In the fourth quarter, we sold 28 AquaBeam Robotic Systems generating total U.S. system revenue of $10.4 million, representing system revenue growth of 109% compared to the fourth quarter of 2021. U.S. handpiece and consumable revenue for Q4 was $10.4 million, representing growth of approximately 202% compared to the fourth quarter of 2021. We shipped approximately 2,960 handpieces in the U.S. in the fourth quarter, representing unit growth of 145% during the fourth quarter of 2021 with average selling prices of approximately $3,140. Moving to our 2023 financial guidance, we expect full year 2023 total revenue to be approximately $125 million, representing growth of approximately 67% compared to 2022. Lastly, we expect full year international revenue to be approximately $9 million, representing growth of approximately 24% compared to 2022. So just some specificity around the capital to your question, when we look at the full year, our total revenue guidance of $125 million, if you parse out the utilization metrics that we provided, you'll back into around 140 U.S. system sales in 2023 for the full year, which would suggest we're going to continue to see the momentum and the pipeline coming to fruition that Reza went through in his prepared remarks."
}