{
    "symbol": "SNY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 15:08:05",
    "content": " Moving to slide 3, I would like to remind you that information presented in this call contains forward-looking statements that involve known and unknown risks, uncertainties and other factors that may cause actual results to differ materially. Our speakers on the call today are: Paul Hudson, Chief Executive Officer; the Global Business Unit Heads, Bill Sibold, Thomas Triomphe, Olivier Charmeil and Julie Van Ongevalle; and Jean-Baptiste de Chatillon, Chief Financial Officer. For the Q&A, you have two options to participate: option one, click the Raise Hand icon at the bottom of your screen; or option two, submit your question by clicking the Q&A icon at the bottom of the screen. With 10 consecutive quarters of growth, weâ\u0080\u0099re successfully closing the first chapter of our â\u0080\u0098Play to Winâ\u0080\u0099 strategy. Well, we are looking forward to the upcoming launches, key readouts as well as Dupixent that is set to reach â\u0082¬10 billion in 20 23. On slide 6, starting with the full year view, 2022 marks the first year, where Specialty Care delivered a highest sales amongst our businesses. The biologic profile of Dupixent, to this day, we believe remains the best in its class with exceptional ability to balance high efficacy with compelling safety. Blazing the trail in markets that are underpenetrated in terms of eligible patient populations, Dupixent keeps adding significant patient pools through multiple approvals in diseases that are still underserved. Without question, this medicine is now a key cornerstone in treating chronic Type 2 inflammatory diseases. In the second half of the year, weâ\u0080\u0099ll be ready to launch Beyfortus. This winter almost everybody learned how contagious the virus such as RSV can be, with the potential to cause a serious respiratory illness requiring hospitalization in those that need protection most. We have carved in a standalone structure over the past few years and we are embarking on the next phase, enabling CHC to fully manage all its corporate functions independently. Finally, the progress we're making in streamlining GenMed also delivered encouraging results. Notably, the core assets we are prioritizing are increasingly contributing to GenMed's performance, now totaling â\u0082¬6.4 billion of sales, up 5.2% from last year. While our CFO, J-B, will detail our financial performance in his section, I would like to highlight our strong earnings of â\u0082¬8.26 per share, growing 17.1% at a CER and continuing the strong trend we set in 2019. Moving to slide 7, let me remind you of the achievements of the first chapter of our six-year strategic plan. As a few proof points of our transformation thus far, I highlight the 10 consecutive quarters of growth, the 540 bps BOI margin improvement, and the â\u0082¬2.7 billion of cost efficiencies, which we reinvested behind growth drivers in our pipeline. To accelerate our R&D pipeline, we also deployed cash to value-creating transactions securing access to external innovation. On the next slide, let us pivot to some leading indicators of our transformation to an innovation led company. In 2022, our R&D efforts were recognized by as many as nine publications in major peer reviewed medical journals, including New England Journal of Medicine and the Lancet. Turning to the next slide, 2022 has been a landmark year in Sanofi positioning -- sorry, in Sanofi positioning itself as a player to drive global ESG initiatives, which we presented to you by the way back in July â\u0080\u009822. Our commitment to society is exemplified in our R&D efforts to address underserved populations, and I'm particularly proud to give you the latest update on our dedication to eliminating sleeping sickness, a terrifying disease killing patients in less than two years of untreated and still endemic in very remote areas of sub-Saharan Africa. Sanofi has been partnering with the World Health Organization for more than two decades, donating drugs and providing financial support, and as a result, the number of diagnosed patients fell by 97% since 2001 to reach as few as 800 cases last year. At the same time, we've continued R&D efforts in order to push those numbers even lower. Phase 2/3 trial results show compelling efficacy and safety, and the key advantage of acoziborole is simplification and accessibility, providing an oral one and done dosing option. Patients can be treated with no need for hospitalization, and our regimen could also include the treatment of children. Looking ahead, 2023 will mark two major first-in-class or best-in-class launches, for the first time in the Company's recent history. We plan to launch Altuviiio in Hemophilia A, a medicine with a compelling profile that is poised to capture market share, both from factor and non-factor therapies. Equally exciting, we are ready to launch Beyfortus for RSV prevention in time for the next season, providing all infant protection. Dupixent in COPD and tolebrutinib in relapsing remitting MS. For both, we hope to see breakthrough data sets, particularly in COPD. When you think about the huge unmet need and the challenges that patients and healthcare systems face, this could be a real game changer. With 27 earlier stage readouts from assets with first or best-in-class profiles, especially in immunology, we are set to deliver on our ambition to transform the practice of medicine. Across the organization, our teams have been relentlessly executing our plan over the last three years, and I want to take this opportunity to express my gratitude for all their hard work. During the 2023 to 2025 period, our action will be focused on our existing objective to achieve more than 32% BOI by 2025. We are steadfast in our ambition to reach this target with new launches, continuous Dupixent profitability improvement, and by further streamlining our portfolio. While 2026 and beyond is not fully laid out yet, we have previously guided you on growth targets for the second half of the decade, the immunology and vaccines. Unlike any of our peers in the industry, we are in a unique position with the portfolio uncompromised by a meaningful LOE exposure over this period. To fuel this next chapter of growth, we are confident in our improved R&D productivity, driving a pipeline made up of at least 70% biologics with 90% to 95% of products being best in class or first in class. Significant unmet need remains in immunology, neurology, oncology, and vaccines, where our science is gaining momentum as we continue to focus on winning product profiles, including medicines such as to tolebrutinib, itepekimab and amlitelimab. On the next slide, let me transition to the business performance of Q4, which will be led by our GBU heads. Bill will start by highlighting Dupixentâ\u0080\u0099s growth weâ\u0080\u0099ve shown again in Q4, driving Specialty Care performance to new heights. Dupixent remains the top driver of this growth fueled by strong demand across indications, geographies, and age groups. In 2022 alone, we managed to add 225,000 new biologics eligible patients with the addition of asthma in the EU to treat 6 to 11 year olds, EoE in the U.S. for 12 years and up, AD in the U.S. for ages from six months to five years, and finally prurigo nodularis in the U.S. targeting adults with high unmet need. Switching to rare diseases, I am pleased with our performance in this core TA where we not only continue to add new patients in our LSD franchises, we are also starting to benefit from the contribution of recent new launches. Turning to oncology and neurology, as you know, we anticipated lower sales in the quarter due to a number of factors related to late life cycles. In particular Jevtana in the U.S. and the Aubagio LoE in Canada, which gives us an indication of the very significant impact we can expect from U.S. generic entrants to Aubagio beginning as early as March of this year. In Europe, the first generic entrant is expected in the fourth quarter of 2023, based on confidential agreements Sanofi concluded. On slide 15, let me draw your attention back to Dupixentâ\u0080\u0099s growth trajectory, set to reach â\u0082¬10 billion in sales in 2023. Q4 delivered another quarter of more than 40% sales growth globally, ex U.S. sales are now annualizing over â\u0082¬2 billion and incremental â\u0082¬3 billion were added in 2022 globally, also benefiting from the strong U.S. dollar. Not only did we launch Dupixent for PN in the U.S. in the fourth quarter, but we also received approval for this indication in Europe in December, making Dupixent the first and only biologic available for the treatment of this dermatological disease. This indication has the potential to add another 308,000 biologics eligible patients to receive treatment for a highly debilitating skin disease. If approved, we have the potential to add a population close to the size of the market targeted with Dupixent in COPD. As a quick reminder, the usual dynamics around co-pay assistance programs that typically take place at the beginning of the year are expected to weigh on reported sales figures in Q1. Dupixent's leadership amongst specialty respiratory biologics is depicted by the pie chart on the left side, reaching 37% NBRx share. More importantly, as you can see in the table on the right, the asthma biologics market in the U.S. remains largely underpenetrated. Today, only 22% of biologics eligible asthma patients above the age of 12 receive an advanced therapy, and as such, represents an enormous potential for future growth with Dupixent in this indication alone. In children, the opportunity to treat biologics eligible patients with unmet need is even higher. Furthermore, as Paul already mentioned, our teams are highly excited about Dupixent's potential to become the first biologic to treat COPD, a devastating disease that has seen no innovation in the field for the last decade and is the third leading cause of death worldwide. On slide 17, switching now to some recent innovative launches in our rare disease portfolio. While the targeted patient populations for these products may be small individually, the importance of improving people's lives with these first-in-class therapies continues to reinforce our leadership in rare diseases. Moving to my final slide, I want to zoom in on our expected upcoming launch of Altuviiio. With Altuviiio, we have a best in class factor treatment with the potential to set a new efficacy standard by providing a near to normal range of factor VIII levels for most of the week, coupled with its reduced treatment burden of once weekly dosing. With the PDUFA date later this month, we believe Altuviiio will be the first breakthrough medicine to enable new daily lifestyle possibilities for hem A patients. To-date, we are particularly excited about the positive physician and patient feedback we have received over the time of its development. In addition, the recent New England Journal of Medicine publication highlighted Altuviiio's potential to transform the treatment landscape for people with hemophilia A. With that, I hand over to Thomas to update you on the Vaccines business. Q4 Vaccines sales were â\u0082¬1.7 billion, 16% down versus prior year as expected, owing to strong operational execution leading to the shipment of large volumes of flu vaccines already in Q3. We delivered another record sales year for flu, driven by our differentiated vaccines. PPH sales were lower compared to the same quarter last year due to the COVID-19 situation in China, disrupting the routine infant vaccination at the centers of care. In addition, Vaxelis sales keep growing in the U.S. Given it's a JV between Merck and Sanofi, those sales are not consolidated in our sales line. We continue also to observe progressive recovery of booster and travel vaccines, but the latter have not yet fully reached their pre-pandemic level. With almost â\u0082¬3 billion sales, we achieved another record year of flu sales in 2022 in a challenging vaccination environment marked by both, patient and provider fatigue. Our strategy to focus on vaccines offering protection beyond flu is paying off and is driving the flu franchise growth, Fluzone high dose and Flublok represent the majority of our flu sales since 2021 and do continue to grow. In the U.S., although overall vaccination rates decreased this season, the senior market has been stable and Fluzone high dose remains the market leader, gaining 4 points share in this segment. After Germany in 2021, some regions in Italy and in Spain have awarded their influenza tenders to Efluelda to vaccinate their seniors in 2022, thus providing the most vulnerable vaccine with demonstrated efficacy against both flu infections and its dramatic consequences. As we start the year, we are set to build up our strong position in pediatric vaccines. First, Vaxelis, the first and only hexavalent pediatric vaccine available in the U.S. reached 26% share of the 3 dose primary service at the end of 2022, 18-month only after launch, gaining share from the pentavalent pediatric vaccines. Second, we're getting ready to launch Beyfortus for the next RSV season. It has put heavy burden on healthcare systems and emotional strain on families, which reinforces the value of Beyfortus as a solution for an important unmet medical need. We're working closely with the FDA to expedite review timelines given the urgent unmet public health need caused by RSV, and to ensure equitable access to Beyfortus to protect all infants against RSV as soon as possible. Finally, on the R&D side, as announced at our vaccines event in December 2021, we now have interim results of our PCV21, RSV toddler, and Meningitis B programs. In Q4, general medicine sales decreased 3.7% to â\u0082¬3.4 billion. Our core assets grew 8% in Q4 despite the decrease in Lovenox sales, which continues to be affected by a low molecular weight heparin markets, decline following high demand during the COVID period. Our strong brands, Praluent, Toujeo, Thymoglobulin and Plavix all delivered double-digit growth in Q4. Furthermore, the adoption of Rezurock was robust with more than 1,400 patients treated since launch. The noncore asset sales decreased 10.8% in Q4, reflecting portfolio streamlining and Lantus decline in the U.S. as well as in China due to VBP implementation in May. For the full year 2022, General Medicine sales reached â\u0082¬14.2 billion. Importantly, our core assets were up 5.2%, in line with our ambition to grow our core asset mid-single-digit CAGR over the period of 2020 to 2025. Across our core brands, Praluent, Thymoglobulin, and Rezurock performed well, and we are specifically proud of reaching blockbuster status for Toujeo for the first time. This year, our total glargine sales, Toujeo and Lantus were down 10.7% in China. VBP implementation in May 2022 impacted Lantus sales as expected, but we saw a strong ramp-up of Toujeo, which benefited from a demand increase. Looking forward, we remain confident in the performance of our core assets. In parallel, we will continue to leveraging the compelling SoliMix data to source market share from the premixed insulin in the Rest of the World region. In 2023, we expect Toujeo to continue to be a significant contributor to the growth of General Medicines across many geographies, including China. In Q4, we closed two further local deals in Germany and Spain, ending the year with 122 product families from originally more than 300 in 2018. In summary, our recent performance and streamlining efforts gives us confidence in our ability to further drive the share of core asset sales to 60% of total GenMed sales by 2025. The Consumer Healthcare market continues to post double-digit growth in several of the categories, with price contributing way more than volumes. Q4 was notably affected by the tripledemic with high levels of influenza, COVID-19 and RSV across all geographies. However, our absence from this segment in major markets like the U.S., where market dynamic has been very strong, with over 30% growth, drove our latest rolling 12-month growth to lag slightly behind the market. Nonetheless, I'm proud to share that Sanofi CHC has delivered a fourth consecutive quarter of double-digit growth on a rolling 12-month basis, with strong performance across Digestive Wellness, Allergy and Cough & Cold categories. Our Digestive Wellness portfolio, in particular, continues to deliver outstanding results with 19 months of consecutive share gain. On the organization side, we're also taking the next big step towards becoming a fully standalone business within Sanofi. Effective January 1, 2023, all core functions such as finance, legal, HR and digital have been integrated under the unique CHC umbrella. In particular, dedicated digital systems and the IT teams joining our CHC forces enable us to initiate our disentanglement and further optimize and upgrade our road map with a clear end-to-end perspective. As a result, Q1 2023 onwards, we will be reporting results as a fully formed CHC organization, carrying our full portion of the support function expenses that were shared across the organization so far and reflected in the section, Other. For CHC, taking full ownership of our P&L will enable us to tackle our opportunities and increase our competitiveness in order to further drive growth. Many of our major categories, Digestive Wellness, Pain Care, Allergy, and Cough & Cold generated meaningful gains during the quarter. The Digestive Wellness brands, I highlighted last quarter in Enterogermina, Buscopan and Dulcolax continue to deliver outstanding growth, maintaining their leadership position and expanding new market share. Additionally, our leading local and regional brands delivered high growth. For instance, Eve, the number one general pain relief brand in Japan has delivered phenomenal market performance and sales growth in Q4. Strong marketing, commercial and pricing execution have resulted in driving market share above pre-COVID levels. Coupled with a very relevant and impactful global campaign, Don't Hide your Cough, rolled out across more than 30 markets with brands like Mucosolvan and Bisolvon Europe or East Asia and Mexico. In summary, 2022 was another year of strong performance, growing 8.6% in net sales and almost 10% organically, while transforming our business into a standalone organization. As Paul mentioned, I would like to pick a few drivers of our strong financial performance in 2022, obtained in spite of a challenging macroeconomic environment. Full year company sales reached almost â\u0082¬43 billion, growing 7% at constant exchange rate. Adjusting for divestments on EUROAPI sales in the prior period, sales growth would have been 8.6%. Operating expenses grew roughly in line with sales, the majority coming from R&D to fund and expand our pipeline for future growth. Other operating income, mainly driven by the Regeneron profit share was up more than 25% versus prior year due to the outstanding success of Dupixent. On slide 29, our pipeline being now mainly biologics, on our new manufacturing facilities becoming fully versatile, we have decided to combine vaccines and pharma manufacturing operations. CHC, on the other hand is successfully implementing its standalone model, driving significant improvement in performance over the last two years. This year, we have moved to the next level of autonomy by transferring remaining global functions. As such, beginning with Q1 2023, we will report a fully loaded segment P&L for CHC. To sum up, starting from Q1, we will present our divisional business, P&Ls categorized by Biopharma, Consumer Healthcare and Other. As a result, you can expect a much enhanced CHC disclosure, allowing you easy peer comparisons and for our team, benchmark will be easier and more compelling. With the consequences of climate change becoming very visible, it has become critical to set higher ambitions to effectively address these challenges. At Sanofi, we are bringing forward the time line of our ambition to net zero emissions to 2045. This marks a five-year acceleration versus our previous target, building on great work already done. For example, increasing our renewable electricity use and transitioning to a carbon-neutral car fleet, that has allowed us to already reduce emissions from our activities by 29% since 2019. On slide 31, our gradually growing dividend remains an important element of our capital allocation policy and ranks only behind organic investment on business development in our priorities. For the year 2022, we announced that the Board has proposed a plus 6.9% increase in the dividend to â\u0082¬3.56. Advancing to my final slide, we expect full year 2023 business EPS to grow in the low single digits at constant exchange rate. On ForEx, based on January 2023 average exchange rates, we see a currency impact of minus 3.5% to minus 4.5%. As a reminder, we would like to ask you to limit your questions to two each. And I will now repeat, for the Q&A, you have two options to participate: option one, click the Raise Hand icon at the bottom of your screen, and you will be notified when your line is open to ask your question, at that time, please make sure you unmute your microphone; or option two is to submit your questions by clicking the Q&A icon at the bottom of the screen, and then your question will be read by our panelists. So, the FDA has had the Hepatic Assessment Committeeâ\u0080\u0099s results since, I think, the end of September and your own data monitoring committee was happy to restart recruitment in Rest of World study. Just interested to understand why the FDA didn't give priority review given breakthrough therapy designation, huge epidemic. The -- we're still conducting the work that FDA had requested to try to gain a mechanistic understanding and to why a handful of patients out of over 2,000 on the studies have experienced liver injury. In the interim, as you know, 3 of the 4 studies are fully recruited, the 2 GEMINI study is for relapsing remitting and the HERCULES study for non-relapsing secondary progressive. I would note that in the world of MS drugs, it's not uncommon for practitioners to have liver monitoring as part of the onboarding of a patient as they started a new initiation of therapy when you ask about what the label might bring. I can't really speculate, but I suspect it would have monitoring in the early going -- and that's not uncommon among MS medicines. And maybe -- you touched on already, there is no drug, I think, specifically designed for secondary progressive MS and progressive nature of the disease. So really, still a very compelling story for us, and we'd rather spend the time now with the regulator getting it right and making sure we all understand where we are. So, it's worth spending the time to make sure we're good. Thomas, a question for you on, will we make June ACIP based on the decision to give a standard review. We are definitely going to launch Beyfortus in the U.S. in 2023, Graham. So, getting back to your question, we're not going to speculate about the rationale by the FDA. Clearly, what's very important is that as you've pointed out, after the approval in the UK, there has been a clear understanding by the agency and as well by the ACIP of the importance of Beyfortus to tackle RSV, which is the number one cause of hospitalization in the U.S. or in Europe or worldwide, actually in the first year of life. So, that's been clearly very important and fruitful dialogue. And I clearly don't see -- and we've been working a lot also with the ACIP member, as you know very well. Good progress, up and ready for the 2023 launch with both a licensure and ACIP recommendation. I mean, I think it's sort of the obvious question, if you'd like, and obviously, you've now got a fully loaded P&L and certainly, the use, I guess, by Julie of the words sort of road map forward. And then secondly, again, just strategically on the decision to combine Pharma and Vaccines into Biopharma. I guess, curious, I understand sort of what you said, but I wondered if you could provide a bit more color on why now, I guess, for that. I mean vaccines, obviously, in Sanofi is a key sort of franchise and arguably it gets perhaps better appreciated the value of it and the longevity of it, if it's a standalone. I'll make a -- well, I'll make some comments, and then Thomas or John, if you want to jump in. It started, and the work has been going on for some time in terms of converging platforms, shared services, could be engineering, could be many things. And of course, the modular nature of the three cutting-edge facilities we're building mean that we can move between antibodies and vaccines depending. So, it's a sort of future stake. I would just say for me, it's basically smart resource allocation, which actually increases the ability to develop, launch and distribute first-in-class, best-in-class asset moving forward. So, it's already paying dividends. As for other question, it's interesting that the turnaround in Consumer has been a real joy to watch. I think you know better than perhaps even I do, inside a company, we don't always benefit from the multiples and things associated with it. So, we would like people to understand what a great Consumer business that we have and we're very proud of it, and it's really moving at high speed. Now they have to raise their game, too, to make sure they compete with all other absolutely like-for-like consumer businesses. As for choices, well, we declared in 2019, we just wanted to grow faster than the market. And while we're growing faster than the market, we're in great shape. First question, just on the flu vaccines, and apologies if I missed it. So, perhaps you could talk about the expected drivers in the U.S. around maybe a return to more vaccinations because of a bad flu season and price rises. Thomas, you predicted a record flu season every single year since at least I've been here. As you know very well, I very often have that question at that moment of the year. We always say that we are only in early February, you know very well, but strains for the completion of the vaccines will be selected in March. So, it's probably a bit early to give a guidance. To keep being the leader in the flu market, there is some work to do on the vaccination rate. As we highlighted, it's been, I would say, a soft vaccination rate this year in H 2022. There has been disease, as we all have seen, but there is more disease coming back now, but there is less COVID-19 virus circulation. I think we can work with the system to make sure that this vaccination coverage rates do recover in '23 and '24, and that's the work we're on. It's clear that with our target in '25, 32%, we are aiming to go on improving our underlying performance for the Company. So, with an EPS growing in '23 as we are guiding at constant exchange rate, of course, it means that in spite of the LOE of Aubagio, we are looking at deep and important improvement of the underlying performance of the Company. I think even the chart shown today by Thomas, the progression and the value of the flu franchise since 2018 is, frankly, staggering. And while it's impressive, the total performance, the move to high dose has been really incredible. And as Thomas mentioned, the countries now that are making that standard of care in the elderly, just shows you that the protection beyond flu itself is significant and meaningful for payers and health systems. I'm not sure that's always easily picked up, certainly this morning. And I would strongly encourage some reflection on that because we are -- as we exit '23 on track for a BOI in '25, that's a major moment for us to be launching and with the last LOE behind us. And then secondly, Paul, you provided us with some of the key drugs to keep a progress support on back in December '19. Well, listen, we're very excited about our COPD programs. We're the only company in the industry that has two assets in Phase 3 development for COPD, which is a huge healthcare burden, as you know, some estimates are the third leading cause of death, a huge burden on healthcare systems and no new mechanisms have been approved for over 50 years. But the lung function improvements that we've seen with both of these molecules have just been really rock solid, unequivocal. So, that's an important variable to also mention when you think about what our prospects are for doing something meaningful for patients with COPD. So, we know there's no advanced therapies, I think inhaled therapy is what we referred to in triple, and we know we passed a high hurdle on the interim. And so, we know we have high expectations, but we're also turning the cards over here. Maybe just to flow on from that in terms of your other question, let's stay in COPD for a moment. Itepekimab, IL-33, that's around the corner. In an ideal world, we'll have two advanced therapies in COPD that would be -- well, incredible, frankly. Amlitelimab, I think you've mentioned yourself that's starting to get very exciting. We're doing some very clever work around there, getting some really interesting data now that we're getting first patients in, in our nanobodies, IL-13/TSLP, for example, TNF IL-6, I think we have 3 already in the clinic. We mentioned, I think, in what we circulated right at the end of the year that with the 27 early- to mid-stage readouts, there's a lot there. To go all the back to 2019, we picked that list in 2019, and I think we fared pretty well, I have to be honest, both -- in hemophilia, I think we've really exceeded our expectations for  to come. I think we have really made progress on the Dupixent LCM, of course. And so, I feel like the last three years as well, we've been upping our game in improving our probability of success just by much more methodical, much more rigorous work, not it wasn't being done before, really upping our game. So, as we pass through the sort of inherited readouts, let's say, kindly, we start to believe our probability of success just improves because we're getting better at it. And in particular, in immunology, I think we really will surprise everybody in immunology. So, it's starting to get really exciting. Just how quickly you anticipate that patients could be switching here, certainly looks like good reception in the journal, et cetera, great data. And the second question, just on business development. Usually, you're talking about incremental gains here and there, maybe some convenience gains. But with Altuviiio, you're allowing patients to be at near normal factor levels for the majority of the week. And we're going to be spending a lot of time and are spending a lot of time in the community, educating what is possible now. So, I think what we're excited about, in particular, is to see what does that mean to the mobility, to the lifestyle to just total quality of life for hemophilia A patients just around the corner from now. There's others that are saying, my patients -- they do for their regular appointments over the next months, and that's when we'll have the discussion about switching. So look, we're really optimistic that this is going to be a great launch. It's going to be a matter of getting our message out to everyone about now what's possible versus what you've settled for, for all these years. Thanks, Bill, and that's what's possible thing gets interesting because perhaps as we get a little bit further into the launch and physicians get the real experience of what it's like to give patients that near normal life, then the weekly nonfactors start to become a major consideration. Horizon, or I could name also Rezurock that we brought, even though it's much smaller than Horizon, it's opportunistic. On -- it's not always about the size because Horizon has the right price, was a great opportunity to accelerate our journey to invest more in innovative science. And as you rightly point out that the -- at the right price, there was an opportunity to use our pipeline in terms of investment and other assets. So, Sanofi's guidance is to double vaccine sales by 2030. And I'm wondering if you can talk about COVID flu combination products, specifically because Pfizer is talking about launching such a combo in 2025. So that is -- and I don't think our partners, Regeneron have either. So, we're -- we've designed what we think is of meaningful -- clinically significant, clinically meaningful effect size, but we have not disclosed quantitatively what that is. So, definitely doubling vaccines, what does it mean for flu, I think is at the heart of question of Tim. You're absolutely right, when we move forward from now in 2030. First of all, the fundamentals of the flu markets are positive in terms of more and more people in the aging part of our population. And therefore, the 60-plus segment is increasing and more and more recognition of the importance of preventing the severe epidemics moving forward. So definitely, it's going to grow. Now, our positioning, as we said before, we believe we have the right assets to start from, thatâ\u0080\u0099s how we're growing the business today with different -- flu vaccines that have both the ability to protection beyond flu, so an extra protection and doing it at a very good tolerability profile. Now, moving forward, obviously, we are a data-driven company. So, there's a lot we don't know yet. What we are sure is that we're developing the first generation of mRNA and the second generation working on thermal stability, tolerability and self administration. In a nutshell, Tim, if mRNA flu doesn't work, we win; if mRNA works very well, we will be also there. I think, the quality that's needed the organizational history and expertise, I think it won't just be about flu in the end, it will be -- because there are many of these people sadly passed from non-flu-related complications. John, just on the NK cell therapy platform, we've seen some disappointing updates from your competitors as it relates to NK cell expansion and durability of effects. And then secondly for Paul, forget what we've think, but the market, I think when we hear you talk about Play to Win, I think the market gets it on immunology. But when we hear you talk about playing to win in oncology, it's very difficult to really buy into that. I just wanted to understand from you whether oncology is a sacred cow that you'll continue to invest in, or is there a point where you'll take a difficult decision to say, look, we're not going to win here let's double down on where we could and focus there. Yes, we're very excited about the NK cell platform that we've been building at Sanofi. So, the first of those is in the clinic for AML, acute myeloid leukemia, that targets CD-123, and we haven't disclosed data on it, but the trial is progressing well. And that is also in the clinic also for AML, where prior to obtaining that platform, there was a proof of concept data already generated. That's just sort of NK cells 1.0 without genetic engineering, but we've established the capabilities to do the engineering on the cells for next-generation products, and you might have seen an announcement about our collaboration with Scribe, a company that has next-generation genome editing enzymes that we've been able to avail ourselves of those through that collaboration. We're continuing to really optimize schedule and dose around that and look forward to eventually combining these 3 legs of the stool in various ways for a variety of malignancies, starting with hematologic but then advancing into solid tumors in time. They're all -- all 3 of those components are in signal-seeking studies, and we hope to have a lot more to say about it as we approach the end of this year. The things that we've seen, not showed you, of course, that's the way it goes. First of all, I'm delighted that people fully appreciate, we're playing to win rare, we're playing to win in vaccines, we're playing to win in immunology. On oncology, I think we just have to be pragmatic. And of course, with our IL-2 retreating to Phase 1/2 on the dose interval, we may yet still come back and say something very meaningful that with the internal reduction, what that means in efficacy. We're doing some very interesting things, setting a very high bar, Johnâ\u0080\u0099s just touched on some of it, but it is earlier. You saw that when we exited diabetes and type 2 diabetes and cardiovascular, where we think we can make a massive difference, and then we're all in. Otherwise, we're not going to throw good money after bad, coming as a me too late. So we may go back to the magic a bit earlier in oncology, fair, and hope to surprise, but we are really playing to win across the areas that you mentioned. Presumably, Sanofi still has much internal expertise and could make that shift easier than just about any other company. But back in December '19, we said we're out of the me-too late business. It's a great little success story in cardiovascular and afib I think and has been -- it shows you where we think there are niche populations where we trade somewhere between rare disease sort of levels, we think we can have some money, we still participate. You know -- I think you know by now that we have a co-promotion deal with -- on type 1 diabetes, which is much closer to immunology and rare in terms of patient profile. So, I think what we declared was there's huge big commercial deployments to be fifth to market. But I think we have, as you point out, a brilliant set of experiences in both cardiovascular and diabetes. And I think if we thought that it stayed true to our ambitions, we'd be interested. And I think in some way, what we have done with Rezurock, I think proves our ability in area of expertise that we are to win. And I think it's -- we've got expertise, but we're not going to play that arms race in those other indications. I think one thing to remember is that Sanofi has by far the largest BTK program with well over 2,000 patients enrolled across four Phase 3 studies. And so, I'll leave you to speculate whether it's a matter of time and simply testing enough patients to adjudicate this issue. You're all aware, of course, Biogen announced that they had some issues with their BTK inhibitor and were put on clinical -- on a partial hold as well. So, let's see what happens as more patients over more time, get treated with this class of agents. So, I think we -- I donâ\u0080\u0099t know, maybe add too much more, come back to where we were. And John's already answered, when we look left and right at the BTK landscape. So let's just be really clear that we are in -- we're navigating, and -- we're navigating in a narrow corridor but still weighted in our favor. Ex U.S. pricing very rarely gets talked about, but we're seeing meaningful clawbacks in your home market of France, also in the UK and there's some worrying legislation in front of the European Commission about ex U.S. or EU drug pricing moving forward? But effectively, at the alliance level, it's a significant improvement on the COGS, â\u0082¬600 million will be in the bottom line, but it will improve the gross margin in Sanofi. So yes, it's a good success story. Trying to get to that real improvement and what it means for us, given how quickly we're growing, it's really incredible and how it fuels the rest of what we'll do next. So Matthew, you mentioned it in the right way, the situation is very different in emerging markets and in European. In the emerging market in some markets, although we face some price pressure, there are some markets we are able even to increase our price, especially in the countries that are weak currency, like Turkey, Argentina and couple of others. We face some price pressure on our products that have been in the market for many years, relatively small product but not more than on the average of the portfolio. But the fact that GenMed is not relying on 1 or 2 assets, but on a broad portfolio, of course, puts us in a better situation. The last point is, of course, given the price pressure that we face, especially in EU, we continue of course to work on our go-to-market model in order to make it as efficient as possible in an environment where we know that, of course, the price pressure will continue. I will say and couple of us -- team that the use of AI as well in helping us be very acutely aware of all of these moments has been some of the best I've ever seen, frankly. I know youâ\u0080\u0099ve been asked this before on the call, but just kind of between, Horizon, I think reports -- press reports earlier in kind of last week talking about potentially exploring a merger with Haley  and for the consumer health business. On the capital allocation, we've been clean from 2019 saying that we're looking to add science where we can. I think as JB said, we're not scared to leverage the balance sheet. We were in play for Horizon, last year, it was opportunistic for us. If you remember that Q2 was disappointing on execution, and we're brilliant in rare. So, you should know that we're not conservative if we think we can create more value for patients, for shareholders and for ourselves as a company, no hesitation. The gossip around Consumer, it makes me smile because we're running a really great Consumer business, but I wouldn't be misled by that. Well, as we mentioned during this call, there are several drivers which are helping us in our trajectory to '25. Of course, the Dupixent spectacular growth is accretive and has been accelerated with the acceleration of the reimbursement of the development balance with Regeneron. We said you could calculate looking at fitusiran projections, the products on which we have significant royalties. So we have on top of the performance of the efficiencies, we go on working on the underlying business. Yes, we will go across the Aubagio LoE in '23 with an EPS guidance at constant exchange rate, which is low single digit, which I think makes it quite easy to see what it can look like in terms of BOI. Firstly, on flu vaccine, I just wanted to ask it a bit different way. Could you talk about how much performance this year was depressed by lower vaccine uptake, just so we can get a better understanding of how a rebound next year, maybe you could talk about the kind of levels of returns, et cetera. So, I'm not going to help you, Richard, to give 2023 flu guidance quite yet. So I think in flu, what we're seeing in the U.S. is low this year, I would say, but which we expect to increase in the coming years. But again, flu is a progressive uptake year-on-year. You know very well that the current this year is also due to vaccinatorâ\u0080\u0099s fatigue, I would say, following the COVID-19 situation. Again, why I think it's very important is that we have the right assets. You saw the growth of our differentiated flu portfolio, meaning that the impact was much more on the standard flu product. And as you've seen, for example, on recently published results from one of our flu competitors, they had a minus 4% annual flu between 2023 full year and 2022 full year -- 2022, sorry, and 2021 full year. You see that on the contrary, thanks to our portfolio, we have a growth in 2022, showing the strength -- and the strength of our strategy. So, more than 10 years of data Fluzone high dose and experienced commercial organization, we believe we have the right assets. Let's make sure we know a bit more about the season and the completion of the vaccines, in Q1 we will share more. And as you all know, the current flu season, which continues to evolve is very dynamic, and we believe really underscores the importance of getting vaccinated, of course, but also the importance of quick widespread consumer access to medication like Tamiflu. So it is important, not just for Sanofi, but for public health, so we continue. It's growing fast, faster than the market. Exciting things to do, switches, I think, represent over â\u0082¬1 billion in additional sales between them at peak, and it's a fast peak, as you know, in Consumer. Really spending time just making sure we have the best consumer business and so, that you can compare it to others."
}