{
    "symbol": "JAMF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 20:47:07",
    "content": " We are especially proud of Jamf's growth in Q1 since we have now completely lapped the surge in education buy-in that occurred in Q3 and Q4 of 2020, and in Q1 of 2021, where programs like the GIGA project in Japan, drove device growth in the education market, never before seen in a history. To better understand how Jamf's business evolved throughout different stages of the pandemic, I'd like to compare Jamf's Q1 growth rates in education and commercial markets versus the past two years. At the start of the pandemic in Q2 2020, Jamf's first quarter as a public company and prior to the surge in education buy-in, Jamf reported year-over-year ARR growth of 36%, which was comprised of 50% growth in commercial markets and 18% growth in education markets. Over the course of the next three quarters, we've reported that market dynamics had pushed our commercial and education growth rates closer together, culminating in Q1 of 2021 or Jamf's year-over-year commercial ARR growth was 39% and education growth was 33%. For commercial markets, Jamf’s Q1 ARR growth for our Jamf Pro and Jamf now Apple management solutions was over 30% year-over-year in every geography. Today, Jamf is a leading provider in both Apple device management and cross platform mobile security that includes identity-based account management and authentication, next-generation zero trust VPN, prevention of malware phishing and malicious downloads, content built filtering, data capping, compliance and reporting solutions. Of the few companies in the market that offer both Endpoint Management and security, Jamf is the only provider that manages and secures an Apple-first enterprise, which is a critical differentiator since the iPhone is the number one smartphone used in the enterprise, the iPad is the number one enterprise tablet, and the Mac is the fastest-growing computer in the enterprise. Leveraging Apple's latest native technology, Jamf has now delivered a new BYOD solution that strikes the right balance between organizational security and end-user privacy, all for a compelling price point, 85% less than the cost of corporately owned iPhones and iPads. And frequently, what customers will do, because we have such low impact from a performance in experience on the user when we load those solutions on the Matt, that will find that customers will actually just go ahead and install us, of course, using Jamf Pro because they're all using Jamf Pro for the mac, anyway, they'll install us right alongside and run us next and see that we typically will find exploits that other solution providers that aren't built specifically for Apple won't find. I think most organizations don't even know that what we and Apple do together on BYOD devices is even possible, which is a native way of segmenting an iPhone into a personal partition and a work partition and actually giving the management software the ability to natively put apps in the work partition and set up with Jamf’s new private access solution, a per app VPN to make sure that all communications from those apps are secure and the same thing with email."
}