{
    "symbol": "JAMF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:09:02",
    "content": " ARR growth in Q3 was 27% year-over-year to $491 million, we continue to see strong demand for our security products with year-over-year ARR growth of 50%, while growing ARR for our device management products 23% during the same period. Year-over-year ARR growth in commercial markets was 33% and 15% in education markets, maintaining the balance between Jamfâ\u0080\u0099s higher-growth commercial markets, which represents 71% of our business and a healthy education market. Jamfâ\u0080\u0099s business has proven resilient, and we believe we are poised for long-term growth with an expanding addressable market as the consumerization of IT, popularity of remote work and changing workplace demographics continue to drive the popularity of Apple in the enterprise and the need for consumer simple and enterprise secure endpoint technology. Going forward, we believe we will continue to grow market share and deliver strong results due to our diverse business model and four key factors: one, our position as the clear market leader in Apple Enterprise Management and Security; two, continued innovation by both Jamf and Apple; three, the increasing demand for enterprise security solutions; and four, Jamfâ\u0080\u0099s philosophy and proven capability to deliver balanced growth and healthy profitability. Adding a net of 2,000 new active customers in Q3, growing our active installed base to over 69,000 customers running 29.3 million total devices clearly demonstrates that Jamf has become an enterprise standard and one of the most used device management solutions in the world. In Q3, we saw this momentum continue with 18% of our Q3 ARR coming from our security products, resulting in Jamf security business now surpassing $90 million in ARR, which represents 50% organic growth year-over-year. Once again, I mean, the balance of all of our offers together in between our commercial and education, we are quite pleased with, despite the Jamf School reconciliation on devices, we ended up launching Jamf Safe Internet, which I mean, frankly, it doesnâ\u0080\u0099t comprise in that it was the fastest-growing product in the first quarter of our launch in our history with over 200 â\u0080\u0093 outselling both Jamf Connect and Jamf Protect in their first quarters when we launched those, and we thought that they were excellent launches."
}