{
    "symbol": "JAMF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 08:01:42",
    "content": " And Jamf's ARR and education markets grew 16% over the same period, maintaining the balance between Jamf's higher-growth commercial markets, which represents over 70% of our business and a healthy education market. When it comes to Jamf's momentum by product line, we are noticing a strengthening replacement market for Jamf's robust core Apple device management products like Jamf Pro, driven by 2 factors: continued Apple innovation and market consolidation. In Q2, many customers, including a global leader in gene therapy and diagnostics leverage Jamf's brand-new BYOD management pricing to deploy hundreds of BYOD phones along with Jamf private access configured with per app BPS, so that all work done on the BYOD device is automatically protected and encrypted without the user ever having to think about it. Using Jamf and Apple's unique BYOD separation of personal and work data, the customers' employees are able to have a personal iPhone with privacy protection and secure access to everything they need to do their job. Examples from this past year's event, our platform single sign-on for the map, enrollment Single Sign-On to strengthen BYOD solutions, device at a station to make it nearly impossible to impersonate device, strengthening Apple and Jamf security posture. Jamf's commitment to continuing to innovate across our platform and within industry workflows, all while maintaining the pace with Apple innovations provides a compelling value proposition to customers as we continue to drive Apple adoption in the enterprise. In Q1, we discussed Jamf's strong education growth despite a tough comp with the surge in education buying that occurred in late 2020 through Q1 of 2021 or programs like digital pack in Germany and the Giga project in Japan drove device growth never seen before in history. Now in Q2, a quarter that is typically strong for the education market, Jamf's business was aided by a nationwide education program in Taiwan aimed to distribute devices to K-12 students across the country. I mean, as we've mentioned, really over the last year, we were expecting somewhere in between the two to three point drop in net dollar retention when we started to consolidate that with Wandera largely because the historic Jamf gross retention is so high, right, an all-time high because of the historic Wandera selling mostly through carrier channels, just somewhat the nature of that channel does not lend itself as well to gross retention. So we think that there's opportunity for us there, especially as we have bolstered up some of our lower end market solutions like Jamf Fundamentals, where with one simple purchase IT shops can get management identity, security and threat security, all within one simple purchase, all in an e-commerce purchase. Given the macroeconomic uncertainty, we are being pragmatic as we look ahead, while balancing our outlook with strong market demand for our security and our management solutions, we are well positioned to continue to win the trust of organizations by developing innovative solutions that are Apple First and Apple Best, further solidifying Jamf as the provider best suited to power the Apple."
}