{
    "symbol": "JAMF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:55:25",
    "content": " We are pleased to report for the 11th consecutive quarter, Jamf again exceeded expectations in Q4 with year-over-year revenue growth of 26%, resulting in full year 2022 revenue growth of 31%. In 2022, Jamf also achieved the largest year-over-year Mac device growth in our history for the first time achieving a net addition of over 1 million Macs under management in just 1 year. Jamf's product leadership and continued execution helped Jamf surpass the $500 million ARR mark at the end of Q4, now with over $400 million of device management ARR and over $100 million of ARR from our security solutions, a business that has been almost entirely created in the past three years. Additionally, in Q3, we highlighted that muted customer hiring expectations and layoffs resulted in lower device growth at renewal, which continued in Q4, normally Jamf's highest quarter for commercial customer renewals. Although our top 25 customers all grew with Jamf 2022, the rate of device growth has been significantly slowed by changes in the employment market and customer tendency to purchase seats only for their current headcount and not for anticipated growth as we've seen historically. Jamf's collection of security products now constitute over $100 million of our ARR, equaling 49% growth year-over-year. The number of customers running both a Jamf's management and security solutions has grown to over 13,500, which is over 1,000 more customers than just one quarter ago. In Q4, the Jamf team partnered with AWS team to facilitate Allegiant's renewal, growth and cloud migration using annually committed AWS spend, providing financial benefit for our joint customer and significantly streamlining the procurement process. If Mac market share continues to expand as it in 2022, we believe Jamf's leadership position and robust complement of management and security solutions will provide a substantial growth driver long into the future. Considering the size of the mobile market, the strength of Jamf's solution and the disruption in the legacy unified device management market, we are bullish regarding Jamf's long-term growth trajectory as we anticipate more organizations will align their management and security requirements with an Apple-first solution. The final opportunity I'll address is Jamf's combination of our industry-leading management solution with our emerging security products, which we believe uniquely positions Jamf to offer the only complete solution that ensures all work access from both corporate and personal Apple devices is trusted. Yet, as discussed earlier, Jamf's security ARR in Q4 has now reached over $100 million, growing year-over-year at 49%."
}