{
    "symbol": "ARI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 11:58:03",
    "content": " Today’s conference call and webcast may include forward-looking statements and projections, and we ask that you refer to our most recent filings with the SEC for important factors that could cause actual results to differ materially from these statements and projections. In addition, we will be discussing certain non-GAAP measures on this call, which management believes are relevant to assessing the Company’s financial performance. At this time, I’d like to turn the call over to the Company’s Chief Executive Officer, Stuart Rothstein. I am joined today by Scott Weiner, our Chief Investment Officer; and ARI’s new Chief Financial Officer, Anastasia Mironova. Carrying forward the strong momentum from 2021, ARI had an extremely active first quarter of the year, committing $1.8 billion to new commercial real estate loan transactions. The Company’s loan portfolio totaled $8.4 billion at quarter end, representing a 22% year-over-year increase. Most importantly, ARI’s portfolio produced another quarter of distributable earnings that covered the $0.35 per share common stock dividend. And we believe the combination of the first quarter strong deployment, coupled with an active pipeline, well positions ARI to continue to generate distributable earnings that will cover the dividend for the remainder of the year. Not surprisingly, there’s increasing focus and dialogue around the impact of inflation, rising rates, and the ability of the Fed to engineer a soft landing and avoid a recession. Our access to real-time data and information from all areas of Apollo’s integrated global investment management platform provides us with meaningful information and insight, which enhances our underwriting and analysis and enables us to thoughtfully think through appropriately pricing risk-adjusted returns in a fast-changing environment. While we believe ARI’s basis is protected by expected sales on a nominal basis, accounting principles and guidance require that we determine present value of future cash flows in assessing recoverability and as such, ARI recorded a $30 million reserve. Finally, we are excited to welcome Anastasia as ARI’s new CFO. Look, I think the expectation -- I think we’ve been signaling this for quite some time. But I think, we are weeks away from restructuring the financing in such a way that the project is absolutely fully capitalized to get to the finish line in terms of construction and also give some runway in terms of sales activity. There’s clearly strong progress in getting to the finish line, first and foremost, in terms of the amenity package, which we think is critical to sales momentum at the asset, and then finishing construction throughout the asset. And then, lastly, there’s definitely been legitimate interest on units in the last few weeks that we believe will result in contracts getting signed, though nothing’s been publicly announced yet on that front. And I guess, the last thing I’d say, Doug, is that from a pricing perspective, in terms of discussions around actual units that I believe will lead to contracts. Stuart, we’re obviously all sitting here thinking about rates, hopefully some people at the Fed are too. But thinking ahead a year 250, 300 basis points higher, just we haven’t had this -- have this conversation in the last several years. On the cap side of things, it is, I would say in the preponderance of transactions, we’re forcing people to buy out of the money caps that provide some protection in terms of excessive rate movements. I think the harder part from an underwriting perspective, and certainly not anything we shy away from, because it’s part of what we do, but it’s really trying to figure out the interplay between rate movement, cap rate, exit values, et cetera, and trying to look through -- one of the big debates inside our shop, and probably not different than a lot of other shops is, are rate movements a one to two year phenomenon? But there’s definitely, I would say, a real emphasis these days, not that there isn’t at all times on various scenarios, and what our path to exit is in various situations. And if anything, making sure things are capitalized to be carried for some time, to the extent there’s continued choppiness in the capital markets. Of course, you’ve got to look at the macro, both not only in the U.S., but the UK and Europe as well with your broader lending markets? Last Friday, CMA ran up a piece about your Brooklyn project, the Brook,  suggesting that you’ve reached the point in the planning to hire WD to look for a construction loan. I think if you talk to people in and around the real estate business, particularly those New York and Florida focused. Witkoff’s got an excellent reputation on the construction side, have done quite a number of high-end projects successfully. And I would say, there’s a lot of confidence in terms of what they bring to the table from a development partner. Timing wise, we’re at the point where we could start doing foundation work, you’re looking at a two year build roughly, it’s a pretty significant it’s a 50-storey tower, plus or minus a floor or two. And I would say the -- that based on the discussions around financing, partnering with Witkoff has proven to be a good strategy. So, I’m sitting looking at the interest rate sensitivity chart or table in the 10-Q and it talks about a hypothetical 50 basis-point immediate shift. Basically, since March 31st, we’ve covered about 75% of that ground in a month. I think the best place to look at it, to be honest with you, Rick, is we put a pretty good chart, I think in our supplemental, which basically goes from a 50 basis-point move out to a 200 basis-point move. I would say, high level, the way to think about it is in terms of U.S. dollar sort of contracts, right? So, moving to the -- from the LIBOR to the SOFR world, I think you start seeing us become positively correlated with interest rates when you cross a roughly 1% sort of move. And then, I would say, in Europe, it’s actually a little lower. And then, once you become positively correlated, should we think about it that the beta on an ROE basis is about 0.6, given the leverage, so that for every 100 basis points of increase in LIBOR, we would expect about a 60 basis-point pickup in ROE? We’re typically financing things with 2 turns of leverage at this point, some at 60% LTV, some at 70% LTV. On the one hand, I would say, transaction volumes in the first quarter surged, up 56%, but that was pretty much all driven by average deal price. And I think, the one thing I’d say with respect to first quarter numbers, I always view first quarter numbers as really finishing a lot of year-end prior year business. So, I think you came into the year with a lot of momentum, because things were still humming along in the fourth quarter of last year, there were still a lot of deal activity. And I think a lot of what you saw in the early part of this year was just getting to the finish line on things that were done or agreed to, at the end of 2021. I look at it from both, what we’re seeing on the credit side, but then I also obviously spend a lot of time in dialogue with the folks at Apollo on the real estate equity side, and there’s still a lot of activity going on, a lot of deals to pursue. I think to the extent on prior earnings calls, I’ve made the comment that the world favors borrowers. I would say, there’s still plenty of options for borrowers these days. I think, there’s definitely a somewhat of a slowdown in the securitized markets. And I think when you put that all together, it indicates a modest slowing in pace, but still something that I would define as a healthy market and that there’s borrowers looking to do things, equity capital, looking to buy things, and lenders willing to participate in market. Let’s keep in mind, these borrowers, these sponsors are already looking at non-banks as their primary or one of their primary avenues of capital. So, perhaps they may be less rate sensitive as they’re looking at real value add strategies. So, there’s positive leverage, generally speaking, despite a gapping out in the cost of credit. I would say, we haven’t seen a gapping out yet. So, I would say, still within the sensitivity ranges as most people think about the cost of leverage and what’s achievable. And I think to be honest with you, as we think about it, it’s arguably less relevant on sort of the cost of getting something done and probably more relevant as people think about what continued rate rises mean for economic impact on lease-up, sell-through, et cetera, whatever the business plan actually is, and then ultimate exit value on the real estate to the extent we’re in an elevated rate environment for some time. So, I would say, people definitely sensitize it, but I would say we’re not yet at the level, at least from our perspective, where we’re seeing it dramatically impact business plan. In the sense that I think people are still confident in their business plans, they sensitize rates, and they’re still generally moving forward with their equity investment strategy. In terms of New York overall, I’m not sure if at the outset you made a comment as to your market view, just getting some investor questions recently. So, 1740 Broadway, there was a large loan default and a large asset that got people’s attention. Clearly, there’s a lot of debate about Midtown office and Class B, Class C office in New York City. And I think there’s not one answer that fits all of it, I’d say, specifically with a couple of things that you’ve touched on. I think what we’re seeing on the office side, at least in the exposures in our portfolio and sort of what we’re hearing anecdotally is that there’s a clear sort of separation between recently created whether developed, renovated, remodeled office space and older more commoditized space, I can tell you that in two transactions we’re involved in, rent levels on new leases have exceeded what was underwritten. And my expectation is that we’re probably likely to get refinanced out on a couple of our more significant office projects in New York, which are secured by newly created space. I think on the commoditized or as you said, B or C quality space, I think there’s actually a dearth of interest, lack of activity. So I think, there’s a real bifurcation on the office side. I would say, on the condo side, the market’s been extremely strong for the last, whatever it’s been, 15 to 18 months coming out of the pandemic. And then, I think the last asset class that we spent a lot of time thinking about, you didn’t ask about it, but I’ll comment on it anyway, is on the hospitality side. Clear Omicron impact in January and February, but a, I would say, better than expected pickup in March and April, and forward bookings for the spring are looking pretty strong, which hopefully is an indicator that absent anything unforeseen from a pandemic side or to your point, geopolitically, it seems like from a tourism perspective, and what that means for hospitality is trending in a fairly positive direction. So, it’s definitely mixed in New York, but I would say there’s clearly things that are doing well. I know asked about this last quarter, but maybe you’re able to leverage the Apollo platform, and you’ve got some exposure in Europe, and it’s provided a lot of growth. I mean, I think at a high level, it still continues to be an attractive environment from a lender’s perspective. So, there’s a lot to like about Europe. And it is again -- my team in London doesn’t appreciate this when I say it, but it’s competitive. So, I think our team on the ground there has done a fantastic job in building their presence, becoming a leading lender in the market, having great relationships with borrowers and just continuing to generate interesting opportunities. I think the flip side to that is that I would say, the European economy has its challenges as well. If anything, as we talk broadly inside Apollo, not that we spend a lot of time trying to make macroeconomic predictions, but to the extent there are those inside the firm who think about those things, I would say, Europe is probably slightly more at risk for a recession than the U.S. is. So, it’s been a positive 12 to 18 months in Europe from our business perspective. We think we’ll still see really interesting opportunities, just given the strength of our team over there. But I would say, more focus in terms of stressing deals and thinking through economic uncertainty as we debate whether or not we can get comfortable with something from a credit perspective. We’ve typically been running just short of as best we can vis-à-vis efficiency and both, money going out and money coming in. But remember, we’ve got $1.6 billion of unencumbered assets on the books, which are always available to the extent we need to address any liquidity concerns. We think we’re sort of on a debt yield perspective, lending it sort of low-double-digit returns, if you think about where cap rates would need to go for us not to be protected. And then, we typically don’t disclose specific yields on the deals, but it’s sort of consistent with what we’ve done in Europe broadly, which is sort of a floater plus ballpark, 300, 400 basis points and then we lever into a low-double-digit ROE from our capitals perspective. So, with that, I’ll turn the call back over to CEO, Stuart Rothstein, for any closing remarks. Ladies and gentlemen, this concludes today’s conference call."
}