{
    "symbol": "ARI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 14:06:04",
    "content": " Importantly for ARI, given the robust level of loans originated over the past two years, ARI's portfolio remains well-positioned to continue generating distributable earnings in excess of the common stock dividend, while taking a measured and opportunistic approach with respect to new capital deployment. Shifting to the portfolio at year-end ARI had 61 loans totaling $8.7 billion, near quarter end, we sold the properties underlying ARI's Miami Design District loan to a sponsorship group, with significant experience in the neighborhood, which freed up approximately $180 million of capital. Before I turn the call over to Anastasia, it is worth highlighting that ARI is current quarterly dividend run rate of $0.35 per share, the company is paying common stockholders roughly a 12% annualized yield, coming off a quarter in which ARI earned $0.48 per share while trading at approximately 75% of book value, with earnings supported by a portfolio consisting of 98% floating rate predominantly senior loans. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. I think on some of the other repayment activity that you mentioned, I would say, generally speaking, sitting here today, based on our dialogue with the relevant borrowers/sponsors, I would say there seems to be a reasonable path towards full or partial repayment in those situations, and obviously, a partial repayment will be some sort of conceptual discussion around incremental time for something that allows us to get to a basis level where we're comfortable remaining in the transaction that included the Chicago office assets that you referenced. One moment for our next question. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. I mean the way we think about it Jade, if you look at the senior loan and the senior mezz position, net of sort of what's taken place to date already, you're talking about from a our eyes perspective, you're talking about $430 million of basis, if you think about the fact that we actually have a partner in the senior loan with another financial institution, you're talking about $570 million of value in the remaining units to get those two pieces fully paid off."
}