{
    "symbol": "LSI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 13:45:19",
    "content": " Following our discussion of our fourth quarter and full year 2020  results and financial outlook, I'll spend some time walking you through the presentation we filed with the SEC this morning and the rationale behind our Board's unanimous decision to reject Public Storage's unsolicited acquisition proposal. The net effect of same-store revenue and expense performance was a 100-basis-point expansion in quarterly net operating income margin to 73.7%, resulting in 13.3% year-over-year growth in same-store NOI for the fourth quarter. Over the next several slides, I will walk you through the key elements of the Board's decision, including Life Storage's significant outperformance over the past several years and the reasons we believe we are positioned to extend our industry-leading track record. Public Storage's proposal which was made during the quiet period before we announced our '22 results and outlook through 2024, does not account for our company's strong future growth prospects. We anticipate a significant improvement in our multiple as the markets better understand the superior growth Life Storage is poised to deliver over the next 2 years. We anticipate a significant improvement in our multiple as the markets better understand the superior growth Life Storage is poised to deliver over the next 2 years. Among other things, the Board considered whether Life Storage is better positioned to deliver growth and value stand-alone or with Public Storage's proposals. In reaching this conclusion, the Board considered a number of factors I reviewed today, our robust growth pipeline, our track record of delivering higher-than-expected total shareholder returns and driving leading revenue, NOI and FFO growth rates and our strong margin improvement. It's a couple of different things from different factors, the growth of our same-store pool, the strong performance of our acquisitions, $5.5 billion of wholly owned and JV over the last few years, growth of 3PM and JVs and contribution from our lease-ups."
}