{
    "symbol": "CROX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 11:42:10",
    "content": " On a constant currency basis, Crocs brand grew 22% including strong DTC growth of 20% and digital growth of 23%. Crocs brand DTC revenues, which includes revenues from e-commerce and company-owned retail stores, grew by 20% on a constant currency basis over 2021. First quarter consolidated revenues were $660 million, a growth rate of 43.5% over last year, comprised of $545 million from the Crocs brand or 18.5% growth and $115 million from the HEYDUDE brand following the acquisition close on February 17. During the first quarter for the Crocs brand, we sold 25.6 million pairs of shoes, which slightly declined by 1.1% over last year. The Crocs brand average selling price during Q1 was $21.10, a year-over-year increase of 19.6% driven by price increases, reduced promotions and discounting and incremental Jibbitz penetration. Let's review a few Crocs brand highlights by region, beginning with North America where Q1 revenues increased 19.5% to $319 million to prior year, driven by higher prices and strong sell-throughs. DTC revenues increased 18.5% on top of an exceptional 131.3% growth last year, and clearly signaled the strength of the Crocs brand in North America. The Crocs brand in Asia generated revenues of $96 million or 22.1% growth on a constant currency basis driven by higher pricing, less discounting and greater wholesale volume. Crocs brand revenues for EMEALA, our new combined EMEA and Latin American regions, grew 26.8% on a constant currency basis to $130 million, even as we paused Russia operations. Importantly, adjusted gross margin for the Crocs brand was 54.9%, only 30 basis points lower than last year even with 650 basis points of incremental freight and 50 basis points of unfavorable purchasing power as higher prices and fewer promotions almost entirely offset these significant headwinds. During the first quarter of 2022, consolidated SG&A improved 60 basis points to 27.3% of revenues versus 27.9% in last year's first quarter. Our first quarter consolidated adjusted operating income of $175 million increased 39.6% from $126 million last year, including $16 million attributable to HEYDUDE. For Q2 2022, we expect consolidated revenues to be between $918 million and $957 million, representing 43% to 49% growth from prior year. We expect Crocs brand revenues to grow approximately 17% to 20% growth in constant currency, which is 12% to 15% at current currency rates. Excluding currency and the pause of Russia, Crocs brand growth would be approximately 20% to 23%, which is above full year guidance. So just to reiterate our guidance, we're very confident in our full year guidance, which is both the 20% plus in Crocs brand and the upward revision of the HEYDUDE brand, which carries best-in-class operating margins for the combination. Our full year 20% guide for the Crocs brand and 840 to 890 for the HEYDUDE brand is based on really the continued strong pre-books that we see for both brands, innovation pipeline, brand resonance and just performance we're seeing overall globally."
}