{
    "symbol": "CROX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:18:20",
    "content": " The Crocs Brand had another great quarter growing 19% constant currency, negatively impacted by Russia and the China COVID lockdown, which offset approximately three percentage points of growth. In the context of a flat to down market during the first half constant currency revenues for the Crocs Brand grew by 20%, and consolidated revenues grew by 52% driven by the acquisition of HEYDUDE. For 2022, we expect Crocs Brand revenues to grow approximately 14% to 17% constant currency or 10% to 13%, including the negative impact of currency of approximately 400 basis points. As you have already heard, both brands performed well during the second quarter, amid many headwinds, we delivered strong revenue growth of 19.4% within the Crocs Brand taking our first half revenue growth to 20.3%. The Crocs Brand average selling price during Q2 was $22.39, a year-over-year increase of 2.5% driven primarily by higher pricing and product mix offset in part by channel mix and currency. Crocs Brand revenues for EMEALA grew 48.4% to $160 million, growth was particularly strong in the UK, Germany and with our distributor partners. Consolidated adjusted gross margins for the second quarter were down 660 basis points from last year to 55.2% due to increased air freight and logistics costs, the addition of HEYDUDE, channel mix and currency. At a brand level adjusted gross margin for the Crocs Brand was 57.9% down 390 basis points driven primarily by freight headwinds of 445 basis points, including a 340 basis point impact of incremental air freight and 105 basis points of currency, somewhat offset by increased prices and product mix. Given those dynamics for 2022, we are lowering the Crocs Brand revenue guidance to be approximately $2.6 billion representing year-over-year growth of between 14% and 17% on a constant currency basis and 10% and 13% on a reported basis. So, it is easy to kind of pull back a little bit and still invest in marketing, which we are still planning on doing at the same rate as we were previously, which is for the Crocs Brand approximately 8% to the year."
}