{
    "symbol": "WMC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 14:41:05",
    "content": " As you may recall, we announced last December, our plan to focus on residential real estate related investments and to transition out of the commercial investments in our portfolio. During the first quarter, we continue to implement this strategic portfolio shift while working proactively to strengthen our balance sheet. As we discussed on last quarter's call, we saw the unencumbered hotel property that we foreclosed on in 2021 and received $36 million in net proceeds, while recording an $8.7 million gain on the sale of the property. In February, we completed our third securitization of approximately $400 million backed by $432 million of residential home loans. This securitization enabled us to secure long-term fixed rate financing at a weighted average interest rate of 3.1%, which review at a favorable level, given the rising interest rate environment. However, the quarter was not without its challenges, in particular, the rapid rise in interest rates and concurrent spread widening across all fixed income sectors. We had previously expected that transitioning and repositioning our portfolio could create timing issues that would impact our near-term earnings power and this was the case again, in the first quarter. Consequently, our distributable earnings were $379,000 or $0.01 per share in the first quarter, down $529,000 from the fourth quarter. While the first quarter was no doubt, a difficult one, we are confident that we are taking the right steps to resolve our challenged investments, strengthen our balance sheet and improve the earnings power of the portfolio. As Bonnie noted, we are active again this quarter and repositioning the portfolio, adding both non-qualified residential mortgages and securities to our holdings that spreads widen. In February, we successfully executed our third residential home loan securitization, continuing our strategy of securing permanent financing on our non-QM holdings. During the first quarter, we acquired $117 million worth of newly originated non-QM loans. The speed, the transition of our portfolio, in addition to purchasing loans, we added $40 million in non-QM RMBS securities. Especially at these wider spreads, our residential investments continue to present attractive fundamental value, benefiting from the strong housing market, low unemployment levels and solid consumer balance sheets. While we expect home price appreciation to moderate from a very strong recent performance, we believe the housing market will remain well supported given the favorable supply and demand dynamics as well as discipline lender, underwriting standards. During much of the quarter, rates on non-QM mortgage loans lagged the rise in conventional mortgage rates and many non-QM borrowers were able to refinance at relatively attractive rates. During the first quarter, spread generally widened across the commercial mortgage credit sector, but our commercial holdings in aggregate were only modestly impacted by the market move. At quarter end, we held seven commercial whole loans at a fair value of $128 million, all but one of these loans have performed in line with expectations. The six performing loans represent a $102 million of principle balance and are currently marked at $101 million, a negligible discount to cost. Given the ongoing uncertainty regarding possible outcomes, our loan is currently a market value of $27 million down slightly from the fourth quarter, primarily due to changes in the assumptions around the estimated timing of resolution to the situation. Within non-agency commercial mortgage backed securities, our single asset, single borrower credit portfolio is valued at $83.4 million down slightly from the prior quarter. Our CMBS conduit exposure is valued at $22 million up slightly from the prior quarter and while credit trends are improving on some loans, others remain challenged. As a result, we placed two investments on non-accrual status during the first quarter, as the operating performance of the underlying properties is taking longer than anticipated to recover. We did not exit any CMBS positions during the first quarter, but will continue to evaluate potential sales of our investments in this space with the view to be deploying proceeds from the sales and payoffs and into new target assets that offer attractive risk adjusted returns. Before reviewing our first quarter results, I want to highlight some of the measures we have recently taken to further improve our balance sheet. WMC continues to benefit from the support of the broader Western asset platform, facilitating our ability to work with our strategic financing partners to improve liquidity and secure attractive, longer term financing. In February as previously noted, we completed our third securitization of non-QM loans, which provided long-term fixed rate financing for $432 million of loans, previous financed under a residential whole loan facility. We also repurchase an additional $3.4 million of our existing 6.75% convertible senior notes due October 01, 2022 at a weighted average premium to par of approximately 0.8%. At quarter end, we had a remaining outstanding balance of $34.3 million on the 2022 notes. We believe we have ample liquidity to continue repurchasing and retiring the 2022 notes prior to their maturity, provided accretive repurchase opportunity to exist over the next six months and then address remaining bonds at maturity. Now turning to our financial results, we have provided great detail regarding our portfolio and our first quarter results in our press release and our earnings presentation. We reported distributable earnings of $379,000 or $0.01 per share for the first quarter, down from fourth quarter's level of $908,000. First we recorded approximately $350,000 lower net interest income on our non-agency CMBS portfolio, primarily due to an accounting change of two distressed conduit bonds that were put on non-accrual during the quarter. Second, we experienced an elevated level of prepayments in our residential whole loan portfolio in the first quarter. There were $95.6 million of loan pay downs during the quarter, which led to no lower net interest income of approximately $268,000. In addition, the pay downs resulted in $2.5 million of premium amortization, which was similar to last quarter's amortization on roughly the same level of prepayments. Third, we experienced higher professional fees of $230,000 as a result of higher accounting, internal audit and external audit fees related to our year-end reporting. These items were partially offset by $368,000 in lower management fees as the 25% reduction in fees paid to our manager, went into effect in January. While a disable earnings for the first quarter were lower than our dividend of $0.04 per share, it's important to note that we evaluate the level of the dividend every quarter, based on several factors. The decline was driven mainly by spread widening across our holdings, mainly from our residential whole loans due to their relative size in the overall portfolio. This was partially offset by consolidated realized gains of $12.1 million or $0.20 per share from the sale of the hotel, as well as $6.9 million or $0.11 per share of gains on our derivative due to interest rate hedging activity during the quarter. Economic book value, which reflects the value of the retained interest in the consolidated securitization trust rather than the associated growth assets and liabilities decreased by 7.3% for the quarter to $2.81 per share. Turning to leverage, our recourse leverage ratio at quarter end was 2.8 times, down from 3.8 times at December 31, 2021. In summary, we remain focused on actions that will solidify our capital structure and maintain our liquidity while positioning WMC to benefit from improving economic conditions and the ongoing recovery of certain commercial real estate sectors that were most impacted by the pandemic. With a significant portion of our assets now financed by attractive longer term financing, we feel that we are well-positioned to continue to grow our portfolio through select investment opportunities with the objective of improved financial results in the quarters ahead. I guess one, could you address that and if there was any impact that we should expect to see in terms of a drag on margin going forward, and then if you could sort of bifurcate that and say on a go-forward basis based on new loan yields, what you expect margin on the residential side to be that would be helpful. But, I think it's something that given our already outside exposure, we would obviously need very significant support from the investment committee to make any additional investment. In terms of the cash flow performance, obviously there's continued, as we mentioned -- there's continued, increase, but in terms of what the final long term run rate for the property will look like that's still, highly variable at this point. So we haven't re-struck the LTV at this point, but obviously we're looking for a finalized structure that gives the property enough time to fully recover as well as giving it the ability to refinance. Another question on the non-QM strategy can you talk about what you guys are seeing in terms of, supply of loans coming out from originators given how much rates have moved back up and then in terms of the prepayment speed on the existing portfolio, you mentioned that you expect that to decline. I think it's going to be a shift in the market where we'll see more originators focusing in non-QM as agency prepays, that agency sorry, refinance opportunity decline. Like I said, if agencies down 20% and given the time to originate a new non-QM loan is, maybe 30 days to 45 days versus a couple weeks for an agency, we should see the clients happen pretty soon. So, obviously mindful of staying liquid, staying higher in the capital structure and we do see attractive lever returns on those assets, but, I still think our goal is still to have long-term financing via securitization. Now with the current price of the stock, if trends continue, it's getting to the area of de-risk and what would be -- do you see Western Asset stepping in as the manager and supporting the company if the company continues training towards this level of reverse split doesn't happen. They do believe in the fundamental value of WMC and as we know, while they did grant the management waiver for 2022, and we will expect that they will continue to lend their full managerial support to the entity."
}