{
    "symbol": "ATUS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 01:39:02",
    "content": " 04:17 Given the progress we're making on our growth initiatives, we are confident that we will return to broadband customer growth in the second half of this year with our accelerated fiber rollout, multi-gig services and new-build activity, complemented by more attractive mobile bundles and expanded sales distribution channels. We are on track to bring 100% fiber broadband delivering multi-gig speeds to more than two-thirds of our entire footprint over the next four years, reaching a total of 6.5 million FTTH passings by the end of 2025. You can see our adjusted EBITDA margin was 40.9% in Q1, which is just over 2 percentage points below the prior year quarter, reflecting higher operating costs to invest in some of the areas we've outlined to drive better customer growth and higher medium to long-term revenue and cash flow growth. We had a nice promotion that will end here in the middle of May on one gig, that was very successful and we're seeing a good transformation we believe in terms of being able to upsell those, the one gig product is something more and we'll be thoughtful about our packaging and offers going forward, but we're very focused on it, and it will be part, obviously, about our whole rebranding reconnecting campaign throughout the year where we will come up with some -- with various types of marketing efforts around the mobile product. I think, today we're charging $25 for three gigs if it's not connected to your mobile and then depending -- not connected to your fixed line subscription and then you get a discount on your mobile and your fixed depending on what type of speed you're taking on your fixed line side. I think we would clearly reserve a pocket of $25 million to $50 million of additional OpEx if we think that was useful for our growth initiatives, particularly as we're looking to accelerate and do more fiber and new build than what we had budgeted to do back in November. And then it's really about how much we're spending on any extensions of the network, which have been averaging about a couple of hundred million going up to about $300 million this year given the acceleration we're doing in terms of edge-outs."
}