{
    "symbol": "QRVO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-02 21:28:02",
    "content": " Lastly, because Qorvo’s smartphone portfolio includes cellular RF, ATP mix, Wi-Fi in emerging categories like ultra wideband and MEMS based sensors, Qorvo can participate broadly across OEMs, product tiers and chipset providers. Qorvo’s revenue for the fiscal year 2022 third quarter was $1.114 billion, $9 million above the midpoint of our guidance. Cash flow from operations in the third quarter was at $117 million, reflecting payments associated with the long-term supply agreement discussed on last quarter’s call. As mentioned last quarter, looking at the business by end market highlights Qorvo’s growth potential over the next several years. So yes, looking forward, we’re really pleased with the 606 launch and a lot of content that we talked about last quarter beginning across integrated modules and tenant control, but also, of course, UWB. It’s elevated for a number of reasons, including build heads for ramps that you’re seeing now and sustained volumes and flagship and also content gains in flagship and mass tier and the increases in IDP and there are other demand factors such as supply/demand alignment in China as some share shifts there. What do you – given that one quarter with the burn rates going on, what you see now when do you think you’ll get more back to a normal inventory level and your shipments into China will start reflecting really sellout versus what we’ve seen so far, which is just we will take everything they can get. And I think you’ll see us kind of starting out in flagship and expanding towards – excuse me, starting out in more mass here and expanding towards flagship as the year progresses with heavy BAW content but also – the power management aspect is also very, very significant and antenna tuning, which we’ve always been quite strong that will continue to be strong and then Wi-Fi, as we’ve been mentioning, the chip-on-board trend."
}