{
    "symbol": "SSKN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 18:56:16",
    "content": " Second quarter revenue was $9.1 million reflecting a 23% year-over-year growth and included a $1 million, one-time capital equipment sale in China. Excluding the contribution from the equipment sale in China, our results were driven by a continued focus on strong commercial execution, expanded usage among existing XTRAC users, particularly our high volume customers, increased KOL engagement and support for STRATAâ\u0080\u0099s product portfolio through advocacy and at industry events and continue direct to dermatologist marketing. As an update on the commercial strategies that we first outlined in 2021, we continued our focus on high volume accounts or customers that produce more than 40,000 in revenue per year, which yielded further improvement in the second quarter. Revenues for the second quarter of 2022 were $9.1 million, a 23% increase over the second quarter of 2021. Equipment revenues for the second quarter were 3.5 million, an 83% increase as compared to $1.9 million for the second quarter of 2021. As Bob noted, our Q2 revenue, this quarter concluded a one-time capital equipment sale in China of approximately $1 million and reflects our previously communicated strategy to focus more on equipment sales internationally. Non-GAAP gross domestic recurring billings was $6 million, a 9% increase as compared to $5.5 million in the second quarter of 2021. Looking ahead, we continue to expect to seek gross margin improvement throughout the remainder of 2022, returning to historical levels in the mid-sixties, with some quarterly fluctuation based on mix between recurring revenues from system placements and equipment sales. Net loss for the second quarter of 2022 was $1.9 million or a loss of $0.05 per basic and diluted common share, as compared to net earnings for the second quarter of 2021 of $1.1 million or earnings of $0.03 per basic and diluted common share."
}