{
    "symbol": "LSAK",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-08 12:13:06",
    "content": " And also, in terms of the growth in our credit offering to MSMEs, including Capital Connect and Kazang Pay Advance, where we've advanced ZAR22 million this quarter, an increase of 16%, compared to a quarter ago being FY â\u0080\u009823 Q1. The Consumer division delivered segment adjusted EBITDA of ZAR10.1 million for Q2 FY 2023, compared to a segment adjusted EBITDA loss of ZAR23.9 million for Q1 FY 2023. Focusing on our Q2 FY â\u0080\u009823 performance in the Merchant division, as Chris has mentioned, the Merchant division outperformed expectations and guidance this quarter, driven largely by a very strong performance of the Connect Group of businesses. We have achieved growth across all products with standout performances in our Kazang VAS and Kazang Pay business units, as well as notable performance in both Merchant credit businesses, Capital Connect and Kazang Pay Advance. In our card acquiring businesses, Card Connect and Kazang Pay throughput for the quarter of ZAR3.1 billion is, up 106% year-on-year and up 35% for Q2 on Q1 for FY â\u0080\u009823. Additionally, Q2 20 23, similarly to Q1 2023, includes pre-existing Lesaka and Connect Group for the full quarter, compared to Q2 20 22 that only includes a pre-existing Lesaka business. Revenue increased by 11% from ZAR2.1 billion in fiscal Q1 2023.We delivered a group adjusted EBITDA of ZAR130 million, compared to the group adjusted EBITDA loss of ZAR84 million in Q2, 2022 and an EBITDA profit of ZAR72 million in Q1 2023. This is an 81% improvement in EBITDA from Q1 2023 to Q2 2023, validating the transformation of the Consumer division to a segment adjusted EBITDA profit and continued strong growth and robustness in our Merchant division. Consolidated revenue for the quarter was ZAR2.4 billion, 11% growth, compared to Q1 2023 attributed to a strong performance across the merchant business especially in the VES, card acquiring and merchant capital products as highlighted earlier by Steve. We achieved a group adjusted EBITDA of ZAR130 million, as compared to ZAR72 million in Q1 2023, an uplift of 81% quarter-on-quarter. The Merchant division, including Connect Group, continues its strong performance trajectory and achieved a revenue of ZAR2.1 billion in the segment adjusted EBITDA of ZAR160 million. Including the cost savings realized from the rightsizing consumer division, we delivered a segment adjusted EBITDA of ZAR10 million in the quarter, as compared to a segment adjusted EBITDA loss of ZAR24 million in Q1 2023. We have turned around the group performance from an adjusted EBITDA loss of ZAR84 million in Q2 2022 to an adjusted EBITDA profit ZAR130 million in the current quarter, a ZAR215 million turnaround over 12-months."
}