{
    "symbol": "DOOR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 03:04:08",
    "content": " Starting on page four, I'm pleased to report that Masonite continued to deliver strong year-over-year growth in the third quarter with net sales up 12% and adjusted EBITDA up 7%. Net sales for the segment grew 19% year-over-year, and adjusted EBITDA grew 26% due to a disciplined focus on price and cost management and strong execution of our Doors That Do More strategy. Gross profit increased 8.5% in the quarter to $167 million, while gross margin decreased 60 basis points year-over-year to 23% due primarily to the effects of inflation and the volume deleveraging impact on factory costs in the Europe and Architectural segments. Net income was $57 million in the quarter, an increase of $19 million in the prior year, driven primarily by higher gross profit as well as the absence of debt extinguishment and restructuring costs incurred in the third quarter of 2021, partially offset by the increase in SG&A and higher income tax expense. Adjusted earnings per share were $2.53, up 27% compared to $1.99 realized in the third quarter of 2021, which excluded $14 million in charges related to the extinguishment of debt, $1 million in restructuring costs and $4 million of positive impact from income tax adjustments related to the exclusions. Adjusted EBITDA in the North American Residential segment was $115 million in the third quarter, up 26% from the same period last year, with an adjusted EBITDA margin of 19.9%, up 120 basis points on strong execution and price cost discipline. Adjusted EBITDA dropped to $4 million in the third quarter, and adjusted EBITDA margin contracted to 5.9% with approximately 2/3 of the decrease due to deleveraging and 1/3 caused by energy inflation. Adjusted EBITDA is up 12% year-to-date despite significant inflation with strength in our core North American Residential business, partially offset by slower-than-expected recovery in the Architectural segment and volume and energy cost headwinds in Europe. And we also had circa $1 million of higher cost in electricity utilities, which is in line with the broader energy inflation that the European market is seeing and certainly we're experiencing in the U.K. and Ireland, which is really where our business there is focused. So, between the stabilizing of the headcount there, reducing the workforce, the actions that, that team has put in place and the fact that there are some price caps being put in place on energy in the U.K. that we think stabilize and likely reduce our utilities cost in the fourth quarter as opposed to the third quarter, that's what informed my comment a moment ago about returning that business to double-digit EBITDA margins, we believe, by the fourth quarter."
}