{
    "symbol": "DOOR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 00:18:06",
    "content": " We plan to continue adding equipment and expanding operations in the Fort Mill plant throughout the second half of this year and into 2023 with the objective of making it our most efficient doors than we plant in the U.S. Over in England, our team fully completed transition of production to the new Stoke-on-Trent site in the second quarter. Gross profit increased 9% in the quarter to $179 million while gross margin decreased 120 basis points year-over-year to 23.6%, due primarily to the impact of inflation and the volume deleveraging impact on factory and distribution costs in the Europe and Architectural segments. Net income was $59 million in the quarter, an increase of $23 million from the prior year, driven primarily by higher gross profit as well as the absence of restructuring charges, asset impairments, and a loss on the disposal of our Czech business in the second quarter of 2021, partially offset by an increase in SG&A and income tax expense. Adjusted earnings per share were also $2.58, up 16% compared to the $2.23 realized in the second quarter of 2021 which excluded $18 million in charges related to the restructuring and disposal impact I just noted. Adjusted EBITDA in the North American Residential segment was $125 million in the second quarter, up 25% from the same period last year with an adjusted EBITDA margin of 20.6%, up 30 basis points on solid execution. Based on our strong year-to-date performance and further price/cost actions that were implemented in the second quarter, we remain confident in our ability to meet or exceed our net sales and adjusted EBITDA outlook for 2022. Given how your price mix has kind of trended in the first half of the year, it would seem like unless there is a significant drop-off in your year-over-year price gains, particularly for North America in the back half, we're kind of modeling and I know you don't want to get that granular, but just obviously with what you did in the first half around 18% contribution on average, 18%, 19% actually, if you're continuing in the mid-teens at least."
}