{
    "symbol": "NSPR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 14:50:30",
    "content": "  Operator: Good morning, and welcome to the InspireMD Second Quarter 2022 Earnings Call. Joining us today from InspireMD are Marvin Slosman, Chief Executive Officer; and Craig Shore, Chief Financial Officer. During this call, management will be making forward-looking statements, not historical facts, and are based upon management's current expectations, beliefs and projections, many of which, by their nature, are inherently uncertain. More information about these risks, please refer to the risk factors described in InspireMD's most recently filed periodic reports on Form 10-K and Form 10-Q filed with the U.S. Securities and Exchange Commission, and InspireMD's press release that accompanies this call, particularly the cautionary statements made in it. The call contains time-sensitive information that is accurate only as of today, August 9, 2022. Except as required by law, InspireMD disclaims any obligations to publicly update or revise any information to reflect events or circumstances that occur after this call. During the second quarter, we continued to successfully execute on our mission to establish a new paradigm in standard of care for carotid artery disease treatment and stroke prevention. The clear highlight was revenue totaling $1.5 million, which represents a growth of nearly 48% as compared to the second quarter of last year. When you ignore the strengthening of the U.S. dollar versus the euro of approximately 12%, our volume of units sold actually increased by 60%, which represented 2,602 units sold this quarter versus 1,623 in Q2 of 2021 and 1,910 units sold last quarter. This market penetration is also reflective of our market share growth, which is now greater than 20% in over half of our markets with some territories up to 60%. These measurements of business acceleration create tremendous momentum to the runway in front of us, and we continue to innovate and drive an endovascular shift to open surgery with the best performing carotid stent in the market. With data out to five years reflecting consistent clinical outcomes, CGuard continues to demonstrate unmatched short- and long-term performance. So there remains a significant percentage of carotid procedures that we believe can be converted from surgical to endovascular treatment and with a large and growing body of clinical evidence demonstrating the superiority of CGuard relative to competing therapies and stent alternatives, we look forward to leading this conversion. Therefore, our strategy remains consistent, which is to focus on all specialists treating carotid artery disease to both convert open surgery as well as promote CGuard as a first-line endovascular device. Our presence at an important medical conference such as the LINC, Leipzig Interventional Course, held this past June, remained an important opportunity for us to demonstrate CGuard in a live case format as well as to meet KOLs influencing the market demand. We had a significant presence at LINC this year, delivering 4 presentations in addition to a successful live case transmission featuring CGuard. The live cases performed by Dr. Andrej Schmidt and Dr. Andreas Fischer at the University Hospital in Leipzig, Germany, performed on a 60-year-old asymptomatic male with progressive and calcified internal carotid stenosis. Importantly, the case gave treating vascular specialists from across Europe the opportunity to see firsthand not only CGuard's ease of use, but also the benefits of its superb conformability and MicroNet mesh protection innovation. Dr. Parodi is a world-renowned endovascular pioneer, having performed the first-ever endovascular repair procedure in 1990, and the first carotid TCAR procedure in 1994, the latter using reverse flow for cerebral protection. Dr. Parodi's vast experience, unique perspectives and guidance will be useful as we develop new solutions to advance stroke prevention and improve long-term patient outcomes. In terms of our U.S. IDE trial, C-Guardians, last quarter we indicated that we opened our first European trial site and enrollment has been accelerated. We currently have 18 U.S. sites enrolling patients, with plans for four more, and in Europe, four sites are now enrolling and one more is expected to begin cases this month for a total of five. Regarding Japan, our discussions with potential distribution partners interested in representing CGuard are ongoing, and we are pleased to be seeing a very high level of interest. In February, we announced that CGuard EPS would be included as a treatment option in the stenting arm of the CREST-2 trial, which is widely acknowledged as the most significant ongoing trial to scientifically investigate the optimal course of treatment to prevent strokes for asymptomatic patients with significant carotid disease. In terms of product platform, the CGuard EPS stent platform remains the foundation of our business as the device drives patient outcomes beyond the selected delivery option. To fully realize the full potential of CGuard, we've invested in two new delivery systems to drive utilization across the broadest vascular specialist community. We continue to advance development of our new transfemoral delivery system, CGuard Prime, which will be available in both standard and short shaft versions, compatible with the development of Switchguard, our TCAR accessory device. In combinations, these will offer a transcarotid option to our portfolio designed for those clinical needs and conversion of greater surgical procedures to the CGuard EPS stent. With CGuard EPS, we believe we can offer the best patient outcomes in the broadest set of tools to unlock the tremendous potential of this rapidly evolving market segment. With that, I'll turn the call over to Craig for a review of our second quarter financials. For the second quarter of 2022, revenue was $1.531 million compared to $1.038 million for the second quarter of 2021. This increase was predominantly driven by a 47.8% increase in sales volume of CGuard EPS and to $1.505 million for the second quarter of 2022 from $1.019 million for the same period one year ago. Gross profit for the second quarter of 2022 was $431,000 compared to a gross profit of $262,000 for the second quarter of 2021. This increase resulted from higher revenue and a reduction in miscellaneous expenses, partially offset by a reduction in cost of goods sold due to an inventory adjustment that occurred during the three months ended June 30, 2021, which did not occur during this current period. Gross margin increased to 28.1% during the three months ended June 30, 2022, from 25.2% during the three months ended June 30, 2021. Total operating expenses for the second quarter of 2022 were $5.112 million, an increase of $1.410 million compared to $3.702 million for the second quarter of 2021. This increase was primarily due to increases in expenses related to the commencement of the C-Guardians FDA study, resume activities in trade shows, travel and share-based compensation. As of June 30, 2022, cash, cash equivalents and short-term bank deposits were $26.5 million compared to $34 million as of December 31, 2021. Of note, there remains ongoing uncertainty of the changing regulatory environment in Europe specific to the timing of the renewal of certification to sell CGuard under the new MDR rule structure. So it was predominantly exchange, 12% impact, because if you look at the units that Marvin spoke about, we actually grew 60%, and our revenue was only up 48%. So right now, we are direct in the UK and in France, and we have the plans to expand that direct model likely toward the end of the year, beginning of next year. But certainly, more color will come on those as we get those buttoned up likely by next quarter. And then could you maybe not repeat, but revisit the market share growth statistics you mentioned earlier in the prepared remarks, the 20% to 60% growth you're seeing there. So carotid stenting procedures versus competitors, not open surgeries. And as we mentioned, in more than 50% of our markets, we have over 20% share, and in some cases, up to 60%. So we certainly use this as a proxy and a guideline to market penetration, and of course, expanding the overall CAS market, converting surgeries to stenting is our equally important objective, but within the current CAS environment, we look at that as a growth goal commercially. So it's sort of those two pillars, transition more surgery to stenting and gain higher share percentages within the existing endovascular stenting segment. We certainly acknowledge that within the European market, there is an ongoing need for considering TCAR as an alternative delivery option. In fact, many vascular surgeons use homemade kits and other things that they prefer, more of a direct access to the carotid. We guess that somewhere around 20% of the overall procedures by vascular surgeons are done transfemorally, but we're excited about offering an option within the European community for TCAR as well, so that we can drive everyone toward a stenting solution, of course, with CGuard as being the best available option. So Assuming things remain on track there, I think our timing relative to what we've spoken about before seems to be pretty consistent, but we're now into the regulatory approval phase, which certainly has some variability. 20 sites, that's maybe more than I might have expected. But we look forward to beginning the process of making CGuard available, like you said, to those 20 sites."
}