{
    "symbol": "NSPR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 13:36:05",
    "content": " At this time, I’d like to turn the call over to your host, Chuck Padala, LifeSci Advisors. Joining us today from InspireMD are Marvin Slosman, Chief Executive Officer; and Craig Shore, Chief Financial Officer. During this call, management will be making forward-looking statements, not historical facts that are based upon management’s current expectations, beliefs and projections many of which, by their nature, are inherently uncertain. For more information about these risks, please refer to the risk factors described in InspireMD’s most recently filed periodic reports on Form 10-K and Form 10-Q filed with the U.S. Securities and Exchange Commission and InspireMD’s press release that accompanies this call, particularly the cautionary statements made in it. The call contains time-sensitive information that is accurate only as of today, May 10, 2022. Except as required by law, InspireMD disclaims any obligation to publicly update or revise any information to reflect events or circumstances that occur after this call. Q1 2022 proved to be a very busy and productive quarter at InspireMD with approximately 1,910 CGuard stent systems sold to our 31 served markets, representing revenue of $1.161 million. We accelerated enrollment in our C-Guardians FDA trial, including initiating our first European site, preparing for enrollment of the first randomized cases in the CREST-2 trial, received regulatory approval for our European logistics hub, enabling our direct sales in the UK and France and prepared for expansion into more direct sales markets. We added 5 new members of our expanding global team, including seasoned sales and marketing professionals, as well as bolstering our world-class engineering department to keep pace with our expanding R&D programs and commercial growth. Our mission at InspireMD is to establish a new standard of care for addressing cartoid artery disease and stroke prevention, which is foundationally different than any other company. Best patient outcomes, both short and long term depend on a stent platform, which delivers unmatched clinical results to this ever-expanding endovascular-focused market. In order to enable this change to better patient care and to make CGuard ubiquitous in this market, we are focusing on all specialties treating carotid artery disease. By approaching this market in this comprehensive stent-centric approach, we believe we can enable the conversion of this surgically dominated $5 billion global total addressable market to a less invasive endovascular standard of care with sustained results. Revenue for Q1 was $1.161 million, reflecting a 20% growth year-over-year in CGuard sales on 1,910 procedures and units sold. It is important to note procedural volume as a more accurate indicator of the strength and size of our business as we currently share a proportion of the average sales price in the major markets with our distributor partners, further emphasizing our priority to convert more markets to a direct sales approach to fully capture top line revenue recognition. Our expanded site training and enrollment continues with 13 sites currently enrolling in the U.S., with plans for three more along with our first site in Europe with plans to start three more there, all during the next two quarters. Patient enrollment continues to accelerate rapidly with more investigators, experience and gained confidence in CGuard. Our current outlook remains consistent, anticipating the completion of enrollment of the trial in Q1 2023. We continue talks in Japan with distributor partners interested in representing CGuard, which would complement our distribution agreement in China signed last year. As we announced in our previous reporting, our commercial pathway to business growth for CGuard will be facilitated by a new transfemoral delivery system, CGuard Prime, offering a greater navigation and flexibility to address challenging patient anatomy as well as broader set of evolving indications. CGuard Prime will be available in both standard and short shaft versions compatible with the development of our SwitchGuard TCAR accessory device, thus enabling a transcarotid option for our tool set designed for those clinical needs and conversion of greater surgical procedures to a stent platform with CGuard EPS. As we chart a new course of how carotid stenosis is managed and how strokes are prevented with our clinically proven CGuard EPS system, our mission is to provide the best patient outcomes and broader set of tools to unlock this tremendous potential in this rapidly growing and evolving market segment. With that, I’ll turn the call over to Craig to review our first quarter financials. For the first quarter of 2022, revenue increased 18% to $1.183 million from $1,006,000 million during the first quarter of 2021. This increase was predominantly driven by a 20% increase in sales volume of CGuard EPS from $969,000 in the same period 1 year ago to $1.161 million for the first quarter of 2022. In addition, U.S. sales increased due to stents used in the C-Guardian FDA clinical trial. Due to the ongoing conflict in Russia, Belarus and Ukraine and related currency restrictions, we do not sell to these three countries during Q1, limiting our reported growth. If we eliminate the impact of these countries, there would have been a 32% year-over-year growth in CGuard EPS versus the 20% reported number. Gross profit for the first quarter of 2022 increased by $16,000 to a $122,000 compared to a gross profit of $106,000 for the first quarter of 2021. Gross margin was 10.3% during the 3 months ended March 31, 2022, versus 10.5% during the prior year period. Total operating expenses for the first quarter of 2022 were $4.6 million, an increase of $1.2 million compared to $3.4 million for the first quarter of 2021. As of March 31, 2022, cash, cash equivalents and short-term bank deposits were $29.9 million compared to $34 million as of December 31, 2021. Professor Piotr Musialek is the person you’re referring to, and he has been a KOL of ours for quite some time, probably has the most experience with CGuard of anyone in the world. So we’re incredibly enthusiastic about Professor Musialek being involved in as a co-PI and also driving incremental enrollment in Europe in general, he’ll be leading the effort with our investigators there. So Ben, it’s – right now, we’re direct in France and the UK both. As you can imagine, it’s a bit sensitive given the fact that we have distribution agreements in place in many of those areas. So we’re working through the details now, but the first step was to put this logistics hub in, get it cleared from a regulatory perspective and make sure that we’re in a position to be able to sell efficiently on a direct basis. But our plan is to engage a number of countries on a direct model to take advantage of the higher ASP and much more control of the market space with new products in the pipeline, we certainly want to control the effort and make sure that we are doing that on a direct basis, but much more on that topic in subsequent calls. And so we will have much more detail on that and enrollments, hopefully, during the quarter that we can share in detail. And we don’t have a firm number for you at the moment, but we certainly think that CGuard is bringing a refreshed view of those operators being interested in contributing to the stenting arm. And then I don’t know if you guys have better information, but I thought I had heard that the stenting arm was a decent amount behind the other arm there, what – CA on there. We certainly have heard similar feedback, but don’t have a quantitative measure at this point. But with CGuard being available to enrollment, we hope that, that continues to provoke the stenting side of the enrollment and make that more robust. And then just back on your KOL event, I think Dr. Metzger and Dr. Lyden both made statements kind of suggesting that CMS was kind of in the process of reviewing the national coverage determination for stenting and may have been likely to kind of expand coverage in the near-term to kind of match CA. We don’t have any more details, except we are certainly supportive of the effort and encouraged by the trend here. And obviously, all of those that contribute to the stenting side of the business and then endovascular approach. We don’t have any details other than we continue to support all of the efforts industry-wide that are going on to try to enable that change and that would be a huge uplift, obviously, for us and for the space in general. And our direct effort in many of the countries is driven by the fact that we have got new products to launch, and we certainly want to take full advantage of that momentum. Right now, we are well into the R&D and what we call V&V stage of getting these products through the pipeline and getting all the clinical data required to get that into the regulatory pathway. We are anticipating a Q1 launch of both the products, and we are incredibly enthusiastic about both of those because they offer tremendous access to a much broader base of physicians interested in stenting and most importantly, that’s a comprehensive approach to both the interventionalists as well as vascular surgeons."
}