{
    "symbol": "SOHO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 15:08:06",
    "content": "  Operator: Hello, and welcome to today's Sotherly Hotels Third Quarter 2022 Earnings Call and Webcast. Looking at these figures versus third quarter of 2019, RevPAR increased 2.7%, with occupancy down 7.2%, with ADR increasing 10.8%. Year-to-date RevPAR for the same-store composite portfolio was $110.65, with occupancy of 62.2% and an ADR of $177.88. Looking at these figures for the comparable period in 2019, RevPAR was down 7.2% with occupancy down 12.9% and ADR increasing 6.5%. Overall, we were pleased with our portfolio's third quarter results, highlighted by sustained strength of demand for leisure travel during the summer months, coupled with strong growth in demand for group business travel. For September alone, RevPAR was up 9% over 2019, with ADR up nearly 11% and occupancy only slightly off to pre-pandemic levels, a definitive indication that we are nearing a normalized operating environment. For the group segment, our portfolio produced 86% of the group business in the third quarter 2022 compared to Q3 2019. For the business travel segment, our portfolio was at 67% of the business travel produced in Q3 2019. Though in September, business travel revenue increased to 78% of the business travel in September of 2019. The continued strengthening of the business travel and group segments came across our entire portfolio, but was most noteworthy at our heavily impacted urban hotels in Washington, D.C. and Houston, which experienced the best year-over-year improvement in performance. While contribution from group and business travel at these hotels was at its highest level since the start of the pandemic, we believe there is still significant upside potential for these assets as midweek occupancy continues to grow and forward bookings are trending positively for Q4 and next year. Meanwhile, our portfolio is leisure-focused hotels maintained their strong results during the quarter, as leisure demand was combined with a steady return of group demand to produce outstanding results. The DeSoto Savannah continued its excellent results during the quarter as the property easily outpaced 2019 metrics with a 36.3% gain in RevPAR, fueled by significant rate growth of 27.8% and occupancy growth of 6.7% over 2019. The Hyatt Centric Arlington continues to show strong sequential improvement relative to 2019, fueled by the return of business travel to the hotel. Though, third quarter RevPAR was still off 10.1% compared to the same period in 2019, this was a significant improvement over the second quarter. Rate, which was up 8.6% compared to the third quarter of 2019, was the main driver of this improvement. And during the quarter, the hotel achieved a RevPAR index of nearly 124% and gained over 8% in RevPAR share, further solidifying its position as the leader in the market. Hotel Ballast in Wilmington, North Carolina posted exceptional results for the third quarter as the hotel drove strong demand from the leisure and group segments, improving RevPAR by 12.3% over 2019, fueled by a 3.2% increase in occupancy and an 8.9% increase in rate. The property continues to perform well versus competitive set, gaining 7.4% in RevPAR share during the quarter. For the third quarter 2022 versus 2019, margins expanded 420 basis points to 25.1%. Year-to-date, margins have expanded 110 basis points over 2019 to 27.7%, the highest level in the company's history. For the third quarter, total revenue was approximately $39.2 million, representing an increase of 10.5% over the same quarter in 2021. On a year-to-date basis, total revenue was approximately $124.7 million, representing an increase of 34.8% over the same period in 2021. Comparing current performance to pre-pandemic levels, total revenue for the third quarter increased to 92.2% of the level of total revenue for the same period in 2019. On a year-to-date basis, total revenue increased to 88.2% of the level of total revenue for the same period in 2019. Hotel EBITDA for the quarter was approximately $9.8 million, representing an increase of 10% over the same quarter 2021. Year-to-date, hotel EBITDA was approximately $34.6 million, representing an increase of 51.7% over the same 9-month period in 2021. Comparing current performance to pre-pandemic levels, hotel EBITDA increased to 110.3% of hotel EBITDA for the same period in 2019. On a year-to-date basis, hotel EBITDA increased to 91.8% of the level of hotel EBITDA for that same 9-month period in 2019. For the quarter, adjusted FFO was approximately $2.4 million, representing an increase of $2.4 million over the same quarter 2021. Year-to-date, adjusted FFO was approximately $9.8 million, representing an improvement of approximately $13.4 million over that same 9-month period in 2021. Comparing current performance to pre-pandemic levels, adjusted FFO increased to 217.5% of the level of adjusted FFO for the same period in 2019. Year-to-date, adjusted FFO increased to 81.1% of the level of adjusted FFO for that same 9-month period in 2019. As of September 30, 2022, we ended the quarter, the company had total cash of approximately $30 million, consisting of unrestricted cash and cash equivalents of approximately $23 million, as well as $7 million which was reserved for real estate taxes, capital improvements and certain other items. Looking ahead to the fourth quarter, the company estimates cash generated at the hotel level to range between $10 million and $10.25 million. Since December 2020, we have removed $55.3 million of debt from the company's balance sheet using approximately $52.2 million generated in asset sales. At the end of the quarter, we had principal balances of approximately $322.7 million in outstanding debt at a weighted average interest rate of 4.88%. As we enter a more normalized operating environment, we anticipate capital expenditures be more aligned with historic norms, and we estimate capital expenditures will amount to approximately $7.2 million for calendar year 2022. During the third quarter, we experienced encouraging trends across our portfolio as business and group travel continue to improve, while leisure travel maintained its robust demand and exceptionally strong rate growth. Leisure demand at our hotels remained particularly strong during the quarter, especially at our coastal properties such as Hotel Ballast and the DeSoto, which posted historically strong room rates during the period. Rates were especially strong during high demand periods in the quarter, such as the July 4, Labor Day weekend and other citywide events. Notably, ADR at the DeSoto increased nearly 28% over the third quarter of 2019, translating to excellent profitability. Demand at our urban locations experienced the most profound year-over-year increases during the quarter, a trend which clearly reflects the improving group and business travel segments in those markets. Notably, RevPAR at this property improved approximately 1,000 basis points quarter-over-quarter relative to 2019. While year-over-year occupancy growth for our portfolio is impressive, we believe there is still significant room for improvement as occupancy was still 7.2% below 2019 during the third quarter. We expect the momentum gained during the third quarter to continue as corporate travel trends are improving and site visits, leads, and group bookings remained strong for the fourth quarter of next year. In fact, fourth quarter group bookings are pacing 12% ahead of 2019 levels, representing a significant improvement over the third quarter's group bookings. Overall, we are forecasting fourth quarter RevPAR to be approximately 6.5% above the same period in 2019. But if we look at your press release and estimated uses of cash, even with all these positives, you're still going to use a few hundred thousand of cash based on the debt service of $6.3 million. First of all, when we're looking at cash usage in the fourth quarter that Tony forecasted, there's still about, what, $300,000 or maybe a little bit more than that, $600,000 of forbearance catch-up payments there. The other piece, our CapEx forecast for the fourth quarter is kind of back loaded, that's a heavy number just because we've kind of taken taking the year and things are delayed. I would add that ours is a seasonal business, a really, really strong second quarter, a good first quarter and the last half of the year is generally good. Alex, I'd also bring your attention to, I think we made a comment in the script that there is -- for the calendar year 2022, there's about $7.5 million to $8.5 million worth of forbearance payments."
}