{
    "symbol": "XFOR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 12:53:15",
    "content": " We believe that the results from the open label extension of our Phase 2 clinical trial with mavorixafor and WHIM patients continue to support the significant potential of our lead drug candidate in this indication with data showing durable TAT or a Time Above Threshold for blood level of neutrophils, lymphocytes and monocytes, decreased frequency of infection and robust and sustained improvement in warts, peace and quality of life, including reductions in doctor or how hospital visits was meaningfully improved based on our Phase 2 patient narrative. I think, again, we continue to see the importance of adding CXCR4 antagonists across any of those BTKi inhibitors with respect to patients with the CXCR4 mutations, initially, and certainly we see broader applicability beyond that we just presented some really exciting data at AACR, which shows the breadth of activity of our drugs, not only in double mutants, but across the single now into Waldenström cells as well. So now it's a broader market expansion and opportunity across other patients now with chronic neutropenia, and what we're focused on is the potential of mavorixafor to raise the neutrophil levels in those patients. So when you present the data or when you start to analyze the data from fourth quarter onwards, are you going to go back and look at individual, individually you're going to be looking at the mutations just to understand how broad mavorixafor can be working on and do you think there will be any mutations where mavorixafor will not be able to interact with or not able to get the get the benefit, some of these patients, I'm just trying to understand how broad you can use mavorixafor in the WHIM syndrome. So in terms of the potential for mavorixafor win, we continue to guide that there's at least about 1,000 genetically confirmed or confirmed one patients in the US and possibly much more than that, in terms of the under diagnosed or undiagnosed, and we're making exceptional progress towards building that patient base education, awareness and getting ready for supporting a positive launch to the mavorixafor be approved. But this kind of said lays based on what you just ended with, regarding the broad commercial potential, I think you guys have had highlighted about 60,000 patients across the different diseases that you're looking at, you also are going to have pretty much strong proof-of-concept data across all three indications by the end of the year."
}