{
    "symbol": "XFOR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 13:55:05",
    "content": " As we welcome new team members, we are extremely excited to share the progress that we've been making as we sharpen our focus of the company with a mission to develop therapeutics to treat the broad patient population with chronic neutropenic disorders, including our first potential indication of WHIM syndrome and where we believe there's a significant need for an oral efficacious therapy with low treatment burden and good tolerability. Today, the focus of the call will be to provide updates on mavericksphore's progress in our global pivotal phase three trial in WHIM syndrome and to highlight how we are getting appropriately prepared to ramp into commercial launch. We recently completed the randomized placebo-controlled portion of the phase three study of mavericksphore in WHIM, which is testing for the first time in a registrational study a targeted treatment that specifically addresses the root cause with the potential to improve the full spectrum of problems associated with the disease. And I've joined X4 because I can clearly see the potential of mavericksphore to not only become the first therapy for people with WHIM syndrome, but also to become a new standard of care for those with chronic neutropenic disorders who face considerable challenges with currently available therapies. As you would expect, preparing the product, the market and the company for commercialization to ensure mavericksphore treatment reaches patients with WHIM syndrome is well underway in anticipation of the phase three data and leading up to planned 2024 launch if approved. As a result, we plan to study whether mavericksphore has the potential to treat up to 50,000 patients currently diagnosed with idiopathic congenital and cyclic neutropenia in the U.S. And we are on the cusp of a potentially positive phase two trial that could support a U.S. launch in 2024. In closing, you can see that we expect a steady cadence of milestones ahead of us, starting with our potentially transformative WHIM phase three data later this quarter, followed by additional expected CN data and potential initial clarity on the regulatory path forward for mavericksphore in CN in the first half of 2023. Assuming positive phase three results in WHIM, our NDA filing for mavericksphore is on track for early in the second half of 2023, and we're aiming to be phase three ready to move forward with advancing a CN registration trial following the expected filing of our NDA and WHIM. So the timing isn't finely tuned, but we believe WHIM plus CM data plus regulatory conversations should be happening in the first half of next year to prepare us to then, of course, file the NDA on WHIM, and shortly thereafter complete that registration clarity and kick off advancing a CN phase three trial, subsequent to the NDA."
}