{
    "symbol": "DKS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-25 11:29:07",
    "content": "  Operator: Hello, everyone, and welcome to the First Quarter 2022 DICK'S Sports Goods, Inc. My name is Victoria, and I will be coordinating your call today. Good morning, everyone, and thank you for joining us to discuss our first quarter 2022 results. On today’s call will be Lauren Hobart, our President and Chief Executive Officer; and Navdeep Gupta, our Chief Financial Officer. As a reminder, we will be making forward-looking statements, which are subject to various risks and uncertainties that could cause our actual results to differ materially from these statements. Any such statements should be considered in conjunction with cautionary statements in our earnings release and the risk factor discussions in our filings with the SEC, including our last Annual Report on Form 10-K and cautionary statements made during this call. As required by new accounting rules, adopted in the current period, our first quarter GAAP earnings per diluted share assumes share of settlement of our convertible senior notes issued in Q1 2020, which excludes the after-tax interest expense and includes the total shares underlying these notes. Given our intent to settle the principal portion of these notes in cash and the shares that will be delivered by our bond hedged settlements, we do not expect the notes to have a dilutive effect at settlement. Accordingly, we believe that reflecting the notes as debt more closely aligns with the underlying economics of the transaction, which is reflected in our non-GAAP earnings per diluted share. For additional details on this or to find a reconciliation of any non-GAAP financial measures referenced on today's call, please refer to our Investor Relations website. And finally, for your future scheduling purposes, we are tentatively planning to publish our second quarter 2022 earnings results on August 23, 2022. Before diving into the results of the quarter, I think it's important to recognize that over the past two years, we have demonstrated our ability to adeptly manage through the pandemic and other challenges and we are confident in our continued ability to adapt quickly and execute through uncertain macroeconomic conditions, while keeping our athletes at the heart of every decision we make. With that context, I do want to take a moment to address the adjustments we made to our 2022 outlook this morning. Like everyone else, we have been carefully monitoring the rapidly evolving macroeconomic environment and assessing our expectations based on our experience, running our business across economic cycles. With this perspective, we believe it's appropriate to be cautious and are, therefore, lowering our outlook for the year. To be clear, we expect our performance will continue to meaningfully exceed 2019 levels, reflecting the strength of our core strategies and the changes we've made in our business over the past five years. DICK'S is the clear market leader, and we are well-positioned to extend our lead and build on our competitive advantages in the years ahead. As we announced earlier this morning, we delivered sales of $2.7 billion in the first quarter. This included a comparable store sales decline of 8.4%, which followed a 117% increase in comp sales in the same period of the prior year. This also reflected the anniversary of significant stimulus payments, as well as anticipated sales normalization in certain categories. Importantly, sales continued to run substantially above pre-COVID levels, up 41% versus Q1 2019 and sequentially accelerated from last quarter. Consumers have made lasting lifestyle changes, with an increased focus on health and fitness and greater participation in sports and outdoor activities. Our increasingly differentiated product assortment, combined with our disciplined and more sophisticated promotional strategies, continues to drive strong merchandise margin growth. During the quarter, we expanded our merchandise margin rate by 143 basis points versus 2021. In addition, the tools we have today to surgically adjust pricing are significantly more sophisticated than they were several years ago. With these fundamental changes, we are very confident that the majority of our merchandise margin rate expansion that we've driven over the past two years is sustainable. Led by our structurally higher sales and merchandise margin compared to pre-COVID levels, we achieved double-digit EBT margin of over 12% and non-GAAP earnings per diluted share of $2.85, both significantly ahead of any pre-COVID first quarter in our history. During the first quarter, our stores enabled over 90% of total sales, serving both our in-store athletes and providing over 800 forward points of distribution for omnichannel fulfillment through ship from store, in-store pickup or curbside. Furthermore, we remain focused on maintaining our strong culture, putting our teammates, athletes and communities at the center of everything we do. This work continues to have a positive impact, as we were recently awarded back-to-back annual certification by Great Place to Work. Next, within merchandising, our relationships with key brands remain stronger than ever. Importantly, we also are ensuring that we have products at prices that address the needs of all athletes. For example, through DSG, our largest vertical brand, we offer high-quality, fashion-forward products at a tremendous value across men's, women's and youth. Our key lifestyle vertical brands, including CALIA and VRST are also resonating strongly with our athletes and we continue to invest in and grow these brands. Today, we are really excited to open our third House of Sport store in Minnetonka, Minnesota. House of Sport has exceeded our expectations and has been a great example of the power of elevated service, community engagement and merchandise presentations. We look forward to continuing to refine and grow these concepts, while pulling key learnings into our core DICK'S and Golf Galaxy chains. In closing, we remain confident in our strategies and our ability to deliver long-term sales and earnings growth. Our teammates are united behind our common purpose, which is to create confidence and excitement by personally equipping all athletes to achieve their dreams, especially during these times of uncertainty. Before concluding, I want to thank all of our teammates for their hard work and unwavering dedication to our business. Thank you, Lauren, and good morning, everyone. Comparable store sales decreased 8.4%, following a 117% increase in comp sales in the same period last year. As Lauren indicated, comps were impacted as we anniversary significant stimulus payments from the prior year quarter. And in addition, we saw the anticipated sales normalization in certain categories that surge throughout the pandemic. And as part of this year-over-year anniversary, transactions declined by 6.4% and average ticket declined by 2%. Importantly, our sales continue to run significantly above pre-COVID levels. Compared to 2019, consolidated sales increased 41% and sequentially accelerated from the most recent quarter. For the quarter, merchandise margin increased 143 basis points as we continue to see the benefits from our increasingly differentiated product assortment, combined with our disciplined and more sophisticated promotional strategies and clearer pricing. SG&A expenses were $615.3 million or 22.79% of net sales and deleveraged 195 basis points compared to last year, primarily due to the decrease in sales. These items were partially offset by lower incentive compensation expense and $17 million of income associated with changes in the investment values of our deferred compensation plan, which is fully offset by the investment loss recognized in other expense line. In addition, SG&A also included approximately $13 million of COVID-related safety costs in the prior year quarter. Driven by our structurally higher sales and merchandise margin compared to pre-COVID levels, EBT was $331.9 million or 12.29% of net sales. In total, we delivered non-GAAP earnings per diluted share of $2.85. Now looking to our balance sheet, we ended Q1 with approximately $2.25 billion of cash and cash equivalent and no borrowings on our $1.6 billion unsecured credit facility. Our quarter end inventory levels increased 40% compared to Q1 of last year, with product flow improving as the quarter progressed. Looking ahead, we feel good about our overall inventory levels for Q2 and are prepared to continue navigating a dynamic global supply chain environment through the rest of the year. Turning to our first quarter capital allocation, net capital expenditures were $53.9 million and we paid $46.1 million in quarterly dividends. During the quarter, we exchanged $100 million at approximately 17% of the outstanding principle of our convertible senior notes for cash and unwound the corresponding of convertible note hedge and warrants for 1.8 million shares of our common stock. Following this exchange, we have approximately $475 million in aggregate principal amount outstanding. We also repurchased 417,000 shares of our stock for $42 million at an average price of $101.39. However, as Lauren mentioned, we have been carefully monitoring the economic environment and there are many puts and takes at play. With an increasingly uncertain macroeconomic backdrop, geopolitical environment and a dynamic global supply chain, we believe it is prudent to adopt an appropriately cautious outlook for the year. Thus, we are adjusting our 2022 guidance range. For the year, we now expect non-GAAP earnings per diluted share in the range of $9.15 to $11.70 and comparable store sales in the range of negative 8% to negative 2%. EBT is expected to be in the range of $1.05 billion to $1.35 billion, with EBT margins expected to be approximately 10% at the midpoint. This includes additional risk in supply chain-related costs and higher wage rates, as well as greater than originally anticipated normalization of promotional landscape over the balance of the year. As a reminder, this also includes approximately $55 million of pre-tax interest expense associated with our $1.5 billion long-term debt. Our earnings guidance assumes an effective tax rate between 23% and 24%, and is based on an approximately 88 million average diluted shares outstanding. In addition, our plan now includes a minimum of $300 million of share repurchases, the effect of which is included in our EPS guidance. Importantly, we are continuing to invest in our business for long term and for the year, expect the net capital expenditure of $340 million to $365 million. In closing, we are pleased with the results of our first quarter. And while we recognize we are in an uncertain economic environment, DICK'S is a clear market leader, and we remain structurally stronger and more profitable company today compared to pre-COVID. And at the midpoint of our updated outlook, we expect sales to increase approximately 35% versus 2019 and EBT margin of approximately 10%, doubling our 2019 EBT rate. Our financial position is strong, ending Q1 with approximately $2.25 billion of cash and cash equivalents, and we remain confident in our strategy and our ability to drive sales and profitability growth over the long term. Operator, you may now open the line for questions. Your line is open. I think the midpoint, it's about a 16% cut and Navdeep, you mentioned a few factors. I think those are all very important questions, and I'll try and parse them all out and answer all of them. So, obviously, macroeconomic trends are challenging, inflation is putting pressure on the consumer at the gas pump and in grocery store, we all know. And then there's this geopolitical environment that is very, very challenging. At the same time, we see that the expenses of those three-line items, so freight, labor and perhaps product input costs are accelerating more quickly than we had anticipated. However, I want to be very clear that we are not seeing any meaningful trends that are different from what we saw in Q1 and we believe our inventory at plus 40% actually is very healthy and we are very pleased with it. To answer your other question, our -- the promotional environment, we are not seeing a change in the promotional environment. The follow-up is the confidence that the industry or your business won't revert further, and we've been talking about this question for two years. But is there any categories that you can point to that in which consumption is holding or growing at the structurally higher level, because we're at a much higher water level, as you mentioned, 30%, 40%, even at the midpoint, I think Navdeep said. If you look at the last two years and look at the consumer, every single category in our business has -- virtually everyone except for Hunt, has rebaseline meaningfully higher than our pre-pandemic volume. The pandemic-surging categories that we've all been talking about and we expected to normalize are fitness, outdoor equipment, which will include things like bikes and paddles and golf. And those three normalize as we expected them to normalize, but we believe they all have long-term growth potential. We actually think in these types of times, people need to get outside. They want to be with their families, and we are well positioned to serve the needs of these athletes. Thank you very much. Lauren, I want to stay on the promo topic because we as well did not see promos this quarter. I guess my question really is, the notion that, say a partnership with Nike, where you're sort of their premier partner, let's just call it, for lack of a better term. And I think that's a result, not just of a situational moment in time with certain partners, but the fact that we have invested so much in our stores and in our experience, such that brands who are rooted in sport, want to actually showcase their product and their brand in our stores. So, yes, across the board, we are getting access to higher heat and more pristine premier product that's high in consumer demand. And that's a big part of our strategy, and that has been driving our results. Yes, Adrienne, maybe before I go into the details, I think one of the ways to think about the inventory is to also look at what was happening to our inventory position as we were going through 2021. If you look at it, as we called out last year, our inventory position continued to build as we went into the year. So, what you're comparing Q1 versus Q1 last year, especially our inventory starts and in-stock levels last year in \n Hello, everybody, and thank you for standing by. So, Adrienne, back to your question, the way we are looking at inventory, we are looking at inventory trends versus 2019 internally, because as we talked about in 2021, our inventory levels were building through the year. In terms of the balance between in transit as well as unit versus the prices, I would say, yes, we have a little bit elevated levels of in-transit inventory, not necessarily associated with brine the product heads for the balance of the year as much more of to do with the products that we expected to receive in Q1 that is slightly delayed. So that's the reason, we have a little bit of elevated levels of in-transit inventory. Thank you very much. Your line is open. I wanted to ask about average ticket, which I think you mentioned was down about 2%. Yes, as you expected and as you called out, that as the COVID surge in categories like fitness and the outdoor equipment normalize, that does put a little bit of a pressure on the ticket size, and that is balanced against the overall AUR increases, inflation related that we have seen. And then my follow-up question is, we've heard a lot about adverse weather, whether it be in apparel or auto part retail and just how it affected sales in the first quarter. I know, you have some weather sensitive categories like apparel and team sports in the quarter. Yeah, Kate, we – it's Lauren. We had – we did not see a significant weather impact in any of the key categories, certainly didn't drive any markdown behavior. Thank you for your question. The – I think, Lauren, you said that, the consumer is still doing well into 2Q. And then also, merchandise margins, really good in the first quarter. So one, we're not giving an inter-quarter guidance here. Like Lauren said, Q1, we were pleased with our Q1 performance. The business reaccelerated versus 2019 and especially, if you look at where we finished in Q4. And like Lauren called out again, like we're not seeing a meaningful change in the trajectory of the business in the month of May. The takedown in our guidance on the top line expectation is purely coming out of, we being appropriately cautious about the outlook on what is happening in kind of the overall economic landscape. As we think about the other two elements that we called out, we have -- we anticipated that the freight expenses would be elevated. And the last piece, like we called out, right, anticipated, again, a little bit of normalization of the promotions in the back half of the year. And potentially, as Lauren called out, we may be seeing -- we are seeing some increase in input costs. And we may decide not to pass all of those costs to our athletes as well, just trying to do the right thing between the athlete as well as the long-term potential of our business. Robby, I just want to build on one thing, which is that our merch margin forecast going forward still assumes, even in the new guidance, that we are going to maintain the majority of our margin gains over the past few years. Thank you so much. And I would point specifically to how pleased we are with the DSG line, and the fact that, that does provide an opening price point with really wonderful fashion is doing incredibly well, as is our new VRST line and our CALIA line. From an apparel and footwear performance standpoint in the quarter, footwear did really, really well for all the reasons that we've been talking about and inventory in that category is good. On the apparel side, we did have some inventory challenges during the quarter, just making sure that we have the right product, the right season product in stock. But we are planning to buy around anything that came in late, so it's not a markdown risk for us, and we believe that by back-to-school apparel should be getting better. Thank you for your question. If I could characterize what you said, you basically, at this point, you have passed through input cost pressures and have essentially at least maintained your gross margin rate. Going forward, you're saying there could be some input cost absorption, where it causes degradation in your merchandise margin. So my follow-up is that if you look on a sort of stack basis versus 2019, merchandise margins did decelerate relative to what you experienced in the fourth quarter. We have passed some input cost pressures on to consumers, specifically in hard lines, a little bit in soft lines, but we have not been passing through all of our input cost pressures. We have been benefiting from some of our improved assortment, our mix and the fact that we're not promotional. So our merch margins are not reflecting the -- even though they're so strong, it's not reflecting the fact that we've passed 100% of the cost forward. Now as we look to the future, if costs continue to increase at an accelerated rate, we may have to start passing higher cost increases on. And at that point, we're going to be down at the really specific data-driven pricing optimized level in terms of what the consumer will bear versus what our margin will absorb. And then Navdeep, if you can answer the latter part of the question. Chris, I think there are two ways to think about it. Like if you compare it versus 2020 -- in fourth quarter of last year, we had called out that we were not promotional. So when you -- and considering how promotional fourth quarter typically is, that benefit was included in our Q4 expectation. We are very pleased with the performance that we have seen from the merchandise margin expansion, especially when you look at it compared to 2019. Like Lauren called out, we expect to be able to maintain a vast majority of the merchandise margin gains that we have seen over the last two years into this year, and that has been contemplated in our guidance as well. So it's somewhere, it's going to be landing somewhere between the two, and that's the piece that we will continue to watch out. Q1 is not as promotional of a quarter as you typically expect, right, compared to fourth quarter. And that's kind of -- we still were able to expand our merchandise margin, even when compared to Q1 of 2021. Obviously, diesel, sort of, mid-quarter -- to your points in the prepared remarks, diesel really ripped higher, up 70% year-over-year mid-quarter. I would say there are -- the biggest one is correct, no questions about it. There are two pieces, fuel is what we called out as well as like when you think of the fixed expenses and the deleverage that you get when you have a negative 8.5% comp, that is also included. But the vast majority, I would say, was driven by the freight pressures that we saw. Thank you so much. Maybe -- sorry, I'll add to this that this was not a surprise to us. When you look at that decline, it was more of a year-over-year, we -- like Lauren called out, both these expenses, the wage rate pressure as well as the freight pressure that we saw in Q1 was more in line with our internal expectation, what we thought was there will be some normalization, which we are not expecting in the right now in the back half. Thank you so much. So you've talked about some of these tools, you've developed to surgically adjust pricing. We have -- we didn't have a substantial amount of clearance in some of those normalized categories that you're referencing because as I said before, we are going to buy around healthy, good inventory. That said, our clearance levels are really, really healthy and improved. concept, where we can get clearance products both out of the DICK'S store so that we can bring new fresh product in there, but also in Going, Going, Gone!, once we've consolidated the clearance, we can offer it online easier because we don't have safety stock issues at higher prices without having to let it sort of sit for a long, long time. Back to your initial part of the question, which is the confidence that we can hold on to the vast majority of the gain. If you think back to 2019, Hunt's penetration has significantly gone down. The vertical brand penetration has significantly gone up and vertical brands just to remind, 600 to 800 basis points higher margin rate as well as our approach to marketing has significantly changed. So, we no longer are doing big promotions that we used to do back in 2019. I actually think in some ways, it's notable that our Gold customer penetration has actually increased, and our sales from that group have been positive, which is evidence, I think, of the fact that people are still spending on categories that are important to them and the fact that our assortment has become so much more premium and attractive and high heat. At the same time though, at the opening price point, we have -- we've been having success with things like DSG brand, it's accelerated. So, it's kind of a bifurcated answer. One is on the prior guidance you gave, I mean, you sort of gave real direction on the overall gross margin in SG&A. And I think around 640 bps, the gross margin would end up above '19. And maybe if there are modeling questions, we can take that offline. But I would say that there are three big drivers, just to reiterate, as we talk about the updated guidance, especially when it came to profitability. The freight pressures just – and supply chain pressures, which kind of sit between -- which sits primarily in our gross profit line. And then the wage pressure, which if you think about it, is predominantly in our store labor line and that will be on an SG&A line. Potentially, there are other inflationary pressures as well, but we have taken some actions as part of the revised guidance that are kind of offsetting the pressure that we are seeing in other lines. And then during the crisis, you guys did a good job of sort of adjusting to better face your consumers and we're able to internally overcome a lot of the macro craziness that's going on. One is that, we have somewhat of a -- maybe an overstatement, but a natural hedge within our business, such that when people stop playing team sports in that case, they still wanted to get outside with their families. And then similarly, when people started to go back onto the field, you see those businesses normalize. So generally speaking, I think we're in a great lane in terms of the products that we carry. Looking forward, we just -- the consumer is going through an awful lot right now. And frankly, it's getting more challenging every single day. And so we will work like heck to pull every lever that we have to drive sales and to manage expenses, and you can expect us to do that. But we want to be appropriately cautious, given how rapidly some costs are accelerating and that the consumer is really in a very challenged state right now. Thank you very much. Thank you for your question. Two questions, one, just on the comp, it's fair to say that the new guidance range down -- I think it was down 2% to down 8%. That does anticipate some change in the consumer environment, because you're not seeing it yet. But again, I guess you're saying in your guidance, you are assuming some of it, but the second part of that question is, I presume that you still -- you are still running within your previous guidance of 5% to down 4%, because you're not seeing any change, you're just taking it down based on what you think might -- or being cautious on what could happen. Michael, I think you said it perfectly. That is exactly that our new guidance anticipates that there's, a lot of things that we can't control going forward. And we are expecting to -- everything we can control, we feel really, really positive about. One other question, if I could ask specifically about the golf business. I think you said quickly in there at one point that, that business wasn't as strong. Just curious, how you're thinking about that category. So I think there's going to be some normalization, which we expected the weather shifts don't bother you at all, because that happens every year on either slowing in December or maybe snowing in April, I don't know. But long-term, we have a lot of confidence in the golf business. And I'll just say your Golf Galaxy offering, the club fitting, I took advantage of that, tremendous offer. Thank you for your question. So from what we're hearing from a lot of the Softlines vendors, apparel footwear vendors, the athletic brands is, there's plans for an acceleration and in some cases, a meaningful acceleration in their North American businesses as we get into the back half of the year. John, we do see and we guided originally to the fact that we think the year is going to start off – sequentially accelerate as the year goes on. I mentioned in my remarks that Softlines in particular, on the apparel side, have had some supply chain challenges and that we're bullish as we look at more back-to-school in the rest of the year. So I think the consumer is there and the product is good, and we are absolutely buying into these trends. And then maybe just on the – if we look – look at the high end and the low end of guidance, the down 8% to down 2% and then the $9.15 to $11.70 on EPS, what do you think is the biggest swing factor in the guidance, both from a sales and margin standpoint? John, I would say the biggest overriding factor is comp sales. The – if we continue to see that the consumer is holding up well, and we are not – and is not getting impacted by the cumulative impact of inflation, gas prices, commodity prices increasing, if the consumer continues to hold well, that, to me, would be a good indication of how our business will do. I think to me, this is where – on the confidence that our merchandising team come from and the supply chain team. They have a very good pulse on the business, and we have perfected this art on – as we called out at the beginning of the last two years on the upside, and we are very, very careful about thinking about different scenarios, what are the potential, where are the categories where the business could be impacted and as you expect, that we are doing all of these internal evaluations a lot, discussing about different scenarios. And to me, the confidence that we have in our team is probably the biggest indicator of the overall confidence that we have on our inventory position. And I think the fact that wherever we are – where we are right now, the inventory is not toxic. We don't plan to create any level of risk with toxicity, and we can manage through and buy around any -- an inventory we have. Your line is open. I want to go back to -- on the gross margin line, I know we've talked about merch margin a lot, but you actually mentioned that occupancy costs deleveraged quite a bit. No, Joe, it's all driven by sales. So and -- at a minus 8.5% comp and 7.5% sales decline, it's all being driven by sales decline. To answer your question, the flexibility that we have in our real estate portfolio and the strength that we have in terms of our financial performance and the strong balance sheet, we actually feel really good about the opportunity that we have to be able to drive more efficiencies in our occupancy costs. That's great to hear. And then kind of a bigger picture question I had was, as you think -- or as we all start to think about what's the right level of operating profit going forward or operating margin, EBIT margin, if you will. I think we all agree, it's probably not going back to pre-COVID levels. It's also probably not going to be at the peak of last year, 16.5%. But three months ago, we all thought it was going to be more like 13-ish, and now we're thinking it's 10-ish. Basically, what we are saying is that structurally, there's nothing that we believe is going to hold us back from achieving kind of the profitability levels that we saw in 2021. So to me, that's the piece that we will continue to look to. And structurally, our merchandising margin is really strong, our e-commerce business continues to be really strong, and it's very profitable. So structurally, when you think about it, we are very optimistic about the long-term sales and the profitability of our business. That's great to hear. I would now like to pass back over to Lauren Hobart, President and CEO for any final remarks. Thank you, and thank you all for your interest in DICK'S Sporting Goods. We apologize for some of the technical glitches on this call, but hopefully, you were able to hear the confidence that we have in our business. Thank you, everybody for joining today's call."
}