{
    "symbol": "DKS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 13:54:02",
    "content": " The step change increase in our dividend that we announced today, more than doubling our annualized payout to $4 per share or $1 on a quarterly basis, clearly reflects our strong conviction and a structurally higher sales and earnings profile of our business and our ongoing focus on delivering shareholder value. On a non-GAAP basis, gross profit for the full year was $4.29 billion or 34.65% of net sales and declined 368 basis points from last year. On a non-GAAP basis, SG&A expenses were $2.78 billion or 22.45% of net sales and deleveraged 78 basis points from last year. Driven by our structurally higher sales, expanded merchandise margin and operating efficiencies compared to pre-COVID levels, non-GAAP EBT was $1.41 billion or 11.43% of net sales. This compares to a non-GAAP EBT of $440.5 million or 5.03% of net sales in 2019, an increase of close to $1 billion, or 640 basis points as a percentage of net sales. On a non-GAAP basis, gross profit in the fourth quarter was $1.17 billion or 32.44% of net sales and declined 514 basis points versus last year. On a non-GAAP basis, SG&A expenses were $823.7 million or 22.9% of net sales and leveraged 48 basis points compared to last year. Driven by our structurally higher sales, expanded merchandise margin and operating efficiencies compared to pre-COVID levels, non-GAAP EBT was $350.5 million or 9.74% of net sales. This compares to a non-GAAP EBT of $148.6 million or 5.7% of net sales in 2019, an increase of $201.9 million or 404 basis points as a percentage of net sales. In fact, over the past two years, we have returned nearly $2.4 billion to shareholders, which included approximately $1.6 billion of share repurchases and $766 million of dividend, all while continuing to invest in the profitable growth of our business. And specifically due to the experience we've had with House of Sport, the fact that the three experiences that we built as really concept stores have become scalable, highly profitable, more sales, more profit, both on a total basis as well as a square footage basis, we are leaning into that growth."
}