{
    "symbol": "GIC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 21:35:04",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to the Global Industrial's Second Quarter 2022 Earnings Call. Thank you, and welcome to the Global Industrial second quarter 2022 earnings call. Leading today's call will be Barry Litwin, Chief Executive Officer; and Tex Clark, Senior Vice President and Chief Financial Officer. It should be understood that actual results could differ materially from those projected due to a number of factors, including those described under the forward-looking statements caption and under Risk Factors in the company's annual report on Form 10-K and quarterly reports on Form 10-Q. Revenue reached a quarterly record of over $318 million, growing nearly 17% with solid demand throughout the quarter. Gross margins remained healthy but pulled back from the record performance in the first quarter of this year, reflecting the impact of freight fuel surcharges, certain promotional activities on excess and seasonal stock as well the flow-through of some higher-cost inventory. In terms of our bottom line performance, we delivered solid operating leverage and generated over $30 million in operating income, a 23% increase from the year ago quarter. Overall, we were very pleased with our second quarter performance as we made further progress on key digital, sales, marketing, customer and distribution initiatives. We remain focused on new business development, which is reflected by our expansion into additional end markets and sales channels. Our one-to-one managed sales team continues to drive our growth, and we are making investments in tools and technology to empower our team, putting the right data in their hands to improve efficiencies and enhance their value as a resource and partner to our customers. Recently, we commenced the launch of a new digital e-commerce platform, which we are rolling out to customers in a phased approach. It's been a tremendous undertaking, drawing talent from across the company to deliver a better experience for our customers. It includes easier mobile navigation, personalized recommendations, auto reorder functionality, faster checkout and the addition of pertinent knowledge center content to product category pages to name just a few of the new features. In June, we held Global Industrials National Trade Show in New Orleans. This highlights the direct impact of the customer-focused as initiative, the investments we're making and the value our associates deliver every day. As we enter the second half of the year, we remain focused on driving operational excellence, furthering our digital transformation and investing in private brand, logistics and our people. While there remains a good deal of uncertainty around the economy, we have tremendous flexibility in our operations and have proven our ability to react quickly and proactively manage the business during the past several years. I'm pleased with the progress we have made this year, excited for the numerous opportunities we have in front of us and believe we remain well positioned to drive strong bottom line performance and value for our stakeholders over the long term. In the second quarter, revenue was $318.5 million, a quarterly record and increased 16.8% over Q2 of last year. Gross profit for the quarter was $113 million, up 15.3% from last year. Gross margin was 35.5%, off 50 basis points from the prior year. As highlighted in previous quarters, we chose to prioritize product availability for our customers during a time of substantial supply chain disruption. As supply chain reliability has stabilized, ocean costs moderated and inventory availability improved, we are actively working to lower inventory to more historical levels. We continue to believe that long-term margin gains are achievable as we drive higher-margin sourcing channels, continue to invest in pricing analytics and working to optimize our freight profile. Selling, distribution and administrative spending in the quarter was $82.5 million or 25.9% of net sales, an improvement of 100 basis points from last year. We continue to maintain strong cost controls but expect to see higher levels of SG&A in the second half of 2022, primarily due to the expansion of our Canadian distribution network as well continued investments in e-commerce and other technology enhancements. We recognized initial costs from this new Canadian facility late in the quarter, and we'll see an increase in these costs as we continue to build out and transition operations from the current DC throughout the second half of the year. Operating income from continuing operations was $30.5 million in the second quarter, a 23.5% improvement from the year ago period. Total depreciation and amortization expense in the quarter was $0.9 million, while capital expenditures were $1 million. We continue to expect 2022 capital expenditures in the range of $7 million to $9 million, inclusive of the new distribution center in Canada. As of June 30, we had over $23 million in cash, $30 million of debt and over $41 million of availability under our $75 million credit facility. As a result, our Board of Directors declared a quarterly dividend of $0.18 per share of common stock, and we anticipate continuing a regular quarterly dividend in the future. Just wondering as far as pricing versus volume in the quarter, I just wanted to get a better handle on that, if you can. We definitely saw pricing and volume moving both in a positive direction during the period, which was nice to see. And I think certainly, as we continue to drive more and more item availability, which is improving sequentially quarter-over-quarter, we'll continue to see both those moving in a strong direction, particularly on the volume side. Just looking at the MRO market, it seems like you've continued to certainly outpace that. We saw good strong growth on the category side, both in core and private brand. As you mentioned, our goal is to drive above-market growth in the long term. I think some of the growth that we definitely saw came from a few places, traditional small and midsized customer base. We also saw continued growth from our larger enterprise accounts, which is really starting to do a nice job for us in helping our top line. And we're starting to see some new growth coming from our new health care channel, which actually launched in May. We're in early stages of that, but it's doing nicely. At the end of the day, our managed sales team has been really strong in leading our growth. I think as I mentioned in some of the early comments, they provide a really strong personalized, high-touch customer experience. And as we continue to expand our customer base, we like the solutions that they deliver and generally results in great revenue growth for us. So Barry, as you mentioned that, obviously, there's a lot of uncertainty about the economy, where we go through here. Certainly, that's on everybody's mind this day -- these days. But at the same time, I've not seen any necessarily differential in of the end markets. So -- but we're constantly asking our sales organization, customer sentiment. It's one of the questions that I had each week, how our customers feeling, are we seeing budgets tighten, those types of questions. So the minute we start to see anything, we'll react appropriately, but definitely a great question. I mean we are starting to see on the freight side, particularly on ocean, starting to come down. They're not at where we saw in 2019, but they are starting to succeed a little bit. Like I said, it's not to, let's say, 2019 levels. But I think that that's reflected in some of the improvements in item availability for us, particularly items coming from overseas. And as we start to see item availability improve and some of the costs come down, that, like I said, is going to give us more flexibility as we get in the later quarters of the year. I feel like we're at the top, and we'll kind of -- we'll keep playing it day by day. And since you mentioned container rates, I think they've come down quite a bit, at least on a spot basis. So with the container rates, obviously, they have come down from the peaks that we saw in the kind of late winter or late fall, early winter and through the first quarter. And as we think about that, that's a component of our cost of goods sold. So as we think about our inventory levels managed through the inventory through our FIFO layers as that inventory starts to flow through lower cost, we do have the ability to be more flexible in our pricing. And obviously, competitive pricing is always that leading North Star with how we want to price our products and really be able make sure we're there for our customers, have the right product in stock at the right time. So again, as those costs do come down, be continuing monitoring and really monitoring the market and the industry and see how quickly we can pass that back through. As that market cost comes down on those container rates, again, we do hope that we can be able to pass that back to our customers. I mean I think as mentioned to you, we're kind of at the apex on inflation. And certainly, we're pushing through a lot of our high-cost inventory to get that flow through, so we can access some of those lower-cost FIFO layers into the outer period. I think we've got kind of an extra chip in our effort to be able to go at that piece, and it's moving nicely. Hopefully, some of carriers start to come off of some of the incremental fuel costs that they've implied during the period. As costs come down in the back half, like ocean freight and other areas, like I said, I think it's going to give us additional price flexibility, either we take it to the customer or we take it ourselves to margin. And this will conclude our question-and-answer session, also concluding today's call."
}