{
    "symbol": "GIC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 21:23:05",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to Global Industrial's First Quarter 2022 Earnings Call. Leading today's call will be Barry Litwin, Chief Executive Officer; and Tex Clark, Senior Vice President and Chief Financial Officer. It should be understood that actual results could differ materially from those projected due to a number of factors, including those described under the Forward-Looking Statements caption and under Risk Factors in the company's annual report on Form 10-K and quarterly reports on Form 10-Q. We delivered an exceptional first quarter performance with record revenue and profitability, driven by strong demand and excellent execution across the business. For the third consecutive quarter, we delivered record gross margin, which reached 37.4% in the quarter. Looking at our results on a 12 month basis, we achieved double-digit operating margin for the first time. It was truly a terrific quarter for Global Industrial and reflects the continued implementation of the ACE strategy; and most importantly, the commitment and efforts of our associates who made it happen. From sales and marketing to digital technology, procurement and distribution, we are enhancing the service we provide and elevating the customer experience. In the second quarter, we expect to launch a new digital e-commerce platform on both desktop and mobile that will redefine how we engage and interact with customers across all digital channels. We remain committed to digital leadership, and this is a ground-up undertaking designed to provide a completely new user interface and customer experience. The team is making continued progress in the development of larger accounts as we look to grow, share of wallet and build new customer relationships. It has been exciting to be a part of the 2022 to NASCAR season, and to capitalize on the benefits this national platform brings to Global Industrial. In Canada, we have seen tremendous growth, which has caused us to exceed the capacity of the current distribution network. In order to support our continued expansion, I'm pleased to announce we have entered into a long-term lease for a new state-of-the-art distribution center in the Greater Toronto area. And this new facility, which is expected to begin operating this fall, will allow us to better service customers by significantly shortening delivery times. Customer demand remains strong, and we believe we are well positioned for long-term growth. We continue to focus on operational excellence, embracing digital transformation, and investing in our people, private brand, and operations. Execution of our ACE strategy is strengthening our customer focused culture, driving top line growth and delivering sustainable improvements in profitability. In the first quarter, revenue is $288.6 million, a quarterly record, and increased 14.9% on a GAAP basis over Q1 of last year. Overall, sales trends were strong throughout the quarter, while open orders increased modestly due to growth in customer demand. Gross profit for the quarter was $107.8 million, up 39.5% from last year. Gross margin was a quarterly record of 37.4%, an improvement of 660 basis points from the prior year, and up 40 basis points on a consecutive quarter basis. Gross margin improvement in the quarter reflects the impact of normalized freight margins as compared to the cost incurred in Q1 2021 related a transition of a new LTL freight partner last year, a continued increase in our balance of sale of our higher margin private brands, the beneficial impact of price rationalization in an inflationary environment, and a reduction in inventory adjustments as compared to a large PPE write-down incurred last year. While we do experience seasonal revenue and margin variations due to product and customer mix, we continue to believe that annual margin gains are SUSTAINABLE Given the ongoing benefit we recognize from an increasing balance of private brand sales. Selling, distribution and administrative spending for the quarter was $78.3 million or 27.1% of net sales, an improvement of 110 basis points as a percentage of sales from last year. We continue to maintain strong cost controls, but expect to see higher levels of SG&A as 2022 progresses as we make growth related investments in key ACE focused areas, including the new distribution center in Canada. Operating income from continuing operations was $29.5 million in the first quarter, a more than 4x improvement from the year ago period. Operating margin expanded 760 basis points to 10.2%, our third consecutive double-digit operating margin performance. Total depreciation and amortization expense in the quarter was $0.9 million, while capital expenditures were $1.1 million. We continue to expect 2022 capital expenditures in the range of $7 million to $9 million, which includes the new Canada DC. Our debt position reflects increased borrowings to meet working capital needs related to inventory investments to support longer lead times in our supply chain, as well as the value of inflationary costs within our inventory. As a result, our Board of Directors declared a quarterly dividend of $0.18 per share of common stock, and we anticipate continuing a regular quarterly dividend in the future. I will tell you, I think I believe that what we're seeing is current sales demand flowing both from just overall business demand we're seeing in the market right now and expansion of our sales organization. Yes, as Barry mentioned, the open order value, really kind of orders that we were taking last period, actually was modestly up but very small. Obviously, we don't give a lot of guidance in terms of current performance, but we continue to see a very robust demand market for ourselves right now. Switching to the inventory balance, I couldn't help, but notice the balance were up about 50% year-over-year, and I also noticed a little a bit more of a short term debt to help float that. The other piece that we really took a significant look at in Q4 as we listened to our customers, and still realize that availability has been still the leading cause for -- or one of the leading reasons to win sales right now, making sure you have the product readily available for your customer. And in order to make sure that we had that product in stock, we did have to increase safety stock levels, because you have longer lead times, which will then overall increase kind of that inventory in transit, inventory on the water, as well as the inventory you're holding in your distribution center ready to fulfill. When we look at kind of at what we think about fill rates, we've definitely seen continued improvements in fill rates looking at from last year into the early part of 2022. It's both in more product because of that lead time, as well as the higher value. The use of use of debt to fund that is I mean, we have a working capital revolver, and we thought that was prudent use of really having that inventory on hand. So while we were drawing more than we had been in the past, we're not overly concerned or it doesn't impact the liquidity of the business. Regarding the gross margin performance in the quarter, obviously, very impressive. Excluding the inventory charge in the prior year quarter, you guys are up 550 basis points. So, Paul, yes, so let's just take out that inventory adjustment that we had called out last year for the PPE product. The biggest factor year-over-year is obviously a full year ramp of our transition from that LTL transition that we did last year on our new -- through deal partner, that was a significant impact in the first quarter of last year. Normalized period, by the end of the second quarter and stayed strong through Q3 and Q4 and really our freight margins have been fairly consistent in the first quarter this year and at a normalized level that's the biggest bucket. And as we've invested in our private label, obviously, we focus on high quality products for our customers, but that also deliver high margin and high margin differential when you look at the sales of those products. And then the third will be going back to that pricing analytics and the things that we really do to be very, very cognitive when we're making decisions on how we price products for the customers, how we're discounting in our managed organization. And just overall, how we are managing the overall portfolio of products to make sure that we rebalance both revenue as well as that gross margin rate. And I think, given price inflation that's in the market when I look across the peer set, I do think that we've been looking at private label balance of sale shift as part of ACE strategy for the last couple years. And I think that's always going to be a positive gain for us, even as pricing starts to adjust in the long-term, I think that's going to be one of the keys for us and why we feel good about sustainment around gross profit levels. In the first quarter, of course, the higher volume and price helped and you guys performed well in the SG&A line. I think SG&A across the board, I mean, we're definitely looking for gaining higher efficiency across the sales organization and the marketing organization relative to SG&A investment. But right now, we've been pretty pleased with the overall efficiency, particularly in sales, marketing, and what we think the DC can help drive in terms of increases in our Canadian business. So the first question, as far as gross margins, seasonally speaking, looks like your Q2 and Q3 have been the highest gross margins for the year. As we sell more cooling in some of those outdoor products that are core to our category sales in the summer months, those typically have a higher private label balance and an overall better margin profile for the organization. Obviously, I'm probably a little bit more cautious, but we know that there the fuel surcharges are quite high when we think about what's going on in the transportation sector. Not unique to us, but it's -- everyone's dealing with that right now. But I think, it's still a bit of a time of uncertainty with some of the external factors that impact gross margin. We've been -- Anthony, I think we've been really very, very close to supply chain challenges over the last year, since we started this back in 2021. Some of our in stock rates continue to climb back which I think is certainly going to help us relative to conversion, and sales growth going forward. We haven't seen material impact at this point, but we're definitely staying on top of it, and it's something we're managing day-to-day in the business. I mean I know you have a little bit of debt on your balance sheet, but it doesn't seem like that should impact your ability to look at M&A. Yes, I mean, I think right now -- and I think we talked a little bit about it last quarter. We're definitely keeping our eyes open relative to strategic acquisitions that can help drive further category growth for us, can help drive further customer growth, along the way that we are driving very hard on our organic growth strategy."
}