{
    "symbol": "AUGX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 22:06:03",
    "content": "  Operator: Hello and welcome to the Augmedix, Inc. 2022 First Quarter Earnings Conference Call. Please note, today’s event is being recorded. Please go ahead, ma’am. Thank you, and thank you all for participating in today’s call. Before we begin, I’d like to remind you that management will make statements during this call that include forward-looking statements within the meaning of federal securities laws, which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Augmedix disclaims any intention or obligation accept as required by law to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. And with that, I’ll turn the call over to Manny. For those new to the Augmedix story, we offer technology and services that reduce the medical note documentation burden for doctors and save them two to three hours a day. Feedback from our clinician customers is that our product is life-changing and brings back the joy of being a doctor again, lost after years of grinding out notes behind a keyboard. We provide two documentation solutions, both of which rely on the ambient conversation between physicians and patients; a real time synchronous solution, which we call Live, and an asynchronous solution, which we call Notes. For Health Enterprise, Augmedix doctors experience higher job satisfaction and can see more patients, which usually generates additional revenue. Additionally, Augmedix continues to benefit from healthcare organization’s investment in digital solutions to improve physician workflows, enable increased capacity, and reduce costs of scale. Turning to our recent financial performance, revenue for the first quarter of 2022 was 7 million, representing a 46% year-over-year increase. During the first quarter, we again made meaningful progress on our growth initiatives by further building on our robust sales pipeline and expanding relationships with our existing enterprise customers. Our existing customers are continuing to buy at a healthy rate, as demonstrated by our high net revenue retention rate. Recall, that we are only scratching the surface of the $6 billion market opportunity, where healthcare organizations already under contract with Augmedix represent an aggregate annual revenue opportunity of over $1 billion. We land within one of these enterprise accounts, we implement our solution among an initial cohort of physicians, who we believe will be prime beneficiaries of our service based on their individual productivity metrics, and we gradually expand our footprint once we demonstrate the targeted ROI. With respect to new products, I’m pleased to announce that we have completed our first ever iOS client application. This is significant, as it will enable us to address some major healthcare enterprises that do not allow Android OS within their networks. Finally, we’ve completed development work on our pre-charting solution, and we’ll initiate beta testing within the coming weeks. It involves extracting relevant historical information from a patient’s health record, and inserting that information into the current chart or medical note prior to the current visit. We expect the initiatives we’re undertaking with existing customers and the pathway we are creating for future customers, combined with the fact that we offer the broadest suite of services in our industry will ensure continued market share gains within the ever-expanding market in which we operate. With that, I’ll now turn the call over to Paul Ginocchio, our Chief Financial Officer, and then we’ll return with closing comments. As stated, revenue for the three months ended March 31, 2022 was 7 million, a 46% increase from the 4.8 million in the same period from a year ago and slightly better than our guidance of 6.9 million. As many of you know, net revenue retention measures what $1 of revenue at our existing clients a year ago, grew into in this most recent quarter; it includes upsells, expansion, and churn that excludes revenue from any new logos that were added during the last 12 months. Average clinicians in service in the first quarter of 2022 rose 53%, as compared to the first quarter of 2021 and the acceleration from the 49% year-on-year growth in the fourth quarter of 2021. We define a clinician in service as an individual doctor, nurse practitioner, or other healthcare professional using either our Live or Notes service. We believe growth in the number of clinicians in service is an indicator of the performance of our business, as it demonstrates our ability to penetrate the market and grow our business. Gross margin for the first quarter of 2020 was 45% as compared to 44% in the corresponding prior year period, and compares to 45% in the fourth quarter of 2021. Adjusted EBITDA, which we calculate by adding back depreciation, amortization, taxes, interest, transaction expenses, one-time items and stock-based compensation to net loss was a loss of 4.7 million in the first quarter of 2022, compared to a loss of 3.7 million in the first quarter of 2021. Just a quick comment on our recent debt refinancing, I’m very pleased to have SVB , as our new lender in relationship bank. We’re excited to have SVB as our bank, as they have helped so many other technology companies grow and scale. Given the strength of our bookings quarter-to-date, in the health of our backlog, we expect revenue growth in the second quarter of 2022 to be in the 41% to 43% range year-over-year, or approximately 7.3 million to 7.4 million. Recall, at scale, we have indicated that we expect Live gross margins to be in the range of 50% to 55% and Notes gross margins to be in the range of 55% to 60%. At this point, I’d like to turn the call back to Manny for closing comments. I and the rest of the Board are truly excited to work with Will, as we continue to build on Augmedix’s leadership position. With that, we’ll now open it up to questions. So coding, we don’t expect to sell separately, or as a menu item, we intend to initially at least bundle it with the existing Live service to further differentiate it from the offerings of our competitors. So that’s really -- I don’t see that being additive to the top line, but it will enable us to, like I said, differentiate ourselves more fully against any other companies that offer a Live service\n Got it. And I think it will probably help – Ryan, it probably also helps -- it will help us with retention as well, so both of those things will help growth. Well, it’s a good question. I mean, we wouldn’t have developed it if there wasn’t a need for it. Two of the largest that are iOS only healthcare systems that we’ve not been able to penetrate because of the Android operating system that we base our architecture on, so having iOS at least opens up the door, the possibility to being able to cater to those healthcare systems. So, hopefully, that’ll prove to be useful to us as we continue to grow. But recently, a huge focus on burnout; improving productivity, as margins are getting hit; retention, given workforce turnover we’re seeing in healthcare and higher wages. But we know that we’re hitting a very sensitive area right now, for the healthcare industry. We’re very well positioned with both solutions, both our Notes and Live solutions to saving doctors a lot of time and stress and burden related to their jobs that comes from documentation. I don’t know what that translates to, in terms of growth, what impact it will have on our growth, but the industry can no longer, I don’t think, sustain its present practice of trying to hire temporary workers to deal with the overload of their permanent staff. I don’t think that’s a sustainable solution, it is much too expensive and they’re increasingly coming under fire, as you probably already know, because you’ve covered the industry, Ryan. And so I think that they’re going to be looking to third parties to help them deal with this problem increasingly, so. I seriously doubt that they’re going to have an issue with us, expanding the operating system of our client application to cater to healthcare systems that don’t -- have not adopted Android. In terms of the Mayo Clinic, the specific opportunity there, we’re aware of it. So, we’re cautiously optimistic that we’ll continue to leverage that relationship going forward. You know, Notes launched in the middle of 2020, it’s growing as a proportion of our clinicians. And, it’s the highest as a percent for bookings, and it is feeding into our clinicians and service. Even though we launched Notes in the middle of 2020, it wasn’t until this year, in fact that it got unlocked. So please keep that in mind, as you’re refining your model. Just wondering if you could talk about the cash burn throughout the year, I think it was about 4.2 million in the first quarter. I think if you look back at our -- last five or six quarters, our burns typically have been between four and five. Thank you very much. Okay, I’ll take the first question Marc. Thank you very much. First one would be, could you just talk a little bit about what you saw sort of month to month during the quarter, and maybe what you saw, as we extended into April in terms of activity, interest, new wins, whatever. So the year started relatively slowly and it’s picked up steam as the year progressed, as the quarter progressed. So we’re, again, cautiously optimistic that the need for our services, our products, amongst the target market that we’re focused on, will continue will persist throughout the rest of the year. Yeah, and that’s really how I see things right now. One is, as we sort of cycled past the end of COVID, at least as we see it, right, this minute, obviously, can come back, but I think most people are reporting that things have returned to normal; and then two the merger between Microsoft and Nuance. So with respect to the COVID question, we’re pleased obviously that COVID does not seem to have as much of an impact on the US healthcare system as it had. I think it’s really, I’d say, neutral right now, as far as our company is concerned, and the impact of it receding in the US has on our company. Longer term, I think it’s a positive thing for the industry, in general. We look at what they do, but we don’t get fixated on a rear view mirror, and we do believe that they’re in our rearview mirror. So I think we’re -- as I’ve said before, on this call, we’re very well positioned with our products. That’s a great question, Brooks. So look, we’re not impervious to the labor situation in the US. Two, the culture here that we’ve developed, you’ve visited our offices, you’ve noticed it firsthand, we have a very collegiate and open culture here, and environment and that that resonates with several candidates as well. I’m not going to say that we -- it’s super easy to hire top notch people, but we have not had trouble hiring the people that we need to hire. And importantly, we haven’t lost any key people knock wood. You didn’t mention it but in my personal view, strong leadership at the top of the company is extremely important. To the consumer, I’m not sure. This is really a product directed at the physician or the physician assistant or medical assistant, because they’re the ones tasked with doing the pre-chart. And the work itself involves just extracting information, historical information from the patient’s EHR, into the current -- populating the current medical note. And then before the physician encounters the patient, they’ll skim through that pre-chart, look for anything that they’ve deemed to be relevant to help them prepare for the questions they’re going to ask the patient. I presume there are, I don’t know of many that do. In fact, I don’t know of any that do but I would imagine that this slot is not unique to us. The need exists, so I’d be surprised if we’re the only ones that do it, but we know that a couple of our major customers have asked for it. Thank you very much."
}