{
    "symbol": "HOPE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 14:51:04",
    "content": " Loan production for the second quarter increased 25% quarter-over-quarter or 44% year-over-year and drove a 16% increase in our loans outstanding on an annualized basis, excluding PPP loans. In terms of pre-provision net revenue, we generated $73.9 million, which represents an increase of 4% from the preceding first quarter and 15% from the year ago second quarter. The $557 million in commercial loan fundings accounted for approximately 43% of our total loan fundings in the second quarter, which represents the progress we have made in strengthening our commercial banking platform and diversifying our business model and loan portfolio. Our corporate banking group generated approximately 90% of our commercial loan fundings during the second quarter, which reflects the progress we have made in moving upmarket and expanding our commercial client base to include more middle market enterprises. We had $545 million of commercial real estate loan production, which also was booked at much higher rates than the preceding first quarter. I will start with our net interest income, which totaled $141.5 million for the second quarter of 2022, an increase of 6.3% from the preceding first quarter. The most significant variance was a 7% increase in our salary and benefit expenses, largely due to the impact of annual merit increases that took effect at the beginning of the second quarter, plus new additions to support the continued growth of the company and higher costs associated with the retaining employees and an extremely competitive staffing market. We recorded a provision for credit losses of $3.2 million, which primarily reflects the growth in the loan portfolio during the second quarter and an adjustment in our outlook utilizing Moody's S2 economic scenario, which has a more recessionary outlook. With the rise in interest rates, the demand for commercial real estate loans is expected to soften in the second half of the year, and we expect to see a lower level of CRE production over the remainder of the year."
}