{
    "symbol": "HOPE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 15:41:04",
    "content": " We generated net income of $60.7 million or $0.50 per share in the first quarter, up 18% from $51.6 million or $0.43 per share in the preceding fourth quarter. For the third consecutive quarter, we had more than $1 billion in total loan production, which is a record high for the first quarter and reflected a 21% increase over the first quarter of last year. Excluding PPP loans, our first quarter originations this year increased 89% over the loan production volume in the 2021 first quarter. The very strong loan production volume in the first quarter led to loan growth of 6.7% on an annualized basis, excluding PPP loans. We had $578 million of commercial real estate loan production, which was down from the seasonally strong fourth quarter production but 86% higher than the first quarter of last year. Excluding warehouse lines, our commercial loan portfolio increased at an annualized rate of 16% during the first quarter. Our SBA loan production for the first quarter totaled $57 million, which was slightly higher than the preceding fourth quarter, while we had a 27% increase in residential mortgage production. Beginning with Slide 5, I will start with our net interest income, which totaled $133.2 million for the first quarter of 2022, which was fairly stable with the preceding fourth quarter but increased 9% year-over-year. So together with a short term lag in the repricing of certain loans of our variable rate loans, we expect the rate hike in May and June would have largely benefit our net interest income beginning of the third quarter of 2022. And then it sounds like with some resurgence this quarter or since the quarter end in terms of the noninterest-bearing DDA, your loan deposit ratio I think was 97% at quarter end, maybe it comes back down a little bit. And also, as I mentioned earlier, the full impact of the variable rate, the 43% of our loans will be in the third quarter, Q3 because some time lag, like i.e., SBA loan is repriced at a quarterly basis."
}