{
    "symbol": "HOPE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 15:01:02",
    "content": " In the fourth quarter, we reported net income of $51.7 million or $0.43 per share, while our pre-provision net revenue or PPNR was $78.1 million, both net income and PPNR were slightly lower than the preceding quarter, primarily associated with an increase in deposit costs attributed to the highly competitive market for deposits. In the fourth quarter, we funded $793 million in new loans, which is lower than the preceding quarter, as it reflects a more selective approach to new loan production and our overall goal to target higher yielding floating loan assets, as well as a lower level loan demand resulting from higher interest rates, particularly for commercial real estate loans. As a result of the lower level loan fundings, we had a slight decline in total loans from the end of the prior quarter, although for the full year total loans increased in excess of 10% or 12.2%, excluding PPP loans, which is in the top range of our estimated target. In the fourth quarter, C&I loans represented 54% of our total loan fundings, and the average rate of new C&I loans increased 162 basis points over the preceding quarter, largely reflecting increase in social rates. As a result, C&I loans as of December 31 of 2022 accounted for 33% of total loans, an increase from 30% a year earlier, and commercial real estate loans decreased to 61% of total loans down from 65% at year-end 2021. Beginning with slide six, I will start with our net interest income, which totaled $150.5 million for the fourth quarter of 2022, representing a decrease of 1.7% from the proceeding third quarter. While we had recognized a 2.1% increase in our average earning assets in the fourth quarter, this increase in interest income from higher earning assets was offset by an increase in deposit cost. The average yield on earning assets -- on interest earning assets increased 70 basis points quarter-over-quarter resulting from the repricing of variable rate loans, as well as higher pricing on new loan production. Moving forward, based on current expectations for interest rate movements, we expect our net interest margin will continue to be pressured in the first quarter of 2023, largely due to our expectation for rising deposit costs as maturing time deposits renew at higher rates and also due to our projection for higher average time deposit balances in the first quarter. Our new loan production in the fourth quarter was comprised of 65% variable rate loans and variable rate loans represented 46% of our total loan portfolio as of December 31st, 2022. Total non-performing assets at December 31st, 2022, decreased 28% quarter-over-quarter to $69 million and reflected reductions in non-accrual lungs, delinquent loans 90 days or more on accrual status and accruing TDRs."
}