{
    "symbol": "HXL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 15:25:03",
    "content": " At this time, I would like to welcome everyone to the Hexcel Third Quarter 2022 Earnings Conference Call. They involve estimates, assumptions, judgments and uncertainties caused by a variety of factors that could cause future actual results or outcomes to differ materially from our forward-looking statements today. Good morning everyone, and thank you for joining us today as we share our third quarter 2022 results, which reflects strong incremental margin performance and another robust step for the full year of progress as we move beyond the pandemic. The poll for Hexcel lightweight advanced composites remains strong in all of our markets and by all indicators will strengthen even more in 2023, and I am confident that we will be ready to meet that challenge. Hexcel has a sustainable competitive advantage, excellent customer relationships and leading sole source positions in key markets with high barriers to entry. With our innovative technology and the broadest aerospace composite product portfolio in the industry, there is no other company in our advanced material space that is better positioned to take advantage of the growth opportunities ahead than Hexcel. In addition to inflationary headwinds and supply chain constraints over the past several months, the third quarter reflects some seasonal customer production slowing, notably in Europe. However, while in August slowdown is typical for European aerospace and defense, that slowing in our sales was amplified this year by our need to train and onboard a larger number of new hires than normal. With time and diligent training, our new Hexcel employees will increase their experience and efficiency and allow us to return to productivity and throughput levels we have historically achieved and more. So while these challenges are real, we wonâ\u0080\u0099t let them distract us from our operational excellence commitment to streamline processes, drive productivity and work efficiently. Our objective remains unchanged to deliver perfect customer performance with respect to quality, on-time delivery and value. Commercial aerospace sales of about $209 million were up 26.5% in constant currency, led by growth in the Airbus A350 and A320 NEO programs. As the market recovers, Hexcel benefits from the continued penetration of lightweight composite materials as well as our relentless commitment to innovate with our customers on new materials and processes for next-generation programs. Our commercial aerospace customers continue to forecast growth in both narrow-body and wide-body programs where Hexcel has strong positions, reflecting robust domestic passenger demand and growing confidence in the return of international travel. As we discussed last quarter, business jets represent a great opportunity for Hexcel over the next few years with launches of new composite-rich business jets. With content on some of the larger business jets nearing that of narrow-bodies, we see nothing but opportunity for greater penetration of advanced composite materials, including the potential for more composite wings like the Dassault Falcon 10x and noise reducing advanced composites that are unique to Hexcelâ\u0080\u0099s portfolio. However, key programs remain strong and year-to-date sales in this market are up almost 5% in constant currency, led by the CH-53K heavy lift helicopter as well as civil rotorcraft, satellites, launchers and rocket motors. Demand for fiber aircraft such as the F-35, Rafael and even the Eurofighter are strong and growing, reflecting strengthening defense budgets around the world. Our expectation is that Space and Defense will grow robustly as build rates increase, and we continue to win positions on existing and new platforms. Hexcel is ready to support both of these exciting new generation programs with our lightweight composite technology, which in time will further strengthen our Space and Defense sales. Offsetting the decline in wind energy is continued growth in other industrial markets, including high-end automotive, marine and recreation. During the quarter, our Hexcel carbon fiber reinforced epoxy prepregs received tight approval from Bureau Veritas, where â\u0080\u0093 which is a world leader in testing, inspection and certification services. As a result, we anticipate increased sales of our composite materials, especially in the manufacturer of mass and other large structural components for wind-assisted ship propulsion. Again, our lightweight advanced composites are playing an integral role in enabling more sustainable, fuel-efficient transportation, whether that is aerospace, automotive or marine, in every case, helping to improve efficiency and reduce emissions. While I canâ\u0080\u0099t share specifics on their work, I can tell you that our scientists are fully dedicated to ensuring that Hexcel proposed the development of advanced lightweight composite solutions to meet our customersâ\u0080\u0099 future demands. Not only do they continue to advance carbon fiber and honeycomb core technology for next-generation programs, theyâ\u0080\u0099re continuing our focus toward end of life and more sustainable solutions. As a reminder, some of our U.S. R&D team are moving their work into our flagship research and technology center at Salt Lake City early in 2023 and I look forward to sharing their technological breakthroughs with you in the future. Year-to-date total Hexcel sales are up almost 22% year-over-year in constant currency and EPS of $0.88 compared to $0.11 this time last year, all of which reflect our strong performance and forward momentum as we enter the final quarter of 2022. As a result, when the dollar strengthens against the euro and the pound, our sales translate lower, while our costs also translate lower, leading to a net benefit to our margins. The continued strengthening of the dollar versus the euro and the pound had a negative year-over-year impact to third quarter 2022 reported sales of approximately $9 million, with the greatest impact being on our industrial business. As a reminder, the year-over-year sales comparisons I will provide are in constant currency, which thereby removes the foreign exchange impact to sales. Third quarter sales have historically been softer than the second quarter as OEM production slows due to summer holidays, particularly in Europe. Space and Defense represented 30% of third quarter sales and totaled $108.9 million, which was essentially unchanged from the same period in 2021. CH-53K and legacy AH-64 increased year-over-year, while F-35, Black Hawk and Space were a bit softer. While automotive, recreation and other industrial markets increased year-over-year, the growth did not offset lower wind energy sales. On a consolidated basis, gross margin for the third quarter was 22.4% compared to 19.8% in the third quarter of 2021, with the improvement reflecting operating leverage. Inflationary pressures continue to remain a headwind, particularly with select raw materials, freight costs, consumables such as packaging and higher energy costs. As Iâ\u0080\u0099ve previously referenced, many of our large raw material purchases are protected by long-term contracts or hedges that are designed to layer in pricing changes over time. Depreciation is our third highest cost category, followed by utility costs, which represent roughly a mid-single digit percentage of total cost of sales. As a percentage of sales, selling, general and administrative expenses and R&T expenses were 11.1% in the current quarter compared to 12.7% in the third quarter of 2021. Now, turning to our two segments, the Composite Materials segment represented 80% of our total sales and generated a 13.5% adjusted operating margin, strengthening on higher capacity utilization as the adjusted operating margin in the comparable period last year was 11.4%. The Engineered Products segment, which is comprised of our structures and engineered core businesses, represented 20% of total sales and generated an 8.3% adjusted operating margin. I would also like to note that the year-to-date adjusted operating margin for Engineered Products is now 11.5%, compared to 7.1% for the same period in 2021, on a similar level of sales, which reflects our move towards higher value-add programs in this part of our business. The effective tax rate for the third quarter of 2022 was 21.4%, which included a discreet tax charge of $1.3 million resulting from the true-up of a deferred tax item. For the 2022 financial year we are now estimating a tax rate of approximately 22%, about 1% lower than previously estimated, principally due to various tax credits being larger than expected. Net cash provided by operating activities was $56.4 million for the first nine months of 2022, compared to $64.2 million for the first nine months of 2021. Working capital was a cash use of $115.0 million year-to-date in 2022, compared to a cash use of $46.0 million for the first nine months of 2021. The increase in capital expenditures reflects higher maintenance CapEx as our capacity utilization expands, combined with growth CapEx, including our previously announced production expansion in Morocco to support Commercial Aerospace and Defense markets, as well as a construction of a new research and technology innovation center in Salt Lake City, Utah to support next generation aircraft and future industrial applications. The remaining authorization under the share repurchase program at September 30, 2022 was $217 million. Before turning the call back to Nick, I would like to review the updated guidance included in the earnings release issued yesterday. Note, foreign exchange is estimated to be approximately a $35 million headwind to our 2022 sales number, assuming exchange rates remain around current levels for the remainder of the year. We have narrowed our adjusted diluted earnings per share guidance to a range of $1.12 to $1.24, reflecting continued strong execution. However, we do not expect to reach the prior guidance of greater than $145 million, primarily due to higher raw material inventory levels as we purposefully increase our safety stock. We will continue to drive productivity and efficiency, and in the near term, we are putting additional focus on training our workforce to deliver the output volume required, while always driving operational excellence. Our space and defense customers are seeing robust and growing demand, and value-add industrial opportunities continue to emerge. We expect this strong growth will continue in the years ahead, especially as air travel returns to pre-pandemic levels globally, and all our markets increasingly turn to the value that lightweight, strong and durable advanced composites provide as the world strives towards lower emission transportation alternatives. As always, our focus remains on delivering excellence to our customers and value to our shareholders. Your line is open. Hey, I just wanted to first ask around the change in the free cash flow guide for the full year. So I mean, itâ\u0080\u0099s a very deliberate decision that we have taken as many companies are taking, really faced with the sort of global supply chain constraints, longer lead time shipping instead of four weeks, itâ\u0080\u0099s eight weeks or six weeks to 12 weeks. And so faced with that uncertainty and with the really great demands that weâ\u0080\u0099ve got in front of us, we want to maximize our sales. So we deliberately chose to build our inventory levels, and that is sort of pulling us down to that range of about a $100 million. I mean, we would have grown into that level of inventory over time anyway. So if anything, is going to strengthen our free cash flow performance in 2023 and beyond. So, as sales grow, our working capital levels would normally grow, but the way I would put it, weâ\u0080\u0099ve accelerated some of that as a buffer, as sort of anticipating the strong demand in front of us and bringing it into 2022. I think itâ\u0080\u0099s very broad, Ken. I mean, obviously that is a factor, but as is sort of the extended China COIVD lockdown, as is still emerging out of the pandemic, as is the industrial ramp up around the world, I mean, I think, itâ\u0080\u0099s a multifactor impact and itâ\u0080\u0099s really just being prudent and smart, we believe, in the face of that to maximize our output in the period ahead. Your line is open. I want to make sure Iâ\u0080\u0099m not misunderstanding the pressure on sales, the decrease in combination with the lower cash flow. With respect to Boeing, if we look at the specific programs, the MAX clearly has been ramping up throughout the year and weâ\u0080\u0099ll align with Boeing and the rate just go over 30 certainly ready to go higher when their supply chain issues eased and when they go up potentially downstream to maybe 38. Again, Boeing has started deliveries back up, that hasnâ\u0080\u0099t really translated into production demand for us, which will in the coming quarter and quarters ahead. And thereâ\u0080\u0099s an expectation there that Boeing will ramp up back to probably starting with the number of five, maybe mid to late next year after they burn off some of the inventory based on the rework thatâ\u0080\u0099s taking place as we speak. I just wanted to make sure that some of this extra inventory, I mean, Patrick, you were very clear, itâ\u0080\u0099s deliberate, youâ\u0080\u0099re preparing for the future, but I thought some of it might be Boeing andâ\u0080¦\n Itâ\u0080\u0099s really not. And again, itâ\u0080\u0099s just â\u0080\u0093 itâ\u0080\u0099s basically protection. And even though it appears to be stabilizing from our perspective, itâ\u0080\u0099s still not back to a consistency where it was pre-pandemic where our plants can run efficiently. And then with respect to the labor and training, bringing new shifts on bringing our assets back online thatâ\u0080\u0099s just taking more time and weâ\u0080\u0099re seeing it improve and it certainly will improve greatly in Q4 and throughout next year. And then just as the follow-up in the past, youâ\u0080\u0099ve talked about getting back to the mid-teens plus operating margins when sales hit that $1.8 billion, $1.9 billion level, but thereâ\u0080\u0099s a lot going on. Well, it â\u0080\u0093 I think Rob, you pointed out that a lot of things have changed with respect to inflations and labor. But Iâ\u0080\u0099m not going to say weâ\u0080\u0099re dipping up on that objective to get to the mid-teens weâ\u0080\u0099re in the $1.8 billion, $1.9 billion revenue range. Your line is open. Hey, in terms of the outlook for industrial, if you think about 2023, a lot of folks think this is going to be a downturn and your business a little bit differently win. The wind story wind kind of changed direction in the U.S. for us, itâ\u0080\u0099s just migrated to a commodity type blade manufacturing and technology, which we had no interest to pursue. Well, clearly weâ\u0080\u0099re expecting pretty strong growth in 2023. Weâ\u0080\u0099re still rolling up the plan, but as we said in the comments, many of the platforms are in the process of ramping up. Certainly, Airbus is ramping up strongly and we see nice growth. Itâ\u0080\u0099s a little early for us to guide Mike, but weâ\u0080\u0099re in the process of recruiting. I can say for one of the first times in my career, Iâ\u0080\u0099ve seen our headcounts go ahead of our plan level and thatâ\u0080\u0099s an indication of our training and trying to get prepared and making sure our workforce is prepared for the growth not only at Q4 but in 2023. Your line is open. Maybe if you could kind of digging down more on those growth numbers as we think about going into next year, I mean, the consensus has got reasonable growth for you guys. I mean if you â\u0080\u0093 I mean, Iâ\u0080\u0099ll split Boeing and Airbus, I mean if I start with Boeing I mean the 787 is clearly, I mean, I donâ\u0080\u0099t know about rate six or seven, but itâ\u0080\u0099s certainly positive going up to five towards the back end of next year from a very low rate today. And then we have Airbus, I mean the 350 is now very solid at five. I mean theyâ\u0080\u0099re not going to keep going up 70% quarter-on-quarter, but itâ\u0080\u0099s a great market for us and it is going to keep growing. Now when the build rates of the widebodies move up and sort to the high-single digit, we are watching, but we are encouraged by the growth in international travel, international passenger demand. I donâ\u0080\u0099t think theyâ\u0080\u0099re big cracks, but overall weâ\u0080\u0099re confident on the narrowbodies. And so, as Nick said, weâ\u0080\u0099re bringing in people, weâ\u0080\u0099re training them up, weâ\u0080\u0099ve brought in raw materials to be ready for this demand that quite honestly weâ\u0080\u0099re struggling to meet right now. This is something weâ\u0080\u0099ve heard consistently across many different companies in the sector, that getting laborâ\u0080\u0099s just been tough, skilled labor, getting labor trained up. And the challenge is getting them trained on our production lanes, whether itâ\u0080\u0099s fiber related or precursor related, which some of those are pretty skilled positions with very good labor rates. So Iâ\u0080\u0099d say finding the people is not a problem, getting them trained and efficient back to where our expectations are, thatâ\u0080\u0099s just taking some time. Your line is open. You obviously anticipated some of the seasonality, but Iâ\u0080\u0099m curious you could quantify sort of the impact of the lower headcount or the lower efficiency of work being done. I think you were at almost 7,000 in 2019 and you ended 2021 just below 5,000. Well, as we approach $2.5 billion, we certainly will miles. If you get specific on where we are, Iâ\u0080\u0099d say both in Europe and the U.S., we brought in probably just less than a hundred over our plan to give you a little color on getting some of those skilled positions trained and in place. So itâ\u0080\u0099s just good business management and operational management to hold a little inventory to make sure we can protect our customers, because the demand is strong. I wouldnâ\u0080\u0099t say, we impacted our customers negatively from slowing their lines down. We did not do that, but we definitely caused the shrinkage of that supply chain and weâ\u0080\u0099ve got to replenish that and thatâ\u0080\u0099s what weâ\u0080\u0099re going to do in Q4 and beyond. So again, weâ\u0080\u0099re just ramping up our lines, bringing the shifts in, getting the assets going, getting our fiber lines, all of them running a 100% across the board both in the U.S. and Europe from a low point in the pandemic where that was the largest area where we reduced our headcount and shutdown our assets miles. So, again, that drives a big portion of our output and certainly thereâ\u0080\u0099s a focus for us going forward. And Patrick, in the third quarter corporate costs, was there a one-time reversal of any size and also sort of maybe just the EPS walk. I mean, obviously, corporate costs are always a bit lumpy miles. I mean, if you look at the year-to-date position, I think with sort of over $10 million a month, which is where I would expect this to be, I think this year Q1 was probably a little bit heavy. Q3 as you were obviously alluding to with a little bit light, we had a sort of, what I would call, a year-to-date realignment cleanup of things like sort of healthcare insurance and workers comp. But I think I always try to look at the year-to-date positions, because if you get too hung up on the quarters, corporate can look a little bit messy. And in the EPS, I mean, youâ\u0080\u0099re talking a PAN, I mean itâ\u0080\u0099s not a lot in the EPS this quarter or â\u0080\u0093 and year-to-date, itâ\u0080\u0099s even less, Myles. I think you can see we probably had $0.01 just over from tax and yes, corporate was like, but what really encourages me and I think is more important or is as important is the gross margin, that sort of factory manufacturing operational performance. And so thatâ\u0080\u0099s what tells me the business is moving in the right direction and we are hitting the margins we should be, even if core has to be a little bit light in Q3. Your line is open. I mean, see, if you look at our history and perhaps we just need to sort of put the pandemic behind us a little bit, but I mean, I look back at the last decade, 2013, 2014, 2015, 2016, all the way back, every Q3 steps down and itâ\u0080\u0099s because of Europe and itâ\u0080\u0099s lighter. I mean, it wasnâ\u0080\u0099t overly significant, I mean, competent materials obviously went down a little bit, but itâ\u0080\u0099s on lower sales. I mean, I actually think we held our margins very well on what a $30 million step down in total for the company quarter-over-quarter. And weâ\u0080\u0099ve always talked to engineered products sort of being a mix, because of programs come and programs go. But I would point you, as I called out in the sort of the repaired comments that were 11.5% versus 7% year-to-date. So Iâ\u0080\u0099m not overly concerned on those lower sales, essentially, itâ\u0080\u0099s a leverage story volume leverage, and as volume steps back up, Iâ\u0080\u0099m sure weâ\u0080\u0099ll drive those volumes â\u0080\u0093 those margins again. Your line is open. Hey, good morning guys. I guess, just maybe back to where Rob was asking on costs and inflation and looking at raw materials, what are you guys able to offset with price. I mean, Michael, we start from and weâ\u0080\u0099ve called it out many times, we have some really good mitigation with major sort of purchase contracts, our major resins and other key raw materials. So that is a great initial protection, and as I said, I mean, raw materials are our biggest cost element. The hedging, as you just mentioned, is around â\u0080\u0093 well, we hedge propylene as a proxy for acrylonitrile, which is our key raw material input for our carbon fibers, again, that smooths our cost. So beyond that, yes, we are not immune to inflationary pressures, and through productivity and efficiency, weâ\u0080\u0099re having to sort of address and overcome that things like freight and utilities and minor raw materials. And as we go forward into 2023 and weâ\u0080\u0099re planning, we put in continuous improvement programs and operational excellence, as weâ\u0080\u0099ve talked to many times, we take on that challenge to overcome those headwinds and to maximize margins as we can. And then just to follow-up, you talked about at one point you took out $150 million of cost. I mean, we havenâ\u0080\u0099t specifically updated, I think weâ\u0080\u0099ve acknowledged that as volumes come back and the low point, I guess, we were a $1.3 billion company as we moved to where we are today and towards $2 billion and beyond. Now, we will try to hold onto as much as we can to ultimately drive sort of better leverage and efficiencies and ultimately push our operating income margins to beyond where they were previously. Your line is open. Well, clearly, weâ\u0080\u0099re watching it closely. Probably the priority weâ\u0080\u0099re keeping an eye on in Germany as you probably know, we have one prepreg site in Germany. So from that standpoint, we think weâ\u0080\u0099re protected. Now if that were to impact from a broader scale, some of the chemical companies in the German region, the indirect impact could be bigger and weâ\u0080\u0099ll just monitor that and our team work dual sourcing and making sure that our supply chain is adequately protected. I mean, I think weâ\u0080\u0099ve called out year-to-date is about 30 basis points. Obviously the fourth quarter stays where we are today, thatâ\u0080\u0099s probably going to nudge up slightly. Especially as we go into 2023, again our objective is to be roughly 75% hedged on our sort of margin GAAP. Our currency exposure, so there is an upside, I mean, itâ\u0080\u0099s hard to call it out year-over-year as we lock in these, I mean, what weâ\u0080\u0099re really doing with hedging is smoothing. But yes, weâ\u0080\u0099ve locked in some of this margin benefit for a period of time is the way I would summarize it. But obviously the dramatic change weâ\u0080\u0099ve seen in 2022 over 2021, well I was about to say something dangerous, we donâ\u0080\u0099t expect to see that again. Who knows, I donâ\u0080\u0099t want to predict the future, but given how much hedging weâ\u0080\u0099ve got locked in, we feel in a good place with our FX going forward. I mean, if you look back over the last sort of two or three years and average it out, weâ\u0080\u0099re going to be close to that. Your line is open. Hey guys, when you look at working capital headwinds this year, despite that the business is still generating positive free cash flow and youâ\u0080\u0099ve talked about how you expect excess inventory unwind through 2023. When you think about 2023, it should be a higher free cash flow year than 2022 at the very least. I mean, going forward as weâ\u0080\u0099ve been sort of signaling for some time, we are looking towards strong cash generation for a number of years. Our board of directors will continue to review that on a quarterly basis and the level, and weâ\u0080\u0099ll do that as we go into 2023. Now in a disciplined way, we will always look at M&A opportunities and if we can repeat something like our technologies weâ\u0080\u0099d be excited to do that. I mean, I think itâ\u0080\u0099s too, we donâ\u0080\u0099t have anything specific to signal today, but with the cash we will have in 2023 and beyond, that will definitely be on the agenda, yes. Your line is open. Hey, good morning guys. So with respect to the guidance, our midpoint gives you really the four core guidance and thatâ\u0080\u0099s what I would recommend use. Well clearly our rate on training, efficiency and throughput catching up some of that delivery in Q3 that we talked about that we couldnâ\u0080\u0099t get out of the shop, that certainly could help push us above the midpoint. So not to say that something couldnâ\u0080\u0099t happen, but it seems less likely that the downside would be at risk. there really is not one of the many customers, I think we have 40 to 50 different shift tools for the 350. If you look at all the sites we ship into, so a Spirit or some of the other Tier 1s, Tier 2s, itâ\u0080\u0099s spread pretty widely across that supply chain. I mean, the 87 certainly had fewer and different mix of the products, but thereâ\u0080\u0099s not a specific Tier 1 that stands out that I would highlight that drives the majority. Obviously weâ\u0080\u0099ve got excellent engine into sell content, so that is one of the big drivers in supply chain poles. Your line is open. Good morning Nick and Patrick., I want to follow up on the last question about margins. When we think about the implied Q4 margin of 9.5% versus the 10.5% or so youâ\u0080\u0099ve done year-to-date, what drives you down 100 bps quarter-over â\u0080\u0093 in the fourth quarter? You obviously backed into that from the annual numbers, which is a range. I understand how mechanically youâ\u0080\u0099ve backed into that number, but we are going to push margins and EPS in the fourth quarter as strongly as we can. And weâ\u0080\u0099re definitely aiming for, for double-digit operating margins as we go forward. I donâ\u0080\u0099t think now weâ\u0080\u0099re going to get to that sort of top rate 156 next year, but I think weâ\u0080\u0099re not going to be far off there and we still see it as a very positive and significant program from us. And with the CH-53K growing strongly and military budgets generally improving, we see space and defense continuing to be a solid sort of market for us. Your line is open. So first, could you discuss a bit more about share gain opportunities for your end markets. Itâ\u0080\u0099s really positioning for the next new engine missile, Wing or new entire aircraft. On the space and defense, there are opportunities, thereâ\u0080\u0099s new programs as well as things like the CH-53K ramp that we announced, which was a nice win, a nice technology and high growth area for our camp site, our engineered product site. And again, when we were in the process of transitioning the Boeing, more commoditized type work to our joint center in Malaysia, that was always the strategy was backfill that with higher margin, higher technical requirement type products and solutions. Clearly our focus is on new platforms, Flora, Fara  weâ\u0080\u0099ve got great positions with both of the competitors in that. And then industrial, industrial weâ\u0080\u0099re very selective there. And the areas looking for lightweight, durable, composite type materials just continues to expand transportation. Recreation remains strong, so thereâ\u0080\u0099s a whole host of sub-segments in the industrial that our team continue to monitor, and weâ\u0080\u0099re selectively going there and positioning our technology for long-term sustainable growth and profitability. Just real quick Patrick with respect to your comments about debt levels and pay down, Iâ\u0080\u0099m just wondering if youâ\u0080\u0099re now thinking that youâ\u0080\u0099re pretty close to an optimal capital structure. I mean, weâ\u0080\u0099re going to generate cash."
}