{
    "symbol": "BN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 14:38:11",
    "content": " Distributable earnings or DE were $1.2 billion, and DE before realizations were $947 million, up 28% from the prior year quarter, and that's supported by the growth in our asset management franchise and strong underlying performance across the business. The growth in fee-bearing capital directly resulted in higher fee-related earnings, which grew by 21% in the quarter to $501 million and $2 billion over the last 12 months. Despite recent market volatility, our capital recycling activities across our mature investments continue to remain strong, and we are on track to realize up to $1 billion of realized carried interest during the year. Today, we have approximately $725 billion of assets under management and fee-bearing capital of $380 billion and have delivered excellent returns to our clients and the capital that we have invested alongside our clients has benefited, compounding at north of 15% returns and now stands at $75 billion gross, around $60 billion net. For our asset management business, our plan is to more than double our fee-bearing capital over the next 5 years to over $800 billion, which will in turn more than double our fee revenues. The corporation will initially own 75% of the asset management business, which we value at around $60 billion. We've taken just over $2 billion of annualized carried interest, around 2.2 at 10x multiple, and then the 5 of accumulated unrealized, and that gets us to the gross value, and we used the midpoint of the range for right numbers, $80 billion, and at 25%, that's the $20 billion. And I think as it relates to fee-bearing capital, it'd probably be around $20 billion of fee-bearing capital, and once fully deployed into all the strategies, that would be around $45 million of annualized fees, but it will take a little bit of time to ramp up to that as we get the capital deployed into the various strategies across the business."
}