{
    "symbol": "MUX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 15:18:03",
    "content": " In Nevada, looking at Gold Bar, our cash costs were $1,712 ounce and all-in sustaining at $2,049 an ounce, although these figures are down slightly from the first half of the year, they remain elevated compared to the prior year due to low production levels resulting from carbonaceous ore issues and are well above spot gold prices. Finally, looking at our 49% cone San Jose mine in Argentina, they generally had a good quarter with cash costs of $1,223 per ounce and all-in sustaining costs of $1,562 an ounce, which a significant improvement from the first half of the year where they experienced COVID related production issues as well as  the San Jose mind during the quarter. We produced 9,000 gold equivalent ounces in the quarter, but what we need to do is increase the rate in the processing plant so that we can decrease the amount of stockpiled or the mine itself is in a very sweet spot of the mining life where any mines find themselves from time to time and where we can produce more or then we can in fact process at this time. The Elder Creek property in Nevada consists of 577 unpatented mining plants  Itâ\u0080\u0099s perspective for porphyry copper mineralization and workplace in the district hosting several large copper and gold mines, including Nevada Gold Mine, Copper and Fenix. On September 6, 2022, McEwen Copper signing option to earn sheet with Rio Tintoâ\u0080\u0099s subsidiary, Kennecott Exploration to earn a 60% interest in the other three properties in the Nevada , by investing $80 million in the next seven years. Your line is open. So this process plant as I said earlier is a 7,000 ton a day plant that was used to operate a gold core Los Azules mine, that mine ran for approximately seven years. I would suggest that the value of â\u0080\u0093 if that plant was somewhere where you were going to build a 7,000 ton a day plant, then it would probably save you in the order of $40 million because the mine only operated for six or seven years, and so the plant is basically brand new. Your line is open. Your line is open. Your line is open. Your line is open."
}