{
    "symbol": "CGC",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-05 12:12:13",
    "content": " Consumer products segment's adjusted gross margin of 34% was an improvement compared to 32% a year ago, as the negative mix shift driven by lower Storz & Bickel sales was offset by improved gross margin performance at BioSteel, driven in part by volume growth. However, adjusting for the disposition of C3 and the impact of payroll subsidy benefit, which was significantly lower in Q1 of fiscal 2023 versus 2022, SG&A expenses in the first quarter decreased by 13% or $16 million on a year-over-year basis. We continue to expect the execution of our premiumization strategy in Canada, our cost savings initiatives and growth in BioSteel and Storz & Bickel will over time result in strong revenue growth and margin profile, and free cash flow generation, that are in line with premium branded CPG Company. And while the distributor challenges and economic conditions in the first quarter created some headwinds for Storz & Bickel, we're actively working to address US distribution and to opportunistically use marketing investments to drive growth, joined with innovation efforts. Second, we continue to expect fiscal 2023 to show improvement in our profitability with expectation of the year being a transition year, as we work towards profitability, building on the cost structure improvement we've seen in the first quarter, while also making strategic investments in key growth areas of our business. Maybe the only add that I would have is that, we need to continue to focus on a few key things were -- a few key areas where we feel we can win, which is building premium and mainstream brands on both sides of the border and continuing to build out our go-to-market capabilities as evidenced by the work we've been doing in Canada with what we refer to as our ground game, where we're out at retail and we're engaging with our retailers and our budtenders. So, I think when you take all of that together, it's really reducing the cash burn as much as we can and we've talked about our target of achieving positive adjusted EBITDA in fiscal '24, with the exception of the investments that we're making in BioSteel and US THC, modest CapEx, and then it's really the interest payment that we are incurring."
}