{
    "symbol": "CGC",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-09 11:45:28",
    "content": " Accordingly, in the second quarter, we're reporting our financial results for the following five reportable segments: one, Canada cannabis; two, Rest of World's cannabis, which includes US CBD business; Three, Storz & Bickel; four, BioSteel; and five, This Works. On a consolidated basis, gross margin improved in Q2 versus the prior year and sequentially versus Q1, as we continue to improve our product mix in Canada cannabis segment and execute on our cost savings programs, where we have committed to delivering savings of CAD 30 million to CAD 50 million in cost of goods sold. Adjusting for the impact of the acquisition cost, the disposition of C3, which contributed CAD 3 million to SG&A in Q2 of fiscal '22, and the impact of the payroll subsidy benefit, which positively impacted SG&A by $11 million in Q2 fiscal '22 and zero in Q2 of fiscal '23, SG&A expenses in the second quarter decreased by 15% or CAD 20 million year-over-year. Second, we expect the balance of fiscal 2023 to show continued progress in our profitability with expectation of this year being a transition year as we work towards profitability, building on the cost structure improvement as we've seen in the first half, while also making strategic investments in key growth areas of our business. And as we continue to improve our focus on our Canadian business, and once Canopy USA closes the acquisition of Acreage, Jetty and Wana, we expect Canopy's global cannabis business to be profitable on a consolidated adjusted EBITDA basis. We continue to invest in high potential opportunities, particularly in BioSteel business, which is seeing strong results and we expect Canopy USA to meaningfully improve Canopy's growth and profitability over time. And then, if you layer in then potentially, the positive adjusted EBITDA that the Caopy USA could bring, you're really looking at a business that we think is pretty attractive from both growth and profitability standpoint."
}