{
    "symbol": "HOLX",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-01 19:46:05",
    "content": "  Operator: Good afternoon, and welcome to Hologic's First Quarter Fiscal 2023 Earnings Conference Call. My name is Justin, and I am your operator for today's call. With me today are Steve McMillan, the company's Chairman, President and Chief Executive Officer; and Karleen Oberton, our Chief Financial Officer. Two of these non-GAAP measures are: one, organic revenue, which we define as constant currency revenue excluding the divested Blood Screening business and revenue from acquired businesses owned by Hologic for less than one year. And two, organic revenue, excluding COVID-19, which excludes COVID-19 assay revenue, revenue related to COVID-19 and sales from discontinued product in Diagnostics. Finally, any percentage change we discuss will be on a year-over-year basis and revenue growth rates will be in constant currency unless otherwise noted. Now, I'd like to turn the call over to Steve MacMillan, Hologic's CEO. Our results highlight the strength of our three divisions, the power of our commercial channels and the increasing impact of our transformative growth drivers from R&D and acquisitions. For the quarter, total revenue was $1.07 billion and non-GAAP earnings per share was $1.07, both above the high end of our guidance. Diagnostics grew 15.8%, powered by molecular diagnostics, which grew 24.5%. And Breast Health finished the quarter down only 5.2%, a signal that our recovery from chip related supply chain headwinds is indeed underway. While the extra days contributed approximately 250 basis points of growth net, even without the extra days, Diagnostics and Surgical both grew double digits and Breast Health exceeded prior guidance. All in, we are well positioned to achieve our full year guidance of low double digit organic growth ex-COVID in all three of our franchises, well above our 5% to 7% long term growth rate. First, we'll build on the thesis from our JPMorgan presentation three weeks ago, a theme that encapsulates how we improve women's health globally, drive our commercial success and elevate Hologic's reputation at the same time. Second, we'll highlight the transformation of our business and showcase the growth we are driving in each division, which we hope is now becoming much more evident in recent quarters. At Hologic, we have an unparalleled commitment to women's health. Most importantly, it unifies and inspires our thousands of employees around the world and points our talented workforce in one singular direction, to elevate women's health, where we have leadership positions in each segment in which we operate. We've earned our access through our leadership in women's health, our pioneering Hologic Global Women's Health Index and our outstanding response to COVID that continues today. As we've grown our business, we have significantly elevated the Hologic brand around the world. With our engagement at Davos, making powerful connections and building strong relationships, combined with recognition from our global partnership with the Women's Tennis Association. Which in turn helps us attract the best and the brightest to the Hologic team, an important advantage in today's labor market. Quite frankly, the best thing we can do for the world and also for our business is to raise awareness and opportunities for women's health globally. For a sense of scale, there are approximately 170 million women in the US, our largest market. And as the importance of women's health is elevated and these markets grow, Hologic will be there at each step along the way. Shifting gears to our second topic, understanding the growth that is driving our business. To answer this question, we will first reflect on our business transformation, a powerful mix of organic innovation, and strategic tuck in acquisitions. Second, we will discuss each division and highlight examples of our growth engines and the multitude of market strategies deployed across each division. Two, meet the world's needs for highly accurate molecular diagnostic COVID testing, which we continue today. Under the cloud of COVID, while successfully deploying Panthers and producing our COVID assays, we strengthened Hologic for the long term, to a level higher than even we had imagined prior to the pandemic. As a result, we've had continuous new product releases that have fundamentally transformed our business and boosted our growth profile. Now as the COVID cloud begins to clear, it is increasingly more evident that we are geared for success, geared for growth and geared to sustained performance over the long term. Next, to fully appreciate our growth potential is to understand the transformation and diversification of our portfolio and growth strategies. These resilient core franchises are backed by long established clinical needs and commercial relationships, which provide a rock solid foundation to leverage into our newer growth drivers. We leverage our installed bases and customer relationships to advance our newer products, which we expect to both diversify the portfolio and accelerate growth. In Diagnostics, we have leading positions in core women's health product lines, such as STIs, and cervical cancer. Our women's health molecular diagnostics and psychology base drives steady growth and supports positive relationships with top laboratories and key opinion leaders, which opens the door for additional new products. Today, Diagnostics has grown from primarily a US women's health business to a global diagnostic franchise with many more growth drivers. A number beyond what we had even imagined, along with 19 assays and the Fusion system that enables even further menu expansion. More specifically, driving future growth for Diagnostics means leveraging our expanded Panther installed base. We add menu, promote guidelines and drive adoption through our women's health clinical channel. Focusing on our Diagnostics acquisitions, with Biotheranostics we are already seeing solid contributions as we build a new market that is currently minimally penetrated. And with Mobidiag, the Mobidiag platform allows for significant future contributions as we prepare to enter the large and emerging syndromic panel market that is adjacent to our core molecular diagnostics franchise. In Breast Health, revenue from our 3D Mammography equipment and related service represents the core revenue foundation of the division. In doing so, we are creating new markets as with our Brevera breast biopsy system, while also entering existing markets where we compete with clinically differentiated products. In surgical, the business has changed dramatically, evolving from essentially a two product division, to one which is now much more robust and diverse. Last quarter, revenue outside of NovaSure and core MyoSure represented approximately 25% of the division's total compared to only approximately 10% in fiscal 2019. While NovaSure and core MyoSure still formed a strong durable base of the division, the business is far more dynamic than pre-pandemic. We now have meaningful growth drivers outside of these two core product lines from acquisitions, new in-house products and also improvements to existing products. Going a level deeper, the growth in surgical is driven by products like Fluent as well as NovaSure V5, both from our internal R&D efforts. By acquisition, the assessor procedure and the bolder advanced vessel sealing portfolio also diversify and elevate the division's growth trajectory. Finally, our international business is so much stronger and poised for exceptional future growth post pandemic. Bolstering the individual product growth drivers in each division, we continue to penetrate our markets internationally. For example, in the quarter our Diagnostics business ex-COVID and surgical businesses each grew more than 20%. As we've stated before, we expect international growth rates to be accretive to our overall growth rate for years to come. We are now a transformed, much stronger Hologic with more diverse growth drivers across each business and a much larger, more capable international presence. And through our innovative R&D and effective tuck in acquisition strategy, we are well positioned to continue to drive strong sustainable growth for years to come. Our strong performance was once again driven by our diagnostics and surgical businesses with each growing mid-teens organically in the period, excluding COVID-19 revenue. And in Breast Health, we are encouraged by results that show the chip supplies moving in the right direction and that our mammography business is recovering. Our leverage ratio of 0.2 times shows the capital structure that is strong as it has ever been, providing our business a tremendous amount of flexibility for internal investment and capital deployment opportunities. In the first quarter, revenue and profitability once again meaningfully surpassed our estimates, with the balance sheet split between our base business and COVID. Total revenue came in at $1.074 billion, a result more than $100 million higher than the midpoint of our guidance. And non GAAP EPS was $1.07, more than $0.20 higher than the midpoint of our prior guide. In Diagnostics, total revenue of $559.3 million declined 41.2% compared to the prior year. Thus, a more accurate representation of the diagnostics business is to exclude COVID assay revenue, related ancillaries and a small amount of revenue from discontinued products. When making this normalization, we see that organic diagnostics revenue increased 15.8% in the quarter. For the third quarter in a row, we delivered healthy double digit growth. Specifically, molecular diagnostics grew nearly 25% in our first quarter excluding the impact of COVID. For example, the collective revenue of our core STI menu was well above pre pandemic levels in the quarter. In addition, BV/CV/TV had another strong quarter, more than doubling compared to the prior year as our progress continues growing the IVD vaginitis market. Further, our non COVID respiratory portfolio delivered revenue ahead of expectations in the period. Finally, the Biotheranostics contribution to our base molecular performance continues to increase with accretive revenue growth in the quarter. Moving to our COVID results, we generated $127 million of COVID assay revenue in the quarter, exceeding our previous guidance of $75 million. In terms of the COVID assay revenue split by geography, domestic sales led most of our upside and represented nearly 80% of COVID assay revenue in the period. Rounding out Diagnostics, our Cytology and Perinatal businesses increased 1.6% compared to the prior year. In Brest Health, total revenue of $334.2 million was down 5.2%, better than expected. As it relates to our interventional business, revenue was down 8% in the period, driven by lingering supply chain issues outside of chip availability. In surgical, first quarter revenue of $154.1 million grew more than 17%. And excluding the Boulder acquisition, the business grew nearly 15%. In addition to strong performance from MyoSure and better than expected results from NovaSure, the quarter showcased increasing contributions from Fluent and our laparoscopic portfolio of Asessa and Boulder. Lastly, in our Skeletal business, revenue of $26.6 million increased slightly, less than 1% compared to the prior year period. Total operating expenses of $339.4 million in the first quarter increased 1.6%, but were up less than 1% when excluding expenses from Boulder, which closed at the end of November 2021. Putting these pieces together, operating margin for Q1 came in at 31.1% and net margin was 24.9%, both ahead of our previous estimates. More recently, given the stability of our balance sheet and the strength of our business, we have widened our aperture to consider slightly larger EBITDA of generating deals. And as Steve highlighted, in the first quarter we repurchased 1.5 million shares for $100 million. In the second quarter of fiscal 2023, we again expect strong financial results with total revenue in the range of $930 million to $980 million. For all of fiscal 2023, we are increasing our full year guidance and expect total revenue in the range of $3.85 billion to $4 billion, reflecting low double digit organic growth ex-COVID across each of our divisions. To help with constant currency modeling, we are assuming foreign currency exchange headwinds of slightly less than $20 million in the second quarter of 2023 and approximately $50 million for the full year. Turning to our divisions, we are thrilled with the outlook for each business as we continue to anticipate that core diagnostics excluding COVID, Breast Health and Surgical will organically grow low double digits for our fiscal 2023. As a reminder, our molecular diagnostic growth is not predicated on placing more Panther instruments, but rather helping our existing customers grow their business. As we have said consistently, even though Panther placements are likely to slow in the near term, given the huge pull forward during the pandemic, additional placements do not influence the trajectory of our molecular outlook. Closing out on diagnostics, we expect blood revenue of slightly less than $25 million for the year. Moving to Breast Health, we see an improving environment for chip supply and our position is unchanged from last quarter. However, we'd like to make clear that you should not expect an outsized revenue catch up in any particular quarter. Finally in surgical, as evidenced by our first quarter's results, the business has quietly transformed into a dynamic franchise, moving beyond what was once a two product division. Low double digit organic growth for fiscal 2023 will be driven by a combination of MyoSure, the related FluentFluid Management System and our laparoscopic portfolio of Acessa and Boulder. In terms of COVID sales, we expect COVID assay sales to be approximately $50 million in the second quarter of 2023 and $225 million for the full year. For the full year, we continue to expect our non GAAP gross margin percentage to be in the low 60s and our non GAAP operating margin percentage to be approximately 30%. Within this operating margin profile, we have again incorporated elevated inflationary pressures into our guidance of approximately 200 basis points to 250 basis points, which we anticipate will persist throughout our fiscal 2023. In terms of operating expenses, we expect spending to step down starting in our second quarter, given the timing of marketing expenses primarily associated with our WTA partnership. Below operating income, we expect other income net to be an expense of around $50 million for the rest of the year. To conclude, let me wrap up by repeating that our strong first quarter results exceeded our guidance despite a persistent macro uncertain. As we look forward to the remainder of our fiscal 2023, we are excited to showcase our transformed business. So I think the outlook would say that each quarter is roughly 30% operating margin and what you see happening is, you have the marketing expenses coming down from Q1. You have lower COVID revenue, which is a headwind, but then you have higher Breast Health revenue, which is a tailwind. And we maintain at that 30%, again, a little lower than pre pandemic, because we have the higher inflationary costs still anticipated. And then Steve, maybe just on molecular diagnostics, really strong core performance there. Part is just a return of the Panther is being used for the core STI, most of our women's health business. You've got increasing growth in our new product launches, especially BV/CV, which is off to a tremendous start and we said we think will be a major driver of growth. The first is, so you report international molecular sales of $97 million. Karleen, based on your COVID assay disclosures, I think it's like $25 million of international COVID. Prior to the pandemic, it was like $30 million a quarter. So we have, as you said, that number includes the COVID assay revenues. But I think certainly we're seeing the uptake, again, with newer customers in more than COVID. I think we -- as we think about international molecular, we would think that that is going to grow a little faster than U.S. given the commercial investments that we've made there and the Panther placements. We placed a lot of Panthers with so many, especially in the European countries as we responded with COVID and every one of those was coming with trailing shift over to the STI business. I think that's actually like the largest first quarter you've had, at least several years. International still seeing some pressure, but I'm just trying to juxtapose this versus your comment about you're still seeing ongoing semiconductor pressure. We got a little bit of service revenue in there, because of that extra week in the quarter. But we like where we're coming and we were able to kind of refurb a few more chips, got a few more chips in and we're able to get a little more product out, but we're feeling really good about where we're headed this quarter and for the rest of the year in Breast Health. So just based on your expectations for global COVID testing revenues this year and as we near the end of the U.S. government's DAG program, does COVID testing and reimbursement remain the big needle mover for 2023 operating margins? Yes, I would say that the margin accretion from COVID is less and less dependent on COVID as we move throughout the year and it's going to be more driven by the Breast Health recovery and certainly Q1 to Q2 lower operating expenses, which will persist throughout the year. And then just in terms of M&A, I think if you look at your free cash flow deployment, about 28% over the past five years. Going forward, we're looking across the businesses, all being led by the divisions. But I think what we would say is, we might go a little bit bigger on scale if it brought more EBITDA. But I think we're -- the biggest takeaway frankly is, we're in a position of strength where our base businesses are very strong. And candidly, when I think there's a lot of folks around trying to figure out what they want to be when they grow up right now. So maybe for you, given the low double digit growth rate that you're highlighting here, obviously, the business, all three segments are doing great. I mean, I think we have indicated that we'd be comfortable in a 2 times to 3 times leverage ratio that's something we talked to and supported by our credit agency. It looks like you beat the quarter versus your midpoint of your prior guidance by about $120 million, the annual guide was raised by about $125 million. It's -- we continue to deliver, I can promise you, it has nothing to do with timing of revenue recognition, Vijay. The underlying business is very strong, weâ\u0080\u0099re one quarter in. So we're going to continue to be very prudent, do not underestimate our confidence in our ability to run the business. When I look at Q1, overall underlying organic was 6%, they hit double digits for the year, the base has to do clean stroke at the back half. But fundamentally, what's driving it, we sort of answered this I think earlier. We placed a whole bunch of Panthers, almost 1,500 Panthers in COVID time over the last three years. And those are really the main drivers, as well as a little bit of flu and a little bit of viral stuff as we've been penetrating a little more Africa. I mean, I think it is the Panther placements and new customers as well. I think we've talked about in our corporate presentation that of newly acquired customers, 85% are running at least one other assay and over 55% are running at least two other assays. And just running with that, we've seen a lot of players in molecular diagnostics seem to be adding menu in women's health arena. And so, there's a lot of people that can talk a good game and especially let's face it. We face some very formidable competitors, but we always have and we will continue to and we frankly think we continue to innovate things like BB/CV. So Surgical, great to hear about the performance outside of the legacy products and appreciate the detail on the growth drivers this year. But certainly, the percentage growth rate is much higher than the acquisitions building off a smaller base. But at the end of the day, I think the key takeaway is, there's not just one growth driver, there's multiple growth drivers that are driving the success of that business. On Mobidiag, can you just remind us again where things stand in terms of -- I think you had said there's an entry buildup underway ahead of the launch. And then similarly, you highlighted Biotheranostics a couple of times today and obviously, they've got into guidelines. I think on Mobi, Mobi will still be pretty small this year. On Biotheranostics, it's still very small penetration. So the reality is, clearly, it's going to be probably potentially a few hundred million, we're not sure at this point, never great at. When you're creating new markets, it's always really hard because when you go back eight years ago, people ask me, could MyoSure someday be the size of NovaSure. So I think this magic that we have where we really are creating and building markets, it's sometimes hard to fully put a number on it other than to see, we think there's a lot of runway here, a lot. I think on the -- first on CapEx, we continue to stay really close to our sales teams on it. On China, I think what you will see is, probably most of the hospitals in China over the last 60-ish days and probably here for a little period four are probably cutting down on normal procedures as they've been treating the COVID patients. But I think for our business, again, pretty small, but I think that's the kind of macro way I'd be thinking about China right now. And my hunch is, after the Chinese New Year and everything else, they're going to largely come back online and that will start to pick back up probably later this actual calendar quarter. A question, you're talking about 30-ish percent adjusted operating margin for this year. I'm looking at the consensus for 2024, it's about 30.5%. So if you think about prior to the pandemic, what I would say is, our normal operating margin was roughly 30%, 31.5%, very rich margins for our industry. But what I would say is, think about our 5% to 7% top line long term growth rate. We will grow EPS faster than that, so likely low double digits and that EPS growth comes from more than just operating margin expansion. It comes from higher revenue growth, as well as some things that we can do below the line. I've been around this business long enough to watch either divisions or big companies or companies themselves trying to push that operating margin so far that they cut into R&D and you don't see it immediately, but over time your innovation falls. And so, we know a lot of folks want to just keep saying all -- every number go up like that. We're thinking very much as Karleen said about driving the EPS number, but continuing to invest in R&D and not try to drive the operating margin as high as humanly possible. When you think -- you've got Biotheranostics, which is your entry in sort of like the oncology world. I mean there's obviously a lot of real estate out there, but I think pointed out that you don't want to do anything that's super dilutive in those areas. So I go back seven or eight years, liquid biopsy, it's going to be the greatest thing ever and everybody thought by 2018, 2020 this massive thing, we kept saying, look, we just don't know that there's going to be a lot of money made. So we continue and particularly in our acquisitions, everything we look at is thinking about what is the long term value creation from an earnings standpoint, not just a revenue and let's face it. As you well know in this industry as well there's a whole bunch of companies that generate a lot of top line, but no bottom line and they get great valuations when they're standalones. So I also think for all of the promise, the promise never comes as quickly as everybody thinks it's going to do. And I just think as we continue to watch the space, we believe there will be winners that will emerge, but we're still letting some of those play out candidly and try to see it's not just a revenue gain or a number of boxes sold or a number of kits sold or whatever else. And as we said, that's probably at least a 2025-ish event at this point. We're always looking -- at the end of the day, we're thinking about the long term top and bottom line growth. We're very focused on ROIC, a key part of our senior leadership team comp is tied on ROIC, so we look at it on every deal. So again, I think we've got the luxury of time on our side given the strength of underlying business and the strength of our balance sheet, which gives us the chance to be relatively picky around what might be out there. On women's health, so I believe vaginitis drove Q1 growth ex-COVID. If you think about something like BB/CV/TV that we've launched, we discovered and realized about that because we're so tapped into to the key opinion leaders and starting to realize that there are other tests that may be able to be developed that we can bring to the market to bring greater levels of certainty and specificity. And I think when we have that knowledge because we surround those customers, our focused approach certainly benefits as well and I think helps us on the innovation side, the same in 3D mammography and how that's led to better biopsy stuff. So we kind of surround these, call them, large niches, but it's really the insights that we have more with the KOLs that I think does provide us a level of competitive advantage. And staying at women's health, you mentioned future portfolio expansion in Breast Health. We've always been -- we've brought enhanced detectors, enhanced workflow solutions and enhanced imaging along the way and we'll continue that. Yes, I think we focus -- one of the important focus on innovation is patient experience, focus on that as well as machine learning, what we can do to make radiologists more efficient and certainly that's a big issue outside the U.S. where there's much fewer radiologists."
}