{
    "symbol": "ZEPP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-21 09:43:02",
    "content": " I would like to highlight that despite the macro headwinds we faced during the quarter, our self-branded products have returned to their growth trajectory, this 4.2% year-over-year and 35.6% quarter-over-quarter increase in revenue. the macro volatilities and uncertainties, our Q3 revenue coming in-line with our guidance at RMB1.2 billion, down 24.9% year-over-year, which consists of 53.5% of self-branded product sales and 46.5% of Xiaomi product sales versus 38% of the self-branded product sales and 61.4% of Xiaomi product sales in the same period last year. Notably, our self-branded product revenue in the third quarter grew 35.6% sequentially, boosted by our newly launched products, including the new Amazfit GT4 series, the Amazfit Bip 3, Amazfit Bip 3 Pro and the Amazfit Trex 2. Our Q3 gross margin was 19.1%, 1.1 percentage points lower year-over-year, affected by higher freight costs, compared with the same period last year and clearance of our previous generation products, partially offset by higher gross margin coming from our new product introductions. So, what you see here in the mix of our Q2 and Q3 across margin, it actually carries a big chunk of the lower gross margin coming out of clearing our previous generation products, but I think we're looking at the end of this exercise so that our self-branded products gross margin should improve or increase from their current level going forward as we head into the high season in Q4. It was Xiaomi products play in the majority weight of our sales revenue mix and our self-branded, I think Xiaomi used to account for 70% and I think in 2021 was 60% of our overall revenue, but then this year, as we head into Q1, Q2, Q3, I think year to date, we're at more self-branded product stands for around 55-ish of the overall mix, and Xiaomi is actually becoming the minority part of our product mix. And in the meantime, we will try to see if we can get more revenue from the Xiaomi side, and then by playing that mix and then playing it more towards self-branded products accounts for the majority of the revenue mix of the company together in improving the margins of the self-branded products, I think you're going to look at the gross â\u0080\u0093 overall gross margin for the company is going to gradually improve from its current level as we reported in Q3."
}