{
    "symbol": "DOC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:08:06",
    "content": " Physicians Realty Trust continue to deliver stable and reliable cash flow growth during the second quarter, driven by exceptional leasing spreads of 8% on 256,000 square feet of renewals and our asset management team's thoughtful management of operational expenses. In total tenant improvements and incentive packages total just $2.19 per square foot per year on renewals, well below industry averages, as we continue to focus on net effective rent as the most important measure of total leasing performance while tenant retention of 76% is in line with long-term medical office averages. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. That's the way, I'm a little hesitant to say exactly what the commitments are because some in the end maybe determine they're too expensive based upon kind of current market rents but, these are all heavily preleased strategic developments with high revenue outpatient surgical services that the hospitals want to pursue. Please proceed with your question. Please proceed with your question. I guess the question is at the end of the day, if same store cash NOI growth is kind of hanging around that 2% to 3% range with the better leasing environment, could that accelerate or do higher expenses kind of offset that, and you kind of maintain that same sort of cash NOI growth up the next couple of years. Please proceed with your question. And I think, maybe below kind of the historical trends that you guys have kind of performed at as well, wondering if there's anything in that number, that maybe brought it a little bit lower and then kind of just thinking broader higher level, right, it's really positive leasing momentum you guys are doing. Our same-store number that's quarter 1.9 is slightly below our historical average in our rent bump around 2.4% and, as we were mentioning about the leasing results we're really excited about the leasing momentum that we have because what's pulling our same-store down this quarter is a slight dip in our occupancy of that same-store portfolio. So the new developments technically our yield on cost of 6% plus, I'm not sure that's the question you are asking, but that's in the new developments, those numbers tend to be more than 6% and much higher than kind of current acquisition cap rates. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}