{
    "symbol": "BSVN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 13:13:16",
    "content": " We would expect to do what we've always done, which is that 29%, 28%, 30%, and it's driven by our core values of extreme discipline and not making loans to people that are not going to bring deposits to the bank, and so we don't see anything that would change that historical dynamic. Just going back to the last question on the increase in NPAs in the quarter, it doesn't sound like you guys are expecting much of any loss content on the loan that moved to non-performing in the quarter, just given how you're collateralized and secured there. it's â\u0080\u0093 we really probably, I don't want to say should have, but in the May and June timeframe in the second quarter, we weren't sure about how sticky that loan growth was going to be, and so after the acquisition our loan loss reserve had come down, and so what became obvious to us in the third quarter was the loan growth was going to be more sticky and therefore we wanted to be consistent with the way we've always been relative to our loan loss reserves and so that drove a big part of what we did, most of almost what we did. But just in terms of from what Jason described to the previous question in terms of maybe some moderation in loan growth in the fourth quarter, just given some expectations for payoffs to rise, how are you guys kind of thinking about you know where you guys want to manage the loan-to-deposit ratio into next year. Obviously you guys had great deposit growth in the quarter, but it sounds like there may be a near term slowdown in growth, but maybe not necessarily into 2023 just given you know that footprint that you guys operate in and some of the market share gains that we're seeing come through on the loan growth side of things. And so you know it's hard to predict and believe that we would continue with the same loan-to-deposit ratio given our mindset of caution, and so it wouldn't surprise us if we were â\u0080\u0093 were we at 83% in the quarter Kelly? I mean, it wouldn't surprise us if we were in the low 80â\u0080\u0099s and at the same time given our geographic locations and the fact is Nate, as you know, when the stress starts entering the market, we've typically done well relative to being opportunistic with loan opportunities, because entrepreneurs seek opportunities to make acquisitions. And just maybe within that context, lastly Tom, are you guys putting new loans on the books, kind of similar to the portfolio yield or is some of your costs around the margin just given that you're seeing some increasing competitive pressures that are maybe resulting in loan, you know new loans come on the books kind of below the portfolio yield expansion that we saw here in the third quarter?"
}