{
    "symbol": "SHPW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 22:38:03",
    "content": " Before we get started, I'd like to remind everyone that management will be making statements during this call that include forward-looking statements within the meaning of Federal Securities Laws, which are made pursuant to the Safe Harbor Provisions of the Private Securities Litigation Reform Act of 1995. Our forward-looking statements, including without limitation statements regarding our business strategy, future financial and operating performance, projected financial results for the first quarter of 2023, expected growth, impact of recent acquisitions, new offerings, market opportunity and plans for compliance with the NYSE's continued listing standards are based upon current estimates and various assumptions. For description of the risks and uncertainties associated with our business, please see the company's SEC filings, including the company's annual report on Form 10-K for the year ended December 31, 2022. Also, during the course of today's call, we'll refer to adjusted EBITDA, which is a non-GAAP financial measure. There's a reconciliation schedule showing GAAP versus non-GAAP results currently available in our press release issued after market close, which can be found on our website, www.shapeways.com. I'll begin by providing a business update and Alberto Recchi, our CFO, will then discuss our fourth quarter financial results and outlook for the first quarter. We are pleased with our fourth quarter results, which came in as anticipated as we delivered 5% revenue growth in line with our guidance. Notably in 2022, we made a number of investments, which we believe positioned us well for growth. These include new materials, technologies and certifications, enhancing our software platform as well as continuing to refine our focus to those areas that offer the greatest opportunity, particularly enterprise manufacturing solutions and commercializing our software. In 2022, we completed three acquisitions including the successful acquisition and integration of Linear AMS, which accelerated the expansion of our manufacturing capabilities and extended the materials, technologies and certifications that we offer our customers. Building on our years of experience and having made these investments, we believe Shapeways provides an extremely compelling solution for a range of customers, from project-focused engineers to large global enterprises seeking high quality, flexible on-demand manufacturing. Furthermore, we have a meaningful opportunity to capture business from small and medium size manufacturers that are unlikely to invest the capital required to deploy and support their own digital capabilities. Shapeways core competency is in low-volume, high-mix production at scale, a compelling solution in an environment increasingly focused on mass customization and speed of part delivery. As our customers scale, we are able to support their growing needs with traditional methods. I'd like to highlight just a few applications which illustrate the demand for digital manufacturing, particularly in key markets in which we operate such as industrial, medical, automotive, and aerospace. Also, Lockheed Martin and NASA also started using Shapeways in support of Project Dragonfly, leveraging Shapeways to manufacture flight-qualified parts in support of their drone designs. Our pipeline for enterprise opportunities continues to build with growing interest from customers like I just described, including other large Fortune 500 companies, which are seeking manufacturing solutions for various specific needs. We are encouraged by the momentum, as initial qualification orders are moving to scaled production and as customers expand the size and scope of their orders. The other element of our growth story, which makes us particularly excited is commercializing our software. As we've discussed, one of the key differentiators is Shapeways proprietary software, which digitizes the end-to-end process from â\u0080\u009cthrough deliveryâ\u0080\u009d. Our software enables us to offer high quality, low-volume, complex part production, but it is also a valuable tool for global manufacturers, specifically small and medium sized traditional manufacturers that are not able to invest in the capital and time necessary to digitize their businesses. Our software customers can leverage our software tools and services for capabilities such as file upload, instant pricing, checkout optimization, and manufacturing fulfilment. This helps them grow their business by enabling improved customer accessibility, increased productivity, and expanded manufacturing capabilities. In short, moving offline processes online enables a more streamlined process and increases manufacturing throughput, which should enable software customers to expand their manufacturing capabilities and to capture more customer share of wallet, all without having to invest in hardware. We further accelerated our plan phased rollout with the acquisition of MFG and MakerOS, which we completed last year. We are optimistic about the continued growth prospects with a meaningful opportunity to capture revenue through SaaS subscriptions, transaction and processing fees, demand generation services and overflow manufacturing capabilities by Shapeways and other supply chain partners. With regard to our legacy self-service and marketplace e-commerce business, we continue to focus on stabilizing those channels as we continue to see increased competition. As we move through 2023, we remain focused on improving our cash burn while prior prioritizing the initiatives I discussed that we believe will present the greatest opportunity for profitable growth. I would like to thank the entire Shapeways team, our customers, our investors, and all of our stakeholders for the ongoing support. I'll provide a recap of our fourth quarter 2022 performance, give an update on our balance sheet position and provide guidance for the first quarter. In the fourth quarter, revenue increased 5% to $8.7 million compared to $8.3 million in the prior year, in line with our expectations. The increase in revenues was primarily attributable to positive contributions from our software offering, scaling of our additive manufacturing capabilities and traditional manufacturing services. SG&A expenses for the fourth quarter were $7.3 million compared to $7.1 million in the prior year, primarily reflecting increases to personal costs, the recent acquisition and increased professional fees. During the fourth quarter, we largely completed the transition of our manufacturing facility in Long Island City, New York to Livonia, Detroit. Turning to our balance sheet as of December 31, 2022, our cash, cash equivalents and marketable securities totaled $40.4 million. During the quarter, we deployed approximately $6.5 million in cash. As we continue to invest in both new hardware and our go-to market initiatives, we anticipate some continued near-term pressure on gross margins compared to historical levels. Looking ahead for the first quarter of 2023, we anticipate revenues to be in the range of $7.8 million to $8.1 million. As Greg discussed, we believe weâ\u0080\u0099re well-positioned for continued growth. Weâ\u0080\u0099re focused on those areas that offer the greatest opportunity, including enterprise manufacturing solutions and commercializing our software and anticipate and accelerator ramp up in these areas as the year progresses. You may now go ahead. I guess maybe to start in terms of the outlook, what kind of visibility you have in that revenue ramp this year. I donâ\u0080\u0099t know if its pipeline related or new customer related, but what gives you confidence that weâ\u0080\u0099ll see a revenue ramp throughout the year. The second is we have our enterprise business, and this was new and I think the biggest thing for us here is it took us more time than I expected to really build that pipeline and find our go-to-market position. But we are seeing good traction, good pipeline, and sizable order visibility looking forward. Now with that being said, weâ\u0080\u0099re still working to get confidence in being able to kind of stand up and provide a real good guidance on that. And this is interesting because it does have more predictable revenue associated with it, specifically with the SaaS models that weâ\u0080\u0099re rolling out. And as we focus on tightening up our acquisition funnel and focusing on retention and driving lifetime value, weâ\u0080\u0099re starting to get to a place where we feel like we can start to focus on that more and more to be able to provide more guidance. And as we had a little bit of pressure in Q4, weâ\u0080\u0099ll also have that in Q1 as weâ\u0080\u0099ve moved from our Long Island City facility to our Livonia facility and consolidated. But once thatâ\u0080\u0099s complete, weâ\u0080\u0099ll see more of stabilization getting back to the gross margins that we had planned for or that we had expected historically, we planned for this drop in gross margin as of right now just because we have some redundancies in our cost structure. And so once thatâ\u0080\u0099s complete at the end of Q1, weâ\u0080\u0099ll be able to continue to start executing on that. We want to show a path to profitability and we want to be able to do that by driving our revenue, optimizing our gross margin and controlling our costs. On the software piece, specifically, maybe I missed it, but did you give a number of SaaS generating revenue customers associated with that $1.8 million amount? And thereâ\u0080\u0099s some really exciting things that weâ\u0080\u0099re working on and starting to roll out, but the adoption has been very strong and the retention of those customers has been very good. And I think we have a feature rollout strategy that not only allows for increased acquisition and better retention, but itâ\u0080\u0099ll also provide additional revenue lines for the business. But as of right now, right, weâ\u0080\u0099ve completed Q4, weâ\u0080\u0099ve completed â\u0080\u0093 weâ\u0080\u0099re completing Q1, weâ\u0080\u0099re starting to feel better and better about where those models are going. You may now go ahead. Just wondering if you can give us the software revenue exiting the year Q4, just appreciate the color you gave for the full year 2022. But we â\u0080\u0093 as you can do, we started with little and itâ\u0080\u0099s been ramping, so obviously Q4 was significantly higher. I actually â\u0080\u0093 Greg, I actually have a similar question as it relates to the enterprise revenue in Q4. Again, only because itâ\u0080\u0099s such a major focus for you in 2023, itâ\u0080\u0099s just would be useful to know what the starting point or the ending point was for Q4 2022. I think that itâ\u0080\u0099s something that we want to be able to do as we move throughout this year, but we havenâ\u0080\u0099t been able to commit to that yet. And so I think youâ\u0080\u0099re asking good questions, Jim, because itâ\u0080\u0099s about like what that ramp ultimately looks like. But for this earnings call, weâ\u0080\u0099re not providing that level of detail, but weâ\u0080\u0099ll add that I think in the future. So presumably thereâ\u0080\u0099s some meaningful revenues that youâ\u0080\u0099re anticipating in Q1 from that as a percentageâ\u0080¦\n Yes, we havenâ\u0080\u0099t provided any of that detail, but we do have a good pipeline that is closing. What youâ\u0080\u0099ll see is in 2022 that kind of finished out of 60% of our revenue, which in 2021 it was more like 50% of our revenue, you just start to see that growing as a larger percentage. And so that continues to be growing at â\u0080\u0093 letâ\u0080\u0099s call it 18%, 20% CAGR, over the last several years. And so itâ\u0080\u0099s a good, healthy piece of our business. From a revenue perspective, it continues to grow and we will be providing some of that information in the future so that you can see more of what that pipeline looks like and how itâ\u0080\u0099s translating into sales. And so some of the factors also side in my opening remarks, right, that contributed to the increase in SG&A expense will remain valid and will be felt in Q1. Professional fees just being a big bucket of those costs and other spending related to being a public company, which I say remain in line as the previous quarters. First of all, support the ongoing execution of our strategic plan, which Greg just outlined, support our normalized cash burn, which Iâ\u0080\u0099ll talk about in a second, and also positions as well on our path to profitability. Now, as Greg said, weâ\u0080\u0099ll keep aligning our resources right, with the highest opportunity areas to drive revenue growth while, tightly managing our cost structure and aiming to maintain our growth margin levels aligned to what theyâ\u0080\u0099ve been historically. Now from a cash burn perspective, weâ\u0080\u0099re looking to solve for a normalized average cash burn in the range of $4 million to $5 million per quarter. That said, we did point out in the previous call â\u0080\u0093 in last earnings that cash burn in Q4 of last year was going to be slightly higher, right. I cited a second ago, we were able to reduce that by 40% compared to the peaks of two years ago. Now looking prospectively  and to give you some color around Q1 2023 burn, again, we do expect to land above the normalized burn. You may now go ahead. Greg, I think you said itâ\u0080\u0099s roughly the same in Q1 when we bounce back up in Q2. I think looking at Q1, to answer your question, I would probably use Q4 as a proxy. And also, as Greg pointed out, a software which is a 90% plus margin business becomes material right, from a revenue perspective which we will. And maybe just Greg, Iâ\u0080\u0099d love to hear, I know you donâ\u0080\u0099t want to give a lot of guidance, but $1.8 million in software. No, Iâ\u0080\u0099m really excited about the software business and we continue to see it scale. And so we expect to be able to provide a lot more color to what that model looks like as, again this is one of the newer growth initiatives for us. And so, but things have definitely played out as we had hoped in the back half of the year and we're moving into this year with a lot of strong momentum behind the business. You may now go ahead. So in looking in your 10-K just going through direct sales marketplace and software, direct sales were kind of flat year-over-year. But any thoughts just on â\u0080\u0093 does that, again that business has been relatively stable for the past couple of quarters. So to answer your first question, one, the growth that we see in the plan is really coming from enterprise sales and from enterprise manufacturing services and from software. What we are continuing to focus on and we don't want to drop the ball on is our legacy e-commerce business, but we've talked â\u0080\u0093 as we've talked in the past, we know that that channel ultimately has a lot more competition. It's more price sensitive customers, and so as much as we want to maintain that business, which we continue to have some focus on it, it's not going to be the gross driver for the business. The customer qualification process is longer, but once you're complete you're able to really go and tackle those customers. And the second question you had was related to Iâ\u0080\u0099m sorry, I think I may haveâ\u0080¦\n I just, I think you cut, you kind of hit on it. It looks like $1.4 million in 3Q, $1.5 million in 4Q up from 2Q levels. So I wasnâ\u0080\u0099t sure if you felt like maybe that was more of a, kind of stable level. I think, weâ\u0080\u0099ve deployed several different types of metals last year and those have all started to wrap. I think Whirlpool was a really good example, right, where weâ\u0080\u0099re using multiple processes including metal printing to create, injection molds, production injection molds for them which is a very interesting application with conformal cooling and giving them access to, a lot of benefits on scaled production that they wouldnâ\u0080\u0099t be able to do without additive manufacturing technology. But those, I think one of the interesting things is we move into enterprise customers is giving them access to that full capabilities or Shapeways and they can move across products and get access to new technologies and materials and finishes that they may have started with us on one thing and got moved to another."
}