{
    "symbol": "CARA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 20:31:01",
    "content": " I would now like to introduce Matt Murphy, Cara's Manager of Investor Relations. Just after market close today, Cara issued a news release announcing the company's results for the third quarter of 2022. Before we begin, I would like to remind you that during the course of this conference call we will be making certain forward-looking statements about Cara and our programs based on management's current plans and expectations. These statements are being made under the Private Securities Litigation Reform Act of 1995, and they are subject to various risks and uncertainties. Actual results may differ materially due to various factors, and Cara is under no duty to update these statements publicly. Investors should read the risk factors set forth in Cara's 10-K for the year ended December 31, 2021, and the 10-Q for the quarter ended September 30, 2022, and any subsequent reports filed with the SEC. With that said, I'd like to turn the call over to Chris Posner, Cara's Chief Executive Officer. The third quarter was about traction for Cara, where strong execution on our strategy has started to propel us on the road to accelerated growth for years to come. Demand for KORSUVA injection is accelerating, as we anticipated. And demand jumped a hundredfold to over 180,000 vials shipped from wholesalers to clinics. As we outlined last quarter, large dialysis organizations are the key drivers of long-term sustainable demand. And in the third quarter, most of the demand acceleration did come from the LDOs, primarily from Fresenius. For some extra color, almost all Fresenius Medical Care clinics placed an order by the end of the quarter, and we are closely monitoring reorder rates to understand the number of patient starts in all clinics. DaVita  product has been more gradual, which we expected based on similar prior launches in this space. Moreover, we're seeing continued growth at midsize and independent dialysis organizations with high penetration and solid reorder rates. Patients, caregivers, medical providers and our launch partner, CSL Vifor, have relayed very encouraging comments on the clinical benefit from KORSUVA injection. In the third quarter, CSL Vifor launched a comprehensive CKD pruritus awareness program in conjunction with the National Kidney Foundation that includes a CKD-associated pruritus web page, infographics, fact sheets, patient testimonials and a Facebook Live event. This is on the heels of the CKD-associated pruritus awareness programs with the American Kidney Fund and the American Association of Kidney Patients, which were launched in the second quarter. In early October, CSL Vifor conducted a large symposium at the 2022 American Nephrology Nurses Association Fall Meeting. And recently, CSL Vifor had a significant presence at the American Society of Nephrology Annual Meeting with multiple initiatives targeting patients and providers, including a new patient campaign. Overall, after the second full quarter into the U.S. launch, we see significant progress and momentum driven by the acceleration of product demand. We are still early in this launch, and we continue to expect demand and wholesaler shipments to normalize over the coming quarters with some potential quarterly variability in the process. Keeping the big picture in view, the KORSUVA injection launch is on its way, and we are very pleased with how it's progressing. Internationally, Cara has made significant strides in making KORSUVA available globally. In the EU, the Kapruvia launch has started with Germany leading the rollout across the continent. Now our product was also approved in 3Q under the name KORSUVA in Canada and Kapruvia in Singapore and Switzerland, and we expect approval in the last Access Consortium country, Australia, in the coming months. We continue to expect reporting top line data for the CKD program in the second half of 2024, and we are still on target for the internal readout of Part A of the Phase III AD study in the second half of 2023. The late-breaker presentation at the EADV Congress in Milan highlighted difelikefalin's rapid onset of action, which occurred as early as day 1, and its sustained effect throughout the active extension phase to week 12. We have a meeting scheduled with the FDA this quarter to discuss the steps to a pivotal clinical trial program in NP, and we look forward to providing an update on the program in the future, when appropriate. Finally, onto our 16-week proof-of-concept trial in pruritus associated with PBC. Given the continued slow enrollment, we made a strategic decision to discontinue the study and unblind the data. With the potential of NP advancing towards a pivotal program, at this time, we are focusing our resources on building our dermatology franchise and expanding our nephrology franchise. We have significant opportunities in both therapeutic areas, and we are pleased with progress we have made to date. In conclusion, we believe that this quarter has shown that we are continuing to build momentum. This was evident 3 ways this quarter: Product demand is accelerating for KORSUVA injection, we are rapidly moving forward becoming a world leader in pruritus and we are laser-focused on maximizing the potential of oral difelikefalin in nephrology and dermatology. Now I'd like to introduce Ryan Maynard, our new Chief Financial Officer, for his first quarterly earnings call with Cara. Ryan will provide details on our third quarter results, and we'll all be available for your questions after that. As a reminder, the full financial results for the third quarter of 2022 can be found in our press release issued today after the market closed. Total revenue was $10.8 million for the 3 months ended September 30, 2022, compared to $20.3 million for the same period in 2021. Cost of goods sold during the 3 months ended September 30, 2022, was $3.1 million and relates to our commercial supply shipments in the quarter to CSL Vifor. R&D expenses were $24.7 million for the 3 months ended September 30, 2022, compared to $15.5 million in the same period of 2021. G&A expenses were $6.9 million for the 3 months ended September 30, 2022, compared to $5.9 million in the same period of 2021. The higher G&A expenses for the 3 months ended September 30, 2022, were primarily due to increased headcount-related costs as we look to build out the key function to support Cara's growth. Cash, cash equivalents and marketable securities at September 30, 2022, totaled $179.5 million, compared to $236.8 million at December 31, 2021. Finally, we expect that our current unrestricted cash and cash equivalents and available-for-sale marketable securities are sufficient to fund our currently anticipated operating plan into the first half of 2024. I'd like to point out that this is not our forecast for forward-looking KORSUVA revenue, but rather a conservative runway outlook. And with that, Ryan, Jo and I will be happy to take your questions. Shannon, you can now open up the call for questions. The first one is a clarification on the 184,000 or so vials that were sold in the -- or shipped in the third quarter. If it's worldwide, what would the U.S.-only fraction be? On your first question, the 184,000 vials is U.S. only. So that's shipments from the wholesalers to the dialysis clinics in the U.S. On the second question on AD, let me turn that to Jo. Sumant, yes, so for atopic dermatitis, 2 things we'll be sharing: one will be the sample size, and the second will be the dose selected going into Part B and the second pivotal study. Let me answer the last question, and then I'll turn it to Ryan. On your last question, the Fresenius renal sales force really came online in the beginning of the third quarter, so this is reflective of -- the numbers I mentioned are reflective of the Fresenius sales force in the third quarter. You're right, and the margins are very consistent this quarter from last, and I would expect that, that would continue going forward. How much of the $7.4 million revenue is driven by the 184,000 vials represent an increase in demand versus stocking? So Daniel, thanks for your question. So it's important to note that, that $7.4 million of revenue is shipments from Vifor to wholesalers. So that is not the 180,000 that you're talking about, which is wholesalers to clinics. As far as full year guidance for revenue for KORSUVA, we're not yet at the stage. We're at the early innings, we're in the second quarter. We're reporting on the second quarter of launch, and we're not going to give full year KORSUVA revenue guidance. But we did, as you see, give guidance on our runway, which I thought was important to come off of the very conservative guidance we gave in Q2, which is to include 0 KORSUVA revenue. Yes, Daniel, I said in the quarterly -- the 2Q quarterly call, my focus -- our focus is really on demand, on demand generation, that's true kind of in any launch I've ever been a part of. We're really pleased with the acceleration in Q3 in demand that primarily came from Fresenius, as I mentioned. But also, we saw a good acceleration in the MDOs, IDOs, and again, a gradual pickup in DaVita. So in the fourth quarter, our eyes are going to be on demand as well. I'm curious if you could comment on gross to net on IV KORSUVA, trying to get -- trying to make sense of the 184,000 vials shipped from wholesalers to dialysis centers. You have a lot of orders from -- you've orders from -- primarily Fresenius order, almost all of them or almost all the centers they order in 3Q. And with -- how do you see that -- what will be the main driver to get additional IV KORSUVA in DaVita dialysis centers, that would be helpful. Let me pass on the gross to net to Ryan, and I'll come back and address the DaVita. Chi, it's Ryan here again. So the gross to net that we report, and is all that we will report, is shipments from Vifor to wholesalers. And so we're not going to get into the gross to net related to the 180,000 vials that were shipped to the dialysis organizations. And Chi, on DaVita, I mentioned in my prepared remarks that we have seen a major acceleration in customer ramp-up, and that was primarily in the Fresenius clinics, but also we saw a strong acceleration across the other providers, including DaVita. Specific to DaVita, they tend to adopt new products and bring in new products and protocols more gradually. But we expect that ramp-up to continually gain steam, and we've seen an increase in the number of DaVita clinics ordering and, as I mentioned, fully expect this to continue. I'd also point out that KORSUVA is on formulary at DaVita, and they do have protocols in place. And I'd also point out the CSL Vifor, even though they have a very unique and special relationship with Fresenius, they also have a very strong relationship with DaVita, selling them their portfolio of dialysis products. And they even mentioned on their call, CSL Vifor's call, they actually just signed a recent deal on erythropoietin for treatment of anemia with DaVita. So net-net, we're really confident that DaVita is going to continue to gradually adopt this product and bring it in for their patients. Yes, I mentioned -- I mentioned that the third quarter, the bulk of the demand really was in the Fresenius clinics, with also kind of acceleration in the MDOs, IDOs and, to a lesser extent, DaVita. So that's kind of the double-click on demand, if you will, in the third quarter. So I'm not going to comment on how it's being manufactured, and I understand it's lumpy, but you can probably expect a little lumpiness going forward. Yes, I mean, CSL Vifor is our commercial partner. And quite frankly, they are an exceptional partner with exceptional market intimacy in nephrology. And remember, -- and you and I have talked before -- we're building a market and there's nobody better to build a market than somebody with that intimate know-how in the nephrology dialysis space than CSL Vifor. And then we added on, obviously, the Fresenius sales force, and that's a contract between CSL Vifor and Fresenius. And so we're actually incredibly pleased with the dedication of CSL Vifor and Fresenius to building this market, and we're really starting to see the results 2 quarters in. Yes, Stacy, so in terms of kind of the trade inventory and demand, I would expect to see some variability still. I can't give an exact date, but I would expect that to settle down and kind of more equate in 2023. CMS, it's a great question. What they did do, though, is they acknowledged the comments and indicated they're going to consider them as they consider possible future rulemaking to address post-TDAPA reimbursement for innovative drugs. So what we expect is to hear something probably more in the final rule for 2024, which would be this time kind of next year. I'd also say, Stacy, as well, we, Cara, CSL Vifor and other key stakeholders will be -- will continue to be in contact with CMS and doing lobbying efforts, et cetera. And then secondly, you mentioned earlier, Chris, about DaVita and how uptake tends to be -- ordering new product in general tends to be more gradual, if you will. So your first question around expectations for 4Q, obviously, we're not going to give forward-looking guidance. But I would still expect there to be, again, Ryan's word, lumpiness in terms of trade inventory and demand. And in terms of rationale, I mean, just that organization tends to bring on a product more gradually to get experience, adjust their algorithms appropriately. Also, to be clear, DaVita doesn't have a sales force like Fresenius does as well. We are seeing clinics coming on board week to week, and we are seeing those that are coming on board actually having a very strong reorder rate. Yes, Sumant, again, a super question and on the CMS in terms of how they look at utilization. I mean, listen, we're building a market. And really, if you think about the LDOs really just came on board in the third quarter, namely with a strong acceleration of Fresenius. So I would fully expect utilization, obviously, to continue to ramp up. And as we near the end of TDAPA, I think we're going to have a really good -- a really good sense of what sort of patient population we have on KORSUVA that will help CMS in terms of their estimation of potential funding either through kind of the rule-making cycle, potential add-on payment or within the bundle itself. And Sumant, I'll just conclude, too, they typically look at the full 2 years of utilization. And we saw with Parsabiv, I think it was really important, there was an additional year added on to TDAPA to get a good steady state, 2 years of utilization data, to calculate the funding. And really, thank you, everyone, for joining our quarterly call, and we're really excited about where we are as a company in terms of adding both short-term and long-term value. And we'll continue to focus on execution with our partner, with IV KORSUVA and, under Jo's leadership, continue to execute our clinical trial programs."
}