{
    "symbol": "JAGX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-27 14:13:06",
    "content": " The company's actual results may differ materially from those discussed in today's -- during this webcast for a variety of reasons, including those described in forward-looking statements and Risk Factors sections of the company's Form 10-K for the year of 2022 which was filed, March 24, 2023 and its other filings with the SEC which are available on the Investor Relations section of Jaguar's website. Prescription product net revenue was approximately $11.9 million for the year ended December 31, 2022 versus approximately $4.3 million for the previous year ended December 31, 2021, an increase of 178.7%. Regarding the company's cash position, the company had cash of approximately $15.3 million as of March 24, 2023, just a couple of days ago, the filing date of Jaguar's annual report on Form 10-K for the year 2022. Again, what we believe are potentially transformative events in 2023 in support of the company Crofelemer from pipeline opportunities; two, with the potential of important and significant clinical trial results this year, tangible revenue generating patient benefiting, shareholder, stakeholder benefiting product indications our ongoing pivotal Phase III trial, OnTarget trial, called the OnTarget trial of Crofelemer for cancer therapy-related diarrhea and I may refer to that as CTD is our flagship development program. This year, Jaguar and the company we established in Europe, Napo Therapeutics, are planning to support third party and we are supporting third-party investigator-initiated proof-of-concept studies of Crofelemer in patients with SBS with intestinal failure or pediatric patients with MVID focused on obtaining proof-of-concept data showing reduction of requirements of parenteral support, including parenteral nutrition and/or IV fluids. That's the OnTarget trial with a primary endpoint readout expected in Q3 of this year and within the same time frame, we're targeting our first proof-of-concept evidence for patients with either SBS with intestinal failure and/or for MVID in support of potential early access program participation, revenue-generating participation in certain European countries. Prescription product net revenue was approximately $11.9 million for the year ended December 31, 2022 versus approximately $4.3 million for the year ended December 31, 2021, an increase of 178.7%. The loss on the extinguishment of debt increased by $1.4 million from $800,000 for the year 2021 to $2.2 million in 2022 due to the extinguishment loss from the exchange of the outstanding balance of a royalty agreement for shares of the company's common stock. The transition to specialty pharmacy distribution also assists in the preparation of the company's U.S. commercial distribution network for a potential future indication expansion of Crofelemer to other populations of patients with complex medical needs, such as CTD, inflammatory bowel disease and SBS. So I can tell you that we -- what -- I think the most important thing that I can tell you is what I did tell you already that are -- and what's in the public domain here, $15.3 million in the bank right now with those key clinical activities that we're looking for which we feel can be transformative in value in targeted for the third quarter of this year. So there are other indications, other important patient populations to go after in the future which is a very risk-mitigated future drug development strategy for this company because, again, it would be indications if it's Mytesi where we already have the safety, we have the chronic safety, we have the manufacturing, how can we continue to expand the label, how can we continue to expand the population that in the health care providers that Ian can educate and promote to and grow the revenue even further."
}