{
    "symbol": "JAGX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 12:02:06",
    "content": " As you'll hear from Carol, and I'm so pleased to steal her thunder at the moment, we are reporting Mytesi net revenue of approximately $2.6 million in the first quarter of 2022, representing an approximate 24% increase over Mytesi net revenue in the fourth quarter of 2021, which was approximately $2.1 million and approximately a 112% increase over Mytesi net revenue in the first quarter of 2021, which was approximately $1.2 million. After Carol whose thunder I just stole, we'll hear from Ian Wendt, Jaguar 's Chief Commercial Officer, about several new Mytesi related commercial initiatives that we're very excited about, including a tele -health initiative to continue to educate and serve the HIV community and about commercial efforts underway for Canalevia CA1, our prescription drugs,  treat the induced diarrhea, which I'm going to refer to as CID, chemotherapy-induced diarrhea in dogs that received -- and the product received conditional approval from the FDA this past December and became commercially available to veterinarians and their clients in the U.S. to provide comfort and relief to their canine patients at the end of April 2022, just last month. Mytesi, prescription volume, the metric the company believes to be the best indicator of growth in patient demand, increased 14.6% in the first quarter of 2022 over the fourth quarter of 2021, prescription volume differs from invoice sales volume, which reflects among other factors, varying but buying patterns among specialty pharmacies in the closed network as they manage their inventory levels. Mytesi gross revenue, a non-GAAP measure, was approximately $3.4 million in the first quarter of 2022 and $3 million in the fourth quarter of 2021, representing an increase of approximately 400,000 or 13.4% quarter-over-quarter, a decrease of approximately 25.5% over Mytesi revenue, gross revenue that is, in the first quarter of 2021, which was approximately $4.6 million. For the first quarter of 2022, the loss from operations was $11.8 million compared to loss of $8.8 million in the first quarter of 2021, an increase of $3 million quarter-over-quarter largely due to the increased clinical trial activities related to the company's ONTARGET Phase 3 off crofelemer for prophylaxis of cancer therapy-related diarrhea or what we call CTV, as well as development efforts for other indications."
}