{
    "symbol": "CVS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 11:44:05",
    "content": " During this call, we will make certain forward-looking statements reflecting current views related to our future financial performance, future events, industry and market conditions, including impacts related to the ongoing COVID-19 pandemic as well as the expected consumer benefits of our products and services and our financial projections and the benefits of the pending acquisitions of Signify Health and Oak Street Health and the associated integration plans, expected synergies and revenue opportunities. Starting with the Health Care Benefits segment, we grew revenues by more than 11% for the year and delivered adjusted operating income of $6 billion. These Medicare-focused assets complement our established care delivery assets, including our over 1,100 retail health MinuteClinics in a number of ways: creating convenient access and additional clinical capacity for Oak Street with preventive care and chronic care services for seniors; enhancing access to our broad nurse practitioner workforce; and providing wraparound services tailored to seniors and those with complex conditions such as medication reconciliation and post-discharge follow-ups. Thank you, Karen and good morning everyone. Thank you, Karen and good morning everyone. During the fourth quarter, revenue of $43.7 billion increased by 11.2% year-over-year, driven by increased pharmacy claims volume, growth in specialty pharmacy and brand inflation, partially offset by continued client price improvements. Adjusted operating income of $2 billion grew 9% year-over-year driven by improved purchasing economics, including increased contributions from the products and services of the companyâ\u0080\u0099s group purchasing organization, partially offset by continued client price improvements. Adjusted operating income of $1.8 billion declined 25.1% versus prior year, but was largely in line with internal expectations, driven by decreased COVID-19 vaccinations and diagnostic testing, continued pharmacy reimbursement pressure and increased investments in the segmentâ\u0080\u0099s operations and capabilities, including the vast majority of a discretionary bonus payment to frontline colleagues. In our Health Care Benefits segment, we expect to see membership growth of 2% to 4% with increased membership in both Medicare and Commercial, partially offset by declines in Medicaid due to the impact of redeterminations in 2023. We envisioned five main opportunities to realize more than $500 million of value over time: one, accelerating Oak Street patient growth through CVS Health channels; two, improving Oak Streetâ\u0080\u0099s economics through integration with our broad portfolio of assets; three, improving the retention of our Aetna MA members through the improved outcomes and experience provided at Oak Street clinics; four, driving greater utilization of CVS Pharmacy and Caremark capabilities; and five, capturing modest savings from external public company and lease costs. The 2024 and 2025 adjusted EPS trajectories reflect the impact of the previously disclosed 2024 Medicare Star Ratings headwinds in Centene contract loss, closing of the Oak Street Health transaction in 2023 as well as projected contributions from the Signify Health transaction in 2024 and beyond. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}