{
    "symbol": "CACI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-11 15:45:48",
    "content": " For the full year, we delivered revenue growth of 3%, adjusted EBITDA margins of 10.3% and strong free cash flow of nearly $700 million. Your line is open. What we're most focused on is that we've been on this long-term drive to really establish a different looking company that would depend on both expertise and on technology, for us and to not only talk about bottom line growth but also top line growth as well. So, all in all, we are proud of the way we came out of fiscal year 2022 as an overall year, measure looking forward to continue this multiyear growth pattern on our bottom line EBITDA margins very much driven by our entire technology portfolio not just mission tech but on our enterprise tech as well. And by doing that over a long period of time, we'll be a much better solid company, because whether it's top line growth or our bottom line growth or whether we buy shares back or we buy outstanding companies, we're going to drive free cash flow per share and that's what we're absolutely focused on. Your line is open. Look we're -- when we look at the addressable market five-year CAGR, it's about 4.5% this year unlike any other year frankly we've been reviewing the addressable market, and really had to look at some of those factors that are now here that haven't been there in the past things like inflation what the impact of the Ukraine budget was going to be on us at least in our fiscal year 2023 not it was a five-year period. Your line is open. Your line is open. Your line is open. Your line is open. Share repurchases, we'll still be driving incremental free cash flow per share albeit at a slower level, we'll have to repay some kind of interest expense, but it's not going to have a material impact similar to buying or borrowing additional debt to fund acquisitions, whether we're borrowing at kind of 2.5% or 4.5% that should not materially impact our decisions to make those investments. Your line is open. A 4.5% guide to a 7.5% guide in the year that we're looking at the kind of business that we're looking to go after, we're comfortable with that guide because again our job is to make sure we're doing the absolute best that we can to sort of tie where those narrow deep holes are. Your line is open."
}