{
    "symbol": "CACI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-30 16:50:02",
    "content": " At this time, I would like to turn the conference call over to Dan Leckburg, Senior Vice President of Investor Relations for CACI International. I’m Dan Leckburg, Senior Vice President of Investor Relations for CACI, and we thank you for joining us this morning. We are providing presentation slides, so let’s move to Slide #2. With that out of the way, let’s turn to Slide #3, please. To open our discussion this morning, I’ll turn the call over to John Mengucci, President and Chief Executive Officer of CACI. Profitability was healthy with adjusted EBITDA margin of 10.2%, and we generated robust free cash flow of nearly $300 million. We also continue to win new and recompete work with $1.2 billion of contract awards, $568 million of those classified, representing a book-to-bill of 1.5x on a trailing 12-month basis. Our results reflect the short-term headwinds we discussed last quarter, albeit a bit more than expected with funding delays being the key driver. While market trends remain positive in the medium and long term, the short-term headwinds I discussed last quarter still exist, including slower issuance of task orders, supply chain challenges, delayed funding and restricted customer and facility access due to COVID. In fact, our third quarter funding orders are down over $300 million or 20% compared to the same quarter last year. As a result, we are reducing our outlook for fiscal year 2022, which Tom will discuss in more detail shortly. Looking past these short-term funding issues, we have a large and growing addressable market, and the budget environment is even more constructive today than in the recent past. For example, we see increased spending across Defense, where we have a robust footprint, the intelligence community, where approximately 30% of our revenue is generated and important non-DoD customers like DHS, where we provide cyber and applications development. From a capability perspective, we see increased spending in IT modernization across the federal government, the space domain, including photonics and space situation awareness and continued strong spending across the electromagnetic spectrum to include SIGINT, EW and cyber. With those spending priorities as a backdrop, I’ll cover recent investments we have made in IT modernization and space. The bottom line is, our business is performing well on the things under our control. We are delivering with quality, winning new business, driving profitability, generating robust cash flow, investing ahead of need in relevant and differentiated technology, hiring great talent and being recognized in several surveys by our employees as a Great Place to Work. Before I turn things over to Tom, I want to make it clear that our business is performing well and long-term prospects are positive. While we are still going through our FY ‘23 planning process, our preliminary assessment indicates healthy organic growth, profitability and cash flow. We have the capabilities, the contracts, a robust backlog and a track record of winning business to continually delivering shareholder value next year and beyond. With that, I’ll turn the call over to Tom. As our customers begin to execute on what is a fully appropriated budget and get funds on contract to meet critical needs, we expect funding to revert to more normal levels in early FY ‘23. As is our practice, our fiscal year plan and guidance is based on a program-by-program bottoms-up process. This activity is well underway and has provided enough insight for us to be confident that we will be able to generate healthier organic growth, profitability and cash flow in FY ‘23. With that, I’ll turn to our third quarter results and FY ‘22 outlook. We generated revenue of $1.6 billion in the quarter, representing 2.1% growth with organic revenue down approximately 2%. Third quarter adjusted EBITDA margin was 10.2%, below our expectations due primarily to fewer high-margin mission technology sales as a result of the funding issues we spoke of. Our 17.9% tax rate benefited from increased R&D tax credits of approximately $9 million related to FY ‘20 through FY ‘22, which we recognized this quarter. Third quarter cash flow from operations, excluding our accounts receivable purchase facility, was $314 million and free cash flow was $297 million. Excluding the tax benefits, free cash flow for the quarter increased by 26% from a year ago. Our continued focus on working capital management drove DSO to 51 days, demonstrating the consistent and efficient performance of our business. We are updating our fiscal year ‘22 guidance to reflect the short-term funding headwinds, which impact both our third and fourth quarters. When we reported results last quarter, we anticipated that 3% of our revenue would come from new business. A good portion of that was related to material and technology revenue, which did not materialize due to funding issues. While we now have a full year appropriated budget, it is unlikely that funds will be received soon enough to enable us to deliver and recognize any associated revenue by the end of our fiscal year. For fiscal year ‘22, we expect revenue to be between $6.2 billion and $6.25 billion with total revenue growth of 3% on an organic revenue growth of around 1% at the midpoint. Adjusted EBITDA margin to be around 10.5% at the midpoint, reflecting the delays in funding associated with higher-margin technology. We are maintaining our free cash flow guidance of at least $720 million, and our other assumptions remain materially unchanged. Year-to-date, we have realized $190 million is expected $230 million cash tax benefit from the 2021 method change. We anticipate the remaining $40 million to occur in the fourth quarter, but the timing of the tax refund is dependent upon the IRS. And with that, I’ll turn the call back over to John. They’re short term, they do not change our large addressable market nor positive demand signals. We continue to see bipartisan support for national security and modernization, and CACI is well aligned to these key spending priorities. Domains like cyber, space and electromagnetic spectrum are increasingly important and broad-based modernization across the federal government is essential. To our 22,000 talented employees, thank you for everything you do in service to our customers and our nation each and every day. With that, Seth, let’s open the call for questions. John, you mentioned the constructive budget environment FY ‘22 was plus ‘23 as growth across the board. As we mentioned in our prepared remarks, it really comes down to issuance of funding. The way we -- our third quarter played out, it’s not that the government didn’t have that funding, it was getting those funding orders out. From a big picture and from a budget standpoint, I think FY ‘22 budget and the planned FY ‘23 budget has further proved that the world is a really dangerous place, and I believe that Ukraine was a wake-up call. We’re hearing potentially largest DoD budget in history as we get into government fiscal year ‘23, potentially greater than $800 billion. We’re working through a $14 billion multiyear supplemental spending for Ukraine, which includes operational and intel support for the U.S. European Command, which is a combined command that we support broadly. As I shared in my prepared remarks, we’re going to see increased spending in the intelligence community, where we provide a wide range of advanced cyber and intel analytical technology and expertise. So when we look at our addressable market greater than $240 billion, we look at -- we continue to invest in differentiated capabilities and the like, and we’re in the right areas of spend. So we are even more confident as we go into FY 2023, Gavin. And again, I want to close this question off with, our FY ‘22 struggles in the second half of this year are abate and an absolute issue with funding. Yes, it’s a fact that our contract funding orders in the third quarter were down about 20% versus last year. These are temporary, and we do believe funding is going to begin to flow. What I can share is through the 25th of this month, which is the first month of our fourth quarter, funding orders are up about 8% from the same period last year, but clearly not in time to support our FY ‘22 efforts with only 60 days remaining in our current fiscal year. But in light of what we saw in April, we would expect May and June to show that same level of reversion back to the normal, which will support FY 2023 reverting back to strong organic growth, great margins and increased cash flow. We’re looking for positive impact to the FY ‘23 budget spending during our FY 2023 year as well as increased funding coming up during our fourth quarter. I mean we are continuing to focus on high-quality revenue, and as I mentioned to Gavin, we’re in the right places. We are continuing to focus on high-quality revenue, and we want to be able to grow and expand margins within that tech sector. We are committed to driving growth above our addressable market, which today is $240 billion, Mariana. When we get a chance to assess the full FY ‘23 plan going forward, we’ll have a new addressable market, but the goal of the acquisitions that we have done over the last couple of years has really been focused on growing that addressable market. There’s no reason why, with the appropriate funding, we cannot continue to grow as we have year-over-year. So what we do in space today is really, really focused in our Mission  area. We were very focused on the SA Photonics acquisition because we believe that our role in space will not be in building satellites, but actually by both doing mission payloads that ride on all LEO GEO MEO satellites as well as optical communications. As I mentioned during my prepared remarks, to be able to close an optical link in space, which is a great step forward for CACI for our satellite, partners as well as DARPA and SDA. I would also tell you that these 2 experimental payloads that we have being launched, I believe it’s January 23, is very important -- and worth spending a couple of minutes on because it’s very germane to what our space strategy has been. And it won’t completely replace GPS, but it will greatly support systems out there when GPS signals are jammed or when they’re attacked. The second area on the tactical ISR area is very basically taken our Mastodon-type terrestrial solutions today for tactical ISR since they’re so -- they’re very low size, weight and power, they’re very low cost and making certain that we can space qualify those boxes and those assets so that we can continue to prosecute all of our growth strategies within the space domain. As I’ve said many, many times, the hiring environment remains very competitive and very challenging, but it’s no different than it has been over the last several years. I’m a big trend line person and looking at trend lines of STEM graduates out there, we can throw this great resignation wave in the middle of that as well as wage and inflation, we’re doing an outstanding job with it. We’ve got 2 great programs: one’s #MakingMoves, and one is our highly successful referral program. #MakingMoves is really about; ensuring that as people want to do different work within the company that they have the ability to, in fact, do that and that reduces attrition. We are very focused on exciting and important work not only on the expertise side of our business, but in the technology side and that very much differentiates just within our sector. Attrition for us continues to be lower even post COVID, which is an outstanding signal that we are doing something right and sort of flashes back to everything that we can control, we’re doing an outstanding job in. 1 in 4 of our JRs is filled internally, which is significantly better than it was just a few years back. Our positive referral trends, 1 out of 3 hires is a referral, and that’s great for retention. So I’m not going to leave this without saying that it’s really, really tough. At the end of the day, we’re not immune to it, but I like the position we’re in so that we don’t find ourselves in a dire talent shortage because of the great renegotiation wave as well as wage inflation. Let me take Air Force first because I hear about Air Force, I think, about the intelligence community. Within the Army, whether it’s a battlefield comms, whether it’s SIGINT, those types of collection technologies, those continue to be very well funded within the Army’s budget. We not as major of a Navy player but 1 very important area where we are, we are responsible for the majority of the system engineering that’s done on all surface ships. At the end of the day we’ve been very focused to ensure that we are in those swim lanes where the customers are going to spend money, AI, cyber, IT monitorization and the like. One example in IT monitorization is using the acquisition that we did with LGS, their network design team won the Army OSP job, about $ 0.5 billion job which is going to be transforming all of the Army’s networks here and abroad making certain that they can handle faster data rates in a much more secure manner. And that is extremely well funded and just another great example of CACI ,one, investing ahead of need, and two, investing in those areas that are going to have long term funding streams as we move forward. John, new business as a percentage of contract awards, I think dropped off pretty materially this past quarter, I think, 45%. The numbers that you mentioned relatively sound in range, but that the new business we have versus recompete, so those numbers bounce around. If I talk a little bit about competitive pressures, I really take it back to our framework, which is we put in place a plan that really looks at the dynamics of the expertise pursuits we have out there and the technology pursuits we have. And it’s exactly that aggressive bidding stance and trying to drive very low rates and trying to be the most cost competitive provider out there, which is a strategy that CACI moved away from a number of years back. Better Buying Power 1 and 2, 2.0 and LPTA really opened the market up for people providing expertise to the federal government. You can call them consultants or the like, which is why we have been very, very judicious at what we want to bid in within that space. If you look at some of our recompete work, the majority of the recompete work that we haven’t been successful on in the last 36 months has predominantly been in the enterprise expertise quadrant because frankly, at the end of the day, we want to be a growing company, both top and bottom line. And you can see that because we are one of those few companies that although it’s tough to find talent, as somebody asked earlier, 50% of our business is pure technology, where we direct the efforts on our people each and every day, where our people can take the training classes they need to make us a much more productive company. And again, back to what we can control, we’re going to continue to bid work that we can responsibly deliver on. I would just add that if I take a step back and look at our business development activities, feel positive about those. Kind of winning some large contracts, durations have increased materially over time. This quarter, like $1.2 billion awards. So we look at it on a trailing 12-month basis, kind of 1.5x kind of book-to-bill. Kind of looking at capture rates for both new business and recompete business, they’re quite respectable. Maybe just as a follow-up, Tom, looking at the implied 4Q rev guide, it looks like, I think, 6.5% or so growth at the midpoint and 2-ish% on an organic basis. So if I look at the fourth quarter, here we are in April, so we’re 1/3 done, we feel pretty good about that. The funding issues which impacted us in the third quarter are turning to corner, but it’s going to take some time for that. Even if you get the funding to translate it kind of into revenue, but a lot of visibility as to where we stand between now and the end of the year. There are some material sales which we’re tracking very closely, but we feel pretty comfortable about those. So all in all, again, confident in the guidance that we’ve provided. Some of the technology we sell that we disclosed previously with the Mastodon and ABT acquisitions in the 30%, 40% kind of EBITDA margin range. Right now, we’re seeing an ever-increasing margins, and we still have yet to think about what the appropriate takeoff point is. On the revenue side, there will be questions around whether the revenue didn’t show up in the fourth quarter. On the expertise in the enterprise tech side, our new business wins and any contract mods think of additional work that the customer has given to us, those -- which are experiencing funding shortages, those are going to cause delayed starts and ramp-ups. In most cases, we’re going to look at those as being delayed because of the funding issues. And I really want to get a good handle on the next 2 months’ worth of funding orders, whether that trend line continues to move to move forward. And just as an illustrative example, if a customer typically buys 100 units of something each year and they didn’t buy it in FY ‘22 because of funding delays, they’re going to buy 200 units next year? So again, that’s an ongoing assessment. As much as we’re looking at margins, we’re looking at revenue that can drive those margins as well. But again, it’s going to be the element of time. And the last comment I’ll make on that is, as we look to ‘23, both John and I in our prepared remarks expressed confidence in FY ‘23. So when we put all that together, that bodes well for FY ‘23. And you just sell funding orders at growing at kind of 8% through the month, which probably should accelerate through the year. But having respectful of your question, look, we do expect our customers to begin to execute on their fully appropriated budget that finally went through  in the middle of this month. Again, we’re going to watch it the next couple of months. A $300 million, 20% dip in the third quarter, as you would imagine, causes us some level of pause. Supply chain is still going to be an issue, but consensus is that, that should get better in the back half of our fiscal year. We’re not trying to give guidance, per se. What we are trying to do, though, to the point of your question is sort of convey the confidence that the headwinds we’re seeing are short term. Having a well-run business, a very cost-effective business and not getting a funding order, which allows us to clearly generate revenue. And then in terms of the demand signal environment, what sort of demand signals are you seeing that you’re investing in lower earth orbit constellation. What we picked up with LGS and their photonics business is a phenomenally well-run business that is driving high-end geo-based bespoke solutions, think low quantity, think very, very highly accurate, carrying both unclassified and classified information over highly -- over high-bandwidth links. What SA Photonics gives us is different look at our algorithms, but also the ability to produce those types of optical solutions at a lower rate, at a higher volume, lower price target level. What I like about the SA Photonics acquisition is combining that what we do with our LGS, we now have high-end bespoke and high-volume LEO-based solutions that will both over time collapse at the same type of baseline, making even our high-end bespoke ones more cost effective. So there could not be a better example, frankly, Colin, than what we’re doing in that space to own . Yes, there are other folks out there working on optical cross links to other selling providers saying they’re going to go create their own. As I mentioned, when we did the SA Photonics acquisition, we’re looking at volume and margins improving as the market picks up in the FY ‘24 time period. So as we just closed about 4 to 5 quarters more of strong investments there, but again, the success we just had on this Mandrake 2 mission has been outstanding. We need to be focused on in that ‘23, ‘24, ‘25 timeframe. Some of the longer 5-year programs, we get funding on a regular basis. The funding impacted some of the shorter-cycle activities in 2 categories, what are material buys. Sometimes the government, DoD customers, Army customers will ask us to procure not necessarily commodity like materials, but specialized capabilities. Think a satellite dish with special kind of features and technology embedded upon it, where we would procure it and drive one of our contracts provide to the government. The former category, materials, are higher revenue, but lower margins since we’re getting a material handling fee on those. Think some specialized material at lower margins, higher revenue and then think our mission technology, lower revenue contribution, but materially higher margins. Operating cash flow, if I go excluding the kind of tax issues kind of down a little bit around $10 million, kind of largely driven by some of the reduction in our net income from where we initially had a peg, but that’s offset by some better collections kind of DSO at 51 days. The collections have certainly improved, and so we’re able to maintain that free cash flow guidance. Gavin, we’re going to keep our disclosures around technology and expertise and that’s clearly just due to competitive reasons. Highly respect your question, we’re just not going to provide too much additional information there. So it’s why do not have that, instead of the we would just be speculating. Gavin, I’ll add one other item, frankly, around that second question. We’ve been trying to study what the most likely reason was for that because as we mentioned, when we got to the second quarter, we were pretty much flat with where we were last year. Our assumption and probably best well-founded reason it is, it’s another issue we talked about during the second quarter. When Ukraine crisis started, it just became yet another compounding factor on a government customer that was already spending below what their CR budgets were and sort of like throwing another ball in that 6 ball juggling act of how am I going to fund everything that I have. That’s frankly where we believe that, that funding issue starts after the specifics by month-to-month. But as we talk about funding, I want to continue to reiterate, funding to us is a very short-term headwind. What we can control is being run exceptionally well, and we’re looking forward to closing on FY’22 with our updated guidance and then driving future growth in FY ‘23. So you mentioned producing of kind of these like subcomponent optical lengths, but at the same time, you’re cutting your CapEx guide. Kind of generally speaking, it’s 3 major buckets for capital spending for CACI. And we do make investments in some enterprise capabilities, think of budget systems, think a contract system, think other data repository systems, which drive capital spending. And so that’s the piece that you’re looking at -- and so with that, I’ll turn it back to John and he can talk more specifically about some of the requirements for some of the space activities. Everything we do in that mission tech quadrant, the first 9 months, CapEx was around $40 million, which tells you that it’s sort of timing. Some of the ramp-up of some of that work, nothing slowed down what we’re doing in SA Photonics, nothing to slow down what we’re doing in the  Mastodon business. But let me be very, very clear, we’re not backing off on investments for growth because of these very, very short-term headwinds. And we will not cease any of those investments as we continue to support new and growing customers, especially when it’s backed by very strong funding streams. Our mantra of investing ahead of customer need does not take time out because of the 1- to 2-quarter short-term funding issue, which is predominantly the majority of the issue why we had to take down guidance to close our FY 2022. As many of you have already written, you all are expecting growth starting in those companies’ third quarters. Thanks, Seth, and thank you for your help on today’s call. Tom Mutryn, Dan Leckburg and George Price are available after today’s call."
}