{
    "symbol": "MSCI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 18:22:09",
    "content": " We continue to see strong growth with our real asset and analytics climate solutions, growing run rate by approximately 250% year-over-year. In ESG and Climate, we delivered subscription run rate growth a 42% excluding FX, roughly 1/3rd of recurring subscription sales were generated from our climate solutions and the climate run rate across all segments reached $65 million which is an increase of 89% from a year ago. Within our ESG and Climate segments, merging client areas including wealth managers, hedge funds, broker dealers and corporates collectively have run rate growth of more than 60%. On top of changes in the broader market in economic environment which is likely impacting purchasing decisions in some areas, here many layers of growth in our ESG and Climate franchise across a wide range of solutions and use cases which results in a dynamic growth rate that's impacted by the pace of new regulations, client segment dynamics, asset class shifts and geographic factors. We are continuing to as you mention prioritize hires in really our key growth areas and triple-crown investment areas like ESG and Index, custom Index capabilities, fixed income content and capabilities, key data and technology enhancements, particularly in areas like ESG and in Climate data as well as the broader technological infrastructure and on the cloud. Got it, that's helpful. I would also highlight that the extreme resilience of our Index subscription franchise as well and I think there is just such a plethora of use cases across many different users in client segments that continues to be strong pockets of demand and in use cases for those products, particularly in areas like over the counter derivatives that can be very useful to our clients in these types of environments. But the reason we say that is to highlight the Climate tool opportunities, right, the Climate tools, so the Climate solutions by MSCI that's -- because we're paring it against a fairly rapid growth rate on ESG that will continue. Got it, that's helpful."
}