{
    "symbol": "MSCI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 16:33:09",
    "content": " Finally, fees from listed futures and options linked to MSCI Indexes which are roughly 10% of asset based fees are based on traded volumes and are not linked to AUM and volumes in these products historically have tended to pick up in periods of market volatility, including this quarter where we saw traded volumes up 19% and run rate up 11%. I think the potential for our climate solutions over a long period of time could be that it exceeds the run rate of ESG itself, give the exercise and product to work for world and in various numerous, you know use cases and clients segment including the corporates and corporate advisors and the like that we are serving. We've done quite a lot of different strategies to change that and a lot of it has worked, but from a small run rate basis – for example, we have been pivoting our analytics product line towards the front office, the portfolio management offices, so that's why you see meaningful, very meaningful double digit increases in the run rate of fixed income portfolio management that they alluded to, in equity analytics or equity portfolio management analytics; that’s another area that we’ve been pushing pretty hard, again from a slower, from a smaller run rate base. So hopefully over time we can outgrow the part, the mature part of the book of the run rate you know and the UFR, the prognosis equity analytics, fixed income analytics and the new use cases such as climate rate can continue to grow faster and therefore get the overall run rate you know to grow in the high single digits and eventually in the lower double digits. And then the last one, the big driver is ESG and Climate and notably Climate integration with a lot of both, the risk capabilities and reporting capabilities, where because we have both the enormous data processing and risk capacities and leveraging our new intellectual property on top of that, all of those things you know should be driving the growth rate up and in order to do that we also have to then keep our retention rates of the existing book of business solid. The second category which is what – you know what Andy alluded to, which is reported in the index subscription line or area is the structured products, over the counter options, you know flaps and all of that, that area is growing significantly for us, not only on the market cap indices, but especially on new investment thesis indices, ESG and Climate being in that category, but also thematic indices and therefore that is an area that we're putting up a lot of effort, and that normally translated into sometimes you know one-time fees, so these are recurring one-time fees that show up in Index and the Index description, they don't show up in the asset base fees at this point. Those tend to be the two areas where you do see our investment going and so you saw cost of revenues showing a higher growth rate in the quarter, and that's on the back of investments and/or product teams, technology and data, and our researchers, sometimes those individuals time will be allocated to projects that are more R&D in nature and sometimes they are more cost of revenue in nature."
}