{
    "symbol": "ODFL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 13:24:04",
    "content": " But that's kind of the point of the, what we've said is, I think that we're in a good spot, with our headcount with our fleet, and certainly with the service center network to be able to let volume start flowing again. But we're certainly going to continue to look and execute on the same pricing philosophy that we have in the past and look for cost plus increases to offset the cost inflation that we see in the business and to keep supporting these expensive investments that we're making in our real estate network and technologies that can both improve customer service, but also drive further operating efficiencies for us. Well, I think that again, the revenue environment will have a lot to say about that, more broadly speaking, we've talked and kind of pointed everyone to our performance in 2016 and 2019, when we've been in a flatter revenue environment, certainly, given the planned investment of about $800 million in capital expenditures this year. So, we'll take it quarter-by-quarter, certainly, and we'll talk as we get to the end of next quarter's call about what we think we may be able to do in 2Q, but certainly feel like we're probably going to have a little bit more pressure on the overhead side this year if we are in fact a flat to slightly down revenue environment, but there's still a lot up in the air when it comes to the top line for this year. I think that fuel hold steady with where we are right now, it certainly becomes a headwind as we get into the later quarters of the year, but nonetheless, I think that certainly there's always mix changes that can drive that number, higher or lower. And I think we continue to try to manage, just like we did in those periods, and continuing to manage the different components that go into building out our rates with customers, whether it's base rates, fuel surcharge, or as is oils managing all the revenue inputs with the cost inputs and trying to account for whether or not fuel goes up or down. So, it's just something that our pricing and costing teams and our sales teams have got to work through is we're working through renewals with our customers every day, and just looking at and seeing where we are and what we feel like we need to keep driving improvement in our customer specific pricing and profitability. I don't know if I can explain the psychology of our customers, but I did take a psych class in college one, so I'll give it a shot, but I think that we've talked a lot about this that since going through COVID, there's been so much disruption to customer's supply chains and missed revenue opportunities, incremental cost added to production lines just because of all the supply chain challenges that many of our customers have been dealing with over the last couple of years. So, I think that one of the things you said as part of your questions though gives us a little confidence in terms of when those orders for our customer product start picking up again in the sense that in prior cycles like 2016 or 2019 where we may have lost a few lanes or lost a customer account, we were always confident that the business would return to us in many case because the customer told us that they wanted to bring this back in when they could. I understand obviously there are different puts and takes on kind of economic uncertainty, maybe some cost inflammation, but also talking about this inflection that's expected for second quarter, it seems like there is some optimism there around the ability to perhaps improve OR year-over-year which would certainly suggest that you are kind of bumping up against that ability to get the OR to the 60s."
}