{
    "symbol": "SHPW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 20:49:02",
    "content": " Our forward-looking statements, including without limitation statements regarding our business strategy, future financial and operating performance, projected financial results for the second quarter of 2022, expected growth, impact of recent acquisitions, new offerings and market opportunity are based upon current estimates and various assumptions. This includes four key growth initiatives, including the expansion of our additive manufacturing capabilities, executing a comprehensive go-to-market strategy, expanding our manufacturing services offering to include more traditional manufacturing processes, and commercializing our software. This offer removes friction from the ordering process, enabling our customers to easily optimize their files for printability, configure their manufacturing requirements, obtainment in pricing, utilize best-in-class e-commerce tools, pre-digital inventories and integrate their own business software directly into Shapeways Digital manufacturing platform through our API to make future purchases more seamless. First is the continued expansion of our additive manufacturing capabilities, including investments in new hardware, technologies, materials, finishes and certifications to support enterprise customer needs. We plan to focus our investment in both software and supply chain development to support these additional manufacturing methods by offering these manufacturing methods to our customers, we have the ability to capture more share of wallet and increased market penetration. The initial phase of the auto software rollout, which has already begun, provides traditional manufacturers with the ability to offer additive manufacturing services without investment, allowing them to expand their manufacturing capabilities, generate new revenue streams and grow profitability through our white label solution. Their focus on more traditional manufacturing is expected to accelerate our traditional manufacturing growth initiatives by enabling supply chain development efforts, and give us the ability to leverage the thousands of manufacturers that are on the platform to fill Shapeways customer’s need. These are just a few examples of how Shapeways can accelerate our growth plan through strategic acquisitions, which can enable us to aggressively drive market share consolidation, capture talent, develop new go-to-market channels, acquire new customers, expand customer share of wallet and drive gross profit optimization. We expect to see a ramp of sales in the back half of the year from our investments in new technologies and materials and increase in business development resources, the continued rollout of our auto software product and from the impact of our recent acquisitions. And so specifically on Linear AMS, Linear AMS provides us not only with additional hardware capability, and traditional manufacturing expertise and business development resources and user application resources with good, great customers and verticals that were not yet in, they are able to offer us additional certifications and things like that."
}