{
    "symbol": "KR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-16 14:46:02",
    "content": " Yes, I think the first part of the question would be, as I mentioned it a moment ago, and we look at the guidance for the rest of the year, our overall outlook for inflation is that we do expect inflation is going to be higher for the rest of the year than we originally expected when we sort of entered 2022 and provided our original guidance. And then from an operating profit perspective, as I mentioned a few moments ago, from really the way we think about the rest of the year, our overall EPS guidance, if you kind of look at the midpoint of our new range for the rest of the year, it would be flat to slightly down. So we think of the sort of supermarket business as being robust and relatively on track in terms of what we would have expected and continuing to build momentum, it’s really around those other factors that are driving the lack of sort of carry forward of the momentum on year-over-year growth in the first quarter when you look at that relative to the rest of the year. Just briefly, I would say, on the EPS side of things, I mentioned a moment ago, Rupesh, that I think if you look at the guidance for the back -- the last three quarters of the year, it would sort of predominantly be around the sort of flat to slightly down. So if we look at our overall metrics, households are up, loyal households are up, visits have turned positive, basket size is up, but the number of items in the basket, as Rodney mentioned, is the item that I think customers are adopting behavior as they start to manage the inflationary environment, and that's obviously a focus area for us to use our data personalization and different tools around rewards to really aim to continue to drive that up. Michael, your line is now open. Michael, your line is now open. The only other thing maybe I would add, Rodney, is that the comments we made, Michael, about digital growth and the expectation with the investments we're making in customer fulfillment centers, the announcement -- the exciting announcement that Rodney shared this morning around Boost membership launching across the whole of the company, we feel the momentum that we're seeing starting to build in digital that will also be an important component of that growth in the future as well."
}