{
    "symbol": "KR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-09 14:05:10",
    "content": " As I mentioned a moment ago, the increase in our OG&A rate during the quarter was unusual as it included an accrual catch-up for higher projected incentive costs covering the first half of the year, as well as strategic investments in a number of margin expansion initiatives that will drive future growth. One of the areas I would say, specifically in that, that was a tailwind this quarter versus last quarter is the sourcing team and supply chains working really well together to offset the pressure on fuel costs and making sure that we're improving efficiency in the supply chain and operating at optimum levels to really offset that naturally, whereas in the last couple of quarters, supply chain would have been a headwind to gross margin, it was essentially flat this quarter. So we're assuming, as we cycle $0.43 to $0.44 of CPG profit from the back half of last year, but if fuel rates more sort of return to normalized levels, then that would be a $50 million to $60 million headwind in the back half of the year. As you heard me mention in my prepared comments, we're certainly starting to see some traction on some of the key initiatives that we've been investing in, whether it's the customer fulfillment centers that are powered by Ocado in both new and existing markets, the launch of Boost and as Boost continues to ramp up and we see about 25% of customers that sign up for Boost are completely new to digital. And as Rodney mentioned, we believe that momentum will continue in the back half of the year, but we are expecting while inflation will remain at heightened levels, we think it will start to taper out because with the cycling, call it, 4% higher inflation in the back half of last year compared to the first half of last year. As I mentioned, I think we would expect there to be some flattening out of inflation in the back half of the year, but there's nothing that we see right now that would cause us to believe there's going to be a dramatic change in the level of inflation in the back half of the year. And then I mentioned earlier, but we're really pleased with the progress that we made in health and wellness during the quarter, and we made some strategic investments in the health and wellness space where we believe there's an opportunity for us to continue to drive profitable growth, not only in the second half of this year as we cycle the vaccines for last year but also beyond in 2022 and 2024. And as I think you probably know, we -- our goal is to make sure we're very competitive on price, and then we give significant value back to our customers via our fuel rewards program that flows through our supermarket gross margin, not through that fuel P&L that we share -- the metrics that we shared on the call."
}