{
    "symbol": "KR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-01 13:07:05",
    "content": " Youâ\u0080\u0099re right in terms of if inflation normalizes and your numbers certainly correct around the $500 million in this year, which would be a $300 million year-over-year headwind because last yearâ\u0080\u0099s LIFO was also inflated as inflation started to rise in quarter four last year. So we would believe that as we will get into guidance next year, obviously, when we share our earnings, and weâ\u0080\u0099re still sort of forming views around what we think will happen with inflation, but weâ\u0080\u0099re probably looking at most of the external views that you are and most of the analystsâ\u0080\u0099 reports that we can look at in the USDA, etcetera, would be in that sort of more of that 2.5% to 3% or so inflation for next year. But again, I think you mentioned LIFO, another example for us would be â\u0080\u0093 as you look at our incentive plan, obviously, weâ\u0080\u0099re having a very strong year versus our expectations, having raised our guidance every quarter. I think when you look at Garyâ\u0080\u0099s points overall, itâ\u0080\u0099s one of the things thatâ\u0080\u0099s so important about our overall business model because we do have a lot of moving parts, and weâ\u0080\u0099ve invested a ton of work and effort our whole team has over the last several years to reinvent the business model and make sure the business model can be successful in every economic environment. Your line is open. I guess the only couple of extra points, John, I would maybe add, I do think, as you know, our core strategy is to grow existing loyal customers and what was really pleasing in the quarter as we saw 2.5% growth in loyal customers. I think the one thing on the loyal house, as I would say, too, is what we saw during the quarter we have seen the last couple of quarters is that maybe that more affluent customer that has shopped maybe a larger number of retailers before thatâ\u0080\u0099s consolidated more of their trips and total basket with Kroger as they may not need to adjust their budget because of inflation. Your line is open. So, we do believe itâ\u0080\u0099s important to be investing in the business, and we can still see plenty of opportunities to support that growth, but we have just thought it was based on how long itâ\u0080\u0099s taking with certain things to get projects completed with supply availability that we think itâ\u0080\u0099s going to be a â\u0080\u0093 some of those projects will now blend into 2023, but we donâ\u0080\u0099t have a concern today about it impacting our growth algorithm. Your line is open. Your line is open. So, what we were pleased about was in that context, the continued momentum in our overall ID sales when we look at our Q3 performance versus our Q2, and I think a lot of that ties to some of the prepared remarks that Rodney also shared around household growth that we are seeing and really some defying more share of wallet from loyal customers and seeing lower customer growth. Your line is open. Your line is open. I think probably similar to what we have shared earlier, I think overall, as we are looking at the way the customer is changing behavior, as Rodney mentioned, trips improving, generally fairly consistent, I would say, over the year, but we are seeing higher trips from those loyal shoppers that have traditionally shopped in many different retailers for different categories and now seeing that trip consolidate to Kroger."
}