{
    "symbol": "MASI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 22:27:04",
    "content": " We also achieved a solid rebound in the revenue growth rate for our healthcare business for the quarter, with revenues rising 17% versus the prior year period, including the boost from shipping, most of the delayed first quarter orders in the second quarter. On a pro forma basis for the full quarter, our consolidated revenues would have been $572 million representing 12% reported growth and 15% constant currency growth. For our healthcare segment, second quarter revenues were $357 million, representing 17% reported growth and 19% constant currency growth. On a year-to-date basis, our healthcare revenues were $661 million representing 9% reported growth and 11% constant currency growth year-to-date. For our consumer non-healthcare segment, second quarter revenues were $208 million from April 11, 2022 through fiscal quarter end. On a pro forma basis for the full quarter, our consumer non-healthcare revenues would have been $215 million representing 4% reported growth and 10% constant currency growth. For our healthcare business, second quarter non-GAAP gross margin increased to 160 basis points to 66.3% compared to 64.7% in the prior year period. For our consolidated business, our non-GAAP operating profit increased 49% to $107 million and represented 18.9% of total revenue. Further, our healthcare revenues grew 11% on a constant currency basis for the first half of the year, and we have now shipped approximately 75,000 drivers for four consecutive quarters illustrating the strong and persistent strength in our healthcare business. For our healthcare segment, we are projecting third quarter revenues of $320 million to $ 330 million, which incorporates $10 million of year-over-year currency headwinds. For our non-healthcare segment, we're projecting third quarter revenues of $195 million to $215 million compared to pro forma revenues of $227 million for the third quarter of 2021. On a pro forma basis, our guidance incorporates $23 million of year-over-year currency headwinds, implying flat constant currency growth at the midpoint of the range. On a consolidated basis, we are projecting non-GAAP gross margins of approximately 53%, operating profit ranging from $72 million to $80 million and earnings per share, ranging from $0.85 to $0.97 for the third quarter. For the full year, we are projecting consolidated revenues of $1,985 million to $2,045 million compared to our prior guidance provided back on May 3, this represents a net reduction of $15 million, which is comprised of $44 million of additional FX headwinds, offset by an increase of $29 million due to strong sales performance. Further, our pro forma consolidated revenue guidance incorporates $100 million of year-over-year currency headwinds, plying 9% to 12% constant currency growth. For our healthcare segment, we are projecting revenues of $1,330 million to $1,345 million which now incorporates $30 million of year-over-year currency headwinds. For our consumer non-healthcare segment, we are projecting reported revenues of $655 million to $700 million from April 11th, 2022 through fiscal year end. On a pro forma basis for the full year, our guidance implies consumer non-healthcare revenues of $913 million to $958 million for fiscal year 2022, compared to $909 million in fiscal year 2021. Further, our guidance incorporates $70 million of year-over-year currency headwinds plying 8% to 13% constant currency growth. For our consolidated business, we are projecting non-GAAP operating profit ranging from $346 million to $364 million compared to our prior guidance represents a net reduction of $19 million to $22 million. Micah, just on the healthcare business in 2Q, if I recall, 1Q was about $25 million short because of the supply issues, is that how we should view that the 2Q overage I'm just trying to get at an underlying growth rate and if there's any comments between kind of drivers and consumer."
}