{
    "symbol": "MASI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:22:05",
    "content": " Looking back on our financial performance in fiscal year 2022, the consolidated revenues exceeded $2 billion, with Healthcare revenues reaching $1.34 billion, representing 11% organic growth. The Masimo Consumer acquisition, which closed in early April last year, added $695 million to our reported revenues, bringing pro forma revenues for the consumer business to $963 million in fiscal year 2022, representing 11% organic growth as well. Our fourth quarter results continued the strong momentum we've built throughout the year, with consolidated revenues of $617 million, representing 9% organic growth. For our Healthcare segment, fourth quarter revenues were $352 million representing 10% constant currency growth. For our consolidated business, our non-GAAP operating profit increased 24% to $104 million and our non-GAAP earnings per share increased 9% to $1.32 per diluted share for the fourth quarter. For the full year 2023, we are now projecting a consolidated revenue range of $2.415 billion to $2.460 billion, representing 6% to 8% growth on a pro forma and constant currency basis. For the Consumer Non-Healthcare segment, we are projecting -- we are now projecting revenues of $965 million to $995 million, representing 2% to 5% constant currency growth. As far as our plans for the Masimo consumer team, we want to roll it out along with Freedom and B1, because I think it's important that consumers know what we imagine, not what we have right now, because the other products are much more beautiful and user-friendly for those who want kind of the smart watch feel or if they want a wearable band like the Fitbit devices. One thing that I did mention though before is, we've got about 1% of our total revenues for the company that are tied into some of the investments we're making to really drive success with all those launches this year and making sure that we're building out the right areas and building out the channel, promotional activities properly to drive that success. Of course, as you know as we talked about last December they've got -- the consumer business has over 450 sales and marketing professionals worldwide and that's what's really we're going to be able to leverage that channel in a big way, but we do have promotional activities associated with the investments on these launches. So we're going to be facing a tough comp on a pro forma basis for that business in 2023 in the first quarter, but you'll steadily see those revenues improve and then the fourth quarter being the highest again."
}