{
    "symbol": "MASI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:40:29",
    "content": " Our consolidated revenue was $549 million, representing 3% reported growth and 8% constant currency growth on a pro forma basis. For our Healthcare segment, third quarter revenues were $327 million, representing 6% reported growth and 10% constant currency growth. For our consumer non-healthcare segment, third quarter revenues were $222 million, decreasing 2% on a pro forma reported basis but increasing 5% on a pro forma constant currency basis. For our Healthcare business, third quarter non-GAAP gross margin decreased 190 basis points to 64.6% compared to 66.5% in the prior year period. For our consolidated business, our non-GAAP operating profit increased 15% to $81 million and represented 14.8% of total revenue and our non-GAAP earnings per share increased to $1 per diluted share. On a pro forma basis, our guidance incorporates $45 million of year-over-year currency headwinds, implying a constant currency growth range of 6% to 11%. On a pro forma basis, our guidance incorporates $32 million of year-over-year currency headwinds implying a constant currency growth range of 5% to 10%. On a pro forma basis, our guidance implies consolidated revenues of $2.258 billion to $2.288 billion, representing 5% to 7% reported growth and 10% to 11% constant currency growth. For our Healthcare segment, we are projecting revenues of $1.325 billion to $1.340 billion, which now incorporates $35 million of year-over-year currency headwinds. On a pro forma basis for the full year, our guidance implies consumer non-health care revenues of $933 million to $948 million for fiscal year 2022, representing 3% to 4% reported growth and 10% to 12% constant currency growth. On a pro forma basis, our consolidated revenue guidance implies 10% to 11% constant currency growth with both segments projecting to have double-digit growth for the full year. In our Healthcare business, Iâ\u0080\u0099m happy to report that we recently secured important new customers, including Denver Health, and Nationwide Childrenâ\u0080\u0099s, one of the top 10 childrenâ\u0080\u0099s hospital in the U.S. Hydration Index, or HI as we like to call it, should be very useful for athletes and exercise enthusiasts, who need to calibrate their fluid intake for achieving peak performance as well as for patients whose fluid levels need to be properly titrated and are not ventilated where PVI has helped with hydration for 15 years. Your line is open. Your line is open. Your line is open. Your line is open. And another thing I mentioned in my prepared remarks was just as you think about your models for next year, keep in mind that a lot of the currency headwinds, if FX rates hold at current levels, weâ\u0080\u0099re contemplating or estimating about $70 million of FX headwinds again next year from the strengthening of the dollar, so just a few things to model in there ahead of the Investor Day. Your line is open. Your line is open. Your line is open."
}