{
    "symbol": "IX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-07 16:24:05",
    "content": " Thank you for joining this teleconference of ORIX Corporation for the Third Quarter Consolidated Financial Results for the nine-month period ended December 31, 2021. And this conference is attended by Executive Officer, Head of Treasury and Accounting Headquarters Mr. Yano. 0:25 Before we begin, we have a request, please make sure that your mobile phone and other technician devices either turned off or kept away from the telephone in order to avoid feedback. If you – if we experienced severe feedback during the meeting with the organizers consent, we may have to suspend the meeting for a short while and speak to the person who is causing the feedback with your kind understanding. 0:57 We will hear from Mr. Yano and then after the presentation, we will have a Q&A session. I am Yano, executive officer and head of treasury and accounting headquarters for ORIX. Thank you for joining us for the third quarter results announcement for FY22 March end, despite of your busy schedule. The first is net income and ROE, ORIX posted ¥211.3 billion in net income for the 9 months ended December 2021, up 48.8% year-over-year. For the third quarter alone, net income was ¥64.7 billion, up 34.2% year-over-year. 2:13 On December 17, we revised up our full year net income target from ¥250 billion to ¥310 billion. Although we're trying to sell Yayoi in the fourth quarter and earnings remained strong, but there is still a lack of visibility in the market due to COVID. And we, therefore, decided to leave our full year net income target unchanged at ¥310 billion 2:50 The second point is capital recycling. As you know, at ORIX, we aim to achieve higher asset efficiency and profitability through ongoing asset replacement in our portfolio. We have secured an investment pipeline of ¥1 trillion, both within and outside Japan in areas such as renewable energy and PE investments, deals we have already announced are steadily being executed. At the same time, we're moving forward with well-timed asset sales, including Yayoi overseas private equity under these incentives. Going forward, we aim to improve ROE through a well-balanced mix of investments and asset sales 3:30 The third point is credit rating. ORIX Is currently rated by 5 major credit agencies, and 4 of these have raised either their outlook or rating in the last 6 months. Although some rating agencies downgraded ORIX immediately following the outbreak of COVID, they now appear to have taken a positive view of ORIX Group: stable business base displayed by our ability to maintain a certain level of earnings and asset quality despite the COVID crisis 4:02 The last point is the shareholders' return. In December 2021, we announced a floor for the dividend and set the dividend payout ratio for this fiscal period. In addition to a net income forecast upwards revision, if net income exceeds ¥285 billion, full year DPS is expected to mark a record high. As I mentioned before, net income rose 48.8% year-over-year for the 9 months ended December 2022 to ¥211.3 billion. Should we achieve a net income of ¥310 billion, ROE is expected to be at 9.9% at the end of the fiscal period. Coupled with the ongoing share repurchase program, EPS is expected to reach ¥257, surpassing their fiscal year '19 margin, both record a new high. Net income was down 20.6% Q-on-Q, owing to loses at investees, but was 34.2% higher compared to a year ago when the post-COVID recovery has just started. 5:31 Next page, please. The dark blue bar or base profit were up 34.4% to ¥254.9 billion, which is 73% of segment profit. 6:03 Overseas segment, including ORIX USA, ORIX Europe and the Asia and Australia, sustained strong performance into the third quarter and contributed significantly to profit growth. The light blue is investment gains, which were up 81.6% year-over-year to ¥95.9 billion. Property sales, primarily logistics centers, in the Real Estate segment also contributed. Six segments led by Overseas posted higher profits year-over-year, and overall segment profit was sharply higher by ¥108.4 billion. Compared to 2 years ago, all segments posted higher segment profit with the exception of the 3 businesses, which were affected severely by COVID. Within Japan, businesses with a minor COVID impact are expanding, showing the strength of ORIX's diversified portfolio. Also, assets in the Insurance segment rose on growth in numbers of insurance policies while growth in new leasing business in South Korea and China led to an increase in assets in the Asia and Australia segment. Page 11 and onward provides individual segment information, which I will explain briefly. Although we booked some impairment losses on the stake in third quarter, following a decline in the share price, it still contributed strongly to profit growth. Auto profits were up on strong used car market and a focus on margin improvement; an ongoing recovery in rental costs, which were impacted by COVID, also led to a large upswing in profit. Rentec profits were higher on growth in rental equipment earnings, led by 5G-related equipment. 9:07 As a result, the profit doubled. The Investment and Operations unit, the business model to develop logistics centers and other properties, lease the properties and then sell the properties, is bearing fruit. Although the facilities operations business including hotels and inns continued to be impacted by COVID, occupancy rates are improving gradually, particularly at inns located in the country area close to Tokyo. Although visibility is lacking with COVID variants spreading, we're working to improve earnings further by leveraging on our knowledge and expertise in operating safely during COVID. In December we announced the sale of Kobayashi Kako, a PE investee manufacturing facilities, to Sawai Group Holdings. We posted impairment losses on this transaction, which led to lower profits year-on-year. However, all other industries are performing well. For example, APRESIA System, a network equipment manufacturer, is enjoying profit growth on the back of demand for 5G-related solutions. In the Concession business unit, Kansai Airport is still in the red as international traffic still has not recovered. We are moving steadily to achieving this goal through projects, both within and outside of Japan 11:57 Please turn to Page 19 for Insurance segment. Earnings from the former Hartford Life segment of the business fluctuates depending on market conditions, affecting the whole segment's earnings. But excluding this, ORIX Life recorded profit growth. ORIX Life operates an omnichannel strategy, including Internet and mail order sales. As outlined on Page 20, this has allowed the firm to post growth in policies well above the industry average. As you can see, policies in force have increased to 2.4-fold in the last 7 years. The Credit business posted reversals for credit costs during the same period last fiscal year, owing to lower demand of long-string COVID lockdowns. The absence of this reversal led to lower profit year-on-year, but it is still solid. This segment was previously more heavily weighted towards aircraft, but the ships is comprising a growing proportion of earnings. In aircraft leasing, both OAS and Avolon's earnings are in an uptrend, aided by recovery in the passenger market. Leasing revenues are on the lines, and we expect further recovery going forward. In addition to recording investment gains on a number of PE exits, Lument, which both originate and sell real estate loans in addition to managing these assets performed well. ORIX asset management business is growing, and the PE business and earnings driver is also focused on utilizing third-party AUM in addition to proprietary funds. AUM continues to increase here and reached a new record high for the third quarter in a row, coming in at EUR 339 billion at the end of December '21. Transtrend, a CTA firm, booked growth in performance fees, which helped ORIX Europe's profit surpass the previous year's record high in the first 9 months of the fiscal year like ORIX USA 15:16 Please turn to Page 30, last segment, Asia and Australia. As COVID variants become more widespread, we continued to control asset exposure in line with conditions in each country and region. Profit growth was fuelled by expansion in new leasing business in South Korea and China, which experienced relatively smaller impacts from COVID. We have ¥1 trillion investment pipeline focused on areas such as environment and energy, PE investment and logistics centers. In the Energy and Environment segment, we are moving forward with multiple new investments in renewable energy companies. Within Japan, these are focused on development, while overseas, we're looking at M&A opportunities with companies with own pipeline projects. We are currently considering a large PE investment, mainly in Japan and the U.S., and we are looking at companies which could become a future business unit for the group. 16:35 In Real Estate, we continued to develop high value-added logistics center properties, which utilize our group's expertise such as installation of solar panels and ensuring facility receive CASBEE accreditation. And for MICE IR Osaka Prefecture City, area development plan was announced in December '21. And in April, Osaka Prefecture City aim to apply for the central government's approval of the plan. As I have already explained in each of these different segments, in terms of sales, we have already done the PE investment in U.S. and the Kobayashi Kako sales will continue. On the 5 agencies that define our rating, 4 of them, S&P, Moody's, Fitch and JCR have upgraded our outlook already in FY '22 March. 18:01 And we believe that these upgrades reflect an overall positive view on ORIX's stable business base, diversified stable earnings sources and high profitability and steady asset quality and our conservative management balance sheet. While maintaining financial baseline with an A credit rating, we plan to appropriately control the D/E ratio, liquidity at hand and capital adequacy and continue to procure funding with favorable conditions. 18:29 Now, in December ’21, we upgraded our net income target, and revised EPS upward from ¥78 per share to the higher of ¥70, ¥80, or a 33% dividend payout ratio. This should net income surpassed ¥285 billion dividends per share will hit a record high and if net income surpasses a certain thing, then dividends will also increase. This illustrates how ORIX has consistently raised dividends, as profits have grown assuming net income of ¥17 billion dividends per share, will be 10 times that over a decade ago. 19:20 Right now talking to many other predictors, we are introducing stricter, anti-COVID measures. And there is a global asserting efficient leading to market volatility, which means that the situation remains unpredictable. And again, ORIX expected to continue to grow through ongoing capital recycling, we don't have to 11% ROE is of utmost importance to ORIX and we plan to continue to return capital to shareholders throughout this process. 20:01 First, we would like to achieve a full year net income target, and then move on to the next page. 20:19 Thank you very much, Mr. Yano. Please refrain from asking a question, not more than one question at the time. The first question is Mitsubishi UFJ Morgan Stanley, Mr. Kaku, Please. So Tsujino-san, I'm sorry, I think your name was announced incorrectly. In any case, this is Tsujino, and this time I know that there were a number of exits from your investment, one case in the United States, ¥9.9 billion of equity method holding exit. Is -- so PE, of course, activity was pretty strong in United States until the end of last year. And also at the same time, the loan balance, in fact, is increasing. 23:12 As to the gains on sales, so properties as to the Real Estate, most of the properties were sold in the first half, so it did not affect the third quarter results very much. So what has happened during the third quarter with Energy and Environment, in Egypt, renewable energy was sold -- divested and we generated some profit from this. And of course, in the United States, as you had asked, in United States, just as we do so in Japan. In Hanzhong PE, there is one case as such in United States. And also, we make bits and pieces of investment here and there. And there are some industries where we have kind of initiatives, whereas we don't for others. And as for this time, there were about 3 deals, the exit that amalgamated into the amount that you have quoted. But what is to be noted is ORIX Europe, the performance fee, in fact, was quite significant. And also, you see ¥120 billion of an increase that we have mentioned, it was held by US dollar base. And if you were to calculate on the Japanese yen basis, it -- so on a dollar basis, it did not increase perhaps there is about ¥40 billion to ¥50 billion, which did not increase, but in actual fact, so ¥40 billion, ¥70 billion, which were a result of the yen's depreciation, so we have focused now in terms of the asset exposure because of COVID. 25:37 And also, loan, in fact, has been kind of combined and we have sold some. So there will be some ups and downs, about ¥38 billion to ¥40 billion or so. 25:52 Yes, thank you very much Mr. Yano. 26:04 Nomura securities, Sakamaki- San, Please ask your question. 26:23 So ¥160 billion Yayoi is sold, that was explained. But against the plan, maybe the progress is pretty good. But in the third quarter, you had an increase in performance fees. And in Japan for wind power, I think there is a review at the government or regulation level. With regard to your first question, Yayoi, so ¥160 billion pretax has been announced and post-tax is usually about 70% of this. But tax-wise, this is going to be a little bit complicated. And post-tax profit is not going to be very high, unfortunately, probably lower than what you might expect. 27:40 Having said that though, ¥210 billion, we have this level of profit, and I'm sure that there's going to be a question about the remaining ¥200 billion. Is this going to be used, I'm sure that this question would come up. But anyway, ¥310 billion is something that we would definitely want to achieve. In the fourth quarter, I don't know if this is the right way of saying this, but capital gain, what we wanted to post intentionally was basically completed for this fiscal year already. But in the fourth quarter, basically, we are not expecting a big capital gain, excluding Yayoi -- other than Yayoi. But anyway, we intend to achieve ¥310 billion, and if possible, go even higher. I have one question on Page 7 with regard to capital recycling, thank you for your explanation. And in the PE Investment, ¥400 billion, and I wasn't able to hear your explanation well, but there is going to be a major deal that may perhaps become one of the units of your businesses. Up until now in Japan, the deals were somewhat -- or relatively smaller, but the Yayoi, in fact, is going to be divested, which was a major investment. And if there was to be an execution of a larger deal, I understand that your rating, in fact, has been revised upward. 30:55 So what I wanted to share with you, there could be a case -- it may not become as large as a segment, but we can look forward to giving birth to a unit. I'm sorry that my explanation was a little kind of ambiguous and as to the geographical area, please, I need to refrain from sharing you any further details. But as you know very often, we given an offer directly from the seller and do not take part in a tender. So therefore -- so you see Yayoi, we are going to be divesting Yayoi. So therefore, something that would replace Yayoi, but it doesn't necessarily mean that we have to make, of course, use of the proceeds that would be generated as a result of the sales of Yayoi, we don't feel the need to do so or we don't take it as an obligation. But still, it could be one of the options to be reinvesting the money -- proceed. 32:03 As to the rating, of course, we want to maintain the current credit rating. But of course, we're not persistent on maintaining the current rating. If we can, of course, maintain the current rating because that would give us favor in terms of better terms and conditions for the funding, for example, financing, so therefore, we would like to, of course, think about the future within the range of the current rating. But if the investment seems to be very promising, of course, for sure, we would go ahead and make an investment, even it may perhaps sacrifice a bit of our credit rating. 33:15 So as a result of the sales of Yayoi, 1% to 2% of uptick, I think I would imagine, because assets, in total, in fact, with the -- have less of an exposure to the goodwill, which would put an addition to our profit. So revenue minus tax, of course, will be positive -- will give us a positive contribution and that, I think, would be 1% to 2% of an impact, I would imagine. 33:54 So if I can share with you any further details -- I don't have the number readily available, but if I can give you further details within the limit of our time, I think it is about 1%. Yes, now that I know that it is about 1% of an uptick. 35:25 Well, we have had some internal discussions and we will enter the planning phase quite soon, during which, specifics will be decided. Unfortunately, at this point in time, nothing specific has been decided. But guidance, including the dividends in the beginning of fiscal year, should be communicated. And the return for investors, we're hoping that we can share some information in May. And with regard to the profit items, with just showing a graph, I don't think this is sufficient. And specifically how we're going to do this, are we going to show you every year or 3 years number, we have not decided yet, but we would like to do something to address this. And that's all I can share with you at this point in time, I'm sorry. 36:33 Yes, I understand, thank you very much\n 36:40 Let's move on to the next person from JPMorgan Securities. This ¥310 billion of profit if you're unsuccessfully achieving so, so you're going to be making use of dividend payout 32% and DPS is going to be between ¥78 to ¥85. Is this a correct understanding\n 37:27 So please refer to the right-hand side as well while you try to understand the left-hand side, the left-hand side. So is there any possibility of, we were kind of imagining going beyond ¥85 should we become successful in achieving beyond ¥310 billion of a profit. Well, in that case, my question is, at this point in time, you're aspiring to, of course, a ¥310 billion. So this ¥85 above DPS, if you're going, and you have, of course, shared this on publishing the bulletin report and I think those below those -- oh, we see that is ¥85, but the dividend payout ratio is less than 33%. So which means you'd be able to, of course, increase DPS. 38:34 Well, in December, we had just revised up our profit so we thought that it is too early for us to carry out the revision. I think, rather, we want to kind of give -- or provide a commitment to be achieving this ¥310 billion, which means that we may be able to achieve this DPS that is indicated here and perhaps even higher. And that was our intent through this chart, which means this ¥78 to ¥85 as a management of the company. You're not conscious of this range, and there isn't much risk of you falling between this range of ¥78 and ¥85. Next May, for the fiscal year ending March '23, the dividend outlook and the profit outlook will be disclosed, and at the same time, you will be indicating the midterm updated policy. The global situation is very unstable, and it's very difficult to predict what would happen. But depending on the situation, you may refrain from showing us next year's guidance. 40:44 Well, I don't think that would be accepted -- acceptable. So we should provide some formal guidance, but as for the specific method of how we provide the guidance, what is the best approach and to what extent we can provide the explanation, we need some more time to discuss this internally. 41:01 But your intention is for next fiscal year, dividend outlook and also midterm plan should be provided. And the next person is UBS Securities, Okada-San, please. 42:12 Well, it goes without saying that if the share price, of course, goes up, the share repurchase program -- of course, the benefit of repurchasing our shares for the fact that our share price is at a discount would go away. But if PBR goes beyond 1x, it doesn't mean that we will stop proceeding with the shares repurchase. But PBR is just an accounting kind of indication, and I think we have much bigger value than PBR of one time. So -- but of course, if we do not proceed with the shares repurchase just because PBR is one time, it doesn't mean to say that we refrain from going through our share repurchase program because shares repurchase program execution is not just determined by the level of PBR. So we would be applying other, of course, yardsticks and think about other factors just -- other than just the PBR. In the midyear, you explained that the impact has bottomed out and you can expect recovery to pre-COVID level. To be honest, this is actually quite difficult as I have explained briefly earlier. For example, if you look at hotels and inns in Japan, we saw some recovery in autumn, but because of Omicron, unfortunately, February-March time frame saw a lot of cancellations. Therefore, it is very difficult to say clearly when the recovery will take place. Having said that, Omicron is turning to be -- turning now to be more like influenza with the common cold and we see some normalization happening in Europe, for example. I don't know if this is the right way of saying this, but Japan is very cautious. So compared to aircraft lease, for example, recovery for Kansai Airport concession may be slower. But sometime in the next fiscal year, we are hoping to see a recovery of our business. 45:45 What we need to do is even if there is a delayed recovery, we need to make sure that the profit will be posted. And we need to figure out what we can do in other areas, and that's what we're trying to figure out. I'm not really answering your question actually, I know, but I hope you understand the situation. In the third quarter, it seems that the recovery is a little bit slower than expected. 46:27 Avolon and also ORIX Aviation I put them together, and I thought I answered this question in that way. But for Avolon, there is a delay and closing of the fiscal year is different, and therefore, accounts closing-wise, it's about 1 quarter behind. So Hainan impairment was posted in the third quarter last year, so this is a big negative. In the second quarter, there was Chapter 11 recovery or comeback from that. And for ORIX third quarter, nothing really happened on either side. But generally speaking, airline industry is recovering and the lease fee payments are normalizing. So if we exclude the extraordinary items, I believe that the recovery is actually stronger than how it looks. 47:58 Thank you very much for explanation, that’s very clear. 49:09 First of all, talking about the domestic Japanese market. Well, even if, of course, yen goes up or down, it doesn't give impact to P&L at all. And ORIX Life, of course, we will be able to enjoy a favorable position if the interest rate goes up. And ORIX USA, ¥1 trillion – ¥1.3 trillion and ¥600 billion for Ships and Aircraft, and we only know the asset is about ¥2 trillion and we do have some mismatch in terms of the interest rate. Some -- at the time when the interest rate was low, we did fix some of the interest rate. But to this ¥2 trillion, if the rate hikes by about 1% sharply, all of a sudden, ¥2 billion of an impact will be given to our profit. So with ¥2 trillion, ¥2 billion is quite, I think, insignificant from our perspective. So renewable energy, I do not see any major problems with renewable energy. So talking about the Japanese market, if the financing cost goes down, I think there is going to be some benefit of unrealized gains. So from a business value perspective, the interest rate for the renewable energy outside of Japan, so the value does not fluctuate very much and we really don't see that happening. For ORIX operation, you included aircraft impairment and you say that you have actually reviewed this from different perspectives. But previously, you said there was a very little possibility that payment will be posted and better assets will be kept and older ones would be sold off. Finance-wise, I think there is room for you to play and you could probably do this in fourth quarter, but you maybe wanted to advance this into the third quarter in terms of impairment evaluation. 52:55 So this was a Chapter 11, and that was a trigger for us to review this and we decided to post the impairment, ¥2 billion or ¥3 billion, I think that was the size. Now going forward into the fourth quarter, aircraft and the investees, real estate properties, you will be evaluating -- assessing these assets more aggressively. 53:49 Well, of course, every year -- actually every quarter as a general rule, we look at this, but we tend to look at things more seriously in the fourth quarter and that is why we tend to see bigger numbers in the fourth quarter. So if we need to post something, of course, we need to post that. 54:54 Well, if you calculate that, for example, in the beginning of '20, the short-term interest rate went down. And I think the assets went down slightly, shrunk slightly, but the interest payment -- financing cost actually went down by quite a big margin in the United States. 55:22 If the rate hike happens 5 times in a year, short-term interest rate will be raised quite a lot. So ¥2 billion per year, you mentioned this number. But after COVID, the interest rate did go down and I'm wondering whether this number is really enough. Usually, I look at consolidated numbers. So ORIX Corporation and ORIX USA, there is a parent-and-child loan and ORIX is doing its own financing. If anything, what I'm talking about now, well, this is full year, but maybe not the whole increase would take place within 1 year, so I have to subtract that, but anyway I do take a look at the whole balance sheet and we conduct ALM analysis, too. The ¥2 billion, this is before the whole cycle is completed. Well, we have calculated the actual date of interest rate revisions. As we have shared, our business performance is steadily moving forward. And if there was to be any further questions, please, of course, ask us – don't hesitate to ask us further questions through the IR Department or Sustainability Department. 58:39 So with this, we'd like to conclude the ORIX's teleconference."
}