{
    "symbol": "CIR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-30 12:28:04",
    "content": " Starting with Industrial and our general industrial business, we expect 6% to 8% organic growth driven by power generation, midstream oil and gas as well as new business activities in China for lithium batteries manufacturing and pricing activities in the aftermarket. In Commercial Marine, we expect about 10% to 12% organic growth, driven mostly by the aftermarket supported by increased utilization and pricing. In total, we expect organic orders decline of about 2% to 3% in this segment, with our core industrial orders growing about 4% offset by the decline in downstream oil and gas and the exit from our loss-making Pipeline Engineering business. In our Defense business, we expect 10% to 12% organic growth driven by increased activities in aftermarket, new products for missile fusing devices and space applications and pricing with some offset from the timing of large defense orders. In commercial aerospace, we expect about 13% to 15% organic growth, primarily driven by the market recovery for the single-aisle platforms at Airbus and Boeing and our position on the growth platform, the Airbus A220, as well as the increased activity in the aftermarket supported by pricing and the rebound in air travel. Elsewhere in the segment, we expect about 15% to 18% organic growth driven by new products for the hydrogen market and increased activity in our medical business. For the full year, we expect organic orders growth in the range of 2% to 4% led by A&D and our core Industrial products, offset by downstream oil and gas. So Nathan, if you look at the first half performance of our Industrial business and you normalize for the onetime large order that we booked last year about $15 million, in adjusted for FX in the first half, the Industrial business, excluding the downstream part, has grown north of 5%. So one of the areas where we're finding a lot of success with our value pricing initiatives in the aftermarket part of our business, and that's also the part of the business where we're seeing, I would say, above expectations growth. And that's driven again by the continued recovery in the commercial aerospace, many new product developments that we're working on for missile -- various missile programs and then the aftermarket strength that we see as well as expected orders on the naval programs that we're on, like the Virginia Class submarine the Columbia and the programs in the UK."
}