{
    "symbol": "CIR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 11:39:02",
    "content": " We navigated ongoing supply chain disruptions, the inflationary environment and rising energy costs to deliver 26% organic quarterâ\u0080\u0099s growth, 3% revenue growth or 10% on an organic basis as well as 550 basis points of margin expansion. These include: first, margin expansion, which includes value pricing, simplification, best-cost country sourcing and manufacturing and factory modernization; second, organic growth through new product development and leverage of our strong aftermarket position; and third, reducing our leverage, which we accomplished in Q3 through adjusted EBITDA growth and further monetization of our real estate portfolio. On the top-line, we reported year-over-year revenue growth of 3% or 10% on an organic basis, with A&D up in the high teens and industrial up mid-single digits. Organic orders were up 26%, primarily driven by A&D and supported by broad-based growth across industrial. We were especially pleased to see continued momentum in our industrial aftermarket, which posted organic orders growth of 14%. As a result of volume growth, pricing, OpEx optimization and accounting for continuation of supply chain constraints, we now expect full year AOI growth of 42% at the midpoint of our range, up from our previous midpoint growth of 36%. Based on our year-to-date performance and our outlook for Q4, we now expect organic orders growth in the range of 8% to 10% in the year. At the segment level, we now expect Industrial organic orders growth of 3% to 5% compared to prior year. In our general Industrial business, we expect 9% to 11% organic growth compared to prior year, driven by power generation, midstream oil and gas as well as new business activities and pricing in both our for market and aftermarket. In Commercial Marine, we expect about 10% to 12% organic growth, driven mostly by the aftermarket, supported by increased utilization and pricing. Turning to Aerospace & Defense for the full year 2022, we expect about 18% to 20% organic orders growth in the segment. In Commercial Aerospace, we expect about 19% to 20% organic growth, primarily driven by the market recovery for the single-aisle platforms at Airbus and Boeing as well as the increased activity in the aftermarket supported by pricing and the rebound in air travel. Elsewhere in the segment, we expect about 16% to 18% organic growth, driven by new products for the hydrogen market and increased activities in our medical business. Our value-based pricing initiative is expected to deliver about $35 million of pricing benefit in 2022, heavily driven by our core Industrial segment and we expect our value pricing strategy to continue to drive growth and margin expansion as we look ahead to 2023 and beyond."
}