{
    "symbol": "HRB",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-07 18:38:03",
    "content": " Turning to the DIY channel, we have spent a significant amount of time understanding how we can return to share gains by speaking to both our clients and our competitorâ\u0080\u0099s clients, and we came away with clear learnings: there is a large awareness gap that H&R Block has as a competitive product, DIY filers do not believe that it is easy to switch to new software, and they do not want to be surprised on pricing when they get to the end of the experience and are ready to file. I think if I start at the top, we've had two really good years in small business performance and so we expect to continue to see Assisted tax growth for small businesses, that's a core component of the strategy. And then, as you know, we're also launching new products like the business formation service, that's a brand new product and so for a year like this, when it's coming out of the gates, we're looking closely at operational performance and making sure that we're really delivering for clients when they raised their hand and say they're interested in that service. So we do the work for the customer, we deliver the experience and the outcome but what we do control is the price and the experience and how that adds up to value for the customer and I think that's one of the reasons why we are taking the steps we're taking on pricing this year is one example, knowing that every dollar matters, so expertise matters and despite a much faster, higher inflationary backdrop, we're only taking nominal price increases in Assisted to make sure that value is really strong. You see it reflected in television really top of the funnel, as we think, building awareness but we are more active than usual in digital channels, really delivering the details about the value proposition and then once you arrive at the website, having built a custom flow, particularly for TurboTax switchers to really educate them on how easy it is to switch video content to teach the filers how to find your TurboTax return and upload it to Block, so a number of things, very specifically to really go at those exact barriers that we understood clearly from clients from the summer. We're focused on account creation, ideally it is the tax desk, but ultimately loading funds into the account and then, keeping those clients engaged by spending and so there's a number of pieces that go way beyond account creation, because this really is the formation of a year-round relationship with the clients."
}