{
    "symbol": "HRB",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-01 19:11:05",
    "content": "  Operator: Thank you for standing by, and welcome to H&R Block's First Quarter Fiscal 2023 Results Call. For a description of these risks and uncertainties, please see H&R Block's Annual Report on Form 10-K and quarterly reports on Form 10-Q as updated periodically with our other SEC filings. While the first quarter is small in comparison to our fiscal year, just about 5% of our total revenue, our Q1 performance met expectations and we are reaffirming our full year outlook. On the capital allocation front, we bought back another 3% of shares outstanding and in October paid our quarterly dividend of $0.29 per share which is an increase of 7% to last year. Beginning with small business, we see a significant runway of growth and opportunity with both Small Business tax and Wave. First, we're building an inside sales capability to convert tax leads into small-business services. This can result in significantly better tax outcomes and a greater level of legal protection for our clients, and simultaneously provides the benefit of having two returns filed with Block, both the individual and the entity. Moving to financial products, recall that we brought our new mobile banking platform Spruce to market in the DIY channel this past tax season. Given most of our marketing efforts are currently timed around the tax season, our metrics are relatively unchanged to the results we shared last quarter with approximately 160,000 signups and $98 million in customer deposits. Well, one of the most proven and effective ways they can do this is by saving money even in small amounts, which is why we've continued to focus on savings-related innovation within the app. We're also enhancing our unique smart tax refund feature, which allows customers to make a pre-commitment to save a portion of their tax refund rather than spending it right away. Last year, this feature empowered the average user to set aside more than a quarter of their tax refund. Alongside product innovation, we're preparing for launch in the assisted channel by educating tax professionals on the clear and different value propositions between Spruce and the Emerald Card to help clients make the best decision for their needs. Regarding Block Experience, we're making great strides blending digital capabilities with human health, resulting in a better, more personalized process for our clients. Last year, we increased the number of clients using a virtual tool by more than three times. We're continuing to help the customer understand the benefit of these offerings, such as digital drop off and approving returns online. Machine learning models are improving how we serve assisted and DIY clients, as well as driving advancements in matching the complexity of a client's return to the right tax professional. Our first year tax Pro role has been reshaped to accelerate their expertise, which increases productivity by enabling them to serve more clients. We've been doing research with our clients and our competitors' clients, and we know that our product is strong, our value is strong, and the number one opportunity we have is increasing awareness that we offer a DIY product. In all expanding virtual capabilities enables us to be well-positioned to help our clients however they want, completely, virtually, or completely in person and everything in between. Today I'll review our Q1 results, our capital allocation practice and our outlook for fiscal year 23. We delivered $180 million of revenue in the first quarter, which decreased approximately 7% or $13 million over the prior year. This decrease was due to the advanced child tax credit being loaded onto Emerald Cards last year, causing a $17 million impact in the quarter. We also expect a similar impact in the second quarter, both of which were contemplated in our fiscal year 2023 outlook. Total operating expenses were approximately $389 million, an increase of approximately 6% or about $22 million, primarily due to higher compensation and technology related expenses and partially offset by lower consulting and outsourced services. While field and corporate salary positions increased more than historical levels, Tax Pro compensation, which is our largest line item, is variable and fluctuates in line with return volumes. EBITDA was a loss of $172 million, an increase of 24% or about $33 million. Interest expense was approximately $16 million, a decrease of about $7 million or 31%. Recall that last quarter we paid off the $500 million, 5.5% notes early, which will result in material savings as we issued new notes in June of 2021 at an interest rate of 2.5%. Pre-tax loss was $221 million compared to a loss of $197 million from the prior year, and our effective tax rate was 24.4%  compared to 24% last year. We also paid out $0.29 dividend in October, which was an increase of 7% to last year and an increase of 45% since 2016. As we have discussed, I am pleased with this guidance given the roll off of the child tax credit, the increase in our effective tax rate compared to last year, and the headwinds we are seeing in the foreign exchange rates. In addition, we are confident in the longer-term target we provided in August of adjusted EPS growing double digits annually through fiscal year 2025. I'm excited about what's ahead and in closing, I'd like to thank our tax professionals, franchisees and associates who embody our purpose every day to provide help and inspire confidence in our clients and communities. There's no question the last couple of years have had a lot of volatility and different things impacting volumes, changing dates, et cetera. We don't know for sure where the season ended until the IRS officially releases their data, but you know, we know every year historically. We've been in the zone of about 150 million e-files plus paper, and as we look ahead to the upcoming tax season and factor in the various puts and takes on employment, et cetera, we expect the industry to be back to normal growth rates, which we consider to be about 1%. Yes, I mean, we do -- we obviously don't know where the industry will end from last year until the IRS releases that data, so we can't comment on that specifically. So that's our working assumption going into the year, and again, expecting the industry to get back to normal of about 1% growth. And then Jeff, I think if I heard right on your prepared remarks, you talked a little bit about the DIY product having a different approach, and I'm wondering, I know you want to be cautious about what you say, but I'm wondering if you could talk about if it's marketing, if it's pricing, if it's product, maybe how you're looking at the DIY product and holistically what kind of changes do you think you can make and gain market share? You know, when we look back over recent years, we're pleased with our new client growth. We're pleased with the pricing ability we've had and the revenue growth, but we're not pleased with market share. And so over the last several months, we have looked at everything and I think most importantly, talking to our customers and talking to our competitors' customers to understand where we are relative to the market. Now, make no mistake, we're always improving the product and we know that faster and more personalized is the key, but we know we're starting from a really good place there. We know the same to be true about the value we're offering, especially relative to our number one competitor and what they have done historically in pricing, so we know it's not value. And we're taking a holistic approach in marketing, in channels, in product, really across the board to make sure that we take a completely different approach for this year. You know, if we expect the 1% overall growth, I think our base expectation is fairly consistent, what we said for a number of years, which is assisted category, flat to slightly up and the DIY category likely growing faster, call it 3% to 4%, getting you to that 1% overall. We feel very well positioned here, both because of our Tax Pro network and our ability to utilize tax professionals as well as our pricing and value proposition. And so that continues to be a growth channel for us, both to acquire DIY customers, but also if you start as a DIY filer demonstrating the value of human help and expertise. Our products in virtual, we feel very good about because of our leverage of the built in Tax Pro network, our ability to connect somebody with a true expert quickly, and the price. I know you just mentioned the speed of connecting the customer to the Tax Pro, and you all had done that well last year. Obviously for several years now, we've been talking about blurring the lines between these capabilities, because what we see at the macro level is the customer seeking help. And so whether that's coming to an office, getting us to do the work virtually or starting yourself, but relying on an expert to help you finish, that gives us great confidence because of our position as experts and because of our Tax Pro network that's still well trained, built in, we have a very strong asset that we can leverage in these growing and new channels. The thing that we see is the key is, when a customer has a question and they hit that help button, they want to get answers and they want to get connected to somebody who actually has the tax expertise to help them answer those questions. And versus competitors where we've seen that first stop largely be at a call center, not with a tax expert, we've seen that to be a real point of difference and something we feel very good about. So we'll continue to lean into how do we make the experience as fast as we can, leveraging the next -- the expert network of Tax Pros and making sure that our price proposition relative to the competition remains strong. And again, across each lineup in the skew, we feel very good about where we're priced today, especially as we see the competitor take more and more price increases. Yes, the only thing I was want to add is just the piece we're also working on is figuring out when do we introduce the product and making sure that we're introducing at the right moment within the experience and balancing being transparent, but also providing the help at the right time. And I think that's a, that's a really important balance that we're trying to, trying to get right, because we want to make sure clients know we have these products, we want to provide that help at the right moment, but not, you know, provide an upsell screen at every single turn, so that's a really important part of the initiative this year as well. And what I mentioned about the machine learning models is, this is one example, where we can see if a customer might be getting frustrated in the experience and use that as a way to introduce the option to them that they can get help. Our inferences that you're going to be very proactive and visible with marketing of the DIY product because of what you were saying earlier, Jeff, about just brand recognition and the need for improvement there. And so it's possible that you or I may not see that message at all, but based on our ability to find the right audience who is most predisposed to that product, that's who it would be delivered for. The last year the 8% NAC growth in Assisted was two-thirds from mix and that was, I believe retail and crypto investors made up a portion of that and then the child tax credit. Yes, tag team this, Tony, but I guess I'd start off by saying that pricing and assisted, we feel good that we're able to continue our low single digit price increases. As we've mentioned in our prepared remarks, and even going back a bit, the number one headwind that we've contemplated in our outlook is the roll off of the child tax credit. Yes, and just going back to last year, I think the other one, Scott, that we talked about was first time filer roll off, which we did see in our assisted business benefit that we got in 2021 that didn't recur in 2022, and that provided a net average charge increase as well. And for this year, when you think about that headwind, call it 1 to 2 points, and, but we're netting that against our targeted price increases to get us to the net average charge that we want to land on for the full year, which is that kind of low single digit net average charge that we've been talking about."
}