{
    "symbol": "PLUG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 21:09:05",
    "content": " And when you think about it, these are really the beginning of the future peaker plants that combined with the work Sanjay's doing with pipelines and well as green hydrogen generation, that's really the bigger vision. Our activity in the wind belt, up in Denmark with H2 Energy and with other activities we're looking at, I think that's where we'll be focused with -- obviously, with Renault JV, we're focusing on leveraging their capabilities. I believe you're actually seeing some of that later this year as part of the sort of back half weighted hoping you can size that opportunity, I guess, as a run rate actually miss her, but more importantly, how does that business look over the next few years, given that it looks like it's one of the -- it's not the biggest stationary opportunity in the near term. Now take that into the liquid hydrogen market and think about long sort of transportation application, mobility applications, when you start to think about the diesel parity, our view always has been, it's not about thinking about can we charge more than diesel because it's -- our system is more efficient. And the fact that we've been building this green hydrogen plant, the work we have done, the learnings we have had, I think, really, really stands out as a big force mover and a competitive advantage for Plug. I think you guys had talked about kind of looking for offtakers for about 70% of very green hydrogen production, the PTC kind of helps, I guess, seemingly kind of derisk some of this as well. But as Andy touched on some of the opportunities that we're starting to see in the stationery market, that can really, really drive the demand for our hydrogen for some of our customers, and that would make that we only load some of these plants for 50% instead of 70%, but that's TBD at this point in time. We're ramping -- as Andy mentioned, we're moving quickly to ramp the electrolyzer sales going from kind of scaling the plant is first half to max production in the short term, that's a big step function change. But I think today, we -- if you take a look at what we're doing with H2 Energy in Denmark, perfect opportunity where Green hydrogen will be feeding a pipeline, which will be a public access pipeline for green hydrogen, no better way to do it."
}