{
    "symbol": "PLUG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 20:12:03",
    "content": " Please state your question. Please state your question. Please state your question. So give us some time, there's a lot going on behind the scene and really looking forward to actually talking a lot more about it even in North America, as you actually really look at when 2023 sort of like in the second half of the year. So 2023 out -- by the way, we -- I'm going to take another step back -- we have a good deal of business activity, which will occur with SK this year, including supporting electrolyzers in South Korea, bus fleets as fueling stations where we have quite a bit of business in fueling stations that will be seen as revenue this year as that business begins to grow. Please state your question. Please state your question. The real -- where we're going to see as we turn on those plants this year and ramping on into next year, that fuel will become a more -- increasingly more meaningful part of the mix as we turn those facilities on and moving into '24 but for this year, that's kind of how that roughly breaks down. Please state your question. So those are near-term milestones that are very important for us because it's really going to come from shipping more product, which is a big chunk of what we're going to do this year, and that is already accretive to leveraging the facilities, which we get through volume and then the gas improvements that we already see with natural gas prices abating as well as turning on the green hydrogen facility. Please state your question. Please state your question. But I know that there's probably 20 trailers that -- or hydrogen trailers that we're building or have been built that we're looking to ship and that we can see that as we sell our liquefier and electrolyzer products, people are coming to us about our cryogenic trailers too. Please state your question. Please state your question. Please state your question. Please state your question. I think that -- and we -- and it's really related to what I talked about in January with the construction at our customer sites being slowed down because of the challenges in supply chain and so this year, the number of sites we will do will be 2x, and we know where they're going. Please state your question. Please state your question."
}