{
    "symbol": "PLUG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 22:36:12",
    "content": " With deployment of our green hydrogen network 70 tons which will be available by year's end, our cost will be one-third today's cost. Please state your question. I guess obviously, it looks like there's an awful lot of new automation in and I'm wondering if you can talk about kind of initial yields with that automation and what you're seeing so far as you to start to map that up and get prepared. Please state your question. So we've got a tremendous amount of resources more than we've ever had focus on reliability and going back and putting in improved stack software improved, improved batteries different components that will really step function change that cost curve with units which is why Andy said, just within a short period of time we're going to be reducing that cost by over 45%. So the number that we have been targeting and we've been internally discussing and thinking about is between 70% to 80% of that capacity we do want to have under long-term contracts, but we absolutely want to have that 20% to 30% of that capacity as a flex capacity can help other players in the industry or the potential customer in the industry so that the hydrogen really ends up being viewed as being very ubiquitous and the green hydrogen keeps on getting more and more economical. Because when we think about this whole green hydrogen offtake strategy on a long-term basis is, and I think you know this but it's probably important for others to keep in mind so the demand multipliers that comes from new application is a very important one as well that we all need to keep in mind, like forklift consumes one kilogram of hydrogen a day. Please state your question. So just as a follow-up then it sounds like electrolyzers and Class eight trucks, are really key markets that you're prioritizing for potential acceleration and that you're happy with the targets you have for green hydrogen, over the next couple of years. The electrolyzer business, I can't tell you how big it could be because it's -- Sanjay you throw around a number to me that they think there's... \n Like 150 gigawatt of potential pending opportunities... That's why, I hired these folks from Tesla. Please state your question. Please state your question. I think we're also and I think probably more in the partnership side thinking a lot about large-scale storage and pipelines nothing -- I don't think we would do either without partners, but that's certainly an area we're giving a lot of attention to. Please state your question. I mean, when you -- these are businesses that we're scaling with new products right out of the gate, if you look at our electrolyzer business as an example, it's probably going to be six, seven times the volume we did last year. But I would just say in general think about it as new products that we're quickly scaling and rapidly growing and it's anywhere from low double digits to in some cases up north of 20%, but we'll scale all of them up to that 30% as we move to the second half of the year and onward. So we're not going to jump into entering into a PPA that we have to live with for the next 15 years given short-term dynamics here in the market, but it actually gets us well beyond that 70 ton numbers in terms of the already signed PPA with wind and even some of the solar deals and also some of the other hydro deals that we have. Please state your question. But look, we're not surprised that there are others that are coming into this production of the green hydrogen from a liquid -- you should -- we'll probably expect to see more and more of that and that's only a positive for the industry, because it will help grow more apps which is the business we're in as well. Please state your question. So, if we're looking at 70 tons per day green hydrogen at the end of the year and you want to keep 30% flex capacity that sounds like you're roughly balanced to meet maybe 50 tons per day internal need."
}