{
    "symbol": "AVNS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 12:30:29",
    "content": " In total, our pain management business grew 2.6% in the fourth quarter and 2% for the full year, excluding the negative impacts of foreign exchange and contributions from our OrthogenRx acquisition. Gross margin was 55.6% in the fourth quarter and 56.8% for the full year, driven by favorable product mix, inclusive of OrthogenRx and our plants continuing to incrementally deliver on the manufacturing efficiency strategy we set forth at the end of last year. We delivered free cash flow of $72 million or approximately $50 million greater than last yearâ\u0080\u0099s free cash flow, excluding the CARES Act refunds, we solidly delivered against our primary objectives, which as noted earlier, effectively laid the groundwork for our longer term transformation efforts. Total reported sales for the fourth quarter and full year were $217 million and $820 million, increases of 12.4% and 10.1%, respectively. In summary, 2022 was a strong year for the company, with adjusted gross margin improving 450 basis points compared to last year this year, while adjusted EBITDA margin exceeded 20% in the fourth quarter. Additionally, these priorities are aimed at rightsizing our cost structure and enhancing our operating profitability with EBITDA margins ultimately exceeding 22%, while generating annual free cash flow of $100 million. Separately, we expect to earn between $1.60 and $1.80 of adjusted diluted earnings per share for 2023, while delivering at least $60 million in free cash flow, excluding the one-time cash costs associated with the restructuring efforts expected to total between $20 million and $25 million. Finally, including the in-year impact of the approximately $35 million annualized product portfolio rationalization decisions, the company anticipates comparable organic revenue growth to be low single digits. And then for 2023, I think, well, just taking a step back, it looks like OrthogenRx, including an extra week or two, that pulls over from that inorganic for 2022 would be coming out about $80 million for a full year on an annualized basis. We are focused on what we can control and manage and we think 2022 results -- 2022 results have built the foundation, as we said back in January to deliver on the commitment that we are confident priorities we detailed in this transformation program, combined with our market leading portfolio and the markets we are in to position us for sales growth margin expansion and meaningful free cash flow generation in 2023."
}