{
    "symbol": "AVNS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 07:45:20",
    "content": " Although, first quarter SG&A was slightly elevated versus our expectations, we remain focused on delivering full year SG&A as a percentage of revenue below 40%. In summary, we're off to a solid start to the year building upon our 2021 execution and are well positioned to achieve our primary objectives for 2022 around consistent organic growth, delivering on our OrthogenRx strategy, making meaningful improvements in our gross margin profile, and demonstrating our ability to deliver material free cash flow. Although, SG&A spend was slightly higher than anticipated, we are committed to ensuring full year spend remained below 40% as a percentage of revenue, the additional spending in the first quarter related to selling and marketing investments planned for later in the year and inflationary costs on compensation and outside services. Now let's to review our first quarter results, total reported sales was $197 million, up 9.2% compared to last year, with adjusted EPS of $0.26. But then our digestive health portfolio NeoMed grew more than 30% from the continuation of conversions to our ENFit technology despite supply constraints impeding even further growth, separately, adjusting for the product supply challenges, respiratory health sales would have been down closer to 5%, consistent with our expectations, given the pandemic tailwind from the first quarter of last year. Excluding the contribution of OrthogenRx, we delivered $63 million of sales, $3 million ahead of prior year driven by a return of elective procedures for ON-Q and a strong performance across our interventional pain portfolio growing more than 9%. Adjusted operating profit totaled $18 million compared to $16 million in the prior year, higher sales and improved gross margins were partially offset by higher spend across SG&A. We remain focused on delivering our free cash flow target, which will require a meaningful improvement in our cash collection activities, combined with appropriate inventory management, we still anticipate approximately $25 million of capital expenditures for the full year. I mean, we're confident in the $70 million that we've talked about, we have said that the entire business will be mostly accretive to overall Avanos and in our diligence, we were very much aware of the reimbursement changes, which is sort of reporting ASPs, if you will, currently in Q2, and then a Q3 reimbursements shift to more of an ASP plus 4% to 6%, depending on where Medicare lands, and that's really going to affect all suppliers at any type of level of shots whether five, three, or one. And we think, again, we should be able to be above that midpoint between 55% and 57% for the year given how we got off the start to the year and the programs that are in place, but we're just -- we're very cognizant of the overall macro environment and we just don't want to get too far ahead of something until we put a few more months and quarters on the board."
}