{
    "symbol": "AVNS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 22:33:06",
    "content": " Although we fell short of consensus revenue estimates for the second quarter and are also updating our full year guidance for revenue and adjusted EPS, which Michael will discuss further, we continue to experience consistent demand throughout our product portfolio and remain confident in our ability to execute against our longer-term financial objectives as the supply chain and other macroeconomic dynamics improve. We are very pleased with our gross margin results for the second quarter and first half, but are cautiously optimistic for the duration of the year, given continued headwinds related to raw material availability, inflation across all manufacturing inputs and shipping and distribution costs that remain elevated. However, as a result of higher interest expense payments, slightly lower operating earnings and growing inventory balances due to inflationary pressures on our raw materials and managing our backlog, we now anticipate free cash flow to be closer to $80 million. In summary, even with various macroeconomic headwinds, including but not limited to inflation, currency and supply chain, we had a solid first half and remain focused on achieving our primary objectives for 2022 relating to organic growth, OrthogenRx execution, gross margin improvement and material free cash flow generation. We now anticipate delivering net sales between $815 million and $835 million for fiscal year 2022 and adjusted EPS between $1.45 and $1.65, primarily due to further projective negative foreign exchange impact and higher interest expense totaling approximately $0.10 as well as slightly lower operating earnings due to lower gross margins in the back half of the year. Yes, I would just add to that, that the $815 million to $835 million on revenue, although than FX, which has a meaningful impact, $5 million in the first half of the year, and we're estimating at least $5 million in the back half of the year. If those back orders clear up, then we have line of sight, getting us to the higher end of that range of that $835 million is very realistic if those back orders we're not able to secure the raw materials, as Joe just mentioned, that's needed, then more towards the midpoint, lower end would be possible."
}