{
    "symbol": "DTEA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-16 13:19:05",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to DAVIDsTEA's Second Quarter 2022 Earnings Webcast. Retail and wholesale channels were stable, however primarily in our online channel, there was a slowdown in the second quarter of 2022, with sales and profitability decreasing year-over-year mainly due to an uncertain macroeconomic environment dampening demand. Despite these temporary challenges, our wholesale business in Canada expanded in the second quarter with sales more than doubling year-over-year on the strength of a growing footprint at grocery chains, drug stores and big-box locations to 3,800 doors, including a wider assortment of wellness-focused and organic products. Sales decreased 18.7% to C$15.2 million during the second quarter of 2022, mainly due to a decline in e-commerce sales of C$6.5 million. Brick-and-mortar sales grew 35.5% year-over-year to C$4.2 million in the second quarter of 2022, partially due to the absence of pandemic-related restrictions in Q2 compared to the same period last year. For their part, sales from our wholesale channels more than doubled to C$2.7 million in the second quarter, as mentioned earlier by Sarah. In terms of revenue breakdown, e-commerce, brick-and-mortar and wholesale channels accounted for 55%, 27% and 18% of total sales, respectively in the second quarter. Gross profit reached C$6.5 million in the second quarter of 2022, down C$1.5 million from Q2 of '21, mainly due to the sales shortfall, partially offset by lower delivery and distribution costs. As a percentage of sales, gross profit amounted to 42.5% for the quarter compared to 42.7% in the second quarter of 2021. Excluding software implementation and configuration costs, as well as the wage and rent subsidies received under the Canadian government COVID-19 Economic Response Plan, adjusted SG&A declined 1% year-over-year to C$9.9 million. As a percentage of sales, adjusted SG&A expenses in the second quarter of 2022 attained 65% compared to 53.5% for the same period last year. Adjusted net loss, which excludes the impact of restructuring plan activities, the wage and rent subsidies from the Canadian government as well as software implementation and configuration costs amounted to C$3.5 million compared to an adjusted net loss of C$2 million in the same period last year. At quarter end, we had C$19 million in cash held by major Canadian financial institutions backed by a strong growth plan."
}