{
    "symbol": "SWIR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 21:25:24",
    "content": " As a reminder, today's presentation is being webcast and will be available on our website, following the call. Before we get started, I will reference the Company's cautionary note regarding forward-looking statements. These statements include our strategy, goals, objectives, expectations and commentary regarding the outlook for our business. Our forward-looking statements are based on a number of material assumptions, which could prove to be significantly incorrect. Additionally, forward-looking statements are based on our management's current expectations, and we caution investors that forward-looking statements, particularly those that relate to longer periods of time, are subject to substantial known and unknown material risks and uncertainties that could cause actual events or results to differ significantly from those expressed or implied by our forward-looking statements. I draw your attention to a longer discussion of our risk factors in our annual information form and management's discussion and analysis, which can be found on SEDAR and EDGAR as well as other regulatory filings. With that, I'll now turn the call over to Phil for his quarterly update. Q1 revenue grew 60% year-over-year and 15% sequentially, well ahead of our guidance for the quarter. In the first quarter, we generated $8.6 million in adjusted earnings from continuing operations and $15.8 million in adjusted EBITDA, our most profitable quarter in more than three years. Our strong revenue and profit growth in Q1 were the result of solid customer demand, improved execution in manufacturing and operations, and our expanded product offerings, especially in 5G modules and routers starting to ramp. We are seeing continued momentum in key IoT markets, including industrial, enterprise, energy and first responder as more companies are collecting business-critical data from the edge of the network. And customers are wanting to manage their equipment in the field to avoid costly downtime, monitor performance and do important preventative maintenance. In Q1, our product revenue, which includes both, modules and routers, was up 86% compared to last year. In modules, we had a strong increase in 4G shipments in the first quarter, and our 5G devices are continuing to ramp. In Q1, we announced availability of our next-gen 5G module, the EM92, which enables high-speed, low-latency connectivity for demanding industrial enterprise networking use case. And our low-power wide-area modules are getting solid traction in areas including smart meters, public lighting and asset management. In our AirLink business, sales of our rugged RV series routers improved year-over-year. And sequentially, we saw our 4G, 5G XR series shipping into key markets, including utilities and first responders in higher volume. We are expecting the XR Series to be our fastest ramping product line in our history as these routers get certified on more global carrier networks, including the emergency services network in the UK. In the first quarter, we closed a number of new XR deals with major utilities and leading industrial manufacturers, and we continue to build on our leadership position in the public sector and first responder market with new state and county wins. In our connectivity business, we are expanding our network access and in Q1 partnered with Orange Wholesale to strengthen our European coverage and global reach. And our APAC connectivity business continues to grow, especially in Australia and New Zealand. We're just beginning a multiyear 5G rollout that will introduce new, high-speed applications and accelerate machine learning and AI. Leading industrial and enterprise customers are digitizing their assets so they can collect data from their remote equipment, control endpoints and run important analytics. Many of these customers are looking for a trusted western supplier that can provide them with both IoT devices, seamless two-way data connectivity. Before I turn the call over to Sam to provide more details on the first quarter, I'd like to provide an update on our manufacturing capacity and the . Regarding manufacturing, we continue to ramp up capacity in Q1 in Mexico for production of routers and gateways. This will help us in Q2 as we build and ship more products, especially our new RV and XR series routers. Regarding the tight supply chain, our procurement team continues to do a great job with our partners and suppliers, and we're using our strong balance sheet to continue to secure raw materials. We are continuing to secure orders from our customers for the out quarters, and we expect the supply chain to remain tight throughout 2022 and into 2023, particularly for semiconductor components. On April 18th, we announced that we signed and closed the sale of Omnilink to Sentinel Advantage for $37.6 million in cash, the equivalent of 2.9 times 2020. We continue to value Sentinel as an important and growing customer, and we're providing them with our connectivity  embedded modules going forward. We have reviewed our strategic options and decided not to develop additional products for this business, which has resulted in absolute inventory and an impairment charge in the first quarter of this year. In summary, I would like to thank our employees, customers and suppliers once again as we collectively work through the challenges of tight global supply chain environment, COVID-19 pandemic. We're off to a good start in Q1, and we expect 2022 to be a robust year for Sierra Wireless. Total revenue in the first quarter was $173.0 million, an increase of 60.1% compared to $108.1 million the same period last year. IoT Solutions revenue was $133.7 million in Q1, up 79.3% year-over-year. Enterprise Solutions revenue was $39.2 million, an increase of 17.2% year-over-year. Connectivity, software and services revenue was higher by 3.7% to $34.9 million compared to Q1 of the prior year. Increase in connectivity software and services revenue included growth in our core connectivity area, including smart connectivity, which was partially offset by decreases in our legacy 2G/3G European business and our home security business. Gross profit in the first quarter was $55.1 million, up 46% year-over-year. GAAP basis, gross margin was 31.8% compared to 34.9% in the first quarter last year, primarily due to the obsolete inventory in our home security business and expedited freight related to COVID shutdowns. Non-GAAP operating expenses in the first quarter were $45.0 million, down $1.4 million compared to Q1 last year and down sequentially. In Q1, adjusted earnings from continued operations was $8.6 million compared to a loss of $9.6 million in the first quarter of 2021 and $1.1 million in adjusted earnings in Q4. Cash flow used in operations was $23.7 million in Q1, primarily due to our investments in inventory, including prepaid inventory advances. This investment has allowed us to both, deliver strong results in Q1 and provide strong Q2 guidance. Regarding guidance for the second quarter, the impact of COVID-19 on our global business continues to remain uncertain. While we continue to experience and evaluate the effects on our business, the overall severity and duration of adverse impacts related to COVID-19 on our business, financial condition, cash flows and operating results for the remainder of 2022 and beyond cannot be reasonably estimated at this time. As Phil mentioned, global demand for our products remains strong. Given this environment, we are guiding a revenue range in the second quarter of the year of $160 million to $175 million, with a midpoint of $167.5 million. And then, also, Phil or Sam, I'd love to hear your thoughts kind of on gross margins for the remainder of the year. Sam, you can kind of comment on the gross margin question. Look, right now, I mean we're -- the demand for our products is incredibly strong. And right now, it's really about just kind of getting the parts, optimizing the supply chain and getting the things in place. So, we're not really guiding for the second half of the year at this point, and it remains -- we're just going to do it a quarter at a time, but I think it's fair to say demand for the products are strong. And for us right now, it's just about execution quarter-on-quarter. And on the gross margin -- yes, I think I mentioned last quarter, that we're not providing guidance on gross margin, but I did say that we expect like small sequential improvements in gross margin. I think we've seen it here on a non-GAAP basis, and I expect that to continue for the rest of the year. It's down year-over-year, down sequentially. Going forward, we'll continue to manage it tightly. And it's not going up, I'll put it that way. And then one last question for you, Phil, just demand picture. Customers are placing orders into 2023 at this point, so -- which gives us better visibility into the demand environment probably than we've ever had before. In terms of component shortages, it's a mixed bag. But I will say, just given the number of components, the enterprise product lines are -- tend to be a little more affected by that just because we have more components in them, and we tend to use some of the semiconductor components that tend to be more highly constrained. So, I’d say, the enterprise business is more affected by supply chain shortages than the modules at this point. I guess, I’m just trying to get a little more color on how you're able to deliver upside in  components, and so many of your competitors are continuing to struggle to procure supply to even meet their guidance. I think, one of the things, just to remind you, when we were back in the depths of the real challenges we had in the third quarter last year, we kind of put a 5-point action plan in place to kind of get ourselves out of it. And one of the points at the time was, look, we were using our balance sheet to play offense. We've also done -- I think, I'm proud of the team that did a good job managing some of the challenges with respect to some of our -- the COVID-19 impacts, particularly in China. So, it's a combination of some decisions we made prior to play offensive with our balance sheet, solid execution and kind of having a multisided manufacturing strategy in place at this point. The 30% gross margin, I haven't seen a number like that in a long time. Well, I mean, I guess, I would say that's a -- there's a multifaceted answer. And Sam, you can kind jump in if there's some specifics there. We've certainly seen a good uptake of some of our higher end, higher-performing modules, which is helpful. So, we're able to kind of amortize what costs we have. Our routers have been constrained a little bit, so that kind of makes a bit of an impact. And I think the message that I'm giving to my team, and we just got to work closely with our customers. Customers will remember how we behave in this environment, and we're working really hard to make sure that we're getting them the products we need but also doing things that are right for our business as well. And the customers, I think, understand that. So, I mean, it closed in April, so about -- there won't be much in our Q2 numbers. So, we get to have Sentinel as a valued customer, both in modules and connectivity going forward. And therefore, no impact to our profitability in 2022, which I think is a very important point. Yes, we're really happy with it at close to 3 times revenue. And then, yes, we'll get a portion of that revenue back in 2022, based on our connectivity agreement with Sentinel with the buyer. I mean, our connectivity revenue from Sentinel won't be at those levels. Hey Phil, I think I heard you say that Mexico is still ramping. So, as that continues to ramp, what might be the incremental benefits that we'll see in subsequent quarters from getting Mexico...? Well, look, I think we've assumed that we've got a certain level of ramp going into Q2. I mean, really, the biggest thing we're trying to manage there is kind of a transition of products from our newer product or two of our newer products, which are the XR Series; 4G/5G routers. One, it's a better product for us and for our customers. And third, some of our older products, the MG and other series, are -- tend to be very highly constrained. So, I think the ramp-up in Mexico is kind of included in our guidance. And really underneath the covers there, it's around kind of migrating some of our -- towards some of our newer products. From a working capital perspective, inventory went up $6 million sequentially, which isn't all that bad at all, given the revenue uptick. So, when you look at inventory, you kind of also have to look at our prepaid to kind of get a sense of them because some of it is prepaid in terms of how we work with our contract manufacturers. And that is, again, to basically invest in that higher revenue base and that growing higher revenue base, we made that investment. I mean, it's been made, and we're happy with that. I think typically, as new products ramp, there's a temporary impact on margins. I mean, yes, it's not really material, to be honest. It's sort of baked into the cake that what I talked about earlier that we expect small sequential increases in gross margins going forward for all the reasons we've talked about, price increases, mix, recovery from 2021, COVID-related shutdowns, all those things, more volume of a scale. And that's sort of baked into the cake, a small impact from new product releases. Great to see the type of execution here in the second quarter, where a lot of competitors have found it to be pretty challenging. Just I wanted to ask if you could provide a little bit more detail, I mean, such strength from the IoT Solutions business. I mean, we're seeing very strong uptake in our 4G products. I mean, particularly some of our products in smart meters, industrial lighting, asset control, very strong demand there. Some of our new 5G modules are also getting really good pickup in industrial, networking and public safety environments there as well. So, our new products are getting great reviews. And from an IoT Solutions perspective, it's really, I would say, very strong in industrial, smart meters, energy, oil and gas, those kind of markets, public safety, really very strong demand from there. And then, just thinking about how things are likely to play out for the remainder of the year. The Company has clearly invested heavily in the inventory balance over the last several quarters, and that's paid off pretty well for the Company. We -- I think, I'll make some comments. Look, I think Sam kind of mentioned, we do expect our inventory levels to kind of peak here in the first quarter. So, it's our expectation that we start turning this into cash. But looking back, we chose to invest in working capital to support our higher revenue base. And on a free cash flow basis, we do expect that working capital to normalize at those higher levels. And then for sure, when you run it through the models, you're going to be looking at positive in the second half of the year. Then just sort for like the revenue trajectory, I mean the first half has been quite strong and thinking about the second half. I just think from a demand environment, it is so difficult to say what is \"normal\" and what is seasonal because there is so much noise in the system with respect to the supply environment. So, even if they're able to get stuff from us, so they're able to get the rest of what they need to put stuff into the market. I think, what we see and kind of what's comprehended in our guidance is our backlog remains far in excess of what we're able to ship. We are starting to secure orders into 2023, and we expect to remain supply constrained certainly throughout 2022 and probably into 2023 as well. And us and along with our manufacturing partners there, we're able to do a pretty good job in managing those situations, so they didn't impact the financial results. So, that's about all I can say. Most of what's built in China these days is modules, and so we kind of flex back and forth between China and Vietnam. And then, the -- there was a comment in the prepared remarks just around COVID uncertainty in general for the remainder of the year, makes it difficult to forecast. And there's good indication that that's getting a lot better, but I don't think it's time to remove that risk language yet. I mean, look, I think that it's fair to say that this is probably the longest lead time that we've seen from our customers. And some of it is, I think just the new realization, the new world that customers recognize that they need to give us and give their other suppliers as well more visibility from that side. And yes, in some cases, we are working through non-cancellation kind of provisions in some of those orders, particularly for orders that have very long lead time or unique components that are difficult to move around. So, the short answer is, I think the visibility is probably as good or as some of the best we've ever seen. I was wondering if you could talk a little bit about what you're doing on that front from a gross margin standpoint, from a pricing of a connectivity standpoint. So I do want to -- if you comment -- if you just kind of look underneath that, I think I've talked about that. The major, big portion we're focused on is what I'll call our core connectivity business. We also have some other businesses that I'll call them legacy businesses, noncore businesses. Gross margins from that point of view, look, I think there are some public compares out there, and I think our goal is to kind of get new there. I mean, I think our goal is to get -- should be in the 50s for that kind of business. You had obsolete inventory written off, and they're costing 900 basis points. So when I think about the normalization of that, it's still below where it's been. So I just want to clarify, it sounds like there's still some component availability issues on that front. Or are there some other mix issues going on with new products, like the 5G solutions. Correct, there was the sort of obsolete inventory related to the decision around harvesting the home security business, which you also saw an impairments in the GAAP numbers for that. That's onetime in nature, getting Mexico ramped up as we were sort of shut down in Vietnam with COVID. And a little bit of mix, like the new product introduction is a small impact there as well with the new 5G product, but nothing material on that front. So again, as we sort of move forward and that mix improves, those onetime items, just the pace, we'll see improvements there in the gross margins. That's an area of key focus for us, an area I don't think we focused as much on as a company. And I think it's early to say with that, Scott. But I think rest assured, we are clearly focused on driving that kind of attach rate up. And last one, I'll put it in the unfair category, as you know, I'd like to ask. But, as we look at the world today, you -- I mean the first quarter results are where we expect you to be maybe 4, 6 quarters out. So, it's an absolutely phenomenal job on that front. When I think about a normalized level of operations, maybe if we call it the second quarter still supply constrained, I'm trying to get my hands around what the growth rates are as we're thinking about '23 in a normalized environment for modules, the enterprise side and then the services side. So with that, we're just going to do one quarter at a time and continue to focus on delivering profitable growth. I'd once again like to thank our customers, suppliers, employees for helping working through a difficult situation."
}