{
    "symbol": "CSPI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-10 15:02:20",
    "content": " While the segment's revenue is relatively flat with a year ago period, the backlog increased to $60 million due to a rising demand for our products and services. Overall, we recorded net sales of $13.3 million for the quarter, which was slightly below a year ago level, but represents 11% sequential increase over fiscal 2022 second quarter results. Services grew 37% compared to a year ago third quarter and was up 30% from fiscal 2022 second quarter, and overall backlog as of June 30, was $20 million and $17.3 million on March 31, 2022. We reported gross profit of $5 million, or 37.3% of sales compared to $4.2 million, or 30.8% of sales in the year ago fiscal third quarter, representing an improvement of over six percentage points. Service revenue grew 37% compared to the year ago third quarter and was up 30% from our second quarter, which is a combination of the growth in MSP as well as a higher ASP. Despite this decrease in revenue, we only reported a slight decrease in product gross margin of $100,000 due to an increasing of 3% in product gross margin as a percentage of revenue compared to the year ago third quarter. We reported net income of $684,000 in the fiscal - third quarter, which is $0.15 per diluted share compared to a net loss of $423,000 or $0.10 loss per share for the fiscal third quarter of fiscal 2021. We ended the fiscal third quarter with cash and cash equivalents of $21.4 million as of June 30, 2022, which was approximately an increase of $1.4 million from September 30 of 2021. I also want to highlight that the Board's decision to restate and declare a quarterly dividend of $0.03 per share payable on September 9, 2022 to shareholders of record on the close of business on August 22, 2022. Let me go back to a press release of November of last year, and that's the one -- the order for the $1.8 million order for the High-Performance Products group, the ARIA product for, I guess, it's National Intelligence Agency."
}