{
    "symbol": "AMWD",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-26 14:09:05",
    "content": " Our teams delivered fourth fiscal quarter net sales of $501.7 million, a growth of 6%. We repurchased $25 million or 300,000 shares of stock during the fiscal year and paid down $15.5 million in debt. We will continue to reduce our backlog throughout the fiscal year and pricing will contribute meaningfully year-over-year, yielding a mid-teens to high-teens growth rate and net sales. Net sales were $501.7 million, representing an increase of 6% over the same period last year. Adjusted net income for the fourth quarter of fiscal year 2022 increased $0.4 million due to higher sales and a onetime tax benefit, partially offset by higher material and logistics costs, combined with supply chain disruptions. Adjusted EBITDA for the fourth fiscal quarter was $44.5 million or 8.9% of net sales compared to $48.2 million or 10.2% of net sales for the same quarter of the prior fiscal year. Financial results for the fiscal year ended April, net sales for the current fiscal year were $1.857 billion, representing an increase of $113.2 million or 6.5% from the prior fiscal year. Looking at our sales channels for the quarter, the combined home center and independent dealer and distributor channel net sales increased 4.5% for the quarter, with home centers increasing 2.5% and dealer and distributor increasing 11.9%. Recognizing a 60- to 90-day lag between start and cabinet installation, the overall market starts in single-family homes was up 3% for the fiscal fourth quarter. Looking at completions during our fourth fiscal quarter, we saw a 4.3% increase year-over-year, which further supports timing impacts that are occurring in the market today to represent a 120-day-plus lag between starts and completions. Gross margin in the fourth quarter of the current fiscal year was negatively impacted by continued higher material and logistics costs, combined with disruptions in our supply chain. The ratio to net sales decreased 60 basis points, resulting from controlled spending and leverage created from the higher sales in the fourth quarter of fiscal 2022. For the fiscal year, the company paid down $15.5 million of debt, and we repurchased $25 million or 300,000 shares. Shifting our focus to fiscal 2023, we expect mid-teens to high-teens growth rate in net sales versus fiscal year 2022."
}