{
    "symbol": "PRA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 15:25:07",
    "content": " Gross premiums written increased almost 13%, driven by an additional month of NORCAL premium in the current quarter given the timing of the close of the acquisition last year and continued renewal pricing gains on the legacy book in our Specialty P&C segment. Despite the improvement as compared to last quarter, our combined ratio increased by 3 points as compared to the second quarter of 2021, reflecting the expected buildup of NORCAL's DPAC amortization post-acquisition following the application of GAAP purchase accounting rules in 2021. While we reduced NORCAL loss ratios and certain loss ratios in our legacy standard position book during the second half of 2021 to reflect improvements in the business, this beneficial impact was muted by a prior year ceded premium adjustment in the current quarter as well as the impact of changes in the mix of business, primarily driven by a large nonrecurring tail premium in the prior year quarter. Our consolidated expense ratio, excluding the change in ULAE and transaction-related costs in each period was 4.6% higher than the prior year quarter, driven by the buildup of NORCAL's DPAC amortization as mentioned earlier and the impact of the nonrecurring tail policy premium in the prior year period. Net investment income grew 26% to $22 million in the quarter, driven by the addition of NORCAL's investment portfolio and the positive effect of rising interest rates as our average book yields begin to increase due to reinvesting at higher rates as our portfolio matures. The Specialty P&C segment produced positive results in the second quarter, driven by top line premium growth related to the NORCAL acquisition and improved accident and calendar year loss ratios. Gross written premium increased by 18% to $168 million, primarily as a result of the NORCAL acquisition and also included solid renewal price increases and consistent new business results despite the continued competitive marketplace. The current accident year loss ratio improved 5.3 percentage points, driven by a 2.4 point improvement in the NORCAL book, primarily as a result of the focused underwriting efforts on the NORCAL business, which currently runs at higher average loss ratios. Excluding the prior year impact of purchase accounting related to NORCAL's DPAC, the change in estimate of ULAE and year-over-year changes in tail premium, the expense ratio increased 1.1 percentage point as compared to the same period in 2021. Renewal price decreases in our traditional book of business were 5% in 2022 compared to 3% in 2021 and new business decreased $2.5 million quarter-over-quarter, both indicative of the continued highly competitive pressures in the workers' compensation marketplace. As we reported in the second quarter of last year, the 2021 accident year loss ratio reflected increased claim activity as workers return to full employment with the lifting of pandemic-related restrictions in our underwriting footprint. Our expense ratio increased during the second quarter compared to the same period last year, largely due to higher general expenses from team member compensation and an increase in business-related travel with the full return to normal business activities and events this year."
}