{
    "symbol": "LII",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 14:12:09",
    "content": " Q4 adjusted earnings per share of $2.63 and full year EPS of $14.07 both grew 12%, establishing a new record of full year EPS. Fourth, our 2023 full year outlook remains unchanged, and we still expect revenue growth of 0% to 4% and an EPS range of $14.25 to $15.25. Total segment profit increased $30 million or 30% versus prior year as pricing gains more than offset cost inflation, and all three segments contributed to profit growth. Overall, SG&A was $155 million in the fourth quarter or 14.2% of revenue, down from 15.7% in the prior year quarter. And for the full year, SG&A was $627 million or 13.3% of revenue, down from 14.3% in the prior year. Residential revenue grew 13% to $703 million, vwolume was up 5%, price and mix were up 9% and foreign exchange had a negative 1% impact. Segment margin contracted 90 basis points to 16.9%, primarily due to incremental costs associated with supply chain disruptions and the factory changeover for the new 2023 minimum efficiency standard products. For the full year, Residential profit was a record $597 million, up 10%. For the full year, Commercial revenue was $901 million, up 4%. For the full year, segment profit was $81 million, down 27%. Overall, the Refrigeration segment profit rose 42% to $19 million and segment margin expanded 330 basis points to 12.5%. For the full year, Refrigeration revenue was $619 million, up 12%. Free cash flow was $203 million and was impacted by inventory replenishment to get our distribution network back to effective levels to serve our customers, along with inventory investment to buffer the supply chain to support demand for the new minimum efficiency standards that became effective January 1st. Free cash flow in 2023 is planned within a range of $250 million to $350 million, including increased capital spending to support regulatory change and growth initiatives, including factory capacity. Free cash flow in 2023 is planned within a range of $250 million to $350 million, including increased capital spending to support regulatory and growth initiatives, including factory capacity. And finally, we expect the weighted average diluted share count for the full year to be between 35 million to 36 million shares, which incorporates our plans to repurchase $100 million to $200 million of the company's stock this year."
}