{
    "symbol": "REAX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 14:37:06",
    "content": " Good morning, everyone, and thank you for joining us today for Real's First Quarter 2022 Earnings Call. This morning, Real filed its financial results as well as its management discussion and analysis for the first quarter ended March 31, 2022 on SEDAR and EDGAR. Before I turn the call over to Tamir, I'd like to remind everyone that statements in this earnings call, which are not historical facts, may be forward-looking. Our actual results may differ materially from these forward-looking statements, and the risk factors that could cause these differences are detailed in our Canadian continuous disclosure documents and SEC reports. I would like to start by thanking the hundreds of agents and large teams who joined Real in the past few months, and to our community of agents who have contributed to the growth we are experiencing. Q1 revenue was $61.6 million, an increase of 562% year-over-year. Driving that growth was a 140% increase in real estate agents joining Real, as well as the 176% increase in the revenue per agent to nearly $14,000. In terms of geographical expansion, during the first quarter, we announced Real's expansion into New Mexico, Arkansas and Maine. We believe we appeal to agents by providing the best tools, incentives and more importantly, culture. We feel that this is attracting in lot of agents who not only see the opportunity, they also see the opportunity of belonging to something greater that resonates with their values. Just as an example, this has what attracted Invidiata, a team of 35 years of success in real estate onto our platform in February. With a focus on luxury homes, Invidiata has sold more than $4 billion in residential real estate since 1985 and has been named the number one RE/MAX team in Canada 15 times. It is also what attracted the North Group, which continues to expand its network of over 40,000 clients, investors and realtors in early March. Additionally, our platform attracted the Perry Group this quarter, which ranked as the top team in Utah on Real Trends Mega Teams list for 2021. We are proud to say that Invidiara, the North Group and the Perry Group are now part of the Real team and look forward to having them play an important role in our growth. I'm glad to update that in Q1, we continued increasing the product offering of instant payments to more and more agents. As you may recall, this is a product we launched last October and it is progressively increasing in adoption, providing an increased benefit to agents. Other product highlights include the acquisition of Expetitle, Inc. in January of this year, which in April has been rebranded as Real Title. Real Title simplifies the paper-intensive and time-intensive title and escrow process, reducing errors and saving time. Tools such as title orders and ranking, title information, contracts and document storage that were a part of the original Expetitle app will now be integrated into Real's app. In terms of Q1, March was the highest revenue month for Real Title since the company started, so we are seeing progress in revenue growth monthly. As I have previously mentioned, this will enable Real to grow beyond traditional brokerage into a large online real estate company that aims to change the way people buy and sell homes, fixing an outdated and broken process. Finally, moving onto the efficiency of our team, we continue to grow headcount and real estate transactions efficiently. In fact, as of March 31, 2022, our efficiency ratio, which is the full-time employee divided by the number of agents that are currently on our team, remains high right around 1 to 55. This increase was mostly driven by agent growth, which was up 140% year-over-year and revenue per agent, which grew 176% year-over-year. This growth is further supported by proprietary technology platforms, which allow us to continue expanding our agent count and geographic footprint at an accelerated pace. Real completed 6,291 transactions in Q1 2022, which was an increase of 369% compared to Q1 2021. Our gross profit margins are affected by the increase of number of agents to cap, the increase in volume and rising unit prices. We seek to offset downward gross margin pressure from higher producing agents by increasing margins through the introduction of financial services such as our newly-launched Instant Payments program that Tamir touched on previously, and by adding other ancillary services. We have now added our first ancillary service with the acquisition of Expetitle, now called Real Title. This change was primarily the result of investments related to our growth, including building our team of agents, key management, employee personnel, as well as our technology infrastructure. As a percentage of revenue, total losses were 7% in Q1 2022 versus 41% in Q1 2021, thus demonstrating our ability to monitor spend and execute responsibly. As a percentage of revenue, adjusted EBITDA losses were 3% in Q1 2022 compared to 10% in Q1 2021. In particular, we believe the exclusion of stock-based compensation expenses provides a useful supplemental measure in evaluating the performance of our operations and also provides better transparency. Overall, our operating expenses were $10.1 million in Q1 in comparison to $4.9 million in Q1 of last year. The change is primarily due to increases in our revenue sharing program as we onboard highly productive agents, as well as expenses related to being a public company, increased head count that further supports our growth and the acquisition of Expetitle, now called Real Title. With year-over-year revenue growth at 562%, we believe we have proven our ability to scale in a highly efficient manner and with minimal impact on operational costs. As Tamir mentioned, Real’s full-time employee to agent ratio as of March 31, 2022 is 1 to 55 compared to 1 to 56 in March 31, 2021 as we invest in new talent to fuel the next wave of growth. That increase is mostly driven by the costs related to being a public company, increases in consulting as we expand our geographic footprint, and increases in headcount that further support our growth. The decrease was primarily due to the acquisition of Realty Crunch in 2021, which is now the foundation of our tech stock. Additionally, in Q1 2022, we began to capitalize costs associated with developing our cloud-based residential real estate transaction program. As a percentage of revenue, sales, general and administrative costs were 9% and in Q1 last year, they were 25%. As mentioned, we have a technology infrastructure that's able to support us on the path forward to 100,000 agents with minimal impact on our operational costs. We ended Q1 with a strong balance sheet, holding $37.5 million in cash and investments compared to the total cash balance of $37.9 million in Q1 of last year. Cash flows from operations increased by 2,269% in comparison to Q1 last year, and the company holds no debt. During the quarter, the company repurchased 1.5 million common shares for a total of $4.5 million pursuant to the terms of its normal course issuer bid. So I think that looking at the agents that we brought on 18 months ago, what we're seeing is a fast increase in the number of agents. So typically, the high-producing agents that joined us recently have joined in the past nine months or so. I think what we're seeing is that we have somewhat of information about agents who joined us about their past productivity, I mean, and trying to apply it to today is a little bit tricky. What happens is that if somebody joined us in Q1 of 2021, we only saw the production around the second quarter because it takes a little bit of time. At the end of the day, I think that overall, it's a little bit too early to determine what effect does our platform have over the agent productivity just because we grew so rapidly over the past 12 months. When talking to agents over there and asking them about the market, the reaction was the market is still strong. As I said before, some sort of a downturn in the market is an opportunity for us, an opportunity for a platform like Real to gather more agents and attract more agents and just showing this alternative. You spoke about the title business, I think you said March was the strongest quarter. At the same time, we will likely set up a JV with some of our top-producing agents that will ensure that they use the title company because they will become part owners in that, and they will be also attracting other agents or asking other agents to be funding their transactions into the JV. So whenever our agents are starting to work with a potential buyer, one of the documents that that buyer will be signing is an authorization to use the Real Title. Again, today, most buyers do not really care which title company to work with, so we are going to offer them our own services. And it will be pretty seamless if they choose to use our title company, it will probably result in a smoother and faster closing, more visibility for them. So it's going to be a win-win for the client, for our agents and us. So Real launched in Canada towards the second half of last year, and we've seen a significant increase in the business in Canada in the first quarter of this year. When it's all said and done, I realize there are a bunch of moving pieces and unknowns there around just the market and agent capping and home price appreciation and instant payments. We knew that gross margin is going to be affected by the fact that we are attracting higher producing agents and those high-producing agents are capping, and therefore, they're keeping 100% of their commission and only paying us a fee. So going into the second half of 2021 and into 2022, we knew that this will be affecting gross margin. We are talking to our agents about the fact that our agents are both the clients of the company, but there are also shareholders in the company, so they need to wear both hats. How can we create a model where gross margin is less affected by higher producing agents, that's one thing. Second thing is all of those additional financial services such as instant payments, instant payment currently is on track to contribute a couple of hundreds of thousands of dollars this year. Going into talking about The Real Title, we believe that Real Title in 2023 will have a meaningful impact on gross margin. So I think that as we add those services later this year, and obviously, in 2023, we will start seeing gross margins moving up, the target for us in a couple of years is getting to above 20% gross margin. What we're seeing now is that we are processing about four new instant payment requests per day, so that's roughly about $100 per month. I think that moving forward, I would assume that probably 20% of the transactions will have instant payments embedded in them. And then I guess maybe on agent count, curious whether you're seeing any changes in kind of gross add versus net add trends. And I guess, specifically, I'm thinking about some headlines that I've seen recently around -- you had this big swell up in just total agents in the US during the pandemic, but there might be some folks kind of leaving the industry or retiring. It's actually an interesting question because over the past five, six weeks, what we've seen is that agents that were coming up on renewals of their Board or their licenses and they were not productive just gave up their licenses. By the way, in the past, we were doing that ourselves and we still do that periodically, just cleaning up the roster, reaching out to agents that are not performing and just asking if they have anything real intentions of practicing real estate. But since you asked the question, I think that it's important to say that we are seeing the same trend."
}