{
    "symbol": "BGSF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 12:59:14",
    "content": "  Operator: Good morning, everyone and welcome to the BGSF Inc First Quarter Fiscal 2022, Financial Results Conference Call. Good morning, and welcome to the BGSF first quarter fiscal 2022 earnings conference call. The Company's actual results may differ materially from those indicated by the forward-looking statements because of various risks and uncertainties, including those listed in the Company's filings and reports with the Securities and Exchange Commission. All risks and uncertainties are beyond the ability of the Company to control, and the Company cannot predict the risks and uncertainties that could cause its actual results to differ materially from those indicated by the forward-looking statements. These forward-looking statements are made as of today, April 28th, 2022, and the Company assumes no obligation to update these statements publicly, even if new information becomes available in the future. During the call, management will also reference certain non-GAAP financial measures, which management believes can be useful in evaluating the company's operating activities and business trends related to the financial condition and results of operation. I will begin today's call with a few comments regarding the recent sale of our Light Industrial segment announced March 1st, 2022, and review operational highlights for our first quarter results. Finally, I will come back to discuss our 2022 strategic initiatives, including an update as accompanied enterprise wide, CRM, HR, payroll, and work force management software platform upgrade. On March 21st, we closed on the sale of our Light Industrial segment for $32.3 million, which equates to a valuation of 7.5 times buyer adjusted EBITDA. As I mentioned last quarter, this divestiture fully aligns with management long term strategic goals of expanding our higher margin businesses and growing into new revenue streams within our Professional and Real Estate segments. The completion of this transaction allows our teams to concentrate on Professional IT consulting, build on momentum we have with our project based opportunities and managed services and make programs on further development of our Real Estate segment. Despite continued macroeconomic pressures in 2022, we are confident of our ability to grow market share and expand these businesses in a significant way over the next several years. Turning to the quarter's results, we experienced growing momentum that improved sequentially throughout the quarter. And the first quarter revenues exceeded our expectations in both segments, expanding by 37.8% over a year ago. Given the strong performance in fourth quarter from pent-up demand showing up with budget spending at the end of the year, we are pleased with the continued strength in 2022. Turning to the Real Estate segment, our teams continue to execute well on our strategic partner programs, as well as moving forward on new market expansion, recruiting, and direct hire placements where areas of strength that we believe will continue to experience tailwinds in the current year. With that, I would now like to turn the call over to Dan to discuss the company's financial results in more detail. Before I walk through first quarter results, I will add the best commentary on the sale of our Light Industrial segment. Late in the first quarter, we completed the previously announced sale for approximately $30.3 million cash, plus an additional $2 million due at the 1 year anniversary in March 2023, and any working capital adjustment. As a result, our financial results are from continuing operations and except where noted, exclude operating results for the Light Industrial segment for all periods presented. As Beth mentioned, first quarter revenues were strong, growing 37.8% to 68.5 million compared to the year ago quarter. Momentum from last year carried into the first quarter, with positive impacts from better efficiencies into middles and improved pricing, both quarter-over-quarter and sequentially. The Professional segment was positively impacted by strength in finance and accounting and IT consulting, ERP, and Cloud bug pricing projects, as well as the continued ramp up of the 2021 acquisition of Momentum Solutionz. Gross profit grew by 44.5%, compared to the prior-year quarter, to $23.4 million driven by revenue expansion, increased rate in Real Estate, and a 46% increase in placement fees. As a percent of revenue, gross profit increased 160 basis points to 34.2%, compared to 32.6% in the year-ago period. Operating leverage in Selling, General and Administrative cost improved by 200 basis points to 28.8% of revenue, compared to 30.8% last year. SG&A dollars increased $4.4 million, or 28.8%, which compared favorably to total revenue growth. Sequentially, strong momentum carried into '22 for Professional with Q1 revenues up 5.8% from Q4, 2021. Real Estate, following an exceptionally strong Q4, was down 5.4%, better than the 2018-2019 decline of 8.7% and the 2021 decline of 14.3%. First-quarter net income from continuing operations was $2.4 million or $0.22 per diluted share, compared to a net loss from continuing operations of $212,000 or a net loss of $0.02 per diluted share in the same quarter a year ago. Overall net income was $15.5 million or a $1.48 per diluted share and included a $12.2 million net of tax gain on the sale, and $922,000 in net income from discontinued operations. As we discussed during our year-end call, 2022 represents the third year of accompanies IP investment road map, overhauling all of our IP infrastructure, and wrapping up with an enterprise wise CRM, HR, payroll, and workforce management software platform. Finally, the Board of Directors approved our 30th consecutive quarterly dividend payment of $0.15 per share in support of our strategic initiatives. Our balance sheet position, and deleverage efforts are expected to continue to provide AMVAC flexibility to fund our operations while investing for future growth, as well as a return to our shareholders. Although this  industry can be a leading indicator of a U.S. based recession, we offer now that short term inflation trends to be a net positive for our industry due to labor inflation that translates to higher pricing in certain cases. Last quarter, we discussed our IT infrastructure investments, which included our plan to launch the company enterprise level CRM, payroll, HR, and workforce management platforms in late March. Regarding future M&A activity, we continue to work an active amount of deal flow and we plan to carefully evaluate how a potential acquisition fits into our strategic growth initiatives to augment the company's organic growth plans. Brian, your line is open. Quickly in the last comments, Beth, your balance sheet is much stronger, but also the environment has a lot of pros and cons right now. I would say that our M&A strategy is really -- it's notch high priority right now, we're very comfortable with where we are right now. We had noticed that turn was up a half to a to one turn from pre COVID numbers, in that range that we typically sort of look at that sort of 5 million, that 10 million EBITDA company, so. Digital transformation seems to be driving excess demand, and there's obviously also our storage of employees that's increasing pricing as well. It's probably about 95% IT and yes, that's where growth is. We just have a very strong Professional machine right now in the IT world, and IND is definitely coming back with speed and there might have some momentum in the first quarter and going into the second quarter. And there's just a lot of deal flow right now, the sales team has got a very strong pipeline and they are closing deals left and right and that that's exactly where we wanted to see. Brian, your line is open. And there is no doubt, it's a tough market right now, but the team does a really good job on making sure that they understand when an assignment it's going to end, so they can go ahead and give them lined up for a new one. It's easier for us to continue to redeploy the people that we have the end in the queue, then it is for us to go out and try to find new talent. Would there be a higher growth rate right now, and if so, by how many points is it \n Well, we do have a strong -- there are several open orders right now, and if we could go in and close that gap then I think we would probably make more money. I think I was on the call yesterday with our division President for the Real Estate Group when we were talking about open orders, and they got a whole campaign that they are working on right now, that we're hoping to see that open order number go down and we just worked really diligently to try to make that happen. Thank you, everyone, for joining today's call."
}