{
    "symbol": "ARCC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 16:35:16",
    "content": " This morning, we reported second quarter core earnings of $0.46 per share, an increase of approximately 10% compared to the first quarter, driven by the early benefits of rising interest rates, higher dividend income and continued credit stability within the portfolio. Looking forward, we believe the continued increase in market interest rates present a potential opportunity for the growth of our core earnings given our largely floating rate loan portfolio and is financed by mostly low-cost, fixed-rate, unsecured sources of financing. Additionally, should market rates increase 100 basis points from the June 30 levels, our quarterly core earnings could benefit by about $0.08 per share or a 17% increase over our second quarter core earnings. As a result of our run rate core earnings outlook and the expected further benefit from higher interest rates coupled with our strong portfolio performance, we increased our regular quarterly dividend to $0.42 per share to $0.43 per share for the third quarter. Given about 60% of the base rates for our floating rate loans currently reset every 3 months and the increase in base rates through these resets generally occurred in the latter part of the quarter, our second quarter earnings did not fully benefit from the increase in market rates reflected in our yields at quarter end. By holding all else equal for the second quarter and assuming that the June 30 base rates were in effect for the full quarter, we estimate our second quarter core earnings would have been about $0.05 per share higher resulting in core earnings of approximately $0.51 per share or about an 11% increase over our actual Q2 2022 core EPS results. To look at this with a longer-term lens, as of quarter end, holding all else equal and after considering the impact of income-based fees, we calculated that a further 100 basis point increase in market rates from June 30 could increase our annual earnings by approximately $0.31 per share, a 17% increase above this quarterâ\u0080\u0099s annualized core EPS. Further to Kippâ\u0080\u0099s point earlier about the upper middle market focus of our portfolio, the weighted average EBITDA of companies to whom we issued commitments during the quarter was $183 million as compared to the average EBITDA of exited investments of $102 million. So, what we were trying to say is, at the end of the quarter, if we pulled forward our expectation of what our interest income would look like with all of those LIBOR resets getting done, i.e., weâ\u0080\u0099re going to evidence all that in Q3, we thought we had just $0.08 of additional earnings from where we kind of left off at June 30. And Iâ\u0080\u0099ll just maybe add a couple of clarifying points on that, because I know we threw a lot of math at you on this, but kind of for this particular 100 basis points increase, there is some hypothetically, if you increase rates by 100 basis points from where we were at June 30, then we would have approximately $0.31 per year in additional core earnings, which translates to about $0.08 a quarter. The other question I had, and I really do appreciate the color that you guys gave on kind of the run rate ending the quarter from kind of if you reset interest rates for the full quarter of Q2 and then also kind of the overall 100 basis points at the end of the quarter, those statistics show and kind of a forward LIBOR, SOFR curve shows earnings are going to go up pretty meaningfully over the next several quarters likely. And so when I look at the core earnings today and the potential increases in the future and then I look at your dividend that you have today and the one youâ\u0080\u0099ve declared from the third quarter even with the $0.01 increase and then the $0.03 kind of special dividends you guys have at the end of the year, earnings look like theyâ\u0080\u0099re going to be well above those combined when you kind of look at 2023 earnings potential."
}