{
    "symbol": "ARCC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 14:46:05",
    "content": " This morning, we reported third quarter core earnings of $0.50 per share, an increase of 9% compared to the second quarter, driven by the benefits of rising interest rates and continued credit stability within our portfolio. Importantly, if the prevailing market rates at September 30 had been in place for the full quarter, our third quarter core earnings would have been about 8% higher, or roughly $0.54 per share. We elected to raise the regular quarterly dividend from $0.43 to $0.48 per share because the company is now experiencing a higher level of core earnings, primarily due to the substantial increase in base rates. Our GAAP earnings for the third quarter of 2022 included net realized and unrealized losses of $0.36 per share, which were largely a result of the unrealized losses we took for certain investments to reflect the decline in prices in the credit and equity markets that Kipp mentioned earlier. Given 73% of our total portfolio at fair value was in floating rate investments as of September 30, 2022, we expect continued increases in short-term rates to have a positive impact on the net interest earnings performance of the company. Importantly, these earnings would be additive to the $0.04 per share benefit that Kipp mentioned from having a full quarter of the market rate moves that have already occurred in the third quarter, fully flowing through our core earnings. During the third quarter, our team originated $2.2 billion of new investment commitments across 40 transactions in more than 20 distinct industries as middle market sponsors and businesses continue to value Ares being a consistent and reliable source of capital in good market and volatile ones like the one we are in now. So obviously, Ivy Hill got larger â\u0080\u0093 Ivy Hill got larger, the dollars go up, the return that weâ\u0080\u0099re looking at, if you take the dividend, the way that I think about it is if you take the quarterly or the annual dividend divided by the fair value of that investment, weâ\u0080\u0099re achieving the same rates of return there that we have historically, itâ\u0080\u0099s just larger, so the dollars are bigger."
}