{
    "symbol": "ARCC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 16:14:06",
    "content": "   Operator: Good afternoon, and welcome to Ares Capital Corporation's Fourth Quarter and Year Ended December 31, 2022 Earnings Conference Call. The company's fourth quarter and year-end December 31, 2022 earnings presentation can be found on the company's website at www.arescapitalcorp.com by clicking on the fourth quarter 2022 earnings presentation link on the home page of the Investor Resources section. This 26% quarterly increase in core earnings was largely driven by the benefit of rising market interest rates and our net interest income, but also from strong capital structure and fee income on the fourth quarter transactions. On a GAAP basis, our fourth quarter and full year earnings of $0.34 per share and $1.21 per share, respectively, were below our core earnings and has been recognised $0.03 per share and $1.08 per share, respectively, of net unrealized depreciation due largely to widening market yields. At year-end 2022, the weighted average EBITDA of our portfolio companies reached $275 million, an increase from $162 million at the end of 2021 and meaningfully above the weighted average from 5 years ago of $62 million. These metrics, along with our positive view of the company's earnings power, support of our decision to increase our regular quarterly dividend 3x during 2022, moving from $0.41 per share in the fourth quarter of 2021 to $0.48 per share in the fourth quarter of 2022 which builds on our long-term track record of delivering consistent dividend growth. Supplementing this growing regular dividend, we paid $0.12 per share of additional dividends in 2022, resulting in $1.87 per share of dividends for the year, which represented a 15% increase in total dividends versus 2021. For the fourth quarter of 2022, we had a record level of core earnings of $0.63 per share compared to $0.50 per share in the prior quarter and $0.58 per share in the fourth quarter of 2021. On a GAAP basis, we reported GAAP net income per share of $0.34 for the fourth quarter of 2022 compared to $0.21 in the prior quarter and $0.83 in the fourth quarter of 2021. When looking at our taxable income for the year, our current estimate of undistributed taxable income sometimes referred to as our spillover at year-end 2022 is $675 million or approximately $1.27 per share after considering the shares issued in our January equity raise. This dynamic is clearly illustrated by LCD's recent report which shows that 98% of the new LBO issuance in the fourth quarter of 2022 was completed by private capital providers, a market traditionally supported by the broadly syndicated channel. Over the past 10 years through September 30, 2022, which is the latest full reporting quarter for all the BDCs, Ares Capital has differentiated itself versus the competition in almost every relevant performance metric."
}