{
    "symbol": "GSIT",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-30 15:45:24",
    "content": " At the high end of the guidance provided earlier in the second quarter through the first half of fiscal 2022, revenue is up 25% compared to fiscal 2021 and sales to Nokia, our largest SRAM customer, has stabilized despite ongoing supply chain challenges that are troubling our industry. Sales to Nokia were $1.9 million or 23.8% of net revenues compared to $3.4 million or 51.7% of net revenues in the same period a year ago, and $3.8 million or 42.7% of net revenues in the prior quarter. We reported a net loss of $4.6 million or $0.19 per diluted share, and net revenues of $7.8 million in the second quarter of fiscal 2022 compared to a net loss of $5.2 million or $0.22 per diluted share, and net revenues of $6.7 million for the second quarter of fiscal 2021. Second quarter fiscal 2022 net loss included interest income and other expense net of $8,000 and a tax provision of $42,000 compared to interest income and other expense net of $16,000 and a tax provision of $62,000 for the same period a year ago. And Jeff, just to add to that, for the deliverables, obviously, the compiler stack is critical to that because as Lee-Lean mentioned, we're writing a lot of the APIs and the algorithms today, but a lot of folks want to write their own or there's just -- we can't keep up with all the different applications. One of the other benefits that we're able to show customers, and this one is really at the beginning stage, and it's taking some conversations to open up their eyes, but we can also offer, in a lot of cases, a mobility aspect to their solution, where in the past for them to do a certain function would require cabinets of CPU-based servers or cabinets of GPU, while with our solution, it could be a couple of racks, which can now be put in a plane, in a van, in a submarine or what have you. And so I just -- I don't know what's your backup plan if we're sitting here having this call at the end of '23, and you're like, well, it should be in second half '24."
}