{
    "symbol": "JHG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 15:33:02",
    "content": " My team and I have a track record of successfully identifying, executing and delivering value from M&A and we're actively looking at targeted areas to fill gaps and expand into areas, in which clients are asking to work with us including places we've mentioned before, like private credit and insurance, gaps we have in traditional investments and regions of the world we would like to bolster further. In our US intermediary space, we've seen client touches increase over 25% compared to the third quarter of last year, positive institutional consultant activity which is vital for our success is improving with consultant meetings increasing by 33% compared to 2021 and annualized consultant advised inflows on pace to be two times higher than last year. It's the people upgrading and incentivizing, it's the processes that we have to do better internally and facing off with clients and it's certainly the technology, which you've heard us talk about before and we'll continue to invest in whether it be data to serve our clients or whether it be just data internally to function as examples. Your line is open. Your line is open. And look, you can't focus on too many things that are a small sample size, but we're already seeing some of the quicker wins, some of the early wins of really trying to get this motion going whether it be the emerging market debt platform that we've just talked about, whether it be fixed income being the second inflows in terms of fixed income across the organization, or across the industry, whether it be actually something we haven't talked about, yet, which is Australia. Your line is open. Your line is open. Your line is open. So, think of an area where you want to upgrade the talent, you are removing a cost and then spending it back or if you're shifting talent around within distribution as an example you want to invest in one area where you see it's growing and take away from another region, those things will offset. Your line is open. Your line is open. Your line is open."
}