{
    "symbol": "JHG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 17:13:06",
    "content": " Thank you for standing by, and welcome to the Janus Henderson Group Second Quarter 2022 Results Briefing. After the speakers' remarks, there will be a question-and-answer period in interest of time, questions will be limited to 1 initial and 1 follow-up question. In today's conference call, certain matters discussed may constitute forward-looking statements. Actual results could differ materially from those projected in the forward-looking statements due to a number of factors, including, but not limited to, those described in the forward-looking statements and Risk Factors sections of the company's most recent Form 10-K and other more recent filings made with the SEC. Now it's my pleasure to introduce Ali Dibadj, Chief Executive Officer, Janus Henderson. Thank you, everyone, for joining us today on Janus Henderson Second Quarter 2022 Earnings Call. I'm Ali Dibadj, I'm joined by our CFO, Roger Thompson. In today's call, I'll start with a short introduction before handing it over to Roger to run you through our second quarter financial results in detail. And then following our prepared remarks, we'll take your questions. Before Roger gets into results, I want to start by expressing how please part of the Jane Henderson team. As I speak to you today, I'm even more convinced about the long-term opportunities ahead of us. I go a long way back with Janus Henderson, and it's a very special place to me. Earlier in my career as sell-side analyst, I was fortunate to serve Janus Henderson's investment teams, where I was struck by the intellectual honesty, depth of research and focus on client outcomes. We have a true research, security selection and portfolio management powerhouse at the firm. Furthermore, I was attractive to the truly global nature of the firm, forward-thinking corporate functions and the strong financial foundation. While I'm optimistic about the longer-term potential for Janus Henderson, one must acknowledge that there are also significant headwinds for this business. Those of you who know me know I'm transparent, analytical and collaborative. All of this, of course, amidst geopolitical tensions, record inflation, volatile consumer confidence, uncertainty about interest rates and concerns around global liquidity that are having negative consequences on our near-term outlook. Net-net, there's a lot to like at Janus Henderson tenders and much work to do. Thank you, Ali, and thank you, everyone, on the call for joining us today. Starting on Slide 3, and I look at our second quarter results. Our long-term investment performance does remain solid with 60% of our assets beating their respective benchmarks over 3 years, which is similar to the prior quarter. June ending assets under management were just under $300 billion, down 17% from March due to lower markets, U.S. dollar appreciation against other currencies and net outflows. Regarding FX, a little over 30% of our AUM is denominated in sterling, euro and Australian dollar, all of which weakened against the U.S. dollar in the second quarter. We've seen a significant slowdown in intermediary sales across all regions due to rising interest rates, inflation, recession fees and geopolitical unrest. The financial results were down compared to the prior quarter as revenues were significantly affected by those weaker markets, FX and net outflows. In the quarter, we completed $56 million of the $200 million of share buybacks authorized by the Board and today announced a $0.39 per share quarterly dividend. In equities, inflation, aggressive monetary policy, recession fears and supply chain issues have created significant volatility. Fixed income continues to be impacted by the worst selloff on record, and our short-term underperformance to bench has been modest in most cases. Switching to long-term investment performance, this remains solid with 60% and 65% of assets beating their respective benchmarks over the 3- and 5-year time periods as of the 30th of June. For the quarter, net outflows were $7.8 billion compared to $6.2 billion last quarter. With the flow trends we've seen in the first half of 2022 and the market volatility expected to continue through at least the end of the year, we anticipate flows to remain negative in the near-term. The decline in flows is attributed to a 32% slowdown in gross sales, as I mentioned earlier, and the previously disclosed $1.3 billion liquidation of the U.K. property fund, which occurred in June. The lower gross sales are not unique to Janus Henderson as the industry has seen lower active retail sales in the U.S., EMEA and Latin America, but we also lost market share, particularly in equities. Clients are sitting on the sidelines as they monitor current events and assess the impact of the Russia-Ukraine war, pricing central bank policy and ongoing inflation. Until these market headwinds subside, we can expect this risk of sentiment to continue. Pleasingly, the quarter included a $3.7 billion funding from European clients into a global commodities mandate in the alternative capability. Going forward, our pipeline is diversified by product and clients, but including the $4 billion as mentioned above, we still expect negative flows from institutional over the remainder of the year. Finally, net outflows for the self-directed channel, which includes direct and supermarket investors were $900 million. Given the strong recovery in performance of U.S. mid-cap and SMID, enterprise, for example, is now in the top quartile of 1 and 5 years. We did see outflows slow over the quarter and into July, and we're pleased to have reopened the SMID and small-cap Triton and Venture funds, which have been closed for several years. Second quarter net outflows for fixed income were $3.3 billion, reflecting the $2 billion Sterling Buy & Maintain institutional redemption and the market conditions for bonds, which impacted the retail side of the business. Total net outflows from multi assets were $900 million, driven by the balanced strategy within our retail channels. Whilst the net outflow as a result of short-term performance, the medium- and longer-term performance remained very strong. This is a result of the $3.7 billion global commodities win in institutional, which was partially offset by the $1.3 billion outflow related to the sale of the U.K. property fund. In the detailed 10-Q, you'll see an investment loss of $109 million below operating income, which has reversed out in NCI. This is a result of the mark-to-market losses of a fund, which we were required to consolidate this quarter, but these figures net out in net income and EPS. Adjusted revenue decreased 11% compared to the prior quarter, primarily due to lower average AUM. Net management fee margin for the second quarter was 49.2 basis points compared to 49.4 basis points in the prior quarter, excluding INTECH. Second quarter performance fees include negative $15 million from U.S. mutual funds, which were partially offset by performance fees generated from European smaller companies investment trust, the global multi-strat fund, the multi-strat hedge fund and the SICAV Pan-European Fund. Looking at the second half of the year, all else equal, underperformance will continue to impact performance fees. As we sit here today, based on current investment performance, we estimate aggregate performance fees for the full year could range from negative $35 million to negative $45 million. Clearly, the result will be dependent on future performance, but these negative performance fees will cause a significant delta to revenues compared to 2021. Adjusted operating expenses in the second quarter were $278 million, down 7% from the prior quarter. Adjusted employee compensation, which includes fixed and variable costs were down 12% compared to the prior quarter, primarily due to lower variable costs given the lower pre-bonus profit as well as favorable FX and the closing of the INTECH transaction at the end of the prior quarter. In the appendix, we've provided the usual table on the expected future amortization of the existing grants  in your models. The adjusted comp to revenue ratio was 42.6%, which is flat to the first quarter. Finally, our recurring effective tax rate for the second quarter was 25.7%. For the full year, the firm's statutory tax rate is still expected to be in the range of 23% to 25%. Adjusted operating income in the second quarter of $149 million was down 16% over the prior quarter, driven principally by the lower average assets, which were partially offset by corresponding lower variable compensation. Second quarter adjusted operating margin was 34.9%,  up second quarter results, adjusted diluted EPS was $0.63. In looking at the remainder of the year, I do want to provide an update on expectations for 2022. All things equal, you should therefore expect management fees will be lower by this amount in Q3. In terms of guidance, we now anticipate a compensation ratio in the range of 44% to 45% for 2022. Additionally, as discussed, performance fees are also trending negative, which impacts the comp ratio. For noncompensation, we are proactive in managing our discretionary expense base, and we'll look to slow down spend on such items with marketing and T&E. With this disciplined approach, coupled with favorable FX on non-U.S. dollar-denominated expenses, we anticipate the noncompensation expense growth to be in the low to mid-single digits, down from the previous guidance of low teens. Our philosophy has always been to maintain strong financial discipline and invest in the business where it strategically makes sense, whilst looking to operate more efficiently to provide the fuel for growth. However, with the ongoing market turmoil, we will be even more prudent in our expenses. Finally, skipping over to Slide 11 and a look at our liquidity. Cash and cash equivalents were $848 million as at the 30th of June, an increase of approximately $66 million, resulting primarily from strong cash flow generation, partially offset by returning cash to shareholders. We purchased 2.1 million shares of our stock for $56 million, and have $144 million of buyback authorization remaining to be completed by next year's AGM. Since the inception of our accretive buyback program in the summer of 2018, we've reduced our outstanding share count by 17.3%. Finally, we paid $66 million in dividends during the quarter, and declared a $0.39 per share dividend to be paid on the 24th of August to shareholders of record as of the 8th of August. With that, I'd like to turn it back over to Ali. As I said at the start of the call, there's a lot to like and much work to do. Although having been here for only about a month, I'd like to share some initial observations after spending some time with global colleagues, clients, investors and members of our Board on Slide 12. As I've delved into the company, I continue to be impressed by the talent, our people values and the opportunities ahead, but the challenges facing us and the industry are steep. First, Janus Henderson's overall branded performance remained good, but both could be better. Too often, we're not garnering our fair share of client interest and engagement. We need to be more differentiated, creative and focused in order to serve our clients better. Second, Janus Henderson became a global company upon merger, but it is roughly back to 2017 merger AUM levels excluding INTECH. Our total shareholder return metrics have not delivered, while the broader market and asset management peers have performed much more strongly. Third, we have a good foundation of culture and people in on which to build, but delivering our 1 firm collaboratively and with a sense of accountability and urgency has been missing. We have, however, already begun to gain deeper insights into our business, and I'm working with my team to turn the opportunities we see for Janus Henderson into a strategy with a winning execution plan. First, we need to protect and grow our core businesses. Second, we need to amplify the strengths we already have, but haven't fully leveraged. And third, we need to diversify where we have the right to win. All of this on behalf of our clients, their clients, our employees, shareholders and other stakeholders. On Slide 14, there are many opportunities that already exist to protect and grow our core businesses by addressing our market share losses. For example, in 2021, we delivered $25 billion of U.S. active long-term mutual fund gross sales, but that only represented a small sliver, less than 1% of $3.5 trillion in industry gross sales. Yet, we have an AUM market share of 2% or less in each of those markets in the intermediary channel in active management. And at the same time, there's plenty of opportunity to grow and win. There are many opportunities at the individual investment strategy level, too. In the example shown, we're significantly smaller versus a large competitor, and they consistently have much weaker investment performance than we do. In terms of amplifying on Slide 15, I look around the organization in every corner I turn, I see a lot of interesting expertise. We've launched some exciting products over the past 3 years, which draw on our core strength as an investment powerhouse and provide a truly differentiated way of meeting clients' needs. For example, our AAA CLO ETF has grown to $1.4 billion in AUM and have seen net flows of $1 billion year-to-date. We extended our longstanding U.K.-only global sustainable equity strategy to a SICAV and then a U.S. 40 Act fund, which has helped AUM almost triple over the period. As I mentioned earlier, there are gaps to fill in our product offerings, so that we can better meet our clients' needs. This is not about being all things to all people, and we need to pick what we do as a firm, but we are not adequately represented across faster-growing asset classes, channels, geographies or vehicles where our clients want to see us. For example, during the quarter, we announced the inorganic addition of an emerging market debt team, adding this capability diversifies our existing strength in emerging markets credit, global bonds and emerging market equities. The acquisition fills a gap for us, as you can see and read on this slide, in a fast-growing segment of the market that many clients look to for higher income and risk adjusted returns. My team and I have and will continue to identify those areas complementary to our firm where we believe we have the right to win, whether that be by filling gaps and investment teams or capabilities or within channels or regions. Said simply, we are unexposed to trillions of dollars of asset management addressable AUM, where we have or can have the right to win. I've done exactly this before, and we can do it here. I'm confident that we'll be able to deliver the full potential of the company to our clients and all our stakeholders, but it will take time. Given I'm only a month in, we'll get back to you with more views on the financial outlook and transition timing. But in this industry, as you know, each change one makes takes a long time, typically more than a year to deliver signs of progress. We are in a transition period of upgrading leadership, reinvesting in the business and improving how we work. As part of that, we need to create fuel for growth by driving increased efficiencies in the business. So in summary, I think there are a lot of opportunities for the business to unlock over the long-term. I'm excited by the talent, client focus and the strong financial foundation. I strongly believe that over time, not overnight, Janus Henderson can and will win again to deliver consistent organic growth with attractive operating margins. I know it's early, and you talked a lot about what you've seen and are focused on. Look, I think if you think about M&A in the industry, my view hasn't changed for a very long time around it, which is it has to be client-focused, that be client-led M&A. In other words, scale for the sake of scale is unlikely to deliver better results more often than not for the client. And so what you found is if the main vector of M&A success, right, is cost cutting in a deal than the likelihood of success is relatively low. On the flip side, it's augmenting capabilities for a firm, so that firms, in this case, can deliver better for a client, those are generally more successful. M&A is always -- is probably with risk, but those are generally more successful. That's how this firm will be thinking about M&A to fill some of those gaps we talked about before and again, all being client-led. And then just a follow-up on kind of the institutional activity and maybe feedback, I guess, you're hearing from clients and intermediaries based on the transitions within the management realm. And I think, Roger, you kind of commented on the outlook for this year, maybe being negative, just broadly for the institutional component. But if you could get more specific in terms of either regions, asset classes or specific mandates or sales channels, that would be helpful. Yes, what we're saying there is we've got a fairly broad pipeline of opportunities across different capabilities and actually around the world as well. But there are -- as we talked about on the last call, we have 1 large redemption from a U.K. insurer into buy-maintain credits, $2 billion of that was gone in the quarter and $4 billion of which will come out in the remainder of the year. Including that, we expect the net to be negative for the year overall, but we are obviously expecting some things to fund. So -- but net-net, what I'm saying is including that $4 billion, we'd expect a negative number. I've been speaking with clients, and I guess I separate out into 2 areas, Dan. One is more broadly the clients who know us, our real clients, clients that we serve. Then there's the potential clients, I guess, I call them. They don't know the abilities that we have from an investment perspective across asset classes, equity, fixed income, multi-asset alternatives. They don't know the client service model that we bring to them, which is over delivering for their needs and not just them as a client, but their clients as well. So I think that's an enormous amount of opportunity that we have, but we have to obviously tackle it. And our next question is from the line of Elizabeth Miliatis, Jarden. And then also in terms of capacity, obviously, there's a decent amount of available cash on the balance sheet at the moment. Look, it's a little early to be able to tell exactly. I think philosophically, you've heard of how I think about M&A, which is it has to be client-led. That generally means that I'm agnostic to size, if it delivers on the outcome, which is better results for our clients. Obviously, you pulled back on the non-comp growth rates, which is fairly sensible given where markets are today. And obviously, you've just come on board and you want to do -- make some changes within the business. There are clearly outside pressures in the environment you've seen the markets, that puts pressure on our margins. We have a base of fixed costs, obviously, and so we deleverage and so does everybody else in this industry and many other industries. The second point is, absolutely, you're right, we need to invest back in the business. If we're going to, again, make sure we deliver for our clients in the way they want to be serviced and expand to other clients and other regions and other investment strategies that we have the right to win in. And of course, we'll do our best to manage our expenses and create the fuel for the growth, but the timing will always be aligned. And hopefully, the cost savings will happen over time as well. I'll let you think for what that means to your margin and EPS models in the short-term, but those are the mechanics of the reality. Ali, welcome to Janus. Maybe first, given the decline in assets and the outlook for revenue over the next couple of quarters, the dividend payout looks quite high as we get into the second half of the year. As you imagine, it's something we're thinking about a lot in collaboration with the Board and thinking through. And then our priority is to give sustainable progressive dividend, which we've been doing and then programmatically buy back stock along the way. But again, as I've mentioned before, that there aren't any sacred cows at the firm. That being said, the cash flow of this industry and of our business is actually quite good. It is, of course, volatile given the markets, but the cash flow is actually quite good. We want to ensure we have the right balance of good dividends, good repurchases, that also allow us to invest for growth for the longer-term, both organically and inorganically as well as provide for shareholders. And anything we decide to do, as I mentioned at the outset will be collaboratively with -- between the board and the management team. If we look at Janus over the last 22 years, the peak of the markets in 2000, Janus had $330 billion of AUM despite a big deal between then and now assets are lower than what has been a pretty big bull market run over that period of time. Look, I asked myself those questions a lot before I took this job and conversations with everybody that you mentioned and others. I'm here to look at the strengths that we have, which are its incredible investment prowess across categories, across investment strategies. I am here to build on that, build on the client-centric mindset that we have and build on the externally high quality of people that we have throughout the organization. We're not perfect, but there's enormous opportunity to improve the business. I think there's too little collaboration and transparency throughout the business, and we can build on that and improve that, again, for the sake of our clients. I think historically, you mentioned a long time period and certainly a student of history of this firm as well as best as I can in a short period of time. It's not going to be easy road, but we could be a leader in this industry. There's no doubt in my mind, Ken. I really like the analysis that you ran on Slide 14, the concept based on the illustrative example you had, what do you think the reasons are that Janus hasn't been able to generate better market share across the categories where you had better performance. And then I'm trying to tie that the concept of gaining market share with some of Roger's comments about prudently managing marketing expenses, and I think that was something specific about marketing. So first off, as you look at Slide 14, right, and you think about the Protect & Grow category. That's really building, protecting and growing the base of our core businesses that we have that are externally strong. And to your point, it is all about market share. And when you think about having a great product to sell, we have plenty of great products to sell. But unfortunately, we haven't been gaining market share. A lot of it comes down to, obviously, the view of distribution and what we've done there. So measure -- figure out the right metrics, market share, as an example, monitor that metric and then compensate on the metric, reward that metric. And I think we certainly do a better job on that focusing on areas of growth, focusing on channels of growth, focusing on clients who are growing more than others, really making sure that we are putting up our sales, so to speak, in the right wind area. That's around thinking around not just our clients, right, but our clients' clients and how we serve them better. That's around a strategic vision that we're developing, as you know. So it's really both of those things, the push element and the pull element. Now that's not going to change overnight, right, especially the pull side of things. To tie it to your second part of your comment around T&E marketing, which is client facing. Again, it goes back to saying before, we took focus a lot of that focus them on areas where the ROIs are better. I'm a pretty analytical guy, who look at our ROIs on things. There are some areas where we're spending where the ROIs isn't quite as strong, but there are areas where we get great ROI -- let's do more of that. And those, I think, are not incompatible in terms of how we want to spend our money, again, to deliver for clients and in the end to result in a better market share for us. And this perhaps ties in some want to sort of identifying some of those ROIs in the comments, I think you had said something about selectively upgrading the leadership team with the specific capabilities that you think Janus Henderson could benefit from. So you've seen that there are some open roles given some changes originally in the organization, those are places we're casting wide net. Broadly, though, I've been very impressed by the talent here. Look, I'm still listening and learning about things. But if I'm very comfortable with the team I have around me right now, people have to have, again, more accountability, more targets, and so time will tell a little bit, but I'd be surprised if this is the gist of your question. And our next question is from the line of Brian Bedell, Deutsche Bank. Maybe just to go on to the recent line of questioning, maybe just on the distribution side. Like you said, the performance has been very good and you're punching below your weight. Absolutely, clients look for stability. And so yes, absolutely, if I were a client, I want stability, so we don't have to deliver that for them. And hopefully, that's a message that I can scream from the rooftops, but every one of our sales folks distribution partners have to do that as well. On the first part, I guess my short answer is both, and it depends, right, which is not a very satisfying answer. And just as you'd imagine, start to dig into this with our team and try to have a better understanding of it. But so far, I've seen both, and it depends on the region. And then maybe just more holistically, the -- like you said, the underlying culture is very strong. So first off, it is going to be Janus Henderson. It is Janus Henderson, we're 1 firm, and that's something that is embedded in ways into people's mindsets and that has to continue to be the case. I guess as I take a step back, if you imagine, I'm still in diagnostic phase, but I've looked at it a little bit. And look, I spent all of my career developing, implementing and/or analyzing, some may say fatiguing strategies of different types of firms. And in my view, there are a few common issues and there are probably 3 that comes to the top for this firm. And you've seen this over and over and over again, which is really having a great perspective of what is the size of the universe you're playing in. Take a broader view, a broader view of the denominator and really focus on in this industry, what our clients want then it's a more successful view, it's a broader view, it gives you more degrees of freedom. I think that's 1 thing that certainly has to, in my mind, change this kind of denominator problem that we have. The second thing is that typically, when a strategy is purely top-down, you miss really good ideas. And then the third thing that bubbles at the top if you ask the question, Brian, is if you have to explain the why. Again, clients being first and foremost, not just the logic about what we're doing and the explanation of why we're making some decisions, but also a broader vision, a broader vision and purpose about what we're doing for our clients. And so you put all that together, that at least gets to, I think, on the right path of what the strategic vision could be. And if you have the right buy-in, it goes a long way, but it's about accountability, it's about urgency. And my mandate is to have both for this firm, and I'm already starting to see a willingness to change and willingness to march in that direction as we've built in a very short period of time. Yes, that's -- that's great color. Firstly, if you go back to Slide 16, do you see more issues with -- and there's lots of holes on this slide. No, look, it's a great question. Some may be quicker than others, but there certainly aren't any quick wins. I think on the distribution side of things, there are, I think quicker wins, I guess, to use the word that we can implement. We are taking some investment strategies that we have and we're putting them in vehicles really good investor strategy, and we're putting the vehicles that clients have to want to see. We rolled that up into other  40 Act funds, where clients are actually looking for this, but they want to have the right vehicle. There are a bunch of things you have to go through, but just steps you have to go through. And there are many, many other examples like that where we don't have the right vehicle for the right client, again, serving clients' needs. Then yes, absolutely, their investment capabilities that we have to build. And I think some of them will be organic, but I do think to, I guess, one of the questions earlier, we're going to have to do some inorganic additions. You've seen the inorganic addition, for example, that we did of emerging market debt team in the quarter, gosh, I really hope you guys got to meet that team. That was a classic client-led inorganic addition from a very good team, like great performance, great pedigree, like-minded people from a cultural perspective, an enormous potential, and it fits, right, because we have an extraordinarily strong emerging market equity team that we've brought on board. We have global across many, many, many of our fixed income and also equities investment strategies, and that fits in quite nicely. But yes, there are some earlier things rather only investment capabilities. And then just a second, just hopefully a quick question. If you look at, Roger mentioned before, obviously, AUM is going to fall on an average basis. So look, we've given you the information that Roger gave and that I gave. The first one, just around the strategies. Sorry, I can't hear what you said at the outset. So look, we have a lot of really interesting strategies in the seed stage, yes. I have to spend some time looking through it and candidly, triaging some of it. That doesn't mean we shouldn't be more kind of a denominator question I was raising before, we shouldn't be broader in the way we think about things. But yes, there are some really interesting potentials in seed right now. I wanted to ask around Quant because with exit of INTECH, quants becomes Quant becomes a bit of a gap in terms of the broader capabilities for Jonas Henderson and it's still an area of interest and demand for clients. We use Quants tool across the board, think of what we do from an ETF perspective. So we use Quant broadly as many tools it looks like so far in my inventory right, in this organization. The key will be to make sure we have the right to win in whatever we do, including Quant. So I appreciate all the comments you've made about the opportunities you see to turn things around, and I hope you're right, obviously. So why are you so confident that you and the firm can ultimately buck that broader secular trend, particularly now that it looks like the current environment is actually accelerating the secular trends against active managers like Janus. Well, Janus Henderson has -- if you look at the performance, if you look at the investor base, if you look at how we're serving clients, a very special combination of product and client service that you rarely find elsewhere. The challenge has been for quite some time, a significant focus on the business that we only do today, again, the denominator question without thinking of other ways to serve our clients. As you all know, Patrick, it's something that I've done before and with at least some inklings of success. And I think it absolutely can be done here as well, which is bringing in more holistic investment strategy and service model to our clients. That doesn't mean to your point, it's easy. But the opportunity here, the foundation here is great to actually be able to build off of that. I think the other element, and I mentioned this a little bit before, to the kind of -- it's got this great base, but effectively, to your point, to my point, has been firing on all cylinders, there is a cultural change that we need to bring. So the merger, in my mind, was certainly a very big focus of people's time. And then there -- we were slapped by COVID, like everybody else. And in the midst of kind of going through the laboring of bringing companies together, that became another issue to deal with, perhaps not as ideally as they would have been. And then you had changes, right, throughout the organization. I think one has to look back and say, look, with everything that's happened so far, right, the resilience of this organization is extraordinarily high, and that's my belief, Patrick, and I will do my best to prove it to everybody on the phone. Again, not easy, but we can get there because this industry and its complexity is actually pretty simple, have the right product that your clients want and get it to them. Can you maybe talk a little bit about some low-hanging fruit through that lens, the regional lens where you can affect the most change and then maybe even areas where you can extend that global reach. For example, some of the easiest things that you see is best practice sharing. So that's not just global, but there is a lot of opportunity there. There are a couple of really interesting examples that we're going through right now, where we're very successful in EMEA with a particular product, and we tested out the messaging elsewhere in the world. There are a couple of other elements that I see so far, besides the practice sharing. They want to be served across the world, and we didn't have that. Many of our clients, right, from a consulting perspective or otherwise, right want to be served from a global perspective. I think the last thing is learnings from an investment strategy perspective, to that chart with the green and the reds and the yellows, if you almost meld those charts together, there are products that are -- that we don't have that are interesting to clients and they reside in investment capabilities in other parts of the world, that we don't have a great presence and from an investment perspective. So again, best practice sharing, serving our global clients globally and then having access to broader investment strategies. The good news is that we have things that we have seeded, the biotech hedge fund is quite attractive. Think of the JAAA, JBBB, ETFs that we have. It's a tool and there are other tools that we have, I think, and the half of that could be interesting to help our clients. Hopefully, that's been clear, and it will take time, but we think we have a competitive advantage that we can bring to the market. Thanks very much, everybody, for joining and for engagement with us and to come with us on this journey. As I said a couple of times during the call, there's a lot to like at Janus Henderson and there is much work to do."
}