{
    "symbol": "FSLY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 21:42:08",
    "content": " In the second quarter 2022, we reported revenue of $102.5 million, representing flat sequential growth and 21% growth year-over-year. Total revenue for the second quarter increased 21% year-over-year to $102.5 million, exceeding the top end of our guidance of $99 million to $102 million. Enterprise customers accounted for 88% of total revenue on a trailing 12-month basis, down slightly from their 89% contribution in Q1 and increased their average spend to $730,000 from $722,000 in the previous quarter, demonstrating our continued ability to expand our business within our largest customers and our strong customer retention. Our top 10 customers comprised 34% of our total revenues in the second quarter of 2022, in line with their contribution in the first quarter of 2022. Operating expenses were $78.6 million in the second quarter, up 18% over Q2 2021 due to increased headcount across the organization, higher-than-expected salary increases, an acceleration in T&E expenses, increased investment in product and go-to-market activities, and as I previously mentioned, certain one-time expense items. As I discussed previously, as part of these commitments, we made advanced payments of $29.3 million in the second quarter, and we will be making additional advanced payments of approximately $16 million over the next three quarters to secure availability of this equipment and reduce ongoing carrying cost fees from these vendors. Our third quarter and full year 2022 outlook reflects our continued ability to deliver strong top line growth via improved customer acquisition and expansion within our enterprise customers, driven in part by new and enhanced products. Your line is open. Your line is open. Your line is open. Your line is open. While on a trailing 12-month basis, it was down slightly at 1%, 88% of total revenues from 89%, we did see an increase in new enterprise customers this quarter of 14 compared to 12 in the last quarter and the average spend across our enterprise customers increased from $722,000 to $730,000. Your line is open. Your line is open. Your line is open. Your line is open."
}