{
    "symbol": "TPH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 15:43:04",
    "content": " Please proceed with your question. I mean, as you say, because demand is strong, we're continuing to operate with low levels of incentive and helping to educate homebuyers on the current market, including the low supply of existing resale homes, that's also driving more demand for our new home communities. And one of the things that we focus in on and Tri Pointe is really developing and offering products for sale and what I call main and main; well located, long transportation quarters, good schools, and you talk to our sales people across the nation and we have well located product, we offer product it's kind of a more of a first time premium first move up. Please proceed with your question. And just following-up on that last point as rates have increased, have you noticed any demand shifts between consumer segments because I'm thinking in the entry level, there's absolutely some consumers that get priced out of the market due to affordability, but you have the strong millennial demographics, trade down, lack of inventory, and then on the move up that's a more well qualified buyer, right, but they also experience rate locks. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. I mean, when you're looking at goalposts of 22% to 26%, 28% of margins, that's a pretty good buffer going into an uncertain market environment, which is our very strong land position that we own and control to 24%. Please proceed with your question. Please proceed with your question. I’ll take the latter part of that question first, because it's actually strategically something we focused on several years ago by diversifying our product offering I mentioned earlier 70% of our deliveries are going to be outside of California by the end of 2024. Some interesting changes in the mix of locations for us, we were seeing more out of state buyers, in this quarter, Maryland, and in Las Vegas, Raleigh and Charlotte, and in Houston and Austin, you may recall that, in in Austin out-of-state buyers really peaked for us in the fourth quarter of 2020, where they were 35% of our buyers, but that's moderating somewhat with 22% of Austin buyers out of state this quarter."
}