{
    "symbol": "OCC",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-13 11:08:04",
    "content": " During the first quarter of fiscal year 2023, we achieved significant growth in net sales, gross profit, gross profit margin, and bottom line results. Consolidated net sales for the first quarter of fiscal 2023 increased 26.6% to $18.3 million, compared to net sales of $14.4 million for the same  last year. We experienced an increase in net sales in both the enterprise and specialty markets, including the wireless carrier market during the first quarter of fiscal year 2023, compared to the same period last year. We believe the increase in net sales reflects increased product demand and increased production throughput during the first quarter of fiscal year 2023, compared to the same period last year, as well as improved product pricing that began to take effect from new orders received during the latter half of fiscal year 2022. Gross profit increased 61.2% to $6.5 million in the quarter of fiscal 2023, compared to gross profit of $4 million for the same period last year. Gross profit margin, our gross profit as a percentage of net sales increased to 35.7% in the first quarter of fiscal 2023, compared to 28% in the first quarter of fiscal 2022. This operating leverage, which is beneficial at higher sales levels, positively impacted our gross profit margin during the first quarter of fiscal year 2023 when compared to the same period last year. SG&A expenses increased to $5.5 million during the first quarter of fiscal 2023, compared to $4.8 million for the same period last year. OCC recorded net income of $810,000 or $0.10 per basic and diluted share for the first quarter of fiscal 2023, compared to a net loss of $936,000 or $0.12 per basic and diluted share for the first quarter of fiscal year 2022. We will report in our Form 10-Q for the first quarter, which by the way, we expect to file tomorrow morning that our sales order backlog and forward load exceeded 11 million at the end of the first quarter fiscal year 2023, continuing to be higher than typical levels."
}