{
    "symbol": "ONTX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 20:54:04",
    "content": " These relate to our newly announced plans to advance our lead assets narazaciclib into a Phase 1-2a trial in second and third line, low-grade endometrioid endometrial cancer and our recent presentation that the ESMO conference featuring updated data from investigator sponsored study of rigosertib. As a reminder, narazaciclib potently inhibits CDK 4/6 alongside additional tyrosine kinases that play important roles in cancer cell growth, survival and metastasis, clinical data, which Dr. Gelder will discuss in more detail substantially de-risks our upcoming trial by providing validation and clinical proof-of-concept for narazaciclib's mechanism of action in endometrial cancer. While randomized Phase 2 studies established clinical proof-of-concept and compendium things, enable the off-label use and reimbursement of CDK 4/6 inhibitors such as palbociclib in this setting, these CDK 4/3 inhibitors on that FDA approved in endometrial cancer and have several short cuttings, related to safety, the tolerability and primary and acquired drug resistance. And I'll begin by discussing our lead program the narazaciclib, which is advancing towards a Phase 1/2a study of narazaciclib and letrozole as combination therapy in second or third line recurrent metastatic low-grade endometrioid endometrial cancer or otherwise, referred to as LGEEC. Importantly, the promising findings of this randomized Phase 2 trial with palbociclib are consistent with the results of two other single arm Phase 2 trials and patients with estrogen receptor positive endometrial cancer looking at letrozole in combination with the other two approved CDK 4/6 inhibitors, narazaciclib and abemaciclib. Taking together, we believe the available clinical and preclinical data with narazaciclib and currently approved CDK 4/6 inhibitors not only point to a high probability of technical and regulatory success for our endometrial cancer program, but also strongly suggest narazaciclib successful development would provide patients with a much needed improved therapeutic options. Looking forward, we are eager to enroll additional patients in the trial and anticipate reporting updated data in the first half of 2023 to inform the continued development of rigosertib nivolumab combination in KRAS mutated non-small cell lung cancer. Looking first at narazaciclib, we expect to initiate our Phase 1/2a study in endometrial cancer in the first quarter of next year and we put preliminary data in the fourth quarter of 2023."
}