{
    "symbol": "ONTX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 19:32:05",
    "content": " In addition to the ongoing and planned investigator-sponsored studies I just mentioned, rigosertib is also being evaluated as a monotherapy and an investigator-sponsored study in recessive dystrophic epidermolysis bullosa, also known RDEB, complicated by squamous cell carcinoma of the skin. On our last earnings call, I discussed some very exciting initial data from the trial which showed a durable complete response of over a year in an extensively pre-treated patients with RDEB as metastatic refractory squamous cell carcinoma who remains in complete remission today. Looking ahead, we expect to utilize this dose in future trials, including a Phase II basket study enrolling patients with various cancers, such as CDK4/6 inhibitor refractory hormone receptor positive HER2-negative metastatic breast cancer. Beyond data on nerazacyclib’s inhibitory activity, our preclinical dataset also includes results indicating they it can suppress the growth of cancer cell lines that are resistant to palbociclib, which is currently the most widely prescribed CDK4/6 inhibitor. Steve mentioned earlier, these include an ongoing Phase I/II trial evaluating rigosertib and nivolumab in combination in KRAS mutated non-small cell lung cancer and a planned study designed to evaluate rigosertib in combination with pembrolizumab in patients with refractory metastatic melanoma. The last investigator-sponsored study I mentioned today is the ongoing trial evaluating rigosertib monotherapy in the RDEB associated squamous cell carcinoma, which has shown a durable complete response in a heavily pre-treated patient. If you look at the Phase I data from palbo, ribo and abemaciclib, you'll see that neutropenia once the dose limiting toxicity or DLP associated with both palbociclib and ribociclib, and it was really the neutropenia that was responsible for the ultimate dose selected to move forward in their Phase II and III clinical trials and it was also responsible for the necessity of a three week on, one week off schedule. No, we do not. So again, thank you for the question. No, we do not. So again, thank you for the question."
}