{
    "symbol": "LIVN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 09:15:22",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the LivaNova PLC First Quarter 2022 Earnings Conference Call. I would now like to introduce your host for today's conference, Mr. Matthew Dodds, LivaNova's Senior Vice President of Corporate Development. Joining me on today's call are Damien McDonald, our Chief Executive Officer, Alex Shvartsburg, our Chief Financial Officer, and Lindsey Little, our Senior Director of Investor Relations. Before we begin, I would like to remind you that the discussions during this call will include forward-looking statements. Factors that could cause actual results to differ materially are discussed in the company's most recent filings and documents furnished to the SEC, including today's press release that is available on our website. Also, the discussions will include certain non-GAAP financial measures with respect to our performance, including, but not limited to, sales results, which will all be stated on a constant currency basis. Reconciliations to the most directly comparable GAAP financial measures can be found in today's press release, which is available on our website. I'll start off by discussing sales results, then review our strategic portfolio initiatives and conclude by describing a recently completed tuck-in acquisition. After my comments, Alex will provide you with additional details on our results and outlook. In the quarter, we achieved 9% sales growth excluding Heart Valves. This was driven by above-market growth in Cardiopulmonary and Neuromodulation sales, which accelerated after experiencing COVID-related pressures early in the quarter. Advanced Circulatory Support sales were unfavorably impacted by hospital staffing shortages and a decline in respiratory cases, including COVID cases. Below the top line, we expanded gross profit, which was partially offset by investments in our strategic portfolio initiatives, preparations for the phased launch of our next generation heart-lung machine, Essenz, and expanded commercial efforts in ACS and epilepsy. For the Cardiopulmonary segment, sales were $117 million in the quarter, an increase of 12% versus the first quarter of 2021. Oxygenated sales grew over 20% globally, driven by procedure volume recovery across all regions, particularly in Europe and rest of world. This increased range takes into account the first quarter performance, the read-through of year-over-year comparisons, and the sales transition to the Essenz HLM. Global epilepsy sales increased 8% versus the first quarter of 2021, with growth across all regions. Similar to recent quarterly trends, total implant growth was driven by replacements, which physicians continue to prioritize over new patient implants. The progress in US epilepsy continues to be supported by our go-to-market initiative, which currently encompasses 14 dedicated CEC teams, two of which were formed during the first quarter. Epilepsy sales in Europe grew 14% versus prior year, primarily led by the UK. For full-year 2022, we continue to expect global epilepsy sales to grow 5% to 7%. Our forecast includes growth in new patient implants, as patients and their caregivers returned to in-person physician visits and hospital capacity improves. In addition, we anticipate a continued tailwind in replacement implants related to the backlog created during the pandemic that has continued into this year. ACS sales were $12 million in the quarter, representing a decrease of 10% from the first quarter of 2021. Respiratory cases, including COVID cases, declined approximately 30% year-over-year as fewer hospitalized patients required ECMO therapy. Given these headwinds, we now expect ACS growth to be in the low-single digits for 2022. As a reminder, for comparative results, Heart Valves was divested on June 1 of last year. For 2022, we anticipate DTD sales were approximately $10 million. Turning to the RECOVER study, during the first quarter, we achieved a key milestone of implanting our 250th unipolar patient. As stated previously, we believe a series of interim analyses is likely needed as we collect patient follow-up data over time. In heart failure, the ANTHEM-HFrEF pivotal trial continues to advance. During the quarter, independent statisticians conducted the first interim analysis reviewing safety, a trend towards the primary endpoint and success in the three functional endpoints. The next interim analysis will occur after the 500th patient is enrolled, which we anticipate in the fourth quarter. Moving to OSA, our OSPREY trial continues to enroll patients with the first patient implanted in February. ALung was a privately held developer and manufacturer of an innovative lung assist device for treating respiratory failure called the HemoLung Respiratory Assist System, or RAS. The business, which will be integrated into our ACS segment, and we expect to initiate commercialization of HemoLung later this year, with nominal sales expected during 2022. During my portion of the call, I'll share a brief recap of first quarter results and provide commentary on the full-year 2022 outlook. Turning to the results, sales in the quarter were $240 million, a 9% increase versus 2021 excluding Heart Valves. Adjusted gross margin as a percent of net sales was 71%, which was up 290 basis points from the first quarter of 2021. R&D as a percent of net sales was 16.7%, in line with the first quarter of 2021. SG&A as a percent of net sales was 42.5%, up from 38.9% in the first quarter of 2021. Adjusted operating income margin was 12%, which was in line with the first quarter of 2021. For the full year, we expect the tax rate range of 10% to 15%. Our cash balance at March 31 was $443 million, including $314 million of restricted cash held as collateral for the SNIA litigation guarantee, up from $208 million at year-end 2021. Total debt at March 31 was $461 million, up from $240 million at year-end 2021. Adjusted free cash flow for the quarter was $17 million, up from negative $8 million in the prior year. We're maintaining the guidance ranges shared in February as we navigate evolving pressures, such as supply chain challenges, foreign currency headwinds, and market conditions impacting ACS. This includes constant currency sales growth between 3% to 5%, excluding Heart Valves, and adjusted EPS range of $2.50 to $2.80 and an adjusted free cash flow range of $90 million to $110 million. With that, I'll turn the call back over to Damien. In summary, the first quarter was a testament to our diverse portfolio which allowed us to weather the challenging market conditions. While several variables in our original guidance assumptions have changed, we remain confident in our full-year outlook. We continue to focus on executing on our core growth drivers, delivering on our extensive clinical and product pipeline opportunities, and further improving profitability and cash generation. This emphasis on the strategic triangle, underpinned by the LivaNova business system, positions us to increase shareholder value. And with that, Melissa, we're ready to open the call for questions. Just to start off, I think a solid start. And you said, some parts of the business did a little better, offsetting weakness elsewhere. But also, I think the big thing for us was just decline in patients using ECMO for COVID. So, I think we did slightly better than the overall market. So, I think through 2022, as we see the staff shortages abate, we expect this to start bouncing back. So, they won't start reading through until mid-year. And so, the effectiveness of that team will, I hope, read through in the back half of 2022. Turning to the DTD registry, it seems like – again, correct me if I'm wrong – the timeline you've offered or suggested is, basically, you're reiterating the timing of a shift to registry as late this year or early next year. I think you've hit the headline, which is it's continuing to progress well. We implanted that 250th patient in the quarter, the unipolar patient in the quarter, and conducted the first and second interim analysis. So, we're pleased with how that's progressing. Again, as we've said, we don't want to outrun our communication with CMS, but we're pleased with how it's progressing. So, our independent statisticians review it, and all we're told is basically keep going, which, again, we think is good, stop due to futility, which is not good, and then stop because you've hit the primary endpoint. So the good news is, as Damien said, after two looks, we're not checking the box of futility. I know that the trial has an adaptive design and you could take another look, I think you said by the end of this year. I think, again, positive the fact that the first interim analysis confirmed to keep the study going. So, I think that means safety puts us in a pretty good spot. And I think the fact that the others working in a very complex environment, including COVID cases, we're making progress. And as you say, it's an adaptive study. My understanding the protocols, you get the second look at 275. Now, it's a good question. If you look at the design of the study, we do want to have more patients enrolled. And to your point, once we hit statistical significance on the assumption we do, then we would want to stop enrolling in that arm because we have to follow every patient for 12 months. So, the team is still very focused on enrollment. And as you know, every 25 patients, we can continue to look. So as we move forward, not only do we get more patients, the average follow up per patient increases as well. The other thing is, there's two arms, don't forget – the unipolar and the bipolar. We've explained we're skewing unipolar, both in terms of our effort and the patients we're seeing. We want to continue the momentum at all of the sites, so that we can continue to enroll the bipolar patients in that secondary arm as well. And to put a fine point on the timing, I ask because I know I'll get asked. So, you announced the 250 at unipolar implant on March 14th. The second look was taken when, I presume, within the last week, two or three. Yeah, so every four to six weeks, I think, is a good estimate if you're modeling that. It's now expected, I think with the 150 implants, late 2022, early 2023. So, first, maniacally focused on unipolar. If we get bipolar patients through the consenting system, great, but the real focus is on unipolar and then we'll move on to bipolar as an idea to expand the indication later on. So, the enrollment did slow down a little bit in January and February. Similar to what you've heard with a lot of people talking about revenue, you can assume the same thing occurred on the clinical side. No, there's a long process. So, we're playing this day by day. Finally, the heart-lung machine growth was surprisingly strong, given you've got this Essenz launch coming. So, one, I guess you've launched Essenz outside the US, or Europe maybe. We were expecting a slowdown in the F5 placements, sort of customers anticipating Essenz in the back half, but that has not happened, which is great for us and we continue to do well on that front. Maybe just first one for me, very dynamic procedure environment. Would just love, Damien or Matt, a little bit more color on kind of what you're seeing real time kind of exit velocity. In April, just puts and takes for some of those different segments. When we spoke in February, late February, I think we talked about the patient funnel improving through the quarter. I think the two bottlenecks that remain are surgical scheduling with staff shortages are definitely impacting new patient implants, as are the EMU capacity for new patient workups. So, I think the dynamics that a lot of people are reporting, definitely, were what we saw. I think, in CP, cardiac surgical volumes have returned to the pre-pandemic levels. No, I think that's it. Again, as Damien said earlier, with ACS, that was the one that went the other way because of the staff shortages and the reduction in COVID patients that use ECMO. Adjusted EPS, I think, $2.50 to $2.80. Maybe just unpack some of the key assumptions in that range, what's contemplated, for example, for currency impact to EPS. And then, if I saw correctly in the materials, I think your non-GAAP and the interest from the bridge loan, so maybe just kind of walk through some of those items and kind of how to think about the high end versus the low end of the guidance range. The expected increase is primarily driven by the Heart Valves divestiture, positive product mix, and other efficiencies that are offsetting our supply chain cost challenges. As far as R&D is concerned, as a percentage of sales, that's going to increase slightly versus prior year. And this is largely due to the initiation of the OSPREY trial as well as the investments in ACS and epilepsy commercial – sorry, in epilepsy R&D programs. From an SG&A perspective, slight increase versus 2021. Our total OpEx, I think we talked about this before, quarterly run rate is approximately $140 million. And as you said, we're non-GAAPing the bridge, the interest related to the bridge facility as that's related to the SNIA litigation. And our tax rates, we're projecting at 10% to 15% as the range. If we continue to expand the US epilepsy penetration, I think that's an upside. I think if supply chain challenges abate as we go through the year, we're playing month by month, but the Cardiopulmonary business and especially heart-lung machines swing to the upside, depending on how people react to Essenz, we continue to see heart-lung machine demand, but we're anticipating that people will wait for that launch. And we're also counter-measuring the Russia-Ukraine, headwind. So all of those things are the puts and takes, and that's why we have this range and we're sticking to our original February guidance on that EPS range of $2.50 to $2.80. And this is a question that I get from clients, just around communication strategy or kind of the pathway for the Street looking ahead. It sounds like things continue to track in line with previous expectations in terms of transition to the registry late 2022, early 2023. That is our next milestone, is the communication of that transition to registry, which will follow our communication to CMS. Again, we don't want to end run the discussions with CMS, but that's the next milestone. So, the incremental FX headwind, I'm hoping, Alex, maybe you can speak to the drop through rate and how much of an impact you're offsetting down on the bottom line for FX. We're obviously counter-measuring it with cost reduction, productivity initiatives and that's kind of the way we're able to offset the impact of the inflationary as well as the FX challenges that we have. So, that's why it's a significant drop-through from a gross profit perspective. But, again, we're counting-measuring it with productivity and cost reduction. And the other one, just mentioned the RU conflict, I was hoping maybe a finer point on your rest of world exposures. Obviously, rest of world was actually quite strong in the quarter. I'm wondering exposure to RU and the impact you've seen in China, impact seen kind of where we are today and any other markets you'd call out that have been incrementally hit. We saw a limited impact from China, really hardly any. Obviously, the lockdowns have had an impact in the market, but we haven't really seen it on read-through from a performance perspective. If I could just sneak one more in, definitely understand the inflationary supply chain issues. Look, I think that's one of our big things that we've really focused the team on was the whole supply chain, logistics, microelectronics availability, epoxy availability, transportation logistics, and lead times, all the things that we're focused on with the team. So, our process so far has been increasing communication with suppliers, looking for alternative suppliers where there's a need. But so far, the team have progressed well, but like everyone we continue to face those headwinds. If my memory serves, it was roughly 800 procedures at the beginning of this quarter. So, just curious how much of that backlog you worked through and then how much you expect to work through through the course of the year. Right now, we think the numbers are around about 700. So, we've burned through about 100 in the quarter. And again, I think people continue to put this at the top of the stack versus new patient implants. So, physicians are definitely skewing these end of service patients, and we're gradually working our way through that backlog. CFO question, just with the inclusion of the bridge facility now to backstop the Italian surety. Alex, I'm hoping you could bridge the adjusted free cash flow guidance for the full year of $90 million to $110 million. And so, we're looking to refinance that in probably the next quarter or so. So if we're modeling based on what we're seeing, we're kind of leaning towards sort of public data as a refi facility. So, modeling kind of the current interest rates, so we're looking at $15 million to $20 million of potential impact on an annual basis. So, we're going to continue to adjust it from operating earnings until there's a ruling on the case. If we end up winning, it's obviously a non-issue. If we lose and have to pay for the damages, it essentially becomes a permanent part of our capital structure and that's when we'll move it into operating earnings. As that was our final question today, I would like to hand back to Damien McDonald for any closing remarks. And on behalf of the entire team, I just appreciate your support and interest in LivaNova and we look forward to updating you on our Q2 call."
}