{
    "symbol": "BLDE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 11:21:12",
    "content": " All of this hard work led to another quarter of significant growth in flight profit, which increased 38% versus the prior year period, while adjusted corporate expenses as a percentage of revenue declined to 35% in the fourth quarter of 2022 versus 40% in the prior year period; again, demonstrating our strength across key metrics that will bring us to profitability. The softer ski season in Europe and a return to pre-COVID off-season demand for our New York commuter products more than offset growth in Canada and Blade Airport, resulting in a 5% year-over-year decline in pro forma organic revenue for Short Distance in the fourth quarter of 2022. The performance in Short Distance this quarter, in what is seasonally a low revenue quarter, should not eclipse the fact that 2022 was a record revenue year for the Short Distance business, with 70% revenue growth for the full year versus the prior-year period. Key drivers of the year-over-year decline include, lower utilization in our seasonal by-the-seat jet service between New York and South Florida and faster-than-expected growth in our MediMobility Organ Transport business, which saw revenues increase 120% year-over-year and now represents 57% of total revenue in the fourth quarter 2022 versus 40% in the prior-year period. When adjusting for the earnout and other non-cash or non-recurring items, we're pleased that our adjusted corporate expense as a percentage of revenues declined to 35% of revenue in the fourth quarter of 2022, versus 40% in the prior-year period. The increased loss versus the prior-year period is primarily attributable to additional corporate expenses related to Blade's recent growth and expected future growth, including marketing and software development, in addition to Blade Europe, where this quarter felt the full burden of SG&A related to our acquisitions, despite limited revenue and flight profit, which did not cover Europe's SG&A in the seasonally weakest fourth quarter. Your line is open. Operator, we can take the next question. Your line is open. Operator, we can take the next question. Your line is open. Your line is open. Your line is open. Your line is open. So, if you add another $70 million of revenue from where it was in the calendar year 2022 over some period of time at 15% to 20% flight margins, which is what we've talked about, that brings our adjusted EBITDA down to somewhere in the negative single digits and that's before we make any improvement in airport profitability, which is a significant drag before we've made any kind of incremental improvements to our businesses in Europe and Vancouver, which we're still in the process of launching the brand and technology in both of those new markets for us."
}