{
    "symbol": "BLDE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 18:36:11",
    "content": " Revenue in the September quarter increased 125% to $45.7 million versus $20.3 million in the comparable 2021 period, contributing to another record quarter for both revenue and flight profit and establishing year-to-date revenue of $108 million for just the first 9 months of the year. Importantly, on a pro forma basis, assuming the acquisitions of Trinity Air Medical, Blade Canada and Blade Europe closed for the comparable period last year, our organic revenue growth would have been approximately 60%. In addition to geographic expansion, we have also continued to diversify Blade's business across end markets with nearly half of our $133 million in trailing 12-month revenue now coming from Organ Transportation or what we call like MediMobility. Blade entered the organ transportation market because we saw an opportunity to leverage the combined buying power of our entire customer base across our vast network of highly vetted aircraft operators, as well as our logistics and technology platform built over seven years for our passenger business, providing hospitals with better speed, pricing and reliability in a way that few others can match. On a pro forma basis, assuming we had owned Trinity for the entire prior year quarter, organic revenue growth would have been approximately 174% with roughly one-third driven by new customer acquisition and two-thirds driven by growth with existing clients. Though Flight Margin of 20.3% decreased versus 22.0% in the prior year period, we donâ\u0080\u0099t believe the year-over-year comparison is meaningful given the enormous growth in our MediMobility Organ Transport business, which saw revenues increase 801% year-over-year and now represents 44% of total revenue this quarter versus just 11% in the prior year period. Looking ahead to the fourth quarter, we expect Flight Margin of approximately 14% to 15%, as MediMobility comprises an even higher percentage of revenues, in what is typically a seasonally lower quarter for our Short Distance business."
}