{
    "symbol": "BLDE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-10 10:29:07",
    "content": " Thank you for standing by and welcome to the Blade Air Mobility conference call and webcast for the quarter ended March 31, 2022. Before we get started, I would like to remind you of the company's forward-looking statements and Safe Harbor language. Statements made in this conference call that are not historical facts, including statements about future time periods maybe deemed to constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. As stated in our SEC filings, Blade disclaims any intent or obligation to update or revise these forward-looking statements, except as required by law. During today's call, we will also discuss non-GAAP financial measures which we believe may be useful in evaluating our financial performance. Hosting today's call are Rob Wiesenthal, Founder and Chief Executive Officer of Blade; and Will Heyburn, Chief Financial Officer. I'd like to thank you for your interest in Blade and welcome you to our earnings call for the first quarter ended March 31,2022. I'm extremely happy to report that our growth in the first quarter ended March 31, 2012 was well ahead of our expectations. It demonstrates our success in diversifying Blade’s geographic footprint and consumer base, while staying true to our core strategy of aggregating the world's best existing use cases for Urban Air Mobility and last smile precious cargo. Revenue growth in the March 2022 quarter was driven in large part by MediMobility Organ Transport business where we have won 14 new clients year-to-date in 2022, far more than we expected, further extending the footprint of our medical business to 20 US states. It is also a testament to our Blade in the box operating and acquisition platform, which enabled us to quickly integrate Trinity Air Medical with repurchases in September 2021 and immediately begin realizing revenue and cost benefits. As a result, we've now armed our MediMobility sales team with what we believe is the most competitive cost structure, strongest logistics technology platform and the absolute best client service in oregon transport today. This service oriented approach’s inherited from our long history of providing seamless or as we say here, advanced team level mobility services to business people and discerning travelers in our short distance business. Precision and redundancy has always been a key part of our DNA here at Blade and in our organ transport business, it means the faster response times and shorter trips at more economical prices. When it comes to moving organs, reducing transit times leads to better clinical outcomes for the transplant recipient and it is very rewarding for us to provide this critical service to every major transplant center in our hometown community of New York City, as well as across the United States. In our consumer-facing businesses, as expected, we saw headwinds from Omicron during this past quarter, particularly in Blade Airport and Vancouver were lower utilization led to a contraction in flight margin. However, we chose to maintain service availability and in recent weeks, we've been rewarded for that decision with record volumes in our New York City Airport transfer business. I'll let Will discuss recent demand signals in more detail, but it is incredible to see people getting back out and enjoying travel once again and as well as the decision by executives to get back on the road for business. Growth was driven by the resumption of our Blade Airport service, which began in June 2021, increased demand for personal and business helicopter charter, as well as our acquisition of Helijet's passenger routes in Vancouver, which contributed $1.8 million of revenues in the quarter. Growth was driven by the addition of new hospital and jet clients, our acquisition of Trinity Air Medical and stronger demand for our seasonal Blade One jet service between New York and South Florida. Trinity is firing on all cylinders and we're excited about the power of combined Blade and Trinity platform, which has accelerated organic growth and significantly expanded our customer base. As discussed on our last earnings call we made the decision to maintain full service levels throughout the past Omicron wave, and thus, we did expect to see some margin pressure this quarter, given lower utilization in our consumer-facing businesses. As such, slight margin decrease this quarter to 11% versus 16% in the comparable 2021 period, driven by the resumption of Blade Airport service in June 2021 which was operating below breakeven utilization during the ramp-up phase this quarter, coupled with Omicron impacts to both Blade Airports and Vancouver. In Airport, we saw our best week ever this month with a 25,000 flyer per year run rate and we will continue to invest in capacity and route expansion ahead of demand. Additionally, we expect recent seat price increases, as well as strong return to travel sentiment amongst our flyers to further improve flight margin in future quarters. In short, now that COVID restrictions are being lifted folks are getting back to enjoying the travel they had missed for leisure and getting back on the road for business meetings and conferences. Absent Blade Airport in Vancouver, flight margin would have been approximately 17% in the current quarter. Going forward, we will continue to provide detail regarding the impact of new routes and our quarterly flight margin in order to provide investors with greater clarity and to be attractive margin profile of our more mature businesses. Let's turn now to selling, general and administrative expenses, which includes software development, general and administrative and selling and marketing expenses. The increase was primarily driven by a $2.7 million increase in staffing costs in order to support our public company transition, as well as our acquisition of Trinity, a $1.7 million increase in legal and regulatory advocacy fees, which we do not expect to reoccur at the same level, $1.6 million increase in directors’ and officers' insurance expense following the company becoming public, a $1 million increase in non-cash intangibles and amortization costs in connection with the Trinity and Helijet transactions, and a $1 million increase in mergers and acquisition costs. Most importantly, when excluding the one-time non-cash and public company expenses that are added back to comparable adjusted EBITDA, SG&A decreased as a percentage of revenues this quarter, demonstrating the operating leverage of our platform. Given the significant amount of one-time expenses in the quarter, on an as reported basis we expect this first quarter to be the high watermark for quarterly SG&A expense for the year assuming we do no further M&A. Despite the short-term impact during the past quarter from the Omicron variance in our Blade Airport and Vancouver businesses, we have realized significant improvement in recent weeks. And as discussed, we expect a negative impact on our flight profit to improve in the quarters ahead. Looking forward, we know pilot availability, labor shortages and cost inflation have been top of mind for many in the travel industry, and while we we're not immune from these industry-wide challenges, I want to spend some time discussing why our business is uniquely positioned to mitigate them. Blade has long-term agreements in place with our operator partners, providing us with ample aircraft availability and pricing that is often locked in under multi-year contracts. In exchange, our operators benefit from a steady, predictable flow of business, effectively zero marketing on customer service costs and the peace of mind from dealing with a rapidly growing and well capitalized business partner. On the cost front, particularly in regards to the recent rise in fuel prices, we are well positioned by the fact that our MediMobility contracts are generally structured with fuel price pass-throughs, which neutralize the economic impact of fuel on Blade’s organ transport business. In our short distance business, the low fuel consumption of our aircraft and short flight time for the majority of our routes means that our costs are much less sensitive to fuel prices. For example, on Blade Airport we utilized the Bell 47 which burns just 1.3 gallons of jet A per seat on a flight between Manhattan and the three New York airports. In short, we are proud of our strong results and operating execution this quarter, demonstrating the value in operating the world's largest urban air mobility company and we are very encouraged by the operating metrics we are now seeing in the current quarter. We built this business from the ground up to be profitable and scalable using conventional aircraft and we are laser focused on deploying capital in a manner that generates attractive returns today and increases the long-term intrinsic value of our business, as evidenced by the recent acquisitions of Trinity Air Medical and Helijet's passenger business. Over the long term we believe the unit economics of EVA will supercharge our return profile and enable the creation of new, more convenient landing zones generating substantial incremental value for our shareholders and our customers. Our business does not require EVA or additional capital to reach profitability, we are extremely well capitalized, not only to continue scaling our business, but also to take advantage of potential opportunistic acquisitions that may present themselves, especially given the current capital markets environment. In terms of the recent price increases for the summer, we have seen real elasticity, no push back from our flyers. I think certain products you will see other price increases and it's really to kind of balance the destinations, the type of aircraft and kind of try to optimize our financial profile going through the summer. So it was high time, especially given the high touch-value product that we are giving our flyers and the recovery that we have in terms of anything happens, the bad weather, in  (ph) and service. As we've spoken before, it just because you are sitting in traffic doesn't mean it's a good route for Blade. We've talked about London -- let's call it Heathrow to London, there is no place that's great for land is the Battersea airport, it isn't competitive with ground or the Heathrow Express. So we do see high friction routes where we think we can replicate our model that provides value to the flyer, both in terms of time savings and that can be done in an economical cost. And we need people on the ground who are aware that you are very knowledgeable about the regulatory environment, great relationships with the operators that we're building, and this is something that we've been working on for quite some time, but we're be very prudent in our strategy in terms of how we execute and when. I guess, year-over-year and sequentially your revenue per seats flown is down, presumably because of, I guess, the changing mix of Airport West Coast Vancouver along with the East Coast. Again, we've always spoken to all of you, our investors and our great research analysts that follow us, you never going to see a global or the world with dots all over saying where Blade operates. It is very fragmented, however, there are some routes that really do have that kind of volume, that kind of friction reduction, that kind of trust with the customer that are used very often. The areas we're looking in, we're not looking at doing science experiments, we want to do proven routes that reduce friction to people, whether it'd be driving through mountainous terrain that ends up taking you six hours instead of 30 hours by flight or going between resort destinations where our brand is well known. As you know last year in 2021 during this time, we didn't have the airport product available and we also didn't have Helijet, those are both products that fly a whole lot of people at a much more affordable price. And so, if you look at the total number of flyers, that's to give away, it's almost nine times what we did in this quarter last year. But I want to stress, it has nothing to do with less business in the other areas like medical, we're really seeing growth on all fronts, particularly the short distance business, which as you know, like a lot more passengers. Again, our goal is to -- it's a truly scale and to be a product that is affordable by many, many people. Because of price increases and Uber and Lyft in New York City market, we really have shattered Uber Black pricing with $195 or $95 for an airport pass, sometimes even beating UberX during rush hour. Was it driven by more flyers going to work every day or was it just driven by more flyers but still engaging more in hybrid world, if you could just kind of provide a little more color regarding the pattern, that'd be great. Yeah, look, we're really thrilled to see folks getting back on the road again. The best information I have for you is, we do some surveys for all of our passengers and what we're hearing is that, about 60% of the people who have been flying are traveling for business. And when we look at kind of the back-to-work stats, I know everybody looks at the  (ph) back to work and all of that, we still have a little bit of ways to go here in New York City. But the great thing about our Blade Airport product is that, people love it for leisure and they love it for business. One last point I’ll mention is the -- in terms of the composition of the business flyer, these tend to be smaller businesses in terms of flying, these are the first guys to get on the road to be competitive, maybe with the larger businesses, we're also more flexible in terms of policies, but we are starting to see bigger companies finally come in. It's probably a little bit less than what we would see pre-COVID, which makes sense, because when we look at occupancy levels and offices around Manhattan, we're not quite back to where we were pre-COVID. And just looking in terms of lease signings in some areas that are near some of Blade’s terminals, such as Hudson Yards and others, we looking at people fully occupied buildings, lease signings that are being renewed and some of them in the kind of 100 or 200 hours of foot range. So we're very, very encouraged by the amount of we see swiping and going back to work and lease renewals for office space that’s near our Blade terminals. Just to put it in perspective, at this time last year Trinity did about $4 million -- touched more than $4 million of revenue. When we bought them, if you recall, towards the end of September of last year they were doing about $5 million of revenues a quarter. So I think there's a lot of growth to come there, but we're really, really encouraged with how much of a benefit we're able to provide combining those two businesses. I mean, I think this MediMobility and Jet line really came in much higher than anybody's expectations. We're not going to break out the businesses separately, but MediMobility is the majority of that MediMobility Oregon transport and Jet Line. And the most important part to remember is, we do have to Blade One scheduled by the seat service that's in there, that’s seasonal and that service ends at the beginning of April. So you'll see that fall off in the next quarter, but we do think that's going to be more than offset by some of the growth in our commuter businesses which goes into short distance. And then the remainder of what's in that line is jet charter, which has been growing really nicely, both in terms of the volume of trips and also the price of those trips. For Blade One that's Q1 and then it will be nothing in Q2, de minimis in Q2, nothing in Q3 typically. It's really that Q1, that March quarter where you see Blade One go through. You talked about price increases and you also talked about how fuel prices is, it’s actually fairly minimal. And I guess really what I'm trying to get at is, how we should think about the impacts to your flight margins. I think we see it on more of a trailing basis, given the nature of our agreements with operators where we typically lock those kind of costs in for one, two or three year periods. In some cases they're able to pass through fuel, that's typically in the MediMobility business where we're passing it through to our customers anyway. What I would say on that is, particularly on the rotorcraft side of things in the commuter business, that's the area where you might see a little bit more of an impact, because those flights are longer and that's actually the area where we have the most pricing power. So you may have seen, we've increased prices on a lot of those commuter routes by as much as 30%. And so, we think that more than offsets any cost inflation when you think about it in terms of the margins and it’s really designed to just balance our demand amongst the different places we can land. There is an opportunity over time, particularly when we are on-boarding a lot of new customers very quickly to get the margin to a better place. Basically what happens thought is, as you know and you can see from our numbers, the contracted lift we have with our network of operators is a really small percentage of the overall flying we do. And Bill, I'd also add that, when you think about a new hospital which generally is, call it, a new route. If we started a new route for passengers, that typically requires increased utilization, ramping up and marketing costs. Kind of somewhat housekeeping but related to your OpEx, I think you pointed out M&A cost and other public expenses, if I add it all, it looks like it's about $4.9 million. So some of the non-cash stuff like the intangibles, amortization for the acquisitions, we're going to be living with that for a period of time. Going forward, we think that will not reoccur, it's a one-time expense associated with some of the advocacy for -- particularly airport on Long Island. I'm just -- I'm kind of -- you obviously have new routes and your spending on acquisitions, just trying to understand how we should think about OpEx trends on a normalized basis and then carrying that forward over the next several quarters. Definitely, we set the high watermark, so we believe it's going to decrease over future quarters and we think it should become a smaller percentage of revenues over time as well."
}