{
    "symbol": "BLDE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-10 20:47:32",
    "content": " In Short Distance, revenues were up 191% to $6.2 million in the December 2021 quarter versus $2.1 million in the comparable 2020 period. The increase was primarily driven by an increase in corporate overhead costs of $2.6 million to support continued business growth, an increase in non-cash stock-based compensation of $1.3 million, one-time transaction-related expenses of $0.9 million, as well as recurring costs paid to third-party auditors and consultants related to our new status as a public company of $2.2 million, $1.6 million of which represents premiums for our directors’ and officers’ insurance. Excluding these one-time non-cash and recurring public company costs, G&A expense increased approximately $4.5 million to $6.6 million in the December 2021 quarter versus $2.1 million in the comparable 2020 period, primarily reflecting the continued expansion and enhancement of our corporate team as we execute on our growth plan, both organically and through acquisition. Selling and marketing expenses increased one $1.1 million to $1.5 million in the December 2021 quarter, driven by our expansion of our Short Distance business lines and associated marketing activities. Compared to the pre-COVID comparable 2019 period, selling and marketing expenses increased $0.5 million or 49%, which primarily reflects increased marketing activities associated with our growth and business line expansion. The decrease was primarily attributable to increased headcount and new recurring expenses related to BLADE 's status as a public company consisting of incremental D&O insurance of $1.6 million and other fees paid to third-party auditors and consultants of 0.6 million excluding the new recurring public company expenses above comparable adjusted EBITDA of negative $3.7 million decreased versus negative $1 million in the comparable 2020 period, but improved from -$4.6 million."
}