{
    "symbol": "CPB",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-01 12:07:04",
    "content": " Our condensed icons continued to perform well this quarter, with share up 4.1 points and consumption up 29.6% versus the prior year. Compared to the prior year quarter, Pace gained 0.4 points of dollar share and grew consumption 14.5%, while repeat rates increased 5.9 points versus 3 years ago. Adjusted EBIT increased 5% compared to the prior year to $269 million, primarily due to higher adjusted gross margin, partially offset by higher adjusted administrative expenses and lower adjusted other income. For the full year, organic net sales increased 2% and adjusted EBIT decreased 4% compared to the prior year, resulting in an adjusted EBIT margin decrease of 90 basis points to 15.1%. As a percentage of fourth quarter net sales, adjusted administrative expenses were 7.7%, a 30 basis point increase compared to last year. As previously mentioned, adjusted EBIT increased 5% in the quarter, primarily due to an 8% or $44 million improvement in adjusted gross margin, as volume declines were more than offset by the net rate improvement, resulting in a 40 basis point adjusted EBIT margin contribution. Despite adjusted marketing and selling expenses increasing $4 million versus the prior year, they were lower as a percentage of net sales, and therefore, had a positive impact on our adjusted EBIT margin of 30 basis points. Overall, within our Meals & Beverage division, the fourth quarter operating margin increased year-over-year by 160 basis points to 17.2%. Our productivity improvements of approximately 3% and cost savings of approximately $60 million in fiscal 2023 will continue to play an important role in mitigating inflation, which is expected to be in the low teens range for the year. We expect pension income to decline year-over-year by approximately $35 million, representing a headwind of approximately 3% to adjusted EBIT and adjusted EPS growth in fiscal 2023. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}