{
    "symbol": "CPB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-08 11:50:04",
    "content": " Turning the profit, net price realization and our strengthened supply chain execution offset the impact of accelerating inflation and lower volume, resulting in a 23% increase in adjusted EBIT and a 37% increase in adjusted EPS in the quarter. Going forward in Q4, you should expect to see us: one, continue to work hard to use all our tools to combat inflation and manage margin pressure; two, leverage improving supply and execution to further recover distribution and inventory levels; three, return promotional and marketing investment to strengthen competitiveness and combat private label trade down; and finally, four, work to create a compelling fiscal 2023 plan that balances the many nearing challenges while maintaining the momentum and progress on our long-term strategic plans. As I will review in more detail in a moment, we are raising net sales guidance based on our performance year-to-date as well as our expectations for continued strong consumer demand for our brands, limited price elasticities, continued supply recovery and improved service levels. Adjusted EBIT increased 23% compared to prior year quarter due to improved adjusted gross margin performance and lower marketing and selling expenses, partially offset by sales volume declines and lower adjusted other income. As previously mentioned, adjusted EBIT increased 23% in the quarter, primarily due to a 90 basis point or $87 million improvement in adjusted gross margin. Despite adjusted administrative and R&D expenses increasing $4 million versus the prior year, it was lower as a percentage of net sales versus the prior year, and therefore had a positive impact to our adjusted EBIT margin of 40 basis points. Segment operating earnings in the quarter increased 25%, primarily driven by improved gross margin performance and lower marketing and selling expenses, partially offset by higher administrative expenses. We are raising our full year fiscal 2022 net sales guidance to reflect year-to-date performance, expectations of continued strong demand for our portfolio of brands and limited price elasticities amidst a heightened inflationary environment as well as continued supply recovery and improved service levels."
}