{
    "symbol": "EZFL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 03:41:10",
    "content": "  Operator: Good day, everyone, and welcome to today's EzFill Holdings Second Quarter 2022 Earnings Call. Good afternoon, everybody, and thank you again for joining us for the EzFill conference call to discuss 2022 second quarter financial results. Before we begin, as usual, we would remind everyone that certain matters discussed during today's call or answers that may be provided to questions may constitute forward-looking statements as defined under federal securities laws. Words such as may, should, projects, expects, intends, plans, believes, anticipates, hopes, estimates and variations of such words or similar expressions are intended to identify forward-looking statements. These statements are subject to numerous conditions, many of which are beyond the control of the company, including those set forth in the Risk Factors section of the company's annual report in Form 10-K filed with the SEC. Good afternoon, everyone, and thank you for joining us today to review our second quarter 2022 results. As our press release indicated, we continue to execute our growth strategy as one of the fastest-growing on-demand mobile fuel providers. We don't necessarily see that as a national trend, and of course, we don't currently do business in California. Fleet companies recognize the services that we provide help their bottom line by helping them eliminate driver downtime as well as fraud, which reduces their cost. At the same time, consumers have clearly demonstrated a preference for on-demand on-site delivery of goods and services, and we continue to see a strong and growing evidence that this consumer preference will extend towards mobile fueling. Before Arthur reviews our financial results for the quarter, I'd like to highlight a few key developments in Q2 performance. We've added approximately 30 new fleet customers in the quarter, bringing our total since the beginning of the year to approximately 40. Not only is this a positive development in and of itself, but with each new commercial agreement, we reduce our reliance upon any one large customer. In Q2, that number was less than 40%, and we continue to drive that number down as our business grows. While we can't get into specifics about the identity, we can state that this is an ideal customer for us, a well-known grocery chain making decision â\u0080\u0093 decisive entry into home delivery, meeting a growing consumer demand just as we are with the opportunity to expand the client relationship as they grow, and we demonstrate our value proposition to them. And while we have already begun commercial deliveries in these locations, we are working diligently for the approvals to support residential consumers and retail marine demand in these markets as well. As we approach hurricane season, we're delighted to have launched our Emergency Fuel Services Program in which we ensure that clients can rest easy knowing that should a hurricane disrupt fuel supplies, their vehicles will remain fueled. We've laid the groundwork for continued growth in all three of these verticals, and I think it's fair to say that we delivered what we said we'd deliver. Our financial results for the quarter continue to illustrate the growth we've outlined to the investment community, the investment in infrastructure to support demand as our revenue ramps. The increase was driven by a 30% increase in total gallons delivered from 607,765 to 789,970 gallons in the second quarter of 2022. It reflects the increase in sales as well as the hiring of additional drivers to support the growing business, primarily in new markets. Operating expenses, excluding depreciation and amortization, were $3.4 million for the second quarter of 2022 compared to $1.7 million in the prior year period, a net increase of $1.7 million. We're especially â\u0080\u0093 only maintain our margin per gallon in the period, but to increase it 32% from $0.37 per share in 2021 to $0.49 per share â\u0080\u0093 per gallon, I should say, in the second quarter. Fuel prices were already rising, challenging everyone's cost structure, went into the mix, we saw the outbreak of war in Ukraine. Despite this, we were able to increase our overall fuel margin mainly due to the addition of new fleet accounts at significantly higher average margins per gallon. We expect that as we continue to add an increasing number of commercial fleet accounts and more consumers, including marine, our average fuel margin per gallon will continue to remain strong. Depreciation and amortization increased to $0.46 million in the second quarter of 2022 from $0.23 million in the prior year period, primarily  in the fleet of delivery vehicles. On a GAAP basis, we reported a net loss in the second quarter of 2022 of $3.9 million compared to $2 million in the prior year period. Our cash position at quarter end was $10.2 million, including investments, compared with $16.9 million at year-end 2021. We experienced strong top line growth in Q2, reflecting the new fleet contracts we signed both in Q1 and Q2. As we continue to serve more and more businesses and consumers in each market and scale our business, we will increase utilization of our truck fleet. We expect the delivery fleet size to reach 40 before the end of Q3, and it could approach 50 by year-end under current commitments. In the meantime, we have more than enough truck capacity to grow our business as planned. Going forward, we will continue to spend as needed to support our new markets with a focus on hiring additional drivers and sales reps as well as completing the advertising campaign that is currently in progress. Well, we're â\u0080\u0093 yes, I mean, as of today, we have 36 trucks. If we enter a new market in the next quarter, then we're going to â\u0080\u0093 we'll probably deploy two trucks in that market and then the other two where they're most needed. New York will continue to be a market that we're growing and looking at and planning on entering into, hopefully, sometime this calendar year. So certainly, we'll continue to expand, leveraging our current relationships. We've learned a lot as far as expansion in the West Palm Beach, Tampa and Orlando as far as what you need in the expansion part of the process. And you're right, it's about the facility, parking, fueling, the regulatory environment, getting the compliance approved and those kind of things. Certainly, the cost will proceed the revenue streams as we go into these new markets, which we've seen with our results this quarter. But also, we'll start to be able to leverage a lot of the expansion that we've already done in West Palm Beach, Tampa and Orlando. In Q3, we'll start to see a lot of good benefits of that since some of the costs have really been incurred as far as that expansion process. I think I heard you correctly, I mean, up from â\u0080\u0093 if I counted correctly, I mean â\u0080\u0093 and you're at 40 now. So I mean 10 in the prior two quarters, 4Q 2021 and â\u0080\u0093 maybe that's not exactly right. No, I think it's â\u0080\u0093 part of it is our sales fleet. So we've got four people, five now in some of those markets and some of the new markets that we've entered into. So I think also, we've got some time in those markets. So as we're continuing to grow and promote and our salespeople continue to leverage the relationships that we currently have, we are extremely optimistic about our fleet business continuing to grow. And then I'll see if there's other questions and maybe to come back after if there's not a â\u0080\u0093 I mean the momentum and the average margin per gallon is impressive, I mean, the last three, four quarters. Are there â\u0080\u0093 I mean â\u0080\u0093 so it seems like once you have those momentum, you sign up higher contracts, I mean, quite predictable in what you can price to the fleet customers. So the average has been going up because the very large fleets that had been a drag on the margin were more or less flat the existing large fleet business, except for one new â\u0080\u0093 we did have one new very large fleet this quarter. And I'll add to that, that a very significant portion of the new business was in the new markets, all right. I mean the specialty business, what we call specialty is marine, construction, landscaping, those kind of things. So we've got consumer fleet and then specialty, which is really the vertical which includes residential. And the consumer effort, are you currently â\u0080\u0093 you're out there marketing. So we went on a very robust campaign, I would say, starting in the May, June time period. But the initial results as far as downloads, receptivity, understanding which of the â\u0080\u0093 really which of the tactics are most effective. I just want to say thank you all for joining us, and we look forward to reporting back to you in the third quarter."
}