{
    "symbol": "RFP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 11:33:06",
    "content": " We further strengthened the balance sheet with significant cash generation in the quarter and we improved the competitiveness of our business with two tuck-in acquisitions in the wood products segment, namely, the other 50% of our engineered wood partnership, allowing us to lock in the downstream integration of over 60 million board feet of lumber capacity and the co-generation facility, adjacent to our center sawmill, which allows us to maximize the use of biomass from our regional operations, generate green power, and further enhance our competitiveness in the Abitibi region. Special items in the first quarter included $45 million and other income, mostly due to a gain on our 50% equity interest in the Resolute LP I-Joist partnership in connection with the acquisition, $7 million in non-operating pension and other post-retirement benefits costs, and $4 million in floater-related charges for the indefinite idling of the Calhoun mill. Compared to the previous quarter, our results include the favorable impact of $7 million from the indefinite idling of pulp and paper operations at the Calhoun mill, which occurred early in the first quarter. Total sales in the quarter were $945 million dollars up by a $111 million compared to the fourth quarter, reflecting higher realized prices in all segments, partially offset by lower shipments as a result of logistic constraints, and the indefinite idling of our Calhoun pulp and paper operations. Mainly driven by higher log costs, manufacturing costs rose by $23 million in the quarter after removing the impact of volume, including the capacity curtailment at Calhoun and foreign exchange. Compared to the fourth quarter, all-in delivered costs for the wood products segment rose by $77 per thousand board feet, or 17%, mainly reflecting higher stumpage fees I'm already saying expenses. The delivered costs and tissue increased by $141 per short ton, or 7%, mostly due to higher pulp prices, including the loss of direct pulp integration as the Calhoun mill. We generated a $147 million of cash from operating activities in the quarter, despite an increase of $67 million of inventory mainly as a result of logistic constraints and the seasonal buildup of logs ahead of this spring breakup."
}