{
    "symbol": "HELE",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-05 14:38:06",
    "content": " This primarily reflects organic declines in the Beauty, and Home & Outdoor segments due to lower consumer demand, shifts in consumer spending patterns, inventory adjustments by retailers, and $5.7 million in personal care sales and the base last year that we subsequently divested. On an adjusted basis, operating margins declined 3.2 percentage points to 13.9% as operating leverage on higher sales and lower annual incentive compensation expense was offset primarily by higher outbound freight costs, increased marketing expenses, a less favorable segment mix, higher salary and wage costs, higher distribution expense, and the unfavorable comparative impact of gains recognized on the sale of property and the North America personal care business in the prior year period. Adjusted operating margin was down in all segments for the quarter with the most significant decline in beauty, primarily reflecting unfavorable operating leverage, increased salary and wage costs, higher distribution expense, and increase in marketing expense, and the unfavorable comparative impact of gains on sales of assets recognized in the prior year period. Adjusted operating margin for Health & Wellness declined as favorable operating leverage and lower personnel expense was offset primarily by the unfavorable comparative impact of tariff exclusion refunds received in the prior year period, increased outbound freight costs, higher distribution expense, higher inventory obsolescent expense, and higher marketing expense. The consolidated decline is expected to be driven primarily by a decrease in operating leverage, the net dilutive effect of inflationary price increases, the dilutive impact of Osprey acquisition in the Home & Outdoor segment, higher distribution expenses, increased salary and wage cost, and an unfavorable product mix within the Health & Wellness segment. Although, it is difficult to predict the current macroeconomic business environment and consumer purchasing behaviors we will encounter, I believe that the initiatives identified under Project Pegasus will help us offset some of the anticipated cost headwinds we expect to pace in fiscal '24 as we annualize higher interest rates, incremental depreciation for our new distribution center, and plan for higher annual incentive compensation expense. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}