{
    "symbol": "WMT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-02-17 12:31:03",
    "content": " During the fiscal year just ended excluding divestitures, we grew net sales by 9%, grew operating profit by 18%, invested $13 billion in CapEx to grow our business returned $16 billion to shareholders via share buybacks and dividends, grew our advertising business globally to $2.1 billion and took important steps to build our U.S. financial services capabilities with agreements to make two key acquisitions. Globally, it's been growing at a high rate with high margins and is now a $2.1 billion business and only a few years, and we expect this strong growth to continue. Because of how the flywheels coming together, I feel great about our ability to deliver against the growth algorithm we discussed last year, about 4% top-line growth, and operating income growth rates higher than sales. International adjusted operating income in constant currency increased nearly 3%, reflecting lower COVID costs, partly offset by gross margin rate decrease related to higher sales penetration from Sam's China and eCommerce. Given the timing of stimulus overlaps, we expect about a 1% to 2% comp sales increase from Walmart U.S. in the first quarter, followed by somewhat higher comp sales growth throughout the remainder of the year. We expect Q1 operating income and EPS to be down low-double digits to low-teens as we cycle the stimulus effects from last year that resulted in nearly 30% operating income growth, as well as increased wages this year. Please proceed with your question. First, I think the advertising business is a reflection of the momentum we have in total Walmart U.S. And I'm really proud of the way the team has helped position us to serve customers any way they want to be served, whether that's at home, in the refrigerator, at their front door, at the curb or in store. Please proceed with your question. Please proceed with your question. Please proceed with your question. But one of the things that's really important in your question is, as we serve really all income groups across all geographies in the U.S. and last year, we saw growth amongst income groups and geographies. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. I think it's clear that we're changing to serve customers and members in the way that they want to be served and having stores and in eCommerce business, pick up, delivery, fulfillment centers and marketplace, all of those things are helpful as it relates to that."
}