{
    "symbol": "SXI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-04 11:21:04",
    "content": " For the third consecutive quarter, we've reported our highest adjusted consolidated operating margin in Standex history, 13.6%, representing a 220 basis point year-on-year increase. In addition, our electronics segment new business opportunity pipeline of $64 million represented a 14% year-on-year increase and is expected to contribute $19 million in sales in fiscal 2022, approximately 25% above the previous year. Specifically on a sequential basis in the fiscal third quarter, we expect revenue to be similar to slightly higher and operating margin to be slightly higher sequentially with a significant overall increase year-on-year compared to fiscal third quarter 2022. At the electronics segment, our record second quarter revenue performance, growing new business pipeline and fiscal third quarter outlook reflects the volume ramp of the previous year's new business opportunity awards, strength in our end markets and product demand complemented by continued market share gains. Operating income grew approximately 72.2% year-on-year to $17.2 million as we effectively leveraged organic sales growth, pricing actions and productivity initiatives, partially offset by increased raw material and freight costs. Laneway sales of $15.7 million increased approximately 14% year-on-year with positive trends in soft trim tools, laser engraving and tool finishing product categories. 10:42 In our fiscal third quarter, we expect sales and operating margin to be similar to the second quarter with an expected decrease in project work in Asia, associated with the Chinese New Year, offset by contributions from projects in Europe and growth in software and sale. Record quarterly revenue of $24.6 million, represented an increase of 37.7% year-on-year with growth in pharmaceutical, clinical laboratories and academic institution markets complemented by strong demand for COVID-19 vaccine storage. Operating income of $5.5 million, increased 29.7% year-on-year, reflecting volume growth and pricing initiatives to partially offset higher freight costs, as well as increased investments to support additional new products development. 13:13 Regarding our outlook for the fiscal third quarter, we expect revenue to be sequentially similar to slightly higher, primarily due to growth in space and medical end markets with a slight to moderate increase in operating margin, reflecting end market strength and productivity initiatives. Sequentially, backlog realizable under a year increased $10.1 million or approximately 29% in the second quarter of fiscal '22, reinforcing the continued recovery in key end markets. 14:39 In regard to our outlook, in fiscal third quarter 2022 we expect a slight to moderate increase in revenue and operating margin sequentially, reflecting positive trends in backlog and end markets. 15:32 In addition, adjusted consolidated operating margin of 13.6% in the quarter represented a 20 basis point sequential increase and 220 basis points increase year-on-year, led by strong operating performance in the electronics and scientific segments. 15:55 In summary, supported by continued strong market demand and active pipeline of new business opportunities and new product development, ongoing focus on price and productivity initiatives and with a year-to-date book-to-bill well in excess of 1, Standex is entering the second half of fiscal 2022 with momentum and expectations for continued improvement in financial performance, both sequentially and year-on-year. On a consolidated basis, total revenue increased 18.8% year-on-year from $156.3 million in the second quarter of 2021 to $185.7 million this quarter. The sales increase was partially offset by the prior divestiture of the Enginetics business, which contributed approximately $2.3 million in revenue in the fiscal second quarter of 2021, as well as a small impact from foreign exchange. 17:06 On a year-on-year basis, our adjusted operating margin increased 220 basis points to 13.6%, reflecting operating leverage associated with revenue growth and readout of price and productivity actions, partially offset by materials inflation and increased freight costs, primarily impacting the scientific and specialty segments."
}