{
    "symbol": "SXI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-06 12:02:14",
    "content": " Electronics backlog, realizable under a year of approximately $151 million at the end of the third quarter, represented a 57% year-on-year and 5% sequential increase. In addition, specialty solutions segment revenue increased approximately 20% year-on-year, with continued positive trends as food service equipment markets returned to pre - Covid’19 levels consolidated adjusted operating margin of 13.8% our fourth consecutive quarter of record margin was 160 basis points increase year-on-year and 20 basis points improvement sequentially. Total company backlog realizable under one year of approximately $267 million at the end of the third quarter represented a 51% increase year-on-year with strength on the electronics, specialty solutions and engraving segments, and a slight increase sequentially. The sequential quoting in decrease, primarily reflects the financial impact of the COVID-19 lockdown in Shanghai, China, which we currently estimate will defer sales of approximately $7 million to $9 million from our electronics segment from the fiscal fourth quarter 2022, into the following quarter. Segment revenue of $80 million increased approximately $15 million or 23% year-on-year, reflecting broad end-market strength across all geographies, including renewable energy, electric transportation, solar, and military aerospace markets. The electronics segment had strong operating leverage with an approximately 24% segment margin, resulting in $19 million in adjusted operating income, or a 56% year-on-year increase. First-year sales from new business opportunities are forecast to be approximately $17 million in fiscal 2020, a 37% increase year-on-year and our NBO funnel has grown to approximately $65 million, and approximately 10% increase year-on-year. Laneway sales of approximately $15 million increased nearly 14% year-on-year due to positive trends and soft trim tools, laser engraving and tool finishing. Have expected scientific revenue of $19 million decreased approximately $5 million year-on-year or 22% reflecting lower demand for COVID-19 vaccine storage, partially offset by sales and pharmaceutical, clinical laboratories and academic institution and markets. Revenue of approximately $21 million increased $1 million or nearly 5% year-on-year, on continued growth in commercial aviation, defense, and medical end-markets. This was partially offset by the absence of the previously divested Enginetics business, which contributed approximately $4 million in revenue to last year's third quarter. Operating income of $3.6 million decreased approximately $600,000 or 15%, reflecting the impact of material inflation and increased freight costs primarily in the hydraulics business, partially offset by volume growth and pricing actions. Order trends were strong with specialty's backlog realizable under a year of $48 million, increasing approximately 170% year-on-year, and 7% sequentially. Adjusted consolidated operating margin of 13.8% in the quarter was another record quarterly result, increasing 160 basis point year-on-year, and 20 basis point sequentially, as we effectively leverage volume growth, price, and ongoing productivity actions. In summary, we are well-positioned for continued profitable growth, and market trends and our new business opportunity pipeline remains strong, and we have an active funnel of activity and pricing actions to effectively address inflationary challenges and manage our supply chain Our new $100 million share repurchase authorization reinforces our substantial financial strength and significant opportunity for further shareholder value creation. On a consolidated basis, total revenue increased 9.9% year-on-year, from $172.2 million in the third quarter of 2021 to $189 million this quarter. The sales increase was partially offset by the prior divestiture of the Enginetics business, which contributed approximately $3.9 million in revenue in third quarter fiscal 2021, as well as a 2.6% impact from foreign exchange. Adjusted earnings-per-share by $1.54 in the quarter of fiscal 2022, compared to $1.19 a year ago, an approximately 29% growth year-on-year. Our net debt for fiscal third quarter of 2022, consisted primarily of long-term debt of $199.7 million and cash and cash equivalents totaling $133.9 million with approximately $100 million held by foreign subs."
}