{
    "symbol": "SXI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-07 01:22:07",
    "content": " Revenue contribution from high-growth markets such as electric vehicles, green energy and the commercialization of space increased to $59 million in fiscal 2022 and approximately 50% increase year-on-year. In fiscal first quarter 2023, we expect revenue and operating margin to be similar to fourth quarter fiscal 2022, but increased year-on-year. Our outlook is supported by backlog realizable in under one year of approximately $256 million at the end of fiscal 2022, representing approximately 22% increase year-on-year. Adjusted operating margin of 22.5% in fiscal fourth quarter 2022 represented a 90 basis point increase year-on-year, primarily due to the impact of price realization and productivity actions. New business opportunities remained strong with first year NBO sales delivering $70 million in fiscal 2022, a 15% increase year-on-year. Operating margin of 16.2% in fiscal fourth quarter 2022 increased 80 basis points year-on-year due to sales growth and the impact of productivity and efficiency initiatives, including progress on our previously announced $2 million in cost-savings actions. In the fiscal first quarter 2023, on a sequential basis, we expect revenue to be similar to end-market demand with a moderate improvement in operating margin due to sales, pricing and productivity initiatives. Fiscal 2022 adjusted operating margin increased 170 basis points year-on-year to 13.7%, our highest in the history of the company, resulting in operating income growth of approximately 28% on a 12% consolidated revenue increase year-on-year. On a consolidated basis, total revenue of $184.7 million increased 4.7% year-on-year, compared to $176.4 million in the fourth quarter of 2021. Adjusted operating margin of 13.9% in the fourth quarter represented an increase of 60 basis points year-on-year and 10 basis points sequentially, reflecting sales growth and the impact of price and productivity actions. Adjusted earnings per share were $1.54 in the fourth quarter of fiscal 2022, compared to $1.40 a year ago, approximately 10% growth year-on-year. As a result, Standex generated free cash flow of $18.8 million in fiscal fourth quarter 2022, compared to free cash flow of approximately $26.4 million in fiscal fourth quarter 2021. We continue to execute on our cash repatriation program with approximately $10 million repatriated from foreign subs in the fourth quarter and nearly $31 million in fiscal 2022, bringing our three year total to $108 million."
}