{
    "symbol": "SXI",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-05 12:39:02",
    "content": " Revenue and consolidated adjusted operating margin increased significantly year-on-year in fiscal first quarter 2022, as we leveraged positive demand trends and converted new business opportunities from our pipeline. Electronics revenue increased approximately 37% year-on-year, primarily due to a broad based geographical recovery with continued solid demand for relays in renewable energy and electric vehicle applications, along with positive trends in transportation, appliance, test and measurement and distribution end markets. Revenue increased approximately $20.6 million or 37.2% year-on-year, including 36.1% organic growth, reflecting continued broad based geographic and end market strength as well over 1.1% positive contribution from foreign exchange. Operating income increased approximately $9.1 million or 100.2% year-on-year due to operating leverage associated with revenue growth and productivity initiatives, partially offset by increased raw material and freight costs. Looking ahead, we have a very active new business opportunity funnel of approximately $61 million, which is expected to deliver first year sales of $19 million with positive trends across all major geographic areas and business units and are well positioned to further capture additional customer business. Electronics backlog realizable under a year sequentially increased approximately $13 million, or 11% in fiscal first quarter '22. Year-on-year revenue decreased approximately $1.2 million or 3.4% and operating income was nearly $1 million lower or a 17% decrease due to the timing of projects and geographic mix, partially offset by productivity actions. Sequentially, backlog realizable under a year increased $5.9 million, or approximately 44% in fiscal first quarter '22. Revenue increased approximately $4.9 million or 29.2% year-on-year, reflecting positive trends at pharmaceutical channels, clinical laboratories and academic institutions. Operating income increased approximately $0.4 million or 10.6% year-on-year due to volume growth and pricing initiatives, balanced with investments to support future growth opportunities and higher freight costs. Sequentially, backlog realizable under a year increased $1.6 million, or approximately 27% in fiscal first quarter in fiscal '22. In fiscal second quarter '22, we expect Scientific revenue and operating margin to be similar to our first quarter, reflecting continued demand for vaccine storage, accompanied by the return of demand from traditional end segments and pricing actions partially offset by increased freight costs. Operating income increased approximately $0.4 million representing a 91.7% increase year-on-year, reflecting product mix and ongoing productivity initiatives offset by $1.1 million one-time project-related charge. On a year-on-year basis, Specialty Solutions revenue increased approximately $0.2 million or slightly under 1% and the operating income decreased $1.1 million or 27.9%. We have a very strong backlog position realizable under a year, which sequentially increased $8.7 million or approximately 33% in the first quarter. From a margin standpoint, adjusted consolidated operating margin of 13.4% increased both sequentially and year-on-year and represented our second consecutive quarter of highest margin in Standex’s history. On a consolidated basis, total revenue increased 16.1% year-on-year from $151.3 million in fiscal first quarter 2021 to $175.6 million this quarter."
}