{
    "symbol": "VFC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-28 13:48:07",
    "content": " Looking ahead, following the strong holiday outperformance at TNF, we are raising our full year 2022 outlook to growth of 29% to 30%, representing 18% to 19% growth relative to fiscal ‘20. Moving to Dickies which grew 14% versus fiscal ‘20 levels driven by continued strength in the Americas, elevated sell-through and strong demand signals indicated the brand’s evolving integrated marketplace segmentation is delivering as planned and the brand continues to see growth from both the workwear and work-inspired segments. Including Supreme, operating margin was 17.7% in Q3, representing modest expansion relative to pre-pandemic levels while increasing organic strategic investment by 12% versus fiscal ‘20, a strong achievement overcoming meaningful headwinds from the disruptive supply chain and the drag from weaker near-term store productivity. We delivered EPS of $1.35 in Q3, representing 45% earnings growth relative to last year or high single-digit organic EPS growth relative to strong pre pandemic levels, a significant recovery in a challenging environment and a testament to our robust operating model. Your line is now live. And I think it’s as we’ve anticipated really all through the last several quarters, we expect a sequential improvement for a number of reasons as consumers continue to come back in stores as we get a little bit better positioned from an inventory standpoint and, obviously, as the work that we’ve been doing around demand creation begins to – begins the impact. Certainly, as we – I think full transparency, and as Steve alluded to in his prepared remarks, there is some challenges relative to the Classics, the core Classics part of the business, that we’d like to see that moving a little faster and some of the brand heat behind that. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. So – let me start with the second part of your question in the – in terms of the shape of next year, I would suggest that just think – it’s a little bit tricky probably because you got COVID impacting this year and you got supply disruptions and you got timing of shipments and all that. Your line is now live."
}