{
    "symbol": "WPC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 14:23:06",
    "content": " As a result, I am pleased to say we executed investments at meaningfully higher cap rates during the fourth quarter, although on investment volume that was lighter than we anticipated, totaling $159 million. This morning, we reported AFFO per share of $1.29 for the fourth quarter, bringing full year AFFO per share to $5.29 and real estate AFFO per share to $5.20, an increase of 6.3% over the prior year, reflecting the accretive impact of both new investments and our merger with CPA:18, which closed in August as well as the strength of our rent growth. Other lease-related income for the fourth quarter included the $5 million settlement of a claim on the guarantor of a prior lease the timing of which was accelerated, bringing the full year total for this line item to $33 million, just above our expectations for the year. Disposition activity during the fourth quarter comprised 6 properties for gross proceeds of $68 million, bringing total disposition proceeds for the year to $244 million, a large portion of which were legacy CPA:18 assets whose disposition was contemplated in conjunction with the transaction. For 2023, we expect NOI from all operating properties to total around $100 million, with roughly three quarters of that coming from self-storage, which is expected to achieve NOI growth in the mid to high single-digits as compared to 2022. Turning now to expenses, interest expense totaled $68 million for the fourth quarter bringing the full year total to $219 million, up 11% over the prior year. For 2023, we currently expect non-reimbursed property expenses to decline to between $43 million and $47 million for the full year as a result of anticipated vacant asset sales and lease up. We ended 2022 with $276 million drawn on our $1.8 billion revolving credit facility, which, in conjunction with our undrawn equity forwards, maintains an excellent liquidity position, totaling just over $2.2 billion, providing ample liquidity to execute on our near-term pipeline on a leverage-neutral basis and ensuring we continue to have significant flexibility in when we access capital markets. We currently have $430 million of mortgages due in 2023, a portion of which will be retired as part of our disposition plans and no bonds maturing until 2024, all of which we continue to view as very manageable, especially given the improving debt capital markets and our proven ability to access capital even during turbulent markets as was the case in 2022."
}