{
    "symbol": "NYT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 13:41:06",
    "content": " That strategy is grounded in three pillars: first, to build on our leadership in news to be the best news destination in the world; second, to be more valuable to more people by helping them make the most of their lives and passions; and third, to put those two things together in a more expansive and connected product experience or bundle that makes The Times even more indispensable to the daily lives of millions more people. We had 180,000 net digital subscriber additions in the quarter, which represents an approximately 70% improvement over the second quarter of 2021, driven by the bundle, Games, and The Athletic. Adjusted operating profit in the New York Times Group was approximately $89 million in the quarter, lower by approximately $4 million compared to the prior year, while The Athletic loss of approximately $12.5 million. As Meredith mentioned, we began giving our bundle subscribers access to The Athletic late in the second quarter, and as a result, the disclosed number of subscribers with entitlements to The Athletic grew by approximately 420,000 in addition to the approximately 50,000 stand-alone athletic net subscriber additions. Total advertising revenues increased approximately 4% in the quarter with digital advertising declining 2.4%, which was driven by a number of factors, including the impact of the challenging macroeconomic environment, a reduction in marketer spend on advertising adjacent to news coverage and supply constraints in programmatic advertising related to choices we made to drive more audience to our apps. For The New York Times Group, total subscription revenues are expected to increase 5% to 7% compared with the third quarter of 2021, with digital-only subscription revenue expected to increase 10% to 14%. Adjusted operating costs are expected to increase in the mid-single digits compared with the third quarter of 2021, with cost growth for The New York Times Group expected to slow considerably in the second half of 2022. Iâ\u0080\u0099ll say two more things, just Iâ\u0080\u0099m not 100% sure what youâ\u0080\u0099re getting at, but Iâ\u0080\u0099ll say two more things that the performance in the quarter overall was meaningfully better from a subscriber standpoint than the second quarter of last year. Going off of what Doug was asking on the subscribers with news net adds, which I think increased 40,000 this quarter compared to 80,000 in the year-ago quarter sequentially despite what I figured it would have been a relatively strong news cycle. And Iâ\u0080\u0099ll just add to that, to us, the most important driver of churn is or of retention of not churning is subscriber engagement, and weâ\u0080\u0099re making a point to say, subscriber engagement in the second quarter was relatively strong, and that is broadly across the portfolio and for news."
}