{
    "symbol": "NYT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 13:52:04",
    "content": " As a result of the efforts I've just described, The Times crossed an important milestone in the quarter: We now have more than 1 million bundle subscribers â\u0080\u0093 discernable momentum on a key element of our strategy to drive revenue, profit, and shareholder value. We reported adjusted operating profit of $69 million, higher than the same period in 2021 by approximately $4 million, as growth in profit at The New York Times Group was partially offset by losses at The Athletic, which were slightly less than we expected in our acquisition plan. Adjusted operating profit at The New York Times Group was approximately $79 million in the quarter, higher by approximately $13 million compared to the prior year, while The Athletic lost approximately $9.5 million. On a consolidated basis, the company added 180,000 net new digital-only subscribers and 210,000 net new digital-only subscriptions in the quarter, with continued strong growth in adoption of our bundled product. Digital-only subscription revenue grew primarily as a result of the large number of subscribers whose introductory promotional subscriptions graduated to higher prices, the new subscriptions we have added in the past year, and the inclusion of subscription revenue from Athletic stand-alone subscriptions. It's worth noting that we began enabling access to The Athletic product for our digital bundle subscribers late in the second quarter, which we believe increases the value of the bundle for both potential and existing subscribers. To account for this value, as noted in our second quarter 10-Q, we are allocating a portion of digital subscription bundle revenue from The New York Times Group to The Athletic, resulting in a reduction in the amount of revenue recorded at The New York Times Group. Adjusted operating costs were higher in the quarter by nearly 8% as compared with 2021 due to the addition of costs associated with The Athletic, while costs at The New York Times Group were flat. For The New York Times Group, total subscription revenues are expected to increase 10% to 13% compared with the fourth quarter of 2021, with digital-only subscription revenue expected to increase approximately 20%. Both overall and digital advertising revenues are expected to be lower by approximately 10% compared with the fourth quarter of 2021, which was our largest digital quarter ever, mainly due to macroeconomic conditions, on top of challenging comparisons to last year, especially in the technology category. And I'll say on the bundle, something that's been very pleasing as we continue â\u0080\u0093 obviously, we're driving more people to the bundle and all the ways we've described so far, but we're continuing to see bundle subscribers engage 10% to 20% better than news subscribers."
}