{
    "symbol": "TLRY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-07 14:34:06",
    "content": " Our first quarter results reflect early tangible returns on what we discussed at length during our fiscal 2022 report, namely realigning the business around three priorities: pursuing our most profitable core business across Canada, Europe and the U.S.; optimizing our global operations, while taking out over $100 million in cash cost savings; and strengthening our industry-leading balance sheet that affords us the stake opportunities for growth and expansion amid market challenges. Alongside the Aphria and Tilray synergies, we launched an additional $30 million of cost optimization plan for existing cannabis business in Q4 of last year, and to further solidify our status as the industry leading low cost producer. And finally, with the strength of our balance sheet with approximately $500 million in cash, $638 million in working capital, and over 70% of our debt set with fixed interest rates, Tilray Brands is now in the best position to capture leading market share across the global cannabis industry where opportunity abounds. On a constant currency basis, our net revenue remained relatively flat at $166.5 million, with all of our distribution, international cannabis and beverage alcohol businesses being up in their base currencies compared to the prior year quarter. Gross cannabis revenue consisted of $6.5 million in Canadian medical cannabis revenue, $58.4 million in Canadian adult-use revenue, $10.4 million in international cannabis revenue, which is a 2% growth from the prior year quarter of $10.2 million, and $17.1 million of excise tax, all for net cannabis revenue of $58.6 million. International cannabis revenue increased 2% to $10.4 million from $10.2 million for the prior year same period, but would have increased 16% and to $11.9 million on a constant currency basis, despite ongoing global conflicts as well as the overall economy in Europe. In terms of profitability and margins, cannabis gross profit decreased 2% and to $29.7 million in Q1 from $30.3 million in the prior year quarter, while the gross margin percentage increased 8% to 51% for the quarter. When normalized to remove the $7.8 million of HEXO revenue, gross margin was flat at 43%, despite the significant price compression experienced over the last year, a reflection of our status as a low-cost producer, along with our synergistic initiatives and focus on higher-margin sales. Q1 revenue for our distribution business, which is overwhelmingly CC Pharma, was $60.6 million, a 10% decline from the $67.2 million in the prior year quarter, impacted by the strengthening of the U.S. dollar relative to the euro compared to the same period last year. Adjusted distribution gross profit decreased to $5.6 million in Q1 from $7.9 million in the prior year quarter, while distribution gross margin declined to 9% from 12%. Adjusted wellness gross profit decreased 13% to $3.5 million in Q1 from $4 million in the prior year quarter, while gross margin decreased only slightly to 26% from 27%, but decreased from 31% in the previous quarter. For fiscal 2023, we are reiterating our expectations of generating $70 million to $80 million of adjusted EBITDA, and as I just mentioned, to be free cash flow positive across all business segments for the year. So, Canada for us from a recreational, from a medical, from a Cannabis 2.0 and Cannabis 3.0, we think we said there's an $800 million business with also $200 million in the consumer area to grow there."
}