{
    "symbol": "TLRY",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-09 14:00:04",
    "content": " $52.4 million in Canadian adult-use revenue, which marks 5.7% growth from the prior year quarter, $7.7 million in international cannabis revenue all offset by $16.8 million of excise tax. For fiscal 2023, we are reaffirming our expectations of generating $70 million to $80 million of adjusted EBITDA and being free cash flow positive across all business segments for the year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. It's still a big market and it prepares a lot for when legalization does happen in the U.S. And just to step back, you only asked me about Canada, as you see in our headlines today, is we don't rate and house anywhere in the near future, legalization happening in the U.S. We very much like beer and spirits business with great margins in those businesses. Please proceed with your question. Please proceed with your question. Please proceed with your question. So that's what I'm saying, and there's lots of things that we're looking at to do with these facilities, but growing cannabis is first and foremost for us and growing branded cannabis is first and foremost for us, being in diversified businesses, whether it's spirits, beer or other wellness products is what's our priorities. Please proceed with your question. But right now, our focus is to diversify our business grow where we have strong, strong cannabis opportunities in Canada where we have strong opportunities in Europe and grow our consumer packaged goods business because one day, you will see beer with THC and in the U.S., one day, you'll see spirits with THC in the U.S. And if anything, where is the cannibalization going to come from, it will come from the spirits businesses. Please proceed with your question. We've got to focus on Europe today and change some of our strategy in Europe, which we're doing upon legalization, but focus on that medical business, but there's a whole third market out there where they're using cannabis as recreational, but buying it from the medical market and really focus on integrating now our CC Pharma business from a distribution standpoint. Please proceed with your question."
}