{
    "symbol": "TTI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 16:33:05",
    "content": " Adjusted EBITDA of $18.7 million decreased $1.8 million sequentially and was negatively impacted by $2 million of charges, which included $1.3 million unfavorable impact because of the aforementioned European supplier declaring force majeure as a result of the Russia/Ukraine conflict and the second quarter unrealized mark-to-market losses on investments of $700,000, net of gains on investments. Excluding the impact from the supplier force majeure and mark-to-market losses, EBITDA for the second quarter of 2022 would have been $20.7 million. As previously announced in the third quarter of last year, we completed a preliminary technical assessment by an independent geological consulting firm to assess lithium and bromine exploration targets on all of the company's approximately 31,100 net acres of brine leases in the Smackover formation in Southwest Arkansas. The second quarter revenue for our U.S. land business was the highest since the third quarter of 2019, despite active frac crew and U.S. rig count 22% and 16% lower, respectively, during the second quarter of 2022 compared to the third quarter of 2019. With adjusted EBITDA margins of 15.1% in the second quarter, we achieved our full year target earlier than expected as our technology integration and digital investments continue to gain traction, while price increases continue to modestly stay ahead of inflation, which is still very significant for fuel, labor and equipment. In the Permian alone, we recycled 571 million gallons in the second quarter, up 62% from a year ago and up 17% from the first quarter of 2022. Completion Fluids & Products second quarter revenue increased 2% sequentially and from the first quarter -- from the first quarter of 2022 as the seasonal increase from our Northern Europe Industrial Chemicals business, albeit lower than normal due to the Russia/Ukraine complex, was partially offset by lower activity in the Gulf of Mexico in international markets, as we previously reported that some fluid sales from these markets were pulled forward into the first quarter. As we look towards the third quarter of 2022, based on new customer awards and activity increases, we expect to see further growth and margin expansion for our Water & Flowback segment despite 40-year high inflationary pressures. The second quarter of this year included a $4.9 million charge of nonrecurring items for the first quarter included a benefit of $164,000 of nonrecurring credits net of expenses. The second quarter included mark-to-market losses of $700,000 from our equity holdings in CSI Compressco and Standard Lithium, partially offset by a non-realized valuation gain on our convertible loan investment in CarbonFree. If you compare the first quarter to the second quarter, focused on our EBITDA performance without the impact of these mark-to-market gains in the first quarter and mark-to-market losses in the second quarter, both quarters were adjusted EBITDA of $19.4 million. And keep in mind that the first quarter included several significant offshore fluid shipments that moved up in the second quarter, and the second quarter also included a negative impact of $1.3 million at our Northern Europe industrial chemical operations as a result of the supplier declaring force majeure that Brady mentioned. Second quarter cash from operating activities was $17.9 million, an improvement of $12 million from the first quarter. Free cash flow or cash from operating activities less capital expenditures was $6.3 million in the second quarter, an improvement of $9.3 million from the first quarter. Liquidity at the end of the second quarter was $103 million, an improvement of $8 million from the first quarter and was the highest it has been since 2019. So when we're looking at the fluids business, we're thinking about the normal -- I mean, normally from the second quarter to the third quarter, you lose some of the European business, and then there's some other pluses and minuses. So the second quarter without the mark-to-market gain or losses that we had turned out to be $24.8 million and the -- I'm sorry, 24.8%. And the second quarter, if you annualize it, we're already at a $10 million per year EBITDA -- in a $40 million per year EBITDA run rate based on $10 million in the second quarter."
}