{
    "symbol": "TTI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 16:16:06",
    "content": " Shifting to our Water and Flowback segment revenues of $81 million grew 52% year-on-year and 7% quarter-on-quarter, and a flat the slightly down active frac fleet market in the fourth quarter, somewhat due to year end weather. Accounts receivable increased by $24 million from the end of the third quarter to the end of the fourth quarter, reflecting the strong ramp up in activity by the end of the quarter, driven by some large fluid sales in December that Brady previously mentioned. We're currently holding 400,000 shares of standard lithium, with a market value of approximately $1.7 million based on yesterday's closing price. The field study we completed with the engineering firm estimated that the cost of the wealth resource of brine, inject a leftover or the tail brine build the pipelines and construct the brine to bromine processing facility could be approximately $280 million inclusive of $35 million of contingencies and inclusive of about an estimated $20 million of work to allow us to upsize the facility in the future for potential higher volumes of bromine processing. The issue really for  longer term is the ramp up and energy storage, if our customers are successful, as you noted in ramping up the demand levels were pretty dramatically exceed our current supply agreement for bromine, which is one of the reasons why we're looking so carefully at our Arkansas project and the timing of that Arkansas project as it relates to the success, potential success of our Pureflow customers because if they are successful based on the demand opportunities that are there, it will have a meaningful impact to the bromine market. But then when the market can remain strong, there's always a little bit more lumpiness in larger projects that come and go and the completion fluid side, but we feel extremely well positioned to take advantage of this market as we go through the full year of 2023."
}