{
    "symbol": "AEIS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 15:59:02",
    "content": " For the full year, we achieved record revenue of $1.85 billion and record earnings per share of $6.49, thanks to robust demand across all of our markets and improved execution across the company. In semiconductor, the fourth quarter revenue increased 30% year-on-year to $232 million, in line with our expectations. In the industrial and medical markets, fourth quarter revenue grew more than 20% year-on-year to $119 million. Fourth quarter revenue from data center computing customers totaled $95 million, a new record for the company. As we further resolve critical part issues, we expect to work down our total backlog over the next several quarters to a more normalized level of $400 million to $500 million. Revenue in the industrial and medical market was $119 million, up 21% year-over-year and flat with last quarter's record level. Data center computing revenue was up 18% year-over-year and 8% sequentially to $95 million, a new quarterly record. Although we began to see some moderation in premiums and recoveries towards the end of the quarter, we expect higher material costs to continue to impact our gross margin through the first half of 2023, with gross margins gradually improving in the second half of the year as premiums abate and historical costs flow through our inventory. As a result, we expect first quarter revenue to be approximately $415 million, plus or minus $20 million. Please proceed with your question. Please proceed with your question. So if you look outside of semi, our backlog was about flat from last quarter, reflecting really stronger demand across those markets and continues to represent an opportunity for us to bring that more in line and either buffer lower demand if that happens in the future or deliver some upside if we can get additional parts as we go forward. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}