{
    "symbol": "WY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 14:34:05",
    "content": " This was largely driven by lower sales volumes in the West, resulting from -- stoppage late in the quarter as well as lower average realizations in the West, partly due to less export volume being shipped in the quarter. Despite lower lumber pricing, log markets remained fairly stable in the third quarter as log demand was steady and log supply in certain areas was somewhat constrained by harvest and haul capacity. Japanese log sales volumes decreased significantly compared to the second quarter due to the timing of shipments, combined with the reduction in log export activity resulting from the work stoppage. Average sales realizations for our China export logs decreased moderately compared to the second quarter, and sales volumes were significantly lower as we continue to intentionally shift volume to the domestic market to capture better margin opportunities. Despite adequate log supply and softening finished product pricing, Southern sawlog and fiber markets remained stable for the majority of the third quarter as mills maintain steady demand to mitigate risks from ongoing supply chain challenges. In the North, adjusted EBITDA increased slightly compared to the second quarter due to significantly higher sales volumes resulting from the seasonal increase in harvest activity that is typical in the third quarter. Third quarter adjusted EBITDA was comparable to the year ago quarter, but $47 million lower than the second quarter, primarily due to a reduction in real estate acres sold partially offset by an increase in royalty income from our Energy and Natural Resources business. Third quarter adjusted EBITDA was $517 million lower than the second quarter, largely driven by the decrease in lumber and OSB pricing during the quarter. In distribution, adjusted EBITDA decreased by $7 million compared to the second quarter, largely driven by lower sales volumes for EWP and Specialty Products. Our fee harvest and domestic sales volumes are expected to be lower in the fourth quarter largely driven by impacts of the work stoppage, and we now anticipate our full year harvest volumes in the West to be slightly lower than 2021. For our Wood Products segment, we expect fourth quarter earnings and adjusted EBITDA will be lower than the third quarter, excluding the effects of changes in average sales realizations for lumber and oriented strand board. For our lumber business, we expect significantly lower log costs in the fourth quarter, partially offset by lower sales volumes resulting from the work stoppage in our Western mills in October, and we anticipate comparable unit manufacturing costs. For our oriented strand board business, we expect slightly higher sales volumes and significantly lower unit manufacturing costs, primarily due to less downtime for planned annual maintenance during the fourth quarter. For our distribution business, we are expecting adjusted EBITDA to be lower than the third quarter due to lower sales volumes and realizations for most products. Looking ahead to the fourth quarter, we expect Western Timberlands EBITDA will decrease by approximately $50 million from the third quarter, with approximately half of that decrease attributable to deferred volume from the work stoppage and the other half due to expected lower average sales realizations during the quarter due to general market conditions. For Wood Products, the work stoppage lowered production volumes by approximately 60 million board feet in the third quarter, and we expect around 170 million board feet of impact in the fourth quarter. Given the more rapid pace of price erosion in lumber versus logs in the West, which compresses margins until log prices adjust accordingly, the last lumber production in September and October hasn't had a material impact on EBITDA in the third or fourth quarters."
}