{
    "symbol": "WY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 11:33:09",
    "content": " Western domestic log markets were favorable through the first quarter, driven by strong demand as mills sought to capitalize on unseasonably high lumber prices. Notwithstanding ample log supply and improving log inventories as the quarter progressed, Southern sawlog markets remained favorable in the first quarter as mills sought to benefit from the strong lumber and panel pricing environment. In the North, adjusted EBITDA increased by $1 million compared to the fourth quarter due to improved sales realizations across all products. Adjusted EBITDA for our lumber business increased by $453 million, compared to the fourth quarter, a 232% improvement. Engineered Wood Products adjusted EBITDA increased by $22 million compared to the fourth quarter, surpassing last quarter's record by 19%. In Distribution, adjusted EBITDA increased by $32 million compared to the fourth quarter, an 80% improvement, as the business experienced strong demand and captured improved margins across all products. In our Timberlands business, we expect second quarter earnings before special items and adjusted EBITDA will be significantly lower than the first quarter but still higher than any other quarter since the fourth quarter of 2018. In the North, due to product mix, sales realizations are expected to be significantly higher than the first quarter, while fee harvest volumes are expected to be significantly lower as we enter the spring breakup season. For our Wood Products segment, we expect second quarter earnings and adjusted EBITDA will be higher than the first quarter, excluding the effect of changes in average sales realizations for lumber and OSB. For our OSB business, we expect moderately higher sales volumes compared to the first quarter, resulting from higher production volumes and improving transportation networks, primarily in Canada. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}