{
    "symbol": "WY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 14:10:06",
    "content": " Log demand from our China customers was solid in the fourth quarter, and our export sales volumes increased significantly compared to the lower levels in the third quarter, when we intentionally kept more volume in the domestic market to capture higher margin opportunities. In Distribution, adjusted EBITDA decreased by $18 million compared to the third quarter, largely driven by lower sales volumes, primarily for EWP products. Our fee harvest and domestic sales volumes are expected to be significantly higher in the first quarter as we have returned to full run rate operations following the work stoppage, which affected one month of operations in the fourth quarter. We expect to significantly increase our export sales volumes to both markets compared to the fourth quarter, which was affected by one month of reduced export activity resulting from our work stoppage, but we also expect to shift additional volume to China to take advantage of higher-margin opportunities. That said, our export sales realizations are expected to be slightly lower in the first quarter as broader log markets continue to soften, resulting from the headwinds Devin previously mentioned. First quarter earnings before special items are expected to be approximately $10 million higher than the fourth quarter, while adjusted EBITDA is expected to be approximately $35 million higher, primarily due to the timing and mix of real estate sales. Excluding the effect of changes in average sales realizations for Lumber and OSB, we expect first quarter earnings and adjusted EBITDA will be moderately higher compared to the fourth quarter. For lumber, we expect higher production and sales volumes in the first quarter and significantly lower unit manufacturing costs as we resumed operations in our Northwest mills following the work stoppage in the fourth quarter. So, just a lot of interest there. So, just a lot of interest there."
}