{
    "symbol": "MGIC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 12:30:04",
    "content": " During the year, we continued to make big strides across multiple fronts of our business, which is reflected by our record-breaking results exceeding $500 million in revenues for the first time and with double-digit growth recorded across all of our key financial indices for the year, revenues, gross profit, operating income, EBITDA, net income and dividends distributed to our shareholders. This quarter, Magic delivered its strongest fourth quarter top line and bottom line results, with revenues increasing by 10.6% year-over-year to approximately $147.1 million, exceeding market expectations and non-GAAP net income increasing by 9.9% year-over-year to a fourth quarter record-breaking result of $13.9 million. Growth in Q4 was mainly driven by our North American operations, growing in double digits, accompanied by a strong pipeline, offsetting the negative impact of the Jewish New Year holiday season, which this year resulted in a decrease of approximately 6.5 billable working days equivalent to approximately $2.8 million in our Israeli market operations compared to the same period last year and 4 billable working days equivalent to approximately $1.2 million compared to the third quarter of 2022. On a constant currency basis, revenues for the fourth quarter of 2022 would have increased by 16.5% year-over-year to $155 million with 69.6%, reflecting organic growth. Our revenues in North America reached a record high of $84.9 million, up 20% compared to $70.6 million in the same period last year with 12% organic growth year-over-year. Despite the significant currency headwind and the negative impact of the Jewish holiday season, we were able to deliver growth in our gross profit, as well as in our gross margin as our non-GAAP gross profit for the fourth quarter of 2022 reached $43.2 million, up approximately 11.5% compared to $38.7 million in the fourth quarter of last year. In accordance with our dividend distribution policy, our Board of Directors has declared a semi-annual cash dividend in an amount of $0.30 per share and in an aggregate amount of approximately $14.7 million, which together with the dividend distributed for the first half of 2022 in an amount of approximately $42.2 million reflects 71% of the company's net income attributable to its shareholders for the year."
}