{
    "symbol": "MGIC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 15:05:04",
    "content": " Revenues for the second quarter reached all-time second quarter high of approximately $137 million, reflecting a 15% increase compared to the same period last year. And despite the impact of the Jewish holiday season of Passover, which this year resulted in a decrease of approximately two billable working days equivalent to approximately $1.5 million in revenues compared to the same period last year and four billable working days equivalent to approximately $3 million of revenues compared to the first quarter of 2022.Magic Software is a global company operating across multiple markets and offering broad IT services portfolio. Our revenues in North America reached $73.3 million, up 14.6% compared to $63.9 million in the same period of the previous year, accounting for 52% of our growth in the same quarter, all organic growth. Revenue in Israel reached $51.4 million, up 18% compared to $43.6 million in the same period last year, accounting for approximately 43% of our growth in the second quarter. And our amount of gross profit for the second quarter of 2022 reached $38.2 million, up approximately 11% compared to $34.4 million in the second quarter of last year. On a constant currency basis, gross profit would have increased by approximately 15% compared to the second quarter of last year to approximately $39.6 million. Our operating - non-GAAP operating income for the second quarter of 2022 increased by 10.3% to $17.6 million compared to $15.9 million in the same period of last year and $18.9 million in the first quarter of 2022. Given our solid backlog and our strong pipeline and taking into consideration the negative impact of the strengthening of the U.S. dollar mainly versus the new Israeli Shekel in euro, we are revising for the second time this year, our 2022 annual revenue guidance to a new range of $545 million to $555 million from a lower range of $540 to $550 million, reflecting annual growth of 13.5% to 14.5% year-over-year."
}