{
    "symbol": "MGIC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 13:38:01",
    "content": " Magic delivered its strongest topline and bottom line quarterly results with revenue increasing by 19% year-over-year to approximately $144 million, exceeding market expectations and net income increasing by 14.9% year-over-year to approximately $13.5 million. On a constant currency basis, revenues for the third quarter of 2022 would have increased by 23% compared to the same period last year with 19% reflecting organic growth. On a constant currency basis, operating income for the third quarter of 2022 would have increased by 19% to a third quarter record breaking result of $19.3 million with 15.4% reflecting organic growth. Our revenue in North America reached a record high of $79 million, up 20% compared to $66 million in the same period of the previous year accounting for 56% of our growth in the third quarter with 13% organic growth. Revenue in Israel also reached an all-time high of $53.4 million, up 22% compared to $43.8 million in the same period last year accounting for approximately 42% of our growth in the third quarter. On a sequential basis, revenues in Israel increased by 4%, approximately $2 million from $51.4 million recorded in the second quarter of 2022. Despite the significant currency headwind, we were able to deliver a growth in our gross profit as our non-GAAP gross profit for the third quarter of 2022 reached $40.5 million, up approximately 18.5% compared to $34.2 million in the third quarter of last year. On a constant currency basis, gross profit would have increased by approximately 20.2% compared to the third quarter of last year to approximately $41.1 million. Our non-GAAP operating income for the third quarter of 2022 increased by 14.4% to $18.5 million compared to $16.2 million in the same period last year and $17.6 million in the second quarter of 2022. These negative factors reduced our overall billable working days in the fourth quarter compared to the third quarter by 6.5 days, which are equivalent to approximately $5 million or 3.5% of our revenues."
}