{
    "symbol": "CIR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 11:44:04",
    "content": " Turning to Slide 6, our results underscore continued success in executing on our strategic priorities, which include: first, organic growth through new product development and leverage of our strong aftermarket position; second, margin expansion, which includes value pricing, simplification, best cost country sourcing in manufacturing and factory modernization; and third, reducing our leverage, which we accomplished in Q4 through strong cash generation from operations and adjusted EBITDA growth. Turning to our fourth quarter and full year highlights on Slide 7, organic orders increased 19% versus prior year, driven by growth in our Industrial segment. For the full year, Industrial orders were up 7% organically, driven by pricing, strength in our aftermarket and downstream, which more than offset the exit of the pipeline engineering business and timing of a large Navy order in the prior year. For the full year, A&D orders were up 24% organically driven by commercial aerospace recovery, aftermarket, new products for missiles and hydrogen applications, medical and pricing. As we continue to find success with value pricing, OpEx optimization and aftermarket growth, and further supported by improvements in factory performance, we expect to deliver industrial AOI margins of 18% to 20% within the next 3 to 5 years. With record backlog of $543 million exiting the fourth quarter, we expect full year organic revenue growth of 3% at the midpoint of our range. Supported by pricing, cost optimization and growth initiatives, we expect Q1 2023 adjusted operating income of $17.5 million to $19 million, an increase of 75% at the midpoint. In Commercial Aerospace, we expect mid-double-digit orders growth, primarily driven by the continued market recovery for the single-aisle platforms at Airbus and Boeing, as well as the increased activity in aftermarket supported by pricing and the rebound in air travel."
}