{
    "symbol": "JOUT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-04 14:10:07",
    "content": " Today's call will be led by Helen Johnson-Leipold, Johnson Outdoor's Chairman and Chief Executive Officer. Also on the call is David Johnson, Vice President and Chief Financial Officer. If you need a copy of today's news release, it is available on our website at www.johnsonoutdoors.com under Investor Relations. Actual events may differ materially from those statements due to a number of factors, many beyond Johnson Outdoors' control. If you have additional questions following the call, please contact Dave Johnson or Pat Penman. Operating profit of $13.8 million was down versus $23.6million in the prior year, first quarter. As we continue to monitor the inflationary environment, we've been taking price increases for our products where appropriate. I think it's valuable to note that compared to the pre-pandemic December 2019 quarter, our net sales are 20% higher and our profits more than doubled. Overall, we are seeing continued strong demand for our products as people continue to be eager to recreate outdoors, while the ongoing global supply chain environment and uncertainties associated with the pandemic continued to be challenging and unpredictable. In Fishing our largest business demand across all product lines remained strong while managing supply chain issues and component delays continue to be critical to helping us fill orders as anglers look to Johnson Outdoors for the best fishing experiences possible. In our Humminbird brand, our most recent innovation, the award-winning MEGA Live Imaging delivers the clarity and detail of MEGA Imaging in live action, allowing anglers to see fish and the structure in real-time, even watching fish onscreen as they move into strike an angler's lure. With the release of MEGA Live access to the most complete package of industry-leading technologies and products offered in our One Boat Network platform, which enables our Humminbird fish finders and Minn Kota motors to work together in unison, giving anglers an effortless command of their boat. Also ending quarter, and the award winning Raptor Shallow Water Anchor continues to do well in its second year on the market. The Raptor has two industry first technologies, Auto Bottom Mode, which detects bottom density to determine the right anchoring force, and Active Anchoring, which continuously monitors anchoring force and adjust automatically for stable bottom pinning. And the trolling motors with a strong heritage of innovation, quality, and durability, Minn Kota is the industry leader. In Watercraft Recreation, growth in our Fishing Kayak segment continues as we've outpaced the strong market with the ongoing enthusiasm for our innovative Sportsman line that is starting its third year out in the market. We are constantly looking for ways to integrate our product in the popular Sportsman Autopilot 136 leverages the game-changing Spot Lock technology from our sister brand, Minn Kota, to hold position while anglers fish. Demand for Eureka cans and stove continues to be strong, and in Jetboil consumers continue to be excited about the superlight Stash stove that is entering its second year on the market. Reducing weight, and the trail is critical for backpacking and the Stash is the lightest all-in-one backpacking stove system that Jetboil the technology leader in portable outdoor cooking systems, has ever made. Finally, in our Diving businesses, we thought dive market it's primarily in the U.S. and other regions in the world experienced some recovery. In summary, we are encouraged by the continued strong demand for outdoor recreation products, and the team remains focused on working hard to meet demand. Our company purpose, which is to inspire people to get out there to experience and value the great outdoors for generations to come, continues to guide everything we do, and we remain committed to investing in our key strategic drivers, which are understanding our consumers, sustaining innovation leadership, identifying new sources and paths of growth in our markets, and continually optimizing our digital consumer experience. As Helen mentioned, the main remains strong, but like many companies, we continue to base ongoing disruptions in our supply chain there must be managed on a daily basis. For example, we continue to maintain higher than normal inventory levels and we're also working closely with all of our vendors and planning for ultimate sources of supply for critical components where feasible. We'll continue to monitor the inflationary environment, and we'll take pricing adjustments as appropriate. Gross margin of 39.5% is down 5.8 points from last year's first quarter, and continues to be pressured due to cost increases. Operating expenses decreased $4.6 million versus the prior year, primarily due to lower sales volume driven expenses. Net income for the quarter was $10.9 million, down 45% from the prior-year quarter. We're seeing a strong book of orders right now compared to last year, so I hesitate to quantify it, but it's still really strong right now. Some of the price increases were effective January 1st, some are effective even a little bit later than that, so it wasn't a big driver for the first quarter, which is hence-forcing the cost inputs being the story for the gross margin. However, we still have a lot of inventory due to components that we're waiting to get from a supply chain standpoint. That's really the challenge there is waiting for one component, but yet having everything else ready to go. And then, given your strong balance sheet and the current share price, how should we think about potential share repurchases and any other usages of the cash. Well, from an acquisition standpoint, we -- as we've always said, we are always looking for acquisition opportunities, and the key is that it's strategic and it brings value to our focus. So, we're out there look and obviously there's -- we're in good shape with the balance sheet to go after something when it doesn't occur. And to your point, Anthony, share repurchases and other alternate uses of cash has continued to be a discussion item. Ladies and gentlemen, this does conclude today's conference."
}