{
    "symbol": "NOVA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 18:10:23",
    "content": " Yes, I think that absolutely could happen, but again, we haven’t seen that kind of percentage 10%, 25% yet but it’s possible to see it, but I also think I’m completely confident that we’ll be able to raise rates as an industry to because the utilities are raising rates so much to more than offset that. And we have seen across just so far, and there’s going to be a lot more, we know it’s baked in to in terms of the utilities asking their respective POCs or rate increases, but we’ve seen an estimated across our base about $3.5 to $0.04 kilowatt hour increase already. So it – where I think you really wanted to go is like, okay, so these types of main increases in price in response to utility rates moving up and then response to cost of capital moving up, what does that effort look like and across the Board, and that is a big lift and we don’t do it lightly. The other thing I’d say and this is really critical is that if you take a look at what we sort of go out there in the market, and I think this happens a lot more on the loan side with us versus our competition is that we really – we are really trading on our low default delinquency rates and they’re trading a lot more on their higher refinancing rates. So these are people that increasingly obviously give them what’s going on in the energy – global energy crisis, right, Joe that we have that more and more people that really need to save money, i.e., they don’t make a lot of money are turning towards this offering. In fact, if anything again, going back into these natural gas, coal, oil, massive price increases and translating those into utility rate increases, we’re seeing demand spread across geographies, like crazy, and that’s bullish as far as pulling in more and more customers that have the ability and demonstrated that they can pay their bills on time. So, I think that will happen, but, I'll tell you what, I'll answer the question you didn't ask, which is a little bit dangerous, always, but if California doesn't make the right decision, as it made a reference to earlier, given these utility price increases, natural gas, oil, coal, and so forth, we'll just pick up origination someplace else where it makes sense, but I actually think they're going come out with something that makes sense, and we'll still do business there and we'll sell a lot more battery service there as well as EV charging, generator and load management. And so I think more and more of the equipment manufacturers, we’re seeing a – we’re having a meeting in the mines because as everybody’s best interest to make the customer happy and the way to make the customer happy is to have a full understanding of what’s going on in that regardless of who made the gear and regardless of what’s going on in the home and fix that customer’s problem immediately."
}