{
    "symbol": "NOVA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:41:49",
    "content": " There are no changes to our full year 2022 estimates for adjusted EBITDA or customer additions, and we are reaffirming our intermediate term major metric growth plan, the Triple Plan, including our targeted $530 million of adjusted EBITDA, together with the principal and interest we collect on solar loans for the year ended December 31, 2023. As of September 30, 2022, the weighted average contract life remaining on our customer contracts equaled 22.3 years and expected cash inflows from those customers over the next 12 months increased to $459 million, an increase of 39% from September 30, 2021. Our ability to maintain this guidance despite expected continued pressure on unscheduled principal payments from our customers is driven by higher interest collected on solar loans due to higher principal balances from lower unscheduled principal payments and higher adjusted EBITDA than expected on our service-only business, loan sales, equipment sales, cash sales and other initiatives. As of September 30, 2022, 100% and 88% of the midpoint of the total 2022 and 2023 targeted customer revenue and principal and interest we expect to collect on solar loans was locked into existing customers as of that same day, respectively. But a lot of those fuel prices moving from, say, call it, 250 for where the natural gas was for several years, has not been fully baked in by -- in a large amount by most utilities out there, and we expect that to continue to happen, particularly in the core lower cost markets, the central part of the United States, the Southeast, et cetera, we're expecting to see something for instance, in Georgia, out a southern company that's quite a large power increase to pay for the massive cost overruns of Vobal. One is that the scheduled principle is now higher in our forecast, even though we are budgeting for next year, lower prepayments than we had previously put in but we're also originating loans at higher interest rates over the past several months, and those are going to be going into service here at the end of the year and into next year. And then critically, as you think about going into next year, given the pivot from loan to lease given the ability to raise prices and given this higher rate environment, unlevered IRRs, what's your expectation on that metric on a leading indicator on a trailing basis, the ability to continue to raise that. As we look to next year, we've been in discussions with those who have funds that are going from 22 to 23 as far as how we're going to be treating those, how it's going to be reflected in the fully burden on number of return, really, you're not really going to see any much of a change because we didn't -- we're not going back and recalculating something even if it is now at a higher return because that wasn't the return that was originated. And I think one of your peers and everybody in your industry is, but one of your peers have said that the reason why you guys use the appraisers versus using arm's-length transactions to show the IRS, the price at which these systems are valued is because the appraisals include -- I guess -- I'm sorry, the overall costs include warranty costs, underwriting cost services costs, et cetera, that aren't included in arm's league sales. I think there's a bit of a misnomer when folks say that they're going to compare it to a cash sale from some guy out of the back of the truck who's going to go ahead and just drop off the panels at your home and have you install themselves or someone who's not going to stand behind the work or in the case of somebody who's just doing a cash sale without providing any additional service, I mean that's all that they're paying for."
}