{
    "symbol": "NBIX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-06 14:52:06",
    "content": " 2023 promises to be an important year for the Neurocrine pipeline with a number of milestones and data readouts, including the August 20 PDUFA date for valbenazine as a potential treatment option for patients with chorea associated with Huntington's disease. Under Jude's leadership of research and preclinical development, we're investing in a range of modalities, including small molecules, peptides, proteins and gene therapy to deliver on the goal of providing symptomatic disease modifying and curative treatments for patients living with serious diseases in the field of neuroscience. We're excited about the opportunity, and there's a significant unmet need in terms of being able to help these patients, improve their day-to-day disease management and overall reduce the potential for long-term issues from treatment with steroids. No, I think the only thing I'd add is, obviously, if you think about the unmet need in -- for patients in CAH, as Eric mentioned, there's been no new treatments that were non-steroidal in nature ever actually in this disease area. And so while we think there's a lot more work that needs to be done with the legislation that passes, the fact that the small manufacturer and small biotech exemptions in there are extremely helpful to companies like Neurocrine, and we're going to continue our work along with others in order to work with CMS and to work with legislatures over the years as this is rolled out. So the only thing I'd add to what Eric said is that some of same differentiating characteristics that we see for valbenazine versus deutetrabenazine in tardive dyskinesia also hold true for Huntington's disease and maybe even more importance there in terms of the simple lack of complex titration, the lack of food effect and the ability to not have some of the challenges of splitting  capsules in patients with dysphagia. With regards to the first part of your question about the dynamics within the Huntington's community, I'll start off by saying that we're excited about the data that we've generated and certainly look forward to getting the labeling from the FDA later this year. There will be not a ton of burn here in 2023, but it really puts us in a position to have an expansive gene therapy preclinical portfolio that's going to put us in a position to be able to -- hopefully be able to have both disease-modifying curative medicines for patients when you look back 10 years from now."
}