{
    "symbol": "NBIX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 12:30:26",
    "content": "  Operator: Good day, everyone, and welcome to today's Neurocrine Biosciences Reports First Quarter Results. It is now my pleasure to turn today's program over to Todd Tushla, VP of Investor Relations. Good morning, everyone, and thanks for joining our first quarter 2022 earnings call. With me as usual are Kevin Gorman, our Chief Executive Officer; Matt Abernethy, our Chief Financial Officer; Amy Roberts, our Chief Medical Officer; Eric Benevich, our Chief Commercial Officer; and Kyle Gano, our Chief Business Development and Strategy Officer. Before we get going, I'll remind everyone that during today's call, we will be making forward-looking statements. After our prepared remarks, we'll be happy to address your questions. I'm sure you saw our press release this morning, and I have to say I'm very pleased with the work of our entire commercial and medical organizations in educating health care professionals on TD resulted in a record number of TD sufferers being treated with INGREZZA last quarter. However, I believe we are adapting well to the remote delivery of health care, which we know will persist at some level moving forward. As you may recall, at the beginning of the year, we updated you on the portfolio of clinical programs that we have started, what we are anticipating starting this year and the data readouts. I'm pleased that we remain on track for most of these programs, importantly, including filing the sNDA for INGREZZA in Huntington's disease and our 2 data readouts in essential tremor and CSWS. Now as I will share with you, there are 2 programs that have been impacted by the invasion of Ukraine, and we are currently mitigating the impact of the loss of those potential clinical sites. But aside from that, we have handled this growing and complex pipeline extremely well, and I'm looking forward to sharing data with you later this year. As you saw in our earnings release, we delivered strong Q1 performance with INGREZZA sales totaling $303 million in what is typically the most challenging quarter of the year. In addition, we exited Q1 with a record number of new patients, reflecting an improving external environment and benefits from our commercial initiatives. As you think about Q2, we do expect sequential growth. However, the dollar growth will likely not be as strong as prior years given the benefit we saw in Q1 from our team's improvement in managing through the seasonal dynamics. On the financial front, we continue to have plenty of flexibility with a strong balance sheet and attractive P&L profile to continue to invest in INGREZZA and advance our pipeline. With that, I'll now hand the call over to Eric Benevich, our Chief Commercial Officer. With our INGREZZA franchise, Q1 has always been a tale of 2 half quarters, with the first half of the quarter impacted by seasonal payer dynamics largely related to the prescription reauthorization process. Despite the surge in the Omicron variant early in Q1, we did see a general improvement in the external environment translating into improved HCP access in favorable conditions to mitigate the typical Q1 payer dynamics. We knew the key to a successful Q1 was to focus on execution, and our field teams did a phenomenal job delivering not only on strong rates of compliance but also record levels of new patients. These results were accomplished while we recruited, trained and onboarded in the incremental 140 sales representatives to complete our sales force expansion at the end of the quarter. As it relates to the second quarter, as Matt mentioned, given our strong performance in Q1, we do expect to see continued growth in Q2 over Q1, but at a slightly lower percentage increase compared to prior years given the stronger-than-expected growth in Q1. From a regulatory perspective, INGREZZA was designated a breakthrough medicine by the FDA. However, our work remains largely unfinished with approximately 85% of the estimated 600,000 people living with TD either still in diagnosed or not being treated with a VMAT2 inhibitor like INGREZZA. So we've made significant commercial investments to accelerate the diagnosis and treatment of TD, not just this year, but for years to come. Lastly, I'd like to share that the month of May has been designated as mental health awareness month. This week, in particular, is recognized as Tardive Dyskinesia Awareness week, or TDA for short. 5 years ago, most people living with mental health conditions were unaware that TD existed. I'm odd by what our team has been able to achieve in these past 5 years, and I'm humbled by the scope of what we aim to accomplish in the years ahead as we improve the lives of the many thousands of patients still suffering from TD. So with that, I'll turn the call over to my colleague, Eiry Roberts, our Chief Medical Officer. I'm happy to provide a brief update regarding a selection of our clinical programs, beginning with valbenazine. In March, we received very good news from our partner, the Mitsubishi Tanabe Pharma Corporation, regarding the regulatory approval of valbenazine in Japan for the treatment of tardive dyskinesia. We were very impressed with the data that was generated from the KINECT Phase III study, and we look forward to supporting our Japanese partner as they proceed with launch plans for DYSVAL, the Japanese brand name of valbenazine. In collaboration with the Huntington's Disease Study Group, we were pleased to present additional safety and efficacy data at the American Academy of Neurology meeting earlier this month. You'll recall in the KINECT-HD study that valbenazine met the primary endpoint of significant improvement in severity versus placebo, as measured by the Unified Huntington's Disease Rating Scale, Total Maximal Chorea Score, with improvement beginning as early as week 2 of treatment. In addition, the percentage of study participants with clinician or self-rated global improvement was significantly higher at 12 weeks with valbenazine treatment than with placebo. Importantly, also the safety profile was consistent with valbenazine known safety profile in TD with no suicidal behavior or ideation. Our thoughts are always everyone tragically impacted by the current situation in Ukraine, including our contract research organization and clinical research partners in the region. Like many in our industry, several of our recently initiated clinical program in psychiatry and neurology intended to involve sites located in Ukraine and Russia. While we've pivoted contingency plans across our portfolio, the war has already impacted the time line for the Phase III study for valbenazine and dyskinesia related to cerebral palsy, and the initiation timing for the second Phase III study of valbenazine for the adjunctive treatment of schizophrenia. We now expect to have top line data for the treatment of dyskinesia due to cerebral palsy in 2024, while for top line data for the first Phase III study of valbenazine for the adjunctive treatment of schizophrenia remains on track for 2023. Initiation of the second Phase III study, however, has been delayed to 2023. Turning to NBI-104, our selective T-type calcium channel antagonists in dossier. Midyear, we will readout the data from our Phase II proof-of-concept study in essential tremor. Then in the second half of 2022, we'll complete our ongoing trial in epilepsy with continuous spike in wave during fleet. Based on the review of the totality of data generated for NBI-104, we will then determine potential next steps for 104 in each of these indications. In closing, I'm very pleased with the progress of our clinical pipeline. Congrats on the quarter. As it relates to your improvement with compliance this quarter, right, I was wondering if you could just add a little bit of context around that. So I think historically, you've said something like a 7% to 8% headwind can happen in 1Q with refill delays. Paul, for the gross to net side of the equation, we've guided that the first quarter should be around $5,300 per script and then for the full year, around $5,400 per TRx. As it relates to the seasonal dynamics, not going to get into the specifics here, but we did see, I guess, less of a decline moving from refill rate per patient from Q4 to Q1. It was a good thing we were able to manage through the reauthorization process much more effectively, I think, between experience and improving environment from an access perspective that afforded us to be able to do that. So historically, you've seen that recovery from Q1 to Q2, that added a very nice bump. And what we're saying is we do expect to grow sequentially into Q2, but it might not be as a high a clip as what you've seen historically. I was just wondering, first, if you could comment on whether there was any impact from inventory during the quarter. So we're really encouraged by what we saw in the first quarter, record number mutations, environment improving. As it relates to inventory, no real comment this quarter. Tazeen, so historically, it's really been pretty consistent over the last few years. Certainly, in looking at the development of the TD market, we felt that there was opportunity to better penetrate the neurology segment, and that was an important consideration in our decision to expand and reorganize the sales team. And obviously, we've hired people with considerable experience and relationships in neurology, but that team is just hitting the ground, so to speak. Tazeen, we're not prepared to talk about peak sales haven't been and probably won't be. First, SG&A seems to be annualizing much higher than the guidance for the onetime charges in the quarter to note. In regards to the SG&A spending, really 2 dynamics that occurred during the quarter. If you look back over time, there is -- has historically been a step-up from Q4 to Q1, that are Q1 specific investments that we make. And then in addition to that, we did invest in our sales force. So within our guidance range that we provided today, we're confident that's the right level of spending. As it relates to ONGENTYS, as Eric mentioned previously, we have an expanded sales force at this point with a higher focus on neurology. And it is something that we're looking at, Josh, and ensuring that if we are making the investment in ONGENTYS that it does drive the right kind of returns. And I think it is straightforward, the sales are a bit lower than what any of us would have expected at this point. ONGENTYS is a really good product, but the Andy Parkinson's category is challenging from a payer access perspective. Frankly, the way that health plans manage any Parkinson's drugs is to really limit access to branded medicines across the board. We feel like it provides an important benefit for Parkinson's patients, and we're committed to moving to sort of neurologists. The primary impact of that study is the crossover study, single center, well-controlled program in 28 patients. In addition to that, we do have the more traditional TETRAS clinical endpoints in that study as well, and we'll be able to compare the tremor measures across placebo and active treatment for each patient against those endpoints in addition. Just as we think about that 104 data coming out, can you talk about then the sort of the urgency to move forward given relative -- you're somewhat behind your peers. Should we be thinking that you'll wait for the CSWS data before then engaging with regulators or once you have sort of the data, you can kind of move forward on its own and not wait for those data. And obviously, we'll learn from one study to the other, particularly in terms of tolerability and different patient sets. Phil, so the latest data that we've seen is that telemedicine still constitutes about half of all visits in psychiatry. It's less than 10% of paid visits in neurology, for example. Certainly, as long as the public health emergency declaration is still in place, the temporary waivers that were issued by CMS remain in place, including parity of reimbursement for a virtual visit versus an in-person visit. In the market research that we've done with physicians and psychiatrists in particular, their expectation is that in the future, they will utilize telemedicine at a lower rate, probably more like in the 20% to 30% range. So from a business perspective, we continue to operate as if the status quo is going to continue out into at least 2023. And certainly, a lot of the work that we've done to adapt our business model to our ECP customers changes in terms of how they're delivering health care have paid dividends. And certainly, I think that that's reflected in, for example, the strong Q1 that we just experienced. And Phil, the only thing I would add to that is, as Eric said earlier, our enhanced focus on advanced practice professionals, they utilize line far less than psychiatrists to, they're really the front lines delivering psychiatric care. I know it's been a while, but we're finally seeing Conestofon's Phase III program coming on the horizon next year. It seems over the years, you've come to focus more on the neuro side of things, but less on the print side of things. Just trying to think ahead to next year of success, what the build-out should look like. I think our plan is still, as we've said all along, we would plan on commercializing crinecerfont ourselves. And in addition to that, that's not just in North America. We have -- we look forward with crinecerfont to be able to internationalize, and it could be one of several drugs that we find that Europe would be an ideal location for us to begin to put down a commercial footprint. Brian, we'll, of course, get into more detail around that as we get closer to potential launch. And I think in general, the response was very favorable as it has been from the investigative group and even the community to the data that we were able to share. As you remember, we saw a highly statistically significant improvement in the Total Maximal Chorea score, week 10 to 12 compared to baseline in individuals with HD, together with improvements in the clinician's global assessment and feature global assessment of severity. And so from that perspective, and in particular as well, the tolerability and safety profile was very consistent with what we've already seen for INGREZZA in tardive dyskinesia with no indication of suicidality. We continue to be on track with the long-term safety data generation from the 6 months data that's required for the submission later this year, and we'll be moving forward with that. Congrats on the quarter. Obviously, what you've seen over time is kind of a 3-pronged strategy in how we allocate capital over time. It's number one, focusing on INGREZZA and building out indications there with the lead in tardive dyskinesia. On the BD side of things, you've seen a range of collaborations that we struck over the years. I think largely, we'll continue down that line in that strategy as we move forward. I think we have a lot of flexibility to your point, Jay, and we're going to continue to operate our business focused on INGREZZA and changing our pipeline, but open to things to in-license or potentially acquire. And on the foot traffic angle, we're curious whether you are seeing any sort of inhibition based on some of these BA 0.123 variants? Certainly, the overarching theme for our launch these past 5 years has been to increase awareness and drive diagnosis of TD, and through educating HCPs and then more recently through the efforts that we've had with the patient and care partner population as evidenced by the success of our DTC campaign. So whether it's the HCP, the psychiatrist, the nurse practitioner being more diligent in having an awareness and proactive screening approach for TD, whether it's the patient bringing these symptoms up during their visit. And certainly, as the COVID environment improves and there's more face-to-face interactions between the providers and the patients, that also helps. And so all of these things, we think, are positive drivers for growth of the franchise. And with regards to the most recent variants, certainly, you see regionally some changes in terms of reported rates. So overall, I'm pleased with the progress that we're seeing in the market. Congrats on the quarter. Just on 568, the M4 agonist, that's moving into Phase II this year. I think once we release the full protocol in the context of concotrals.gov, obviously, you'll be able to see exactly how we are measuring some of those cardiovascular and other safety measures in the context of the study. So from an expense guidance perspective, overall expense guidance was held neutral, but then we had, like you said, Chris, an increase in SG&A, a slight decrease in R&D. I think we mentioned in Eiry's prepared remarks in the Ukraine, and some of the spending behind those programs was a bit delayed. And then on the SG&A side, saw continued places for investment that would allow us to continue to market INGREZZA more effectively. I had a quick pipeline question, actually a multipart question for 104. And similar to the question on TAH, we'll provide more insight as we get closer on the commercial call points. But clearly, some of the neurologists treat patients with epilepsy, but we would have to expand the call activity if we did go into epilepsy, especially for -- on the rare side. When you look at a broader indication like focal onset, which is the second indication that we're exploring with the compound that -- I'm -- but from an epilepsy perspective, those would be what you leveraged together and it wouldn't be specific to our current call activity. Obviously, essential tremor and CSWS are very different in terms of their indication. First of all, I think from a mechanism of action perspective, there's good reason to believe that we have an opportunity potentially in each of those indications to add value to patients. For essential trend, there's obviously been no medications approved since propranolol back in the 1970s. And obviously, we're not going to have to wait too long to understand whether we have some positive signal and adequate tolerability to be able to move forward. So in -- with the case of ONGENTYS, we've seen a little bit of trouble driving revenue there, and you've talked to some of the challenges. I'll jump in here, Laura, that -- as we're going through this program, essential tremor is the largest disorder that exists with nearly 10 million patients in the United States and a little bit more over in Europe. So as we get closer, we'll then start talking about those aspects of the program. Right now, we're solely focused on the signal-seeking study that we have ongoing that we'll report out here shortly. It is a -- the thing with CSWS is that these individual patients, in addition to having significant issues with seizures, they have a characteristic signal on their EEG measure, the spike in wave measure on the EEG. And so that is the primary endpoint in this initial Phase II study, is the ability for 104 to reduce the signal that is seen on that EEG overnight in patients -- in inpatient setting when you compare baseline to primary end point. And so in addition to that, obviously, we will be looking at seizure frequency in this patient population together with, obviously, additional safety and tolerability endpoints and measures of functionality, both clinical and physician assessed. And so from that point of view, I think again, we'll be looking at the totality of the information that we see from this early Phase II study in order to determine whether we're seeing a signal of appropriate magnitude to be able to move forward. Kyle, you were talking about business development and the strategy and stuff, but I was curious what was going on just behind the scenes with respect to just discussions with companies and with valuations down so significantly. Whether discussions have been enhanced if companies that you were talking to before that didn't have an interest because of valuation, if those have changed. And then, Matt, can you just confirm the tax rate discussion that we've had before, 5% this year, 24% next year is still confirmed. So on the business development side, the questions here, I think I'd just make 2 points. There's still a line of sight to where they were 12, 18 months ago. But other than thinking about time, being something that would be a benefit to us and seeing stock prices for companies that are diminished continue, the thing that we noticed, and I'm sure that you have as well is that quality companies with quality programs, they don't tend to be the ones that have been hit as hard in this downturn that we've seen. So for a lot of the things that we're interested in and looking at, valuation and decreased valuation really isn't a topic of discussion. So I think that's something that we have seen over time, those things that are good quality assets tend to do well. And on the tax rate, yes, I think from a cash tax perspective, you could expect us to be a state cash tax payer this year with a bit of cash tax on the federal side by the end of this year. You may know this, but there's a tax legislation in place that you now have to capitalize your R&D and take that as a deduction over a long period of time. And because of that, that's going to cause us to burn through NOLs more quickly than we otherwise would have. Hopefully, it does get either delayed or pushed aside permanently because it could impact innovation. But for us, it puts us in a place where we would spend around $10 million exiting this year; and then next year, we would be a full cash taxpayer on the federal and state side of the equation. Our medium-term effective tax rate, I would just say, as we always have, around 24% to 25% is what you should expect. I think leading indicators from my perspective is really related to promotional activity, sales calls, peer-to-peer speaker programs, use of samples, et cetera. And the lag that we typically see in the industry, I think is relevant here for the INGREZZA brand. So from a sales force expansion perspective, what we saw 2 years ago or 3 years ago when we did the most recent , it was 2 quarters where we started seeing some of the benefit and by the end of the third quarter, they were producing -- or performing at a similar rate. So there's a lot of leading indicators in KPIs that we're looking at to measure how much traction we're gaining, but it does take a few quarters for it to start generating incremental revenue. So that's what we're focused on right now, helping our new folks to get up to the same level of productivity as the legacy team. There are some other companies pursuing 2 type and ET, and they're relatively in the same -- in the race as you. And so from that perspective, based on the preclinical data where we have a favorable profile to take into the clinic to assess. Obviously, we're designing the study such that we're able to look at both efficacy and tolerability in these initial Phase II studies and at that point in time, when we have more information, I think we'll have a better understanding. Now obviously, we do not have clinical data yet. And as we move forward potentially with those, we'll be able to talk more about that. As you can see, we're trying to get through all of the questions that's important to us that everyone gets an opportunity to ask us questions. Right now, the company is to use the metaphor hitting on all cylinders, as I would say. And Eiry said, yes, the conflict that has taken place, the tragic conflict over in Ukraine, that has impacted a couple of programs that we were going to be starting up some clinical sites over there. And then finally, I would say, the following year, 2023, is going to be a wealth of data readouts that we're going to have. No guarantees, but we're very pleased with the way things are shaping us for us -- shaping up for us throughout 2022."
}