{
    "symbol": "PFHD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 12:25:09",
    "content": " For the second quarter of 2022, annualized loan growth was 36.2%, with record loan production of $316 million which was partially offset by pay-downs and prepayments. Total loans grew to approximately $2 billion as of June 30, increasing 9%, during the second quarter or 36.1% annualized loan growth and has grown 15.2% over the last 12 months. Additionally, $69.5 million of loans with a weighted average rate of 4.82% were booked on the last day of the quarter and are not reflected in the net income this quarter, although their associated allowance balances are reflected this quarter. Commercial loans, including C&I and search fund grew by 10.1% during the quarter and 20.5% over the last 12 months. Our lenders, Deep Roots Networks have similarly resulted in a strong pipeline of activity on the commercial real estate side with CRE up 11% during the quarter and 14.6% over the last 12 months. New loan originations in the second quarter were led by commercial and commercial real estate production with total originations of $315.8 million, more than offsetting payoff and pay-downs of $85.8 million. While Q1 included severance associated with the departure of our former CEO, adjusted Q1 net income was $5 million, meaning that on an adjusted basis, adjusted net income improved $2 million over prior quarter or 40% improvement. Net interest income was up 15% from the previous quarter to $21.9 million for the second quarter of 2022 and up 27.4% from the year ago period, a combination of rate increases on our assets and extraordinary growth in higher-yielding categories. As a result of the strong loan growth we had this quarter, we booked $2.2 million of provision expense, up $1.4 million from the previous quarter. While professional banks in market relationship-driven deposit franchise slows during the quarter, non-interest-bearing deposits make up nearly 33% of total deposits and supported further improvements to our cost of deposits in the quarter to 24 basis points. The other one was high FAS 91 fees this quarter, which was a direct result of loan growth and we had record originations of $316 million."
}