{
    "symbol": "CEPU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 16:37:04",
    "content": " In terms of its own capacity, the system reached 42,871 megawatts in the first quarter 2022, resulting in a 1.4% increase compared to the first quarter of 2021, mainly based in a new renewable project developed. In the first quarter of 2022, energy generation increased 1% to 35,719 gigawatts hour compared to 35,332 gigawatts hour in the first quarter of 2021, mainly due to a 37% increase in nuclear, 24% increase in renewables and 2% increase on thermal partially offset by a decrease of 25% in hydro. For thermal units, there was an overall lower availability, 76% for the first quarter 2022 as compared to 81% in the first quarter of 2021. During the first quarter of 2022, main sources of energy generation continue to be thermal with a 65% share and hydro and renewables represented 13.9% and 13.6% respectively, while nuclear was 7.3%. Finally, as you can see on page five, energy demand increased 4.3% up to 34,520 gigawatts hour compared to 33,087 gigawatts hour in the first quarter of 2021. As you can see on page five, energy generation during the first quarter of 2022 was 4,585 gigawatts hour of electricity, 32% higher than the same period of 2021. The increase was mainly caused by 36% increase in energy generation for thermal sources, specifically Terminal 6 San Lorenzo Power Plant full operational as a combined cycle and higher dispatch of Central Puerto steam turbines due to a higher demand, partially offset by  availability of Luján de Cuyo generation and 26% increase in Piedra del Águila due to CAMMESA's decision to increase dispatch regardless the low water inflows reducing the dam level. Steam production during the first quarter of 2021 increased 76%, totaling 461,000 tonnes produced due to Terminal 6 San Lorenzo Power Plant full operation and good performance of Luján de Cuyo generation plan. This 8.8% increase was mainly due to an 8% increase in Energia as sales, which totaled ARS7 million compared to ARS6.5 million in the first quarter of 2021 because of a 19% increase in generation and a rise of 30% in tariffs under the new resolution 238 of 2022, which is lower than inflation that reached 55.1% in the last 12 months. Also there was a 7% increase in sales under contracts, which totaled ARS9 million in the first quarter of 2022 as compared to ARS8.4 million in the first quarter of 2021, mainly due to the full – of Terminal 6 San Lorenzo Power plant, which represented an increase in generation of 523 gigawatts hour as compared to 35 gigawatts hour in the first quarter of 2021. And finally a 93% increase in Steam Sales, which totaled ARS0.8 million in the first quarter of 2022, representing a 76% increase in production compared to ARS0.4 million from the same period of 2021. This 27% increase was driven by the following changes; a 9% increase in revenue  a 6% decrease in cost of sales that totaled ARS7.6 billion in the first quarter of 2022 as compared to ARS7.99 billion in the first quarter of 2021, mainly due to lower operational costs. On Page 9, we can see the consolidated net income that was ARS4.8 billion compared to consolidated net income of ARS1 billion in the same period of 2021 in addition to the factor mentioned before, the net income was affected by positively by less financial expenses amounted ARS4.7 billion in the first quarter of 2022 compared to ARS10.8 billion in the first quarter of 2021, mainly due to a reduction of indebtedness and the corresponding interest yield."
}