{
    "symbol": "DENN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 22:11:04",
    "content": " During the first quarter we generated adjusted free cash flow of $10.7 million compared to $5.2 million in the prior year quarter, primarily due to improvements in sales performance at both company and franchise restaurants. In closing, we are well on our way through the recovery curve, and I am excited about the bright future with all the opportunities in front of us to extend our operating hours with improved staffing, to elevate the guest experience through Heritage 2.0 Remodel, to grow the collective footprint of Denny's and Keke's locations to upgrade products through updated kitchen equipment and to create a more seamless digital experience through restaurant technology upgrades. So on the one hand using sort of the Lexus, Camry analogy, you see that our franchisees when they're close to home in certain markets, they want to continued expand and some trade areas that they're reluctant to go into with Denny's where historically the higher incomes they might have been looking for a different experience, and we have value based products and lower pricing, what those neighborhoods bear, different plate ware, different finished detail, different expectations. So when you look at the guidance, right, so let break it down a little bit to make sure we understand that that $17 million to $19 million is being impacted by that $4 million of share based compensation, it's pretty technical, but the shares that are utilized for withholding purposes are cash hit in our adjusted EBITDA calculation. Great questions and this is one that it's like a big circular reference, this thing between real disposable income and consumer confidence, and then the pace at which the market can be disrupted all at once for our brand and I can't speak for everybody that has sort of the footprint we have, but sort of a middle income middle America consumer, I'd say, many of which are working class, not all, but our customers represent America and their – and so when they – when their confidence is a little lower, they eat, they stay, they go to the grocery store a little more, a brown bag a little bit more often. And I just want to better understand when I look at a three-year geometric stack for same-store sales, so you calculate geometrically, there's the 4% implies a pretty sharp deceleration from the first quarter."
}