{
    "symbol": "NSP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 17:45:06",
    "content": " Operating expenses increased 22% over Q4 of the prior year, which was slightly above our forecast and included continued investment in our service personnel given our high worksite employee growth, a planned increase in Business Performance Advisors, higher sales commissions tied to programs surrounding our Q4 sales volume and pricing, increased costs related to recruiting, travel and training, and costs related to our ongoing implementation of salesforce. Also, one of the charts in the earnings presentation we released today shows the compound annual growth rate over the most recent five years in paid worksite employees and adjusted EBITDA of 10% and 15%, respectively. So when we add our 2023 expected performance to our recent record setting year, we're still well ahead of our internal five year plan in growth and profitability, and we believe we're making the right investments to continue to achieve the goals of our plan. Now we are focused company wide on the 10 key success factors we believe will capitalize on the strong demand for our services in the marketplace, achieve the goals of our internal five year plan, and produce compound annual growth rates that drive exceptional return to shareholders. Our pricing strategy is really specific, and relative to every client's specific information throughout their organization and then how we're trending things for going forward and building in increases is based on all the underlying trends that we're seeing plus, like I mentioned, one of our key success factors in our five year plan was to also build in a reasonable level to deal with inflation that's going on in the marketplace. In our big picture plan, in our five year plan, what is a key differentiator from previous years is that we believe that this sales efficiency improvement allows us to grow our units, our worksite employee growth at a rate faster than our growth in BPAs. So in our five year plan, we talked about, hey, we believe now we can actually look at a program where we're growing the BPAs in the high-single digits and growing the worksite employees in double-digits between that 10% to 15% range."
}