{
    "symbol": "AFIB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 21:12:04",
    "content": " For the fourth quarter, net revenue of $5 million compared to $4.4 million in the year ago fourth quarter, as we closed 2022 with our highest level of quarterly sales on record. The 14% year-over-year increase was primarily driven by disposable sales associated with higher AcQMap procedure volumes, growth in left-heart access, both organically and through a distribution agreement with Medtronic and modest increases in capital and service other revenue. For the full year of 2022, net revenue of $16.4 million compared to $17.3 million in the prior year with declines attributable to a 2.3 million year-over-year reduction in capital equipment sales and $0.4 million in foreign exchange headwinds. For the full year, disposables revenue of $12.9 million advanced 8% year-over-year on a reported basis and 11%, excluding negative impact of foreign exchange, supported by 19% growth in commercial AcQMap procedure volumes. For the full year, capital revenue of $1.8 million declined 57% from $4.1 million to 2021, consistent with our expectations and strategic prioritization of procedure volume and same-store utilization growth. Supply chain disruptions that emerged during the third quarter of 2022 continued through the fourth quarter and we estimate that these disruptions negatively impacted Q4 2022 and full year 2022 sales by $200,000 and $300,000, respectively. Non-GAAP operating expenses were approximately $13.9 million in the fourth quarter of 2022, down 35% from the same period last year, and it's the lowest level of quarterly non-GAAP operating expenses since IPO. Our cash burn, excluding milestone payments and the employee retention credit, was $15.6 million in the fourth quarter, down 41% versus the prior year and down 29% on a sequential basis. In regards to the first quarter of 2023, we expect sales to show modest year-over-year growth compared to the $3.7 million registered in the prior year period."
}