{
    "symbol": "AFIB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 08:50:06",
    "content": " Our shift to focus on utilization volume -- on procedure volume growth and utilization over expanding the installed base has enabled us to grow year-over-year procedure volumes, increase utilization per console, and drive higher revenue per case as we launch new products. In the third quarter, capital revenue was $0.5 million decreased from $1.5 million in the year ago third quarter, driven by the prior year bolus of capital sales previously discussed. Non-GAAP operating expenses were approximately $15.2 million in the third quarter of 2022, down 30% from the same period last year, and is the lowest level of quarterly non-GAAP operating expenses since IPO. Taking these factors into consideration with our year-to-date performance as well as timing of the commercial transfer of our left-heart access portfolio to Medtronic, we expect full-year 2022 revenue to be in a range of $15.5 million to $16 million. This includes about a $2.5 million decline versus 2021 in capital equipment revenue, FX headwinds of just over $500,000 on a year-over-year basis, which was slightly worse than where rates stood at our last earnings call and over $300,000 from incremental supply chain headwinds that began leading Q3 and are continuing through Q4. So through the first nine months of the year, we had generated about $1.1 million in revenue in this product, but we do think that we'll probably see something in the range of about $100,000 that impacted us in Q3, keeping in mind that a lot of our orders come toward the end of a quarter and probably something in the $300,000-plus range here in Q4. I don't know if those will all be installed and utilized here in the fourth quarter, but they are entering a fairly significant geographic expansion phase in 2023 that will likely drive an increase in our installed base next year in addition to the U.S., where we do think our ablation catheter launch will be a catalyst to grow the installed base as well."
}