{
    "symbol": "MSFT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-26 20:07:09",
    "content": " Amid this macroeconomic environment, the Microsoft Cloud surpassed $25 billion in quarterly revenue for the first time, up 28% and 33% in constant currency. Excluding the impact from the change in accounting estimate for useful lives, Microsoft Cloud gross margin percentage increased roughly 1 point, driven by improvement across our cloud services, partially offset by sales mix shift to Azure. At a total company level, headcount grew 22% year-over-year as we continued to invest in key areas such as cloud engineering, LinkedIn, sales and customer deployment, and included roughly 6 points of growth from the Nuance and Xandr acquisitions. Office 365 commercial revenue increased 15% and 19% in constant currency, in line with expectations, driven by installed base expansion across all workloads and customer segments as well as higher ARPU from continued momentum in E5. Paid Office 365 commercial seats grew 14% year-over-year, driven by our small and medium business and frontline worker offerings, although growth was impacted by some moderation in new deal volume outside of E5, particularly in the small and medium business customer segment. Office commercial licensing was down 32% and 28% in constant currency, lower than expected, driven primarily by a lower mix of contracts with higher in-period revenue recognition. Office consumer revenue grew 9% and 12% in constant currency, in line with expectations, driven by continued momentum in Microsoft 365 subscriptions, which grew 15% to 59.7 million. Dynamics revenue grew 19% and 24% in constant currency, driven by Dynamics 365, which grew 31% and 36% in constant currency, slightly below expectations due to lower-than-expected growth in new business even as our cloud growth continues to outpace the market. LinkedIn revenue increased 26% to 29% in constant currency, lower than expected as Marketing Solutions was impacted by the slowdown of advertising spend noted earlier. Azure and other cloud services revenue grew 40% and 46% in constant currency, about 1 point lower than expected, driven by a slight moderation in Azure consumption growth across customer segments. In our on-premises server business, revenue decreased 2% and increased 1% in constant currency, ahead of expectations, driven by a greater-than-expected number of contracts with higher in-period revenue recognition. Enterprise Services revenue grew 5% and 8% in constant currency, lower than expected, driven by declines in Microsoft Consulting Services. Segment gross margin dollars increased 15% and 19% in constant currency, and gross margin percentage decreased roughly 3 points year-over-year. Windows commercial products and cloud services revenue grew 6% and 12% in constant currency, lower than expected due to some impact from the small and medium business deal moderation noted earlier. Search and news advertising revenue ex TAC increased 18% and 21% in constant currency, lower than expected, driven by the slowdown in advertising spend noted earlier, partially offset by the inclusion of 3 weeks of results from Xandr. Xbox content and services revenue declined 6% and 4% in constant currency, driven by lower engagement hours and monetization in third-party and first-party content, partially offset by growth in Xbox Game Pass subscriptions. Segment gross margin dollars were relatively unchanged and increased 4% in constant currency, and gross margin percentage decreased roughly 1 point year-over-year, driven by increased usage of Windows Commercial Cloud services. In Productivity and Business Processes, we expect revenue to grow between 12% and 14% in constant currency or US$15.95 billion to US$16.25 billion. For Intelligent Cloud, we expect revenue to grow between 25% and 27% in constant currency or US$20.3 billion to US$20.6 billion."
}