{
    "symbol": "MSFT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-25 20:51:02",
    "content": " It was a record quarter, driven by continued strength of the Microsoft Cloud, which surpassed $22 billion in revenue, up 32% year-over-year. As a result of our customers’ trust, our security business revenue surpassed $15 billion over the past 12 months, up nearly 45% year-over-year. In our commercial business, strong execution by our sales teams and partners combined with continued demand for our Microsoft Cloud offerings drove significant growth in large, long-term Azure contracts, as well as increased usage of Teams and our advanced security and identity offerings. Office 365 commercial revenue growth of 19% was driven by installed base expansion across all workloads and customer segments, as well as higher ARPU. Paid Office 365 commercial seats increased 16% year-over-year, driven by another strong quarter of growth in our small and medium business and frontline worker offerings. LinkedIn revenue increased 37% and 36% in constant currency, with continued strength in Marketing Solutions, which grew 43% year-over-year as well as better-than-expected performance in Talent Solutions from the strong job market noted earlier. In our on-premises business, revenue increased 6%, in line with expectations driven by healthy demand for our hybrid offerings that include Windows Server and SQL Server running in multi-cloud environments. Windows OEM revenue increased 25%, significantly ahead of expectations, driven by the strong PC market noted earlier, particularly in the commercial segment, which has higher revenue per license. Xbox hardware revenue grew 4% and 3% in constant currency driven by continued strong demand and better than expected console supply on a strong prior year comparable that included the launch of the Xbox Series X and S. Xbox content and service revenue increased 10%, lower than expected, as strong growth in first-party titles and Game Pass subscriptions was partially offset by weaker third-party title performance. Excluding the impact of the change in accounting estimate, Q3 gross margin percentage will increase roughly 2 points driven by continued improvement across all cloud services, despite revenue mix shift to Azure."
}