{
    "symbol": "AEMD",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-28 19:26:02",
    "content": " Factors that could cause results to differ materially from those anticipated in forward-looking statements can be found under the caption Risk Factors in the Companyâ\u0080\u0099s annual report on Form 10-K for the fiscal year ended March 31, 2022, our most recent report on Form 10-Q and in the Companyâ\u0080\u0099s other filings with the Securities and Exchange Commission. During the fiscal year ended March 31, 2022, we raised approximately $17.5 million in net proceeds from the issuance of common stock and a combination of a registered direct financing and ATM sales. We recorded approximately $294,000 of revenue related to our government contracts with the NIH and the fiscal year ended March 31, 2022 compared to approximately $659,000 in the fiscal year ended March 31, 2021. Our consolidated operating expenses for the fiscal year ended March 31, 2022 were approximately $10.72 million, compared to approximately $8.55 million for the fiscal year ended March 31, 2021, an increase of approximately $2.17 million in the fiscal year ended March 31, 2022. The $2.17 million increase in the 2022 period was due to increases in payroll and related expenses of approximately $1.17 million and in general and administrative expenses of approximately $1 million, which were partially offset by a decrease of approximately $4,000 in our professional fees. The $1.17 million increase in the fiscal year ended March 31, 2022 in payroll and related expenses was due to an increase in cash-based compensation of approximately $1.2 million, which was partially offset by a decrease in stock-based compensation of approximately $29,000. Those increases were partially offset by the combination of a $452,000 accrual in the 2021 period related to the separation agreement with our former CEO with no comparable expense in the 2022 period and a net decrease of approximately $135,000 in cash bonuses. The $1 million increase in the fiscal year ended March 31, 2022 in G&A expenses primarily arose from increases of $453,000 and clinical trial expenses, $209,000 in rent expense, and $195,000 in insurance expenses. As a result of the changes in revenues and expenses I just described, our net loss before non-controlling interests increased to approximately $10.4 million for the fiscal year ended March 31, 2022 from approximately $7.9 million for the fiscal year ended March 31, 2021."
}