{
    "symbol": "RENT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-10 00:13:06",
    "content": " The significant improvement is due to higher revenue per shipment versus last year and rental product depreciation and revenue share costs at 32% of revenue versus 50% in Q1 '21 as higher subscriber count and therefore higher revenue, absorbed product costs. In terms of comping against last year, Q1 '21 still had higher unlimited subscription pricing and subscribers were less engaged given the COVID environment, resulting in lower fulfillment costs as a percent of revenue last year. Adjusted EBITDA for Q1 was negative $8.8 million versus negative $6.2 million in Q1 last year, representing negative 13.1% margin and a five point improvement versus negative 18.5% last year, giving us the confidence to reiterate our target of getting to adjusted EBITDA breakeven in the next two to four quarters. Our total operating expenses, marketing, technology and G&A, represented 77% of revenue compared with 93% in Q1 '21, demonstrating our ability to absorb fixed costs with higher revenue even as we invested in the business in Q1. And though Rent the Runway has shown greater resilience to COVID variants over time, we continue to closely watch variants and potential impact and we have incorporated similar patterns to the prior two years in our expectations for the second half of this year which means we expect Q4 revenue to be only slightly higher than Q3. And given the volatile macro environment and potential COVID impact for the rest of the year and it's really based on what we've seen in the last two years and also the fact that we're really early in the year, we think it's best to maintain our prior guidance for the full year. But I also just want to remind you that our business is different than other businesses because we're able to monetize our products over many years as opposed to other retailers or e-comm companies that could be stuck with their inventory, we have that ability and you just saw us do that over the last couple of years. So this is really why we think that there are good benefits ahead of us, why we feel confident in what we have said last call which is that we believe that the fulfillment cost can get back down to below 30% of revenue over the next few years. We feel really good about our plan to continue to spend about 10% of our revenue on marketing this year, excluding employee-related expenses because, number one, we continue to benefit from this really strong organic growth flywheel. That being said, our reserve business continues to be such a critical funnel for us because even though over 80% of our revenue comes from subscribers, the majority of our customers continue to be people that come in a few times a year, rent a la carte, buy from us resale. So we see a lot of engagement with customers wanting to use the subscription for newness and for a variety at those periods of time during the year as opposed to, let's say, during the dead of winter in January when we're kind of snuggled up in our sweaters and pajamas at home, that might be a more natural period of time where we see higher rates of pause."
}