{
    "symbol": "BC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 14:32:17",
    "content": " Our parts and accessories businesses delivered strong sales growth as benefits from acquisitions completed in 2021, steady engine P&A sales in the US and strong OEM sales from our Advanced Systems Group helped to offset headwinds related to early quarter poor weather in certain northern locations, supply chain constraints in our distribution businesses and retailers returning to more normal stocking patterns. On a year-to-date basis, Brunswick has also delivered record results, including over $3.5 billion of net sales, $568 million of operating earnings and $5.35 of diluted EPS, which is higher than any previous full year in Brunswick's history aside from last year. You'll note that we have shown comparisons to 2019 on these two slides to highlight the strong growth CAGRs over the last three years and the record performance of the business versus the second quarter of last year, which was the previous best quarter in company history. Revenue increased 13% versus the second quarter of 2021 as continued strong global demand for all product categories resulted in increased sales volume, which continues to be enabled by increased production levels. Segment operating earnings and margin growth were enabled by the increased sales volumes, together with operational efficiencies and positive mix, partially offset by inefficiencies resulting from supply chain disruptions, inflation pressures, and the production ramp-up of the new Boston Whaler Flagler facility, which will be substantially complete by the end of the third quarter. I think one of the metrics that's worth looking at is on a kind of a same-store base, if you like, or same location basis, membership growth in the second quarter of this year was up 30% versus last year, which indicates a lot of strength. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question."
}