{
    "symbol": "BC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 15:07:06",
    "content": " Despite some supply chain shortages earlier in the quarter, our Propulsion business delivered exceptional results with 17% top-line growth versus fourth quarter 2021, enabled by favorable product mix and pricing actions taken earlier in the year. Brunswickâ\u0080\u0099s boat retail unit performance in the fourth quarter and fullâ\u0080\u0090year was broadly consistent with the overall market performance, with outperformance in recreational fiberglass products and premium pontoons and underperformance in value aluminum, where we continue to focus successfully on margin maintenance and expansion, and have shifted production to higher margin product lines at the recent expense of some unit share of value aluminum product. All segments contributed to the strong operating earnings and margin growth versus the fourth quarter of 2021, with the net sales growth, coupled with prudent cost containment efforts, partially offset by continued elevated inflationary pressures and spending on growth initiatives, ACES, and new product technology. Lastly, we delivered free cash flow of $193 million in the fourth quarter, which equates to a FCF conversion of 133% On a fullâ\u0080\u0090year basis, Brunswick has also delivered record results, including net sales of over $6.8 billion and adjusted diluted EPS of $10.03. Revenue increased 17% versus the fourth quarter of 2021 as higher sales were driven by continued gains in global sales volume, favorable product mix, and higher prices as compared to prior year. Operating margins were up 90 basis points and operating earnings up 24%, each enabled by the increased sales and lower operating expenses, slightly offset by higher inflationary costs and investments in new products and capacity expansion. Our parts and accessories business leveraged strong operating margin performance to drive earnings growth versus the fourth quarter of 2021 despite sales being down 8%, or down 5% on a constant currency basis. For the full-year, despite the U.S. retail boat market being down midâ\u0080\u0090teens percent, our total P&A business net sales were down less than 1% once you remove the impact of currency and acquisitions, or still 21% higher than 2020 and 32% higher than 2019, all reinforcing the stability of this annuityâ\u0080\u0090based business. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}