{
    "symbol": "SKX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 20:49:06",
    "content": " Wholesale sales increased 16% year-over-year to $1.05 billion, representing 16% growth in both our domestic and international markets. Direct-to-consumer sales increased 11% year-over-year to $829.6 million, driven by 30% growth domestically from a triple-digit increase in e-commerce and a double-digit increase in our retail stores. In the Americas, sales for the fourth quarter increased 22% year-over-year to $925.6 million driven by double-digit growth across all channels, reflecting healthy consumer demand for our compelling product portfolio and improved inventory availability. In EMEA, sales increased 29% year-over-year to $413.7 million, driven by double-digit growth across all channels and in most countries, led by Germany and sales to our distributors. A China market recovery characterized by continued near-term challenges but improving steadily over the course of the year; a domestic wholesale marketplace gradually overcoming elevated inventory levels and supply chain constraints, resulting in declines in the first half of the year before returning to growth in the back half; a steady improvement to our distribution operating efficiency as expanded capacity and other remediation efforts bear fruit. Our effective tax rate for the year is expected to be between 19% and 20%; and we expect total capital expenditures to be between $300 million and $350 million as we continue to invest in our strategic priorities, including additional stores, added omnichannel capabilities and incremental distribution capacity in key markets like India, China, Chile and more. The past 30 years have been marked by unforgettable moments from our first store opening, first television commercial and first $1 billion in sales to now operating over 4,500 stores, collaborating with Martha Stewart and many others for our Comfort footwear, being named company of the Year by leading trade publication footwear news and achieving well over $7 billion in sales this year. Please proceed with your question. Please proceed with your question. We do think year-over -- sorry, quarter-over-quarter continues to be a lesser number how far below this quarter's $25 million is something we'll have to watch carefully. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}