{
    "symbol": "VC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 20:28:04",
    "content": " Adjusted EBITDA was $79 million or 9.3% of sales, an increase of $49 million compared to prior year due to higher production volumes and a strong commercial and operational discipline. Pricing, which is typically a modest headwind, increased sales by 20% compared to prior year as a result of customer recoveries, which includes a combination of lower annual price downs, higher average selling prices and onetime recoveries. Adjusted free cash flow was an outflow of $62 million in the quarter, resulting in an outflow of $99 million through the first half of the year. When compared to the first half of the year, we expect sales to be up in the second half driven by higher customer production volumes, partially offset by lower semiconductor open market purchases and the associated recoveries. At the midpoint of our guidance, we anticipate adjusted EBITDA will be higher than the first half of the year due to higher sales volumes and lower net semiconductor costs, partially offset by an increase in engineering spend. So essentially, we are talking just for the first half of the year about $100 million of open market purchases that we transferred back to our customers in terms of pricing. I think, Jerome, you mentioned that excluding recoveries from spot buys, basically, you're guiding to the second half similar to the first half, but I would have expected maybe a little bit of operating leverage going into the back half of the year because of higher industry volume. And if you remember, Emmanuel, we said that the 12% is predicated on achieving a sales of about $4 billion, and based on where we are today with the supply outlook for next year plus the redesigns, we see a path for us to get to that $4 billion next year, which should help us achieve our objective for EBITDA for next year. And you even sort of alluded to, right, in the first half, if you back out the pricing and sort of the related flow-throughs, it would have been more like 10% versus 9%, which I agree with, but that's on like an annualized first half number of $3 billion, again, if you take out the pricing."
}