{
    "symbol": "CASA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 19:42:05",
    "content": " Adding to this news, our multiyear $140 million TCV partnership with Verizon, that was announced in April 2022 to provide our 5G Cloud native software to power Verizonâ\u0080\u0099s public Mobile Edge computing and service offering remains on track, with Casa meeting all the key 2022 core deliveries and milestones called for in our contract with Verizon. We do believe revenue for the year will be somewhat back end weighted due to several factors, including the timing of our backlog shipments, supply chain consideration, anticipated timing of closing of deals in our sales pipeline, revenue recognition related to deferred revenue on the balance sheet, as well as the shipment of our 4G, 5G enterprise small cell radios in the second half of 2023 pursuant to closed supply contracts we now have. As disclosed in our January 31 release, we have several successful virtual CCAP RPD solutions in production deployments today, and during Q4 we are also awarded a large virtual CCAP deal with a major European cable MSO, with the initial delivery expected later in 2023, and we are focused on providing â\u0080\u0093 continuing to provide best in class solutions to cable MSO globally, just like we've done for the past 20 years. Finally, we entered 2023 with approximately $153 million in backlog product and service orders, including 2023 scheduled Verizon 5G MEC contract billings, bringing our total backlog, on balance sheet deferred revenue and the remaining $96 million of future billings under the Verizon contract in 2024 and beyond to approximately $286 million. Further, we have approximately $55 million of closed contracted business for our 4G, 5G enterprise small cell radios with a major North American mobile network operator, where we get POs on an annual as ordered basis, which is not included in the backlog and deferred revenue numbers I just mentioned. Given the initial potential exposure was approximately $56 million as disclosed in our Q2 2022 10-Q, we're very pleased with this final amicable outcome with this important customer, and related to this we also implement a new QA control procedures with the supplier and we'll be receiving increased future product discounts from the supplier based on the settlement we consummated with the supplier in March 2023, which will further improve the net economics to Casa for this now resolved matter. And we ended 2022 on the receivable side with a strong accounts receivable balance of approximately $75 million, which is up more than 50% from the prior quarter and which bodes well for Q1 cash flow as we entered 2023. So we entered 2023 with $153 million in backlog product and service orders, including the contracted 2023 billings under the Verizon 5G Mobile Edge computing contract, and that brings our total backlog deferred revenue and the remaining $96 million of future billings under the Verizon MEC contract for 2024 and beyond to roughly $286 million."
}