{
    "symbol": "CASA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 05:38:06",
    "content": " These bookings reflect $20 million from Verizonâ\u0080\u0099s 5G public MEC purchase orders in Q2, as well as many other booking awards, across all geos, during the quarter, including a quarter end order for $11.5 million from an increasingly active U.S.-based CSP customer for one of our access device products. Regarding financial details for the quarter, as Jerry mentioned, from an overall perspective, Q2 was actually a positive and very eventful quarter for Casa with the licensed deal for cloud native 5G SA MEC software with Verizon with up to $140 million TCV value, coupled with the $40 million 9.9% minority equity investment from Verizon, being the major highlight of the quarter, as announced on April 18. And as Jerry mentioned, while we did get $20 million in non-cancelable, nonrefundable POs from Verizon in Q2, which will be fully paid in Q3, these Q2 GAAP revenue results only include $5 million of software revenue for the quarter. Breaking down the revenue across our product lines in customary format, which most on this call are familiar with, second quarter wireless revenues were $28.5 million, down from Q2, 2021, but up $6 million, or 27% from Q1, 2022. With the lower than expected gross margin results in Q2, primarily due to non-cash inventory and warranty related charges of approximately $4.7 million, as a result of some end of life announcements and changes to future sales estimates for some inventory items, as well as to a lesser extent, revenue mix issues with wireless and cable revenues, along with other factors, on a pro forma basis, if you exclude that $4.7 million non-cash inventory charge in Q2, gross margins would have been $31.3 million, or approximately 44% of revenue, within the quarter. Regarding our operating loss for the quarter, similar to Q1, 2022, the operating loss was $18.1 million with the beneficial impact of higher Q2 revenue levels, including higher software revenues, offset by a like amount of inventory charges, within the quarter."
}