{
    "symbol": "CDMO",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-06 19:50:06",
    "content": " Revenues for the second quarter of fiscal â\u0080\u009823 were $34.8 million, representing a 33% increase compared to $26.1 million recorded in the prior year period. For the first six months of fiscal â\u0080\u009823, revenues were $71.4 million, a 26% increase compared to $56.9 million in the prior year period. Total SG&A expenses for the second quarter of fiscal â\u0080\u009823 were $6.8 million, an increase of 36% compared to $5 million recorded in the second quarter of fiscal â\u0080\u009822. SG&A expenses for the first six months of fiscal â\u0080\u009823 were $13.2 million, an increase of 39% compared to $9.5 million recorded in the prior year period. For the second quarter of fiscal â\u0080\u009823, the Company recorded a net loss of $1.2 million or $0.02 per basic and diluted share as compared to a net income of $3.5 million or $0.06 per basic and diluted share for the second quarter of fiscal â\u0080\u009822. For the first six months of fiscal â\u0080\u009823, the Company recorded net income of $400,000 or $0.01 per basic and diluted share, as compared to net income of $9.8 million or $0.16 and $0.15 per basic and diluted share respectively, during the prior year period. For the second quarter and the first six months of fiscal â\u0080\u009823, the Company achieved an adjusted EBITDA of $1.9 million and $8.1 million, respectively. During the second quarter, our team signed $26 million in net new project orders, bringing the total new business for the first six months of this fiscal year to $67 million. Our backlog at the end of the quarter was $147 million, representing a 23% increase compared to the backlog of $120 million at the end of the second quarter of fiscal â\u0080\u009822. In the first six months of fiscal 2023, our revenues of $71.4 million represented 26% increase compared to the same prior year period. Nick, it sounds like client interest continues to be strong, but the $26 million, you signed a new business in the quarter, is lower than it had been running at."
}