{
    "symbol": "CDMO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-06 21:57:08",
    "content": " During the first quarter, we initiated equipment validation in our Myford South facility and continue to advance construction of our cell and gene therapy facility, which included launching our analytical and process development capabilities for this business. During the period, we also announced the expansion of our process development capabilities for the mammalian cell business, which we expect to come online, in quarter one of calendar 2023. Revenues for the first quarter of fiscal â\u0080\u009823 were $36.7 million, representing a 19% increase compared to $30.8 million recorded in the prior year period. Gross margin for the first quarter of fiscal â\u0080\u009823 was 25% compared to a gross margin of 37% for the first quarter of fiscal â\u0080\u009822, which benefited from the receipt of unutilized capacity fees of $3.3 million. Factors impacting the gross margin for the first quarter of fiscal â\u0080\u009823 were primarily from increases in cost associated with the growth of our business and our facility expansions, including compensation and benefit expenses as well as increases in facility and related expenses partially offset by higher revenues during the period. Excluding the prior yearâ\u0080\u0099s margin benefit from unutilized capacity fees and the current quarterâ\u0080\u0099s increase in cost associated with the establishment of our cell and gene therapy business and ahead of our mammalian capacity expansion, including the companyâ\u0080\u0099s increasing headcount and incremental depreciation from recently released facility extensions. For the first quarter of fiscal â\u0080\u009823, the company recorded net income of $1.6 million or $0.03 per basic and $0.02 per diluted share, which for the first time starting in fiscal â\u0080\u009823, includes the provision for income taxes as reported within the companyâ\u0080\u0099s income statement as compared to a net income of $6.3 million or $0.10 per basic and diluted share for the first quarter of fiscal â\u0080\u009822. During the first quarter, the company achieved an important milestone with respect to our cell and gene therapy expansion with the launch of our analytical and process development capabilities for this business."
}