{
    "symbol": "DOCS",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-09 20:47:12",
    "content": " Adjusted EBITDA for the third quarter was $55.5 million, and adjusted EBITDA margin was 48.2%, a new record compared to $47 million and a 48% margin in the prior year period. We generated free cash flow in the third quarter of $47.5 million compared to $25.6 million in the prior year period, an increase of 85% year-over-year as we continue to run a very profitable high cash-generating business. For the full fiscal year, we're revising our revenue guidance to $417.7 million to $418.7 million, representing 22% growth at the midpoint. As we look ahead to next year, we are providing a preliminary outlook for fiscal 2024 of greater than $500 million in revenue and at least 43% adjusted EBITDA margins. Your line is open. However, as you heard here in our prepared remarks, given we sold a greater mix of new products than expected, and we faced delays getting these new products live, this counterbalance the increase in revenue conversion from our operational efficiencies, and we ended up not seeing a material change in our overall revenue conversion rate from Q3 deals, which is the primary reason for the revised guidance you're seeing here. As we move forward, and we're getting a better handle on what post-pandemic buying looks like for our customers at this increased scale that we're at now, we are actually starting to see a pattern emerge where we do see a step down around annual launches, but it's now occurring in our fiscal Q4 instead of our Q1 as we get more efficient with launches and our customers are getting stricter on running programs from calendar year start to calendar year end. Your line is open. Your line is open. So if I just look at the difference between where guidance was last quarter and this, it's about a $10 million push, when we think about, I think, as Jeff mentioned, that revenues booked, not lost, just timing, I want to make sure that you're not implying that there's a $10 million sequential increase in the June quarter, and then you build from there. Your line is open. So when you actually look at our holistic revenue conversion rates from Q3 programs in fiscal 2023, it ended up being essentially flat versus last year because these new product delays counterbalanced the increase in operational efficiency on our core products. Your line is open. So I think my best proof point for you is going back to the prepared remarks where I said as we sit here today, we have a higher percentage of the $500 million preliminary guidance under contract than we did at this point last year for the final $418.2 million midpoint for fiscal 2023. Your line is open. Your line is open. Your line is open. Your line is open. And I think that comes up and shows that we're still an organic rule of 60-plus company this year, right, giving guidance here for 20% top line growth, again, in a very tough macro and 43% EBITDA margins based on a record 48% EBITDA margin last quarter. Your line is open. If you look over the last four quarters, three of them you've been surprised on a number of different things, and each one of them kind of sounds like it makes sense, but it -- we're getting a lot of questions about are they guiding conservatively or do they really have the level of visibility they think they have."
}