{
    "symbol": "CABO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:12:05",
    "content": " We remain encouraged by retention of our base with churn in the fourth quarter of 2022, in line with 2019 levels and data usage for our residential broadband services surging to new highs, translating to an increased sell-in and customer migration to higher-tiered service offerings. In total, residential and business data customers grew by approximately 13,200 or 3% on a sequential basis in the fourth quarter and more than 43,900 customers for the full-year 2022. Operating expenses were $112.6 million or 26.5% of revenues in the fourth quarter of 2022 compared to $119.9 million or 27.7% of revenues in the comparable quarter of the prior year, a 120 basis point improvement. Adjusted EBITDA was $233.2 million for the fourth quarter, an increase of 3.5% when compared to 2021. Our adjusted EBITDA margin for the fourth quarter of 2022 was 54.8%, a 270 basis point improvement compared to the prior year. Capital expenditures totaled $106.8 million for the fourth quarter of 2022, which equates to 45.8% of adjusted EBITDA. Adjusted EBITDA less capital expenditures was $126.4 million for the fourth quarter of 2022, an increase of 9.5% from the prior year quarter. For the full-year, adjusted EBITDA less capital expenditures was $497.8 million, an increase of 11.3% from the prior year. Your line is now open. Your line is now open. When you think about, obviously, where our product mix shift is, the higher growth, higher-margin residential data business services continues to be an organic driver of that improved margin, along with, obviously, than things like execution of our integration strategy and where we continue to take costs out of the business there, where we continue to take cost out of the business on what is still but even smaller video product where the programming expenses are a meaningful benefit to us in terms of our margin there. Your line is now open. Your line is now open. Your line is now open."
}