{
    "symbol": "MIND",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-13 11:16:10",
    "content": " If you would like to listen to a replay of todayâ\u0080\u0099s call, it will be available for 90 days via webcast by going to the Investor Relations section of the companyâ\u0080\u0099s website at mind-technology.com, or via recorded instant replay until September 20. Information reported on this call speaks only as of today, Tuesday, September 13, 2022 and therefore you are advised that time sensitive information may no longer be accurate as of the time of any replay listening or transcript reading. Before we begin, let me remind you that certain statements made by management during this call may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on managementâ\u0080\u0099s current expectations and include known and unknown risks, uncertainties and other factors, many of which the company is unable to predict or control, that may cause the companyâ\u0080\u0099s actual future results or performance to materially differ from any future results or performance expressed or implied by those statements. These risks and uncertainties include the risk factors disclosed by the company from time to time in its filings with the SEC, including its annual report on Form 10-K for the year ended January 31, 2022. Furthermore, as we start this call, please also refer to the statement regarding forward-looking statements incorporated in our press release issued yesterday, and please note that the contents of our conference call this morning are covered by these statements. Revenues were about $8.7 million, which is up 28% over last yearâ\u0080\u0099s second quarter and slightly below the first quarter revenues of $9.1 million. Importantly, our operating loss improved to approximately $1.6 million compared to $2.6 million in last yearâ\u0080\u0099s second quarter and $2.5 million in the first quarter this year. When compared to the first quarter of this year, we saw an improvement in gross margins coupled with lower selling, general and administrative expenses and lower research and development costs. As a company, we believe MIND is uniquely positioned to capitalize on the tailwinds that weâ\u0080\u0099re seeing in each of our key markets. Our marine survey business has also seen an uptick in interest resulting from those same high energy prices as attention shifts towards alternative forms of energy, such as wind farms. The ongoing global, geopolitical and security situation has also highlighted the need for our maritime security technology, therefore weâ\u0080\u0099re optimistic weâ\u0080\u0099ll continue to grow our book of business in the coming quarter as we look to execute on the growing demand. Our backlog as of July 31, 2022 was approximately $19.3 million, which is up from $13.1 million at the beginning of this fiscal year. As Iâ\u0080\u0099ve mentioned previously, we believe there is positive momentum in each of our three key markets - thatâ\u0080\u0099s exploration, defense and survey. Strength in global energy markets is driving demand in the exploration space as many of our customers are reporting improving metrics and, in some cases, looking to expand their fleets. In addition to our single beam and multi-beam side scan sonar systems, weâ\u0080\u0099re seeing much interest in our SeaLink towed streamer systems for these applications. We have recently experienced increased order activity particularly for our multi-beam side scan sonar systems, which we believe is related to these demands, and we also think this bodes well for our program to utilize our commercially developed towed seismic arrays at SeaLink as passive sonar arrays and anti-submarine warfare and other maritime security applications, particularly those for utilizing un-crewed platforms. As Rob mentioned earlier, revenues from continuing operations totaled $8.7 million in the quarter, a 28% increase when compared to the $6.8 million in the same period a year ago. Gross profit from continuing operations in the second quarter was $3.5 million, up approximately 59% when compared to the second quarter of fiscal 2022. This represents a gross profit margin of approximately 40% for the quarter, which is up from the 33% we achieved during the prior year second quarter and the 36% reported in the first quarter of this year. Our general and administrative expenses were $3.8 million for the second quarter of fiscal 2023, which was down from $4.3 million in our first quarter. As we mentioned last quarter, our G&A expenses tend to taper down as the year progresses. Our research and development expense was $844,000 for the second quarter, which was down nearly 17% sequentially. As of July 31, 2022, we had working capital of approximately $15.6 million and cash of approximately $833,000. Based on current delivery schedules, it is likely weâ\u0080\u0099ll see a fall-off in third quarter as compared to the second; however, we then expect significant improvement in the fourth quarter. Should those expectations be met, we believe MIND will report profitable fourth quarter with positive income from continuing operations. Again, we expect the second half to be better than the first, so we kind of did the math on that, so thatâ\u0080\u0099s definitely in the ballpark. Okay, and given--is it just a timing issue with Q3 and Q4, so the fact that you may be producing hypothetically a $14 million quarter in Q4, donâ\u0080\u0099t take that number and run with it, thatâ\u0080\u0099s just a function of Q3 and Q4, kind of not knowing how that timetable and schedule is going to be? Any time you have large orders or a big quarter expectation coming up, obviously you have the working capital requirements that are built into that. Just kind of give us that cash management and expectation to meet those requirements to fulfill those large orders without requiring capital, and if you do require capital, does that not necessitate being made whole on those preferred dividends, which you would like to do maybe early next year, so how does that tricky timetable work out that we want to be able to do those large contracts, but we may need capital to do so, which means that we really should be current on our preferred dividends? Youâ\u0080\u0099re right - managing liquidity is important for us right now because big orders do require capital, working capital to execute, so things weâ\u0080\u0099re looking to do is managing working capital - we still have significant working capital in the form of receivables and inventory, so weâ\u0080\u0099re able to monetize that to some degree. We also have some owned real estate that we think thereâ\u0080\u0099s some opportunities to monetize in a non-dilutive way, so those are kind of the top things. As youâ\u0080\u0099ve noted, we also consider do we go look for outside capital, so thatâ\u0080\u0099s something just out of prudence we want to consider and look at on a regular basis. As I said earlier, we definitely intend to reinstate those and get those current, again we just need to look at the timing of that as it factors into all these other issues. Your European JV status, obviously a lot of location-wise would dictate that youâ\u0080\u0099re probably utilizing that relationship with some of your European opportunities, especially with the geopolitical events that you talked about. There are benefits from the geopolitical situation in Europe that I think weâ\u0080\u0099re already starting to see, that theyâ\u0080\u0099re not necessarily tied directly to that relationship, so there are other opportunities for us outside of that as well. You also said that thereâ\u0080\u0099s a significant amount of what you would call high confidence that may not necessarily be in that number, but youâ\u0080\u0099re fairly certain or feeling good about. A lot of that, almost all of that, actually, will be going to next year, I would say, but itâ\u0080\u0099s a comparable number to what weâ\u0080\u0099re seeing in the backlog. And understand that thereâ\u0080\u0099s a whole litany of different probability and different size and timing of these orders, so things weâ\u0080\u0099re pursuing are early stage, others are a lot firmer in our mind, and the ones Iâ\u0080\u0099m trying to refer to are things that are much firmer in our mind. Obviously the backlog of 19.3 to be able to hit your revenue targets, that must be all that you anticipate being delivered this fiscal year? I think as far as any very large systems, especially on the seismic side, those will tend to go into next year just because of lead times for certain components, certain aspects of the systems. But yes, we certainly are able to have a book-and-bill business  - you know, spare parts, smaller systems, things like that, most definitely. You described that survey is really picking up, obviously defense given the climate weâ\u0080\u0099re in, is very positive, and then energy prices at maintained elevated levels. Obviously from our market position, we really had a strong position in the seismic side, the energy side, so weâ\u0080\u0099re seeing a lot of benefit there. I think the application of our SeaLink product in that area is really getting some interest right now, and of course weâ\u0080\u0099ve talked a lot about defense and thatâ\u0080\u0099s kind of across the board. It would seem to me that youâ\u0080\u0099d be better off to consider the strategic alternative of selling the company, as opposed to trying to issue equity at what would basically be such an incredibly low price, it would just dilute the hell out of your shareholders. Second, you commented on the idea of the towed array opportunities in defense using SeaLink and the like. Is that a concept that others, you know, defense agencies and other countries, perhaps, or in the U.S. have come to you and said, we think this works, or is this something you guys have looked at and said, maybe it works? Early on, I think itâ\u0080\u0099s something we looked at and said, hey, this might work because we have a commercially developed, robust system that could be applied in these or used in these applications. Whatâ\u0080\u0099s really driven it is the use of un-crewed or unmanned platforms for these sort of applications, so you have smaller systems, cheaper than a conventional or historical sonar array thatâ\u0080\u0099s going to be many millions of dollars, so itâ\u0080\u0099s a developing concept but one thatâ\u0080\u0099s getting a lot of traction and a lot of interest, not only in the U.S. but elsewhere as well. We actually did a demonstration two weeks ago with the U.S. Navy that weâ\u0080\u0099ll be receiving soon, so I think thereâ\u0080\u0099s a--thatâ\u0080\u0099s something that weâ\u0080\u0099ve not see any contribution yet from that, but I think thatâ\u0080\u0099s something that could be really interesting going down the road for us, really interesting. Conceptually, yes, but I think due to some technical issues, itâ\u0080\u0099s more likely to be applied on unmanned surface vessels initially. Also, while Tyson asked a question about the fourth quarter, basically probably in some ways better to look at the second half as a half, do you see this fourth quarter being strong enough to pull the second half overall into profitability, and do you believe that it sets the stage so that 2023 calendar year should be a year in which we actually see positive EBITDA and positive profits, in essence the company kinds of switches over from the perpetual loss building to the income generation phase? I think itâ\u0080\u0099s a closer call on that, but thatâ\u0080\u0099s certainly within the realm of possibility. I do think that thatâ\u0080\u0099s going to set the stage for a higher base level of business going forward, so weâ\u0080\u0099re going to get out of this, as you say, this perpetual loss. Iâ\u0080\u0099m not saying weâ\u0080\u0099re not going to have some ups and downs from quarter to quarter - thatâ\u0080\u0099s certainly going to be the case as long as you have large orders, but I think it is going to set the stage for recalibrating where we are. Donâ\u0080\u0099t know for sure, but I think as far as anything thatâ\u0080\u0099s near term that weâ\u0080\u0099re counting on, I donâ\u0080\u0099t see an issue there. Early hopes that you are right that we wander out of the desert into the land of profitability in â\u0080\u009923 - I think that would be something shareholders would--weâ\u0080\u0099ve been quite patient for a long time, it would be nice to reward that patience with tangible developments, so thank you very much and keep it up. Okay, Iâ\u0080\u0099d just like to thank everyone for joining us today and look forward to talking to you again at the end of our third quarter."
}