{
    "symbol": "CLS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 15:37:02",
    "content": " In addition, during this call we will refer to various non-IFRS financial measures, including ratios based on non-IFRS financial measures, consisting of operating earnings, operating margin, adjusted gross margin, adjusted return on invested capital or adjusted ROIC, free cash flow, gross debt to non-IFRS trailing 12-month adjusted EBITDA leverage ratio, adjusted net earnings, adjusted earnings per share or adjusted EPS, adjusted SG&A, Lifecycle Solutions revenue and adjusted effective tax rate. We delivered non-IFRS operating margin of 4.4%, 20 basis points ahead of the midpoint of our revenue and non-IFRS adjusted EPS guidance ranges, driven by strong performance in both segments. The year-over-year and sequential revenue growth in ATS was driven by continued strength in Capital Equipment, organic growth in our base Industrial business and a full quarter of revenue from PCI. Our HPS business delivered revenue of $362 million in the first quarter, up 81% year-over-year, led by demand strength and new program ramps with service providers, supported by continuing data center growth. Our non-IFRS adjusted effective tax rate for the first quarter was 19%, 2% lower year-over-year but 3% higher sequentially. For the first quarter, non-IFRS adjusted net earnings were $48 million, up $20 million year-over-year and down $7 million sequentially. If the midpoint of our revenue and non-IFRS adjusted EPS guidance ranges are achieved, non-IFRS operating margin would be approximately 4.6%, an increase of 70 basis points year-over-year and an increase of 20 basis points sequentially. In CCS, we anticipate our Communications end market revenue to be up in the low-double-digit percentage range year-over-year, driven by strong demand from service provider customers, supported by our HPS business. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}