{
    "symbol": "CLS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 14:08:02",
    "content": " In addition, during this call, we will refer to various non-IFRS financial measures including ratios based on non-IFRS financial measures, consisting of non-IFRS operating earnings, non-IFRS operating margin, adjusted gross margin, adjusted return on invested capital or adjusted ROIC, adjusted free cash flow, gross debt to non-IFRS trailing 12-month adjusted EBITDA leverage ratio, adjusted net earnings, adjusted earnings per share or adjusted EPS, adjusted SG&A, Lifecycle Solutions revenue, and adjusted effective tax rate. Given the solid demand backdrop across our businesses, and our demonstrated ability to navigate the present challenges, we are pleased to raise our full year 2022 guidance to $6.7 billion or more in revenue, and tighten our non-IFRS adjusted EPS range to between $1.65 and $1.75. Our CCS segment delivered another strong quarter with revenue up 19% year-over-year driven by strength from our Communications and Enterprise Markets, led by our HPS business. Our HPS business delivered revenue of $459 million in the second quarter, up 52% year-over-year, driven by strong demand and new program ramps with service providers, supported by continuing capital investment in data centers. For the second quarter, non-IFRS adjusted net earnings were $54 million, up $16 million year-over-year and up $6 million sequentially. As of the second quarter, our cash deposits were up over $300 million year-over-year, more than 150% increase. Non-IFRS adjusted free cash flow was $43.3 million in the second quarter, compared to $31.2 million in the prior year period, and $0.5 million last quarter. Our cash balance at the end of the second quarter was $365 million, down $102 million year-over-year and up $90 million sequentially. Itâ\u0080\u0099s the midpoint of our revenue and non-IFRS adjusted EPS guidance ranges are achieved non-IFRS operating margin would be approximately 4.8%, an increase of 60 basis points year-over-year and flat sequentially. Our HPS business continues to perform remarkably well recording 64% growth year-to-date, compared to the prior year period, and achieving approximately $820 million in revenue in the first half of 2022 with strong margins."
}