{
    "symbol": "CLS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 10:43:05",
    "content": " In addition, during this call, we will refer to various non-IFRS financial measures including ratios based on non-IFRS financial measures, consisting of non-IFRS operating earnings, non-IFRS operating margin, adjusted gross margin, adjusted return on invested capital or adjusted ROIC, adjusted free cash flow, gross debt to non-IFRS trailing 12-month adjusted EBITDA leverage ratio, adjusted net earnings, adjusted earnings per share or adjusted EPS, adjusted SG&A expense, Lifecycle Solutions revenue, and adjusted effective tax rate. Our strong CCS performance continues to be driven in large part by our HPS business, which achieved revenues of $1.83 billion in 2022, representing 59% year-over-year revenue growth. Non-IFRS adjusted earnings per share were $0.56 for the fourth quarter, above the high end of our guidance range and up $0.12 year-over-year, driven by higher volumes and improved mix. Our HPS business continues to deliver strong results recording revenues of $491 million in the fourth quarter, up 40% year-over-year. Communications end market revenue was up 34% year-over-year just ahead of our expectations of a low-30s percentage increase, driven by program ramps in our HPS business and improved materials availability. Enterprise end market revenue in the quarter was up 49% year-over-year, well above our expectations of a mid-20s percentage increase, driven primarily by new RAC (ph) programs, increased demand in compute and improved materials availability. We continue to work collaboratively with our customers to help fund the growth in inventory as evidenced by over $800 million in customer cash deposits at the end of the fourth quarter, an increase of approximately $200 million sequentially and nearly $400 million year-over-year. In our ATS end markets, we anticipate revenue to be up in the low-single digit percentage range year-over-year, driven by double-digit growth in Industrial and A&D, partially offset by softer demand in capital equipment. In our CCS segment, we anticipate revenues in our communication end market to be up in the high-teens percentage range year-over-year, driven by continued strong demand from service provider customers, supported by our HPS offering. In our ATS segment, our industrial business continues to post strong results with 24% organic growth in 2022 compared to 2021 with sequential improvement in each quarter throughout the year."
}