{
    "symbol": "CLS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 14:43:18",
    "content": " In the third quarter, Celestica achieved revenue of $1.92 billion above the high end of our guidance range on the back of strong demand across the majority of our businesses combined with solid execution by our team. The year-over-year growth in ATS segment revenue was driven by the continued strong performance of our Capital Equipment, Industrial and A&D businesses supported by solid demand, new program ramps and improved material availability. Our CCS segment delivered another quarter of strong growth with revenue up 32% year-over-year driven by strengthen our Communications end market, primarily due to the strong performance in our HPS business. Our HPS business continued to exhibit very strong growth, delivering revenue of $517 million in the third quarter, up 72% year-over-year. Enterprise revenue in the quarter was up 13% year-over-year, close to our mid-teens percentage expectations driven by increased customer demand and new program ramps. For the third quarter, non-IFRS adjusted net earnings were $64 million, up $20 million year-over-year and up $9 million sequentially. As of September 30, non-IFRS adjusted free cash flow was $51 million and our fiscal year outlook continues to be $75 million as we make strategic working capital investments in 2022. If the midpoint of our revenue and non-IFRS adjusted EPS guidance ranges are achieved, non-IFRS operating margin would be approximately 5.1%, which would represent an increase of 20 basis points over the prior year period and flat sequentially. In our ATS end market, we anticipate revenue to be up in the mid-20% range year-over-year, driven by double-digit growth in all of our ATS businesses. In our CCS segment, we anticipate revenues in our Communications end market to be up in the low-30% range year-over-year, driven by new ramps and continued strong demand from service provider customers supported by our HPS offering. In our Enterprise end market, we anticipate revenue growth in the mid-20% range year-over-year supported by new program ramps in storage and strong demand in compute. Our HPS business remains the primary driver of the strong results in our CCS segment, recording $1.34 billion in revenue for the first 9 months of the year, a 67% growth rate compared to that of the prior year period."
}