{
    "symbol": "NKE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-21 20:47:04",
    "content": " Looking at Q3, NIKE's growth was and it will continue to be the result of 3 areas I'll touch on today: first, connecting with consumers through our strong portfolio of brands; second, driving a relentless flow of new product innovation; and third, expanding our digital advantage to create the marketplace of the future. NIKE Direct grew 27% versus the prior year, led by NIKE Digital delivering industry-leading growth, increasing 33% versus the prior year, driven by double-digit growth in traffic, strong growth in new members and member engagement and improvements in member buying frequency. And then NIKE Direct, our own mono-brand stores, will continue to play a role, an increased role, in particular, focusing on a couple of areas of the market where we feel like there's incremental need to reach the consumer, particularly around women's, around apparel, and as Matt mentioned, around Jordan. And to create the marketplace of the future, both through digital, our owned stores and our partners, it's going to require us to also invest with our partners in their consumer experiences so that the consumer has a premium consistent experience as they move across the marketplace and can find the NIKE product when and where they want it. And while in the short term, we might see some normalization as inventory supply starts to flow, some normalization of channels because wholesale has had a little less product over the last couple of quarters to the normalization of full price because with lack of supply, we've got a couple of our geographies with full price realization that's well above our definition of 65% for full marketplace health. And to us, it's a signal of the strength of our brand and the fact that the consumer continues to choose this channel to engage, the fact that the app downloads have increased on a quarter-over-quarter basis, the fact that we're seeing the app drive a greater proportion of our overall business connects membership. And the way that we're going to try to connect membership into the marketplace, we continue to feel very strong that Consumer Direct Acceleration led by Digital is what's going to drive us towards that fiscal year '25 goal."
}