{
    "symbol": "GAMB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 21:55:04",
    "content": " Revenue grew 94% to $19.6 million, with almost 300% growth in North America revenue. With this revenue growth, we generated $6.4 million of adjusted EBITDA and $4.9 million in free cash flow. After growing more than 500% year-over-year last quarter, North American revenue grew nearly 300% year-over-year to $9.1 million in the third quarter. On a constant currency basis, revenue of $19.6 million increased 128%, compared to the prior year or 94% inclusive of currency headwinds that impacted reported revenue by $1.5 million. On a constant currency basis, adjusted operating expenses increased by $8.6 million. Adjusted for fair value movements in contingent and deferred consideration, adjusted net income in the quarter was $6 million and adjusted earnings per share was $0.16 per diluted share. We generated third quarter adjusted EBITDA of $6.4 million, compared to $4.9 million in the prior year. Adjusted EBITDA margin was 33%, compared to 48% in 2021, reflecting the increased operating expenses from our investments in the organization to drive organic growth, as well as the inclusion in our revenue mix of the lower margin profile of RotoWire.com and the McClatchy partnership. Total cash generated from operations of $5.6 million increased from $1.4 million in Q3, driven -- in Q3 2021 driven by strong year-over-year revenue growth. Turning to the financial results for the first nine months of the year, revenue grew 94% on a constant currency basis to $55.2 million or 72% inclusive of a $3.7 million impact from currency headwinds. Adjusted EBITDA increased by 7% to $17.2 million, reflecting an adjusted EBITDA margin of 31%. Given these factors and notwithstanding adverse currency movements, we are reiterating our 2022 guidance for revenue in the range of $71 million to $76 million, representing growth of 68% to 80% and adjusted EBITDA between $22 million and $27 million, representing growth of 20% to 47%."
}