{
    "symbol": "PAGS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 22:03:11",
    "content": " Our investment philosophy to balancing growth and profitability while keeping a disciplined capital allocation led us to report the highest EPS in PAGSâ\u0080\u0099 history, 36% higher than the same period of 2021; strong revenue growth above 20% versus 4Q21, reaching almost BRL4 billion; cash earnings of BRL410 million, almost 4x higher than 4Q21; and BRL9.8 billion in net cash position, further boosted by our efficiencies in OpEx and CapEx. Gross profit of BRL131 million, 70% higher than 4Q21 and 3Q22; 28 million clients accounting for BRL21 billion in deposits; and BRL2.7 billion in credit portfolio, with increasing exposure to secured products. Finally, our two-sided ecosystem, which is just in the early stages to fully explore synergies related to lower transaction costs and lower cost of funding through our closed loop, led to more than BRL200 billion in TPV, PagBank and PagSeguro; 10% in market share of PIX transactions; and new features to further increase our cross-selling with clients, SMB Payroll Platform and Automatic Savings from account balance. Gross profit totaled BRL5.5 billion, an increase of 19% year-over-year, even with a significant increase of almost 4x in financial expenses and with total losses growing 48% over the year, due to additional provision for delinquency on credit products. Moving to Slide 13, PAGSâ\u0080\u0099 TPV grew 19% year-over-year, totaling BRL94.3 billion during the quarter, better-than-expected, given the negative impact of the Soccer World Cup on business days and credit limits constraint in Brazil, but with a good performance on holidays. In the slide 14, PAGSâ\u0080\u0099 TPV reached BRL115 billion in Q4 2022, ] higher than Q4 2021, reinforcing the customerâ\u0080\u0099s engagement on PagBank account that resulted on a strong deposits growth and increase of cash-out through day-to-day banking services. PagBankâ\u0080\u0099s total revenue grew 7% year-over-year, ending the quarter at BRL329 million, and slightly lower than Q3 because of our focus on secured credit products, which have lower APRs and longer duration in comparison to unsecured products. Looking ahead, our main focus are: grow profitably in payments and keep increasing our market share in key segments; foster PagBank engagement to diversify revenues and increase revenue per customer; develop our two-sided ecosystem, providing a unique and superior value proposition; improve models and processes to reduce losses and costs; and execute disciplined capital management to improve EPS and cash flow generation. So, in less than 4 years, we were the second largest bank â\u0080\u0093 digital bank in Brazil, and it's kind of natural, then we have this level of clients or the level of business the growth might slow down a little bit, but we expect to keep growing net adds PagBank in 2023."
}