{
    "symbol": "HQI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 12:25:54",
    "content": " Franchise royalties grew 32.5% to $7.2 million, and organic franchise royalties grew 40.7% compared to the second quarter of 2021. This revenue growth resulted in another quarter of strong profitability for the business with adjusted EBITDA of $5.9 million, a 34.2% increase from the second quarter of 2021. As Rick mentioned, total revenues for the second quarter were $9.3 million compared to $5.7 million for the same quarter last year, an increase of 62.8%. System-wide sales for the quarter were $120 million compared to $89.7 million for the same period in 2021, an increase of 33.7%. In connection with the Q1 acquisitions, we recorded a $1.3 million accounting benefit in the second quarter related to adjustments in the fair value allocation after we completed independent valuations. This quarter, we realized our second consecutive period of record adjusted EBITDA, generating $5.9 million compared to $4.4 million in the second quarter of last year. Since the facility was finalized in the second quarter of 2021, we have closed 5 acquisitions with aggregate consideration of $27.1 million and finished the second quarter with just a modest balance of $2.8 million on the credit facility and $1.3 million in seller financing. The question is about M&A and understanding you're integrating a couple acquisitions right now, but I think there was some comment last quarter that if we see another quarter of negative GDP, companies -- people are going to be running for the exits and looking to sell, and that's going to be good for you. That said, business is really -- has been strong, obviously, as indicated by $120 million of system-wide sales in the second quarter. I really didn't want to say it because it's so new, but we did actually this quarter hire -- this quarter, meaning the third quarter, hired a person who is going to work at least part time, on selling franchises and basically to people from the outside."
}