{
    "symbol": "HQI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 17:39:17",
    "content": " Franchise royalties grew 102% to $6.6 million, and organic franchise royalties grew 30% compared to the first quarter of 2021. This revenue growth and the operating leverage of our business model resulted in a record quarterly adjusted EBITDA of $5.3 million, a 246% increase from the first quarter of 2021. So while reported income -- net income was $603,000 or $0.04 a share, excluding the $3.6 million charge and related tax effects, net income for the first quarter would have been significantly higher. Total revenue for the first quarter was $8.1 million compared to $3.4 million for the same quarter last year, an increase of 139.4%. Franchise royalties for the quarter were $6.6 million compared to $3.3 million last year, an increase of 101.7%. There were $1.4 million of acquisition-related SG&A costs in 2021, and our workers' compensation expense decreased by almost $800,000 in the first quarter of 2022 compared to last year. Net income for the quarter was $603,000 or $0.04 per basic and diluted share compared to net income of $3.7 million or $0.28 per basic share and $0.27 per diluted share in the first quarter last year. At March 31, we had approximately $19.2 million in availability under our credit facility even after the 3 acquisitions completed in the first quarter. Since the facility was finalized in the second quarter of 2021, we have closed 5 acquisitions with aggregate consideration of $26.9 million and finished the first quarter with a modest balance of $5.5 million on the credit facility and $1.5 million in seller financing. And so I would point out that, for example, we exceeded $100 million in system-wide sales in the first quarter which, as you noted and as we've said in the past, is our weakest quarter. And in the last earnings call, obviously -- I clarified that there was going to be some noise in the first quarter, and $3.6 million of pretax charges is certainly a lot of noise."
}