{
    "symbol": "GPN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 12:55:30",
    "content": " Turning to Issuer Solutions, this business delivered $489 million in adjusted net revenue, which is a 6% improvement on a constant currency basis from the third quarter of 2021, including Netspend's B2B assets in both periods. Please proceed with your question. Please proceed with your question. But if we think about the long-term trajectory of the business, swapping out the consumer business for EVO, a business with better revenue growth potential, better margin profile, and obviously a strong kind of earnings contributor over time when we get to full run rate synergies, we feel like it's a very good better positioning of the business for lack of a better term for the long run. We really do emphasize making sure that we're growing in a way that has flowed through to profitability that allows us to continue to expand margin, the mix of our business, particularly in merchant towards more technology enablement, software, et cetera, to Jeff's earlier comment, positions us well to continue to drive obviously attractive margin expansion in the business. Please proceed with your question. Please proceed with your question. I would say, in addition to B2B on the revenue side, I think we're particularly excited about the prospects of bringing our product particularly our commerce enablement solutions to EVO's international markets into the U.S. portfolio as well. Please proceed with your question. Please proceed with your question. But I think for the time being, it's really driven by 11% fundamental growth in merchants, 6% fundamental growth in issuer if we keep doing that, we're going to keep expanding margins. So if you think about the B2B strategy, I'd break it down into its individual building blocks because ultimately, end of day, what we're trying to achieve is sort of fully integrated B2B offering, where we have software at the heart of our ability to provide accounts payable, accounts receivable solutions with money and money outflows for largely mid-market customers and obviously, enterprise customers to the extent we want to scale into that market as well. Please proceed with your question."
}