{
    "symbol": "LMNR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-07 19:58:01",
    "content": " This new marketing plan combined with our recent investments that enabled us to increase our revenue by over 200% from $54 million in 2010 to over $166 million in fiscal year 2021, which equates to an 11% CAGR. Today, we have over 15,400 acres of rich agricultural lands, real estate properties and water rights in California, Arizona, Chile and Argentina with a fair market value of over $600 million in today's market, yet a book value on Limoneira's balance sheet of $220 million because many of these assets were acquired many years ago at a low basis. For the second quarter of fiscal year 2022, total net revenue was $46.8 million compared to total net revenue of $45.1 million in the second quarter of the previous fiscal year. Approximately $1,552,000 cartons of fresh lemons were sold during the second quarter of fiscal year 2022 at a $17.57 average price per carton compared to approximately $1,528,000 cartons sold at $18.79 average price per carton during the second quarter of fiscal year 2021. Approximately 1,877,000 pound of avocados were sold during the second quarter of fiscal year 2022 at a $1.90 average price per pound compared to approximately 2,142,000 pounds sold at $1.26 average price per pound during the second quarter of fiscal year 2021. Approximately 328,000 carton of oranges were sold during the second quarter of fiscal year 2022 at a $7.98, average price per carton, compared to approximately 154,000 cartons sold at a $9.12 average price per carton in the prior year period. The increase in operating cost was primarily attributable to the company's agribusiness associated with an increase in packing and growing costs, partially offset by decreases in third-party grower and supplier cost in the second quarter of fiscal year 2022. Long-term debt as of April 30, 2022 was $135.6 million compared to $130.4 million at the end of fiscal year 2021. The breakdown of annual cash flow is expected from Harvest at Limoneira is as follows: fiscal year 2022 is expected to generate $8 million of cash to Limoneira, fiscal year 2023 is expected to generate $15 million, fiscal year 2024 is expected to generate $27 million, fiscal year 2025 is expected to generate $30 million, and fiscal year 2026 is expected to generate $15 million."
}