{
    "symbol": "LMNR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-08 20:18:03",
    "content": " In addition, our avocados segment has continued to outperform expectations, with pricing almost doubling year-over-year resulting in record revenues of $12.6 million in the third quarter of 2022. We also reiterated today that we expect to receive approximately $95 million over the next 5 years from harvest at Limoneira, beginning this year with $8 million expected in the fourth quarter of fiscal year 2022. We believe this updated strategic plan will result in an asset lighter business model, a dramatic debt reduction, reduce volatility and an increase in EBITDA and earnings per share, higher returns on invested capital and increase in our quarterly dividend, higher ESG scores, expansion of global fruit packaged and marketed by Limoneira, and lastly, an increase in the packaging and marketing of avocado production. For the third quarter of fiscal year 2022, total net revenue was $58.9 million, compared to net revenue of $49.1 million in the third quarter of the previous fiscal year. Agribusiness revenue for the third quarter of fiscal year 2022 includes $27.8 million in fresh lemon sales, compared to $24.4 million during the same period of fiscal year 2021. Approximately 1,512,000 cartons of fresh lemons were sold during the third quarter of fiscal year 2022 and an $18.39 average price per carton, compared to approximately 1,144,000 cartons sold at a $21.34 average price per carton during the third quarter of fiscal year 2021. Approximately 5.7 million pounds of avocados were sold during the third quarter of fiscal year 2022 at a $2.21 average price per pound, compared to approximately 3.5 million pounds sold at a $1.16 average price per pound during the third quarter of 2021. Approximately 209,000 cartons of oranges were sold during the third quarter of fiscal year 2022 at a $17.88 average price per carton, compared to 259,000 cartons sold at a $7.65 average price per carton in the prior year period. Operating income for the third quarter of fiscal year 2022 increased to $11.1 million, compared to income of $3.4 million in the third quarter of the previous fiscal year. Net income applicable to common stock after preferred dividends for the third quarter of fiscal year 2022 was $7.3 million, compared to net income of $3.6 million in the third quarter of fiscal year 2021. Adjusted net income for diluted EPS for the third quarter of fiscal year 2022 was $7.5 million, compared to $3.7 million in the same period of fiscal year 2021. We continue to expect to receive $95 million from harvest at Limoneira during the next five fiscal years, beginning in fiscal year 2022, which includes $8 million during the fourth quarter of this fiscal year. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}