{
    "symbol": "LMNR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-22 21:15:02",
    "content": " I am pleased to report that our diversified portfolio of revenue drivers enabled us to achieve record revenue in fiscal year 2022, growing our top line by 11% to $184.6 million and generating $11.9 million of adjusted EBITDA. For the fourth quarter of fiscal year 2022, total net revenue was $39.7 million compared to total net revenue of $33.5 million in the fourth quarter of the previous fiscal year. Agribusiness revenue for the fourth quarter of fiscal year 2022 includes $13.1 million in fresh lemon sales compared to $7.8 million during the same period of fiscal year 2021. Approximately 680,000 cartons of fresh lemons were sold during the fourth quarter of fiscal year 2022 at a $19.33 average price per carton compared to approximately 390,000 cartons sold at a $20 average price per carton during the fourth quarter of fiscal year 2021. The company recognized $16.4 million of brokered fruit sales in the fourth quarter of fiscal year 2022 compared to $17.4 million in the same period last year. Approximately 583 cartons of brokered fruit were sold during the fourth quarter of fiscal year 2022 at a $28.13 average price per carton compared to approximately 941,000 cartons sold at an $18.44 average price per carton during the fourth quarter of fiscal year 2021. The company recognized $2.7 million of orange revenue in the fourth quarter of fiscal year 2022 compared to nominal orange revenue in the same period of fiscal year 2021. Approximately 86,000 cartons of oranges were sold during the fourth quarter of fiscal year 2022 at a $31.22 average price per carton. Specialty citrus and other crop revenues increased to $5.5 million in the fourth quarter of fiscal year 2022 compared to $3.2 million in the fourth quarter of fiscal year 2021. Operating loss for the fourth quarter of fiscal year 2022 improved to $1.9 million compared to a loss of $6.5 million in the fourth quarter of the previous fiscal year. Net loss applicable to common stock after preferred dividends for the fourth quarter of fiscal year 2022 was $2.8 million compared to a net loss of $5 million in the fourth quarter of fiscal year 2021. Net loss per diluted share for the fourth quarter of fiscal year 2022 was $0.16 compared to a net loss per diluted share of $0.28 for the same period of fiscal year 2021. Adjusted net loss per diluted EPS for the fourth quarter of fiscal year 2022 was $5.7 million compared to a loss of $4.5 million in the same period of fiscal year 2021. Adjusted EBITDA was a loss of $3.8 million in the fourth quarter of fiscal year 2022 compared to a loss of $3 million in the same period of fiscal year 2021. For the fiscal year ended October 31, 2022, revenue was a record $184.6 million compared to $166 million in the same period last year. Net loss applicable to common stock after preferred dividends was $737,000 for fiscal year 2022 compared to a net loss of $3.9 million for 2021. For fiscal year 2022, adjusted net loss per diluted EPS was $1.3 million compared to a net loss of $2 million for fiscal year 2021. Adjusted net loss per diluted share was $0.08 compared to adjusted net loss per diluted share of $0.11 for fiscal year 2021 based on approximately 17.5 million and 17.6 million respectively, weighted average diluted common shares outstanding. We recorded for fiscal years 2022 and 2021 an income tax provision of $800,000 and a benefit of $300,000 â\u0080\u0093 pre-tax income of $300,000 and a loss of $4.2 million, respectively. For fiscal year 2022, adjusted EBITDA was $11.9 million compared to $9.9 million for fiscal year 2021. Turning now to our balance sheet and liquidity, long-term debt was now down over 20% as of October 31, 2022, to $104.1 million compared to $130.4 million at the end of fiscal year 2021. And the addition of the Harvest Medical Pavilion spread out over 7 fiscal years, with proceeds of $8 million received in the fourth quarter of fiscal year 2022. Fiscal year 2022 generated $8 million of cash to Limoneira, fiscal year 2023 is expected to generate $5 million, fiscal year 2024 is expected to generate $8 million, fiscal year 2025 is expected to generate $17 million, fiscal year 2026 is expected to generate $25 million, fiscal year 2027 is expected to generate $30 million, and fiscal year 2028 is expected to generate $22 million."
}