{
    "symbol": "CPSS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 15:11:03",
    "content": " We'll begin with the revenues for our first quarter just ended were $74.4 million, that's a 7% increase over our fourth quarter of last year and an 18% increase over the first quarter of 2021. The fair value portfolio, which is everything we've originated since January 2018, is $2.192 billion, 92% of the total portfolio, yielding this quarter about 11.7%, which, as you know, from hearing this before is net of losses. Moving on to expenses, $45 million is flat with our fourth quarter of last year and down 18% from $55 million in expenses in the first quarter of 2021. First of all, we have a significant reduction in our allowance for loan losses, so we have a reversal of previous provisions for credit losses on the legacy portfolio that's $9.4 million this quarter. Pretax earnings for the quarter $29.3 million, that's a 20% increase over the fourth quarter of 2021 and a whopping 271% increase compared to $7.9 million pretax earnings that we posted in the first quarter of '21. And the allowance for the legacy portfolio, which as you know is a lifetime allowance required by the CECL accounting for that type of portfolio, the life -- the remaining allowance in that portfolio is still 24% of that remaining balance, even though we reversed $9.4 million of it this quarter. That's down a little bit 7% from the December quarter, fourth quarter of last year, and up just a little bit 11% compared to the first quarter of 2021. So it's kind of interesting, even though our portfolio has grown 12% year-over-year and our quarterly originations volume are nearly really double what they were a year ago, we have just a nominal increase in those operating -- core operating expenses. Those operating expenses as a percentage of the managed portfolio were 6.7% for the quarter, that's down from 11% -- that's down 11% from the fourth quarter of last year, and up only 5% from a year ago."
}