{
    "symbol": "CPSS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 16:25:20",
    "content": " We'll begin with the revenues for the quarter which were $82 million with a 10% increase over $74.4 million in our first quarter this year, and a 23% increase over $66.8 million in the second quarter of 2021. Moving to expenses, $47.8 million for the quarter, that's a 6% increase -- slight increase over our first quarter of this year of $45 million, but a 10% decrease compared to $53 million in the second quarter of 2021. Pretax earnings for the quarter $34.2 million, 17% increase over the first quarter of this year, $29.3 million and 146% increase over the $13.9 million we posted in the second quarter last year. For the first six months of this year, pretax earnings was $63.5 million, which is 191% increase over the $21.8 million we posted in the first six months of last year. Net income for the quarter $25.3 million, 20% increase over our first quarter this year of $21.1 million and 161% increase over the $9.7 million in net income that we had in the second quarter of last year. Diluted earnings per share $0.91 this quarter compared to $0.75 in our first quarter of this year, that's a 21% sequential quarter increase and a 133% increase compared to the $0.39 we posted for the second quarter of 2021. The net interest margin for the quarter was $63.3 million, that's a 9% increase over the first quarter this year of $58 million and a 32% increase over $47.8 million in NIM in the second quarter of 2021. Core operating expenses, $37 million for the quarter, that's down 3% from our first quarter of this year of $38 million and it's up just slightly from $34 million in core operating expenses in the second quarter of last year. So, we're really starting to see some operating leverage, which we've been -- those core operating expenses as a percent of the managed portfolio were 6% in the second quarter of this year and that's down, compared to 6.7% in the first quarter of this year, and it's down 6% compared to 6.4% in the second quarter of 2021."
}