{
    "symbol": "NLOK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 21:06:01",
    "content": " At this time, for opening remarks, I would like to pass the call over to Ms. Mary Lai, Head of Investor Relations. Joining me today to review our Q3 results are Vincent Pilette, CEO; and Natalie Derse, CFO. As a reminder, there will be a replay of this call posted on the Investor Relations website, along with our earnings slides, press release defining our non-GAAP metrics. I'd like to remind everyone that during this call, all references to the final metrics are non-GAAP, and all growth rates are year-over-year unless otherwise stated. A reconciliation of non-GAAP to GAAP measures is included in our press release, which is available on our IR website at investor.nortonlifelock.com. Today's call contains statements regarding our business, financial performance and operations, including the impact of the ongoing COVID-19 pandemic on our business and industry, which may be considered forward-looking statements and such statements involve risks and uncertainties that may cause actual results to differ materially from our current expectations. For more information, please refer to the cautionary statement in our press release and the risk factors in our filings with the SEC and, in particular, our annual report on Form 10-K for the fiscal year ended April 2, 2021. This was another strong quarter, double-digit growth on both the top and bottom line, and we continue to drive improvements across several key business areas that we believe are critical to our long-term success. Q3 revenue and bookings grew 12% and 11%, respectively. The growth profile we delivered was broad-based, reflective of diversification across our product portfolio, our channels and our geographies. And with 16% growth in EPS, our profitability remains strong and continues to grow faster than revenue. Later in this call, Natalie will provide you with more details on our Q3 results, but let's take a step back for one minute. Every day, this team wakes up driven by a singular purpose, making the world cybersafe for everyone and ultimately powering their digital freedom. Today, we are protecting and empowering approximately 80 million users in more than 150 countries where we are just getting started. We are focused on accelerating innovation, expanding access and reach and relentlessly serving our customers' needs. In Q3, we introduced Avira Breach Monitor, where we actively scan the Internet and alert users if their e-mail is a part of a data breach. In identity and in privacy, we continue to expand our reach internationally, combining Dark Web Monitoring, anti-truck and ID Navigator and bringing it to over 20 countries. Not only do we bring new products to market, we also improve upon category-leading products that we have offered for years. For example, using machine learning, we rolled out new alerts detecting unusual transactions for our LifeLock subscribers, better protecting people from various frauds or unusual activities. Day after day, this team brings energy and new ideas about how we can better build out the Norton 360 cyber safety integrated platform. Within various plans of Norton 360, our members automatically receive the benefits of our latest innovation: simplified and frictionless onboarding experiences, new device detection in addition through QR codes; easy backup activation; software updater; improved integrated VPN; game booster; cryptocurrency mining and wallet options; and enhanced identity protection features like identity lock and social media monitoring. And it's not just innovation, it is a continued commitment to protecting our users as highlighted with multiple AV-TEST awards and the most recent, the SE Labs Best Consumer Anti-Malware Awards for 2021. We know we are on the right track as over 14 million customers are now on Norton 360, with more than one million members added since our Investor Day last May. Whether it's launching entirely new products, bringing these products to more people or improving our industry-leading platform, we know that innovation is a core driver of our success. When customers make the decision to trust us to help protect their digital lives, they stay with us. If you exclude the first-year customers, retention is at 87% in aggregate and as high as 90% for some cohort of customers with the identity offering. It speaks to the power of our Norton 360 platform with identity protection as traditionally in this industry, renewal rates for the first-year customers or security-only customers are lower. We've already improved Avira retention to 83%, up three points since we acquired them. Through our evolving and innovative product portfolio and expanding distribution channels, we have now added customers to the platform consistently over nine consecutive quarters. Total direct customers are now over 23.4 million, up 12% or 2.4 million customers added year-over-year and 126,000 sequentially. The growth was broad-based, although slightly higher mix in security as expected for December holiday-driven quarter. In our direct-to-consumer channel, we observed some market pressure on ad prices that slightly pushed up our customer acquisition cost. The net direct customer count increase that I just shared does not include customers coming through our partner channels, including employee benefits or through the App Store, for example. In those two channels alone, we added almost 0.5 million customers year-over-year and over 100,000 customers sequentially. And interestingly, almost two-third now of our new customer from app stores have installed the Norton 360 app. While it is great that we've brought innovations to the market, added customers to our platform and retain them, it is also clear that we are delivering value. In Q3, our average revenue per user, or ARPU, was $8.87, but excluding Avira, we achieved a record organic ARPU well above $9, driven by higher Norton 360 adoption and successful cross-sell and upsell activities. Avira's installed base is more focused on traditional security feature, which drives an ARPU at just below $5. But we view this as one of the many opportunities we have to continue to grow and provide more rounded protection to all customers, Avira and internationally. To wrap up, I'm also excited to announce that we are driving to an accelerated close date for the merger with Avast. As you will recall, we originally expected to close in mid-calendar year 2022. However, while there remains some outstanding regulatory conditions that will need to be satisfied or waived before we can close, we currently expect to close on February 24, 2022. We have made great strides towards combining the two companies, including receiving approvals from both NortonLifeLock and Avast shareholders, satisfying regulatory conditions in the U.S., Czech Republic, Australia and New Zealand, and securing permanent financing commitments. In the meantime, we'll keep driving our business forward. Together, we will accelerate the transformation of consumer cybersafety and power digital freedom for everyone. For today's discussion, I will focus on non-GAAP financials, starting with our Q3 results and then provide our outlook for fiscal year 2022. Revenue was up 10% in USD and up 12% in constant currency, including a two-point currency headwind as the euro and yen weakened against the U.S. dollar. Bookings growth accelerated sequentially and year-over-year, up 10% in USD and 11% in constant currency. Our total direct customer count increased to 23.4 million, adding 2.4 million customers year-over-year and adding 126,000 net new customers quarter-over-quarter. This was our ninth consecutive quarter of sequential net direct customer adds, with close to 0.5 million net new customers added already this year. While our customer mix still skews higher in the U.S., we are capturing more international opportunities as we scale. Looking at our performance in Q3 across key operating metrics, overall, unit retention was slightly above 85% in Q3, and our monthly average revenue per user, or ARPU, expanded sequentially to $8.87. Collectively, this contributed to 9% revenue growth in our direct business versus 5% growth in Q3 last year and no growth the year before. Our renewal rates remain strong across cohorts, including our newer customers, which now reflects a larger mix of our customer base. Our cross-sell/upsell efforts are also beginning to bear fruit, supported by new product velocity and expanding feature releases in global markets. While driving strong engagement throughout the customer journey and bringing more value to our customers, we, in turn, continue to increase retention and drive growth in our ARPU over time. Our partner business continued to grow double digits in Q3, with revenue up 17%, scaling in multiple channels including employee benefits and app store. Our app store channel was up double digits for the fifth consecutive quarter, driven by the success of our Norton 360 app. While our indirect business is just over 10% of our total business, we continue to dedicate more resources in this area as we focus on broadening our go-to-market reach and drive this as a key tenet of our long-term growth strategy. Q3 gross margin sustained at 87% and operating margin was 52.8%, up 180 basis points year-over-year. With R&D, we focused on our energy on increasing the pace of new product launches while also effectively driving efficiencies. Looking ahead with Avast, we will continue to operate with a disciplined approach in our cost management in order to drive synergies we committed and pre-integration plans are already underway. Q3 net income was $260 million, up 14% year-over-year. Diluted EPS was $0.44 for the quarter, up 16% year-over-year and at the high end of our guidance range. Year-to-date operating cash flow is $648 million, growing over 80% year-over-year. In Q3, we returned approximately $73 million to shareholders in the form of a regular quarterly dividend of $0.125 per common share. For Q4, the Board of Directors has approved a regular quarterly cash dividend of $0.125 per share to be paid on March 16, 2022, for all shareholders of record as of the close of business on February 22, 2022, as described in the press release. We still have approximately $1.8 billion remaining in the current share buyback program, which is not being deployed at this time due to the pending Avast transaction. As a reminder, depending on the Avast merger shareholder elections, an incremental share buyback of up to $3 billion is possible to the extent that Avast shareholders elect for the majority stock option. As you may recall, back in August of last year, we successfully syndicated our term loan A commitments for the acquisition financing. We now expect to achieve fiscal 2022 annual non-GAAP revenue in the range of $2.795 billion to $2.805 billion, assuming stable currency rates quarter-over-quarter, which translates to approximately 10% growth year-over-year in constant currency. For fiscal 2022 annual non-GAAP EPS, we expect to be in the range of $1.73 to $1.75, narrowing against that high end. We have growing momentum, a very healthy business model and strong operating capabilities. As we navigate forward, we will continue to challenge ourselves to anticipate, prioritize and meet customer needs in a growth-focused manner. Thank you for your time today, and I will now turn the call back to the operator to take your questions. Your line is open. I understand the disclaimer just on talking about specific M&A, but I think the most surprising news with the release here, in my view, is the earlier expected close for Avast on February 24. And to be honest with you, I never believed that I would say what I’m going to say, which is despite the fact that we posted a double-digit quarter, quarter, the most exciting news is, for me too, that we are now scaling the close of the merger with Avast for February 24. We’ve made great progress in our planning activities, and we know that this merger will offer an increased capacity for innovation, for global reach, to make Cyber Safety reach for consumers. We’ve done now all of the filings and we are openly and actively, if you want collaborating with those stories answering all of the questions they have. Based on the progress, and I won’t go into every detail, we’re now confident that we will be in a position on February 24 to either meet all conditions or waive all conditions and be able to close. So that’s, as you mentioned, a great news. To Vincent’s point, I mean, great to see the double-digit bookings growth. You talked about a couple of the levers in your prepared remarks, the better retention, the ARPU and continued customer acquisition. The growth was pretty broad-based, both the U.S. and international and across security and identity. How we continue to post double-digit growth, I think, is exactly what we’ve said. It’s really having our new products come to market faster, which is allowing us to offer increasing value to our new as well as our existing customers. We continue to focus our efforts in expanding our customer reach across the globe, that’s driving both domestic expansion as well as international expansion. We’ve got – with Avira, really seeing the premium to paid conversions as well as combine and diversified through the partner and indirect channels. Think all of that’s just really coming together, and we’re focused on all of those key tenets to drive that double-digit growth. Vincent, if I could squeeze another one in, it’s a product question. Because I guess in the world of unfortunately, cyber bullying, I imagine that's an interesting product. And to be honest, so we have a very broad purpose, right, really protecting and empowering everyone to have the digital lives being safe and getting the maximum value for it. As we know, as we move more online, we, of course, expose either the users or our kids or family to more risk coming from that cybercriminality that continues to evolve all the time. I mentioned at our Analyst Day that moving up the stack of value from that core device security to multi-device, to then including password manager, VPN, then adding identity features and then moving into privacy features is what our mission is to build just the best cybersafety platform, full stop. And then on top, offering additional services that would have a lot of value because they are part of that cybersafety platform. I mentioned a category we really look at very closely within that privacy and protection is your reputation online, reputation, privacy reputation management, and then protecting against all sort of activities that would expose you. And so social monitoring is just another feature, if you want, in a long road map that we keep developing to protect our children against different worlds, different exposure that you would not want to have and creating an alert system and a blocking system that help spotting that. When it comes to competition, I have to tell you, we see a lot of innovation, startups, either geographically located or product category-focused, that bring interesting new ideas. Your line is open. Hi guys, thanks for taking my questions and congrats on the double-digit growth. Vincent, you talked about capturing more international business, and obviously, Avast will accelerate that. But as you know, Norton came with a more U.S.-centric base, right? And when we started as a company two-years ago, we say we have a big opportunity internationally, first, with the current product portfolio, and we did that. Then we realized that in many local countries, there's many features that are more free features and introducing, in our portfolio, the ability to manage a freemium model was important. So that has been, of course, a proof point that give us the confidence to say, hey, the combination with Avast would be definitely a fantastic, very powerful move to offer more innovation to these customers, including the commitment to the free, and that's number one. Number two is, we have seen it with Avira but also with Norton, as we continue to move more value up the, I can call it, value chain, when you look at the pyramid at the base, the basic security moving into your data being protected and your data inform a live, protecting your full live, that's an identity or multiple identities and protecting that. We can see both, of course, the value creation of the ARPU going up and then the retention actually going up along with the customer satisfaction. In Europe, as you know, digital identity has a decent meaning than in the U.S. And so having a presence in each region and understanding the – both the local market in a global framework is very important and we'll be fully committed to that. The third one, I would say, internationally that we have seen is once a customer gets more of that value that I mentioned under either Norton Identity or different single products, AntiTrack or others, we've seen retention improving. Every country has a different renewal rate, but they move up when they move up the value chain and become more a member of a cybersafety platform. So that gives you an idea, if you want, of the different levers we will have to continue to accelerate growth as we share best practices with our friend at Avast. The other thing that really stood out to me, you had a lot of positive things to say about indirect success as well. Obviously, it's been more of a direct historically, but it's really, I think, exciting to see a lot of indirect success, which seems like another lever of growth. We know that to reach out the 5 billion Internet users, we can't just do it through a DTC business model. We have to continue to partner, whether it's going indirect to a simple channel or combining with other solutions to offer a better mix or a fully integrated value, combining, for example, with an insurance provider and a cybersafety offering, et cetera. There too, it's not only a channel because then we get feedback around adjustment to the product portfolio and we can add more value for the employee benefit of customers. Of course, we want indirect channel to be bigger but we want to be very thoughtful, making sure that our brand is recognized, that we have engagement with the customers, which is not the case with every legacy indirect channels, making sure we have the ability to continue to move up the value chain of customers. We're particularly excited – sorry to come back with all the time with that, but when Avast will come in, they have a VSB/SOHO Channel, so focusing on the gig economy or the home-worker person around that cybersafety, we expect to increase that channel as well. Your line is open. So look, growing our customer base has consistently been and will continue to be a key ingredient to our strategy. We'll continue to invest in driving this area, very, very fruitful to acquire customers to direct acquisition. These are diverse channels that we can go to market and really expand our reach, and we're putting resources behind that. We absolutely want more customers, direct paying customers through our funnel. There's one ad I want to say, I know it's doubling down on what I already said and Natalie mentioned it briefly but we have a lot of also indirect customers. In employee benefits and mobile app, we increased 100,000 net new customers or over 100,000 net new customers in those two channels quarter-over-quarter. We saw for the first time actually in mobile app, 65%, about two-third of the mobile app purchases were Norton 360, which is a very big change. We've made some analysis Avast, for example, is including the mobile app into the customer. So as we merge with Avast, we’re going to take a fresh look on how we report this customer count. So as it pertains to price increases inflation, et cetera, I know it's being talked about across the globe. Very, very top of mind and relevant, for our business though, we're software-based so we really don't have a ton of logistical and raw material inflation in our business. And when it comes to gross, we balance retention, ARPU, new customer acquisitions. They have more than just security like password manager, et cetera but they haven't really made the leap yet on understanding the benefit of having identity – digital identities being protected. And I think that's really our effort, creating the innovative portfolio to really drive that increased adoption of identity protection. I will turn the call back to Vincent Pilette, CEO for NortonLifeLock. And thanks everyone, for joining us for this call."
}