{
    "symbol": "GMRE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 13:00:24",
    "content": " Regarding efforts to reduce our leverage, we have been able to successfully place new properties under contract for sale for proceeds of $11.6 million and are optimistic that we can complete other dispositions that would generate a total of approximately $90 million of proceeds at a cap rate between 6% and 6.5% during the first half of 2023. At the end of the fourth quarter 2022, our portfolio consists of first investments in real estate of $1.5 billion and includes $4.9 million of total leasable square feet, 96.5% occupancy, 6.2 years of weighted average lease term, 4.4 times rent coverage with 2.1% weighted average contractual rent escalation. In the fourth quarter, we achieved a 19.6% year-over-year increase in total revenues of $36.3 million, driven primarily by our acquisition activity over the past year. Our interest expense in the fourth quarter was $8.1 million compared to $4.8 million in the comparable quarter of last year, reflecting both higher average debt balances and increased interest rates. To illustrate the effect the rapid increase in interest rates has had on our interest expense, our weighted average interest rate during the fourth quarter of 2022 was 4.07% and compares to 3.65% during the previous quarter and 2.88% during the fourth quarter of 2021, representing an increase of about 120 basis points in just one year. Please proceed with your question. And then we have two other assets, one that's approximately $9 million that is still in the first round of bidding, but we're getting very strong interest in that property. Please proceed with your question. And I would say even on the private equity side, it's pretty clear that at the beginning of the year, everyone adopted a more cautious standby mode and a lot of the conversations I've had with those groups, it sounds like they're also targeting kind of second half of the year for them to really start getting active. Please proceed with your question. And just looking at, I mean, the run rate on some of the properties, it really gets to be, again, could be upwards $1 million to $1.5 million that you're carrying in those costs from the vacancies on an annual basis. Please proceed with your question. Please proceed with your question."
}