{
    "symbol": "GMRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 15:01:14",
    "content": " We achieved that 18.1% year-over-year increase in total revenue to $35.4 million, driven primarily by our acquisition activity over the past year, including a $6.8 million gain from the sale of a property. During the third quarter and by mid-September, we completed 5 acquisitions, containing just under 250,000 leasable square feet for an aggregate investment of $50.8 million, and a weighted average cap rate of 7.1%. These acquisitions included a 110,800 square foot medical office portfolio in Toledo, Ohio, for a purchase price of $17.2 million with a cap rate of 6.9% at 84% occupancy, which is anchored by University of Toledo physicians and a 12,000 square foot Bon Secours Surgery Center. A 22,600 square foot medical office building in Lake Geneva, Wisconsin, where a purchase price of $6.1 million with a cap rate of 7.8% at 100% occupancy, which is 66% leased to Advocate Aurora Health. A 35,900 square foot medical office and retail center in Glenview, Illinois, for a purchase price of $8.7 million, with a cap rate of 5.8% at 74% occupancy, with a tendency focused on Dental, Optometry and Wellness. A 55,000 square foot medical office portfolio in Canandaigua, New York, for a purchase price of $13.8 million, with a cap rate of 7.6% at 100% occupancy, which is adjacent to the University of Rochester campus, and is anchored by the hospitalâ\u0080\u0099s Primary Care Group and by Western New York Medical. A 23,000 square foot medical office building in Hermitage, Pennsylvania, for a purchase price of $5.1 million, with a cap rate of 8.2% at 100% lease to Stewart Health for over 4 years. With regards to dispositions, in the third quarter, we sold our medical office building in Germantown, Tennessee, receiving gross proceeds of $17.9 million, resulting in a gain on sale of $6.8 million. At the end of the third quarter 2022, our portfolio consists of gross investments in real estate of $1.5 billion and included 4.9 million of total leasable square feet, 96.8% occupancy, 6.4 years of weighted average lease term, 4.7 times rent coverage, and 2.1% weighted average contractual rent escalations. In the third quarter, we achieved an 18.1% year-over-year increase in total revenue to $35.4 million, driven primarily by our acquisition activity over the past year. Our total expenses for the third quarter of 2022 were $32.1 million, compared to $24.6 million in the prior year quarter. Our operating expenses for the third quarter were $6.7 million, compared to $4 million in the prior year quarter, with the increase in these expenses being driven by the growth in our portfolio, and to a lesser degree the impact of gross leases. Regarding these third quarter 2022 expenses, $5 million related to net leases, where the company recognized the comparable amount of expense recovery revenue, and $1.4 million related to gross leases. Our interest expense in the third quarter was $7 million, compared to $4.8 million in the comparable quarter of last year, reflecting both higher debt balances and increased interest rates. Including a $6.8 million gain from the sale of property, net income attributable to common stockholders for the third quarter of 2022 was $8.1 million, or $0.12 per share, compared to $3.7 million or $0.06 per share in the third quarter of 2021. Immediately following the amendment, we entered into $150 million of forward starting interest rate swaps that commenced in October 2022 and mature in January 2028, that fix the SOFR component on the new term loan through its maturity at 2.54%."
}