{
    "symbol": "GMRE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 15:52:05",
    "content": " With respect to earnings in the quarter, we increased our total revenue by 16.5% compared to the first quarter of last year to $32 million, and our net income attributable to common shareholders was $2.7 million or $0.04 per share. Our FFO was $0.23 per share and unit on our AFFO was $0.24 per share and unit, both of which were unchanged compared to the prior year quarter, reflecting consistent performance despite operating at 43% average leverage in the first quarter versus 50% average level in the prior year's first quarter due to the impact of additional equity issuance that enhanced our liquidity and strengthen our balance sheet. During the first quarter, we closed on four acquisitions containing 80,781 leasable square feet for an aggregate investment of $24 million at a weighted average cap rate of 7.2%. These acquisition included a 17,700 square foot MOB in Gainesville, Georgia for a purchase price of $5.1 million with a cap rate of 6.4%, a 26,700 square foot MOB in Grand Rapids, Michigan, for a purchase price of $6.8 million with a cap rate of 7.7%, a 12,800 square foot Arthritis Center in Sarasota, Florida for a purchase price of $6 million. Additionally, as Jeff mentioned, so far in the second quarter, we have acquired two properties for an aggregate purchase price of almost $30 million, including a 4,200 square foot surgery center in Fairbank, Alaska for a purchase price of $22.3 million, with a cap rate of 6.4%, a 30,200 square-foot medical office building portfolio in Rocky Point, North Carolina for a purchase price of $7.6 million with a cap rate of 6.6%. With over $100 million of acquisitions closed or under contract so far in 2022, we remain comfortable with our target to close between $180 million and $220 million of acquisitions, for the full year at an average cap rate of 7%. At the end of the first quarter 2022, our portfolio included $4.4 million of total leasable square feet, 97% occupancy, 6.9 years of weighted average lease term, five times rent coverage with 2% weighted average contractual rent escalations. In the first quarter, we achieved 16.5% year-over-year increase in total revenues to $31.9 million, driven primarily by our acquisition activity over the past year. Our operating expenses for the first quarter were $5.4 million compared to $3.7 million in the prior year quarter, with the increase in these expenses being driven by the growth in our portfolio and to a lesser degree, the impact of gross leases. Net income attributable to common stockholders for the first quarter of 2022 was $2.6 million or $0.04 per share, compared to $1.8 million or $0.03 per share in the first quarter of 2021. Relative to equity, in the first quarter we generated gross proceeds of $8.3 million through ATM issuances of 480,000 shares of our common stock at an average price of $17.38 per share. Surgical hospitals are also -- it's going to really depend on what type of like who the operator is, who the surgeons are, location for the better surgical hospitals, I also don't think there's going to be a meaningful change in cap rates, and those have gotten pretty competitive. It's not a risk thing, because you see our coverage rates are often -- if we buy a $5 million or $7 million property, the coverage ratios of their earnings over their rent tends to be much higher than maybe a $20 million property."
}