{
    "symbol": "LH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 14:08:06",
    "content": " These forward-looking statements include, but are not limited to, statements with respect to the estimated 2022 guidance and the related assumptions; the proposed spin-off of the Clinical Development business; the impact of various factors on the company's businesses, operating and financial results, cash flows and/or financial condition, including the COVID-19 pandemic and general economic and market conditions; future business strategies; expected savings and synergies, including from the LaunchPad initiative, acquisitions and other transactions; and opportunities for future growth. Base Business organic revenue for the enterprise, excluding COVID testing revenue, is up 1.4% year-over-year on a constant currency basis. In Diagnostics, Base Business revenue increased about 4% year-over-year due to an uptick in demand in both routine and esoteric testing. Drug Development Base Business margins for the quarter were 15%, an expansion from last quarter but lower than anticipated due to the revenue in central laboratories and labor shortages in early development. Revenue for the quarter was $3.6 billion, a decrease of 11.2% compared to last year due to lower COVID testing and the negative impact from foreign currency translation. COVID testing revenue was down 70% compared to COVID testing last year, while the Base Business grew 0.7% compared to the Base Business last year. Excluding these items, the adjusted operating income in the quarter was $589 million or 16.3% of revenue compared to $907 million or 22.3% last year. Revenue for the quarter was $2.2 billion, a decrease of 15.7% compared to last year due to organic revenue being down 16.4%, partially offset by acquisitions of 0.9%. COVID testing revenue was down 70% compared to COVID testing last year, while the Base Business grew 3.7% compared to the Base Business last year. Relative to the third quarter of 2019, the compound annual growth rate for Base Business revenue was 4.3%, primarily due to organic growth. Revenue for the quarter was $1.4 billion, a decrease of 3.7% compared to last year, primarily due to foreign exchange translation of minus 3.4%. While acquisitions contributed 0.5% of growth, organic Base Business revenues declined 0.7% compared to last year due to the negative impact from lower COVID-related work and the Ukraine-Russia crisis. Diagnostics Base Business revenue is expected to grow 6% to 7%, an increase of 150 basis points at our midpoint due to Ascension now being reflected in the segment outlook, while it was in our enterprise guidance prior to closing the transaction. So first of all, if you look at Drug Development overall and you look at our new guidance at the midpoint, the full year growth would represent 7.7%, almost 8%, CAGR since it's 2019. As we sit here today, what we're seeing is the kits going out in the third quarter of this year were about 30% lower the number of kits that we sent out in the third quarter of last year."
}