{
    "symbol": "LH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 13:12:11",
    "content": " These forward-looking statements include, but are not limited to, statements with respect to the estimated 2022 guidance and the related assumptions, the impact of various factors on the company's businesses, operating and financial results, cash flows and/or financial condition, including the COVID-19 pandemic and the general economic and market conditions, our response to the COVID-19 pandemic, future business strategies, expected savings and synergies and opportunities for future growth. Revenue for the quarter was $3.9 billion, a decrease of 6.3% compared to last year due to lower organic revenue as the negative impact from foreign currency translation was offset by acquisitions. COVID testing revenue was down 43% compared to COVID testing last year, while the Base Business grew 4.5% compared to the Base Business last year. The decrease in adjusted operating income and margin was primarily due to a reduction in COVID testing, higher personnel expense and other inflationary costs, partially offset by organic Base Business growth and LaunchPad savings. Revenue for the quarter was $2.5 billion, a decrease of 11% compared to last year due to organic revenue being down 11.5%, partially offset by acquisitions of 0.5%. COVID testing revenue was down 43% compared to COVID testing last year, while the Base Business grew 5.6% compared to the Base Business last year. Relative to the first quarter of 2019, the compound annual growth rate for Base Business revenue was 3.7%, primarily due to organic growth. COVID testing volume was down 38% compared to COVID testing last year, while Base Business volume grew 4.4% compared to the Base Business last year. Price/mix decreased 6% versus last year due to lower COVID testing of 6.3%, partially offset by acquisitions of 0.2% and organic Base Business growth of 0.1%. Base Business price/mix was up 1.2% compared to the Base Business last year, benefiting from an increase in test per session, esoteric testing growing faster than routine testing and acquisitions. Revenue for the quarter was $1.5 billion, an increase of 1.5% compared to last year due to organic Base Business growth of 4.3% and acquisitions net of divestitures of 0.1%, partially offset by lower COVID testing of 1.7% and foreign currency translation of 1.2%. Relative to the first quarter of 2019, the compound annual growth rate for Drug Development, Base Business revenue was 10.7%, primarily driven by organic growth. The decrease in adjusted operating income and margin was due to lower COVID testing, reduced COVID vaccine and therapeutic work, the impact from the conflict in Ukraine, higher personnel expense and other inflationary costs, which were partially offset by organic Base Business growth and LaunchPad savings. At the midpoint of our Base Business guidance range, the compound annual growth rate compared to 2019 would be 4.5%, primarily driven by organic growth. At the midpoint of our Base Business guidance range, the compound annual growth rate compared to 2019 would be 11%, primarily driven by organic growth. The Base Business revenue grew about 5.6% versus last year and then in a compounded rate versus 2019, it grew 3.9%."
}