{
    "symbol": "LH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 15:24:02",
    "content": " These forward-looking statements include, but are not limited to, statements with respect to the estimated 2022 guidance and the related assumptions; the proposed spin-off of the clinical development business; the impact of various factors on the company's businesses, operating and financial results, cash flows and/or financial condition, including the COVID-19 pandemic and general economic and market conditions; future business strategies; expected savings and synergies, including from the LaunchPad initiative and from acquisitions; and opportunities for future growth. In Diagnostics, Base Business revenue for the quarter was up 3.9% versus the prior year due to increased demand for both routine and esoteric testing. Revenues for the quarter were $3.7 billion, a decrease of 3.7% compared to last year due to lower COVID testing and the negative impact from foreign currency translation. COVID testing revenue was down 42% compared to COVID testing last year, while the Base Business grew 1.2% compared to the Base Business last year. COVID testing revenue was down 42% compared to COVID testing last year, while the Base Business grew 3.9% compared to the Base Business last year. Relative to the second quarter of 2019, the compound annual growth rate for Base Business revenue was 4.3%, primarily due to organic growth. I might just ask you, in the Base Business, Drug Development, one of the things throughout this year is how the margin is planned to step up over the course of the year, and you had good margin improvement from, I think, 11.6% in the first quarter to 14.7% in the second. So between the top line, between the cost reduction initiatives that we have in place, similar to the end of the first quarter as we finished the second quarter, we're frankly at a run rate now that supports the higher level of margins that we would need to see in the second half to continue to believe that our full year margins will be comparable -- on a Base Business level, comparable to what we did last year. It's integrated and a lot of shared resources and allocation of costs so that ultimately, when we carve out, if you will, the clinical development part of the business and make it a stand-alone business, we'll be able to give you exactly the profitability, the margins that will be there, and we'll actually do it going back for a 3-year period with audited financials. So I think what we're trying to say is directionally, you've heard us say that the clinical side of the business, while very profitable, is impacted by the impact of pass-through revenues, which, again, when we acquired Covance, we were under 605 accounting where over 20% of the revenues today, they would not have had in their margins."
}