{
    "symbol": "ORCL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-13 20:23:04",
    "content": " As you can see, we had an excellent quarter across the board with total revenue growing 10% in constant currency, the highest organic growth we've seen since 2011, and $240 million above the high end of my constant currency guidance. Now for Q4, total cloud services and license support revenue for the quarter was $7.6 billion, up 7% in constant currency again, driven by Fusion, NetSuite, autonomous database and, of course, Gen 2 OCI. Total cloud revenues, that's IaaS plus SaaS was USD 2.5 billion, up 22% in constant currency. Our strategic back-office cloud applications now have an annualized revenue of $5.4 billion and grew 24% in constant currency this quarter, including Fusion ERP up 23% and NetSuite ERP up 30%. Infrastructure, cloud services now have an annualized revenue of more than $3.2 billion, and excluding our legacy hosting services, infrastructure cloud services grew 49%, including OCI consumption revenue, which was up 83%. License revenues were $2.5 billion, up 25% in constant currency led by database sales for use in the cloud by major application cloud SaaS companies. For the full fiscal year, total company revenues were $42.4 billion, up 7% in constant currency and our highest annual growth rate in more than 10 years. Total cloud services and license support revenue for the year was $30.2 billion, up 6%. Taking all that into account, I do expect our cloud business, which grew 22% this year, will organically grow more than 30% in constant currency in FY '23. Total revenues for Q1, including Cerner, are expected to grow from 20% to 22% in constant currency, and are expected to grow 17% to 19% in USD at today's exchange rate. For Q1, cloud -- total cloud excluding Cerner is expected to grow from 25% to 28% in constant currency and is expected to grow from 22% to 25% in USD. As I mentioned above, for fiscal year 2023, total cloud excluding Cerner is expected to grow over 30% in constant currency. Total cloud growth in Q1, including Cerner is expected to grow from 47% to 50% in constant currency, 44% to 47% in USD."
}