{
    "symbol": "BCPC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 16:12:15",
    "content": " Cash flows from operations were $41.6 million for the third quarter of 2022 with quarterly free cash flow of $26.8 million, overall another solid growth quarter for Balchem with performance that highlights the strength and resilience of our business model in a very challenging market environment. We are also pleased with the growth delivered in the third quarter and believe that despite the increased demand volatility and the ongoing challenges associated with the political and macroeconomic environment that the strength and resilience of our business model, coupled with the contribution from our recent acquisitions will enable us to continue to deliver growth in Q4 and into 2023. On an adjusted basis, as detailed in our earnings release this morning, non-GAAP earnings from operations of $44.8 million were up $5.3 million, or 13.3% compared to the prior year quarter. On an adjusted basis, our third quarter adjusted net earnings were $32.4 million or $1 per diluted share, up 8% compared with the prior year quarter. As we look at it from a segment perspective, for the quarter, our Human Nutrition & Health segment generated quarterly sales of $142.7 million, an increase of 28.3% from the prior year. Our Human Nutrition & Health segment delivered quarterly earnings from operations of $20.6 million, an increase of 4% compared to the prior year, primarily due to the aforementioned higher sales and higher average selling prices partially offset by higher manufacturing input costs, higher amortization and operating expenses related to the recent acquisitions, and the timing of an insurance reimbursement received in the prior year. Excluding the effect of non-cash expense associated with amortization of intangible assets of $6.1 million and amortization of the fair value step up of the recent acquisitions acquired inventory of $1.5 million, third quarter adjusted earnings from operations for this segment were $28.2 million, an increase of 16.1%. As Ted mentioned earlier, we are starting to experience increased demand volatility across our Human Nutrition & Health segment as a result of customer destocking and broad risk management activities as well as some slowing of demand, particularly in Europe, but also in the U.S. At this point in time, itâ\u0080\u0099s hard to predict the magnitude and duration of these evolving market challenges, but we remain confident that our strong market positions will enable us to continue to deliver growth in Human Nutrition & Health in Q4 and into 2023. Our Animal Nutrition & Health segment generated quarterly sales of $65.6 million, an increase of 16.7% compared to the prior year. Animal Nutrition & Health delivered earnings from operations of $8 million, an increase of 8% from the prior year quarter primarily due to the aforementioned higher sales and higher average selling prices partially offset by increases in manufacturing input costs and distribution costs. Excluding the effect of non-cash expense associated with amortization of intangible assets of $0.1 million and excluding the prior year expenses related to the flash flood event, third quarter adjusted earnings from operations for this segment, were $8.2 million, an increase of 4.7%. Our Specialty Products segment delivered quarterly sales of $29.6 million, an increase of 7.3% compared to the prior year quarter due to higher sales of products in the Performance Gases business partially offset by lower plant nutrition sales and an unfavorable impact related to changes in foreign currency exchange rates. Specialty Products delivered earnings from operations of $7.1 million, an increase of 10.1% versus the prior year quarter. Excluding the effect of non-cash expense associated with amortization of intangible assets of $1 million and excluding the prior year expenses related to the flash flood events, third quarter adjusted earnings from operations for this segment were $8.1 million, an increase of 5.8%."
}