{
    "symbol": "BCPC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 14:20:02",
    "content": " Our fourth quarter net sales of $233 million were 9.1% higher than the prior year, and we delivered sales growth in our Human Nutrition health and specialty product segments, while sales in the Animal Nutrition and health segment were essentially flat. GAAP Earnings from operations for the fourth quarter were $33 million, a decrease of 1.5% compared to the prior year quarter. On an adjusted basis, as detailed in our earnings released this morning, non-GAAP earnings from operations of $43 million were up $5 million or 13.2% compared to the prior year quarter. Consolidated net income close to quarter at $21 million, down 14.2% from the prior year, driven primarily by the higher interest expense and negative impact from amortization related to the recent acquisitions. On an adjusted basis, our fourth quarter adjusted net earnings were $30 million, translating to $0.94 per diluted share, an increase of 10.1% compared with the prior year quarter. As we look at it from a segment perspective, for the fourth quarter, our Human nutrition and health segment generated sales of $130 million, an increase of 12.9% from the prior year. Our human attrition and health segment delivered quarterly earnings from operations of $18 million, an increase of 0.1% compared to prior year. Our Animal Nutrition and health segment generated quarterly sales of $65 million, a decrease of 0.3% compared to the prior year. Animal Nutrition and health delivered earnings from operations of $9 million, a decrease of 10% from the prior year quarter, primarily due to the timing of an insurance reimbursement related to a flash flood event in the prior year. Our specialty product segment delivered quarterly sales of $32 million, an increase of 16.2% compared to the prior year quarter. Specialty products delivered earnings from operations of $8 million, an increase of 20.4% versus the prior year quarter."
}