{
    "symbol": "AIZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 11:42:16",
    "content": " This will be driven by 8% to 10% adjusted EBITDA growth from the $1.1 billion in 2021 as well as disciplined capital deployment through share repurchases, including using the remaining net proceeds from last year's sale of Global Preneed. For the quarter, we reported adjusted earnings per share, excluding reportable catastrophes, of $3.80 , up 17% from the prior year period, driven by buybacks and a $9 million nonrecurring tax benefit from one of our international businesses. This segment reported adjusted EBITDA of $217 million in the first quarter, a year-over-year increase of 13%, driven by continued earnings expansion in both Connected Living and Global Automotive. The increase was primarily driven by continued mobile expansion in North America device protection programs from cable operator and carrier clients, including more favorable loss experience and subscriber growth as well as an increase in global mobile devices service, including higher trade-in volumes from continued carrier promotions. In Global Automotive, earnings increased $9 million or 12% from 3 items: higher investment income, favorable loss experience in select ancillary products and continued growth in our U.S. national dealer and third-party administrator channels, including growth of 5% in global vehicles protected. Lender-placed is expected to be a key driver for the following 4 items: first, expense efficiencies across the business, including system enhancements and new digital capabilities, we expect these to create additional scale as the volume of our business grows; second, higher average insured values; third, a modest lift from expected placement rate increases; and last, REO recovery later in the year, noting that volumes were significantly reduced from foreclosure moratoriums during the pandemic. The only thing I would add, I think the business that we're writing today, to Richard's point, the team has done a really good job modifying pricing, terminating certain partnerships that we didn't think were going to pay off long term and changing deal structures, changing the terms and conditions around the products. I mean, first of all, I'm really happy with the overall performance of the auto business, and it was a particularly strong first quarter, not just in terms of the ultimate profitability of the business as we look at the EBITDA growth that we were able to deliver. I would say -- in terms of your question on run rate, I wouldn't necessarily take this as a run rate because in this quarter, let's say, we're up about $8 million over the prior year quarter."
}