{
    "symbol": "TXMD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 20:07:02",
    "content": " This afternoon, TherapeuticsMD issued a press release announcing its first quarter 2022 financial results. As also previously communicated, we believe that our ANNOVERA supply challenges peaked in the first quarter of 2022, and we envision incremental improvement as the year progresses. In April, after the close of the first quarter, we completed the vitaCare divestiture, and received a cash payment of approximately $138.5 million, net of customary holdbacks. For the first quarter of 2022, our total net revenue declined 2.7% to $19.3 million as compared to $19.9 million the first quarter of 2021. Net revenue was up $600,000 or 3.5% as compared to the fourth quarter of 2021. During the quarter, sales of ANNOVERA were $8.5 million, a decrease of $200,000 or 2.7% compared to the first quarter of 2021. However, compared to the fourth quarter of 2021, ANNOVERA sales rose $700,000 for an 8.7% increase attributable to the higher sales volumes, partially offset by a decrease in average sale price. IMVEXXY net revenue for the first quarter of 2022 was $7 million, remaining flat when compared to the first quarter of 2021. Sequentially, IMVEXXY revenues were up $300,000 or 4.5% compared to the fourth quarter of 2021 as a result of an increase in sales volume and average sale price. Sales of BIJUVA were $2.6 million for the first quarter of 2022, an increase of $100,000 or 4.7% compared to the first quarter of 2021. BIJUVA sales were down $100,000 or 4.5% quarter-over-quarter compared to the fourth quarter of 2021, attributable to a decrease in sales volume, partially offset by an increase in average sale price. Total license and service revenue in the first quarter of 2022, which includes revenues received from vitaCare Prescription Services prior to its divestiture in April was $400,000 compared to $200,000 in the first quarter of 2021. The entire $400,000 recognized in the current quarter represents vitaCare service revenue, whereas the total $200,000 in the prior year period represents revenue associated with milestone payments and product approvals with our out-of-U.S. partners. On a quarter-over-quarter basis, total license and service revenue in the first quarter of 2022 increased $300,000 compared to fourth quarter 2021 due to an increase in vitaCare service unit volumes associated with an increase in new customer agreements. Gross profit for the first quarter of 2022 was $14.5 million, a decrease of $0.7 million or 4.7% compared to the first quarter of 2021. Compared to the fourth quarter of 2021, our gross profit rose $500,000 or 3.8%, driven by an increase in net product sales, partially offset by a slight decline in product gross margin. Selling and marketing costs were $18.9 million for the first quarter of 2022, a decrease of $5.1 million or 21.3% compared to the first quarter of 2021. Quarter-over-quarter, selling and marketing decreased $3.1 million or 14.1% compared to the fourth quarter of 2021 due to a decrease in brand spending for both ANNOVERA and IMVEXXY products. General and administrative costs were $20.4 million in the quarter, an increase of $2 million or 11% compared to the first quarter of 2021. Quarter-over-quarter, our general and administrative costs declined $5.5 million or 21.2% due to certain severance-related expenses incurred during the fourth quarter of 2021. R&D expense was $1.4 million during the first quarter, a decrease of $700,000 or 31.7% compared to the first quarter of 2021, a result of lower compensation and employee benefit expense and lower lab research costs. For the first quarter, our nonoperating expenses were $22.8 million, an increase of $12.7 million compared to the first quarter of 2021. When compared to Q4 2021, this increase was $15.2 million, mainly due to higher amortization of deferred financing costs and a loss on the extinguishment of debt as interest expense remained constant for both quarters. As shown on Slide 10, total quarterly prescriptions were up 27% over the first quarter of 2021, with both new and existing prescribers continuing to write. Though the aforementioned manufacturing and supply challenges hampered our ability to meet demand in the first quarter and grow total prescriptions in the first quarter, we believe our efforts to combat the supply challenges will improve throughout the second quarter."
}