{
    "symbol": "AFG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 06:40:13",
    "content": " Pretax unrealized losses on AFG’s fixed maturity portfolio were $138 million at the end of the first quarter, reflecting the increase in market interest rates and widened credit spreads compared to year-end 2021. As you will see on Slide 8, the Specialty Property and Casualty insurance operations generated an underwriting profit of $208 million compared to $134 million in the first quarter of 2021, an impressive 55% increase year-over-year. Catastrophe losses, net of reinsurance and including reinstatement premiums, were $9 million in the first quarter of 2022 compared to $31 million in the prior year period. Gross and net written premiums increased 20% and 14%, respectively, in the 2022 first quarter compared to the prior year quarter. Renewal rate increases continue to be meaningfully in excess of estimated prospective loss ratio trends, which are approximately 5% for our Specialty Property and Casualty businesses, excluding workers’ comp, and approximately 3% overall. Catastrophe losses in this group, net of reinsurance and inclusive of reinstatement premiums, were $6 million in the first quarter of 2022 compared to $22 million in the comparable ‘21 period. The businesses in the Property and Transportation Group achieved a strong 85.8% calendar year combined ratio overall in the first quarter, 0.2 points higher than the comparable period in ‘21. First quarter 2022 gross and net written premiums in this group were 46% and 24% higher, respectively, when compared to the 2021 first quarter. Overall, renewal rates in this group increased 6% on average for the first quarter of 2022, consistent with the rate increases reported in the fourth quarter of 2021. The businesses in the Specialty Casualty Group achieved an exceptionally strong 80.6% calendar year combined ratio overall in the first quarter, an improvement of 9.6 points from the comparable period in 2021. First quarter 2022 gross and net written premiums increased 8% and 11%, respectively, when compared to the same prior year period. Based on the strong results reported through the first quarter, we now expect AFG’s core net operating earnings in 2022 to be in the range of $10.50 to $11.50 per share, an increase of $0.75 per share at the midpoint of our previous guidance of $9.75 to $10.75 per share. Our revised guidance reflects higher than previously estimated net investment income and specifically the impact of deployment of cash in a rising interest rate environment, a higher return on AFG’s cash and floating rate securities, and the strong performance of our alternative asset portfolio during the first quarter."
}