{
    "symbol": "AFG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 22:22:03",
    "content": " Pre-tax unrealized losses on AFG's fixed maturity portfolio were $701 million at the end of the third quarter, reflecting the increase in market interest rates and widened credit spreads compared to year-end 2021. In the current interest rate environment, we're able to invest in high-quality medium duration fixed maturity securities at yields of around 6%, which compare favorably to the 3.73% yield earned on fixed maturities in the third quarter of 2022, and 3.11% earned in the third quarter of 2021. Altogether, assuming that future interest rates follow current market expectations, we expect the yield earned on our fixed maturity portfolio to increase by as much as 70 basis points by the fourth quarter of 2023, compared to 3.73% earned in the third quarter of 2022. Excluding the impact of alternative investments, net investment income in our Property and Casualty insurance operations for the three months ended September 30, 2022 increased by 35% year-over-year, as a result of the impact of rising interest rates and higher balances of invested assets. AFG's book value per share plus dividends declined by approximately 2% in both the third quarter and 9-month periods ended September 30, 2022 reflecting unrealized losses on fixed maturities, due to rising interest rates and widening credit spreads. As you'll see on Slide 8, the Specialty P&C insurance operations generated an underwriting profit of $158 million compared to $169 million in the third quarter of 2021, a 7% decrease. The third quarter 2022 combined ratio was a strong 91.1%, 2.1 points higher than the 89 reported in the comparable prior year period. The Property and Transportation Group reported an underwriting profit of $39 million in the third quarter of 2022, compared to $45 million in the third quarter of 2021, primarily as a result of lower year-over-year crop profitability, when compared to a very strong 2021 crop year. Catastrophe losses in this group, net of reinsurance and inclusive of reinstatement premiums were $13 million in the third quarter of this year compared to $14 million in a comparable 2021 period. The businesses in the Property and Transportation Group achieved a 95.4% calendar year combined ratio overall in the third quarter, 1.9 points higher than the comparable period in 2021. Third quarter 2022 gross and net written premiums in this group were 30% and 24% higher respectively, when compared to the 2021 third quarter. Excluding the impact of crop insurance, third quarter 2022 gross and net written premiums increased 14% and 10% respectively, when compared to the 2021 third quarter. Now the Specialty Casualty Group reported an underwriting profit of $118 million in the 2022 third quarter, compared to $110 million in the comparable 2021 period, primarily the result of higher year-over-year profitability in our executive liability, social services and mergers and acquisitions liability business, which was partially offset by an overall decrease in favorable prior year reserve development. The businesses in the Specialty Casualty Group achieved an exceptionally strong 82.6% calendar year combined ratio overall in the third quarter, 0.6 points higher than the excellent results achieved in the comparable prior year period. Catastrophe losses for this group, net of reinsurance and inclusive of reinstatement premiums were $34 million in the third quarter of 2022, compared to $14 million in the prior year quarter. This group reported a 91.3% combined ratio for the third quarter of 2022, an increase of 7.1 points over the prior year period."
}