{
    "symbol": "DPZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 14:56:17",
    "content": " While the quarter was certainly challenged, we also saw the solid foundation of the Domino's brand and business model on display as evidenced by our robust global store growth that continues to demonstrate the strength of the Domino's operating model along with our franchisees' ongoing commitment to investing in growth. The carryout business was very strong in Q1 with US carryout same-store sales 11.3% positive compared to Q1 2021, driven by both ticket and order growth. Tying back to my comments earlier around the staffing quintiles, it's useful to note that we saw almost no difference in carryout same-store sales performance across the quintiles in the first quarter. Looking at the business on a three-year stack, Q1 delivery same-store sales remained almost 6% above Q1 2019 levels. When excluding the negative impact of foreign currency, global retail sales grew 3.6% due to sustained positive momentum in our international business, lapping 14% growth in Q1 2021. Turning to comps, during Q1 same-store sales for our international business grew 1.2%, rolling over a prior increase of 11.8% and were up 14.5% on a three-year stack basis relative to 2019. Same-store sales for our U.S. business declined 3.6%, rolling over a prior year increase of 13.4% and were up 11.4% on a three-year stack basis relative to 2019. The decline in US same-store sales in Q1 was driven by a decline in order counts, which were pressured by the very challenging staffing environment which had certain operational impacts such as shortened store hours and customer service challenges in many stores, both company-owned and franchised. Our consolidated operating income as a percentage of revenues decreased by 270 basis points to 16.3% in Q1 from the prior year quarter, primarily driven by food basket and labor increases in excess of pricing increases, as well as G&A deleverage due to the decline in same-store sales in our US business. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}