{
    "symbol": "DPZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 14:45:21",
    "content": " During Q2, same-store sales excluding foreign currency impact for our international business declines 2.2%, rolling over a prior year increase of 13.9% and were up 13% on a three-year stack basis relative to 2019. Same-store sales for our U.S. business declined 2.9% rolling over a prior year increase of 3.5% and were up 16.7% on a three-year stack basis relative to 2019, representing a sequential 5.3 percentage point improvement from Q1 on a three-year stack basis. The decline in U.S. same-store sales in Q2 was driven by a decline in order counts, which continued to be pressured by the challenging staffing environment, which had certain operational impacts such as shortened store hours and customer service challenges in many stores, both company-owned and franchise along with tough COVID and stimulus fuel comps from the prior years. The pace of U.S. store growth may decelerate slightly from the current four quarter runway to 3%, the rest of the year or until the headwinds subside, given some of the continued development, supply chain, staffing and inflationary headwinds. The impact on orders of less than the number of days closed as a percentage of the total days in the quarter, while we and our franchisees continue to make progress on a full returns of all stores to core hours as we start to lap the service disruptions from last year, this metric will become less meaningful as a driver of the year-over-year of sales performance. Thanks for the question. And I think a lot of it is actually in some of the prepared remarks that we went through, but I'll just really try to split it up a little bit for you because the answers are really a sequential acceleration for sure on the carryout business, where we went from 11% increase in the first quarter to 14.6% increase in the second quarter. Thanks for the question. And then as a follow-up, just as we think about the carryout opportunity, is that changing how the discussions are going with franchisees, maybe in terms of site location, making those a little bit more accessible to consumers versus I think the base delivery business is one that doesn't necessarily need to be main and main to drive that delivery business, but that may change to carryout as a greater focus going forward. So overall, I think once we get past these headwinds, there's no reason we can't get to a normalized unit development growth, especially given the drivers that just talked about, this carryout business, being an incremental opportunity that we seem to be seeing, gathering steam as we go along and delivery business being what the baseline thesis was about anything. Thanks for the question. Thanks for the question. Thanks for the question."
}