{
    "symbol": "IREN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-11 21:33:04",
    "content": " But ultimately, we're just building hard assets, data centers infrastructure, energy infrastructure and it's not overly foreign for the team having done it many times before in similar guidance. At the end of the day, I think the way a lot of the market is starting to look at our business is a green data center business that's mining Bitcoin rather than a Bitcoin crypto-focused business that's looking to leverage and take substantial exposure to the underlying commodity. And then we're also opening up the opportunity down in Texas with construction there where we are working closely with the Wood Group as our EPCM contract there because we didn't have the abundant labor to self-deliver that ourselves, but it's really a partnership where we're starting to grow out our Texas team. But given the stage of where we're at as a business, A, we're going through a very large construction program, which Lindsay spoken about; and B, we've also resourced a lot of development people in the corporate because as I've said before we're not here to deliver 15 exa-hash, our ambitions -- our future outlook is far greater and we've got the resource in with substantial experience in infrastructure renewable energy development looking globally at new sites, new growth opportunities, et cetera. Like we're certainly open to it as part of a treasury management policy, but today when we can reinvest every bitcoin, we're mining today to generate whatever it is six, seven, eight more bitcoin every 12 months from this point the compounding strategy and the shareholder value we believe we're delivering over the medium let alone long-term in continuing to scale this business by reinvesting those bitcoin revenue line, we believe is a really sound strategy. But we know, this market it can move very quickly, which is why we've got a team that's large, experience and ready to pivot as the market pivots and we could end up buying machines earlier than we expect particularly, we're not in sitting here today. So whether they're using immersion as a way because they believe it's more efficient today and the risk return of pursuing that strategy makes sense or whether it's more running away from an air cool design in a market, and a climatic environment where it doesn't work I don't know that's a decision and considerations that those individual players are making. It's certainly an exciting time for our business amidst a market that has its day-to-day challenges, but when you zoom out, we're really excited about what lies ahead both for the industry and also our business more specifically."
}