{
    "symbol": "CXDO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-15 01:36:03",
    "content": " I’m Steve Mihaylo, Chairman and CEO of Crexendo, and I want to welcome all of you to the Crexendo Q1 2022 conference call. Risk factors are explained in detail in the company’s filings with the Securities and Exchange Commission, including the Form 10-K for the fiscal year ended December 31, 2021, and the Forms 10-Q as filed. Considering all of these issues, I am pleased that we were able to manage a non-GAAP net income of $405,000 for the first quarter of 2022 or $0.02 per basic and diluted common share. We continue to do a good job of integrating the two teams, and both our software solutions team and our telecom team are working together with one common goal providing the top UCaaS services in the market. We see good trends, and we believe that people who deferred purchase options or purchases are now going to back and – are now coming back and making the expenditures necessary. I’m confident that most – everyone will be moving to the cloud due to the substantial efficiencies, the ability to work from anywhere on the planet and cost savings. And even with the headwinds that I described earlier, I’ve not changed my expectations of growing the business by 40% to 50% annually. Our service revenue for the quarter increased 6% or $259,000 to $4.4 million compared to $4.1 million. Our product revenue for the quarter increased 34% or $124,000 to 492,000 compared to $368,000 for the first quarter of the prior year. The software solutions segment, with no comparable expenses in the prior period contributed $3.6 million of the increase in operating expenses. Net loss of $1.2 million or $0.05 loss per basic and diluted common share as compared to a net loss of $715,000 or $0.04 per basic and diluted common share for the first quarter of the prior year. On a non-GAAP basis, as Steve mentioned, when we reported net income for the quarter of $405,000 or $0.02 per basic and diluted common share, as compared to non-GAAP net income of $308,000 or $0.02 per basic and diluted common share for the same period of the prior. EBITDA for the quarter was a loss of $774,000 compared to a loss of $721,000 for the same period of the prior year. Our adjusted EBITDA for the quarter was $302,000 as compared to earnings of $245,000 for the same period of the prior year. We used $1.7 million for operating activities for the quarter, primarily resulting from increases in our accounts receivable of $525,000, contract cost increases of $243,000 and $691,000 reduction in our accounts payable and accrued expenses during the period. Our first quarter results continue the trend of non-GAAP earnings and substantial potential, which shows the benefit of our acquisition of NetSapiens with 81% year-over-year growth and non-GAAP income of $405,000 or $0.02 a share, we are positioned nicely to continue that growth. Our organic growth of nearly 10% combined with our software solutions addition, helped us get close to the 2.5 million end user milestone on our award winning platform. One of these exciting new offerings is our new Crexendo contact center as a service, which is also called CCaaS, with omnichannel, customer engagement, chatbots, and automations that are perfectly designed for larger call center applications. Our Sessions Not Seats pricing model continues to differentiate ourselves from our two largest competitors, Cisco’s BroadSoft and Microsoft Metaswitch platforms offerings which are significantly higher price based on their cost per seat models. We continue to see pipeline and sales growth from our Crexendo agent program that has multiple strong master agent partnerships with groups like Telecom Consulting Group, TCG, as well as other groups like OTG Consulting, and we are very optimistic about the sales growth projections from these partnerships. I continue to be pleased with the integrations of our two organizations and the operational benefits and synergies we are seeing, and we’ll continue to see and they are coming together extremely nicely. And I’m extremely pleased that Crexendo is ranked number one on the world’s largest and most trusted tech marketplace website, which is G2.com, and overall customer satisfaction for high performer VoIP providers. I’m very pleased that we are able to generate non-GAAP earnings of $0.02 per common – basic common share for the quarter and feel this is strong proof that our combined organization has been able to quickly leverage the power and opportunity we have to grow and succeed together. And finally, as we head into the second half of 2022, I couldn’t be more excited about the future direction and opportunity for Crexendo. With that, I’ll turn it back over to Steve for any further comments. At this time, John, we’ll open it up to questions, and I will be the moderator and I’ll have the appropriate person answer the questions. I guess, we’re talking over each other. I was wondering if you could kind of help provide a little bit more detail on what’s going on, on the software solutions side of the business. Well, first of all, I’m going to let our guys handle that, but I would like make one comment. In other words, the continuing revenue there so that we can better forecast where we’re at. But now we’re a public company and our public shareholders expect to have a little bit more clarity, if you will, in what they see. So Josh, as we’ve talked about in the past, one of the things that we’re excited with our platform offering through the software solutions division is the fact that we’re offering subscription services. That obviously gives us a little bit of the choppiness that Steve talked about, because when we look at historical numbers, most folks that have invested in our software solutions platform had to come out of pocket with a fairly large non-recurring one-time upfront costs, and then they’d have a lower monthly. So Josh, I just expand on that, that we’re real excited about the progress with the platform and new wins with new logos within our customer base. As Doug said to kind of quantify for bookings in the Q1 period, we saw about a $750,000 increase in subscription revenue. But as Doug said, we won’t be recognizing that one-time CapEx revenue up front. And just to reiterate that number again, $43.75 million in backlog, that’s a $2 million increase just from the end of last year. So in three months, we increased backlog by $2 million. And so that’s a really, really encouraging sign as we bring more of these subscription models on board. So we can be more predictable, as Steve pointed out, but just to give you an idea, the first quarter typically sees this kind of lumpiness from a non-recurring standpoint. But again, as we’ve expanded also our SNAPaccel product offering, which is an infrastructure as a service solution, we’re continuing to see more adoption in that area. And again, that’s kind of the challenge between – we’re seeing more and more folks that, in essence, are saying, okay, you know what, you handle the plumbing, you handle the infrastructure. So we’ve seen a lot of that kind of migration, which fundamentally is very, very strong, but obviously will impact this kind of transition from more of a choppy NRC model to a recurring revenue model. So but in general, it’s very promising in terms of the types of logos and the types of folks that we see. And then in general, the migration away from what’s going on in the industry with respect to folks like BroadSoft and Microsoft and the wins that we’re seeing in that category. And then just to clarify for – of the $3.3 million, how much of that was non-recurring versus more traditional subscription revenue in the quarter. Well, before Doug or one of the other fellas answer that Josh, what we would – first of all, it’s going to take a little bit longer instead of taking two or three quarters, it’s probably going to take four or five to totally turn the ship around. Yes, approximately $843,000 of the $3.3 million was one-time revenue. And so I’ll let Ron touch on the specifics there from a financial perspective, but part of the exercise that we’re going through is exactly that. So, Ron, I don’t know if you want to touch on that. Yes, I’ll just add that we’re continuing to work on the process and the rigor of tracking engineering time between maintenance and support type services and the R&D of the platform itself, future functionality and as continue to develop the product. And so as we put the right accounting, tracking, processes in place, we’re going to be able to properly report R&D versus combining it with the rest of the cost of service revenue or cost. Last question for me, and then I’ll let someone else take a turn out. I’m just curious if it’ll wind up being a net positive once you’ve gone through this transition over the next several…\n We haven’t made that decision completely yet, Josh, but we will make it in the next four or five days. Josh, fundamentally, as you start looking at, again, as we start developing more and more of the models so that we can report it appropriately out to you guys, what you will notice is that effectively the – effective proceed price contribution from an ARPU standpoint effectively is actually increasing given that most of these additional subscription services that are coming on are not just licensed, but they’re managed services with at pretty high margin. So it’s – typically, we’re seeing an effective average selling price going up over time. Well, as Doug said, it’s going very well, but we don’t expect to start selling that until probably the end of this quarter. So currently, the sales are going to be very small, but I’m going to let Doug and Jon Brinton talk about that so you know exactly where we stand. There’s two portions of that relationship, because it’s a very symbiotic relationship. So it won’t be broken out any way, shape or form. On the CCaaS, it’s exciting because as we roll out the CCaaS offering, as Steve said, at the end of this quarter, beginning of Q3, we’ll see a real nice monetization on that. So I’ll have Jon explain how we’ll start seeing a nice uptick on that because contact center seats really drive a much, much higher price per seat type revenue. So Chris, as Doug stated, if you – once Mavenir begins to sell and propose our UCaaS that would be reflected in our software solutions revenue along with other clients. For the CCaaS opportunity, the exciting thing about that is that while contact center customer experience workers are a small percentage of the overall workforce, the average revenue per user in our retail offering under the Crexendo VIP brand would be about four times the revenue that we would get from a UCaaS user. Well, if you know the way our backlog works, it’s on a 36 to 60 month contract. So part of it is going to be immediately recognized and the rest of it’ll probably be over a blended rate of 40, 42 months. So it’ll give you a kind of an idea, but we break that down on an annual basis so that you can see that snapshot. But the backlog increase is exciting, because again, as Steve highlighted, that’s a revenue stream that’s locked and loaded. So just to reiterate, that’s contracted revenue that we haven’t recognized yet. So for 2022 remainder, it’s approximately $16.9 million. In other words, it’s kind of like a diminishing lease as time goes by, it’s front loaded, and as time goes by, a little bit lower on the back end, but as you know, the backlog has been increasing. Well, let me tell you something, it’s a two edge sword to give out guidance if you will, if you make it or beat it, it’s positive. If you miss it and there’s a lot of reasons why you might miss it, it’s negative. If you just look at that based on where we are, we should hit north of $40 million this year. And I expect I’ll be disappointed if it’s just $40 million, but right now that’s higher than any analyst hasn’t said. If you take the current quarter and just put normal growth on that, we’re going to have about $34 million or $35 million in revenue. Then you take the fact that we’re going to be charging a little bit more for our products, so we can do more for our customers. And these are mostly our licensees, but that should add $2.5 million to $3 million in revenue. Now you’re up to $34 million, $36 million, $37 million in revenue. Now you’re up to about $42 million, $43 million in revenue. We’re continuing to get our revenue a little more streamlined, so it’s more predictable. But if people don’t agree with that, they can move their money if they agree with it, they can buy more. I’m just pointing this out to you, Ronald and I hope you agree with me. And I would highlight Ronald that if you look at our numbers, I mean, for the quarter, we had over $1 million worth of stock comp expense and $600,000 of intangible asset amortization. So that’s why we’ve been highlighting non-GAAP profitability, because when you take those numbers out, we’re in a much stronger position, but that the amortization of intangible assets and that’ll be on the books for some time. And let me just tell you that the headwinds one more time, we’ve had lockdowns, we’ve had COVID spikes, we’ve had inflation, we’ve had interest rate uncertainty. We’ve had business slowdowns, employment difficulties, and the stock market is in a mess right now. And we’ve had supply chain issues and who knows maybe next quarter will be in a recession, I hope not, but we could be. I’m sorry to get a little excited here, Ronald. No, that’s – I think the stock in the market is looking for net GAAP earnings and I think that’s what’s going to really drive the stock. Well, in this market, you’re probably right. The marketplace is, as it becomes more and more rational, right now, you’re seeing irrational further on the downside, but I think in the next quarter or so it’s going to be more rational and people are looking for GAAP earnings. First of all, we’re going to get revenue at least half of it of the 40% to 50% from acquisitions and half of it approximately from organic growth. But I’m going to let Doug, who’s a little closer to that than I am answer that question. Obviously, Chris, there’s lots of opportunities out there. Obviously, it’s going to be accretive in anything that we look at doing. And so I think with the current market environment, there’s lots of opportunities out there. We have lots of opportunities that we’re considering and as Steve said, I mean, I wouldn’t be surprised if we have an opportunity closed before the end of the year. So when we look at our acquisition strategy, it’s revenue, it’s accretive revenue and synergies. And by the way, this goes back to Ronald’s question, Chris, they’ve got to be cash flow positive or – with that in mind, they need to have a plan to get the cash flow and preferably GAAP positive. Hey I have a few questions, if you don’t mind. So you just reported $3.3 million in the quarter, and it sounds like some of sort of the shortfall versus where expectations were was because really more of an accounting change, where you guys are pushing more of the SaaS approach versus the traditional perpetual. We saw, if you look back in the business, I don’t know, 10 years ago and beyond when a lot of software companies made that transition. So in this case, it’d be the first quarter of last year versus what you guys just reported. So I’m not sure what the data looks like, but I guess the point being that a lot of the negative response from the market sort of – you can look through that and just focus instead on the underlying economics of what’s happening. But first of all, if we have a metrics, that’s going to be forward-looking. And it’s probably guessing at what we’re doing, and I don’t like to guess at anything. I’d like to have information that we can feel, touch, smell, measure, measure, measure, and measure. And if we get there, Rafe, you’ll be the first one to know. But again, when we look at the bookings, subscription services bookings are probably almost double or 100% of what they were previously because we weren’t doing subscription services in January of last year. But I think that we’ve traditionally, quarter-over-quarter, have seen increase after increase after increase in the software solutions bookings. Rafe, I think that’s a great question. And so giving you just kind of some ballpark number would probably be inaccurate or not appropriate, but as we develop those, we absolutely want to – because we need those to obviously manage the business as well. But as we dig into the models of how to model the business as we go forward, we’ll be happy to share those with you. Ron, I don’t know if you want to add to that. And then I guess the second question on the related point is, you had mentioned that about $800,000 of the software solutions business was one time, which would imply about $2.5 million was sort of the recurring. Is that some sort of a decent baseline that we should go off of for sort of a quarterly basis going forward there a bit of a reset to that line item, and then just kind of layer on top of that. You’re history as a proxy for the future, yes. Looking at cash on a balance sheet, it looked like you guys had about $6 million at the end of the quarter. As I said, Rafe, we’ve got lots of deals in the hopper. But I would say that probably all considerations are on the table depending on the opportunity, but combination of cash, stock and financing or probably all in on the table for any of the deals that we’re looking at the moment. There’s – basically, there’s no set formula. One of the things that really excites me about the opportunity is you basically have an exciting low cost pricing strategy where you can go after the larger players, the entrenched players and offer a much better cost, because they have a large installed base. So there’s a real opportunity to get very big, very fast with competitive pricing. So they’re going to charge so much for their – to the end user, but it’s all about cost in this business. If they can get the cost down, that’s money in their pockets or more money, they can pay their employees with et cetera, et cetera. So that – in addition to great product and everything else you do, there’s a real opportunity that the market may not know about. Those days, maybe behind us for a while, and it’s real blocking and tackling, which you guys are used to. And I think…\n Getting back to Ronald’s question or his comments, I think the market is going to be more rational and they’re going to look at metrics versus pie in the sky. And so one of the things that you had spoken of at the last meeting is that, because it’s going to take longer to do this really strategically and blow this out as a big profitable company that you are thinking of allowing patient investors to have some small reward with a small dividend. Well, there’s a couple of moving – couple of moving parts, Michael. And I guess, the other thing is that because the market has, in general, collapsed for a smaller technology companies, it’s harder for people to buy the stock that is below $3 a share. So hopefully that’s going to quickly get resolved, because I think you have a really promising long-term business opportunity and I’ve been a continued supporter and I believe the team will do very good. So when we do these investor presentations, we’re highlighting on the fact that we have been successful in the fact that we stated we were going to uplist to the NASDAQ, we did that. What they do with that is yet to be seen, but we feel like there’s tremendous opportunity where we sit today. My closing remarks are everyone is working very, very hard here at Crexendo, and we’ll continue to work hard. Everyone in this room is a shareholder and we’ve all got a lot of skin in the game, either spread equity, actual dollars or just the fact that we hate losing. And with that, I’m going to wish everyone a good summer and we’ll be back after we have Q2 numbers."
}