{
    "symbol": "HBB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 12:25:06",
    "content": " At this time, I'd like to welcome everyone to the Hamilton Beach Brands Holding Company Q4 2022 Earnings Call. Yesterday after the market closed, we issued our earnings release for the quarter and full year and filed our 10-K with the SEC. The company disclaims any obligation to update these forward-looking statements, which may not be updated until our next quarterly conference call, if at all. Sally is an accomplished senior finance leader also brings a strong track record in value creation, digital transformation and M&A integration. I look forward to meeting many of you and working with our shareholders, the analysts who follow the company and other investors who are interested in learning more about Hamilton Beach Brands. I plan to take the next few minutes to provide an overview of our performance for the fourth quarter of 2022, the full year 2022 and our outlook for 2023. While the small kitchen appliance market proved to be slightly softer than we anticipated, in the fourth quarter, we were pleased with our results. We attribute our results to our investments in several areas, including the global commercial and premium products market, which I will elaborate on in a moment. Additionally, we believe our performance underscores the strength of our business model, the value of our portfolio of trusted well known brands and products and the ability of our team to execute well in the face of industry wide challenges. In the fourth quarter, the softer consumer demand was due to households adjusting spending patterns in response to inflationary pressures and economic uncertainty. While we were on track to significantly reduce inventory in response to retailer and consumer trends, we decided to provide additional promotional support. These efforts while successful  short term pressure on our gross profit margin, we expect our gross profit margin to return to its historical range as the year unfolds. This reflected the short term gross profit margin contraction, partially offset by lower SG&A expense. By the end of 2022, our inventory position improved significantly at a slightly better rate than expected. At the end of December, our inventory level was $156 million compared to $183 million at the end of 2021 and $245 million at the end of September. As of today, we have further decreased our debt and expect to end the first quarter at approximately $90 million. In the global commercial market, we finished the year at a record level and revenue increased 57%. Our premium market initiative continued to generate strong results and sales, increased 14.5%, e-commerce sales accounted for 45% of total revenue. And while our core brand revenue declined slightly, we grew our retail dollar share in the North American market. For the full year 2022, revenue was the second highest in our company's history and decreased only 2.6% compared to the record revenue of $658.4 million in 2021. Our operating profit increased 23% to $30.8 million compared to $31.5 million in 2021, including $10 million insurance recovery. With major investments and infrastructure behind us, including our new ERP system and our new US distribution center, we were able to decrease capital investments to $2.3 million compared to $11.8 million in 2021. Next, I want to highlight the many successes we achieved in 2022 due to the investments we made in our six strategic initiatives. They are designed to increase revenue, expand operating margin and generate strong cash flow over time. First, our initiative to lead in the global commercial market. Examples of new commercial products that are gaining traction include our MixStation, which makes milkshake treats, high performance blenders and our new BigRig line of immersion blenders that we introduced as part of our strategy to expand into back of the house products. We also continue to invest in e-commerce, which is becoming increasingly important to the commercial products market. We continue to aggressively pursue new placements in the US and Canada, and we are focused on building the brand in the e-commerce channel. This includes maximizing online growth opportunities, increasing distribution in the sporting goods channel, expanding promotional opportunities and launching new innovations in the core preservation, processing and prep categories. This week, we announced an agreement with a company known as Numilk, which produces raw ingredients that combined with water to create a variety of plant based milk products. The Numilk system also saves customersâ\u0080\u0099 money, reduces shipping costs and has a positive environmental impact. Next, our initiative to expand in the home health and wellness market. Our focus is on the air purification, water filtration and home medical markets. This year, we are introducing a countertop Clorox theme sanitizer that consumers can use to kill bacteria on brushes, sponges and other kitchen items and still have a useful life. We've designed a new electric countertop water filtration system, creating a new category of easy to use appliances for consumers to access clean, great tasting water from their tap while reducing plastic bottle waste. Trends are well-known, the aging population is increasingly living with and managing chronic health conditions, demand for personalized healthcare solutions is rising in lockstep, the need exists in younger demographics as well. It recently became Medicare and Medicaid eligible for certain applications, which is expected to drive increased adoption. We remain intently focused on accelerating the growth of our core brands, Hamilton Beach and Proctor Silex. In 2022, we introduced 40 new product platforms, 32 for Hamilton Beach and eight for Proctor Silex. While sales of our core Hamilton Beach and Proctor Silex brands decreased slightly, in 2022, we outperformed the industry and gained dollar share in North America. For both brands, we increased our support for marketing communications, including online content, visuals and video to engage shoppers. We also increased focus on SEO optimization, social media advertising and influencer campaigns, gaining in important endorsements, awards and recommendations from a number of known trusted sources. In the e-commerce channel, our flagship consumer products earned a average 4.3 star rating. Plans are in place to drive growth of our Hamilton Beach and Proctor Silex brands, including innovative new product development and continued investment in digital marketing. The e-commerce channel represents a very strong and fast growing part of our business, brand reputation, product features, innovation and star ratings all play a critical role in driving online sales. In 2022, e-commerce sales accounted for 38% of total revenue and increased 3% on top of 22% growth in 2021. Our products receive favorable reviews from consumers, experts and influencers. We're supporting growth in digital engagement with online marketing programs, expanding our direct-to-consumer distribution operation, increasing our participation with pure play and  customers. The overall retail and the marketplace trends for general merchandise, home goods and small appliances are difficult to predict. However, it is challenging to predict the impact a softening economy will have on our industry over the next several quarters. It is clear that the US consumer is pulling back to some degree, we are basing our outlook on an expected moderate decline in industry demand this year. For the full year 2023, we expect total revenue to be flat to 2022, including a more challenging first half of the year, particularly in the first quarter. Specifically, in the first half of 2023, we see a continuation of soft consumer consumption trends. As a result, we have taken a more conservative view and expect a moderate decrease in revenue compared to the first half of 2022, particularly in the first quarter. The second half of 2023, we expect to benefit from continued progress with our strategic initiatives. Operating profit for the full year 2023 is expected to increase compared to 2022, excluding the $10 million insurance recovery. In 2023, we expect gross profit margin expansion compared to full year 2022. Again, we expect a stronger back half to offset a softer first half with the first quarter being the most challenging period. As always, our outlook could change if consumer demand or retailer replenishment orders are softer than currently expected. We feel it will be not as strong as 2022 but certainly strong, probably somewhere in the mid to high single digits, is the way it's currently looking, but that could change, of course. Our other programs that we're investing in some of these newer areas of innovation like the home health area, like some of our premium categories are also expected to grow. But in general, I feel that we have enough areas working for us that once we get through the first quarter and the first half of this year where thereâ\u0080\u0099s tough to know what the consumer is doing and retailers are doing to rebalance things. I will say that we're also in the next month or two, or three, we'll have a better picture on placements for the back half of the year. We're in the middle of line reviews, just starting promotional discussions for the back half of the year. And we have a lot of good things to talk about with our retail partners, we just need to firm things up. So generally speaking, I think we've got to get through the first quarter and the first half. So I think in general, we've got good support from our retail partners, a very strong online business, which is sort of is the best place for us to showcase our products, quality, store ratings et cetera. Again, quarter-by-quarter can always be a challenge but we have things going for us where I'm hopeful that we'll do better in the marketplace. So what weâ\u0080\u0099ve always tried to do is whether costs are going up or down, work closely with our retail customers to just stay whole when it comes to those cost changes. So as they've come down, we've proactively worked with retailers to price our products to be sure we're competitive, protect our margins, but also try to be sure that we're putting pricing out there that's going to excite customers to purchase more. So as we went into last year and we had to raise prices, it was very difficult to know whether that would drive top line and units would hold or whether consumers would just trade up and down, and it really wouldn't impact sell through or hurt sell through. And so clearly, the price increases that we took and everybody took did not -- were not additive to the marketplace. So as we go into 2023, as we reduce prices, there's a couple of things that we'll have to figure out. So in the short term, month-to-month, we're going to be dropping our invoices to retailers and that will flow through their on hands. Early on we're seeing some response by consumers that when we reduce prices, the units are picking up and they're responding favorably to those. So our general set of thought is that just like when prices went up, it was not all additive that when prices go down, it will not decrease from our performance that consumers will move around their purchase desires, and it will be a modest change up or down, that's a big assumption. But right now, we're seeing that consumers -- as prices come down, consumers are responding to those products that are now at lower prices. But my sense is that sooner or later they're all going to be either with us or following suit, because the marketplace is going to drive all of us to be competitive on pricing. I think really, our view is that that's probably a full year 2023 where we'll end up for the full year. As I mentioned, in the first quarter we're working through balancing retailersâ\u0080\u0099 demand here earlier in the year, sort of uncertain how things are going. As second quarter goes on the back half of the year, we think that's where the chance is going to be to balance out our full year performance. I think right now, as we've -- as costs have come down and we pass along price decreases and we also monitor our promotional cadence, we're starting with how do we protect our margins and stay competitive. While the macro environment in 2023 remains uncertain as consumers continue to invest spending patterns due to inflationary pressures, we've always said our company is focused on long term value creation. I am confident that we are stronger than ever and well positioned to build on the successes we have achieved, our investments in infrastructure, combined with our asset light model as well as our net working capital returning to historical ranges."
}