{
    "symbol": "MLKN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-30 02:31:04",
    "content": " For nearly a year now, you've heard us say that MillerKnoll's competitive advantage is our unique combination of a strong global contract business and a well-positioned retail business. Reinforcing Andy's earlier point, sales in our retail business have nearly doubled in the past two years, moving it from essentially breakeven operating margins to consistent double digits and we see tremendous opportunity ahead for further growth. And then in the retail business, we're seeing, on average, longer lead times compared to prior years on the order of about four weeks longer in total for The business compared to where we were last year at this time. And the one thing I'll add to, Greg, because the contract business is known for the price lag but I would say in retail, Normally, we would expect to see a much faster turnaround in pricing because it's much more dynamic and agile. So there's a little bit of a lag in the retail business as well due to the same constraints that we're seeing in the contract, not as much but it's still there. And so you have to take on a lease, you have to staff -- so that is likely in the next quarter or so to take a bit of a step backwards in terms of overall margin flow through, we're very, very confident, though, that, that's accretive for the business is the right move going forward. I think there's certainly across the globe but pent up demand but I think the bigger news for us is that there really is a complete rethink about how people are working and how they're thinking about their office space shared, remote and hybrid -- and I think that's what's really contributing to kind of the -- that we're seeing in the A&D community and the design community about office space. There's a lot changing, we feel very good about the aggressive price actions we've taken through it would be February kind of mid-February on the Knoll brand would be the most recent and absent some of the recent moves in oil prices and that are filtering through the economy in transportation costs, we felt like we had moved enough to cover these costs given enough time and that we would exit FY '23 ahead of pre-COVID margin levels on a combined basis. I would say any slowing in growth that we're seeing is really related to kind of Omicron that happened in December, January, a little bit of slowdown in what we were able to ship in that time based on labor shortages, all the things that everyone else is saying, it all happened to us, too. And because orders have been quite strong throughout the third quarter, even our most recent price increases which for the contract business was a 10% list price increase there's a good chunk of the backlog and has that in it as well."
}