{
    "symbol": "GES",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-14 20:02:05",
    "content": " Good afternoon, everyone, and thank you for joining us today. Good afternoon, everyone, and thank you for joining us today. This results cut a strong year for Guess, where we grew revenues by 4% in U.S. dollars and 12% in constant currency and delivered almost 10% in adjusted operating margin and $2.74 in adjusted earnings per share. For the year, in constant currencies, impressively, we grew our business by 12% to $2.9 billion, but currency headwinds consumed $217 million of that growth, resulting in the 4% U.S. dollar increase and $2.7 billion of revenues that we are reporting today. European operating earnings decreased 5% and operating margin declined 260 basis points as the benefit of sales growth was more than offset by the negative impact of currencies and the prior year's fourth quarter COVID subsidies, which did not repeat this year. Again this quarter, our tourist locations outperformed the rest of our store fleet though that differential is narrowing as we are anniversarying a more normalized level of travel in the U.S. Americas retail operating profit declined 12% and operating margin declined 180 basis points, driven by a lower mix of full price selling and higher occupancy costs, partially offset by an IMU improvement. And finally, in our Licensing segment, royalty revenues declined 8%, segment operating profit was $22 million, a $2 million decline from last year's Q4. In Q4 last year, we also received government subsidies, which did not repeat this year, partially offsetting those factors were a $13 million favorable currency impact and lower performance based compensation charges, given last year's exceptionally strong performance relative to operating goals. Our fourth quarter adjusted operating profit was $108 million, 14% lower than last year and our adjusted operating margin was 13.1%, 260 basis points lower than last year's Q4. I think one of the things that's also clear is that, over the last few years this business has driven fairly robust margins and then even for this year that's expected to continue. And with growth and some mix shift, we should be able take that portfolio of tailwinds and offset those headwinds with one exception, currency still remains a headwind for us and that's -- if you think about the year we just completed where we delivered a 9.8% operating margin we told you we see about a 70 basis point headwind in currencies."
}