{
    "symbol": "GES",
    "quarter": 1,
    "year": 2023,
    "date": "2022-05-25 22:29:04",
    "content": " We delivered a 7% adjusted operating margin and our adjusted earnings from operations increased 61% from last year, reaching $41.7 million. Our Europe segment exceeded our expectations, achieving top-line growth of 14% and operating earnings that was four times higher than last year's. While the Europe wholesale business had lower revenues in the quarter as a result of timing shifts in the business and currency impact, I am pleased that the business continues to trend well with the Fall Winter ‘22 campaign closing up 14% and the Pre-Spring summer '23 campaign starting strong with a positive response to the collections and the prospects for another double-digit performance. In fact, if this year's currencies were at last year's levels, we will be looking at revenues growing at 10% and reaching $2.850 billion and adjusted operating margin at 11.3%, with earnings reaching roughly $320 million. First quarter revenues were $593 million, a 14% increase in U.S. dollars, and a 21% increase in constant currency. Our revenue growth was primarily driven by last year's temporary store closures, which were worth roughly 8% of revenue growth, as well as strong performance in our European wholesale business along with higher Americas wholesale shipments. Currency headwinds resulting from the relatively strong U.S. dollar muted much of that growth, negatively impacting U.S. dollar revenues by $33 million, or 7% of revenue growth. The main driver for constant currency revenue growth was the removal and easing of many of the COVID related restrictions from last year, which kept a substantial amount of the fleet partially or fully locked down, especially in the first quarter last year. Adjusted SG&A for the first quarter increased 11% to $205 million, including a favorable currency impact of $10 million compared to last year’s expense level. Inventories were $484 million, up 20% in U.S. dollars and 31% in constant currency versus last year. For the full year based on our outlook and assumptions, currencies will consume nearly six percentage points of top-line growth compared to last year, roughly $40 million of operating profit, and almost 100 basis points in operating margin. Your line is now open. I mean, if you look at the first quarter performance with constant dollar revenues being up 26%, we comped positively 7% in the stores with strong traffic in AUR growth. Your line is now open. Your line is now open. Your line is now open. And that compares to 404 million a year ago, so $80 million over the year ago period that represents 20% in U.S. dollars, but it's up 31% in constant currency, which is, just you look at the number and you say, Wow, that's a big number."
}