{
    "symbol": "TBLT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-23 21:16:05",
    "content": " Again, my name is Martin Galstyan, and I am the Chief Financial Officer of ToughBuilt. Joining me on today's call is Michael Panosian, President and Chief Executive Officer of ToughBuilt. Before turning the call over to Michael, I would like to remind you that any forward- looking statements made by management are covered under the U.S. In addition, during the course of the call, we may refer to non-GAAP financial measures that are not prepared in accordance with accounting principles generally accepted in the United States and that may be different from non-GAAP financial measures used by other companies. The reconciliation of non-GAAP financial measures to the most directly comparable GAAP financial measures are contained in our earnings press release issued earlier today, unless otherwise noted therein. Thank you, Martin, and thank you all for joining us on today's call. The first quarter of 2022 was very strong for ToughBuilt, culminating in revenues of 17.2 million and approximate 40% year-over-year increase compared to 2021. Revenue growth in the first quarter was driven by a combination of onboarding new retail customers, demand to expand new categories within our existing customers, and the introduction of new products. Our unique platform has proven to be a tremendous draw for professionals eager to join our organization known for its creativity, and the ability to quickly and efficiently bring ideas from concept to shelves in a matter of months. To help combat logistic related costs in 2022, we have negotiated improved shipping rates, as well as working with our large retail partners to implement direct import ordering where possible. In the months to come, we anticipate that this will decrease our shipping costs by shifting several supply chain steps from ToughBuilt to our partners. This is a win-win scenario in which our larger partners can leverage their existing logistics infrastructure to ship at cheaper rates, while allowing us to focus on designing and manufacturing innovative products, thereby enabling more lines or products to be shipped. Revenues for three months ended March 31, 2022 were approximately 17.2 million, an increase of 40% compared to the same period in 2021. Cost of goods sold for three months ended March 31, 2022 were approximately 14.2 million compared to 8.8 million for the same period in 2021. Cost of goods sold increased primarily due to industry-wide supply chain disruptions, which have led to historically high shipping costs, and increases in the cost of materials. Selling general and administrative expense for the three months ended March 31, 2022, were approximately 15.9 million, compared to 7.9 million for the same period last year. SG&A expenses increased primarily due to the hiring of additional employees, and the increased use of independent contractors, which when combined now include 198 people. Research and development costs for the three months ended March 31, 2022 were approximately 2.5 million, compared to 1.4 million for the same period in 2021. In the first quarter of 2022, we had a net loss attributable to common stockholders of approximately 12.2 million or a loss of 14.04 per share. As of March 31 2022, the common basic and diluted weighted average common shares outstanding totaled 861,997 shares. Before I open the call for questions, I would like to reiterate the tremendous market opportunities that exist at ToughBuilt, and the infrastructure we have in place to capitalize on those opportunities. Right now, the top retailers around the world are selling ToughBuilt products, and we continue to expand to new retailers and strengthen our existing relationships. As demand for our products increase, we continue to expand our capabilities and are currently in a position to launch five to 10 product lines every year. To capture additional international ecommerce demand, we will be offering ToughBuilt products on Amazon in Europe and Latin America. As we look ahead, our future revenue opportunities can be broken into three buckets, expanding the existing relationships with retail partners, adding new retail partners, and introducing new product categories. These revenue opportunities are dependent on one another, but ultimately driven by end user recognition of our brand, quality and innovations. For example, when we onboard a new retail partner, the first order typically includes a select portion of ToughBuilt SKUs. As underlying customer demand for these products grows, the retailer is likely to expand the number of products offered in their stores or made available online to their customers. Furthermore, as we introduce new products that are differentiated from their current offerings, our existing retail partners are more likely to expand their offerings to increase those newest items. To us, this demonstrates the longevity of ToughBuilt’s brand, and products. I along with the entire ToughBuilt organization including our best-in-class design engineers that work on never-before-seen products for home improvement, have full confidence in our ability to operate and design unlike any other company in the world. With that, I would like to turn it over to our operator to begin the question-and-answer session. So a lot of our purchases now are being -- we are asking our clients to basically take it directly from the factories, those who can will have more savings on their part. And instead of ours, which is more expensive than their shipping costs. This is important because I don't want our shareholders to think that we don't think about these things, or we're not serious about these things. And also, we are launching a lot of lines. Now some of the initiatives is, we are going to reduce our shipping costs, mostly because we are negotiating a contract that will drastically reduce our costs from what it was last year. Also, we brought in all the marketing and social media in-house and that's going to save us quite a bit of money as well. Do you still expect to be able to introduce products as you had hoped or you think it make some sense to –\n Yes, somewhere between five to 10 lines. That opens a lot of doors within our current existing customer base, as they love our products, and they're taking more and more. So to generate more revenue to cover more of our costs, the fastest way is that. Secondly, we are adding new customers and each new customer, we add is taking a wider range of product lines. Just to make sure that everyone understands, again, this is important, we are building two platforms, once these platforms are complete, the flywheel is going to be very strong. The two platforms are our sales platform globally, and our internal design and engineering team so that we can launch over 20 lines of products per year. So in general, imagine somewhere roughly a $5 million revenue per every new product line that's introduced. So once we are launching 20 of them, every year, we'll have $100 million growth, so on so forth, it's painful to build this platform. Both Michael -- both Walmart and Target seem to think that some of the logistics issues are in sourcing, I guess, are working some of the kinks out. Well, we have actually reduced some of our costs before we were paying somewhere around $21,000 a container when this whole thing started this pandemic and the demand. And then now we're pushing it down another considerable amount, which I hope to announce sometime within the next month or so. I see it also going back towards normal, but it's far from being normal before we used to pay somewhere between $3000 or $5000 a container. Yes, in general, but there's some of them that have issues in rising costs in materials, even metal costs go up and down in different regions of the world. Because the costs are extremely high for the microchips and other electronic parts, which are also very difficult to get even with the high costs. So for those products, we kind of holding on until things normalize. And it is normalizing, it's just not in my hands, how quickly it can normalize. I know they contributed in the fourth quarter, was March similar sales level or has -- pulling back a little bit for tailed sales of electronics. We look at the success of a product two ways, what it does over a year, and what it does, how much life it has over the years. Could you talk a little bit about the distribution side obviously, it's penetrating deeper into existing customers and bringing new products on board. New customers, because of all the hard work, investment, and exposure we've given, are becoming faster to add-on. So the way we do that is as our portfolio is wider, they take us in easier, rather than having one or two lines of items, and then convincing them to take us. So we are doing that mostly throughout Latin America, all over Europe, which is 40 countries plus, we are just starting efforts in the Middle East. We also selling into the East, in Korea, starting to sell into Japan and other surrounding countries as well. Thank you very much, Michael, appreciate you taking the questions. I'll now turn the call back over to CEO, Michael Panosian for closing remarks. In closing, I want to thank our investors and our employees for growing ToughBuilt into a quality first brand that customers can rely on and remaining dedicated to our mission, even through a global pandemic."
}