{
    "symbol": "IPA",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-14 14:48:04",
    "content": " Also on the call with us today are Jennifer Bath, Chief Executive Officer; Brad McConn, Chief Financial Officer; Ilse Roodink, Chief Scientific Officer; and Barry Duplantis, Vice President of Client Relations Before we get started, remember, some statements we make today, may be considered forward-looking statements for the purpose of applicable United States and Canadian securities laws. On today's conference call, non-GAAP financial measures may be used to help investors understand IPA's business performance. We remain highly confident in our ability to grow revenues through new and existing clients, novel high revenue value - high-value revenue streams, and importantly, the commercialization of disruptive AI-driven in silico technologies, offered through our newest subsidiary, BioStrand. Additionally, four of our potential best-in-class and first-in-class therapies from our internal pipeline, are now positioned for active licensing, with the aim of commercialization this fiscal year. Lastly, we simultaneously prepare the regulatory submission of IPAâ\u0080\u0099s four anti-SARS-CoV-2 antibody therapeutics, which have sailed through preclinical IND-enabling studies, and remain the only first-generation therapy to retain efficacy against all tested variants of concerns, including the most recently screened BA.2.75, with more details on that program to come on this call from Dr. Roodink. We believe this will revolutionize the antibody drug discovery and development market, as it results in knowledge and insights that dramatically speed up parallel hypothesis generation, target identification, antibody discovery, antibody engineering, and druggability profiling. Actionable data is the first prerequisite for making progress in the world of personalized medicine, of which the global market size is expected to reach $5.7 trillion US dollars by 2030, and to expand at a CAGR of 11.6% from 2020 to 2030. Second, we have expanded our database extensively with antibody libraries, structural libraries, scientific literature, and the integration of Talem's proprietary data lake derived from multi-species genome reference sequencing, structural crystallography, and functional metadata, all to improve and enrich analytical capabilities for both IPA and Talem. Third, and lastly, we've also evolved LENSai into a self-adaptive feedback loop platform, where HYFTs are continuously enriched with structural and functional metadata, accelerating time for discovery and supporting our world-class function first B cell platform. Building on these recent advances, we've spent the past quarter generating multiple exciting case studies with in silico validation, which are pending wet lab validations, with final results aimed at release this quarter. While we won't be sharing any of our in silico validated case studies under in vitro review until later this quarter, we are happy to share one of our case studies that we produced since past April, this one, with the aim of analyzing a blockbuster monoclonal antibody that had been sponsored by a top 10 pharma, that was deemed a commercial success, but for which adverse events emerged and were occasionally fatal. So, as an example of one of our earlier case studies, antibody X is a commercial stage anti-cytokine antibody used in the treatment of a wide variety of inflammatory conditions, such as rheumatoid arthritis, Crohn's disease, and ankylosing spondylitis. By using HYFTs transcribed omic sequence data, and a binding prediction algorithm, we identified what we believe to be a common binding site between antibody X and the fungus aspergillus. This novel interaction could have been predicted using BioStrandâ\u0080\u0099s holistic multi-species approach, which would've helped prevent the adverse events, by allowing the sponsor to preclude patients with previous aspergillus infections from both the clinical trials, and also from post-trial treatments. The in silico case studies currently undergoing wet lab validation, are focused on demonstrating the ability of HYFTs fingerprints to rapidly revolutionize the fields of antibody humanization, transgenic animal usage, biosimilar discovery and development, in silico identification of antibody functions, and much more. The combination of IPA's function-first B cell Select workflow, and the untapped potential of the rabbitsâ\u0080\u0099 immune system, produces highly selective, high-affinity antibodies that provide our clients with a best-in-class solution to complete a critical piece of the therapeutic equation. Thirdly, IPA has just completed the onboarding of another major pharmaceutical company, meaning that IPA now has had a contract service-based relationship with 80% of the globe's top 20 pharmaceutical companies. Finally, IPA has begun to see an increase impact from hedge fund-backed virtual biotherapeutic companies that lack or are very limited in wet lab facilities and capabilities, and are often headed by researchers that have had previous experience with IPA's team and services while serving in past position at other IPA client companies. An example of this impact is represented by the fact that in this past quarter, two of IPA's top five revenue-generating clients operate with less than 10 employees. We are excited to turn our attention to Talem Therapeutics, where we will be discussing our recent scientific developments and current outsizing efforts with regard to five key Talem assets, our PolyTope program, also known as TATX-03, TrkB or TATX-112, TATX-24, our companion arm for bi or multi-specifics and TATX114. For PolyTope, TATX-03, it is our Talemâ\u0080\u0099s first generation for antibody combination therapy against -SARS-CoV-2. Because of PolyTope's performance in the neutralization assays and in vivo - and in vitro preclinical safety and quality assessments, Talem has received strongly positive regulatory feedback from the EMA, and is now finalizing clinical trial agreements and pushing hard to move PolyTope into the clinic. Based on this revised timeline, submission of the clinical trial application to the regulatory authority is scheduled for Q4 of this year, with the first in-human trial expected to start early calendar year 2023. These programs are known to have very favorable earning potential in terms of the clinical cost to asset revenue ratio, a factor often overlooked due to the lack of infectious disease clinical trial expertise in the industry. Building on the already attractive market position, Talem has secured an extremely advantageous manufacturing deal that should alleviate any concerns associated with the manufacturer of our four antibody combination therapeutics. Although bispecific assets from this program have already been made available for out-licensing, we feel that this asset being potentially first and best-in-class, the addition of in vivo data would create a more complete data package to attract more favorable offers. Also, as recently announced, the expansion of our in-house vivarium located in Victoria, British Columbia, was completed during this first quarter, and the facility is now fully in use, with a new procedure room and higher animal capacity to support the growing demand for ITâ\u0080\u0099s antibody discovery program. IPA recorded total revenue of $4.7 million during the first quarter, a 2.2% increase from $4.6 million during the first quarter of fiscal 2022. One item I do want to highlight, we generate approximately two thirds of our revenue at our sites in the Netherlands, which has caused our revenue on a consolidated basis to be negatively impacted by the weakening of the Euro, as results are translated into Canadian dollars. The negative impact of revenue during the first quarter was approximately $300,000, as compared to the first quarter of fiscal 2022. Gross profit for the quarter totaled $2.5 million, a decrease of 1.1% compared to the same period last year. The increased cost of sales is primarily attributable to higher cost for lab supplies, and a project mix during the quarter requiring more work to be outsourced to third party contractors Operating expenses during the first quarter totaled $12.6 million, an increase of $6.6 million compared to the same period in fiscal 2022. IPA continues to strategically invest in the PolyTope antibody combination therapy, and incurred $5.2 million in costs during the quarter for GMP manufacturing of the therapy in quantities sufficient for Phase 1 and Phase 2a clinical trials. Salaries and benefits increased $700,000 compared to the first quarter of fiscal 2022, due to the addition of strategic leadership roles, routine pay increases, and additional staff added from the BioStrand acquisition. Consulting fees increased $400,000 year-over-year due to services related to the BioStrand acquisition, and management fees totaled $200,000 as compared to nil during the first quarter of fiscal 2022, due to contracted general managers at the BioStrand site. Other income totaled $300,000 during the first quarter of fiscal 2023, compared to $400,000 during the same period last year. The largest variance of note is a decrease in unrealized foreign exchange gain of $400,000, compared to the first quarter of fiscal 2022. IPA did record $300,000 in grant income compared to nil during the first quarter of fiscal 2022, as we received the first disbursement of funds from VLAIO, the research fund of the Flemish regional government in Belgium. All told, IPA recorded a net loss of $9.4 million during the first quarter of fiscal 2023, compared to a net loss of $3.2 million during the same period last year. As previously, noted cash expenditures increased during the quarter, as we made strategic investments in the PolyTope antibody combination therapy. As we noted in previous quarters, IPA has put in place an at-the-market equity offering facility, which entitles us, at our discretion, and from time to time during the term of the ATM agreement, to sell through our agent, H.C. Wainwright & Co., common shares having an aggregate gross sales price of up to US $50 million. As of today, all US $50 million of IPA stock remained available for sale under the ATM facility. So, this grant is actually related to a number of the things that we shared about BioStrand's updates earlier today about the structural HYFTs, and the indexing of those structural HYFTs to enable us to search with structure and ultimately function on our software. A primary application for this approach is advanced structural search capabilities and structural predictions, with a particular focus, at first on antibodies, as well as G protein-coupled receptors, better known as GPCRs. By linking HYFTs with the 3D structure and function of proteins and expanding our platform capabilities for AI discovery, we support an even wider array of applications, including assay development, biomarker discovery, and computer-aided drug design. More specifically, through November, the IPA sales team is planning to attend five conferences where we anticipate our focus, not only to be our advanced wet capabilities, wet lab capabilities, of course, but a major emphasis on the new opportunities through BioStrand, as we seek to present confirmatory studies demonstrating unprecedented in silico capabilities and offerings. They will be dividing their efforts between partnering meetings with in-licensing decision-makers, as well as presenting on IPA's capabilities as a leverage for Talem collaboration, with a core focus also on our in silico capabilities through the use of recently-developed case studies. And I'll start by saying, the first end market that comes to mind, and I'll share, has been one that we have had to turn clients down on because we simply don't offer those capabilities. After the discovery and development of a client's protein or antibody of interest at IPA, we often develop tailored manufacturing SOPs, and can conduct research-grade manufacturing, with customizable quality control for each product. However, when the client program requires a GLP product, for instance like an IND submission data, or GMP-validated product for clinical trials or for commercialization, the client needs to move to a GMP-validated third party CDML. However, with an extremely high client retention rate of around 95%, IPA is acutely aware of the fact that it is beneficial for both the client and IPA to complete the final workflow under one roof, and with the consistency of materials, reagents, equipment, and staff from research grade, all the way through clinical manufacturing. We've also announced plans for our off-location to move to a new facility in the second half of calendar year 2023, in this case increasing lab capacity by approximately 30%. So, these are offerings or things that we're using internally to continue to develop case studies and to enhance internal research, but also offerings that are available to our clients and partners as well. And our next question is, IPA had a very big loss this quarter and is down $19 million Canadian in cash. While our spend was up this quarter, primarily due to the clinical manufacturing we previously mentioned, this was an anticipated cost. As we previously stated, we've had several partners express interest in seeing the initial safety profile in human Phase 1, and we built in additional cost and time parameters to enable a smooth and relatively quick transition to any potential sponsors. So, to wrap up the conference call, we'd like to thank, first of all, IPA's employees, directors, clients, partners, and of course, our shareholders, for being a part of this exciting journey of acceleration and transformation with us. We believe that some of our more recent advancements have the potential to disrupt multiple industries going forward, including market sectors such as precision medicine, therapeutic antibody generation, vaccine discovery, and development antibody humanization, and the transgenic animal industry, and lastly, the market of biosimilars. Alone, the global monoclonal antibody market is expected to surpass approximately $524 billion U/s by 2030, registering a growth at a CAGR of 12.8% from 2022 to 2030. Our aim is clearly to capture a meaningful market share by offering unparalleled technologies in a truly end-to-end fashion, on an accelerated timeline, enhancing our already clinically-validated wet lab capabilities, with state-of-the-art in silico technologies. The surging prevalence of cancer and other chronic diseases is boosting the demand for biologics, and it's expected to foster the growth of the global monoclonal antibody market for the foreseeable future. Pharmaceutical company investments in genomics are rising, coupled with the emergence of technologically-advanced genomic platforms, such as multi-species next-generation sequencing, which is expected to significantly boost the antibody market in the upcoming years. Also, according to precedence research, monoclonal antibodies are widely accepted biologics that are expected to provide lucrative growth opportunities to the market players in the foreseeable future, driven in part by rising awareness regarding the benefits and effectiveness of monoclonal antibodies. Major specific areas of increasing investment by biopharmaceutical companies are in the areas of human monoclonal antibody research, multi-omic analysis, and research on the molecular basis of disease and growing next-generation applications of antibodies."
}