{
    "symbol": "TBPH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 21:25:20",
    "content": " Slide 7 shows Theravanceâ\u0080\u0099s imply 35% share of net sales for YUPELRI during the fourth quarter of 2022 of $19.5 million, up 27% from Q4 of 2021. I am also pleased to highlight that the implied 35% of YUPELRI net sales for the full year of 2022 was $70.7 million, which represents a 25% year-over-year net sales growth. Looking specifically at the Theravance hospital efforts on the right side of Slide 7, in Q4 of 2022, doses sold exclusively in the hospital setting represented an increase of 22% from the previous quarter, demonstrating the highest quarterly hospital volume launch to date, which led to full-year growth of 53% over 2021. Turning to Slide 8, YUPELRI share of the hospital setting decreased to 12.5% in Q4 of 2022, although YUPELRI's hospital volume continues to set a new quarterly high as seen on the previous slides. The growing new patient starts and overall demand are seen as key indicators and growth accelerators for 2023 performance, while recognizing the seasonality trends that typically softens performance in the first quarter of each year, we believe the team's historical ability to execute through the pandemic in addition to the remaining sizable niche opportunity for additional YUPELRI patients equates to significant upside potential for the put in 2023 and beyond. As Rick mentioned earlier, we have increased the program by $75 million and $250 million to $325 million is completed approximately $155 million today in the form of share buybacks, including $60 million completed in the open market, which was initiated in mid-December. Our end of 2022 cash balance of $327 million excludes the remaining $197 million earmarked for a return of a program in 2023, including the amounts already purchased in early 2023 and the remaining amount on the program as of today. Obviously, we've got -- we'll still continue to spend on YUPELRI and a bit on ampreloxetine, but the -- we'll certainly look at returning capital as we can in excess of the $325 million."
}