{
    "symbol": "SEAC",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-12 20:45:27",
    "content": " We aim to accomplish this by, first, removing the streaming market entry barrier and enabling content owners to address their audiences and monetize their content catalog with a premium direct-to-consumer streaming service; second, by building out SaaS and consumption-based business models with a scalable, cloud-based and productized solution that generates high-margin revenues and long-term engagements; and lastly, by maximizing the value of our partners' catalogs and by monetizing the content with premium subscriptions or sophisticated service side ad insertion solutions. Our products, the Unified Advanced Advertising Platform for insertions into broadcast and IP; and Xstream, our FAST channel service platform for connected TVs, help us to accomplish this through several different ways: first, by protecting existing and generating incremental ad revenues for linear TV by enabling automated ad sales on broadcast streams which increases the value of underutilized inventory with real-time bidding; next, by ensuring optimized targeting with targeted and contextual advertising that will advertise based on the content being watched or the viewer's profile which can drive better monetization; and lastly, by enabling the distribution and monetization on connected TVs via FAST channel services, including play out and ad insertion. Product revenue for fiscal Q2 2023 increased 6% to $3 million or 41% of total revenue compared to $2.8 million or 42% of total revenue in the prior quarter. Service revenue for fiscal Q2 2023 increased 11% to $4.3 million or 59% of total revenue compared to 3.9% or 58% of total revenue in the prior quarter. Looking at our margins; gross profit for fiscal Q2 2023 was $4.8 million or 65% of total revenue compared to $3.2 million or 48% of total revenue in the prior quarter. Looking at our expenses; non-GAAP operating expenses for the fiscal second quarter of 2023 were $4.7 million, unchanged from the prior quarter. As a percentage of total revenue, GAAP loss from operations for the second quarter of fiscal 2023 was negative 89% which compares to negative 41% in the prior quarter. Non-GAAP income from operations for fiscal Q2 2023 totaled $11,000 or breakeven per basic share, an improvement compared to a loss of $1.5 million or a loss of $0.03 per basic share in the prior quarter. Non-GAAP net income for fiscal Q2 2023 totaled $47,000 or breakeven per fully diluted share compared to a non-GAAP net loss of $1.7 million or a loss of $0.04 per basic share in the prior quarter."
}