{
    "symbol": "SEAC",
    "quarter": 4,
    "year": 2023,
    "date": "2023-04-05 18:31:05",
    "content": " Total revenue for fiscal Q4 2023 increased 23% to $10.2 million from $8.3 million in the prior quarter, while full year revenue increased 19% to $32.5 million compared to $27.3 million in fiscal 2022. Services revenue for fiscal Q4 2023 decreased 35% to $3.9 million, or 39% of total revenue compared to $6.1 million or 74% of total revenue in the prior quarter. Revenue from our international markets in fiscal Q4 2023 was $3.3 million or 33% of total revenue, which compares to $3.6 million or 44% of total revenue in the prior quarter. For fiscal 2023, revenue from international markets totaled $14.4 million, comprising 44% of total revenue, which compares to $11.8 million or 43% of total revenue in fiscal 2022. Revenue in our U.S. markets for fiscal Q4 2023 was $6.8 million or 67% of total revenue, which compares to $4.6 million or 56% of total revenue in the prior quarter. For fiscal 2023, revenue from our U.S. market contributed to $18.1 million, 56% of total revenue compared to $15.5 million or 57% of revenue in fiscal year 2022. Gross profit for fiscal year 2023 was $20.5 million or 63% of total revenue, which compared to $16.4 million or 60% of total revenue in fiscal 2022. For 2023 fiscal year, as a percentage of total revenue, GAAP loss from operations was a negative 36% compared to a negative 34% in the year prior. Non-GAAP income from operations for fiscal Q4 2023 totaled $1.6 million or $0.03 per fully diluted share, which is an improvement compared to the $0.1 million or breakeven per fully diluted share in the prior quarter. Non-GAAP income from operations for fiscal 2023 totaled $0.3 million or $0.01 per fully diluted share, which was an improvement compared to the $4.3 million loss or a loss of $0.09 per fully diluted share in fiscal 2022. GAAP net loss for the fiscal year 2023 was $11.4 million, inclusive of the aforementioned goodwill impairment loss or a loss of $0.23 per fully diluted share compared to a net loss of $7.4 million or a loss of $0.16 per fully diluted share in fiscal 2022. Adjusted earnings before interest, taxes, depreciation and amortization or adjusted EBITDA for fiscal Q4 2023 totaled $1.7 million or $0.03 per fully diluted share. For the 2023 fiscal year, the adjusted EBITDA totaled $0.5 million or $0.01 per fully diluted share compared to an adjusted EBITDA net loss of $4.1 million or a loss of $0.09 per fully diluted share in fiscal 2022."
}