{
    "symbol": "OOMA",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-01 23:32:06",
    "content": " We delivered another quarter with strong financial results achieving $52.7 million in total revenue, which included approximately $0.3 million of subscription and services revenue from OnSIP for the last nine days of the quarter. On a year-over-year basis, total revenue grew 12% in the second quarter driven by the strength of Ooma Business, which accounted for 51% of total subscription and services revenue for the quarter as compared to 48% in the prior year quarter. Excluding the impact of OnSIP, Ooma Business subscription and services revenue grew 16% year-over-year in Q2 driven by user growth as well as ARPU growth. For the second quarter, total subscription and services revenue was $48 million or 91% of total revenue compared to 93% in the prior year quarter. Our blended average monthly subscription and services revenue per core user, or ARPU, increased 6% year-over-year to $13.80, up from $13.01 in the prior year quarter driven by an increase in mix of Business users, including higher ARPU Office Pro and Pro users. During the second quarter, we continued to see a healthy Office Pro and Pro Plus take rate with 47% of new Office users opting for these higher tier services, which was up from 45% in the prior year quarter. Total operating expenses for the second quarter, which included $0.2 million of OnSIP operating expenses, were $31.1 million, up $4.7 million or 18% from the same period last year. Sales and marketing expenses for the second quarter were $16.6 million or 32% of total revenue, up 22% year-over-year, driven by higher marketing and channel development activity for Ooma Business. Research and development expenses were $9.9 million or 19% of total revenue, up 20% on a year-over-year basis from $8.3 million driven by investments in new features for both Ooma Office and Ooma Enterprise as well as new products such as Ooma AirDial. Based on the midpoint of the updated non-GAAP net income guidance range of $11.9 million for full fiscal 2023, we estimate our adjusted EBITDA for the year to be approximately $15.6 million or 7.2% of revenue. First, we plan to be more judicious about our sales and marketing spend and target the spend level to be approximately 30% of revenue in the second half of this fiscal year as we successfully acquired approximately 50,000 Business users through OnSIP very cost effectively in the second quarter. Second, we expect to accelerate our R&D spend over the next few quarters to align the features between Ooma Office and OnSIP to ensure consistent and enhanced user experience for our Business customers. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}