{
    "symbol": "OOMA",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-02 22:52:05",
    "content": " Overall for FY23, Ooma achieved 24% growth in Business Services revenue, 12% overall growth in revenue, adjusted EBITDA of over $17 million and cash flow from operations of nearly $9 million. On a year-over-year basis, total revenue grew 4% in the fourth quarter, driven by the strength of Ooma business as well as the addition of onset. In the fourth quarter, business subscription and services revenue accounted for 55% or total subscription and services revenue as compared to 49% in the prior year quarter. On a full year basis total revenue was $216.2 million compared to $192.3 million in the prior year, representing 12% growth year-over-year including 24% growth in business subscription and services revenue. Ooma business subscription and services revenue grew 29% year-over-year in Q4, driven by user growth and the addition of OnSIP which continues to perform while with solid customer retention. For the fourth quarter, total subscription and services revenue was $52.6 million, or 93% of the total revenue compared to 91% in the prior quarter. As a reminder, subscription and services gross margin for the fourth quarter of this fiscal year included the impact of OnSIP gross margin, which is running lower relative to Ooma subscription gross margin of 74% when OnSIP is excluded. Total operating expenses for the fourth quarter were $32.3 million, up $4.4 million, or 16% from the same period last year. Sales and marketing expenses for the fourth quarter were $16.9 million or 30% of total revenue, up 16% year-over-year driven by higher marketing and channel development activity, for Ooma business which includes AirDial, as well as the additional OnSIP delayed expenses. Research and development expenses were $10.5 million, or 19% of total revenue, up 17% on a year-over-year basis, from $8.9 million driven by investments and new features for both Ooma Office and Ooma Enterprise, as well as new products such as AirDial. G&A expenses were $4.9 million, or 9%, with total revenue for the fourth quarter, compared to $4.5 million for the prior year quarter. Adjusted EBITDA for the quarter was $5.1 million, another record for the company or 9% for total revenue as compared to $4 million for the prior year quarter. This onetime event, which is expected to impact our residential services revenue is related to a customer who has been using Ooma Telo for their call centers for many years, and we have been anticipating their transition to another solution for some time."
}