{
    "symbol": "OOMA",
    "quarter": 3,
    "year": 2023,
    "date": "2022-11-30 20:12:02",
    "content": " Q3 revenue of $56.7 million was up $4 million sequentially and up $7.5 million year over year through a combination of growth across all parts of our business and the acquisition of OnSIP, which we announced last quarter. Similarly, non GAAP net income of $3.5 million was up over previous periods, in line with our plan announced last quarter to trim spending modestly, bolster cash flow from operations and position ourselves better to take advantage of additional inorganic growth opportunities in the future should they come along. These new features represent one step in an ongoing effort we have underway over the next several quarters to add new features to the Pro Plus service tier, allowing us to serve even larger sized businesses with Ooma Office and continue to raise our revenue per user. On a year over year basis, total revenue grew 15% in the third quarter, driven by the strength of Ooma Business, which included a full quarter contribution from OnSIP for the first time. In the third quarter, business subscription and services revenue accounted for 55% of total subscription and services revenue, as compared to 49% in the prior year quarter. Q3 product and other revenue came in at $4.9 million, as compared to $4.5 million in the prior year quarter with accessories sales contributing to growth. Ooma Business Subscription and Services revenue grew 30% year over year in Q3, driven by user growth and the full quarter contribution from OnSIP, which performed well with solid customer retention. For the third quarter, total subscription and services revenue was $51.7 million or 91% of total revenue compared to 91% in the prior year quarter. Our blended average monthly subscription and services revenue per core user or ARPU increased 9% year over year to  (ph), up from  (ph) in the prior quarter, driven by an increase in mix of business users, including higher ARPU Office Pro and Pro Plus users, as well as inclusion of OnSIP users into this metric for the first time this quarter. During the third quarter, we continue to see a healthy Office Pro and Pro Plus take rate with 50% of new office users opting for those IoT services, which was up from 48% in the prior year quarter. Our annual exit recurring revenue, which included OnSIP in Q3, grew to $207.4 million and was up 19% year over year. Good news is that, OnSIP gross margins is improving as expected through our integration effort to leverage Ooma's infrastructure and we continue to believe it can reach 70% plus range within the next quarter or two. Total operating expenses for the third quarter were $32.8 million, up $5.5 million or 20% from the same period of last year. Excluding the four quarter impact of OnSIP, the total operating expenses increased $3.8 million or 14% from the same period last year. Sales and marketing expenses for the third quarter were $16.9 million or 30% of total revenue, up 17% year over year, driven by higher marketing and channel development activity for Ooma Business, but sequentially lower on a percentage of revenue basis, in line with our increasing focus on profitability and cash flow we discussed on our last earnings call. Research and development expenses were $11 million or 19% of total revenue, up 31% on a year over year basis from $8.4 million, driven by investments in new features for both Ooma Office and Ooma Enterprise, as well as new products such as AirDial. In addition to stock based compensation and intangible amortization expenses, non GAAP net income for the third quarter excludes approximately $0.6 million of acquisition related costs, as well as $1.4 million of facility consolidation costs incurred in connection with the OnSIP transaction. Adjusted EBITDA for the quarter $4.5 million, a record for the company or 8% of total revenue as compared to $4 million for the prior year quarter. Based on the midpoint of the updated non GAAP net income guidance range, we estimate our adjusted EBITDA for the year to be approximately $17.1 million or 8% of revenue for fiscal 2023, which is an increase from our prior guidance of $15.6 million or 7% of revenue."
}