{
    "symbol": "EMN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 12:58:07",
    "content": " Your line is now open. And then, you even have even stable markets that -- like a P&G and other markets out there, who are doing well, but they're still looking at their inventory and going to destock high-cost inventory to generate cash for the end of the year and position themselves for lower prices in the future. And so that means, as you look at next year, with the destocking being more behind us and returning to sort of what we're thinking about as mild recession terms, demand improves in a meaningful way as you get past the fourth quarter from a primary market demand point of view. Your line is now open. We've got a lot of tailwinds whether it's the multifunctional layers growing and EVs, the tremendous success we're having in our paint protection films growth, we're seeing in Tetrashield and food and beverage cans. And with inflation being as high as it is now, that opportunity is much greater in how raw material and distribution costs could fall and what the spread tailwind will be next year, as we're going to continue to have very strong discipline in pricing, because we are committed to getting our margins back to 2019 levels, before all this inflation chaos started. Your line is now open. So as we've highlighted earlier, given the -- one the amount of inflation that we've seen this year in working capital and through raw materials, we're looking at that in concert with the demand that we see and we've highlighted the destocking that we expect -- have seen in late Q3 and we're seeing here in Q4. So as we're in a planned turnaround for one of our crackers at our Longview Texas site, we're taking that opportunity to keep it down the remainder of the year to ensure that in our olefin stream that we bring our inventories back in line and that we also move through some of the higher cost both from an energy and raw material front and get that through this year so that we're better positioned in 2023 from both an operation and supply chain and working capital standpoint. Your line is now open. Your line is now open. If you just look at the fourth quarter it's probably a $20 million headwind that they're facing on a year-over-year basis relative to sort of where they were a year ago, for just that segment. Your line is now open. Your line is now open. So that business didn't have market tightness driving spreads up in the last two years, and it's not going to have market looseness driving spreads down because they're CPTs. Your line is now open. Your line is now open. Your line is now open."
}