{
    "symbol": "EMN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 12:31:05",
    "content": " And when you really think about delivering that $5 a share in the back half of the year, it really comes down to a question of what is AM going to deliver relative to what normalization in CI occurs, because obviously, the streamline event in the first quarter, we had a sort of significant setback on that to the first half of the year. So, you see price implementation being very aggressive in the AFP business to cover all of those raw material, energy and distribution cost headwinds and we did a great job in the first quarter in getting prices up to sort of cover that and improve spreads that will continue to be true year-over-year in the second quarter. So in the spread normalization, we’ve obviously been in very tight market conditions since the second quarter really since the beginning of the first quarter of last year and CI has benefited from that like many other companies in these intermediates. When you think about the inflation of our raw materials and energy costs, what we’re assuming right now is we are sort of peaking out in the second quarter and that it doesn’t get worse as we go into the third quarter and the fourth quarter. So as we look at the year-over-year bridge to 2023, maybe it’s early, but it seems like – particularly for AM, it seems like the add back of $50 million on the accounting side is maybe a starting point. But you won’t recover the full $100 million maybe or the $75 million of additional, I think you said so maybe half but you’re also going to get that back through the course of the year. So that will be upside in volume next year, and there is the cost accounting issue really isn’t a year-over-year tailwind because, well, it’s a headwind the first quarter, it sort of comes back, if you will, to the rest of the year. So, as Mark has highlighted, we remain confident in this business, and ultimately, it will put us on a strong pace in the back half of the year as we recover $100 million of spreads on a year-over-year basis and get our volume mix back to more normalized levels, which sets us up for more growth as we go into ‘23. It’s a little hard to predict where spreads are going to be next year in the specialties, but if inflation – if raw materials come off, that will create a tailwind relative to pricing for next year relative to this year, I think that’s correct."
}