{
    "symbol": "MCHP",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-04 20:59:13",
    "content": " Non-GAAP net income was a record $605.6 million, our non-GAAP cash tax rate in the quarter was 6%, and Non-GAAP earnings per diluted share on a split adjusted basis exceeded the midpoint of our guidance, and were a record $1.07. Our September quarter results continued to be strong, with the revenue growing 5.1% sequentially, to achieve another all-time record at $1.65 billion. Non-GAAP gross margin was another record of 65.3%, up 50 basis points from 64.8% in the June quarter, and above the high-end of our guidance as we continue to ramp our internal factories and benefit from improved fixed cost absorption, as well as product mix changes. I would like to thank all our stakeholders who enabled us to achieve these outstanding and record results in the September quarter, and especially thank the worldwide Microchip team, whose tireless efforts not only delivered our strong financial results, but also supported our customers to navigate a difficult supply environment, and who work constructively with our supply chain partners to find creative solutions in an extremely constrained and challenging environment. As a result, our unsupported backlog, which customers wanted, shipped in the September quarter, but of which we could not deliver in the September quarter, continued to climb significantly as compared to the prior quarter's level. This is the fifth consecutive quarter that our unsupported backlog for product requested in a given quarter has grown, despite our quarterly revenue having grown 26% in the September '21 quarter, as compared to the year-ago quarter. At the midpoint of our revenue guidance, our year-over-year growth for the December quarter will be a strong 29.3%, Accelerating from the 26% year-over-year growth in the September quarter, 19.8% year-over-year growth in the June quarter, and 10.6% year-over-year growth in the March quarter. Those pricing may come down, but I don't see pricing on our microcontroller products or analog products, connectivity products, 98% of what we make is largely proprietary, those prices to come down, because when you look at the components of the pricing, the -- I don't see that fabs are going to lower the wafer cost, outside, because they're making huge investments because of shortage and that equipment is being placed in -- now. And B, if that's the case, why do you think you continue to see such acceleration or outgrowth in your bookings, and is that implied that you're seeing increasing number of expedites because I'm assuming that also ties up to how many -- how much broader customers are asking for the current quarter."
}