{
    "symbol": "MCHP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-09 22:57:11",
    "content": " Non-GAAP gross margin was another record of 66.6%, up 50 basis points from the December quarter, and at the high end of our guidance, as we continue to ramp our internal factories and benefit from improved operational efficiencies as well as product mix changes. Our consolidated non-GAAP diluted EPS was a record $1.35 per share, well over the high end of our guidance and up 45.2% from the year ago quarter. During the March quarter, we returned $400.4 million to shareholders, representing 52.5% of the prior quarter's free cash flow. We expect our capital spending in fiscal year '23 to be at the high end of the range we have shared with you, as we respond to growth opportunities in our business as well as fill gaps in the level of capacity investments being made by our outsourced manufacturing partners in specialized technologies, they consider to be trailing edge, but which we believe will be workhorse technologies for us for many years to come. Finally, as you can see from our March quarter results and the June quarter guidance, every element of our Microchip 3.0 strategy is firing on all cylinders, as we continue to build and improve what we believe is one of the most diversified, defensible, high growth, high margin, high cash generating businesses in the semiconductor industry. Long-term non-GAAP operating margin target of 44% to 46%, and free cash flow target of 38%, consistently increasing capital return to shareholders as net leverage drops such that 100% of free cash flow is returned to shareholders by the time net leverage drops to 1.5x, a CapEx investment of 3% to 6% of revenue, and an inventory investment of 130 to 150 days over the business cycles. Reflecting on our financial results, I continue to be very proud of all employees of Microchip that have delivered another exceptional quarter and fiscal year, while making new records in many respects, namely record net sales, record non-GAAP gross margin percentage, record non-GAAP operating margin percentage, record non-GAAP EPS, and record adjusted EBITDA, and all of that in a very challenging supply environment. In the current June quarter, we will use last quarter's actual free cash flow of $633.1 million and expect to return $348.2 million, which is 55% of that amount to our shareholders."
}