{
    "symbol": "MCHP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 21:37:10",
    "content": " On a GAAP basis in the December quarter, gross margins were a record at 65.6% and include the impact of $8.4 million of share-based compensation expense. Our December quarter results continued the strength of strong growth quarters, with revenue growing 6.5% sequentially to achieve another all-time record at $1.76 billion, breaking through the $7 billion annualized revenue milestone. Non-GAAP gross margin was another record at 66.1%, up 80 basis points from 65.3% in the September quarter and above the midpoint of our guidance as we continue to ramp our internal factories and benefit from improved fixed cost absorption as well as product mix changes. Non-GAAP operating margin was also a record at 44.6%, up 210 basis points from 42.5% in the September quarter and well above the high-end of our guidance. It’s brought down our net debt by $422.1 million, driving our net leverage ratio down to 2.58% in the December quarter. All microcontroller product lines, 8-bit, 16-bit and 32-bit had over 30% year-over-year revenue growth in the December quarter, with 32-bit microcontrollers having the highest year-over-year growth. Coming off strong sequential growth in the September quarter, our analog revenue increased 1.9% in the December quarter, setting another record in the process. Taking a look at our revenue from a geographic and end market perspective, Americas was up 4.6% sequentially; Europe was up 11% sequentially, which is significantly better than typical seasonal performance for the December quarter; Asia was up 5.8% sequentially; and all end markets were strong and supply constrained. To illustrate the magnitude of the demand supply imbalance, despite our December quarter revenue, having grown 30% as compared to the year ago quarter, we exited the December quarter with the highest unsupported backlog ever. Long-term non-GAAP operating margin target of 44% to 46% and free cash flow target of 38%, increased capital return to shareholders to 50% of free cash flow and further increase this every quarter to return 100% of free cash flow to shareholders as net leverage drops to 1.5x. Reflecting on our financial results, I continue to be very proud of all employees of Microchip that have delivered another exceptional quarter in making new records in many respects, namely record net sales, record non-GAAP gross margin percentage, record non-GAAP operating margin percentage, record non-GAAP EPS and record cash flow from operations and record adjusted EBITDA. This was 50.1% of our free cash flow projection at the start of the quarter of $589 million, consistent with us targeting 50% of free cash flow as a return to our investors. However, our cash collections in the final month of the quarter were exceptional due to a very strong and linear shipping quarter and record non-GAAP gross and operating margins and record adjusted EBITDA being well above our forecast. So based on this revised process, we will use our last quarter’s actual free cash flow of $763 million."
}