{
    "symbol": "STG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 09:57:08",
    "content": " Hello, everyone, and thank you for joining Sunlandsâ\u0080\u0099 second quarter 2022 earnings conference call. In  the pandemic resurgence and the macroeconomic weakness in the second quarter, we achieved RMB114.6 million of net income, representing a fourfold increase year-over-year. We were also pleased to see our continued efforts to optimize our product mix and expand our course portfolio were rewarded with improving operational results, reflected in a 39.4% year-over-year increase in our new student enrolments and a reduced year-over-year decrease in gross billings. We accomplished this by acquiring students from a wider range of age groups with higher sales efficiency, as we cut down our sales and marketing expenses by 34.8% year-over-year. As such, we assist this opportunity to deliver enhanced learning experience to our students and develop the new skill training courses to address a broad range of student's needs helping our students improve their career flexibility and the competitiveness in the job market. As a result, our growth experience for professional certification and skills programs in the second quarter grew by 82.9% year-over-year driven by 94.9% year-over-year increase in new student enrolments. With our established brand awareness in this field, diverse course choices and quality course content, we are confident that we can continue to attract new students and capture additional growth opportunity presented by student's rising demand for Master degree or into the programs. Finally, I'm pleased to state that in June, we declared a special cash dividend to share our success with shareholders, following four consecutive quarters of profitability. At the same time, we remain focused on developing diverse skill and interest courses and enhancing our teaching and service quality to attract new students with a target of bringing life changing and fulfilling learning experience to our students. During the quarter, we continued executing barriers initiative to build a highly efficient and lean organization, while optimizing our expense management, leading to a 32.4% year-over-year decrease in our operating expenses. Our cost efficiency improvements resulted in notable net income growth from RMB22.1 million for the second quarter of 2021 to RMB114.6 million for this quarter. Going forward, we are optimistic that our continued efforts to broaden our online cost offerings, streamline our cost structure and dedicate ourselves to providing enhanced services to our students will ultimately enable us to realize long-term growth. Now, let me walk you through some of our key financial results for the second quarter of 2022. In the second quarter of 2022 net revenues were RMB555 million, a decrease of 11.8% year-over-year. Cost of revenue decreased by 6.2% to RMB91.2 million in the second quarter of 2022 from RMB97.3 million in the second quarter of 2021. In the second quarter of 2022, operating expenses were RMB351.2 million, representing a 32.4% decrease from RMB519.6 million in the second quarter of 2021. Sales and marketing expenses decreased by 34.8% to RMB293 million in the second quarter of 2022 from RMB449.1 million in the second quarter of 2021. General and administrative expenses decreased by 9.7% to RMB 46.6 million is the second quarter of 2022 from RMB51.6 million in the second quarter of 2021. Product development expenses decreased by 38.3% to RMB11.6 million in the second quarter of 2022 from RMB18.8 million in the second quarter of 2021. Other income decreased by 41.8% to RMB4.8 million in the second quarter of 2022 from RMB8.2 million in the second quarter of 2021. As of June 30, 2022, the company had a deferred revenue balance of RMB1,998.1 million compared with RMB2,348.2 million as of December 31, 2021. Capital expenditure were RMB0.3 million in the second quarter, compared with RMB7.8 million in the second quarter of 2021. And now for our outlook, for the third quarter of 2022, Sunlands currently expects net revenue to be between RMB520 million to RMB540 million, which would represent a decrease of 9.3% to 12.6% year-over-year."
}