{
    "symbol": "JNJ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 13:21:02",
    "content": " Our Pharmaceutical team achieved its 11th consecutive year of above market adjusted operational sales growth, excluding the COVID-19 vaccine, delivering nearly 7% growth as we continue to advance our innovation pipeline. Excluding sales from the COVID-19 vaccine, operational sales growth was 4.6% worldwide, 4.7% in the U.S. and 4.4% outside the U.S. As you will find in our supplemental sales schedule, acquisitions and divestitures had an immaterial impact on our results in the quarter. Operational sales growth outside the U.S. grew by 9.1%, with currency negatively impacting our reported OUS results by 9.7 points. Excluding the COVID-19 vaccine sales, worldwide operational sales growth increased 3.9%, U.S. operational sales growth increased 2.4%, and outside the U.S., operational sales growth increased 6%. Pharmaceutical growth, excluding the COVID-19 vaccine, was driven by our key brands and continued uptake in our recently launched products, enabling us to continue to deliver above-market adjusted operational sales growth for the 11th consecutive year, including 7 assets with double-digit growth. In our immunology business, STELARA grew 6.2%, driven by market growth and share gains in Crohnâ\u0080\u0099s disease and ulcerative colitis, with gains of 4 points and 5.4 points in the U.S., respectively, as well as a favorable prior period adjustment impacting worldwide results by approximately 460 basis points. We estimate a favorable impact from net acquisitions and divestitures associated primarily with the Abiomed acquisition, and thus, are comfortable with your models reflecting adjusted operational sales growth in the range of 3.5% to 4.5%. Considering all these factors, we are guiding adjusted earnings per share in the range of $10.40 to $10.60 on a constant currency basis, reflecting operational or constant currency growth of approximately 2.5% to 4.5% or 3.5% at the midpoint. While not predicting the impact of currency movements, assuming recent exchange rates I previously referenced, our reported adjusted operational earnings per share for the year would be favorably impacted by approximately $0.05 per share, resulting in adjusted reported earnings per share in a range of $10.45 to $10.65 or $10.55 at the midpoint, growth of 4% versus the prior year. Some examples, continuous growth of DARZALEX in first line, TREMFYA, which is gaining share, both in psoriatic arthritis and in psoriasis, and we expect a readout of our IBD studies in ulcerative colitis and Crohnâ\u0080\u0099s in 2023 will provide a significant additional leg of growth for TREMFYA; ERLEADA, which is now in different indications in metastatic and non-metastatic prostate cancer will have some readouts of studies in high-risk localized prostate cancer in 2023, providing an additional leg of growth; our INVEGA SUSTENNA franchise in the U.S. as well as our pulmonary arterial hypertension franchise with UPTRAVI and OPSUMIT has been affected by COVID-19, but that we expect that will continue to deliver growth."
}