{
    "symbol": "DHC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 14:47:03",
    "content": " We delivered operational improvements across all of our segment, reduce debt by redeeming $500 million of 9.75% senior notes and increased our cash position by selling an additional 10% equity interest in our existing joint venture for the property located in Boston Seaport district. Interest expense of $56 million, represented a decrease of approximately $1.2 million from the first quarter, following the $500 million redemption of 9.75% senior notes in June. As Jennifer mentioned, at the end of the quarter, we sold an additional 10% equity interest in the two building life science complex located in the Boston Seaport district for $108 million. In the second quarter, we spent $64.9 million on capital expenditures across our portfolio, which included approximately $39.3 million of CapEx within the shop segment and $25.5 million of capital was deployed in the office portfolio. So, thinking about our portfolio for the long term, buying this asset, which is in the second best life sciences market in the United States in the San Francisco Bay area, with a building, we paid $925 a square foot for this building and in the recent years, prior owners have spent close to $600 a foot improving this building. So you'll see if you look at the balance sheet, we had about $868 million of cash and restricted cash and I think we've spoke previously about our restricted cash and how flexible our banking group has been with us that that's really an accommodation that we can continue to make investments and do things that will help our portfolio long term instead of repaying debt that we wouldn't be able to redraw right away. I think in order to get back to where we want to be, it's about $100 million as you said and what's interesting about the shop portfolio is in order to get to that level, the margins would still be pretty substantially lower than what we expect long term."
}