{
    "symbol": "DHC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 12:57:05",
    "content": " The year-over-year and quarter-over-quarter improvement in normalized FFO from negative $0.07 per share and negative $0.06 per share, respectively, was largely driven by continued improvements in three areas within our SHOP segment during the fourth quarter; first, growth in net operating income and operating leverage for the quarter and the year; second, an acceleration in occupancy recovery and rate growth during the quarter; and third, a decrease from the third quarter in the use of contract labor and the associated costs. Year-over-year rental income was up slightly in our same property office portfolio, but fourth quarter cash basis NOI was down slightly by 90 basis points due to a number of onetime expenses across our portfolio. We ended the quarter at 90% occupancy in our same property office portfolio segment and had a leasing pipeline of just over 1 million square feet at year end, in line with our pipeline in the third quarter. Cash NOI from our SHOP segment increased $13.6 million while our office portfolio segment increased $3.5 million or 12.3%, and our triple net leased senior living communities and wellness centers increased $1.8 million or 21.5%. In our triple net leased senior living communities and wellness centers, we recognized $3 million of percentage rent as we do each year during the fourth quarter, which was partially offset by an $800,000 decrease in cash NOI related to the wellness center default that Jennifer just discussed. Our total SHOP NOI for the fourth quarter of $7.9 million included 119 communities operating with 11,582 units that had negative NOI totaling $18.7 million or NOI margins of negative 16%. General and administrative expenses decreased $2.8 million or approximately 33% from a year ago and $415,000 from the third quarter as a result of our lower management fees. Our managers business management fees continue to be calculated based on our market capitalization and not on the historical cost of our assets, which resulted in a reduced fee paid to RMR in the fourth quarter, which, when annualized, equates to a $21 million reduction. Interest expense of $49.3 million for the fourth quarter represented a 22% reduction from a year ago, but an increase of approximately $2.5 million or 5% from the third quarter as a result of higher interest rates on our floating rate credit facility. These properties totaling 5.3 million square feet are located in 21 states, including Washington, D.C. We're approximately 90% occupied and generated $18.7 million of cash basis NOI in the fourth quarter. In the fourth quarter, we spent $118.6 million on capital expenditures across the portfolio, which included $99.4 million of capital improvements and redevelopment within our SHOP segment."
}