{
    "symbol": "MAC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 18:00:05",
    "content": " Primary and offsetting factors contributing to this quarterly FFO per share -- this quarterly FFO per share result are as follows: One, we had a $7 million increase in straight line of rent due to straight line rent from the Google lease at One Westside as well as from straight-line receivable write-offs during the fourth quarter of 2021 as we then finalized our remaining pandemic tenant-related receivables last year. Offsetting these 3 positive factors were the following: One, a $7 million increase in interest expense due to rising rates; two, a $5 million quarterly decrease in FFO generated from land sales; and three, a $3 million decline in lease termination income. For the full year 2022, we opened almost 900,000 square feet of new stores, which is just about on par with where we were during the same period in 2021. Notable openings in the fourth quarter, including Anthropologie at Biltmore Fashion Park, Aritzia and Timberland at Fashion Outlets of Chicago, Free People at The Oaks, Freebird at Kierland Commons, Lululemon at San Tan Village, North Face at Washington Square and 3 stores with JD Sports at Country Club Plaza, Scottsdale Fashion Square and Victor Valley. At the end of the fourth quarter, we had 140 leases signed for just over 2 million square feet of new stores, which we expect to open in 2023, 2024 and early 2025. But in terms of when we get back to pre-COVID NOI levels, we've said for some time, we believe it's going to be around the fourth quarter of '23 and going forward from there. One of the things that, obviously, you're part of what's going to be a drag on your earnings a little bit and your NOI growth this year is the fact that expenses are going up perhaps in excess of your fixed CAM bumps which will -- which could drag your NOI growth, which benefits from your 3% bumps in your occupancy gains and hopefully some positive lease spreads as well."
}