{
    "symbol": "FPH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 16:02:01",
    "content": " Segment results for the first quarter are as follows: The Valencia segment is consolidated for accounting purposes; the segment loss was $4.8 million for the quarter; There were no landfill closings in Valencia during the quarter and selling, general, and administrative costs were comprised of selling and marketing expenses in support of our first development area, as well as general and administrative costs incurred to support the segment's operations as we work toward closing anticipated fourth quarter builder land sale. This loss is comprised of general and administrative costs incurred to support the segment's operations, as they focus on reassessing the development plan and approval process for our San Francisco assets; Next, the Great Park segment reports the operations of the Great Park Venture, which is the owner of the Great Park neighborhoods, as well as management services provided to the venture by Five Point Management Company. The Great Park Venture is a self-funding operation with no debt and had a cash balance of $127 million at the end of the quarter; Great Park segment revenues were $22.4 million, which primarily consisted of $17.2 million related to the closing of nine homes under the Great Park Ventures fee build program, and management fee revenues of $3.4 million recognized by the management company for services provided to the venture. The profit recognized by the fee billed home sales of $4.3 million was more than offset by the venture selling, general, and administrative expenses of $7.6 million, which were mostly comprised of selling and marketing costs incurred in support of home sales at the venture, including a next neighborhood plan to open for sale this summer, Solis Park. Overall, the Great Park segment had a net loss of $2.1 million for the quarter, which is comprised of approximately $700,000 and income from the management company and a $2.8 million loss from the Ventures operations."
}