{
    "symbol": "IMAX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 22:54:03",
    "content": " IMAX delivered its best Chinese New Year holiday ever for local language films, with $61.3 million in total box office receipts, well over our budgeted projection of $42 million. Overall, we're very optimistic about 2023, and we expect to drive significant growth in IMAX system signings, installations, global box office and adjusted EBITDA this year, including global box office back to our record-breaking 2019 of $1.1 billion between 110 and 130 IMAX system installations worldwide and adjusted EBITDA in the mid-30% margin range. Today I'd like to discuss our year-end results in global box office growth and network growth, our results for Avatar: The Way of Water particularly internationally, our strong momentum in China, our strategic focus for sales in 2023, an update on our IMAX 3.0 strategy, and finally, I'll look ahead at the slate for 2023. Back to China, among the most encouraging results, we've seen with Avatar 2 is in China where the film essentially reopened the market for moviegoing overnight with more than $50 million in Chinese box office to-date. With that in mind, we are establishing guidance for 2023 including IMAX gross box office back to the 2019 pre-pandemic level of $1.1 billion as compared to $850 million in 2022. Avatar delivered $140 million in box office in the last two weeks of December with 11% market share, making up more than half of Q4's total IMAX gross box office. To conclude, we finished 2022 on a strong note with Avatar and that momentum has only accelerated into 2023 with a remarkable continued run of Avatar, the reopening of China leading to our record Chinese New Year results and the strong demand for IMAX technology we are seeing from our partners in markets around the world. Your line is open. Your line is open. First, as you look at your sort of outlook of $1.1 billion of gross box office this year, how are you thinking about growth in China relative to North America and international rest of the world? Your line is open. Your line is open. Your line is open. Your line is open."
}