{
    "symbol": "RHP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 14:39:02",
    "content": " And the hotel's first quarter was only $1.1 million below its first quarter of 2019 levels in profitability, despite 27 fewer points of occupancy due to the Omicron cancellations on the group side. In terms of production, the 422,000 gross group room nights booked in the first quarter exceeded the first quarter of 2019 by almost 7%. As of the 31st of March of this year, our room nights on the books for the rest of 2022 represent 97% of 2019 group room nights on the books for 2019, but with an ADR growth of 8.6%. And by the way when you look at the group room nights that we have on the books as of the 31st of March 2022 for the year of 2023 these represent, 102% of the 2019 group room nights we have on the books as of the 31st of March of 2018, again with an ADR growth of 8.6%. And within those first quarter group room nights, our mix of corporate groups was 66%, compared to 60% in the first quarter of 2019. For the full quarter we saw about $229 of banquet spending per group room night, only 1.5% below the first quarter of 2019. Opryland also performed very well with leisure transient picking up over 4,600 transient room nights compared to the first quarter of 2019 and seeing over 32% growth in transient ADR over the same period. The Gaylord Texan was close behind these leaders reaching 72% occupancy in March and also adding 3,000 transient room nights compared to the first quarter of 2019. The Gaylord Rockies gained 4,900 transient room nights compared to the first quarter of 2019, and doubled occupancy from 27% in January to 54% in March. Overall hospitality margins held up relatively well in the face of Omicron in the quarter with adjusted EBITDAre margins off a modest seven points year-over-year, compared to the first quarter of 2019, despite a 25 point decline in occupancy and a 21% increase in average wage rate over the first quarter of 2019. The ADR for these group room nights is 8.6% higher than the same period in 2019, which means we have 5% more group rooms revenue on the books for the balance of the year than we did for the balance -- than we did for the balance of 2019. So, first of all, I think, Patrick, the reach we have is pretty limited, we're in really good shape on reach on group side for the year given the tremendous book of business we have in particular the rate. If you add on to that just what we did in 2019 from a transient perspective, which was about 22 points of occupancy or 620,000 room nights, that would give you about two million room nights for the remainder of the year, which would imply around 70% occupancy for the remainder of the year as far as what we have on the books on group, what we expect to do on transient at a minimum. Mark mentioned this a minute ago, we have room nights on the books from a group perspective that are up 8.6% in terms of rate growth over 2019. We have this several weeks back, when the RNC, the Republican National Convention was looking to come to Nashville that the government's office calls and says we need 2,000 rooms at Opryland for three days, when we talked to Opryland and the rate for May because of it's now a very strong leisure period, the rate is up $40 on what it was a year or two years ago. Well, we've -- I think in our last Board meeting in February, we talked to our Board about potentially $0.5 billion, $0.75 billion worth of capital we can deploy into our hotel business by doing some really, really interesting things with room expansion, SoundWaves expansions."
}