{
    "symbol": "RHP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 17:00:03",
    "content": " On a segment basis, our entertainment business delivered $22 million of adjusted EBITDAre in the second quarter which while it ended up being towards the lower end of our guidance with nevertheless a record quarter for this segment as well both as reported and on a same store basis. Compared to on our initial expectations, a few factors contributed to the result not being an even bigger record and one is the slight delay in closing Block 21 versus our original timetable which not only improves the contributions at Block 21 for the second quarter but also means we will get a bit later start on the many growth initiatives we have planned for this asset some of which are will now be felt more in '23 instead of later this year as we originally had planned for. And when you compare what we've achieved in the second quarter to the same time in 2019 on a same store basis, our core entertainment portfolio delivered no less than a 35% adjusted EBITDAre growth compared to pre-pandemic levels. And our Opryland trail at 2019 performance by six points, it's important to note that Opryland had a tough comp as occupancy in the second quarter 2019 is seen at 81%. All four hotels delivered a very good outside the room stand for groups in-house with other RevPAR at the Texan at 9.3%, the Palms 22.5%, Rockies 26.7%, while compared to the second quarter of 2019. While the National's occupancy trail this second quarter of 2019 by 17 points, I would note that like Opryland, the hotel faced some very tough 2019 comp of 81.4% occupancy. Your line is now open. I would say though that that business has performed extremely well and as Colin shared on the call in the first half and as you look at the second half, if you look at the acquired second half EBITDA growth versus '19 at the midpoint, we are projecting 55% growth over 2019 levels in terms of profitability for that business in second half. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}