{
    "symbol": "TTMI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 11:20:08",
    "content": " In the third quarter of 2022, TTM delivered a solid quarter with revenues in line with the guided range and non-GAAP EPS above the high end of guidance despite a challenging supply chain and labor environment and the continued impact that COVID-19 is having on our business. While the results include the first -- include the first full quarter of Telephonics, I do want to call out that the rest of the company saw revenues grow 8.3% year-on-year, driven by broad-based growth across all end markets. As we look into Q4, inventory adjustments and supply challenges tied to some of our commercial customers are contributing to revenue and margin declines, but we will continue to see our business supported by our diverse end market mix, including our A&D business, which, with the addition of Telephonics, now represents almost 40% of our revenues. Revenues from this market were up 18% year-on-year, exceeding $100 million for the sixth quarter in a row and performing much better than expected, with broad-based strength across all segments. At the end of Q3, our 90-day backlog, including Telephonics, which is subject to cancellations, was $672.9 million compared to $594.8 million at the end of the third quarter last year, not including Telephonics and $703.7 million at the end of Q2, including Telephonics. In the third quarter, R&D was $7 million or 1% of revenues compared to $4 million or 0.7% of revenues in the year ago quarter. Our effective tax rate was 15% in the third quarter, resulting in tax expense of $10.2 million. Cash and cash equivalents at the end of the third quarter of 2022 were $335.6 million, and our net debt divided by last 12 months EBITDA was 1.8x, below our target of 2.0. We expect total revenue for the fourth quarter of 2022 to be in the range of $630 million to $670 million, and we expect non-GAAP earnings to be in the range of $0.36 to $0.42 per diluted share. And we're going to be looking at PCB content moving from where it was at the end of last year at about $100 PCB content per vehicle upwards to, let's just say, I think the forecasters are calling for $150 to $160 by 2025. We won a program value of about $125 million in the quarter off of 19 automotive designs, and that's pretty comparable to where we were last year at this time."
}