{
    "symbol": "QSR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 12:24:05",
    "content": " We started the year off strong, with progress in key focus areas including Tim Hortons Canada and Burger King U.S. and continued momentum in our international business, while also seeing digital traction across all brands, with home market digital sales reaching their highest levels ever, as a percentage of system wide sales. During the first quarter, we once again grew year-over-year comparable sales, driven by just over 10% comparable sales at Tim Hortons in Canada exceeding our own high single digit expectations that we shared in March and 20% comparable sales growth in our Burger King International business. The combination of comparable sales and net restaurant growth helped drive year-over-year system wide sales growth of 14%, an increase of nearly $1 billion year-over-year and organic adjusted EBITDA growth of 9% which included a negative 2.6% impact on adjusted EBITDA growth related to Russia. Now turning to our Burger King International business, which has been a consistent growth engine for the brand, as it contributes nearly 60% of the brand's global system wide sales and continues to get stronger every year. Firehouse Subs U.S. retained its recent momentum building average unit volumes to an all-time high of nearly $920,000 on a trailing 12-month basis growing year-over-year comparable sales 4.5% on top of 24% comparable sales last year, increasing system wide sales 7% and generating over 30% of sales through digital channels. We had 820 fully franchised Burger King restaurants at the end of 2021 that represented about 2% of our system wide sales and 1.7% of our EBITDA in 2021, During the first quarter, Russia had a roughly $12 million impact on our year-over-year adjusted EBIDA and we anticipate a fairly even impact across the year. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And our business as well, I think last quarter, we shared investments, we've made at Burger King to add to grow the field teams by 50% in order to be able to support provide better training and just get closer to the business with our franchisees to be able to help them work through all the plans that we have in place long term for the business. And we're looking at that, and I've mentioned this in my prepared remarks and last quarter as well with Tom, that we're looking at and working through plans with the franchisees long term plans around marketing around the advertising fund to drive more media firepower there, in addition to work to accelerate and have a meaningful impact on our real estate and our restaurants image to be able to drive growth there. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. We made notable progress this quarter against key priorities including driving double-digit comparable sales growth at Tim Hortons Canada and Burger King International and further narrowing the gap to peers at Burger King in the U.S., reaching our highest levels of digital engagement over ever in our home markets and opening a record number of new restaurants in the quarter and returning over 400 million of capital to shareholders."
}