{
    "symbol": "QSR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 12:32:02",
    "content": " I'm even more encouraged to see this translate into our strong results for the quarter with consolidated comparable sales up 9% year-over-year, 14% growth in system-wide sales and 9% organic adjusted EBITDA growth. These results were primarily driven by a strong acceleration in sales growth at Tim Hortons Canada, sustained momentum across many of our international markets, steady improvement at Burger King U.S., continued growth in digital sales and development strength at Popeyes. During the second quarter, we grew consolidated year-over-year comparable sales by 9% driven by 14% comparable sales at Tim Hortons Canada, driving our Tim Canada sales above 2019 levels for the quarter and 18% comparable sales growth in our Burger King International business. The combination of comparable sales and net restaurant growth helped drive Q2 system-wide sales to $10.1 billion, up 14% year-over-year, excluding Firehouse Subs and organic adjusted EBITDA growth of 9%, which included a negative 2% or $11 million impact on adjusted EBITDA growth related to Russia. Now to briefly touch on our results for the second quarter, we saw a 0.4% increase in comparable sales in the quarter, driven by a net benefit from our focus on core offers, including removing Whopper from core discount during the first quarter, a strong value platform with a $5 Your Way meal and positive contribution from digital and delivery channels. Now turning to a valuable growth engine for the Burger King brand, the International business, which contributed 60% of the brand's global system-wide sales and over 55% of adjusted EBITDA during the second quarter. This strong development momentum translated into net restaurant growth of over 8% for the second quarter and helped drive system-wide sales growth of nearly 10%, including 6% in the U.S. Popeyes U.S. comparable sales were relatively flat after three years of incredible growth. For the second quarter, Firehouse Subs saw a net unit growth of 2.5% which offset softer comparable sales of down approximately 1%, resulting in a 2% year-over-year increase in system-wide sales. Thanks for the question. Thanks for the question. Our goal for the business at Tims in Canada, and it's the same objective and goal for Popeyes and for BK as well as for Firehouses to grow in a balanced way, driving new customers into the restaurants, driving more frequency from existing customers through great offerings, great service and great digital experiences and driving healthy check growth that doesn't scare people away. Thanks for the question. Thanks for the question. Thanks for the question. Thanks for the question. as I mentioned in prepared remarks and we touched on quite a bit, we're working closely side by side with the franchisees to develop a really strong and thoughtful plan to accelerate sales growth at BK in the U.S. and also ensuring that we're focusing on the guest experience and their franchise profitability."
}