{
    "symbol": "QNST",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-05 18:15:04",
    "content": " Jason, yes, I think what's different is the top line pressure we're getting from the insurance industry issues and combine that with the December quarter seasonality and we're just at a revenue level where with the expense base we have, we're willing to go down to breakeven because what we don't want to do, given that we know insurance is coming back, actually going to be coming back we think quite strongly starting in January, we don't think it makes sense to cut expenses and cut our investment in growth initiatives across the board and see those are paying off. And because of the strength in the other verticals and as insurance comes back, this -- you're going to see the spring kind of get unloaded here both on the top line and an EBITDA margin expansion right back where you would expect it for their revenue levels we'll be generating. And the carriers themselves have made great progress in the re-rating and getting their rates increased against the inflationary backdrop and are in -- the ones that are furthest along and some of the biggest ones are quite far along and pretty much done are in really good shape financially in seeing super results in terms of rate versus costs and claims and have given us very strong indications of their intent to be aggressive beginning in January, just as we expected and we just have more confidence of it going forward. And I don't expect that the carriers are going to recover -- add more budget through December, partly because of the impact it had on the loss ratios, but it does -- but they are all now focused on really is January forward as those ratios reset and they get ready to ramp into what they expect to be a very strong year, given that they've gotten rates increased appropriately for inflation and given that they expect consumer shopping to be very aggressive due to both the higher rates and potentially due to a softening economy. Yes, that's a great question. Credit cards wasn't as big as personal loans, but it wasn't that credit card was the strongest, they had such a tough comp from last year, because last year was a really strong quarter in credit cards with some really unique limited time offers that kind of pushed that business way beyond what an -- even the normal high-growth rate would expect. I mean, as I indicated a couple of times, we're not stopping our investments across the business and new product initiatives, and we're investing very aggressively in the businesses that we can grow in this environment, including personal loans, credit cards, banking, which is a part of our business, we don't talk a lot about, but it's on fire, which is a source of funds account service we provide to financial institutions, particularly banks and Home Services. So, we expect that as part of what could happen next year, although it hasn't really been included in our planning, we haven't said, and here's a factor for increased shopping, we're really thinking when we've done our planning, we've really been more focused on fine economics client re-rating and therefore, client budgets and what they are willing to spend. Yes, that's a great question."
}