{
    "symbol": "CTAS",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-29 12:43:07",
    "content": " Excluding a gain in the related tax benefit in last year's third quarter, operating income margin increased 110 basis points to 20.4% and diluted EPS grew 16.7% to $3.14. Excluding this gain and the related benefit -- the related tax benefit, fiscal 2023 third quarter diluted EPS of $3.14 compared to $2.69 in last year's third quarter, an increase of 16.7%. So in other words, when we talk about we have a little bit over 1 million customers, there are 16 million customers or 16 million businesses in the U.S. and Canada, we're just continuing to try to highlight that there is a great market opportunity, and Todd brought up the point that when the majority of our new business is expanding the served market or tapping into that large market potential, it means that we can grow in those multiples of GDP and employment growth for a long period of time. Sales cycles, they're not elongating the -- what's going on with our customers, they're still fighting to bring people on to make sure that they're providing the right levels of service. But specific to your business, I was wondering if you could talk about the -- basically the COGS or merchandise costs, whether it's for uniforms, mats or the ancillary services that you provide as well as address how labor is progressing in your business, have those things generally been -- have you been able to get leverage on those items despite the challenges, in other words, are those down as a percentage of revenue in the quarter, can you just talk about the trend lines that you're seeing in those if there's any moderation or acceleration in them? Well, I'll say free cash flow, I think your point is a good one from the perspective of -- it's a little bit transitory, but in the way of, look, we're coming off of a fiscal 2021 year where there wasn't a lot of growth and then really getting some nice acceleration into fiscal 2022 and 2023. But generally speaking, the -- I'll just say that we're focused on and we're not going to just grow through pricing, and we're going to find a way in these types of environments to extract the inefficiencies so that we can grow margins, which in these type of inflationary environments are certainly is very challenging, but the team is doing a heck of a job, and we're quite proud of it."
}