{
    "symbol": "CTAS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-28 13:45:25",
    "content": " Excluding a one-time gain recorded in last year's first quarter selling and administrative expenses, operating income margin increased 20 basis points, and EPS grew 12.3%. Excluding last year's first quarter gain totaling $12.1 million and recorded in selling and administrative expenses, fiscal '23 first quarter operating income increased 15.2% and operating income margin increased 20 basis points to 20.3% from 20.1% last year. We continue to be very successful in converting over no programmers into our programs in all of our businesses with the exception of fire, which obviously â\u0080\u0093 they were all -- everyone's a programmer in that business, but we're having really good success there. And we like the momentum of the business today and our expectation right now is that we're not seeing any change in the value that our customers are seeing and we're not changing -- we're not seeing any change in the way in the economy, I'll say. I think they also like our approach that we took over the past couple of years about being really flexible and empathetic with them as they were going through, -- what they went through the various businesses through calendar '21 and calendar '22, -- '20and '21, I should say, with the pandemic. We think they're well trained, well positioned when sales partners have confidence in the products and the technology and the services that they're going to provide, that confidence is powerful and it's showing itself in productivity and we like that. Now that being said, we're -- certainly there will be puts and takes of the First Aid business gross margin throughout the year, don't think of it as a linear progression upward. And also our strong cash flow, we think that will allow us to be opportunistic as we -- whenever we are into a recession if that is today or in the future, we're going to be well positioned to make sure we're successful. And that ability to anticipate and manage our cost structure as well as our pricing, it's reflected in the fact that even in this pretty darn difficult environment, we've been able to increase our margins year-over-year, certainly, excluding those one-time gains, but we've been able to continue to increase our margins during that period of time. We're going to probably be a little bit higher in CapEx during this fiscal â\u0080\u009823 year because we've -- again, we've kind of come from a pandemic period where we didn't need to grow capacity and we've really seen some nice growth over the course of the last -- more than fiscal year."
}