{
    "symbol": "TPR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-18 12:34:08",
    "content": " At the same time, we have transformed our business model, realizing $300 million in run-rate expense savings, which helped to fund our growth initiatives, including a significant step up in brand marketing, which reached 8% of sales, doubling from fiscal â\u0080\u009819. In fiscal year â\u0080\u009822, we delivered 18% top line growth or an increase of 15% over fiscal â\u0080\u009819 pre-pandemic levels as we recruited over 4 million new customers in North America while driving momentum with our existing customers. The brand delivered record revenue of over $1.4 billion in the fiscal year, representing growth of 22%, while expanding operating margin. Specifically, we will spark desire with high emotion product, leaning into our authority on occasion wear and building on our casual foundation, drive brand awareness through impactful marketing campaigns, accelerate China while continuing to grow North America, increased digital revenue by continuing to improve the online experience and further improve profitability through a focus on high-margin growth opportunities as well as increased store productivity. This year, we delivered a record $6.7 billion in revenue, grew earnings per share 20% against last year and 35% versus pre-pandemic levels, and we returned $1.9 billion to shareholders, demonstrating our strong cash flow generation, confidence in the future and our commitment to enhancing value for all stakeholders. But versus last year, where we saw severe COVID impacts, Japan, rest of Asia, weâ\u0080\u0099re seeing very strong double-digit growth, more than 20% in most regions, and we expect that to continue throughout the year. We feel good about that because we have not seen any resistance from our consumer, and they really appreciate the codes that Coach offer that are unique, the value and the innovation and we anticipate seeing a return to AUR growth even in North America handbags in the first quarter and throughout the year. Again, at Kate Spade and at Stuart Weitzman, continuing to see strong AUR growth in the last quarter over the last year, earlier on the journey, so much more runway ahead in those brands as well. We delivered record annual revenue this year with double-digit growth at each brand and our digital business reaching $2 billion, along with earnings 20% above last year, so a standout performance."
}