{
    "symbol": "TPR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-10 12:21:04",
    "content": " We acquired nearly 3 million new customers who transacted with our brands across channels in North America, a low double-digit increase compared to the prior year with growth in both stores and online. The brand drove significant trend improvements in the holiday quarter, highlighted by 37% revenue growth compared to last year and a return to pre-pandemic sales level. Based on the strong results of our second quarter, significant free cash flow generation, robust balance sheet and our outlook for growth, we now expect to return over $1.5 billion to shareholders in fiscal '22, an increase from the prior outlook of $1.25 billion. This combination has resulted in 11 quarters of increased handbag AUR in North America, a second quarter resulting in the highest revenue and profitability in 10 years, a sustainable top line approaching $5 billion in this fiscal year, substantially greater SKU productivity, over 1.5 million new customers transacting with the brand in North America just this last quarter, meaningful growth in men's ready-to-wear and footwear and all men's categories. I just, first of all, say the power of these platforms is really impressive, and you heard Todd mention how the logic side of the business is really powering all of our brands, and I think it's obvious in the results that you're seeing and I can tell you as someone who is relatively new to the story, seeing this company go from a technology deficit to technology really driving the business in a really short period of time through the acceleration program. The new customers that we're seeing are increasingly younger across our brands, and we think it provides a strong foundation for future growth. We've increased our outlook for the year, which includes raising fiscal '22 or '22 revenue outlook to a record at $6.75 billion, with Coach approaching $5 billion and inflection at Kate Spade, digital revenue reaching $2 billion and our fiscal '22 outlook that is 40% above pre-pandemic levels."
}