{
    "symbol": "BQ",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-01 11:39:02",
    "content": " Due to the impact of the objective above market environment, leading to a year-over-year slight increase of 2.4% in revenue to RMB 589.6 million during the first half. During the first half of fiscal year '23, our GMP recorded a notable increase to 240 basis points to 21.0% a margin that GMP of private labels increased from 27.4% to 33.0%. Our operating expenses were able to report 21.0% year-over-year decreased in the first half in terms of revenue we also dropped from 32.2% of total revenue to 26.1% of total revenue, highlighting our effectiveness in cost control. Our CC also reported 54.1% year-over-year decreased to RMB 5.2 from RMB 11.3 in the same period last year, which is our record low all these pointed to the fact that online community remains vibrant with new traffic and high stickiness laying a solid foundation for future growth. Our private labels business reported an encouraging performance during the first half with revenue increasing 30.9% year-over-year to RMB 105.1 million and gross profit margin increasing by 560 basis points year-over-year to 33% from 27.44%. In this first half our total revenue decreased 2.4% to RMB 589.6 million, primarily due to the recurrence of COVID-19 which led to modest decrease in product sales revenue of 1.5% year-over-year to RMB 568.7 million. In the first half of fiscal year 2023, our procurement expenses slightly decreased -- slightly increased from 10.4% of revenue last year to 11.6% of revenue this year, roughly maintained at RMB 68.2 million. That came down to net loss of RMB 29.5 million in the first half versus a net loss of RMB 81.9 million in the same period last year, representing a significant chunk of 64%. Taking a broader view, we are cautiously optimistic about the market condition and remain fully confident with our strategy and execution supported by our expanding brand portfolio of 704 in the first half along with an 8% year-over-year increase in SKUs to 26,008 with that we are aware equipped to capture market opportunities."
}