{
    "symbol": "COHU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 22:26:04",
    "content": " I'd now like to hand the conference over to your host today, Mr. Jeff Jones, Senior Vice President and Chief Financial Officer. Good afternoon, and welcome to our conference call to discuss Cohu's first quarter 2022 results and second quarter 2022 outlook. If you need a copy of our earnings release, you may access it from our website at cohu.com or by contacting Cohu Investor Relations. During today's call, we will make forward-looking statements reflecting management's current expectations concerning Cohu's future business. We encourage you to review the forward-looking statements section of the slide presentation and the earnings release as well as Cohu's filings with the SEC, including the most recently filed Form 10-K and Form 10-Q. Our comments speak only as of today, April 28, 2022 and Cohu assumes no obligation to update these statements for developments occurring after this call. Finally, during this call, we will discuss certain non-GAAP financial measures. Now, I'd like to turn the call over to Luis Müller, Cohu's President and CEO. First quarter revenue was approximately $198 million, and non-GAAP EPS was $0.66, both exceeding expectations, driven by customer acquisitions and effective supply chain management. Cohu is benefiting from several key design wins in late 2021, with those customers starting to place volume orders this past quarter. This has been particularly beneficial for the tester business that booked incremental $45 million in design win orders in Q1, broadening our addressable market beyond RF front-end IC test. The success in new customer acquisition-driven orders, increased backlog to a new record and is putting Cohu on pace to achieve our midterm targets of 25% non-GAAP operating income at $1 billion revenue. Combined with progress of our contactor manufacturing in-sourcing, we're delivering better-than-anticipated gross margin, and again on pace to achieve our midterm target of 49% non-GAAP gross margin. In all, Cohu is progressing well against our strategic plans. Semi Test is expanding applications in display driver IC, capturing business in Korea and Taiwan, gaining new sockets for testing power management and analog ICs as we continue to expand, the instrumentation portfolio in our low-cost Diamondx platform. Our services business, including spare parts, upgrades and data analytics software remain robust in continuing to develop a new frontier with DI-Core data analytics software that is now use at several major automotive customers. We got a key order for a next-generation MEMS sensor test platform that brings test to a new level, enabling ultrasensitive sensors used in mobility and automotive applications. We have demonstrated the superior thermal performance of our T-Core thermal technology in the Eclipse handler, testing high-performance computing processors and ultra-large form factor devices. The push-to-automate back-end factories improved productivity, also known as Industry 4.0 is creating new sales opportunities for Cohu to provide automation and data analytics solutions to customers. In Q1, we published Cohu's 2021 Sustainability Report, which you can read in detail in our website at www.cohu.com. We are excited to communicate our progress on energy usage, addition of two operating sites with solar power generation and to continue our stellar safety and ethics record. The report also promotes our progress on employee gender and racial diversity, details about Scope 1 and 2 greenhouse gas emissions and corporate ESG targets for 2022. Although, we have very limited exposure to customers and supply chain in that region, we have opted to join other global corporations in halting any business engagements with Russian companies starting on March 1. Finally, I want to comment on COVID disruptions and supply chain constraints that continue to impact many semiconductor and equipment companies. But the Cohu team has done an outstanding job putting in place countermeasures and anticipating these challenges, requesting and receiving help from our suppliers, some of which are also our customers. They have been around since March 2020 and are probably going to continue, but I'm confident that our proactive approach in managing disruptions will continue to yield positive results. The fact is that one company's challenge is also another growth opportunity, and we're working hard to capitalize on these disruptions to support and win new customers. Before I walk through the Q1 results and Q2 guidance, please note that my comments that follow all refer to non-GAAP figures. Information about the non-GAAP financial measures including the GAAP to non-GAAP reconciliations and other disclosures are included in the accompanying earnings release and investor presentation, which are located on the Investor page of our website. Now turning to the financial results, Cohu again delivered strong revenue and profitability in the quarter. During the first quarter, one automotive segment customer accounted for more than 10% of sales. Quarter-over-quarter, our semi test business grew in part from recent design win orders as our automation revenue moderated, resulting in a first quarter revenue mix and gross margin closer to the mid-term target. Operating expenses for Q1 were lower than guidance at $50.9 million as certain product development, travel and other costs have shifted from Q1 to Q2. First quarter non-GAAP operating income was 20.3% of revenue, and adjusted EBITDA was 22.7%. Non-GAAP EPS, for the first quarter, was $0.66. In summary, Q1 profitability was strong on seasonally low revenue and is progressing to the mid-term target. Now moving to the balance sheet, the Q1 cash balance was $359 million and total debt was reduced to $110 million. During the first quarter, we repaid approximately $9 million of debt and used $6.4 million to repurchase approximately 214,000 shares of common stock. Cumulative through Q1, Cohu has used $13.7 million to repurchase approximately 420,000 shares of common stock. Overall, Cohu's balance sheet is in a strong position to support debt reduction, the share repurchase program and investment opportunities to expand our served markets and technology portfolio in line with our growth strategy. Entering Q2, our backlog is at a record level of $363 million and is scheduled to ship over multiple quarters as determined by customer requirements and material availability. As Luis mentioned, the supply chain remains challenging. And to-date, Cohu has effectively navigated supply constraints to locate required material and control costs. However, similar to last quarter, given the uncertainty with supply chain and semiconductor availability, we're hesitant to comment in further detail about future quarterly revenue at this time. Q2 operating expenses are projected to be between $54 million and $55 million, higher than Q1 due to increasing R&D investments to support greater customer traction for our products and increasing travel pushed from Q1 to Q2 to support our 2022 plans. We're projecting Q2 interest expense to be approximately $1 million, and we expect Q2 adjusted EBITDA at the midpoint of guidance to be approximately 22%. Full year 2022 non-GAAP tax rate is also estimated to be approximately 20%, which is 200 basis points higher than our prior guidance due to the annual impact of less tax benefit from the annual equity vesting and reduced credit against US tax for foreign taxes paid. And that concludes our prepared remarks, and now we'll open the call to questions. But also, we're seeing manufacturing efficiencies out of our operations, our foreign operations. It has had incremental impact over the last few quarters, as orders become subject to that price increase. But as of the end of Q1, it's effectively been fully realized. Luis, I wanted to go back to a comment you made in your prepared remarks around testers in the $45 million in design wins beyond RFIC test. Yes, if you recall, we have mentioned that in the fourth quarter, we had sort of a single quarter with the largest number of design wins that I recall, at least in my history. And those are starting to pan out into volume orders, now in the first quarter, beginning this year. But even if you take that out, you can see that we have had a pretty good first quarter bookings. That design win, as I mentioned before, cuts across different segments, flat panel display, PMIC. Luis, I think you and Jeff were amongst the first to talk about a return to seasonality in the business. I mean it's been de-amplified, if you will. But it's still prevalent when you see typically a bit stronger second and third quarter, typically a little weaker first and fourth quarter. Maybe first, just to talk about supply constraint. I think last quarter, Jeff, you talked about a $8 million to $10 million revenue constraint. But so, what we're seeing as Louis mentioned, I mentioned as well, record backlog. And so, the rollout over the next few quarters is obviously gated by customers' ability to take more equipment, trying to match that up when they have lead frames and so forth. So, I would say -- I wouldn't try to track that $8 million beyond Q1. I think that's a good characterization to some of them, Brian. We have -- I'm looking here, it's really a list of seven customers. It is a start, but it's actually a fairly decent start in terms of volume. And I would say in terms of the backlog and the way it rolls out, as we said at the end of the quarter, we're seeing about 80% of it roll out over the next two quarters. Last couple of quarters since inception, you repurchased sort of a ratable amount of your stock. So, we're evaluating those plans and plan to put another 10b5-1 in place here soon. And as you do that, I'm wondering, are you -- do you view this as sort of your expanding the portion of the test TAM that you're now able to capture, or do you think the test TAM hasn't really changed. Hi Quinn, it's a bit of both, to be honest. We have previously communicated a portion of this as being our addressable market, but we're still working on developing the instrumentation to go at it. But in other parts, I got to say realistically, we have expanded a little bit our SAM, and I think we're going to talk more about it in the near future, but we have expanded our SAM bit. And then maybe for Jeff, I know you're not giving guidance beyond the second quarter. But as you look at the backlog, can you give us some sense what do you see as the relative mix between inspection, handlers, test, and contactors as we come through the second and third quarter. Yes, I would say that it stays at a favorable mix level over the next couple of quarters. We've made headway and then we're seeing efficiencies in the manufacturing process, and we continue to in-source on contactors. But to your question about mix, yes, I see a strong mix over the next couple of quarters. First, just on the model a little bit. And then, I would model Q4 down just slightly, maybe $0.5 million. And then given the stronger start here to 2022 than expected and these design wins now ramping, just wondering any color or any comments on the midterm target and the time line you're expecting. I mean, I would add to that, that as we've said, within that strategy, we're planning for higher growth rates in the tester business. And so I would say we're executing well on that, Tyler. Appreciate, that's all for us. First, just I know -- I mean, it seems like you have done a great job in terms of activation and whether through the supply chain constraints. I would say, yes, we're working through availability on material on our side, but also gated by customer and their ability to receive and utilize equipment within a reasonable period of time. I was going to say, it's not so much limiting. What we have seen is more of a snapback in demand in late 2020, beginning of 2021, because of a very constrained environment due to COVID and factory shutdowns in the middle of 2020. It's more of a natural growth now driven predominantly by ADAS devices, essentially processors and sensors for automotive applications and electrification, which continues to be pretty strong. Before we sign off, I'd like to remind everyone that Cohu will be hosting a virtual Investor and Analyst Day on Monday, May 16. And then lastly, I'd like to mention that we'll be attending a number of Investor Conferences over the next few months. And Craig-Hallum virtual conference, on June 1st, Cowen Conference on June 2nd, Baird Conference on June 6th, Stifel Conference on June 7th, Rosenblatt Virtual Conference on June 9th and the CEO Summit on July 13th. So if you'd like to attend any of these events, please reach out to your respective banking and/or conference contacts to arrange a meeting with Cohu. Thank you for joining today's call, and have a great day."
}