{
    "symbol": "TEAM",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-02 21:25:03",
    "content": " We have achieved a ton this quarter, shipping many platform enhancements and product features that deliver incredible value to delight our customers in the cloud, including delivering data residency in Germany, launching automation in Confluence, helping our customers to the cloud with migrations up nearly 2x from the prior year and completing several of our largest migrations to-date and showcasing our unique position in the ITSM market with impressive customer growth, multiple large swap-out stories and recognition as a leader by industry analysts and these are just a handful of examples. So, as you already know, more than two years ago, we announced the upcoming end of life of our server products, and ever since then, we have been on this migration journey, helping our on-premises customers move from both server and data center to our cloud offerings. And I have to say that even in the uncertain macroeconomic times, every day that goes by, I am more confident in our ability to not only attract our customers to the cloud, but convince them of the additional ROI savings that going to our cloud, the additional benefits from a feature perspective, from there we have been able to get increasing our ability to get through the contractual, legal and data privacy aspects and move to our customers to the cloud. Back in April, we chatted with you, our investors at our Investor Day and we talked about cluster of four growth opportunities that we saw ahead of us is those were around of cloud migrations, our ITSM opportunity to take market share there, better serving enterprise customers and launching and growing new product that we built on the back -- prior investments we have made in the Atlassian platform. So we continue to innovate, we have a lot of new products that we have built over the last couple of years and we continue to work with customers in testing, things like Jira product discovery, Encompass and Atlas, and a couple of upcoming ones like is in alpha and beta. At the same time, we continue to deepen our platform investment and one of the things as I just mentioned, to Greggâ\u0080\u0099s question earlier, when customers move to the cloud, their ability to consume multiple Atlassian products via the platform and connect them together with things like Smartlinks or analytics running across them is a huge advantage of the cloud and that all comes from the innovation and investment in our infrastructure and ability to manage all of that sort of thing. As you said, this roll out new data residency regions this month and we continue to work with our customers on what regions they want to see us data residency remain, things like BaFin and HIPAA and all sorts of the acronym soup that comes with the enterprise. Like, as I already mentioned, this whole transition of server customers migrating to their data center or cloud is a multiyear journey, and obviously, the core focus there was to migrate customers to the cloud and we are largely in line with all of our goals that we have set for migrations ever since we started this journey a couple of years ago. However, when we did this, whenever you announce an end of life of a product, we know we are going to lose some customers through the transition, and the good news here is, over the last couple of years, we have seen an increasing number of customers move to data center and you see that in the numbers, but as well as many of customers staying on server probably for longer than we expected. As I mentioned prior, this is all about a multiyear journey away from server and to cloud and data center, and we have been making cloud the primary destination for these customers and we have been seeing those migration rates to cloud, hitting very much in line with our expectations. On your next piece is, well, hey, you are doing these price increases, you are doing larger price increases on your server and data center products to effectively more incentivize the customers to choose cloud and I have to say, actually, that is driving exactly what we have expected on our cloud migrations and thatâ\u0080\u0099s why our cloud migrations are going -- driving that 10% growth that we have communicated over and again. But in general, what we have seen overall is much more customers sticking with us, either choosing to renew server or move to data center or move to cloud than we originally expected when we started this journey a couple of years ago. The ability to do that have us run it for them, have us handle things like data residency and handle the server loads and everything for them is a huge benefit of the cloud and we see customers moving for reasons like that. We have invested heavily to get closer to our largest customers and help them through this strategic transformation to the cloud, while maintaining some of the most efficient sales and marketing spend that you see in the industry and thatâ\u0080\u0099s the balancing act that we have had over the last couple of years."
}