{
    "symbol": "PINC",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-07 10:44:02",
    "content": " Performance in our Supply Chain Services segment reflect quarter-over-quarter growth in net administrative fee revenue, primarily due to growth in the non-acute or, as we call it, the Continuum of Care group purchasing business. For the second quarter of 2023 and as compared with the same period a year ago, our results were generally in line with our expectations with total net revenue of $359.6 million, a decrease of 5%. In our Supply Chain Services segment, net administrative fees revenue increased 3% over the prior year period, primarily driven by growth in the non-acute group purchasing business. Within our acute and non-acute GPO portfolio, the food category produced another quarter of strong growth due to volume growth and the impact of inflation which was partially offset by the continued normalization of demand and pricing across some categories including Pharmacy and Personal Protective Equipment or PPE relative to the prior year period. In our Performance Services segment, revenue increased 15% compared with last year's second quarter. Adjusted EBITDA decreased slightly compared with the prior year period to $140.5 million, primarily due to two factors; first, Supply Chain Services adjusted EBITDA decreased compared with the second quarter of fiscal 2022. Profitability of our direct sourcing business improved sequentially from the fiscal 2023 first quarter, but declined from the prior year quarter as we expected due to the decrease in products revenue driven by lower demand and pricing for PPE and higher logistics costs in the current year period. Compared with the year ago quarter, adjusted net income decreased 5% and adjusted earnings per share decreased slightly to $0.72, primarily as a result of the same items that impacted adjusted EBITDA as well as the increase in the effective tax rate in the current year. We are raising Performance Services net revenue to a range of $450 million to $470 million, reflecting our performance in the second quarter and expected contributions from ConfigureNet partially offset by lower revenue contributions from Remitra, than we originally expected. In our GPO business, we expect net administrative fees revenue to be relatively flat in the third quarter compared with the prior year quarter reflecting the current healthcare utilization environment and ongoing decrease in levels of member excess inventory. In our Performance Services business, we expect third quarter revenue to decline sequentially from the second quarter due to the timing of certain enterprise license engagements, but we generally expect this segment to produce strong year-over-year growth in the third quarter. We're continuing to see growth above and had expectations for managed services where we're actually helping health care systems provide service oversight of their IT applications and other things from an advisory standpoint, and we're also seeing good performance in our collaborative still. We'll continue to see that sequentially through the balance of the fiscal year, but we won't see year-over-year growth, until we get to the fourth quarter, because we did have higher demand and pricing in the prior year compared to what we're experiencing in the current year."
}