{
    "symbol": "NSSC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-29 14:58:06",
    "content": " Net sales for the quarter increased 22% to a quarterly record of $40.2 million, as compared to $35.4 million for the same period one year ago. And net sales for the fiscal year ended June 30, 2022, increased 26% to a record $143.6 million, as compared to $114 million for the same period a year ago. Recurring monthly revenue continued its strong growth, increasing 33% for Q4 to $12.7 million, compared to $9.5 million for the same period last year, and increasing 36% for the fiscal year to $46 million, as compared to $33.9 million last year. In addition, our equipment sales in Q4 increased 18% to $30.5 million, as compared to $25.9 million for Q4 last year. And for fiscal 2022, equipment sales increased 22% to $97.6 million, as compared to $80.1 million last year. Gross profit for the three months ended June 30 2022, increased 22% to $19.2 million with a gross margin of 44%, as compared to $15.7 million with a gross margin of 44% for the same period a year ago. Gross profit for the fiscal year ended June 30 2022, increased 17% to $59.2 million with a gross margin of 41%, as compared to $50.7 million with a gross margin of 45% for the same period a year ago. Gross profit for recurring revenue for the fourth quarter increased 34% to $11.1 million with a very strong 87% gross margin, as compared to $8.3 million with the gross margin of 87% for the same period last year. And gross profit for recurring revenue for fiscal 2022 increased 38% to $40 million with a gross margin of 87%, as compared to $29 million with a gross margin of 86% last year, a 100 basis point improvement. Gross profit for equipment sales for Q4 increased 9% to $8.1 million with a gross margin of 27%, as compared to $7.5 million with a gross margin of 29% last year. For fiscal 2022, gross profit decreased 12% to $19.1 million with a gross margin of 20%, as compared to $21.7 million with a gross margin of 27% last year. The decrease in gross margins for equipment sales for the quarter and fiscal year, as compared to last year were primarily due to the continued inflation of freight and component parts costs relating to the current worldwide supply chain problems, as well as increased sales of our StarLink radios, which have lower margins, but result in the more profitable recurring revenues. Research and development costs for the quarter increased 8% to $2.1 million or 5% of sales, as compared to $1.9 million or 5% of sales for the same quarter a year ago. Research and development costs for fiscal year ended June 30 2022, increased 5% to $8 million or 6% of sales, as compared to $7.6 million or 7% of sales for the same period last year. Selling, general, and administrative expenses for the quarter increased 24% to $8.9 million or 21% of net sales, as compared to $7.2 million or 20% of sales for the same period last year. Selling, general and administrative expenses for the fiscal year ended June 30 2022, increased 31% to $32.9 million or 23% of net sales, as compared to $25.2 million or 22% of net sales for the same period last year. Operating income for the quarter increased 25% to $8.2 million, as compared to $6.6 million for the same period last year. Operating income for the full fiscal year ended June 30 2022, increased 2% to $18.2 million, as compared to $17.9 million for the same period last year. The Company's provision for income taxes for the three months ended June 30 2022, decreased 56% to $476,000 with an effective tax rate of 6%, as compared to $1.1 million with an effective tax rate of 16% for the same period last year. For fiscal 2022, the provision for income taxes decreased 11% to $2.2 million with an effective tax rate of 10%, as compared to $2.5 million with an effective tax rate of 14% last year. Net income for the quarter increased 36% to a fourth quarter record $7.5 million or $0.20 per diluted share, as compared to $5.5 million or $0.15 per diluted share for the same period last year. Net income for the fiscal year ended June 30 2022, increased 27% to a record $19.6 million or $0.53 per diluted share, as compared to $15.4 million or $0.42 per diluted share in the same period last year. Adjusted EBITDA for the quarter increased 29% to a fourth quarter record $9.3 million or $0.25 per diluted share, as compared to $7.2 million or $0.20 per diluted share for the same period last year and adjusted EBITDA for the fiscal year ended June 30 2022, increased 13% to a record $22.6 million or $0.61 per diluted share, as compared to $20.1 million or $0.55 per diluted share in the same period last year. Cash provided by operating activities for fiscal 2022 was $8.3 million, as compared to $23 million for the same period last year. This decrease was primarily due to inventories increasing in fiscal 2022 by $19.3 million, as compared to a decrease of $8.8 million in the same period a year ago. The recurring revenue annual run rate is now approximately $54 million as of July 2022. The recurring revenue annual run rate is now approximately $54 million as of July 2022."
}