{
    "symbol": "CONN",
    "quarter": 2,
    "year": 2023,
    "date": "2022-08-30 13:29:03",
    "content": " Second quarter sales to this lower income consumer segment declined 24% year-over-year compared to a 12% year-over-year decline to our higher income, fast and reliable customer segment, which include customers who paid with cash or our private label credit card. On a consolidated basis, total revenues were $346.6 million for the second quarter of fiscal year 2023, representing a 17.1% decrease from the same period last fiscal year. For the second quarter, GAAP net income was $0.09 per diluted share compared to net income of $1.22 per diluted share for the same period last fiscal year. On a non-GAAP basis, adjusting for certain charges and credits, we reported net income of $0.04 per diluted share for the second quarter compared to $1.22 per diluted share for the same period last fiscal year. The 19.4% year-over-year decline in retail revenue was primarily due to the trends Chandra discussed in her prepared remarks, including overlapping the benefits stimulus had on second quarter sales last fiscal year, tighter year-over-year underwriting from our lease-to-own partner and a reduction in demand for discretionary products. Retail gross margin for the second quarter was 34.6% compared to 37.7% for the same period last fiscal year, a decline of 310 basis points. As a percent of retail sales, SG&A expenses were 35% for the second quarter compared to 29.4% for the same period last fiscal year. Retail segment operating income was $107,000 and included a $1.5 million benefit from a lease modification that occurred during the quarter, compared to retail segment operating income of $28.7 million for the same period last fiscal year. Finance charges and other revenues were $66.8 million for the second quarter, a 6.4% decline from the same period last fiscal year. For the second quarter, annualized net charge-offs as a percent of the average portfolio balance was 13.7% compared to 11.3% for the same period last fiscal year. During the second quarter of fiscal year 2023, the credit provision for bad debts was $26.8 million compared to $10.1 million for the same period last fiscal year. In addition, net debt as a percent of the ending portfolio balance was approximately 50.9% at the end of the second quarter compared to approximately 36.2% at the end of the second quarter of last year and 59% at January 31, 2020, before the COVID-19 pandemic began."
}