{
    "symbol": "CONN",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-01 14:34:25",
    "content": " In fact, total sales for our fast and reliable customer segment have increased on a year-over-year basis over the past 12 consecutive quarters and represents approximately 39% of our retail sales over the last 12-month compared to 26% in fiscal year 2020. On a consolidated basis, total revenues were $339.8 million for the first quarter of fiscal year 2023, representing a 6.6% decrease from the same period last fiscal year. As a reminder, earnings in the first quarter last fiscal year benefited from lower cost as a result of the COVID-19 pandemic, and a $17.1 million benefit in our provision for bad debt associated with the release of a portion of our economic reserve. The 6.5% year-over-year decline in retail revenue was primarily due to a more challenging retail environment, lapping the benefits stimulus had on first quarter sales last fiscal year and tighter underwriting from our lease-to-own partners. Retail gross margin for the first quarter was 34.5%, a decrease of 200 basis points from the same period last fiscal year. As a percent of retail sales, SG&A expenses were 35.2% for the first quarter compared to 31.2% for the same period last fiscal year. As we discussed throughout today's call, lower retail sales and higher costs contributed to a retail segment operating loss of $2.1 million compared to retail segment operating income of $15.7 million for the same period last fiscal year. Turning to our credit segment, finance charges and other revenues were $67.3 million for the first quarter, a 6.8% decline from the same period last fiscal year. The decline in credit segment revenue was due to a 6.5% reduction in the average balance of the customer receivable portfolio over the prior fiscal year period as our underwriting strategies remain disciplined, and we focused on maintaining 1,000 basis points of credit spread. For the first quarter, net charge-offs as a percent of the average portfolio balance were 11.9% compared to 15.3% for the same period last fiscal year. During the first quarter of fiscal year 2023, the credit provision for bad debts was $14.6 million, compared to a $17.2 million benefit to our provision for bad debts last year. With a smaller average portfolio balance, we deleveraged fixed credit segment SG&A expenses and credit segment income before taxes was $10.5 million, compared to $43.8 million for the same period last fiscal year. One of the things that that we have seen and continue to see is consumer payment activity remains strong at Conn's resulting in strong credit portfolio performance, specifically, net charge-offs for us last quarter were 11% versus this year versus 15% last year and our re-age balance can continue to decline."
}