{
    "symbol": "CINF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 14:23:03",
    "content": " Net income for the fourth quarter of 2022 was just over $1 billion, that's 31% or $457 million less than last year's outstanding fourth quarter, largely due to $307 million less benefit on an after-tax basis in the fair value of securities held in our equity portfolio. Non-GAAP operating income of $202 million for the fourth quarter was down $118 million from a year ago, including catastrophe losses that were $66 million higher on an after-tax basis. On a current accident year basis, excluding catastrophe losses, our 90.2% combined ratio compares favorably with each of the five years prior to 2020 and was 1.5 percentage points better than the average for that period with each accident year measured as of the respective year-end. Consolidated property casualty net written premiums rose 10% for the fourth quarter and 13% for the full year 2022, that includes a 13% increase in fourth quarter renewal written premiums with a significant portion from higher levels of insured exposures as we factor in elevated inflation. For our personal lines segment, net written premium grew 16% for the quarter and 15% for the full year 2022, as we continued our planned expansion of high net worth business produced by our agencies. Our life insurance subsidiary continued its good performance with full year 2022 net income of $66 million, up 50% from a year ago and term life insurance earned premiums grew by 5%. The treaty's main change this year is retaining a greater share of losses for layers of coverage than what was effect for 2022, while adding $92 million of coverage in a new layer between $900 million and $1.1 billion. During 2022, our net increase in the property casualty loss and loss expense reserves was $1.029 billion, a 15% increase from the net reserve balance at year end 2021. For full year 2022, we experienced $159 million of property casualty net favorable reserve development on prior accident years that benefited the combined ratio by 2.3 percentage points. On an all-lines basis by accident year, net reserve development for the full year 2022 included favorable $96 million for 2021, favorable $124 million for 2020, unfavorable $72 million for 2019 and a favorable $11 million in aggregate for accident years prior to 2019."
}