{
    "symbol": "ORN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 16:50:05",
    "content": " In the second quarter, the Marine segment had revenues of $82.3 million and adjusted EBITDA of $8.7 million, equating to an adjusted EBITDA margin of 10.6%. This compares to $63.9 million of revenue, adjusted EBITDA of $7.8 million and an adjusted EBITDA margin of 12.2% in the prior year period. Marine results were down slightly on revenues and up on adjusted EBITDA and adjusted EBITDA margin compared to the first quarter of '22 that had revenues of $84.5 million, adjusted EBITDA of $7.3 million and an adjusted EBITDA margin of 8.6%. The Concrete segment had second quarter revenues of $112.3 million, adjusted EBITDA of a negative $3 million and adjusted EBITDA margin of negative 2.7%. This compares to $81.9 million of revenue, adjusted EBITDA of $400,000 and adjusted EBITDA margin of negative 0.5% in the second quarter of '21. Concrete results were up compared to the first quarter of 2022 that had revenues of $90.5 million, adjusted EBITDA of negative $2.0 million and an adjusted EBITDA margin of a negative 2.3%. SG&A expenses for the first quarter -- excuse me, second quarter were $17.2 million or 8.9% of revenues compared to $13.7 million or 9.3% of revenues in the prior year period. Second quarter adjusted EBITDA was $5.7 million, representing an adjusted EBITDA margin of 2.9%. This compares to adjusted EBITDA of $7.4 million and an adjusted EBITDA margin of 5.1% in the prior year period, and adjusted EBITDA of $5.2 million and adjusted EBITDA margin of 3% in the first quarter. Approximately 81% or $487 million of the quarter ending backlog will burn during the next 12 months, with the remainder associated with longer-term projects burning throughout '23 and into 2024. Additionally, the Company is the apparent successful bidder or has been awarded $153 million of new work subsequent to the end of the second quarter. And that still came into our numbers in the second quarter, reducing this by $9 million and dropping the project numbers, we expect to see margin improvements in concrete throughout the third and fourth quarter. But yet segment backlog in Commercial Concrete is incredibly strong at $322 million, that's up from $287 million in the first quarter, and that's up from $224 million last year. But right now, it's $16 million this year, I would believe that we're going to be looking at some more expand in the following year, probably another $2 million to $3 million at this point."
}