{
    "symbol": "ASUR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 19:29:05",
    "content": " In the third quarter new sales bookings grew by 91% relative to the prior year, including 200% growth in recurring new sales bookings with strength across many parts of the business, including HR compliance and tax solutions. We anticipate finishing 2022 with strong momentum that will carry through 2023 with continued double digit organic revenue growth, driving strong adjusted EBITDA margin gains, margin improvement in 2023 is expected to be driven by revenue growth, as well as efficiency improvements that will enable us to convert a high proportion of revenues to adjusted EBITDA. To wrap up, momentum is really building strongly in the business, we can see the impact on that of third quarter's new sales bookings of 91% year-over-year improvements and investment revenue, reflecting higher client balances and rates as well as increased sales backlog, and increase retention across several product lines. Adjusted EBITDA rose by 71% relative to prior year to $22.1 million driven by revenue growth, operating efficiencies and overall continued strong focus on cost. We are also introducing adjusted EBITDA margin guidance for 2023, which calls for a range of 14% to 16% which represents a significant expansion margins relative to 2022, which is already a period where we delivered strong margin growth over the prior year. Yes Eric, and I apologize, the only thing I would add, if you look at our ARR bookings or reoccurring bookings, you know, it really was 40% increase in first quarter, 80s in the second 91 in the third, some of the small business churned or bookings turning into revenue is almost immediate to 90 days. So it's a combination, not every booking goes live right away, you know, the organic growth was a little over zero in the first quarter, a little over zero in the second, third quarter, some of the revenue from different streams hit the beach, it was over four, fourth quarter, we have really good visibility."
}