{
    "symbol": "ASUR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:44:04",
    "content": "  Operator: Good afternoon, and welcome to Asure’s First Quarter 2022 Earnings Conference Call. Joining us for today’s call are Asure’s Chairman and CEO, Pat Goepel; Asure’s Chief Financial Officer, John Pence; and Head of Investor Relations, Randal Rudniski. Good afternoon, everyone, and thank you for joining us for Asure’s first quarter 2022 earnings call. Today’s call will also contain forward-looking statements that refer to future events and as such, involve some risks. Finally, I’d like to remind everyone this call is being recorded, and it will be made available for replay via a link available on the Investor Relations section of our website. Thank you, Randal, and welcome, everyone, to Asure Software’s first quarter earnings call. We sure appreciate your interest, whether you’re a shareholder, client, employee, or prospective shareholder or analyst. I’ll begin today’s presentation with an update on our business highlights and strategy and then we’ll turn the call over to our CFO, John Pence for a more detailed review of our financial results and outlook for the remainder of the 2022 fiscal year. We delivered solid execution of our 2022 business plan, and we continue to build our sales and product momentum, and we showed meaningful progress in key business areas. A great example of our focus in this area is that our announcement this morning that we have launched the integration marketplace with 128 prebuilt integrations, we now have the foundation to create new client solutions and new revenue streams. It’s the culmination of our efforts since we pivoted to become a pure play Human Capital Management provider, when we sold the space business. This adds a valuable new service to our roster, moves us closer to having a direct relationship with employees and it’s the direction the Human Capital Management industry needs to go. We also had sales success in our business lines, the business lines provide us with unique differentiation in the marketplace enable us to expand our relationships and tap into larger client segments. In HR consulting, our focus and unique business model to of 6% organic growth in our revenues prior to – relative to prior year, this is a differentiator for us in a small to medium size business segment. We’re also keeping an eye on acquisition opportunities, we intend to be opportunistic as it demonstrated by the small acquisition we made in January and fully integrated by the end of the quarter. We’re in a labor environment of almost unprecedented change from perspectives of regulation, mobility and talent. Our non-recurring revenues increased by $800,000 versus prior year and was aided by continuing success of our employee retention tax credit program, where we have now delivered to our customers more than $300 million of stimulus through this government program. Non-GAAP EBITDA rose by $600,000 or 18% in the first quarter relative to prior year and our non-GAAP EBITDA margin remains stable at 17% of revenues. We accomplish this despite the headwinds from higher benefits expense this year, as a result of last year’s reductions in response to the impact of COVID on our business. That headwind was approximately $1 million in the – our year-over-year comparisons, without which we would have generated even stronger EBITDA margin gains. We believe that looking at our EBITDA margin, this way provides further validation of our strategy to grow margins by increasing the scale of the business. In the first quarter, we grew revenues by $3.2 million relative to the fourth quarter to $24.3 million. That same period, we grew non-GAAP EBITDA by $1.6 million, representing an EBITDA conversion rate of 50% of revenues. That EBITDA conversion drove our non-GAAP EBITDA margin to 17% in the quarter from 11% in the previous quarter, that’s an increase of 520 basis points relative to Q4. As we have stated before, in 2022, we are reinvesting a portion of our profit improvement to fuel technical improvements that support our product strategy and business processes to further expansion of sales and marketing activities and to further enhance our service capability. It’s important to keep in mind, first quarters are seasonally strong as recurring year-end W-2, ACA revenue is recognized in this period. Firstly, full year 2022 revenues, we have raised the low end of our guidance range to $88 million, and accordingly, our revised guidance for 2022 revenues is a range of $88 million to $90 million. We expect to exit 2022 with higher levels of organic revenue growth, giving us confidence is our performance with cross selling activity, strong demand of our tax and HR consulting solutions and positive expectations relating to the technological and platform innovations we have announced to-date. Non-GAAP EBITDA in the second quarter is expected to come in a little lower than in prior year second quarter, we continue to make incremental investments in sales head count, sales tools, marketing, advertising, and other initiatives designed to utilize our more robust technical platform and leverage the innovative partnerships and integrations we have underway. In the second quarter of 2022, we will also continue to experience the headwind of the restoration of incentives and benefits in the second half of 2021, which will lead to higher cost in the current period than in prior year. From the second quarter, we expect revenues and non-GAAP EBITDA will strengthen for the remainder of 2022 with accelerating revenue performance, driving higher levels of EBITDA through the year. Looking into 2023 and beyond, we continue to focus our long-term targets of 10% annual growth in organic revenues and 10% growth in inorganic revenue. We also believe that as a business scales, we can deliver 20% non-GAAP EBITDA margins via revenue gains and efficiencies. We’ve developed some innovative solutions with partners, while also enhancing our own technology to improve client service and product capabilities. We expect our investments in these areas, we’ll bring more robust levels of organic revenue growth in the second half of 2022 and beyond, our acquisition strategy is also proving itself. The integration has gone seamlessly, the business are hitting our objectives, and they’re helping to build scale and operating margins in our business, we’re happy to have proven the business model here. We expect 2022 will be a strong year with double-digit revenue growth, strong margin performance and a portfolio of new innovative solutions that is poised to deliver new revenue streams and value for our business. So with that, I’ll send the call back to the operator for the questions. First one, we’ve got here, just on organic growth, so we’re looking at the slides. I think I’ll give you one comment, Bryan, when we were looking at kind of the year-on-year comparisons, I think we were actually favorably impacted last year on W-2 revenue. If you think about W-2 revenue, it’s kind of based on a number of employees by employers. So for example, if they work one day or if they worked the entire year, it’s the same – you still need to get provided W-2 to that employee. Pat, I don’t know if you have any other thoughts on that. I think normalized that at the first quarter, we’re going to be in single digits and then moving to the fourth quarter double digits. So I think as we move through these quarters, you’ll see that incrementally go up. I think the program’s going to be available for five years, right. I think that back half of this year and then in the four years, but it’s still a product that can be sold if the customer hasn’t already made a filing yet. And as far as sales bookings, it’s probably started to trail a bit. It will still continue, like John mentioned, and then from delivery of that, we’ve done real good delivery here in the third, fourth quarter, and the first quarter. You’ve got the two most recent deals kind of integrated and given the volatility in the markets, I think it’d be helpful to give up investors an update on what you’re thinking there. Yes, really I’m pointing towards the second half of 2022 and really 2023. I don’t think you’ll see anything imminent, Josh. So nothing imminent, but we’re going to continue to be opportunistic. I think people are looking whether you’re a bank credit union, retail shop or restaurant, you’re looking for help. I think for the Ukraine war and others in the news, our folks feel inflation a bit, but also really want to be active in upgrading to a digital presence or getting more customers or serving customers and we want to help them do that. So we think we’re in a competitive environment, whether it’s an ADP master tax or a Ceridian standalone tax environment. On human management consulting, we’ve sold more in the first quarter than we did all of last year. And in small business services, we’re going out and competing very, very effectively. And as we continue to get more sales people, I think our average tenure actually went down a month, because we’re bringing new sales people on. So we’re continuing to add and then we’re adding, because we think we can compete effectively. As far as the reseller network, I would say, there’s been a pretty good pipeline. And it is critical to our success, because we believe that as our partner network wants to have more and more solutions available with our microservices technology, we’re able to spin those up faster and we think that will garner more customers down the road. It’s a great question, Eric. From our perspective, it’s – we’ve been building this for three, four years and it’s – we’ve done some foundational work. So for me, it’s just an evolution upon attended of the timeline and some of the work we’ve done over the last couple years. And then just one more, if I could, for John, based on the full year adjusted EBITDA outlook of $8.5 million to $10 million. I think if you look at that GAAP to non-GAAP reconciliation, I mean, the biggest adjustments can’t really see them on that reconciliation, but the ones that kind of issue would be interest. And then there’s a little bit of arbitrage between commissions and software capitalization, those are probably the three major items. You can strip those out of the actual GAAP cash flow, but those would be the kind of three, I think, key drivers in terms of free cash flow versus what you see in the kind of non-GAAP EBITDA. With respect to your two most recent acquisitions, we’ve typically seen them be dilutive upfront and then over time cut costs, but they came in essentially accretive when they were. There’ll be a little bit more to come out, but I think good hit on a key point. If they’re re-papered, we didn’t bring on a lot of extra bank accounts as we did with past acquisitions, the employees came across onto our federal ID. They become a lot more creative, a lot sooner, but there’s still going to be cost to rationalize out as we get more of our processes in place. I think it’ll be gradual over time, but we’ve gotten a lot of synergies out a lot quicker than in the past. There might be some kind of near-term hits where to bill, they’ll pass on a cost to us. So that’s on us to try to figure out you hit on a key point about float, we’re in the process. We’re sitting on an average $200 million at any point in time and we can put that money to work and as the rates go up, obviously that, that adds to the top line for us. So I think we’ve not played out a ton of that in to our model, we’ve got some rating uses in the back after year if Fed’s going to come in, but we don’t get to necessarily take all that immediately. So that’ll – that’s the benefit of the rating for us, but again, we have some wage pressures potentially on our cost pressure. Pat, I don’t know if you have any other thoughts. No, just I think we’ve modeled in some of the moves that we anticipate from the Fed. And maybe contrast that part with pricing power, you’ve got a lot of experience going back a long time in the payroll space. I don’t think I’ve ever gotten a letter saying Pat, great job on those taxes, right. We do think we’ll get some benefit as interest rates go up and more importantly, as we’re providing value to our clients and services. First on sales head count, I think you finished last quarter with 75 targeting 90 by year-end. As far as the process for us it’s quality, not quantity. And I would say the 42% increase year-over-year, we think we got a shot to beat that in second and third quarter. So we’ve done a good job of I think getting the right talent, investing in the right tools for them to be successful and giving them an opportunity to do really, really well. We want to hire more in the future and it’ll be a game of hiring more, but also really more important in that hiring the right people and want to see us get to 90 by the end of the year. Well, I highlighted HR consulting services and where we’re really having some good success and we sold more in the first quarter than we sold all of last year. I think we need to provide a little bit more data in cross sell as the year goes on, but HR consulting, tax filing as well as money movement, tend to be kind of the products and services that we lead with naturally time and attendance and ERTC, which we’ve highlighted over the last year. And then – and in our investor deck, there’s kind of a walk up to over $40 per employee per month on the cross selling."
}