{
    "symbol": "USIO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 15:32:09",
    "content": " Forward-looking statements, by their nature, involve estimates, projections, goals, forecasts and assumptions and are subject to risks and uncertainties that could cause actual results or outcomes to differ materially from those expressed in the forward-looking statements, including risks related to the COVID-19 pandemic and its effect on the economy; the realization and the opportunities from the IMS acquisition; management of the company's growth; the loss of key resellers; the relationships with the automated clearinghouse network, bank sponsors, third-party card processing providers and merchants; the volatility of stock price; the loss of key personnel; growing competition in the electronic commerce market; the security of the company's software, hardware and information; compliance with federal -- complex federal, state and local laws and regulations; and other risks detailed in the company's filings with the SEC. As a result, total dollars processed in the first quarter were $2.2 billion, up 18% compared to the same period last year, while total transactions were 10.5 million. Consequently, we are reiterating our guidance and expect strong 18% to 20% revenue growth in 2022 while also anticipating continued positive adjusted operating cash flows; and we are also reiterating our expectation of positive adjusted EBITDA for this year, with adjusted EBITDA significantly improving in subsequent quarters from the first quarter when we made significant investments in the business to accommodate future growth. Total dollars processed exceeded $325 million in the quarter, which puts us well in front of last year's pace of finishing with over $1 billion in volume processed. More importantly, total dollars loaded on prepaid cards in the quarter, which is a leading indicator of future revenues, exceeded $69 million, an all-time quarterly record. As I mentioned earlier, prepaid recognized $650,000 of revenue from the first Voyager Digital prepaid plastic preorder for cards and similarly recognized significant spoilage and breakage revenue on the completed program, although below normal margins. The prepaid business had another great quarter, with revenues up 212% to $2.8 million, driven by a 270% increase in card transactions processed, 134% increase in load volume and 139% increase in purchased dollars processed. Total dollars loaded on prepaid cards in the quarter exceeded $69 million, an all-time quarterly record and a sequential increase from last quarter's $65 million. In the first quarter, as Louis mentioned, we produced about $650,000 for the physical cards for our digital fulfillment and expanded -- and we've also expanded our customer service centers. As mentioned, revenues for the quarter ended March 31, 2022, were $18.1 million, up 35% compared to the $13.5 million in the same period last year. Revenues from our Output Solutions business line was $4.7 million, up 25% from the $3.8 million a year ago, as we are lapping full quarter contribution from Output Solutions, this was all organic growth. Prepaid keeps rolling along and had another outstanding quarter with revenues up 212% to $2.8 million, driven by a 270% increase in card transactions processed, 134% increase in load volume and 139% increase in prepaid card purchased dollars processed. And again, part of that is getting ready for continued growth, but the other part of that was servicing a card program where we're going to end up seeing about 70% of the revenue from that card program, maybe even more than that, on the back end in the form of this breakage and an activity piece that's going to really get started in August."
}