{
    "symbol": "RFIL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-14 19:43:06",
    "content": " Sales for the quarter were a record $23.8 million, up 11% sequentially from Q2 and up 56% over the third quarter last year. As we announced, when we closed the deal, Microlab sales in the previous 12 months prior to the acquisition were roughly $17 million, and we just delivered sales of $6.5 million in Microlab products in the third quarter alone. As we discussed last quarter, weâ\u0080\u0099ve also introduced an innovative next generation small cell concealment solution called TruField that expands our market opportunity with a proprietary new product we can sell to our growing customer base in the wireless carrier ecosystem to meet the growing demands for densification of 4G and 5G networks. Weâ\u0080\u0099re obviously pleased that in the third quarter, we reached our internal target of getting our gross margins above 30% and believe we have the ability to grow margins further going forward as we add higher margin revenue from some of our bigger ticket products in addition to the Microlab offering. Sales in the third quarter were a record $28.3 million, (sic)  up 11% sequentially from the second quarter and up 56% from the third quarter last year. Our improved gross margins for the third quarter reflect improvement in our core business, along with the full quarter of higher revenue -- of higher margin revenue contribution from Microlab, which contributed $6.5 million in sales in Q3. The increase in inventory supports our value proposition of availability, but also is in line with our Q3 sales growth of 56% over the third quarter last year or 14% excluding Microlab. We expect full-year net sales of between $83 million to $85 million, which would represent growth of at least 45% year-over-year, which includes eight months of Microlab revenue this fiscal year. Additionally, we expect gross margin improvement for the full-year as we continue to drive margin improvement opportunities and a better product mix as we expect growth in our adjusted EBITDA as our profitability continues to improve throughout the remainder of the year with the goal of getting to 10% of sales dropping through to adjusted EBITDA. Weâ\u0080\u0099re able to predict it a lot better when youâ\u0080\u0099re putting up -- Peter mentioned in his comments, when the sales numbers move between the low-20s or high-teens, and then $12 million or $15 million, itâ\u0080\u0099s really difficult for us to get that number nailed, because weâ\u0080\u0099ve got to absorb the labor that we have building a lot of this stuff."
}