{
    "symbol": "AORT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 03:10:09",
    "content": " Starting with our stent graft offerings; revenue in the first quarter increased 34% on a constant currency basis compared to the first quarter of last year, building on our performance in Q4, where we posted 33% year-over-year growth in stent grafts. For On-X, we posted 11% constant currency revenue growth in the first quarter of ‘22 compared to the first quarter of last year, in the fourth quarter of 2021, where we posted 13% year-over-year growth compared to the fourth quarter of 2020. Moving on to our next initiative, international expansion in Asia-Pacific and Latin America through new regulatory approvals and commercial footprint expansion; I am pleased to report that we are executing very well on the strategy as demonstrated by first quarter constant currency revenue growth of 39% in Asia-Pacific and 93% in Latin America. Total revenues were $77.2 million for the first quarter, up 8.6% on a GAAP basis and up 11.2% on a constant currency basis, both compared to Q1 of 2021. On a year-over-year basis, in the first quarter of 2022 aortic stent grafts revenues increased 26%, reflecting increased procedure volumes and revenues from our new product launches. On-X revenues increased 10% and tissue processing revenues increased 11%, reflecting improving procedure volumes relative to the first quarter of 2021. On a constant currency basis compared to the first quarter of 2021, aortic stent graft revenues increased to 34%. Excluding non-recurring acquisition-related and business development benefit of $1.6 million in 2022, which primarily consists of a non-cash $1.8 million benefit related to fair value adjustments for Ascyrus contingent consideration and rebranding charges of $883,000 and then excluding non-recurring acquisition and business development charges of $1.5 million in 2021, G&A expenses were $39.7 million for the first quarter of ‘22 compared to $37.2 million in the first quarter of ‘21. If revenues are affected by $3 million, constant currency growth in the second quarter will be in the range of 4% to 6%. Despite the delays in Q2 and a similar $3 million headwind – potential headwind in Q3, we still expect full year constant currency revenue growth in the range of between 9% and 11%. First, we saw a 34% constant currency growth in our aortic stent graft portfolio and 11% growth in our On-X and tissue processing portfolios. But clearly, we expected to see faster growth outside the U.S. We didn’t expect to see the U.S. being off like they were, but we also didn’t know Omicron was going to be as virulent – from a staffing standpoint was going to have such a big impact in the first half of the quarter."
}