{
    "symbol": "AORT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 17:02:07",
    "content": " More specifically, on a constant currency basis compared to Q3 of '22 versus Q3 of 2021, On-X grew 19%, tissue processing grew 13%, BioGlue grew 9% and stent grafts grew 7%. For the first nine months of the year, on a constant currency basis, stent grafts were up 22%, On-X is up 14%, tissue processing is up 10% and BioGlue is down 4%, all compared to the first nine months of last year. If customers had not made these increased BioGlue purchase in Q3, our total revenue growth in the third quarter and the first nine months of the year would have been 10%, both on a constant currency basis compared to the prior year. As mentioned previously, On-X revenues grew 19% on a constant currency basis in the third quarter of 2022 compared to the third quarter of last year, driven by strength in the U.S. where revenues grew 21% compared to last year. For stent grafts, revenue in the third quarter increased 7% on a constant currency basis compared to the third quarter of last year. Even though our year-over-year growth in stent graft revenue was down sequentially compared to the second quarter, year-to-date growth through the end of the third quarter stands at 22% on a constant currency basis. I'm pleased to report that we're continuing to execute very well on this strategy, as demonstrated by the third quarter constant currency revenue growth of 25% and 22% in Asia Pacific and Latin America respectively. Total revenues were $76.8 million for the third quarter, up 6% on a GAAP basis and up 11% on a constant currency basis, both compared to Q3 of 2021. On a year-over-year basis, in the third quarter of 2022, On-X revenues increased 17%, tissue processing revenues increased 13% and BioGlue revenues increased 5%, aortic stent graft revenues decreased 6% due to currency headwinds. On a constant currency basis compared to the third quarter of '21, On-X revenues increased 19%, tissue processing revenues increased 13%, BioGlue revenues increased 9% and aortic stent graft revenues increased 7%. On a regional basis, third quarter 2022 revenues in Asia Pacific increased 24%, Latin America increased 20%, North America increased 12% and Europe decreased to 8%, all compared to the third quarter of '21. On a constant currency basis, revenues in Asia increased 25%, Latin America increased 22%, North America increased 13% and Europe increased 5%, all compared to the third quarter of 2021. And for the fourth quarter alone, we faced approximately $4 million in currency headwinds compared to the fourth quarter of last year, putting our prior year constant currency revenue comparator at approximately $75 million. With that in mind, our slightly narrowed full year constant currency growth guidance of between 9% and 10% implies full year revenues in the range of $313 million to $316 million. In the next three years, we expect revenue to grow double-digits to approximately $400 million and to generate $75 million to $80 million in adjusted EBITDA as well as reducing our net leverage to less than 3x, even despite the headwinds we faced from inflation and its impact on gross margins. I mean -- so I realize that the trial got  in the third quarter, but we did post 19% revenue growth with the On-X valve in the quarter and 21% growth in the U.S. Yeah, the anecdotal comments have been actually -- I talked to a lot of surgeons that were in the trial and I've heard words like you guys were bold to do this trial. And we said in our three year plan, as we accelerate our EBITDA and drive our top-line growth even in these inflationary headwinds, we're expecting our EBITDA to get up to $75 million to $80 million in '24, which at that rate, we're going to have a less than 3x net leverage."
}