{
    "symbol": "ZETA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 20:41:09",
    "content": " Any way you slice it, be it revenue, scaled customer count, margin expansion, adjusted EBITDA or even cash generation, we're pacing ahead of our Zeta 2025 long-term plan of greater than $1 billion in revenue and at least 20% adjusted EBITDA margins. And finally, with these factors in mind, we're announcing a $50 million share repurchase program, believing that in addition to investing for profitable growth, repurchasing Zeta shares at current price levels is the next best investment of the company's capital. In terms of second quarter results, we generated $137 million of revenue, up 28% year-to-year, up 9% quarter-to-quarter and 6% better than the midpoint of our guidance, a very strong wrap around on last year's second quarter growth rate of 39%. Direct revenue mix, which represents our customers' reliance on Zeta's marketing platform and digital channels once again exceeded 80%, resulting in a 290 basis points year-over-year improvement in our cost of revenue percentage to 36.6% or 390 basis points improvement, excluding stock-based compensation to 35.3%. Which brings me to my third point, our pacing to the Zeta 2025 long-term plan.With very strong first half results, including 26% revenue growth and 250 basis points of adjusted EBITDA margin expansion, we're pacing ahead of our Zeta 2025 targets of at least $1 billion in revenue and at least 20% adjusted EBITDA margin. But what we've also seen is we've seen even in the parts of our business that are focused on marketing, we're seeing them grow at a faster pace than even other parts of our business, because as marketers are looking for that marketing efficiency, they're just not finding it in other vendors. In terms of how the outlook and guidance is built, it's built the same way that we've done over the last now four quarters as a public company where we've built a track record of beating and raising on the top and the bottom line, bottoms up by scaled customer with, as David mentioned, very little yield required from incremental new business at current levels. But as other organizations have been based on that, I think it's going to help them the longer it pushes out without getting rid of it, but it necessarily -- it does not necessarily hurt us because what we're seeing is, first of all, our ability to operate in places like Safari today, which have not had third-party cookies for many years is already a major competitive advantage for us."
}