{
    "symbol": "ZETA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 22:37:14",
    "content": " In fact, year-to-date, we've added three times more scaled customers versus a year ago, tasting twice as fast as our Zeta 2025 model of 6% scaled customer count growth year-to-year. This leaves third quarter integrated platform revenue mix of 26%, higher than a year ago of 19% due to channel mix and political candidate revenue, which was $3 million in the quarter and $2 million better than what we assumed in our third quarter guidance. For the fourth quarter of 2022, we're increasing the midpoint of revenue guidance by $2 million to $160 million, up 19% year-to-year. We're increasing our fourth quarter adjusted EBITDA by $300,000 to $29.5 million, up 29% year-to-year and representing 18.4% margin at the midpoint of guidance. Combination of our third quarter upside and higher fourth quarter outlook raises the midpoint of our full year 2022 revenue guidance by $13 million to $576 million, representing 26% growth year-to-year. On an adjusted EBITDA basis, we're increasing the midpoint of our full year 2022 guidance to $89.3 million, up 41% year-to-year. And one of the reasons we were able to win so many of these clients was our sales motion starts with a pilot that starts with a $50,000 or $100,000 test where we're testing in the market where we take their data, we put it into a CDP, we match it to our data ecosystem, and we're able to really rearchitect the journey that every one of their existing high-quality customers followed before becoming one of their customers. And you're right, in terms of the super scaled customers, they have a higher net revenue retention rate than those that are $100,000 to $1 million, which makes them very sticky, easier to predict and rely upon, but also there's a 10x difference in the ARPU for greater than $1 million customer versus $100,000 to $1 million. It's frankly, if you â\u0080\u0093 when working with my team on the planning side, it's one of the fastest models they're able to pull together, because there are so many customers, with so much predictable replenishment â\u0080\u0093 and for many of our contracts, as we've said, are getting longer in duration, has only added to our ability to predict it, forecast it and rely on it as a solid revenue stream."
}