{
    "symbol": "ZETA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 14:00:26",
    "content": " When we take into consideration the platform mix of our sales pipeline opportunities and what we expect from mid-term political contribution in the second half of the year, which as a reminder, has a lower margin profile than the platform average, we're improving our guidance to lower our cost of revenue by 200 basis points for the full year of 2022, a testament to the trajectory we already see our business headed to start the year. We're seeing good progress in all three areas which continues to power our growth and is the fuel for Zeta's 2025 KPIs of scaled customer count, ARPU expansion, mix shift, and net revenue retention. And we're seeing budgets that have been traditionally going to linear, moving to the Zeta Marketing Platform, at an accelerated pace, and I think that's a trend that we can expect to continue. A lot of it is not just the architecture of the CDP software, which is we believe superior to anybody else's, but the ability to do it with the data cloud changes the narrative when we're talking to customers and they're seeing the type of data elements that are coming in. The really exciting thing about that is once they start using the blended data, and we're matching it greater than 80% of our data cloud to the average customer's first-party data, as we scale what we're seeing is they're coming up with incredible audiences that they want to target, inside of the data cloud. So not only did we make the decision to pull forward some of our hiring, because we saw we had so much incremental margin being 81% on platform versus the 75% that I think a lot of people expected it allowed us to bring in the people that we needed to handle all of the RFP velocity that we're seeing. One new function that we've added that should help us continue to not just add new scaled customers but to graduate those from the $100000 to $1 million to superscaled is the combination of what is we believe we're building a world-class demand generation engine, married with an SDR function that just should make those quota carriers more productive. So we don't want to get ahead of ourselves, but it's certainly designed for why we're adding sales headcount and why we believe in the Zeta 2025 should be at least a $1 billion number and not just sitting at the $1 billion. So, as I think I've said a few times, we truly feel that the current environment where we're seeing greater inflation, we're seeing the very large tech companies sort of battling it out and we're seeing the worry of slowdown is driving customers to use our platform at an accelerated pace, because they're looking at the efficiency and the efficacy of that platform that includes our programmatic platform, which is heavily focused on deterministic targeting. I also think it's really important to note, because this is one of the things that I get ah-ha moment, when I say to somebody, looking at the story DJ, not one of the 5.2 million publishers who use our platform makes up even one-tenth of 1% of the traffic that is driven to the Zeta data cloud."
}