{
    "symbol": "CUZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 16:34:02",
    "content": "  Operator: Good morning, and welcome to the Cousins Properties Third Quarter 2022 Earnings Conference Call. Good morning, and welcome to Cousins Properties third quarter earnings conference call. If you did not receive a copy, these documents are available through the quarterly disclosures and supplemental SEC information links on the Investor Relations page of our website, cousins.com. Please be aware that certain matters discussed today may constitute forward-looking statements within the meaning of federal securities laws, and actual results may differ materially from these statements due to a variety of risks and uncertainties and other factors, including the risk factors set forth in our annual report on Form 10-K and our other SEC filings. The company does not undertake any duty to update any forward-looking statements, whether as a result of new information, future events or otherwise. On the earnings front, the team delivered $0.69 per share in FFO and same property net operating income increased 1.5% on a cash basis. Importantly, we leased 431,000 square feet during the quarter, with a 4.8% cash rent roll up, and 7.3% excluding our non-core asset in Houston. Additionally, we sold our 50% interest in Carolina Square, a mixed-use property in Chapel Hill, North Carolina for $105 million, recognizing a gain of $56.3 million. Despite the current inflationary environment, the Federal Reserve and other central banks around the world have rapidly raised interest rates to slow economic growth. Within our portfolio, we have properties with a physical occupancy well above 70% effectively pre-COVID levels. During the same period, properties built in the 1980s recorded 89 million square feet of negative net absorption. We sold $1.2 billion of less relevant properties and reinvested the proceeds into the development and acquisition of the RailYard in Charlotte, 300 Colorado and Domain 9 in Austin, Neuhoff in Nashville, 725 Thompson Atlanta and Heights Union in Tampa. Looking forward, market and financial conditions will likely become more challenging. First, we own the leading Sunbelt portfolio of premier workplaces in the best submarkets in Atlanta, Austin, Charlotte, Tampa, Phoenix, Dallas and Nashville. With a third of our properties less than five years old or recently redeveloped, we believe that we will get more than our fair share of leasing demand, as we benefit from both Sunbelt migration and the flight to quality trends. Looking at our 2022 renewals through the third quarter, we have had more customers expand than contract. Importantly, our lease expirations through 2024 total just 12% of our annual contractual rent, among the lowest in the office sector and this positions us favorably to grow occupancy over time. Next, our $569 million development pipeline, with the office component approximately 70% preleased is appropriately sized and positioned for the current climate. Our net debt to EBITDA at the end of the third quarter was 4.75 times, this compares to the Green Street sector average of 7.9 times. After quarter end, we closed a $400 million term loan and had locked rate on a $221 million mortgage at our Terminus property in Atlanta. Upon closing of the Terminus mortgage, we will have no significant loan maturities into 2024 and less than $100 million outstanding on our $1 billion revolving credit facility. In closing, we are mindful of the potential impact of higher interest rates and a slowing economy on short-term results. However, over the long-term, we are optimistic that premier workplaces will separate into its own asset class with improved sentiment. Before turning the call over to Richard, I want to thank all of our employees at Cousins, who provide excellent service to our customers, as well as their skill and talent to their jobs every day. Similar to last quarter, our operations team produced solid results in the face of increasingly challenging macroeconomic conditions. For the third quarter, our total office portfolio end of period leased percentage and weighted average occupancy were 90.1% and 87.3%, respectively. We executed 48 leases in the quarter, totaling 431,000 square feet. Our third quarter activity also produced a weighted average lease term of 8.3 years, clear evidence that companies continue to make long-term commitments for office space. New and expansion leases represented 49% of total leasing activity this quarter and activity was again balanced in terms of industry representation, with customers in the legal, financial services and general professional services sectors accounting for most of our volume. With the benefit of stable concessions, I'm pleased to note that net effective rents this quarter moved higher to $24.97, a $1.47 increase relative to the first half of this year. Second-generation net rents increased 4.8% on a cash basis in the third quarter, representing lower growth than in recent quarters. You will recall that the past two quarters, I mentioned we might see increased activity in Houston. And if that completed, it would likely not screen well relative to our stronger core markets. When excluding a 25,000 square foot renewal signed in Houston, our second-generation cash rent roll-up this quarter was a stronger 7.3%. Looking forward, we remain encouraged by healthy volume in our late-stage lease pipeline, as well as the level of inquiries and activity in our early-stage pipeline. I would note, once again, however, that our pipeline still includes sizable activity in Houston, and that activity is likely to have a dampening effect on our reported leasing metrics when completed. Despite our relative optimism about the leasing pipeline, we do continue to monitor the macroeconomic landscape and acknowledge that further weakening of the economy would likely have a negative impact on our leasing activity going forward. Regardless, we continue to see the positive impact of the flight to quality trend across our Sunbelt markets, as office users gravitate toward amenity-rich submarkets and properties. For instance, in Atlanta, we are seeing a number of requirements focused on Midtown, a dynamic submarket where we have two fantastic existing projects with transformational redevelopments either at or near completion. Our Buckhead portfolio continues to perform nicely as well, with 53% of our 144,000 square feet of Atlanta leasing activity this quarter, taking place in this in-town submarket. We signed an impressive 98,000 square feet of leases in our high-quality Tampa portfolio this quarter, of which, 55% were new and expansion leases. Similarly, in Phoenix, many companies are choosing to move into higher quality, amenitized space in order to attract new talent and entice existing employees back to the office. We've seen the Class A properties made up 67% of total leasing volume in Phoenix this quarter, also according to JLL. We signed 40,000 square feet of leases this quarter in Phoenix, with an average cash rent roll-up of 19.6%. Now I want to briefly highlight the strength of our portfolio in Austin, where we signed 79,000 square feet of leases this quarter, including two new leases for the last two floors of direct vacancy on our recently developed 300 Colorado building in the central business district. Our Austin portfolio produced 31.7% of our total net operating income in the third quarter, and it includes 4.6 million square feet in three distinct submarkets. Remarkably, the entirety of our 2.1 million square feet at the domain and domain point are currently 100% leased. Similar to the Austin market as a whole, we do have outsized exposure to the technology sector, which has clearly been an important driver of demand in Austin in the past. I would note that approximately 75% of our technology sector exposure in Austin is with high-quality, publicly traded large-cap technology companies. On top of all of that, only 8.9% of annual contractual rent in our Austin portfolio expires during 2023 and 2024. Looking ahead, many of the compelling dynamics within our Austin portfolio are also present in our entire operating portfolio. At 135,000 square feet and in the fourth quarter, and we are very encouraged about the status of that renewal. Further, the average size of our expiring customers in 2023 is approximately 11,000 square feet and the weighted average expiration date is in the third quarter. Last, we currently have 890,000 square feet of new and expansion leases that are signed, but not yet commenced. We recognize the economic climate to remain complex for the foreseeable future, yet we continue to see firsthand that companies are seeking high-quality office space in our markets. Cousins is incredibly well positioned for any opportunities ahead with a stable, high-quality portfolio in the best Sunbelt markets. Then I'll move on to our transaction activity, our capital markets activity and our development pipeline, followed by a quick discussion of our balance sheet before closing my remarks with updated information on our outlook for 2022. Overall, as Colin stated upfront, third quarter numbers remain very solid despite the ongoing economic volatility and uncertainty. Focusing on same property performance, cash net operating income during the third quarter increased to 1.5%, compared to last year. This is an improvement from the first two quarters of the year, which were essentially flat with the increase largely driven by Amazon's lease commencement on July 1st for our entire Domain 2 property in Austin. As Colin mentioned earlier, fiscal occupancy at our properties has continued to increase, and our parking revenues have grown along with it. During the third quarter, we sold our 50% interest in Carolina Square to our joint venture partner for $105 million, generating a gain on sale of just over $56 million. It was a non-core asset from the start, and we believe this was an opportune time to sell our interest, largely driven by our recent refinancing of the property with very attractive debt that was assumable at no cost by our partner. On the capital markets front, we were very busy and productive both during the third quarter and subsequent to quarter end. This change allowed us to efficiently execute a floating to fixed interest rate swap, whereby we fix the underlying SOFR rate at 4.23% through maturity. Next, we closed on a new $400 million term loan with our existing bank syndicate that matures in March 2025 and includes 4 month to 6 month extensions. Finally, we initiated the process of extending the existing mortgages on our two terminus properties here in Atlanta with the current lender. Maturities will be extended from January 23 to January 31, and combined principal will increase to $221 million, and the interest rate has been locked at 6.34%. And today, the rate on this date -- excuse me, the rate on this debt would be in the upper 6%. First, to refinance the $331 million in mortgages that were maturing during the fourth quarter of this year and the first quarter of next year. And third, to create additional liquidity to take advantage of the potential investment opportunities created by the current dislocation in the commercial real estate debt markets. Overall mission accomplished, the mortgages were taken care of, floating rate debt is back to approximately 20% of total debt, and we have almost $1 billion in dry powder. Focusing on floating rate debt for a moment, we believe floating rate debt around 20% of total debt provides us with valuable flexibility as we recycle properties, which we have aggressively done over the past few years. Right now, we only have three pieces of floating rate debt on our total capital stack; our credit facility, our new term loan and our new health construction loan. Looking forward, we only have about 1% of total debt maturing in 2023. Our remaining funding commitment for this pipeline is just under $200 million, which is more than covered by construction financing, the liquidity I just referenced and future retained earnings. Looking at our balance sheet, we continue to reduce leverage during the third quarter. As Colin stated earlier, net debt to EBITDA is now at just 4.75 times. We currently anticipate full year 2022 FFO between $2.69 a share and $2.73 a share, with a midpoint of $2.71 per share. This increase is driven by stronger-than-anticipated property NOI, partially offset by continued increases in interest rates. Focusing on interest rates, as we have discussed on previous earnings calls, we use the forward LIBOR and SOFR curves to forecast short-term rates and the forward 10-year treasury curve, plus current credit spreads to forecast long-term rates. Looking forward, our debt schedule is very simple and clean, and we would encourage you to look at the forward curves and credit spreads, as you update your 2023 earnings model for us. And as I mentioned earlier, we have prioritized the balance sheet over new investments year-to-date in anticipation more attractive opportunities and better pricing. As we do look forward, we do think that there will be some opportunities as we move into 2023. And for us, those opportunities and our approach are always going to be singularly focused on high-quality product, premier workplaces that we think are going to continue to attract the best and brightest and growing companies. In terms of how that plays out, the current liquidity environment and higher rates continue, I think that's going to continue to apply pressure to some folks that have more leverage than perhaps they should. And I think we'll likely focus on again, high-quality trophy product that perhaps has broken capital structures. And so, I think like in cycles past, we'll look at this environment, our low leverage and our liquidity and try to take advantage of opportunities that could range anything from asset level opportunities to corporate opportunities like we've done with Parkway and cure. Second question, obviously, the headlines would suggest that tech tenants are at best kind of stepping back from the leasing market and at worst giving back a lot of space, whether that be through subleases or terminations. And you're right, the technology customers have stepped back. And I think if you going to look back over the last couple of years, many of those companies, I think, staffed up and lease space in anticipation in some ways of a remote world forever. And obviously, we're now starting to see things normalize and I think that's having an impact on demand for product in the tech space. And at the same time, the change in the interest rate environment and the lack of capital to continue to fund this business, you're seeing some of them step back really driven by the capital markets. And so, as we look forward, we are seeing now that the banking and finance and legal and other sectors going to fill that void left by the tech customers, who will ultimately rightsize their businesses and be back. As it relates to us in terms of exposure, as Richard laid out in his remarks, the -- over 75% of our technology exposure is with large, well-capitalized publicly traded companies. And so, if they were to get back space, I think we look at that as an opportunity in sublease space. Colin, last quarter, you talked about potential share repurchases, given where your share price was. Certainly, at current prices, it's something for us to absolutely consider. I think at the moment, we've continued to prioritize liquidity, low leverage and the optionality that we have until we've got greater clarity on what the other potential investment opportunities might be. So, maybe can you talk Richard about tours, the negotiations you're having, the lease pipeline today. If anything, on the early-stage activity on tours and just trading early-stage proposals, there's probably a little bit of incremental softness there. You guys have built a great balance sheet, and I think part of getting credit for that is using it. And so, can you talk again about maybe I know where the opportunities will end up being for you, but how you're willing to kind of use the balance sheet to take advantage of those, perhaps that's levering up, perhaps, I don't know if that's buying debt. And I think you characterized that appropriately that our balance sheet is a tremendous asset, but only if we use it. And if you look at our history, certainly over the last 10 years, we have maintained a fortress balance sheet effectively in the good times by not pursuing investments when a lot of our competitors have capital, but being patient and really deploying a lot of capital and using additional leverage in periods of time when others don't have a lot of capital. And again, if we're able to identify attractive opportunities to create value for shareholders to add high-quality premier properties to the portfolio, we're ready, willing and able to seize on those opportunities. And as in the past, if the opportunity is there, we would perhaps take our leverage up a bit and have demonstrated our ability to do that in the past and then it brought leverage back down. Well, I'd say as we look forward over the next year, the investment opportunity plays out like we think it might. I think, the probability of our leverage going up is higher than our leverage going down and that would be for us to take advantage of good investment opportunities, use the capital, use the balance sheet that we have. FFO was up, I think, 20% sequentially, 500 basis point occupancy decline. Clearly, with the rise in interest rates, I think clearly, that drives the bar higher as it relates to our funnel rates for new investments, whether that be an acquisition or development. And I think perhaps there will be some investment opportunities of high-quality assets that perhaps have compromised capital structures in this environment, and we'll certainly be on the lookout and searching for those opportunities. I think just the current realities of the environment with higher construction costs, higher yields and potentially higher cap rates, I think that makes the bar for new development higher. But as I said on the last quarter call, I think you're going to see some of that normalized over the coming year, and I do believe development in the not too distant future will again be a very viable opportunity. And I think that's going to create really interesting opportunities for some of our fantastic development sites in the south end of Charlotte, or Midtown Atlanta or out in the Domain in Austin. And so, we'll look at all the opportunities, and we'll deploy it when we think it's the right risk-adjusted return for shareholders. So I think what you're alluding to is, if you take the midpoint of our full year '22 guidance and you subtract the first nine month actual performance, it solves for a number of net the phone number in the fourth quarter that's below we just reported in the third quarter. First, we recognized the last of our $50-plus million in development fees from Norfolk Southern here in Atlanta during the third quarter. So we recognized about $1 million of fees during the third quarter, recognized about $3 million, $3.5 million in fees for all of '22 in the first nine months, that's done now. And the second piece of that would be interest rates, which you've heard on pretty much every call, I'm sure that you've been participating in. Just as one example, I mean, the average SOFR rate during the third quarter of this year was just over 2%. Using the current forward curve, the average SOFR rate during the fourth quarter this year will be just over 4%, that's a dramatic difference. And so, as we push that through our P&L, just like a lot of our peers, that has a negative impact on fourth quarter interest expense versus third quarter and then obviously beyond into '23. So if you take a look at kind of the fourth quarter and you say, well, is that a good run rate going forward into '23, now a little premature in guidance from us. That being said, the fourth quarter will be a much better indicator of kind of future run rate than the third quarter was for the two items that I just described. I think, we're seeing plenty of expansion, as Colin has mentioned in our portfolio when we have customers that have renewed in the recent past, and that's fairly diversified. As I mentioned in my prepared remarks, the investment sales market has, I'd say, dramatically slowed as a widening gap in the bid-ask spread between buyers and sellers. As I think everyone looks for visibility on the terminal rate with interest rates in the Fed and so, at the moment, I'd say, it's relatively -- that market is relatively slow. I would anticipate as we move into next year and there's more clarity, that will likely accelerate. I think, fortunately for Cousins as we've laid out, we have an exceptionally strong balance sheet. And with the sale of Carolina Square, we really have no need at the moment to pursue additional dispositions until we feel like there's appropriate pricing. So we'll continue to evaluate it, I think, more in the sense of us as a buyer versus a seller. It looks like 107,000 square feet was given back this quarter. Given the elevated availability rates in the central perimeter of Atlanta and these assets being not too far away from where Home Depot is subleasing 600,000 square feet. But it's a terrific property with  on site, and it has been a really attractive destination for large Fortune 500 companies. But I'd just highlight in kind of a recent, I think, good example of perhaps a normalization taking place in the market, there was a large Fortune 500 company in Atlanta that put a significant amount of space on the sublease market just this past summer. And interestingly enough, last week, that space was quietly pulled back off the market as that customer kind of reevaluate their view and approach to work. But interest rates remain a headwind for not just us, but for all office owners and for all real estate owners. And so, as we enter '23, it's going to be something that everybody is dealing with, and it will certainly reduce pretty much everybody's earnings growth. Even if they don't have any floating rate debt, if they've got any fixed rate debt that's maturing and you've got to roll it over and fixed rate debt has gone up as well. So it's going to prove to be a headwind for everybody in the industry, including us. I think, what -- I guess, what surprised people and a few other peers that have pointed to '23 guidance or at least alluded to it, like, new development opportunities being financed with floating rate debt or other debt all adds to -- the occupancy remaining flattish all adds to it. And I think, yes, that's what I quickly ran through the curve and the higher expense and it seemed that way, but yes, I will wait for you to give those numbers. I guess, just it would be helpful if you can guide us to or even put some guardrails around the trajectory of rent spreads, given what we've seen in the last, say, five quarters, where rent spreads have gone and the lease rate has gone. And again, I think that within our markets and within truly buildings that represent premier workplaces, we continue to see demand. And so thus far, we've seen rents kind of continue to hold. And as we look forward to coming quarters, we're hopeful that we'll continue to drive positive cash rent roll-ups. I'd add the only caveat to that is, as Richard mentioned, we are seeing increased activity from energy companies in Houston. And the market dynamics in Houston are much different than all of our other markets, and that could certainly weigh on those statistics. That being said, large leases in Houston with in our portfolio, that's a terrific outcome. But with specific to our core markets, even as the market kind of retrenches and there are some recessionary forces, I do think it's important to remind everyone that some of the silver linings within the office space. And as the technology companies perhaps are less active, we are seeing these other segments in the economy, the banks, financial services, law firms, et cetera, continue to pursue more space. And so, we do think there's some pent-up demand that can perhaps provide a buffer to some of the overall macro headwinds that the entire sector is going to face. As you provide guidance, it would be helpful just to provide more guardrails around the lease rate, occupancy, same-store NOI, that just given all this uncertainty in the rate environment, it would be helpful if you can consider providing some of that. Just last question, I guess, you referenced the balance sheet a lot, utilizing that as opportunities may arise. But I'm wondering, ultimately, like at the bottom of the cycle, the basis is going to be really important in terms of where you invest on a per foot basis. Vikram, I think it's going to be, for us, specifically, it's going to be when we start to see higher quality properties become available. But I think, we're going to continue to be patient and thoughtful and wait for high-quality opportunities. However, we get there, again, whether that's an asset-level transaction, a corporate-level transaction, we'll be patient. And I think if you start to see some trades, perhaps in the lower quality space, that will start to create a market again and create a level of which other high-quality assets can trade off of. But I do think some of the looming loan expirations are coming, and it's going to force some transactions. And we would certainly consider joint ventures if there was some strategic merit to doing that venture, perhaps an entree into a specific asset. But unlike some of our peers, with our leverage at 4.75 times, we do have very significant capacity for willing -- again, for the right opportunity to incrementally move leverage higher. It's a big market, and it seems like there's more financial firms and other firms moving to the market. I think certainly, in the last couple of years, as you alluded to, you're seeing more interest from financial services and asset management firms, look to South Florida as they, like a lot of other industries, including technology, more broadly distribute their workforces across the country. And so, that dynamic continues to play out and that market matures, and you start to see kind of a larger average customer in South Florida. That's certainly a market that, again, we'll continue to evaluate. And so, I think it's a likely probability that we deploy capital within our existing markets versus pursue expansions in the current environment. But over time, we'll continue to look at markets like that and others, and perhaps we'll expand in the future. I by kind of definition, I think non-core for us means to sell at the appropriate time. We do think there's some incremental leasing opportunities in the meantime that we can do that perhaps will drive value and in the future, I think is Houston, again, normalizes as an economy. I think, the ones that come to mind where we've seen an ability to push rents consistently, not just this quarter, but over the last few quarters or a year plus, I alluded to Phoenix. We've seen on this quarter, 19.6% roll up on the leasing activity that we did there. Heights Union, we acquired essentially fully leased, but we've been, again, successful in pushing rents more than I would have thought in Tampa. And then, we continue to see good rent growth in the properties where we've reinvested like Buckhead Plaza here in Atlanta, but also in Midtown. So, and then, of course, I have to mention really where we've had just continued success over many years is Austin. So, a little bit everywhere and it's certainly submarket specific, but we've felt really good about our ability to push rents across the board. I know Houston is a small portion of the overall portfolio, but I'm just curious, as you mentioned it's the connection between oil prices and potentially better office demand there. One thing I would mention is that, there are the same dynamics in Houston that we're talking about across the country about the need for creating exciting workplaces for that motivate employees who want to come back to work and have a good commute time. And so, I think if there is kind of a usable share dynamic happening in Houston, that's driving a lot of it."
}