{
    "symbol": "CUZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 08:58:06",
    "content": " Net debt to EBITDA at 5.28x, while still very well relative to our office peers, is up from last quarter, driven by a decline in EBITDA, largely attributable to Norfolk Southern’s move out from Promenade Central to the new headquarters building we developed for them a few blocks away in midtown Atlanta, as well as Expedia's move out from Domain 2 in Austin; it’s their new space at our Domain 11 property. Yeah thanks, and maybe when some of the acquisitions you know, like to talk about your markets, are you kind of happy with your current markets or would you like to expand one or two, thinking specifically about South Florida, either Miami or West Palm or markets like that where you’re seeing a lot more I guess corporate activity recently. Jamie, if you look back over kind of the last year, you know we have been able to drive top line rental rate growth, you know I’d say kind of in the mid-single digits on a percentage basis within our market, and I do think that you know while we've been able to drive top line rental rate growth, I think in some instances we've been able to compress free rent, which has helped us drive our overall net effective rents. And as I mentioned, you know we are seeing a growing percentage of the demand focused on a narrowing percentage of the inventory, you know even in places like Midtown Atlanta or here at Buckhead or downtown Austin, and so those properties at the very top are able to drive rental rate growth and those that are in the commodity and lower tier properties I think are continuing to suffer. Yeah Jamie, I think we have done a lot of the heavy lifting, particularly over the last couple of years, but certainly over the last decade we've been kind of very carefully trying to cultivate and curate this portfolio of Sun Belt trophy properties, and as we sit here today, we do believe that's largely behind us. But again, I think we feel very pleased that you know our portfolio is in great shape and you know I’d say certainly the assets for us that we look at, I mean we’re less than 10% now of the portfolio of things that would probably qualify for us as non-core. But again, in particular if you look at you know Atlanta and Austin as an example right, you’ve seen over the course of the last two years and in the middle of the pandemic major announcements from companies like Microsoft, Amazon, Google, Meta, Oracle, Tesla, etc., kind of the list goes on and on, but large national and international growing companies that are choosing the Sun Belt for their growth and their expansion. On the development side we started both of those buildings on a pretty speculative basis and as we came to an agreement with Hines, we obviously had some outside folks looking at value to determine what was you know a fair market price, and from start of that project today, kind of a life of project return it's you know over 18% on an unleveraged basis, net of the promote."
}