{
    "symbol": "APYX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 11:29:07",
    "content": " In the second quarter, total revenue decreased 8% year-over-year to $10.3 million and came in near the low end of our $10 million to $12 million range of expectations that we shared on our Q2 earnings call. The decrease in our total revenue was driven by Advanced Energy sales, which decreased 16% year-over-year to $8.4 million. The performance in our Advanced Energy business was offset partially by OEM sales, which increased 55% year-over-year to $1.9 million. As I mentioned on our earnings call in May, we estimate to have connected directly with all of our existing U.S. customers to discuss the safety, communication, and share related resources, including a letter from our Medical Advisory Board, an overview of the postmarket safety profile of our technology and a summary comparing the adverse event rates of our Advanced Energy products with other medical devices that our customers may be familiar with. In addition, we have also hosted multiple webinars for our distributors to educate them on the safety communication and its implications and keep them updated on our related interactions with the FDA and progress in securing additional 510(k) clearances for the use of our Advanced Energy products. Stepping back, as we progress through the remaining months of 2022, we believe that our two new 510(k) clearances along with the resulting updates to the FDAâ\u0080\u0099s safety communication will help to mitigate the recent business disruption that we have seen. Turning to a review of our 2022 financial guidance, which we updated in our earnings press release today for the 12 months ending December 31, 2022, we expect total revenue in the range of $51 million to $56.4 million representing growth of 5% to 16% year-over-year. In terms of our profitability guidance for fiscal year 2022, we expect net loss attributable to stockholders in the range of $20.1 million to $16.6 million compared to our prior range of $19 million to $14.7 million. Over the remaining months of 2022, Apyx Medical is focused on driving growth by engaging with and supporting our existing customers, raising awareness of the safety and effectiveness of Renuvion to facilitate its adoption in the global cosmetic surgery market and preparing to enter full commercialization for our two new clinical indications by year end."
}