{
    "symbol": "APYX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 14:21:07",
    "content": " Starting with a review of our first quarter revenue results, total revenue increased 45% year over year to $12.5 million, exceeding the expectations of $10.5 million to $12 million, which we shared in our Q4 earnings call. Our total revenue growth was primarily driven by Advanced Energy sales, which increased 41 percent year over year to $10.8 million. Loss from operations for the first quarter of 2022 increased $1.1 million, or 24% year over year, to $5.9 million. Turning to a review of our 2022 financial guidance, which we updated in our earnings press release today, for the 12 months ending December 31, 2022, we expect total revenue in the range of $52.5 million to $59 million, representing growth of 8% to 22% year over year. Our total revenue guidance range assumes Advanced Energy revenue growth of 7% to 21% year over year to $46 million to $52 million, compared to our prior range of $43.5 million to $56 million, or growth of 1% to 30% year over year, and OEM revenue growth of approximately 18% to 27% year over year to approximately $6.5 million to $7 million, unchanged compared to our prior guidance range. In terms of our profitability guidance for fiscal year 2022, we expect net loss attributable to stockholders in the range of $19 million to $14.7 million, compared to our prior range of $21.1 million to $12.1 million, and adjusted EBITDA loss in the range of $10.1 million to $6.4 million, compared to our prior range of $12.3 million to $3 million. First, gross margins of approximately 66% to 68% this year, compared to our prior expectation of approximately 62% to 67%, driven primarily by revenue mix shifts between our Advanced Energy and OEM segments and product and geographic mix within our Advanced Energy segment, inflationary headwinds in our cost of goods compared to prior year, and incremental costs related to manufacturing capacity that was previously attributable to our core segment and transition services agreement with Symmetry."
}