{
    "symbol": "BLDR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:18:03",
    "content": " SG&A grew 14.3% to $1 billion, with about half of that increase driven by two factors: additional operating expenses from locations acquired within the last 12 months; and higher wages and variable compensation costs as a result of increased net sales and profitability. We executed successfully during the third quarter as adjusted EBITDA increased 20.1% primarily driven by net sales growth, a higher mix of sales from value-added product categories and disciplined pricing. We generated robust free cash flow of approximately $1.4 billion, primarily driven by core organic sales growth, increased profitability due to effective pricing and cost management and disciplined working capital management. However, in the spirit of transparency and to give you a high-level sense of what our business is capable of, I'd like to provide you an illustrative example of single-family starts declining 20% to 800,000 next year from approximately 1 million in 2022. Our premier positioning and robust operating platform have provided us with line of sight to more than $3 billion in free cash flow this year, a fortress balance sheet with no long-term debt maturities until 2030, and over $1.3 billion of liquidity to outperform into 2023 and beyond. Certainly, it will be more challenging than it has been over the last year or two just because of the increased competition and the slower starts, but there's still reason to believe that improved discipline in the market, improved work within our organization about how we think about pricing will allow us to maintain a level north of 27%. If you're looking out to next year and anticipating some core declines in the business, while you may throw off some strong free cash flow, it seems like it's possible that leverage could keep ticking up towards the upper end of your 1x to 2x range. Peter, coming back to the example that you gave and whatever starts drop we may see next year, whether it is 10, 15, 20, whatever that number may be, but I'm just curious kind of how does that impact your base business EBITDA of $2.2 billion."
}