{
    "symbol": "PETQ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 21:16:04",
    "content": " Today, Zvi will discuss more what we're seeing in the second quarter to date in the Product segment and highlight the consistent growth trajectory of our products business in the context of our reiterated 2022 outlook and our view of our first and second half growth for the year. Focusing on our segment results in more detail, the Product segment generated a solid start to the year with year-over-year net sales growth of 18.1% on a proforma basis to $247.8 million. First quarter gross profit increased 20.6% to $57.6 million, resulting in a gross margin of 20.9%, an increase of 210 basis points from the first quarter of last year. Adjusted gross profit was $63.3 million and adjusted gross margin was 23.6% for the first quarter of 2022, representing an improvement of 270 basis points year-over-year. We achieved this expense leverage even with a planned incremental $2.8 million, or 100 basis points of expense to support the launch of our two new brands and continued marketing investments to help accelerated growth of our manufactured brands product portfolio. From a seasonality perspective, we are updating our 2022 net sales outlook to reflect the shift in timing of $5 million in orders and sales, which occurred in the first quarter of 2022 from the second quarter of 2022, and a slower than normal start in the month of April of the Flea and Tick season, causing our customers to have inflated inventory levels at the start of the second quarter. That's money that was generated out of our existing portfolio sales that in otherwise could have been brought to the profit or EBITDA line of the company to guarantee the success of those brands and it's an investment for the out years as we think those brands will perform well, become very stable in the categories and then eventually get aware there back in nine without kind of 15% marketing spend and be very accretive in out years for the company."
}