{
    "symbol": "PETQ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 22:59:02",
    "content": " When looking at our growth in all sales channels, a few of the highlights from the quarter include, pet supplement consumption increased 14% for Q4 as compared to the broader category, which was up 8% compared to the prior year period, this led to 76 basis points of share expansion. Our Services segment reported 2022 net revenue of $121.2 million, an increase of 13% as compared to the prior year and in line with our expectations. We have known the family and founders of Rocco & Roxie for years and are very impressed with our ability to build an attractive and growing pet business with $29 million in net sales for the year ended December 31, 2022. Net sales were down 6.4% compared to the fourth quarter last year, primarily due to lapping the fill orders from a successful new product launch and stronger-than-normal sales at the end of the Flea and Tick season in the fourth quarter of 2021. For 2023, we expect net sales of $970 million to $1.030 billion  This represents an increase of approximately 9% compared to 2022 based on the midpoint of the guidance. In 2023, we expect approximately 1% or a $10 million shift in net sales from the first half of the year to the back half of the year as compared to 2022. We expect adjusted EBITDA of $86 million to $92 million, an increase of approximately 15% compared to 2022 based on the midpoint of the guidance using the company's new methodology. For the first quarter of 2023, we expect net sales of $270 million to $290 million, an increase of approximately 2% compared to the prior year period based on the midpoint of the guidance. Note, as we disclosed last year, in Q1 of 2022, we had approximately $5 million of sales pulled forward into Q1 from the second quarter of 2022 to support fill orders for the start of the Flea and Tick season. For the first quarter of 2023, we expect adjusted EBITDA of $27 million to $29 million, an increase of approximately 15% compared to the prior year period based on the midpoint of the guidance using the company's new methodology. This year in 2023, based on incremental plans we're doing, what we're seeing out of the business, we think it will grow in the low double digits as well, similar to 2022, maybe a little bit less than 22% but close."
}