{
    "symbol": "PETQ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 23:04:11",
    "content": " Our Services segment reported its seventh consecutive quarter of positive adjusted EBITDA since the onset of COVID on net revenues of $33.5 million, an increase of 15.6%. Third quarter 2022 gross profit increased 20.7% to $50.8 million, resulting in a gross margin of 24.2%, an increase of 420 basis points from the third quarter of last year. Adjusted gross profit was $53 million and adjusted gross margin was 25.8% for the third quarter of 2022, representing an improvement of 290 basis points year-over-year. In the third quarter, we recorded a $47.3 million noncash goodwill impairment charge, resulting in Q3 net loss of $49.6 million compared to a net loss of $8.3 million last year. Q3 EBITDA was $12.8 million, an increase of 115.8% compared to $5.9 million in Q3 of last year. This resulted in third quarter 2022 adjusted EBITDA margins of 9.2%, an increase of 140 basis points from 7.8% in Q3 of last year. As of September 30, 2022, the company generated $64.5 million of operating cash flows and ended the quarter with total cash and cash equivalents of $56.7 million. Our working capital as of September 30, 2022, was $220.3 million, an increase of $22.6 million from the same period last year. The -- in addition to our cash on hand, the company's revolving credit limit is undrawn and has $125 million of availability together representing total liquidity, which we define as cash on hand plus availability of $181.7 million as of September 30, 2022. We expect net leverage to be under 3x by the end of 2023, closer to our stated goal of 2.5x levered -- the company repurchased 373,48 shares of its Class A common stock for a total of $3.9 million under its new $30 million share purchase -- repurchase program announced on September 6, 2022. Based on this guidance and solely for comparative purposes, we expect net sales to increase approximately 4% compared to 2021 based on the midpoint of the guidance and excluding the $36.1 million of sales in the prior year related to the lost distribution. Based on this guidance and solely for comparative purposes, we expect adjusted EBITDA to increase approximately 3.2% compared to 2021 based on the midpoint of the guidance and excluding $1.8 million of adjusted EBITDA in the prior year period related to the lost distribution. But I think as investors saw our performance through the first couple of quarters, it implied a pretty big amount of cash flow generation in Q3 and Q4 and we're pleased to announce that we had $65 million of that big hole that we accomplished in Q3. So I think if you looked at it and you were just trying to normalize inventory for where it should have been at the end of last year, inventory should have been, say, $40 million higher if we were running the number of weeks on hand that we typically target with our distribution partners with some of our internal inventory. So just bridging year-over-year versus, say, last let's say, year-end, you add $40 million. So I think if you were going to do an apples-and-apples comparison, Q4 of last year versus Q3 of this year, you would adjust Q4 up by, say, $48 million probably do the same for Q3 and I don't remember what it looked like for Q2. So I guess as we think about next year, I mean, if you hit the $30 million to $40 million free cash flow target this year, then next year, that could be a nice benefit as you won't really have this big working capital drag that's weighing on your cash generation this year."
}