{
    "symbol": "PETQ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 15:06:14",
    "content": " While net sales of $252 million were below our expectations of $260 million, we still grew consumption of our PetIQ manufactured brands, launched new products, which we strategically invested behind, and outperformed in the categories which we compete to deliver continued gross margin expansion and adjusted EBITDA in-line with our expectations of $28 million. Second quarter 2022 gross profit increased 3.9% to $62 million, resulting in gross margin of 24.6%, an increase of 260 basis points from the second quarter last year. As a percentage of sales, adjusted SG&A was 20.1%, an increase of 420 basis points, compared to the prior-year period, primarily reflecting $5.8 million of planned incremental marketing to support the launch of our two new brands and continued marketing investments to help accelerate growth of our manufactured brand product portfolio. For comparative purposes, we expect adjusted EBITDA to increase approximately 3%, compared to 2021 based on the midpoint of the guidance, excluding $1.8 million of adjusted EBITDA in the prior year period related to the lost distribution. For comparative purposes, we expect adjusted EBITDA to increase approximately 5%, compared to the third quarter of 2021 based on the midpoint of the guidance, excluding $0.2 million of adjusted EBITDA in the prior year period related to the lost distribution. Itâ\u0080\u0099s going to be a long-term battle we feel as we are out meeting with the schools and every other place to figure out how to deal with the issue we recognized for us to get back on track for what we want to build in open, we have to recruit existing vets from their existing â\u0080\u0093 where theyâ\u0080\u0099re currently working and you know that the numbers weâ\u0080\u0099ve opened, opening 10 so far was not the goal for the year by any stretch of the word, but we also are hiring and getting better labor thatâ\u0080\u0099s solving for unreliable labor or other centers that weâ\u0080\u0099re running, partial scheduled, because weâ\u0080\u0099re using temp labor. I think what has been interesting is, weâ\u0080\u0099ve seen even more on reliability and stability across our existing market, as well as whether itâ\u0080\u0099s our competition being super aggressive coming after our labor like weâ\u0080\u0099re coming after thereâ\u0080\u0099s, but if we make 15 hires, 20 hires in the quarter, we are stabilizing our existing store base, sometimes more than we anticipated we would need to versus opening new stores."
}