{
    "symbol": "PRAA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 23:32:25",
    "content": " I would now like to turn the conference over to Ms. Lauren Partin, Senior Vice President of Finance and Investor Relations for PRA Group. With me today are Kevin Stevenson, President and Chief Executive Officer; and Pete Graham, Executive Vice President and Chief Financial Officer. We will make forward-looking statements during the call, which are based on management's current beliefs, projections, assumptions and expectations. We caution listeners that these forward-looking statements are subject to risks, uncertainties, assumptions and other factors that could cause our actual results to differ materially from our expectations. The earnings release, the slide presentation that we will use during today's call and our SEC filings can all be found on the Investors section of our website at www.pregroup.com. Additionally, a replay of this call will be available shortly after its conclusion, and the replay dial-in information is included in the press release. All comparisons mentioned today will be between Q2 2022 and Q2 2021, unless otherwise noted, and our Americas results include Australia. During our call, we will discuss adjusted EBITDA and debt to adjusted EBITDA for the 12 months ended June 30, 2022, and December 31, 2021. Before we begin, I would like to take a minute to welcome the Gen Mosman as our new Vice President of Investor Relations. And with that, I'd now like to turn the call over to Kevin Stevenson, our President and Chief Executive Officer. Members of Scotland's parliament and community leaders were attended for the celebration along with several banking institutions and consumer assistance charities with a great atmosphere, really reinforcing our values and working together and making a positive impact. To provide some more color on the Halo Building, it's the new center of our U.K. business, which is our second largest market globally. -- but also our commitment to the environment in ESG, all the while providing our employees a facility, which is cutting edge, both digitally and environmentally and one in which they can be excited to come to work each day. 2021 was a record year for us in terms of charitable giving, and we are continuing to make these impactful contributions in 2022 despite all that's going on in the world these days. Please keep in mind, though, that similar last quarter, prior year comparisons will be skewed given the global excess consumer liquidity that our industry as well as many other industries experienced during 2021. In Q2 of this year, total cash collections were $444 million globally, an 18% decrease year-over-year. However, it's important to be aware that we beat our expectations, which Pete will cover in more detail later. The U.S. is responsible for most of the decline, but this was largely driven by the normalization from 2021's excess consumer liquidity, which I've been talking about since about mid-2020. As a reminder, COVID-related government actions such as lockdowns, other restrictions and programs, led to excess consumer liquidity and savings, which in turn drove down loan balances and delinquency rates. For PRA, this meant that our cash collections were strongly in excess of our expectations during 2020 and 2021 and but it also resulted in reduced levels of supply and ultimately lower portfolio investments and, of course, fewer accounts for us to collect upon in 2022. As we review the market today, however, we're seeing most economic indicators point towards the coming increase in supply, which I'll get into more detail later. Our European cash collections increased on a currency adjusted basis, while decreasing on a GAAP or a U.S. dollar basis. Excluding that foreign impact, we had another strong quarter in European cash collections increased 2%. The dramatic strengthening of the U.S. dollar against the European currencies had a significant impact, creating a headwind of nearly $20 million in the quarter. Net income attributable to PRA Group for the quarter was a strong $36 million, albeit down from last year for all the same reasons that drove the changes in cash collections year-over-year. 54% of these were in Europe, including a sizable purchase in a Northern European market and importantly, a market that we had not purchased in since 2000. During the quarter, we repurchased nearly $35 million of our common stock. And since we began purchasing shares last year, we reduced our total common shares outstanding by 14%. From an operating perspective, we had another strong quarter as we continue to drive new efficiencies as well as benefit from those gains made over the past few years. Since prior year comparisons are distorted by the global pandemic effects, we benchmark internally to 2019 in an effort to remove that impact. Comparing our results to the second quarter of 2019, our cash efficiency ratio has improved by 90 basis points. This is driven by our emphasis on innovation, through investment in digital, data analytics, and it demonstrates the health and strength of our operations. We're always looking for new ways to improve our predictive scoring models, test new data and improve our legal and outbound colleague strategies. In the U.S., this includes our growing digital platforms, increasing domestic call center productivity and continued focus on shifting legal accounts into our internal legal attorneys and thus improving our expense margin and adding to our data knowledge. We've also invested heavily in technology in Europe, including investments in digital, cloud-based dialers, infrastructure, robotic process automation and integration into supporting systems. As it relates to cash collection and inflation, we commented last quarter that we had not seen any evidence of inflation negatively impacting our cash collections. Additionally, we don't believe that inflation will have a material impact on our cash collections going forward based on our history. And during those times, we didn't see a material impact to near-term cash collections. So remember, from a cash collection standpoint, we're looking at 10 to 15-year curves and over our 25 years in business through good and bad macroeconomic times, we've done well, projecting that total area on the curve. We've seen variations in timing for sure, things like inflation or conversely, what we saw in 2020 and 2021 can have some impact on timing. But stepping back and comparing that to the buying side of the equation, perhaps I should say, the selling side of the equation, the bank's perspective on this is another matter. So historically, this has driven higher charge-offs, which then led to higher portfolio purchases. We'll, of course, continue to monitor inflation in all of our markets and provide updates as appropriate. So dining the market in 2020, we are very pleased with the team we've built, which now includes 50 full-time employees. Overall, we couldn't be happier with how we're positioned in Australia, and we look forward to sharing more details as they materialize. From an investment perspective, we deployed approximately $231 million in the second quarter. In the Americas, we invested $106 million in the quarter. We've seen similar volumes of marketed deals to what we saw last quarter, last year. In Europe, we invested $125 million during the quarter. This represents the second largest amount we've ever invested in Europe in a second quarter, which is worth noting. As in Europe, typically, we see higher volumes in the latter part of the year. Looking ahead, the economic indicators we're seeing point to more supply in the way. Higher inflation causing pressure on the average consumer, who is battling with the rising cost of food, energy prices and interest rates. As seen on this slide, spending is picking up, and that's leading to higher credit card balances. Not surprisingly, these factors are also leading to lower savings with the savings rate dropping 5.1% as of June 2022, its lowest level since the global financial crisis. In fact, savings for the bottom 20% of U.S. earners or 26 million households declined 22% since the end of 2019. Of course, with lower savings rates and higher credit card balances, not all of those balances will be paid on time or even at all. These high delinquency rates haven't translated in higher charge-off rates, but is common sense and history would suggest higher charge-off rates appear to be on the horizon I'm no economist, but I've been in the industry for a very long time. And when you put all this together, you'll see that the trends should result in more supply and more portfolios for us to purchase as more consumers default on their obligations and debt sellers dispose of their portfolios. We've seen this happen across multiple credit cycles, and we believe a similar pattern will unfold here in the coming months. As we continue to -- continue to monitor credit trends in the U.S., we're also sharing data from the U.K. this quarter. It's been a tumultuous time in Europe since the Russian invasion of Ukraine, which has caused a spike in global fuel and food prices. code the U.K.'s Office for National Statistics economic data for Q1 found that households disposable income fell in real terms for the fourth quarter in a row, the longest it's run record. And as a result, more people are turning to credit and according to the Bank of England, credit card borrowing increased in June at the fastest annual rate since 2005. Ultimately, we remain disciplined, and we'll only deploy capital in markets and in portfolios that we believe will generate profitable returns. Supply is certainly not where we'd like it to be today, but we believe will return is not a matter of when, it is a matter of when, not yet. Again, this quarter, the prior year comparisons are tough, but we're performing in line with our expectations. During the quarter, we collected $36 million in excess of our expected recoveries, which represented consolidated overperformance of 7%, with the Americas overperforming by 4% and Europe overperforming by 12%. This has given us the confidence to modestly increase our ERC forecast for those vintages, which drove a positive change in estimate of $21 million. Operating expenses were $175 million, a $7 million decrease driven primarily by decreases in compensation and employee services and legal collection fees as well as the strengthening of the U.S. dollar against European currencies. The effective tax rate for the second quarter was 26.6%, bringing the year-to-date tax rate to 20.3%, and we still expect the full year tax rate to be in the low 20% range. Net income was $36 million, which generated $0.91 in diluted earnings per share. Americas collections were $279 million, a decrease of $84 million. This was driven by a combination of the excess consumer liquidity in the environment last year and the impact of lower levels of portfolio purchases in the U.S. European cash collections decreased 9%, but grew 2% on a currency-adjusted basis. The purchases we've made over the last few years, particularly in Northern Europe are driving the growth in our European business. Although this was a decline from the 66.8% last year, it's a 90 basis point improvement over the second quarter of 2019. ERC at the end of the quarter was $5.6 billion, with 41% in the U.S. and 52% in Europe. If not for this translation impact, our ERC would have increased from the first quarter, which hasn't happened since the third quarter of last year. And based on the average purchase price multiples we've recorded this year, we would need to invest approximately $870 million globally over the same time frame to replace this runoff and maintain current ERC levels. I think this level is attainable, but it will be dependent on the normalization of the U.S. market. At the end of the quarter, we had $1.6 billion available under our credit facilities. Additionally, in the last 12 months, we generated $1.2 billion of adjusted EBITDA. With all the news focus on rising interest rates, I did want to provide some commentary on our interest rate hedging program, which we use to manage interest rate risk related to our funding. However, when looking at our exposure by currency, we're nearly 100% hedged in the U.S. dollar, a little over 50% hedged in Sterling and then less hedged in the other European currencies. During the second quarter, we repurchased $35 million or approximately 808,000 shares of our common stock. At the end of the quarter, we had approximately $93 million of share repurchase authorization remaining. We believe our strong capital position, financial performance and conservative capital structure provide us considerable flexibility as we prepare to fund higher levels of portfolio investments, we anticipate coming to market in the months ahead. And in the meantime, we will continue to evaluate other opportunities to drive meaningful growth and incremental value for our shareholders. And we know there was a lot to cover this quarter, but we believe the takeaways are clear. So first, Q3 was another great quarter for the company, masked somewhat by challenging comparisons against 2021 and the FX headwinds that are largely outside of our control. And then second, economic indicators point towards more NPL purchase volumes coming. I'll wrap and up by providing a bit of color on how we believe our business is positioned to perform in a recession, which has been a talking point recently. The trend, however, is that our paying customers have already been through what we call a personal recession. -- due to personal factors that are oftentimes unrelated to the health of the broader economy, they've fallen behind in their payments, and we are helping them on the road to financial recovery. When an economic recession occurs, these customers, for the most part, continue to pay as they've agreed to and collections aren't as impacted as some might expect. What is impacted, however, is the amount of new charge-offs that occur as an entirely new group of consumers running the financial difficulties. This eventually leads to higher charge-offs and higher amounts of portfolios for us to purchase, which is exactly what we saw in the years following the global finance crisis. As I said earlier, nearly all the economic data we're seeing points to more supply entering the market, and we're ready for it. We've built a high-performing, well-capitalized and profitable engine that is hungry for portfolios. We will always remain disciplined in how we allocate capital, but we're encouraged to see the purchasing pick up this quarter. Overall, this is an exciting time to be here at the company, and we look forward to connecting with all of you as we continue to demonstrate the value of investing in PRA. Operator, we're now ready for questions. Kevin, I mean, you certainly called out a strong quarter, but it can be somewhat lumpy. But no, I would say it's consistent and as we expected. Then the cash efficiency ratio, 60.7% this quarter. Again, I said on the prepared remarks, Bob, that I think we're going to be around 62% for the full year. There's always some sort of seasonality to that quarter-by-quarter as we move through the year, but I think 62% is a good sort of benchmark for the full year. Just I think, Kevin, I mean, you had sounded a little more excited, I think, in the last call about M&A potential. I think I might have said this last quarter, but I think now is a great time for us in our evolution. And so yes, we are â\u0080\u0093 I would say weâ\u0080\u0099re in the flow as we like to call it. And looking around for something that makes sense from either a tangentially related business or again, something that makes sense for us. I think as always, we're being very methodical about how we approach things. You'll recall, we had last year, talked about a multiyear flow that we had picked up. Just keep in mind, though, that's a contractual commitments disclosure. And then when we think about the cost, your costs were down $7 million when your collections were down about $100 million. Well, some of that is related -- well, a lot of that is related to the top line liquidity that we had in the environment in '20 and '21. On a cash efficiency basis, we're benchmarking against 2019 to kind of normalize for that top line liquidity. I think in terms of overall expense levels, we're kind of we've kind of plateaued in terms of we're at the lowest number of collectors that we're really comfortable with here in the U.S., and we probably have some pent-up capacity to scale as more portfolio comes to market without a dramatic increase in costs. I think in terms of near term, the overall level of expense, the total OpEx that we're at right now for the quarter is probably a good benchmark for how we're going to be trending here in the next couple of quarters. But I think in terms of total OpEx, we're probably about the right size. I think that's -- as we get closer to the point where we think that portfolio is going to come to market, we might throttle back a little bit, but it's always going to be a part of our toolkit. Then one more question, the sizable purchase in Northern Europe, if you hadnâ\u0080\u0099t bought since 2020, what makes you feel good about your visibility around the collections performance for the portfolio. It's a unique market, and we have a lot of data in that market. And to your point, though, it is a little older, but it's a more legal is not the right word. No, so that's a good question. No, it wasn't that because we have had that happen before where a competitor backed out of a bid, and we came in and bought it but that was not the case this time. War, it's we -- each quarter, we have to evaluate the myriad of cases that we've got and adjust our accruals accordingly. again, I would say for the near-term future, I think our total OpEx is probably about at the right level, and we'll probably have some puts and takes amongst the different line items. On -- if I can -- what -- the outlook for the U.K., I mean, there does seem to be a lot more stress on a typical U.K. British consumer than maybe the U.S. consumers right now. And obviously, we're heading into the back half of the year where things are getting pretty tough across Europe with energy bills and things like that. So -- but at the same time, I mean, on a constant currency basis, the cash collections seem to do pretty well in the European geography. So can you give us any more -- how conservative have you been on -- a tough question on the curve in Europe with a pretty tough environment, but you're still outperforming. In the U.K., especially as you enter the colder seasons with some of the energy costs, thatâ\u0080\u0099s a big deal for those guys, and we think about that all the time. Weâ\u0080\u0099re in â\u0080\u0093 and obviously, weâ\u0080\u0099re in a couple large forward flows and not just one. Again, we take each quarter as it comes and we make our best outlook for what's going to happen not only in the near term, but over the course of these forecast periods, which are quite long. I would say the U.K. performance, some of that being driven by the type of paper that we predominantly have bought there, which tends to be books that are in long-term payment plans, and we go through a formal process of evaluating the customers' ability to afford those payment plans. On the digital front, I mean, obviously, thereâ\u0080\u0099s been some â\u0080\u0093 youâ\u0080\u0099ve been working on a long time, but you talked about a lot more to say, over the last 2 years, but not this quarter. Or is it kind of settled into something thatâ\u0080\u0099s more predictable now that to your point, some of the excess liquidity at the consumer is not quite theâ\u0080¦\n Yes. No, it's a great question. So obviously, during 2020 and 2021, it materially outperformed our expectations. But I look back to when we really launched this process and digital was a very, very small piece of our business back in the day. And I remember, we don't disclose this, but I'll just make a comment about -- we set our internal goal as to what percentage we'd like to have. And even now that we're past that excess liquidity time frame, we are bumping up right against that goal. And so we're obviously in the process of now setting new goals, something new to stretch for in digital. And if you look at some of the productivity numbers, like headcount for collectors, for example, hasn't been this low since what, 2007, somewhere in there. So don't -- I didn't talk too much about it this quarter, but don't take my silence as lack of enthusiasm on the matter. Secondly, as credits normalizing and obviously some other macro factors weigh, the sellers have obviously been raising their provisions and we're monitoring delinquency roll rates. And I guess I'll go out on a limb and say when they have a rolling batch of charge-offs coming through, I would say they're either going to stick to their old strategies or again, doing a global financial crisis, it felt like to me they were selling sooner. But again, I think it's really about bank preference so it depends on which one you're talking about. And then lastly, sure somebody kind of inquired about just the magnitude of the collection upside in the quarter. I mean, should we -- I mean, just based on directionally what's going on with consumer payments and inflation and whatnot. I've said all along when we talk about this accounting model that you got to look at it holistically and you can't separate the portfolio yield component from this change in estimate component because keep in mind, we're locking in that yield on day 1, and we don't ever change it. And that's why I think there'll always be something there, not too dissimilar from when we had the allowance charge component. We couldn't tell you which quarter or when it was going to happen in order of magnitude, but you could always bet that there was going to be a certain level of that year after year. And on balance, I think it's going to be biased more towards positive just based on how our codes develop overtime. But our industry, you mentioned you're listening to consumer credit calls. And they tend to be stickier because again, we're working with them. They're -- again, just -- if everybody knows this or not, we don't charge interest and fees in the United States and the balance is static and they're chipping away at it. Sorry, I just want to -- yes, that's helpful. And for portfolio income, we've been modelling some fairly consistent yields going forward. I guess maybe a different way to phrase it was, that's -- that was the second highest figure in 6 quarters, and maybe it's something that we would think would be narrowing a bit, I guess, on an absolute basis if . Remember, we made significant adjustments in the 2020 and 2021 related to acceleration. And we because of the uncertainty in the environment, we essentially held on all of our vintages on all of our businesses held our purchase price multiples constant and didn't allow any of that natural expansion that we normally see in a portfolio over time to occur. Okay, that's all I got. Again, it's a great time to be here at PRA. And we're just, again, thankful everybody, for attending the call to get caught up on us, and we look forward to talking to you next quarter."
}