{
    "symbol": "PSEC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-30 13:58:04",
    "content": "  In the June quarter, our net investment income, or NII, was $90 million or $0.23 per common share, exceeding our distribution rate per common share by $0.05 and by 28%. In the June 2022 fiscal year, we achieved basic net income applicable to common stockholders of $556.6 million or $1.43 per common share, representing a 7% return compared to starting net asset value per common share. Our net asset value stood at $10.48 per common share in June, down $0.33 and 3% from the prior quarter, largely due to unrealized mark-to-market depreciation again from macro conditions. Over the 9 quarters, from the pre-pandemic December 2019 quarter to the March 2022 quarter, Prospect has delivered the highest growth in the business development company industry and net asset value per common share, with NAV per common share increasing by 25% over that time period. In the June quarter, our net debt-to-equity ratio was 56.8%, down 17.3 percentage points from March 2020 and up 2.9 percentage points from the March quarter as we continue to run an underleveraged balance sheet, which has been the case for us, for multiple quarters and years. In May, 2020, we moved our minimum 1940 Act regulatory asset coverage to 150%, equivalent to 200% debt to equity, which not only increased our cushion, but also gave us flexibility to pursue our subsequently announced junior capital perpetual preferred equity issuance, which counts toward â\u0080\u009840 Act asset coverage, but which gets significant equity treatment by our rating agencies. We are currently focused on multiple initiatives to enhance our net investment income, return on equity, and net asset value in an accretive fashion, including, number one, our $1.75 billion perpetual preferred equity programs, which could potentially be increased in capacity in an accretive fashion. As of June 2022, our portfolio at fair value comprised 49.9% first lien debt, up 150 basis points from the prior quarter; 19.4% second lien debt, up 90 basis points from the prior quarter; 9.4% subordinated structured notes with underlying secured first lien collateral, down 40 basis points from the prior quarter and 21.3% unsecured debt and equity investments, down 200 basis points from the prior quarter. In our performing interest-bearing investments, weâ\u0080\u0099re generating an annualized yield of11.1% as of June 2022, an increase of 50 basis points from the prior quarter and a significant contributor to NII growth this past quarter. As of June 2022, we held 129 portfolio companies, an increase of 2% in the prior quarter with a fair value of $7.6 billion, an increase of $0.2 billion from the prior quarter. Our weighted average EBITDA per portfolio company stood at $110.8 million in June 2022, an increase of $9.7 million and 10% from March 2022 as we continue to achieve solid profit growth with our portfolio companies. As of June, our subordinated structured credit portfolio has generated $1.45 billion in cumulative cash distributions to us, representing around 104% of our original investment. To date, we have raised over $970 million in aggregate issuance of our perpetual preferred stock across our preferred programs and listed preferred, including $142 million in the June 2022 quarter and $232 million to date in the current September 2022 quarter, with the ability potentially to upsize such programs based on significant balance sheet capacity."
}