{
    "symbol": "DNA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 22:32:12",
    "content": " And the code base is a data assets and it's basically as we do these projects for customers, we're accumulating physical strains, data genetics, various learnings, we're training models, machine learning models and so on, that we can then make available so that we don't need to reinvent the wheel for every new cell program, when a customer comes to us. Finally, we're launching pilots across several new modalities, new ways to do this, that we believe will support our more preventative approach to Biosecurity, right, because that's really the future here is making sure things like COVID don't happen again. It's where you're food comes from, but also the other things like maybe you have cotton shirt on, that's a part of the agriculture industry, getting a hamburger if it's meet or plant based agriculture industry, ethanol going into the fuel blends that's coming from the agriculture industry, and the influence that enable that this industrial ag sector are huge, right. And so that includes sort of the beginning of a process around sort of like doing the cell engineering and working with our Foundry and code base, but it also means we need to invest in understanding fermentation and scale up, downstream purification and formulation and things like that to help our customers be able to ultimately bring that product all the way to market and transfer them a process that can go in scale and you've seen us do this for example with our Partner Cronos in Canada recently. And so one of the questions is like where -- is it a customer who's got the appetite to push a lot and believes in this sort of outsourced R&D and that's why I'm excited about the Bayer deal, but you see that happening with really a large customer in that case for a whole category of work for them. So one of the things we think about on the, let's say, those answer (ph) question about the Bayer transaction, just to repeat it right, it's sort of like, hey, if you're taking our large customer in a certain category does it prevent you from working with other companies in that sector, right. We do are always arguing right like any customer is going to try to lock us into an exclusivity and just I appreciate we have now finished signing that Bayer deals I certainly can't comment on exactly how it's going to work, but I again say is, our intent here and the reason we're acquiring large team and platform in West Sacramento is to make that broadly available, right. So their actual model to date is not to outsource the service providers, it's to use all that money to build our R&D team to do cell engineering and so we are trying to effect this like again this mentality shift, which is what I am so excited about seeing in the Bayer deal, well, cash pressure on small Biotech is going to help change people minds, right. And so, the reason we like the Berkeley Lights machines is they're using a microfluidic technology that really allows us to continue to substantially shrink the reaction volumes that we're working with, when we're doing not everything like those machines aren't they're not really, they are not general purpose liquid handlers, but for the type of work they're doing is certain, a wide class of assays that are roughly based on what you can see with a high-power microscope pretty neat and so that's why we like them. And also just, I know we've talked a lot about or so thinking about this, but how many of these programs are concluded, can -- do you think will add downstream value there something is going to come out with or things that we're just like research projects and basically it's like how do we sort of model the revenue per active program because it's, I know it's sort of like a moving target, it's lumpy but it's sort of matters of the model?"
}