{
    "symbol": "DNA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 23:16:11",
    "content": " In biosecurity, we executed very well through the remainder of the school year and have achieved $247 million of year-to-date revenue while our K-12 testing business has been quieter over the summer, just because many schools are closed as expected, we're very excited to be seeing traction across longer term biosecurity opportunities including being awarded a contract from the CDC to expand our traveler-based COVID-19 monitoring services with an overall potential to exceed $61 million to Ginkgo and its partners based on CDC program options and public health priorities. G&A expense, excluding stock-based comp, grew to $48 million in the second quarter of 2022 compared to $20 million in the second quarter of 2021 as we invested in business development and all other G&A functions to support the growth of new customers and programs, higher level of foundry activity and our biosecurity offering, along with our expenses incurred and becoming a public company. I do want to remind folks again that just as we saw in both our first and second quarter results, based on the specific technical progress achieved, stage of maturity of our programs and timing of any milestone payments, we can see lumpy foundry revenue on a quarterly basis, and our annual guidance represents our current forecast of that timing for the remainder of the year. And then I do think, like I said earlier, I think we will eventually look back at our current sort of approach to monitoring of infectious disease, kind of like we were all living in buildings without smoke detectors, like and â\u0080\u0093 that seems crazy today because we donâ\u0080\u0099t really have the technology for like simple passive monitoring like your phone just telling you if something new is in the room. And then that Foundry service I mean, I think, we calculate, we call it, revenue proactive programs, but I think weâ\u0080\u0099re kind of getting at that same point, is that, youâ\u0080\u0099re in the â\u0080\u0093 that run rate you had in 4Q, 1Q and 2Q now has been pretty consistent, is that sort of settling in at a level we should expect going forward, just, not looking for 2023 guidance, but weâ\u0080\u0099re always looking sort of looking for KPIs."
}