{
    "symbol": "DNA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 20:11:08",
    "content": " So, first, in the near-term, we got, you know, this virtuous cycle where each new program adds learnings to our code base, right, which is that sort of data and intellectual property and so on that we get reuse rights for as we do these projects with our customers, and that can help make future programs easier, okay, because of what we've learned from our past ones. And I think the fact that we did these deals with large biopharma's with Merck and with Novo Nordisk in the last year also helped to, kind of validate, you know, we've been around the block with folks with that sort of high bar for working with an R&D partner in past. And so, I'm excited to get out in the market, have that team that's really been working in ag biologicals, you know, for some folks there for, you know, pushing 20 years out in the market, talking to folks, coming up with new ideas, engagement big ag and small ag companies, So, I'm optimistic about it, but it's an asset we've just brought in. So, you know, it looks like you're calling for about, you know, 70 million in Foundry revenues in the fourth quarter, Jason, you noted that, you know, the pharma budget flush is not really a major dynamic for you at this stage. And then even if I look to next year and I think about how many programs can we bring in and so on, you know, that's also very specific to what our sales pipeline looks like, right. You know, I do want to bring in, you know, I think it's been, like, I said earlier, like, getting these, kind of blue chip biopharma's on the platform in the last year is helping us then sell into that category. If we don't bring in, you know, it's been great in the, sort of industrial biotech sector, you know, folks like  coming on the platform, that â\u0080\u0093 you know people look at â\u0080\u0093 earlier companies look at them, you know, they're sort of leaders who've been around the block on the startup side."
}