{
    "symbol": "PEGY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 12:23:06",
    "content": " I think very significant silver lining is like you said, I think in some aspects of the investigation like are still winding down, but we've seen the permitting piece get solved and unclogged and as of now, I don't think we have a single one of those projects or ones like it that are still awaiting permits because of this issue so it's like a small handful, like three or four of them. I think there's a separate issue of gross margin, and I think in the fourth quarter in Hawaii, we had some gross margin pressure because of elevated COGS that kind of stemmed from some service things, and also some supply chain stuff kind of hitting from COVID. But I think â\u0080\u0093 and in a bit, we made a conscious decision that there was so much demand top of funnel in Hawaii because of this battery bonus program that's been solid for the market and continuing to this year. Or is it still going to be maybe like moderation in the fourth quarter given SUNation the bigger piece of things, just any kind of elaboration around color â\u0080\u0093 I mean, sorry, like cadence of revenue in the year that'd be great. We hadn't shared that guidance before, but it's what we came into the year, expecting internally and haven't seen anything in Q1 to really make us change off of that, tracking towards that and feeling good about both top of funnel demand, overall growth in those markets and our own company's performance and ability to capture that. So while we were pushing through strong growth in revenues and kind of record revenues or recent record revenues and installs, I think the backlog was growing even at the same time because sale, like kilowatts sold for the year were coming in even higher than kilowatts installed. And I think that we've done some of that analysis before internally and looked at it, I don't have it at my fingertips, but it's one of the things that gives us confidence in giving the guidance is that so much of the revenue is already pre-sold and then at the point where people don't really cancel anymore. And I think maybe you asked about balance sheet, I think, yes, we don't have cash on hand to go do additional acquisitions, so we're going have to raise capital if we're going to do other acquisitions, but I think that when you look at where valuations are at and multiples and I think when you look at the logic of putting the companies together and some of the synergies and just the continued desire to have scale to compete against the Sunrun and snows and sun powers of the world, I think that it's a pretty compelling scenario both for the companies we're looking to acquire and for potential capital partners who would fund those acquisitions. I think it's just kind of a combination of solid, consistent up into the right performance where the markets continue to grow through strong top of funnel demand, our ability to generate leads and close sales and win ours or better than our fair share just through our go-to-market approach, our brand building, our customer experience, our consultative approach keeps serving us well."
}