{
    "symbol": "WD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 00:39:05",
    "content": " Within this fluctuating interest rate environment, our team continued to execute exceedingly well on behalf of our clients, closing total transaction volume of $23 billion, up 67% from the second quarter of 2021 and generating total revenues of $341 million, up 21% year-over-year. Our strong top line results drove diluted earnings per share of $1.61 and dramatic growth in adjusted EBITDA to $95 million, up 43% year-over-year. Capital flows have diminished, leaving a good portion of the market to Fannie Mae and Freddie Mac, with 59% of their annual lending capacity still intact as we enter the back half of the year, Fannie and Freddie have the very real opportunity to lend the entire $92 billion of lending capacity they still had as of July 1. Small loan originations totaled $259 million for the quarter, up an eye-popping 171% year-over-year and Apprise our appraisal company completed 734 appraisals, up 97% over Q2 of last year. Second quarter transaction volumes grew 67% year-over-year to $23 billion, generating 21% growth in total revenues to $341 million and diluted EPS of $1.61. And those volumes, combined with growth in our servicing and asset management businesses drove exceptional growth in adjusted EBITDA to $95 million, up 43% year-over-year. Our property sales team navigated a challenging market and not only grew volumes 136% to $7.9 billion, but delivered the second strongest quarter of property sales volume in our companyâ\u0080\u0099s history. Finally, although net income from this segment declined $7 million this quarter due to the decrease in non-cash revenues, we were very pleased with the 19% growth in adjusted EBITDA to $17 million. For the second quarter of 2022, total expenses for the corporate segment increased $12 million or 43% over last quarter. Our historic 12% market share, which we have significantly beaten year-to-date, would imply total GSE volume of $19 billion for the full year, up 23% from 2021 and almost to a record high of $21 billion in 2020. Our loan servicing portfolio ended the quarter at $119 billion, which will require 8% annual growth to hit our $160 billion goal, something we should achieve with the lending volume growth we have seen."
}