{
    "symbol": "WD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 11:11:03",
    "content": " We closed $11.2 billion of total transaction volume in Q4, down 59% from Q4 of 2021, generating total revenues of $283 million, down 31% from Q4 of 2021. Full-year debt financing and sales volume was $63 billion, down only 7% year-over-year, generating revenues of $1.3 billion flat from 2021. Full-year diluted earnings per share was $6.36, down 22% from 2021, primarily due to significant declines in mortgage servicing rights from our Fannie Mae and HUD loan originations. To understand the magnitude of this fee compression, had our 2022 Fannie Mae loan originations been done with 2021 average servicing fees it would have added over $2 of diluted earnings per share on the year, a 31% increase overall reported earnings per share. Our full-year 2022 Fannie Mae volume of $10 billion brought us to 16.5% market share, an all-time high and solidified our ranking as the number one Fannie Mae DUS lender for the fourth consecutive year. On the year, our debt brokerage volume totaled $25.9 billion, a decrease of 13% from 2021, when capital was free and debt funds were lending on any asset they could find. Freddie Mac's 2023 multifamily market estimate is larger at $440 billion, a market of this size with the GSEs playing an outsized role presents a huge opportunity for Walker & Dunlop to grow volumes and capture market share. During the fourth quarter, cash revenues from mortgage originations, property sales, servicing and asset management and escrows drove adjusted EBITDA to $93 million bringing full-year EBITDA to $325 million, up 5% over the previous year. Our $11.2 billion of fourth quarter transaction volume generated total revenues of $283 million, down 31% from the same quarter last year and diluted earnings per share of $1.24, down 49%, compared to last year. As a result, adjusted EBITDA was $93 million, down only 16% from the same quarter last year despite a 59% year-over-year decline in total transaction volumes. Transaction volumes for 2022 were down 7%, compared to last year generating $709 million of revenues, down 20%. Turning to slide 11, we ended the quarter -- slide 12, we ended the quarter with $123 billion servicing portfolio, $17 billion of assets under management and $2.7 billion of escrow balances, generating full-year revenues of $507 million, up 34 %."
}