{
    "symbol": "WD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 16:01:14",
    "content": " Total revenues grew a comparable 42% year-over-year to $319 million and drove diluted earnings per share of $2.12, up 18% from the first quarter of last year. Fannie and Freddie only lend $31 billion to the multifamily market in Q1, leaving them with a $125 billion or 80% of their total 2022 lending capacity, which has remained a reliable, consistent capital source for multifamily borrowers to use over the remainder of the year. These 2 businesses grew dramatically during the first quarter with small balance originations of $176 million, up 54% from Q1 '21 and the completion of 711 appraisals up 187% over Q1 of last year. The addition of $14 billion in assets under management with the acquisition of Alliant Capital did not diminish our growth expectations with Walker & Dunlop's ex investment partners, where we raised commingled funds to place capital into the transactions our bankers and brokers work on every day. First quarter diluted EPS was up 18% year-over-year to $2.12, while the strength of the cash-generating components of revenues continued to drive growth in adjusted EBITDA, which was up 3% to $63 million. For the first quarter, the Capital Markets segment generated total revenues of $164 million, up 12% from Q1 '21 and net income of $47 million, down 17% year-over-year from $56 million. We already have a large GSE pipeline for Q2 and fully expect both GSEs to hit their volume caps by the end of the year, which, in combination with our expectations for continued growth in debt brokerage and property sales volumes should benefit our capital markets and overall company financial performance for the remainder of the year. The Servicing and Asset Management segment generated total revenue of $111 million during the quarter, up 42% from the first quarter of '21 and earned net income of $33 million compared to $27 million in Q1 of last year, a 19% increase. And in Q1, it contributed $88 million of EBITDA compared to $69 million, up 26% from the first quarter of last year Finally, the Corporate segment generated $44 million of revenue, primarily from the $40 million apprise revaluation adjustment. With so much capital chasing assets in an inflationary economy, we believe commercial real estate and the transaction volumes that drive Walker & Dunlop's financial results will remain healthy over the coming years."
}