{
    "symbol": "ATRO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 22:57:03",
    "content": " If you look at our inventory levels, in the most recent quarter, you will see that we've had a real buildup of inventory that obviously is bad news in terms of working capital, but it's good news in terms of getting the parts that we've been waiting for, for about a year and which will set us up for the increased level of shipments that we anticipate in the current quarter and next quarter and the quarter after that. And if you look at the chart on the last page of our press release, you'll see three out of the last four quarters, we're right around $180 million. Consolidated sales increased to $131.4 million and was led primarily by continued growth in the recovering commercial transport market, which was up 36% compared with last year's third quarter and up 13% sequentially from the second quarter. And finally, in last year's third quarter, we did recognize $1.1 million of grant from the AMGP program, offsetting cost of goods sold that we don't have this year. Cash flows from operations in the third quarter were negative $28.8 million, largely caused by inventory, which increased $16.1 million during the quarter, driven again -- once again by our growing sales backlog and the move to the right of some sales programs and complicated by supply chain inefficiencies. And then kind of plateauing basically about $100 million to $120 million level up until two quarters ago, when we kind of broke through $120 million, broke through $130 million, but still obviously over the last year lagging demand significantly. So, again, if you look at the last four quarters, we had total bookings of $685 million against sales of $493 million. We are expecting that fourth quarter revenue, the quarter we're in right now, will be in the range of $140 million to $150 million. Based on bookings that we've experienced to date and the record backlog that we have of $547 million, we think that we're going to be in the range of $640 million to $680 million next year."
}