{
    "symbol": "ATRO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 16:49:05",
    "content": " We're not unique here and I don't intend to present a thesis, but I do want to describe how the supply chain is affecting our performance, it was pretty significant in the first quarter and it's something that's been growing. We went into the quarter thinking that we would have revenues somewhere north of $130 million, we ended up at $116 and the reduction occurred kind of steadily over the course of the quarter when we realize that necessary components that we needed to build our products were not coming in as expected or, or as really agreed to by our suppliers. We have bookings of $175 million in the first quarter, that's book-to-bill of over 1.5 and it's our second quarter in a row. Our quarter one backlog consolidated, as I mentioned, as the new record of $475 million, that's an increase from early 2021, when our backlog was at $283 million. Consolidated revenue was $116 million in the quarter up almost 10% from last year's first quarter, flat sequentially from the fourth quarter of 2021. Aerospace revenue was $101 million and test revenue was $15 million for the quarter and consolidated gross margin was $19.9 million or 17.2%, with a loss from operations of $4.2 million and a slight adjusted EBITDA loss of $353,000 after removing the impacts of the AMJP grant, and the gain from the earnout for the sale the semiconductor business. We've had about $140 million of backlog scheduled for delivery in the second quarter, but we anticipate some of that may push out into the second half of the year. Test bookings were $15 million and a book-to-bill about one times and the backlog at the end of the quarter again, as Pete mentioned was a record of $475 million. Commercial transport market continues to strengthen for us and sales were up $64 million, up 10% sequentially from the fourth quarter and up 68% from last year's first quarter. The test segment continues to be somewhat sluggish with sales down $9.7 million from last year's first quarter, resulting in an operating loss of $1.8 million. So, some big ramps, some real accelerations compared to where we've been our backlog demands its supply chain holds up and performs, the second quarter -- the second half should be much more positive from a financial perspective than the first half."
}