{
    "symbol": "IBKR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-18 18:55:09",
    "content": " Despite the slower growth in accounts, we welcomed our 2 millionth customer in September, less than two years after adding our 2 millionth customer and ended the quarter with a record 2,012,000 accounts, an increase of 31% from last year. Net interest income of $473 million reflected higher-margin loan interest despite lower balances, thanks to increases in benchmark rates and higher interest earned on our segregated cash portfolio as U.S. rates have moved from an average effective rate of 9 basis points last year to 218 basis points in this year's quarter. Compensation and benefits expense rose $14 million or 14% over the prior year in line with hiring, while up in dollar terms for the quarter, comp and benefits expense fell to 13% of our adjusted net revenues, somewhat below its historical level. Our total assets were $115 billion at the end of the quarter, with growth over the last year driven by increases in our segregated cash and securities, partially offset by a reduction in customer margin loans. On page seven, you can see that our account growth remains robust with nearly 90,000 net account adds in the quarter and total accounts exceeding $2 million, up 31% over the prior year. Our cleared IBKR pro customers paid an average of $2.96 commission per cleared commission of order, up 20% from last year as our clients' volume mix included higher per order contributions from stocks and options. Total GAAP net interest income was $473 million for the quarter, up 73% from the year-ago quarter, reflecting stronger margin loan and segregated cash interest, partially offset by higher interest expense on customer cash balances. Margin loan interest was up 125% to $317 million, despite average margin loan balances that were down 9% from last year's third quarter. Given market expectations and more rates rate hikes to come, we estimate the effect of increases in the Fed funds rate to produce an additional annual net interest income as follows; at 25 basis points, an increase of $55 million; at 50 basis points, an increase of $110 million; at 75 basis points, an increase of $166 million; and at 100 basis points, an increase of $221 million. Thank you, one moment for questions. Thank you, one moment for questions. One moment for questions. One moment for questions. One moment for questions. One moment for questions. One moment for questions. One moment for questions. One moment for questions."
}