{
    "symbol": "VITL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 13:43:05",
    "content": " Last year's expansion of Egg Central Station, our world-class egg washing and packing facility, significantly increased our capacity and puts us in a position to support over $700 million in annual revenue from egg access. As Russell mentioned, we had another record quarter with net revenue of $110.1 million, an increase of 42.2% compared to the prior year period, driven by volume growth of 27%. Growth in net revenue in the fourth quarter was due to continued growth in egg-related sales, driven by strong volume increases at our customers, as well as distribution gains at both new and existing retail partners. Net revenue for the year was $362.1 million, an increase of 38.8% compared to fiscal year 2021, driven by volume growth of almost 29% and some benefit from pricing. The growth in net revenue was due to continued growth in ag-related sales, driven by strong volume increases at our customers, as well as distribution gains at both new and existing retail partners. Shipping and distribution expenses for the year were $30.1 million or 8.3% of net revenue relative to $25 million or 9.6% of net revenue in fiscal year 2021, driven by higher sales volumes and freight rates. Adjusted EBITDA for the fiscal year 2022 was $16.2 million or 4.5% of net revenue, compared to $8 million or 3.1% of net revenue for fiscal year 2021. As for the cadence in 2023, we expect stronger year-over-year net revenue growth in the first half of the year, primarily due to the carryover impact of our May 2022 pricing increase. To provide the context on this figure, relative to our expenditures in 2022 of about $10 million, our 2023 figure includes about $7 million of previously planned supply chain spend that was delayed due to some vendor constraints last year as well as some costs for the initial work on our next egg packing facility. So I'd start by saying that, as we've looked historically at the impact of the pricing of commodity eggs in the marketplace in comparison to ours, what we found is that there's not a very strong correlation in terms of our ability to maintain the price premium that our brand, we believe, deserves, nor has there been a big impact in our growth rates or our volumes or velocities, when there are big changes in -- there have been historically big changes in the pricing at the bottom kind of bottom of the shelf, so to speak. Now the reason why we believe that what's happening in the broader market might have an impact in our year-on-year growth rates first half versus second half has to do more with the shortages that we have all seen on the shelf, particularly in the fourth quarter of 2022."
}