{
    "symbol": "ALYA",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-11 10:23:12",
    "content": " In Canada, revenues increased sixty nine point seven percent to sixty six point one million dollars due to organic growth in all areas of our Canadian operations. The increase is also due to the general recovery of activity levels, revenues of fifteen point six million dollars from the R2D acquisition and growth from the two associated long term contracts. Looking at our gross margin, gross margin increased by nine point eight million dollars or fifty two percent to twenty eight point five million dollars for the quarter. As a percentage of revenues, for the second quarter, gross margin was twenty seven percent or twenty nine point one percent when excluding the impact of the recent acquisition of R3D. 10:06 Reported SG&A expenses totaled twenty four point nine million dollars, an increase of four point seven million dollars or twenty three point five percent from twenty point one million dollars during the same period last year. 10:43 As a percentage of revenues, total SG&A decreased to twenty three point six percent of revenue for the three month ended September thirty twenty twenty one compared to twenty nine point five percent last year. 11:12 On slide six, you can see that overall, our second quarter adjusted EBITDA amounted to five million dollars, an increase of four point two million dollars compared to the same quarter last year. As in previous quarters, the amount of non-cash depreciation and amortization, totaling four point seven million dollars is significantly greater than the quarter's accounting loss. Net cash used in operating activities were seven point five million dollars in the second quarter, which is comprised of a three point four million dollars positive inflow from our statement of operations, minus ten point nine million dollars non-cash working capital variation. 13:01 Taking into consideration our twenty six point eight million dollars in cash on hand we ended the quarter with twenty nine point six million dollars of net bank borrowing, while we increased and extended our available revolving facility to seventy million dollars into twenty twenty four, allowing good flexibility for possible future acquisitions. Our revenue reached sixty seven million dollars for the U.S. as opposed to fifty seven million dollars for the same period last year, representing an eighteen percent increase, of which all organic growth and clear intention of both pandemic recovery in the U.S. 21:09 In order for us to continue delivering quality projects, we need to attract and retain professionals everywhere, including in the U.S. where the market is fragmented and very competitive."
}