{
    "symbol": "CAG",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-14 19:00:03",
    "content": " Looking ahead to fiscal '23, we expect to see continued strength in our sales driven by strong innovation, the impact of pricing actions and progress in the supply chain to help offset continued inflation and elasticity. Slide 7 shows our cost of goods increased 16% in fiscal '22, far higher than the 9% we anticipated at the time of our fiscal '21 fourth quarter call a year ago. During fiscal '22, we delivered strong top line growth with full year organic net sales up 3.8% compared to fiscal '21, reflecting the continued relevancy of our portfolio to consumers. Overall, our full fiscal year '22 adjusted operating margins decreased by 312 basis points versus last year to 14.4%, which was in line with the revised expectations we provided during our third quarter call. During the fourth quarter, the 6.8% increase in organic net sales was driven by a 13.2% improvement in price/mix as a result of continued inflation justified pricing actions as well as favorable brand mix. Although our productivity in the quarter was below historic levels, given continued supply chain challenges, the rate was up compared to Q3 and we are seeing steady improvement in our supply chain operations as we exit fiscal year '22. As Sean mentioned earlier, we expect to see operating margins expand in both our Refrigerated & Frozen and International segments in fiscal '23, as pricing actions catch up to the recent inflation. We continue to pull on a number of levers to offset the elevated costs, including an additional round of inflation justified pricing actions implemented during the fourth quarter of fiscal '22 that will be effective in the first quarter of fiscal '23 and new pricing that will take effect in the second quarter of fiscal '23. But given the pricing, given the ramp-up of productivity and given inflation at low teens off of what was a high base in fiscal '22, we feel comfortable with what that's going to do in terms of our EBIT growth for '23. Well, that's a good setup for our Investor Day in a couple of weeks because we've got -- I'd say there are areas of just continuous improvement and continued progress, like our innovation program, for example, just has been very strong for five plus years running now and it gets even stronger."
}