{
    "symbol": "CAG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-07 13:02:06",
    "content": " Specifically, we now expect organic net sales for the year to be plus 4%, and we project adjusted diluted EPS to land at about $2.35, which translates to approximately $2.65 of earnings power when taking into account the impact of the lag between inflation and our end market pricing this fiscal year. We now expect organic net sales growth of approximately 4%, adjusted operating margin to be approximately 14.5%, adjusted EPS to be approximately $2.35, and as I just mentioned, we're updating our gross inflation guidance to approximately 16%. In Q4, we expect organic net sales growth of approximately 7%, adjusted operating margin of approximately 15.5%, adjusted EPS of approximately $0.64 and gross inflation of approximately 16%. Our 6% organic net sales growth was driven by a strong price mix increase of 8.6%, reflecting the inflation-driven pricing actions we have taken in every segment of our business over the last year. For fiscal '22, we now estimate total meat-based protein market inflation of approximately 50%, which is approximately $340 million of additional market cost in this one commodity area, driving nearly 40% of our total gross materials inflation in fiscal '22. As you've heard from us this morning, we expect our strong top line momentum to continue with benefits from our pricing actions and favorable elasticities driving organic net sales growth of approximately 7% in Q4 and approximately 4% for the full year, up from approximately 3% in our previous guidance and up from approximately flat in our original fiscal '22 guidance. Because of the incremental inflation we have discussed today and the additional lag in the pricing actions, we are estimating Q4 EPS to approximate $0.64, a strong increase of 18.5% versus the prior year. I guess, Sean, to start off, I know it's obviously early to detail fiscal '23 expectations and things are still fluid, but perhaps you can at least give us a bit more color on how Conagra maybe sort of hedged on some key inputs as we go into fiscal '23, more so we have a sense of your level of visibility to the cost profile, and therefore, maybe the time that you have to try and better match inflation with pricing as you move forward. It is undoubtedly the by-product of 7 years of heavy lifting to modernize this business, and it matters a lot because it's given us the ability to take meaningful inflation-driven pricing, and it enabled us to maintain consumer loyalty even after taking price as evidenced by the modest elasticities we've experienced."
}