{
    "symbol": "PAYC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 20:54:09",
    "content": " Our 2022 first quarter revenue of approximately $354 million came in very strong of 30% year-over-year and was well ahead of the expectations, thanks to strong growth in recurring revenue from new business sales and modestly better revenue from seasonal forms, filings and adjustments. Your line is open. Your line is open. Your line is open. They're already in a conversion mode and so there's a little bit difference there in how we work with one or the other, but we're also getting a lot better at deploying, making those conversions and helping the client set up their data sets that they have to feed into Beti in order to make it work for them payroll after payroll. Your line is open. And so all the that's to say is that it would've been odd with at the time that that happen that we would've converted all these businesses overnight because, we're not going to do unnatural things to bring in clients without them understanding what they're buying and how the value is created, because it's important for us to retain them in order for us to really generate revenue and especially margin and adjusted EBITDA from them. Your line is open. I've been on these calls and listened to different competitors calls and I'll hear them announce a product and two years later they have 300 clients on it, where, we put this out in July to all clients and put it in all quotes and we're already at 10,000 and over a quarter of our clients and so that's very good and as you get version one done, you shift quickly and version two, version three, version four, you're never done developing products and so we're continuing to enhance the products we have to have greater usage on them, and that leads to other products which will continue to roll out through this year. Your line is open. And so I do know that sales retention is higher than what it's been, but sales retention always remains a challenge because we have aggressive goals and there's a lot to sell as you go through -- as you go through these products, but I would say well, for sure it's improved some, but a lot of that just has to do with the people hitting executive rep even faster than what they've done in the past. Your line is open. Your line is open. Your line is open. Your line is open. Where you would see a impact would be on current clients that are converting over and it's kind of a mixed bag on how long that conversion might take them, because of the data sets that have to be loaded into Beti that might exist outside of our system, such as they're doing commissions and the way they calculate commissions is in a completely different system than Paycom and they're fed in. Your line is open. So what I said it was either equal to or greater than, and then what's been driving our retention for the last three, four years has been usage of the product and clients actually getting the return on investment out of the product as more and more employees continue to have a direct interface with the database and skip the middle person on it and that's really what's driving that usage. Your line is open."
}