{
    "symbol": "PAYC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 21:54:04",
    "content": " Our third quarter 2022 revenue of approximately $334 million came in very strong, up 30% year-over-year, with rapid recurring revenue growth driven by new business sales. Based on our strong financial results to date and expectations for the remainder of the year, achievement of our full year guidance for 30% revenue growth and 41% adjusted EBITDA margin puts us back into the pre-pandemic Rule of 70. Third quarter 2022 results were very strong, with total revenues of $334.2 million, representing growth of 30% over the comparable prior year period. Within total revenues, recurring revenue was $328.2 million for the third quarter, representing 98% of total revenues and growing 31% from the comparable prior year period. We expect adjusted EBITDA in the range of $560 million to $562 million, representing adjusted EBITDA margin of 41% at the midpoint of the range and a 120 basis point expansion from the prior year. For the fourth quarter of 2022, we expect total revenues in the range of $366 million to $368 million, representing a growth rate over the comparable prior year period of approximately 29% at the midpoint of the range. I would say that when it comes to the new sales offices, as we've always had, we've always had increasing -- increasingly more success with new offices than what we'd have with the past, just because the amount of product we're selling, the fact that we continue to go upmarket. I mean as I said in the past, I mean, I don't know it's about 4, 5 years ago, I said the first rep that sells $1 million in a year, we're going to name the award after them. If a deal start -- or let's even take this quarter that we just finished with the deal started at the beginning of July, we get 100% of the revenue dollars for that deal. But for us, it's really the new client adds onto our platform when they start and our expectation that there'll be -- we'll receive 100% of the revenue billing in subsequent quarters, fourth quarter being the next one."
}