{
    "symbol": "PAYC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 21:02:06",
    "content": " We ended 2022 with very strong results, and I'd like to thank all of our employees for the consistent hard work and execution that drove 4 consecutive quarters of revenue growth of 30% or more over the respective prior year periods. Our 2022 fourth quarter revenue of approximately $371 million came in very strong, up 30% year-over-year, bringing our full year 2022 revenue to $1.375 billion, also up 30% year-over-year. Fourth quarter adjusted EBITDA also came in very strong at $164 million, representing an adjusted EBITDA margin of 44% bringing our full year 2022 adjusted EBITDA to $580 million, representing an adjusted EBITDA margin of 42%. We ended the year with very strong results with full year 2022 revenue of $1.375 billion, up 30.3% compared to 2021. Fourth quarter results were excellent, with total revenues of $370.6 million, representing growth of 30% over the comparable prior year period. Within total revenues, recurring revenue was $364 million for the fourth quarter of 2022 representing 98% of total revenues for the quarter and growing 30% from the comparable prior year period. Paycom's annual revenue retention rate in 2022 was 93%, which was consistent with our recent 4-year average of 93% and up more than 200 basis points from the prior 4-year period average of 91%. Adjusted total R&D costs, including the capitalized portion, were $51.8 million in the fourth quarter of 2022 compared to $44 million in the prior year period. For the full year 2022, adjusted EBITDA was $579.7 million or 42.2% of total revenues compared to $419.3 million or 39.7% of total revenues in 2021, representing over 240 basis points of margin expansion. For the full year 2022, our GAAP net income was $281.4 million, or $4.84 per diluted share, up 44% year-over-year. For the full year 2022, our non-GAAP net income was $357.2 million or $6.14 per diluted share versus $260.4 million or $4.48 per diluted share in the prior year period, up 37% year-over-year. For the first quarter of 2023, we expect total revenues in the range of $443 million to $445 million, representing a growth rate over the comparable prior year period of approximately 26% at the midpoint of the range. I think the beat in the quarter, $18 million, 6% beat toward the higher end of what we've typically seen over the last 4 years. We don't really make assumptions of growth and/or downsizing within those -- within our current part -- across a 30,000-plus client base seems -- it tends to have averaged out over the last 25 years that I've done this with the exception of the 2020 -- some in 2021 time period."
}