{
    "symbol": "PAYC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 20:43:04",
    "content": " Our second quarter 2022 revenue of approximately $317 million came in very strong, up 31% year-over-year with continued strength in recurring revenue from new business sales. Second quarter 2022 results were excellent, with total revenues of $316.9 million representing growth of 31% over the comparable prior year period. Total adjusted gross profit for the second quarter was $268.2 million, representing an adjusted gross margin of 84.6% and we are on target to achieve strong full year adjusted gross margin of approximately 85%. For the third quarter of 2022, we expect total revenues in the range of $327 million to $329 million, representing a growth rate over the comparable prior year period of approximately 28% at the midpoint of the range. And so, we believe that with greater usage of Beti done the right way, it changes the employee experience, it changes their expectation of what they would expect that any employer that leads to more leads for us that leads to greater satisfaction for clients, which ultimately also leads to less service on our end as clients experience the self-service opportunities. I would say comparison very similar to every past year with the exception of when we added on to our inside sales business, which are for more of your emerging businesses, those companies that have less than 50 employees, that group represents approximately 5% of our overall revenue. Well, as we've said, I mean, for us, it's really the new business sales are really going to be what's driving quarter-to-quarter, and then it does matter when they start. And then also, all those clients employees will be used to Beti and as they go to other companies in the market, as a normal flow of an employee lifecycle goes from one company to the next, we believe that generates even greater leads for us, as we've been seeing now. I also think it makes everyone take pause, and everybody's got to make sure they have the right plan for their clients as we're all in this same world together, and -- so I think as you see those kinds of things, I know that we looked at everything ourselves."
}