{
    "symbol": "NEWT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 15:07:14",
    "content": " Most of today's call will focus on our final financial results as a BDC, as well as our forward projections as a financial holding company extremely important, as well as a dividend declaration that the company just made for its first quarterly declaration as well as a potential forecast of dividends going forward. I think it's also important to note that as we go forward as a financial holding company, and we transition certain assets like Newtek Merchant Solutions, Newtek Technology Solutions, the valuation of the payroll company, the insurance company, which were part of NAV from a fair value basis will not be counted in tangible book value from an accounting perspective going forward. One of the benefits of our new structure as a financial holding company is greater diversification of revenue streams, and less of a dependence in gain on sale income, which has been I would refer to it as non-reoccurring income, but a reoccurring event, we've had gain on sale for 20 years, it's pretty predictable, we make a loan, we sell 75% of it in the form of government guarantee into the street and a pretty good game, which was what enables us to get returns in equity net of charge offs of 30% in our business. But I think it's important to note that a lot of what we did in the fourth quarter of 2022 was positioning ourselves from a capital perspective and a financial perspective to become a financial holding company, as we anticipated closing the bank deal on January 6. I think the way we look at things, on a going forward basis, we're pleased to say as we sit here today, we have put out an estimate of sort of where we stand with a very well capitalized bank, which will go through that, with a very well positioned financial holding company. On Slide number 10, as of February 17, that was our track record versus the S&P and the Russell, I guess the market is enjoying the fact that we're being able to, A, execute on our plan, be recognized by the Federal Reserve's and accept their application and allow us to be a bank holding company, with financial holding company designation. I think, the important aspect of this slide is to see the breakdown of income coming from the bank versus non-bank entities up with the holding company, everything will consolidate up but you could see that, it's reasonably well balanced. Obviously, the bank's kept the 7(a) business, the 504 business to conforming this, but you can see that the other business lines up with the holding company will be important to us and substantial, as well as the things that we can do from it from that activity for our clients. The advantage of the non-conforming loan portfolio which we'd see on slide 38, is we typically originate these loans, 3.5 origination points, 100 basis points in servicing income that'll go into the bank, origination fees will go into the bank and loans will be funded up at the bank holding company through the JV or the holding company's balance sheet. So we're looking forward to reporting for the first quarter of 2023 tangible book versus NAV, the major differences I talked to you about before, there's about $170 million of value between the market value of the Payments Business, Tech Solutions, business, payroll and insurance that are winded going into the financial holding company, it will go into the basis of plus or minus zero versus a fair market value on NAV. On Slide number 41, from an investment summary perspective, we would love the market to focus on us a financial holding company that we operate a little under 60 days, well capitalized entity that our first rodeo, been a public company for 22 years, we've been able to manage all different in trade environments, credit environments, these projections are based upon what we've been able to do in the market with assets that are really generating higher returns risk adjusted than what a normal bank does. And I think that's going to really help tell a story of a bank that's different, a financial holding company that's different and a company that's positioned to take advantage of the future, providing financial and business solutions to this particular important demographic."
}