{
    "symbol": "NEWT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 11:41:15",
    "content": " Moving to slide number four; one of the things I think that's real important is we've developed our business model and have been able to deliver metrics that are superior to our competitors, particularly based upon the homegrown technology. What is that that's the NewtekOne Dashboard, NewtekOne Dashboard is trademarked and we've filed a preliminary patent on the dashboard as well, the value of the dashboard to a business owner, first thing is relationship and connectivity, they will be able to relate to a licensed insurance agent, a payment specialist, deposit specialist, a Lending Officer, a tech specialist, all silos and value that we give to our clients, they'll be able to connect, just as you see me here on the screen today talking to you. However, you could see that our definition of banking and business solution entails payroll, securing deposits, providing security for important documents, website traffic, being able to move money around real data on payment processing, Visa versus Master debit versus credit, this day, this year, this day, last year, this quarter, this year, this quarter last year, and it's going to be a dashboard for business owner, that will be a terrific tool. I don't think people fully grasp the fact that the data point of funding $163 million of 7(a) loans versus $104 million in the previous quarter, which also was a record is just pretty remarkable. Switching to loan categories, which we do at one of our portfolio companies, Newtek Business Lending, a wholly owned controlled portfolio company closed $31 million of 504 loans for the quarter recently ended an increase of 67% over the same quarter in the in the year-prior. So, when you think that the $3.47 adjusted NII from last year, and you take out a revenue component, because the expense hasn't changed our ability to generate adjusted NII through the first quarter, a $0.65 dividend in Q1 which is paid out of earnings, a forecasted 75% dividend in Q2 equaling $1.40 of dividends, you would think that we always intend to pay the dividend out of earnings, we're on a pretty good course for the first six months of the year. The metrics that we've delivered in the first quarter are indicative about that, as well as how well we perform during the pandemic, particularly in 2021, doing 15,000 PPP loans, as well as $540 million to $550 million of SBA 7(a) loans, a record number of funding, and clearly a record number of units. Let's go through the portfolio company review, 504 Program, so we talked about $31.4 million of closed loans for the quarter up from $18.8 million and we're projecting a 66.5% increase for the year. Distribution from portfolio companies for the first quarter 2022 totaled $7.8 million, which included $4.5 million from NMS, $1.5 million from MTS, $525,000 from NBL, our 504 business, and $1.3 million from NCL, our conventional loan joint venture, as compared to non-distribution from portfolio companies in the first quarter of 2021."
}