{
    "symbol": "NEWT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:46:02",
    "content": " We'll also talk about in this call, the lack of $50 million of fee income from PPP in 2022 versus 2021 comparison, as well as a change currently for the first 9 months of this year for gain on sale margins to come in about three points less than they were in 2022. We have over one -- actually its over $2 million -- 2 million referrals that we've historically gotten, three NewTracker, it's about 75,000 a quarter. Getting those lending agreements back in place as well as having this tremendous headwind of no PPP fee income and a three point differentiator on if you round it to 800 million, there'll be 600 million of gain on sale, that's almost $18 million of profits, or about $0.72 a share. If you go to bank rate, which is typically where the higher cost of bank deposit money is going to, you're looking at 3.5%, 3.25%, 3%, 4%, that's a pretty good NIM, particularly given that 75% of the loans in the 7(a) business have a big premium for gain on sale. As we've talked about, we believe very strongly that the best opportunity for Newtek Business Service Corp. future NewtekOne will be to unlock the value of its technology thatâ\u0080\u0099s built over 19 years, which will be much easier to do and display as a bank holding company and offer much greater rewards to its current customer base. Other income increased by $1.8 million in the third quarter of 2022 compared to Q3 2021, resulting mainly from a year-over-year increase in SBA 7(a) loan origination volume. Distributions from portfolio companies for the third quarter of 2022 totaled $7.2 million, which included $4.35 million from NMS, $1.65 million from NBL our 504 business, $360,000 from NCL, our conventional joint venture, $720,000 from AMS, and $150,000 from Mobil Money, and that is compared to the third quarter of 2021, where there were no distributions from portfolio companies. Total expenses for the third quarter of 2022 increased by $4.3 million compared to Q3 2021, mainly driven by higher interest related costs and increase in SBA 7(a) loan referral fees due to higher loan origination volume and loan origination processing costs. In addition, these are times where you've got the bank lenders that were tripping over themselves to do loans, a 2.5% to 3% rates, or 3.5%, all of a sudden, they're like, risk off, they don't want -- they don't really want to put money out there."
}