{
    "symbol": "DCI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-31 14:31:03",
    "content": " On-Road sales of $35 million were up 5% from the prior year, excluding currency sales were up in all major regions with the exception of Asia Pacific, or general market weakness continues to weigh on results. Proprietary product performance continues to be a very important driver and fourth quarter aftermarket sales of PowerCore were up 30% year-over-year, in line with performance in the third quarter. In Aerospace and Defense, sales of $35 million were up 21% year-over-year with strength and replacement parts as we continue to benefit from the recovering commercial aerospace industry and market share gains. In conclusion, our fourth quarter sales and earnings were a high watermark in the company's history, and I look forward to carrying that underlying momentum forward into fiscal 2023 Although there are many puts and takes as we think about our outlook for 2023, which Scott will discuss in a minute, we are forecasting another year of record revenue and record earnings. To summarize the quarter, sales grew 15% operating income was up approximately 19% and EPS of $0.84 increased 27% year-over-year. Operating expenses, as a percent of sales was 18.0% favorable by almost 200 basis points over prior year, driven primarily by leverage on higher sales. For the first time this fiscal year, Engine pretax profit margin at 16.6% was up 90 basis points year-over-year, as our pricing efforts throughout the year began to offset cost pressure in the segment. On the industrial side, pretax profit margin was 17.8% up 50 basis point versus prior year, rebounding from a year-over-year decline in the third quarter. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And certainly, our opportunities there are going to drive our revenue growth, this year was probably a little bit unusual with 30% growth local currency in the fourth quarter in Off-Road and almost 30% in local currency for the full year. Your line is open."
}