{
    "symbol": "DCI",
    "quarter": 1,
    "year": 2022,
    "date": "2021-12-01 12:52:14",
    "content": " We grew our sales to seven hundred and sixty one million dollars, sales were up twenty percent and EPS was up twenty six percent versus last year. With that said, we are raising our top and bottom-line guidance for fiscal twenty twenty two based on a few factors; first quarter results, higher sales expectations driven in part by incremental pricing and operating expense leverage. 4:58 Total sales were seven hundred and sixty one million dollars, which is up twenty percent from last year, due in part to last year's softness related to the pandemic. In Engine, total sales were five hundred and twenty seven million dollars, up twenty one percent with our first-fit businesses leading the charge once again. 06:00 In On-Road, first quarter sales were thirty two million dollars or down one point five percent year-over-year. In Engine Aftermarket, sales in the first quarter were three hundred and seventy four million dollars, an increase of eighteen percent from the prior year. 08:04 Moving to Aerospace and Defense, first quarter sales of twenty eight million dollars were up twenty three percent year-over-year as the commercial aerospace industry rebounds from the pandemic related pressure a year ago. 09:49 First quarter sales of Special Applications were fifty two million dollars, up 23% with strong contributions across our product portfolio, including notable increases in our disk drive and membranes businesses. First quarter sales of Gas Turbine Systems or GTS were approximately seventeen million dollars, down twenty eight percent to almost entirely to timing of orders. First quarter sales grew twenty percent, operating income was up twenty three percent and EPS of zero point sixty one dollars was twenty six percent above the prior year. First quarter operating expense as a percent of sales was favorable by approximately one hundred sixty basis points, driven primarily by volume leverage. Inventory this quarter were up sixty million dollars sequentially and one hundred and fifteen million dollars year-over-year, mainly due to the impact of inflation, a commitment we made to increased levels of inventory to ensure we're adequately prepared to meet demand and supply chain challenges we have had internally with our customers on order deliveries. 19:11 Based on our updated forecast, we plan for a new EPS record of between two point fifty seven dollars and two point seventy three dollars, implying an increase from last year's adjusted EPS of eleven percent to eighteen percent."
}