{
    "symbol": "OII",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 17:06:14",
    "content": " Our consolidated adjusted EBITDA of $233 million was above the midpoint of our guidance range and year-over-year adjusted EBITDA growth was led by significant improvements in our Subsea Robotics or SSR and Offshore Projects Group, OPG segment results. Today, I will focus my comments on our performance for the fourth quarter and full-year of 2022, our market outlook for 2023, Oceaneering's consolidated 2023 outlook, including our expectation to generate positive free cash flow in the range of $75 million to $125 million and EBITDA in the range of $260 million to $310 million and our segment outlook for the first quarter and full year of 2023. Consolidated revenue of $536 million was 4% lower than in the third quarter, with revenue increases in our manufactured products and Aerospace and Defense Technologies or AdTech segments, being more than offset by revenue decreases in our other operating segments, particularly OPG. Our consolidated adjusted earnings before interest, taxes, depreciation and amortization or adjusted EBITDA of $70 million was above the midpoint of our implied guidance range provided at the beginning of the fourth quarter and was slightly higher than consensus estimates. Good operating cash flow, working capital efficiencies and capital expenditure discipline allowed us to increase our cash position by $141 million during the fourth quarter of 2022. 2022's improved results were primarily due to positive energy markets that spurred increased offshore activity in our SSR and OPG segments, which realized improved pricing and increased utilization in the second half of the year. Compared to 2021, our 2022 consolidated revenue increased 11% to $2.1 billion, with revenue growth in our OPG, SSR and Manufactured Products segments being partially offset by revenue declines in our IMDS and AdTech segments. Consolidated 2022 adjusted operating income of $111 million and adjusted EBITDA of $233 million improved by $38.8 million and $22 million, respectively, with significant gains in our SSR and OPG segments being partially offset by declines in our AdTech, IMDS and Manufactured Products segments. Our SSR and OPG segments achieved meaningful year-over-year improvement with a combined revenue increase of 21% and a combined EBITDA improvement of $38.5 million, as compared to 2021. Based on year-end 2022 backlog, the expected meaningful increase in backlog conversion, anticipated 2023 order intake and current market fundamentals, we are projecting our 2023 consolidated revenue to grow by more than 10% with increased revenue in each of our operating segments, led by manufactured products and SSR. We expect sequential improvement in our 2023 financial results based on our expectations for higher operating income and higher margins in our SSR, OPG and Manufactured Products segments, slightly higher operating income and stable margins in our AdTech segment and relatively stable operating income and margins for our IMDS segment. For the year, we anticipate generating $260 million to $310 million of EBITDA with incremental improvement over 2022, coming primarily from our SSR and OPG segments. Considering this and anticipated project timing leading to higher levels of utilization in the second and third quarters, we are forecasting our first quarter 2023 adjusted EBITDA to be in the range of $40 million to $50 million."
}