{
    "symbol": "TXRH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 22:15:21",
    "content": " Thank you, Mr. Morgan. Yes, I think if we look back at the last five years, and we've doubled from there, the way we see it, with the gross growth of our existing restaurants and our continued sales escalations, we definitely feel like that isn't attainable with the three concepts and the trends that we currently can model out. So yes, sales that percentage probably comes down from there, as we start to lap some more normalized numbers, but I think we still have opportunity to grow whether that's 146,000, something more around that range we will see, but we've certainly shown that we're able to generate that level inside our restaurants. We're still obviously in the first quarter rebuilding the hours from the Omicron impact of last year, staffing has gotten much stronger and it's getting to a levels we need. Thank you very much. Thank you very much. So it was you know, deals that were already expected to be pretty late in the year, but just realistically look like they're going to slip into early next year, but again, would not really change that store week growth number. Thank you very much. There's the rents and everything else, but we've probably seen -- you can't just look at the total costs and do the math one over the other because, again, where the restaurants open one year versus the next can have an impact on building costs and rents. Thank you very much. In sort of context, you can provide -- if you think about Omicron impact from January leaves there's also a calendar shift last year from Valentine's Day in Super Bowl just sort of trying to get at the underlying trends here for the first part of the year would be my first one. I'd say there still is opportunity and really, every year there's new restaurants that kind of start to qualify as potentials -- potential ones for us and look at either they've grown their volumes enough to be considered or they've been open long enough. Thank you very much. Thank you very much. Thank you very much. I just want to say 30 years ago, tomorrow, we opened our very first Texas Roadhouse and I couldn't be more excited and proud of what this company has accomplished as we're over 700 restaurants and three concepts. Thank you, Mr. Morgan. Thank you very much."
}