{
    "symbol": "ARAY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-02 21:18:04",
    "content": " I would like to start by thanking our global cross-functional team who executed with dedication to deliver a solid first quarter of fiscal 2023, despite ongoing challenges including supply chain shortages, the COVID 19 lockdown in China, the war in Ukraine, global inflationary pressure, and FX headwinds in our non-U.S. markets. Total revenue for the first quarter was $96.5 million, which was down 10% compared to the prior fiscal year, mainly driven by supply chain constraints at a $5.8 million foreign exchange headwind on a constant currency basis. Product revenue for the first quarter was $44.6 million, which was down 15.4% from prior year and down to 11.4% once adjusted to the impact of FX compared to tough comparisons in Q1 last year when product revenue grew 69% due to pent-up demand after COVID delays. Service revenue for the quarter was $51.9 million, which was down 5% from prior year, but up 1.7% once adjusted for the impact of FX, which had a $3.7 million impact. Growth orders for the first quarter were $69.8 million, which was flat from prior year and up 6.5% or $4.7 million once adjusted for the impact of FX. We ended the first order with backlog of approximately $538 million, which is 10.7% lower than prior year due to $51 million of order backlogs that is aged beyond 30 months within this quarter, mainly driven by customer installation delays. Our overall growth margin for the quarter was 35.9% compared to 36.8% in the prior year, which is a decrease of 90 basis points driven by unfavorable product mix, continued product cost inflation and service FX impact, which was partially offset by improved service margins with signals that are pricing and cost discipline actions are taking shape in the service business. Adjusted EBITDA for the quarter was $1.9 million compared to $5.4 million in the prior year, primarily due to lower revenue, which had an impact of $5.8 million on the top line and higher than expected FX impact, particularly in Japan and EMEA. While we are doing everything we can to manage through the supply chain challenges and the current foreign exchange environment, FX impact alone were 5.8 million negative impact to our top-line compared to where exchange rates were last year in our non-US markets. Thanks for taking the questions. Thanks for taking the questions. Thanks for taking the questions. Thanks for taking the questions."
}