{
    "symbol": "SIFY",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-25 12:30:24",
    "content": "  Operator: Good morning, and welcome to Sify Technologies Financial Results for Third Quarter and Fiscal Year 2022 to 2023. . I'm joined on the call today by Raju Vegesna, our Chairman; M. P. Vijay Kumar, Executive Director and Group CFO; and Kamal Nath, CEO. Alternatively, you may obtain a copy of the release at the Investor Information section on the company's corporate website at www.sifytechnologies.com/investors. Sify's results for the year are according to the International Financial Reporting Standards or IFRS, and will differ somewhat from the GAAP announcements made in previous years. Before we continue, I would like to point out that certain statements contained in the earnings release and on this conference call are forward-looking statements rather than historical facts and are subject to risks and uncertainties that could cause actual results to differ materially from those described. These risks include a variety of factors, including competitive developments and risk factors listed from time to time in the company's SEC reports and public releases. Those lists are intended to identify certain principal factors that could cause actual results to differ materially from those described in the forward-looking statements, but are not intended to  a complete list of all risks and uncertainties inherent to the company's business. India's resilience demonstrated post-COVID has formally established, it has an economy that is not easily disturbed by changes in the business enrollment. The government's larger agenda of ensuring that social measures reach the intended beneficiaries is a work in progress, and we'll continue to drive the domestic IT demand. Let me now bring in Kamal, our CEO, to expand on some of the business highlights for the past quarter. Enterprise priorities are building business aligned digital models, enhancing end-user experience, deploying resilient business continuity models and mitigating security risks. Our Data Center and Cloud Services, Digital and Network Services are all important building blocks to enable customers' business priorities. The revenue split between the businesses for the quarter was Data Center Colocation Services at 27%; Digital Services at 35% and Network Services at 38%. As on December 31, 2022, Sify provides services via 846 fiber nodes across the country, an 11% increase over the same quarter last year. During the quarter, Sify has invested in start-ups in the -- U.S. dollars in the Silicon Valley area as part of our corporate venture capital initiative. Let me bring in Vijay, our Executive Director and our Group CFO, to elaborate on the financial highlights for the quarter. Let me briefly sum up the financial performance for the third quarter of financial year 2022, '23. Revenue was million, an increase of 31% over the same quarter last year. EBITDA was INR 1,619 million, an increase of 3% over the same quarter last year. Profit before tax was INR 227 million, a decrease of 52% over the same quarter last year. Profit after tax was INR 258 million, a decrease of 25% over the same quarter last year. We have scaled up investments, both capital expenditure and operating expenditure in our fiber network in select metro cities to scale our network business and in people for our Digital Services business. Cash balance at the end of the quarter was INR 4,256 million. And as I mentioned, it is also due to operating expenses, investment in our network fiber expansion in select metro cities. As you know, these infrastructure businesses require continuous investments for us to scale on both revenue and profitability. I don't want to sound forward-looking, but we believe that we have made investments over the last few quarters. So there were some seasonal aspect to it with respect to the completion of the project and the recognition of the revenue, during the quarter. And of course, we are also seeing -- Yes, so the other aspect is that we are also seeing increase in business acquisition on the digital services space. And as Vijay was mentioning, we are continuously investing in and around Digital Services. These projects take a lot of time because these projects are very transformational in nature, which includes, of course, the technology introduction service as well as bit of managed services as well as cloud services. So we may see -- irrespective of the business acquired, we may see such seasonal revenue recognition increase based on the time line of the project implementation. But you still feel good about the pipeline of demand... And then in terms of the capital from Kotak, how much of you've drawn from Kotak and how much remains outstanding? In the fiscal year ending March '23, the incremental capacity will be small, but there are 3 greenfield projects which are presently under construction at 3 major cities: Mumbai, Delhi, which is Noida and Chennai. These are basically to access technology, which we can take it to our enterprise customers in India, in their journey for digital transformation. And then just lastly, the revenue -- the data center revenue, the growth was a little bit lower than I was expecting and it was actually down a little bit, I think, sequentially. The last quarter, we had some onetime capacity delivery revenue, which accrued to us."
}