{
    "symbol": "MDNA",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-15 15:13:19",
    "content": " Key objectives of the trial are therefore to identify a recommended Phase 2 dose during the dose escalation stage of the trial; and subsequently, build a body of clinical evidence that demonstrates MDNA11's potential as a best-in-class IL-2 agonist during the dose expansion portion of the ability study. Finally, a patient with pancreatic cancer also achieved tumor control in the fourth dose escalation cohort, where MDNA11 is administered initially at 30 micrograms per kilogram for the first two doses, followed by a step-up dose of 60 micrograms per kilogram. A melanoma patient, who progressed following two lines of immunotherapy, also achieved durable stable disease for over nine months, having entered the study at the low dose of only 10 micrograms per kilogram, which is the second dose cohort, and subsequently escalated to the 30 micrograms per kilogram, and more recently, to the 60 micrograms per kilogram dose levels. We are eagerly awaiting the results of the next scan for the pancreatic cancer patient, with the unconfirmed partial response to determine if it is confirmed, along with the scans of four additional patients from dose level four in the 60 microgram per kilogram dose cohort that have yet to receive their first scan at 12 weeks. Based on this information, we amended the trial protocol to ensure that subsequent patients will have baseline lymphocyte counts that are higher and more in-line with what we would expect to see MDNA11's dose expansion portion of the ABILITY study. This amendment went into effect with our fifth dose escalation cohort, which evaluates patients receiving two 30 microgram per kilogram priming doses of MDNA11, followed by step-up to a fixed 90 microgram per kilogram dose. Given the early signs of clinical activity we've seen with lower doses of MDNA11 in patients with highly immunosuppressive tumors, we are very much looking forward to data from this and subsequent cohorts, where we hope to see more meaningful signs of efficacy. We have thus far seen favorable safety profile, total stimulation of anti-cancer lymphocytes, without activation of pro-tumor immune cells and encouraging signs of anti-tumor activity in patients with difficult to treat tumors that have been unresponsive to prior therapies, including an unconfirmed partial response in a heavily pretreated pancreatic cancer patient. We're seeing that as we escalate, the third, fourth doses subsequently, even if we are at a higher dose tend to be much better tolerated, and therefore allows us to leverage all the benefits of MDNA11, without prematurely creating a situation that the first dose essentially makes the patient ineligible for additional treatments. In the earlier dose cohorts, we did not have a threshold, we allowed patients with any kind of baseline lymphocyte counts to be in the study, that meant we had patients largely with baseline counts in the 300 to 800 counts per microliter, which is, in some cases, less than half of the normal range."
}