{
    "symbol": "MDNA",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-07 12:44:05",
    "content": " Earlier this morning, we announced that the Phase 1 portion of the ABILITY trial advanced to a sixth dose escalation cohort, where patients will receive a target dose of 120 micrograms per kilogram every two weeks. We do however, plan to take a different approach to enrollment for the Phase 2 expansion portion of the trial, where the objective will be to not only demonstrate safety in approximately 40 patients, but importantly, evaluate the efficacy of MDNA11 in patients with less advanced cancer and tumor types that are most likely to benefit from our IL-2 Superkine. Therefore, rather than enrolling patients with a dozen or more disparate tumor types, which has been the case with the Phase 1 portion of the ABILITY study, the Phase 2 portion will only focus on two or three different cancer populations that better reflect MDNA11â\u0080\u0099s target addressable population. Our current projections have us reporting data from ABILITYâ\u0080\u0099s six and potentially the final dose escalation cohort, together with early antitumor activity data on the Phase 2 dose expansion cohort in the third quarter of this calendar year. Needless to say, we have, I think, if you recall, between the first three cohorts where the doses were below 60 micrograms per kilogram, we still saw patients with stable disease, including a patient that continues to be treated in cohort two, who started at 10 micrograms per kilogram where the lymphocyte count or the baseline lymphocyte count was not necessarily set at 1,000 per microliter. And based on the safety windows that we saw in non-human primates, as well as where we saw the threshold occurring in non-human primates, I would say that the current dosing regimen that we are enrolling patients in which is the cohort six at 120 micrograms per kilogram is pretty much close to where weâ\u0080\u0099re expecting this to plateau. As you know, we saw pretty impressive results at studying at cohort four and for 60 micrograms per kilogram dose so far weâ\u0080\u0099ve had, as you know, the data we have shared of just seven patients that have received more than 60 or 60 micrograms per kilogram or higher. Well, itâ\u0080\u0099s not as you know, healthier patients is based on the healthier immune system, certainly, in cohorts five and six, you end up with patients with sort of a baseline lymphocyte count that is higher than what we enrolled in cohorts one, two and three. Well, I think the key thing here is, of course, the range of tumor types weâ\u0080\u0099ve already treated is, as I said, about a dozen or so, trying to generate data on three different tumor types in a cohort of maybe three or six patients is unlikely to provide you with certainly any trending data."
}