{
    "symbol": "MDNA",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-04 15:25:40",
    "content": " While this portion of the study is designed primarily to evaluate safety and pharmacokinetics and pharmacodynamics in order to determine a recommended Phase 2 dose, we have nonetheless have clear evidence of MDNA11's monotherapy efficacy in tumors that are typically highly resistant to immunotherapy, an important finding at this early juncture of the trial. In fact, we are not aware of any published data showing efficacy with systemic administration of an IL-2 monotherapy in pancreatic cancer, we therefore view MDNA11's ability to generate a confirm partial response in a such a heavily pretreated and stage patient as an important finding that differentiates it as a potentially best in class is to agonist and bodes well for the program moving forward. In addition to the confirm partial response, we have observed tumor control in four other patients in the ABILITY study's low and mid-stage dose escalation cohorts for an overall tumor control rate of 36%. Collectively, these anti-tumor activity data from ABILITY's early and mid-stage cohorts, a full overview of which can be found in a streamer spot online in our corporate deck provide a robust demonstration of MDNA11 single agent potential in advanced solid tumors, unresponsive to establish treatments, including 79% of the patients with prior failed checkpoint inhibitor therapies. Again, in the dose expansion phase of the study, we would expect patients that have not gone through three, four lines of prior therapy, there would certainly be patients who would be eligible for studies where the recommended phase 2 dose has been established in sort of typically phase 2 settings, particularly in terms of our design of where the patients might benefit the most. And if we sort of go back to data from earlier studies of Proleukin, and other competing clinical trials with competing IL-2 programs, we've generally found that the baseline lymphocyte counts in those patients have generally been between 1,000 and 2,000 lymphocytes per microliter. However, when we look at the sort of the peak lymphocyte count, we've seen data from certain studies where Proleukin has shown that when the peak lymphocyte count increases above 3,000, there is a higher probability of patients responding or having stable disease versus those patients that do not get to the 3,000 threshold."
}