{
    "symbol": "STBA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 17:27:06",
    "content": " Core net interest income, excluding PPP, increased $0.7 million compared to the fourth quarter as short rate increase at the very end of the quarter and we saw a better asset mix with higher average loans and securities and a decrease in cash. We're well positioned to benefit from rising rates with over 50% of our loans indexed to LIBOR, SOFR or PRIME, favorable impact was only about $0.5 million in Q1, but we expect that to expand as we had a full quarter of 25 basis point move from March and with the anticipated additional rate moves this quarter. We still expect expenses to be in the $49 million to $50 million range for the quarter going forward as we continue to make investments in our business and fee expenses being under some pressure, particularly due to the tight labor market. So you talked about the $7 million annualized on the asset side being the initial benefit, I think last quarter, you mentioned that may build up to $9 million over time as floors are reached. I mean we look at the -- we kind of bifurcate that fee income line item, and there's lots of variability in the mortgage piece and watching and monitoring and focusing on growth on the true customer activity when you think about debit card treasury management fee income, those sorts of things, that sort of activity level is an important one for us and the key metrics that we're focused on. Again, we're not targeting a specific time frame to hit, but I think you're right, we still have $750 million of cash and even and with a little bit lighter loan outlook, we're looking at potentially up to 2 years at that pace before we would naturally cross. So we tend to run a lot of different scenarios just to understand where our pressure points are on the beta side, the one thing that is different for us last time around versus this time is, one, just our balance sheet mix is different, especially on the liability side where last cycle, we had almost $1 billion worth of short borrowing debt and we were a net borrower."
}