{
    "symbol": "STBA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 15:05:25",
    "content": " I would now like to turn the call over to Chief Financial Officer, Mark Kochvar. Before beginning the presentation, I want to take time to refer you to our statement about forward-looking statements and risk factors, which is on the screen in front of you. You can obtain a copy of those slides by also clicking on the Earnings Supplement link on your screen or also on the website under Events and Presentations, Third quarter 2022 Earnings Conference Call, click on the Third Quarter 2022 Earnings Supplement link. With me today are Chris McComish, S&Tâ\u0080\u0099s CEO; and Dave Antolik, S&Tâ\u0080\u0099s President. Before I get into the numbers and then turn it back over to Mark and Dave for some more details, I did want to briefly emphasize to you all the progress that we continue to make building this company to deliver for both our shareholders, customers and our employee base. Over the past four quarters or five quarters, we have been on a steadfast journey and our strategic focus around strengthening the foundation of S&T, built over 120 years and rooted in our distinctive customer trust, all of this with an eye to sustainable, profitable top tier growth and performance. I am pleased to report that we continue to make great progress, making progress both in building and enhancing our leadership team, with an important blend of S&T legacy knowledge, as well as outside industry expertise. Our leadership team clearly understands that we are the current stewards of this 120-year legacy of great customer trust and strong employee engagement, and as I mentioned in our press release, award winning on both fronts. While thereâ\u0080\u0099s always work to do, which we do embrace in our energized by and the environment remains uncertain, I couldnâ\u0080\u0099t be more pleased with the progress that we have made and optimistic for our future. Now let me go ahead and turn to the numbers and I am on page three in the deck and as you can see, $37 million in net income, which is a 28% increase in EPS for the quarter, records on both front. For the fifth straight quarter, we have had meaningful asset quality improvement and our return metrics have led to another increase in our dividend, the third in the last five quarters, up to now $0.31 per share. Turning to page four and before I turn it over to Dave for more details, you will see that our loan growth in the majority of our portfolio -- is it -- we see loan growth in the majority of our portfolios with some contraction that also does have an asset quality focus. And on the deposit front, there is some contraction on a linked basis due to some seasonality, as well as the rate environment. As presented on slide four, we realized overall loan growth of nearly 4% for the quarter. By category, we saw increases in all consumer loan types and in our C&I balances. With regard to C&I activity, our aggregate total revolving commitments grew during the quarter, along with the total number of commitments. This growth, coupled with a 1% increase in utilization rates to 44% when compared to Q2 resulted in balanced growth of $20 million. We did experience declines in our CRE and construction portfolios during Q3 and we expect to see continued pressure on the construction portfolio as demand has declined due to increased interest rates, rising construction costs and most particularly availability and cost of labor. In the permanent CRE book, we saw normal course payoffs related to property sales and permanent market financing, along with several exits of negatively rated loans or those in less desirable segments. Forecasting loan growth, given the current economic environment is certainly challenging, but we remain comfortable with our low single-digit guidance heading into Q4 and into early 2023. Shifting to deposits, we experienced an overall decline of $202 million in Q3 adding some color to the changes by category. On a point-to-point basis, demand deposit balance declines were primarily the result of activity in a handful of business customers. Additionally, interest-bearing demand, money market and CD changes were the result of market competition for those products and our active management of deposit costs. We are proud to announce that in August, we hired a new Director of Treasury Management, whoâ\u0080\u0099s focusing on product and sales capabilities in order to support our commercial and business banking relationships. Loan yields improved by 58 basis points, the asset mix improved with lower average cash and the cost of total deposits increased by just 18 basis points during the quarter. 51% of our loan portfolio is tied to short-term rates, which has been a big driver of the net interest income and net interest margin improvement. As part of our outgo strategy to protect the interest income and net interest margin in a declining rate environment, we have hedged that floating rate loan concentration to approximately 44% with received fixed swaps. We continue to evaluate the right level of hedging, which will depend on the rate environment and our deposit pricing experience. We expect the net interest margin rate to improve and to continue as short rates increase, but moderate due to a little additional improvement in asset mix, higher expected deposit betas and the execution of our hedging strategy. The largest item is a lower decline in the fair value of the assets in a non-qualified benefit plan, which relates to stock market performance and shows up in the other line. This was negative $0.4 million in the third quarter, compared to a negative $1.4 million in the second quarter, resulting in a $1 million quarter-over-quarter variance -- favorable variance. On retirees, improved revenue drove the efficiency ratios, as Chris mentioned, by over 4.5 percentage points to just above 50% and also resulted in positive operating leverage. We executed $3.5 million in buybacks during the third quarter and we will continue to look for opportunities depending on economic conditions, our financial performance and the price of our stock. The smaller securities portfolio as a percent of assets, strong earnings and a more efficient balance sheet, we have seen stability in our TCE ratio over the course of the year despite higher AOCI adjustments. At this time, Iâ\u0080\u0099d like to turn the call over to the Operator to provide instructions for asking questions. Please pose your question. Your line is live. Let me start on the NIM and deposits, we saw a decline, as you mentioned in the quarter. So, I mean, I think, we do think that the deposit betas are going to increase especially with the activity that is expected to have here in the fourth quarter with additional hikes in November and December as well. That has relatively little left to go as we move from the third quarter to the fourth quarter, so there only a few more basis points of benefit to be derived there. So we do expect that increase to possibly be half of what we have seen in the last couple of quarters, assuming that the Fed continues at the current pace. I mean, we have a history of operating at lower loan-to-deposit ratios. And then, I guess, related to the investments that you are making to strengthen deposit franchise that you called out, but the guidance has really been in a relatively tight range on a quarterly basis. On the expense side, we would expect expenses to be a little bit higher, both because of those investments and just the inflationary environment is a little tighter. We are also still in the process of planning, but would expect to make additional hires to support the deposit franchise, especially on the business side, where we see a lot of opportunities on treasury management. That will between working with core providers, other providers continue to enhance service offerings for our customers, be it online additional capabilities, both in the consumer side of our business and certainly in the commercial and the business banking side of the business. It looks like commercial real estate yields, in particular, have expanded a lot over the last couple of quarters. Is there -- I guess, how much of that is floating relative to fix in that portfolio and if you -- if thereâ\u0080\u0099s another reason for why those would be able to kind of increase so much in a short period of time. Now those are -- a lot of those have been swapped back to the customer, so that the customer has a fixed payment but itâ\u0080\u0099s floating for us. So that has helped in that where you might think of the CRE as being a fixed portfolio for us, itâ\u0080\u0099s probably 60% floating. We also have the benefit -- have had the benefit anyway of the received fixed swaps in there, which have been cash flow positive for the last couple of quarters. Please pose your question. Your line is live. I was wondering if you could spend a little bit more time, obviously, you guys are adding some to the reserve on a qualitative basis, as you mentioned in the prepared remarks and in the release. But as you guys think about, you talked a little bit about pipeline and the low single-digit growth expectation. And certainly, within the -- in the C&I book, within certain segments, we will continue to focus and look for growth. As I mentioned in the prepared remarks, we will feel some pressure and some challenges to grow the construction book and the permanent CRE book as well. I -- if you look at our franchise and the legacy growth that we have seen in Pittsburgh, we are certainly focused on continuing that and to grow out Western PA. Eastern PA is more of a CRE market, but we have also built C&I teams there as well. Where there are some vertical opportunities within the ABL world, we have added some exposure to our -- we have a small REIT book that we participate in. And then just lastly for me, just -- is there any -- as we think about -- you guys mentioned kind of the near-term expectation around non-interest income. But as we think to next year and beyond, I mean, the focus on treasury management and business banking. We are bullish in the underpinnings of our treasury management opportunities simply because of the current depth of relationships that we have and we think thereâ\u0080\u0099s latent opportunities within the book, both within our business banking space and somewhat in the C&I space as well. On the -- if you look at the slide, the wealth management income, that actually has held up pretty well if you think about it. Itâ\u0080\u0099s not transaction fees sort of remain flat in the market thatâ\u0080\u0099s down 20%, 25%. But in talking with our teams, our asset bankers that are focused there is there are really good alternatives for our customers in this ever-changing environment. And at the same time, we are on the right side of everything that we need to be doing from a customer experience standpoint relative to NSFPs  and things like that. There is a little balance of both, but big emphasis certainly on the business commercial side in the treasury management space. Please pose your question. Your line is live. So at the -- in the last month of the quarter, the kind of the overall deposit rates had ticked up a little bit to about 56 basis points. I mean, to-date, you have done a nice job kind of keeping the composition, non-interest-bearing deposits are 36% of the total CDs continue to come down. But we still think we are better positioned overall compared to last cycle, even though that cycle is very different in terms of how long it took. In that cycle, we have kind of hit the mid-30s with the better composition that you referenced, especially on the DDA side to extend our emphasis on the business side to maintain a lot of that. If we are successful with that, we would still expect our cumulative betas to be mid-20s to low 20s compared to that mid-30s in the last cycle. And then maybe along those same lines, assuming the Fed is done by early 2023 or wherever you choose them or assume that they stop. How far after that or how long after that, just given the asset-sensitive nature of the balance sheet, do you expect to see the NIM, perhaps, stop to -- stop increasing maybe even start to see some compression. Those are re-pricing higher and we expect that to continue, but itâ\u0080\u0099s nowhere near the impact that the float has. So, I mean, I think, it probably continues as long as they are flat. Thereâ\u0080\u0099s always going to be a little bit of pressure to price higher and depending on the competition, if we get back into a growth mode, us as well as others will be out there chasing deposits again. The area that I think a lot of folks are starting to have some concern with is resi development, just given the movement in mortgage rates from 3% a year ago to knocking on 7% today and the ultimate end consumers affordability of that same kind of project. We have a very robust review process that we use, and frankly, thatâ\u0080\u0099s why you have seen some of the reduction in the exposure, because we manage it tightly and itâ\u0080\u0099s just really tough to get something approved today to get it built on budget, on time, so this demand has declined and we would expect to see that decline continue. Please pose your question. Your line is live. Maybe just -- I missed the line utilization number that you threw out, Dave. It was 44% for Q3, up from 43% in the prior quarter. We troughed in the low 30%s, 32%, 33% during the pandemic, so we are at about the same utilization level that we were pre-pandemic. The one exception to that would be the floor plan portfolio, which has not recovered and itâ\u0080\u0099s half of what it was pre-pandemic. In Q3, as I mentioned, it was a combination of normal course and some payouts that were credit related and we took the opportunity to exit a few credits that we felt werenâ\u0080\u0099t within our risk appetite from a credit perspective at this point. I would define it as fairly quiet, and quite honestly, what we are -- we are focused on what we can control and very focused on delivering results and performance and building a currency that gives us an opportunity in the future. Operator, we have one question that we got through the online that we would like to go through. That question is, I think, that last time your net interest margin was above 4% was in 2010. Are there any structural or competitive reasons the NIM canâ\u0080\u0099t stay above 4% in a flat to higher rate environment or do you think that net interest margin will ultimately revert back to the 3.60%, 3.70% pre-pandemic level as funding costs play catch up. So that DDA percent in the mid-30s compares to probably mid-20s or low 20s pre-2010 and so if we are able to maintain those levels that we currently have, that should give us a much better structural opportunity to maintain that 4%. And then also the higher level of deposits and keeping that loan deposit below 100, certainly, if not lower, should allow us to stay away from in that higher rate environment will be higher cost wholesale fundings to finish up that gap. At this time, I would like to turn the floor back over to S&T Bancorpâ\u0080\u0099s CEO, Chris McComish, for any closing remarks. I am really proud of this leadership team and our employee base, what we are doing every day to take care of customers and we look forward to being back with you in another quarter, if not between now and then."
}