{
    "symbol": "RHP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 13:30:21",
    "content": " I don't think in all of my years in this industry, I've seen anything like the last 12 months, going from just under 33 points of occupancy and $1.85 of total RevPAR in January of '22 during the worst of the Omicron wave and yet ending the year in December with just over 73 points of occupancy and a whopping $612 of total RevPAR. As our newest property, the Gaylord Rockies just opened that year with an unheard of 1.2 million room nights on the books and generated over $85 million of adjusted EBITDA in its full first full year of operation. At the bottom line, our Hospitality segment delivered $150.1 million of adjusted EBITDAre, which put the full year profitability of the segment $12.7 million above the high end of our last upperly revised guidance range for 2022. And what should be the last earnings call in which we use 2019 as a full year comparison, 2022 finished up 7.8% in hospitality revenue and 6.3% in hospitality adjusted EBITDAre compared to that last pre-pandemic year, even with the material impact of Omicron in the first quarter. In terms of production, we booked over 1 million gross group room nights in the quarter, a 4.4% increase over the fourth quarter of 2021 and the average ADR of $254 on new bookings was 11% higher than the fourth quarter of '21 and 13.3% higher than the fourth quarter of 2019. On December 31, we entered this year with 49.8% net group occupancy points on the books for 2023, 4 points more than we entered 2022 and an ADR of $222 or 5% higher than the start of 2022. In terms of profitability, while we expect inflation will remain elevated in higher margin attrition and cancellation fees will return to more normalized run rates, the transformation of our business, which Colin described, including efficiencies across management ranks, staffing models, technology and food and beverage outlet strategy, among others, is expected to deliver stable to modestly improved margins compared to 2022 or in an adjusted EBITDA range for the year of $550 million to $580 million in our Hospitality segment. Total consolidated adjusted EBITDAre for the fourth quarter of $168.1 million, put our consolidated full year results over $17 million above the high end of our most recent guidance. This yields a total fully consolidated adjusted EBITDAre guidance range for the year of $605 million to $648 million, a 12.7% increase at the midpoint over 2022 and a 22.7% increase over 2019. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}