{
    "symbol": "BOOT",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-26 23:58:04",
    "content": " During the second quarter, consolidated same store sales grew 2.3% comprised of an increase in retail store same store sales growth of 3.9% partially offset by any e-commerce sales decline of 7%. On a three-year basis, consolidated same store sales grew 56% compared to the second quarter of fiscal 2020. For the quarter, our same store sales grew 2.3% as we cycled a remarkable 61.7% increase in the prior year period. Sales of men's western boots and Ladies' non- denim apparel declined on comp store basis over the prior year period, and sales of Ladies' Boots were almost flat. While the performance of Ladies' Boots and apparel is lagging on a one-year basis, it is important to call out that both categories cycled a comp growth of more than 100% in the same quarter last year. From a longer-term perspective, we are quite pleased with the multiyear growth we have seen in sales with our e-commerce business up 55% on a three-year basis, and continued multiyear growth in online profitability. New stores opening both existing and new markets continue to perform in line with our $3.5 million first year sales expectations, which results in a payback on our investment much faster than our historical stated three-year goal. Turning to current business, through the first four weeks of our third fiscal quarter total net sales have grown approximately 8% over the prior year period, driven by continued sales growth and the new stores we have opened over the last 12-months. Our preliminary consolidated same store sales through the same period are down 1.3% compared to the prior year period, driven by 17.6% decrease in e-commerce sales, partially offset by retail store same store sales growth of 1.7%. sales growth was driven by sales from new stores added during the past 12 months and a 2.3% increase in consolidated same store sales, which saw an increase in average unit retail prices driven in part by inflation. Selling, general and administrative expenses for the quarter were $85 million or 24.2% of sales compared to $68 million or 21.8% of sales in the prior year period. And I do kind of want particularly those that are new to the story to let that sink in for a second, because while we can view that as a sequential deceleration, it's hard for me to really get that upset over a plus 80%, three-year growth. We're speaking here to the high end of the range, but you can see that the e-commerce same store sales, we did -- have guided at 1.5% at the high end of the range, now at minus 11% for the full year, and stores actually increased a little bit from 2% at the high end of the range to 3%. Year-to-date, we're at plus 6.1% same store sales growth in our stores. And if inventories are up about 110 percentage points versus three years ago, sales are up 88% in Q2, it's up about 80% versus three years ago here, as we start Q3, it looks like you have probably about $100 million of inventory, above where the desired level would be. When we started the year and we had put out a 4.8% same store sales growth, we had planned about 40 basis points of buying and occupancy deleverage."
}