{
    "symbol": "BOOT",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-25 20:47:03",
    "content": " Total net sales grew 5.9% on top of 60.7% growth in the prior year period, driven primarily by strong sales from new stores opened over the past 12 months. While sales of men's and ladies western boots, ladies apparel and has declined, it is important to note that each of these businesses was up against incredibly strong double-digit or triple-digit growth in the prior year period. The team has not only risen to the challenge of the higher average store sales volume but has continued to expand the brand's footprint through new stores, including 12 additional store openings in the third quarter. Through the first four weeks of our fourth fiscal quarter, our preliminary consolidated same-store sales have declined 1.5% compared to the prior year period, driven by a 16% decrease in e-commerce sales partially offset by growth in retail store same-store sales of 1.2%. With an improved retail store sales trend, combined with an anticipated 100 basis points of improvement in freight, exclusive brand penetration growth and the continued opening of new stores, we are headed into fiscal '24 with multiple opportunities to fuel earnings growth. Please proceed with your question. As we look to next year, again, we're not - you know as we're not providing guidance at this time for fiscal '24, but I think particularly in the merchandise margin discussion here, what we said just a few moments ago is with the freight coming in so heavy from an expense standpoint in Q4, it's really removing a lot of the capitalized freight balances or the freight that we purchased at more expensive rates off of the balance sheet in this fiscal year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And so I would think of it as more of the build coming out of holiday is going to be less than what we had originally expected and less than what we've seen historically, particularly last year where we had a very sizable build as we're chasing inventory to have enough for the sales. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}