{
    "symbol": "BOOT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-27 22:49:02",
    "content": " The team's ability to drive top line growth and navigate freight and supply chain challenges resulted in an EBIT margin rate of 14.3%, which was 150 basis points above our guidance of 12.8%. During the first quarter, our exclusive brand penetration grew to 31.7%, approximately 540 basis points higher than the prior year period. Income from operations was $52 million or 14.3% of sales in the quarter, decreasing 320 basis points compared to $54 million or 17.5% of sales in the prior year period. Your line is now live. And thatâ\u0080\u0099s going to be driven by more full price selling similar to what weâ\u0080\u0099ve seen in this last quarter in the previous quarters, as well as product margin improvement will be around, what weâ\u0080\u0099ve got in there 80 basis points for the full year offsetting that weâ\u0080\u0099ve updated our guidance to be a 100 basis points of freight headwind for the full year. Your line is now live. But that doesnâ\u0080\u0099t make us disappointed in the second quarter growth, if Iâ\u0080\u0099m honest and weâ\u0080\u0099re quite happy that weâ\u0080\u0099re holding on to the business that we have really put together over the last couple of years and that large influx of customers that coming out of COVID we were able to add to the business seems to be sticky. Your line is now live. But that said, I mean, I think when you look at how much the business has grown over the last two years, even if we're getting slightly less frequent shopping from a sliver of our new customer base, we're pretty pleased to be able to hold onto the other 99% of the business that's been growing over the last 24 months or so. Your line is now live. Your line is now live. But I think based off of just four or five weeks of business, guiding, reducing that guidance to be more in that flat range or flat to minus two for the balance of the year and total sales growth of around 11% to 13% seemed like the prudent thing to do given the backdrop. Your line is now live. Your line is now live. Your line is now live. Your line is now live. We of course make more margin and as we build our inventory in that part of our business to the extent that we wind up with future markdowns, which again, I think we've tried to we really make people, people feel comfortable that we don't â\u0080\u0093 we're not too worried about ongoing future markdowns, but even if we have them, we're starting with much higher margin rate on our exclusive brand. Your line is now live."
}