{
    "symbol": "SGA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 17:05:25",
    "content": " With that in mind, for the quarter ended December 31, 2022, net revenue increased 3.3% to $30.1 million compared to $29.2 million last year. Operating income and free cash flow were approximately flat with the same period last year at $4.9 million and $3.8 million, respectively. For the 12-month period ended December 31, 2022, net revenue increased 6% to a $114.9 million compared to a $108.3 million for the same period last year. Without these expenses, operating income would have increased 12.3% to $16.9 million, free cash flow would have been approximately flat with last year at $13.6 million, and net income would have increased 16.8% to $13 million. Under the new policy, in addition to any quarterly and special dividends paid, the Company will declare an additional dividend in the second quarter of each year of 70% of the preceding year's annual free cash flow, net of acquisitions closed, special and quarterly dividends declared, debt paydowns and stock buybacks. For Q2 of 2023, this calculation would result in no dividend being paid based on a free cash flow for the fiscal year 2022 of $10.5 million and a total of $29.5 million in dividends declared during the year including $5.2 million of quarterly dividends, and $24.3 million of special dividends. On a pro forma basis, if you look at what the variable dividend would have been, based on the free cash flow for 2022 adjusted for Ed's passing as well as the two special dividends declared in 2022, we would start with a free cash flow of $13.6 million. Our pro forma quarterly dividend at $0.25 per share would reduce the net free cash flow available for a variable dividend by $6.1 million, basically $1 per share multiplied to roughly 6.1 million shares outstanding. In a year with no acquisitions, no debt paydown, and no stock buybacks, the net free cash flow available for the variable dividend would have been $7.5 million and a 70% of net free cash flow payout would have resulted in approximately $5.25 million being paid in variable dividend. Along with the $0.25 per share pro forma quarterly dividend or $1 per share annual basis, the total dividend paid would have been approximately $1.86 per share or with a mid-$20 stock price, a very nice yield of around 7.5%. Including the dividend declared on March 1, 2023, the Company will have paid $108.3 million in dividends to shareholders, since the first special dividend was paid 10 years ago in 2012."
}