{
    "symbol": "ON",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 10:36:02",
    "content": " Customers continue to expand the scope of their LTSAs to include ON Semi's entire portfolio of intelligent power and sensing solutions, which accounted for 66% of our total revenue in the second quarter, up from 62% a year ago. We have redeployed capital to high-margin, high-growth areas such as silicon carbide and over the last 12 months, we have exited approximately $210 million in revenue and an average gross margin of 24%, of which $36 million occurred in the second quarter at an average gross margin of 34%. We had forecasted to double last year's silicon carbide revenue in 2022 and thanks to our global team's impressive acceleration of our capacity expansion plans and our latest customer engagement, we are confidently raising our annual projection to triple last year's silicon carbide revenue in 2022 and exceed $1 billion in revenue in 2023. Towards that end, we have also secured more than $4 billion of committed silicon carbide revenue through long-term supply agreements for the next three years as compared to the $2.6 billion we had previously disclosed. While silicon carbide is the fastest-growing part of our power business, our silicon power products remain integral to our intelligent power portfolio with year-over-year growth of approximately 30% in our IGBT and MOSFET revenue. Our non-GAAP gross margin improved 30 basis points quarter-over-quarter, primarily driven by a favorable mix of automotive and industrial markets and despite a proactive slowdown in our wafer starts, which reduced our utilization from 81% in Q1 to 77% in the second quarter. Although, we continue to focus on long-term gross margin expansion and sustainability, our rapidly accelerating silicon carbide ramp will be dilutive to gross margins by 100 to 200 basis points over the next several quarters, due to the incremental start-up cost as we scale the operation. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. We do have customers that are co-investing with us for capital, in some cases, some NREs, things like that to invest in silicon carbide and other capacity that we're bringing online that makes those customers much more sticky and it's a good -- it just improved that relationship with that customer on a strategic basis. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}