{
    "symbol": "ON",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 10:22:08",
    "content": " We had strong revenue growth of 31% over the year, driven by solid performance of our intelligent power and sensing solutions in the automotive and industrial end markets. Key megatrends such as vehicle electrification, ADAS, energy infrastructure and factory automation are accelerating, and we expect to see sustained growth as we service our customers under long term supply agreements and expand our pipeline of new intelligent power and sensing products at favorable margins. And over the last 12 months, we have exited approximately $200 million in revenue at an average gross margin of 21%, of which $32 million occurred in the first quarter at an average gross margin of 20%. In the first quarter, our 5G cloud point-of-load revenue and design wins, both increased 33% year-over-year as we displace an incumbent to secure a design win at a leading 5G infrastructure OEM with a new product based on our superior technical performance and security of supply. Our first quarter revenue increased 31% year-over-year, gross margin improved 1,420 basis points and operating income increased 7.5 times faster than revenue while free cash flow was 21% on an LTM basis.\\ Additionally, revenue in our strategic end markets of automotive and industrial increased 42% year-over-year and now account for 65% of revenue as compared to 60% in the quarter a year ago. Over the last year, we have exited approximately $200 million of noncore revenue at an average margin of 21% and reallocated this capacity to strategic products with accretive gross margins. That's offset by increases in the input cost as well as in the second half of the year, we've got the ramping of silicon carbide, which is a headwind to margins because we don't exclude those start-up costs in our non-GAAP numbers. What we said is, so far, we've exited in total, $200 million, a 21% gross margin this next 300 just because of the pricing environment is higher than that, but still dilutive to overall margins. Two, we do have net price increases that we've talked about, that $200 million that we've exited so far or the $32 million we exited with 22% margin this quarter, that is in a favorable pricing environment. Now we've said this in the past, at that time in '23, for a couple of years, we're going to be a foundry business or GLOBALFOUNDRIES and that's at a low margin, which is a little bit of a headwind as well, but we'll be able to offset that with the cost improvements that we get across the portfolio. I thank our worldwide teams for their hard work in accelerating our transformation and driving record results once again, with leadership in intelligent power and sensing solutions and exposure to fast-growing megatrends, such as vehicle electrification, ADAS, energy infrastructure and factory automation, we are well positioned to deliver sustained and profitable long-term revenue growth and margin expansion."
}