{
    "symbol": "ON",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-06 12:18:06",
    "content": " Our worldwide teams have yet again delivered outstanding results, allowing us to deliver the most successful year in the company's history, with record revenue of $8.3 billion in 2022, an increase of 24% year-over-year, with earnings growing 3x faster than revenue. These are just a few of our recent wins in the fastest-growing automotive applications, giving us confidence in our outlook for this business and our $1 billion revenue year for silicon carbide. In industrial, while fourth quarter revenue declined 10% over Q3, we expect our traction in energy infrastructure and medical applications to offset the softness we are seeing in the legacy parts of this business. Our 2022 revenue closed at $8.3 billion, an increase of 24% year-over-year, primarily driven by strength in our automotive and industrial businesses. We exited volatile and highly competitive businesses, allowing us to walk away from $294 million of noncore revenue to date at an average gross margin of 26%. By rationalizing the portfolio and exiting low-margin consumer- facing markets, ISG's gross margin has improved by more than 1,600 basis points since the start of our transformation and the revenue mix is now more than 90% high-margin automotive and industrial. Our non-GAAP gross margin declined by 90 basis points quarter-over-quarter, with our planned ramp in silicon carbide and lower factory utilization at 74% as we proactively slowed wafer starts from the beginning of the year. Despite a slowing macroeconomic environment, our business continues to strengthen with total committed revenue under LTSAs of $16.6 billion, an increase of $2.5 billion quarter-over-quarter. We expect non-GAAP gross margin to decline, to be between 45.7% and 47.7% due to lower factory utilization and the dilutive impact of ramping silicon carbide and EFK, which is within our expected range of 100 basis points to 200 basis points and 50 basis points to 70 basis points, respectively. For my first question, I wanted to follow up on the last topic there that Chris brought up that you guys now have $16.5 billion something like that in LTSAs, only maybe 1/4 of that is from the silicon carbide business that gets a lot of attention."
}