{
    "symbol": "BGS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 20:35:06",
    "content": " Sequentially, we have seen approximately 250 basis points of improvement in both our gross profit as a percentage of net sales and our adjusted EBITDA as a percentage of net sales in the third quarter as compared to the first half of the year. During the third quarter of 2022, we generated net sales of $528.4 million, adjusted EBITDA of $80.2 million and adjusted diluted earnings per share of $0.31. Net sales of Crisco, the biggest beneficiary of pricing in the portfolio increased by $27.3 million or 38.3% for the third quarter of fiscal 2022 as compared to the third quarter of 2021. Net sales of Crisco are now up by $61.7 million, or 32.9%, for the first three quarters of the year compared to last year. Net sales of Cream of Wheat increased by $3.1 million, or 20.4%, for the quarter, and $9 million, or 18.8%, for the year-to-date period. Through the first three quarters of the year, net sales of Ortega are nearly flat or down just $0.5 million, or 0.4%, compared to last year. Net sales of spices and seasonings were down $6.1 million, or 6.5%, in the third quarter of 2022 as compared to the prior year. This compares favorably to performance during the first half of the year when net sales were down $19.3 million, or 9.5%, as compared to the prior year period. Compared to pre-pandemic 2019, net sales of the company's spices and seasonings increased by $20.1 million, or 8.1%, through the first three quarters of 2022. Net sales of Green Giant, including Le Sueur, decreased by $17.7 million, or 12.6%, for the third quarter of fiscal 2022 as compared to the third quarter of 2021. On a year-to-date basis, despite the soft third quarter performance, net sales of Green Giant are down just $8.3 million, or 2.2%, as compared to last year. Excluding the negative impact of $2.2 million of acquisition/divestiture-related expenses and non-recurring expenses included in cost of goods sold during the third quarter of 2022, gross profit would've been $108 million or 20.4% of net sales. Excluding the negative impact of a $14.1 million accrual for the estimated present value of a multi-employer pension plan, withdrawal liability in connection with the sale and closure of the company's Portland, Maine manufacturing facility and $2.8 million of acquisition/divestiture-related expenses and non-recurring expenses included in cost of goods sold during the third quarter of 2021, gross profit would've been $122.6 million or 23.8% of net sales. As a result, we have seen sequential improvements in margins with adjusted gross profit, excluding adjustments as a percentage of net sales in the third quarter, increasing by approximately 240 basis points when compared to the first two quarters of the year. Selling, general and administrative expenses increased by $1.1 million or 2.4% to $47.5 million for the third quarter of 2022 from $46.4 million for the third quarter of 2021. Adjusted EBITDA, as a percentage of net sales, was 15.2% in the third quarter of 2022 compared to 18.7% in the third quarter of 2021. However, similar to the sequential improvements that we saw in gross profit as a percentage of net sales, adjusted EBITDA as percentage of net sales in the third quarter improved by 260 basis points when compared to the first two quarters of 2022. We generated $0.31 in adjusted diluted earnings per share in the third quarter of 2022, compared to $0.55 in the prior year. Additionally, we expect for full year fiscal 2022 interest expense of $122.5 million to $127.5 million, including cash interest of $117.5 to $122.5 million, depreciation expense of $57.5 million to $62.5 million, amortization expense of $20.5 million to $22.5 million, an effective tax rate of 26% to 27% and CapEx of $35 million. Following this reclassification and consistent with the accounting requirements, we then measured the book value of the assets held for sale compared to the estimated fair value, less anticipated cost to sell, and recorded a pretax, non-cash impairment charge of $103.6 million during the third quarter of 2022. And so the benefit of the third quarter, a lot of this was back half weighted, but we're at something north of $130 million of benefit already through three quarters and feel very comfortable with that target for the full year."
}