{
    "symbol": "BGS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 21:34:10",
    "content": " However, our first quarter adjusted EBITDA declined 16.2% versus last year, behind higher than expected inflationary cost pressures accelerated by the war in Ukraine, particularly in oil, wheat, corn, fuel and other commodities. During the first quarter of 2022, we generated net sales of $532.4 million, adjusted EBITDA of $77.9 million and adjusted diluted earnings per share of $0.34. Net sales for the first quarter 2022 increased by $27.3 million or 5.4% ahead of our annual targets, despite the supply chain challenges. Green Giant also had modest growth, with net sales increasing by $3.2 million or 2.4% in the quarter. However when compared to the first quarter of 2020, net sales of our spices and seasonings increased by $14.9 million or 20.4%. Selling, general and administrative expenses decreased by $3.6 million or 7% to $46.8 million in the first quarter of 2022, compared to $50.4 million in the first quarter of last year. Expressed as a percentage of net sales, selling, general and administrative expenses, improved by 1.2 percentage points to 8.8% for the first quarter of 2022, as compared to 10% for the first quarter of 2021. As I mentioned earlier, we generated $77.9 million in adjusted EBITDA in the first quarter of 2022, compared to $92.9 million in the first quarter of 2021. The decrease in adjusted EBITDA was primarily attributable to industry-wide input cost inflation and supply chain disruptions, partially offset by list price increases, trade spend reductions and the net benefit during the first quarter relating to the Portland closure and sale. Adjusted EBITDA as a percentage of net sales was 14.6% in the first quarter of 2022, compared to 18.4% in fiscal 2021. Depreciation and amortization was $19.8 million in the first quarter of 2022, compared to $20.3 million in the first quarter of last year. We generated $25.2 million in net cash from operations in the first quarter of 2022, compared to $26 million in the first quarter of 2021. With pricing as a large driver of net sales performance for the year and based on where we finished the first quarter, we are increasing our guidance for net sales to 2% to 4% growth up from our prior guidance of 1% to 3% and our traditional long-term growth algorithm of zero percent to 2%. Based on our current net sales forecast and when factoring in both cost increases and revenue management initiatives, we expect to generate adjusted EBITDA of approximately $348 million to $358 million. Your line is now open. Your line is now open. But just based on what you have in the bag for the first quarter and what your guidance would point to, it looks like you are guiding 17% to 18% EBITDA margins for the rest of the year and I guess if that’s right, what are the - what really gets you there and what kind of trajectory does it look like. Your line is now open. Your line is now open. Hey, I guess, Casey and Bruce, I am just looking at the cash flow and first quarter looks a lot like first quarter a year ago and last year was characterized by working capital being a big use of cash like $100 million, as if you were chasing an upward inflation curve. Your line is now open. Your line is now open."
}