{
    "symbol": "FOXF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 12:08:05",
    "content": " Taking a deeper look at the numbers, our second quarter sales were $406.7 million, an increase of 23.9% compared to the second quarter of last year. Starting with Specialty Sports Group, Q2 2022 was our ninth consecutive record revenue quarter, delivered approximately $178 million in sales, a 28.1% revenue growth on a quarter-over-quarter basis. Shifting to the Powered Vehicles Group, the second quarter of 2022 marked another record quarter with revenue of $229 million, which represents a 20.9% increase as compared to the same period last year. This is our second consecutive quarter with over $200 million in revenue, led by strong performance in our operating product lines and increased efficiency and output in our Gainesville facility. Sales in the second quarter of 2022 were $406.7 million, an increase of 23.9% versus sales of $328.2 million in the second quarter of 2021. Our Specialty Sports Group, SSG, delivered a 28.1% increase in sales compared to the second quarter of 2021, primarily due to increased demand in our OEM channels. Moving to our Powered Vehicles Group, PVG, delivered a 20.9% increase in sales in the second quarter compared to the same quarter last year, primarily due to strong performance in our upfitting product lines. Fox Factoryâ\u0080\u0099s gross margin was 35.1% in the second quarter of 2022, a 120 basis point increase from 33.9% in the same period of the prior year. For the second quarter of 2022, non-GAAP adjusted gross margin increased by 120 basis points to 35.3% versus Q2 of 2021. The increase in gross margin and non-GAAP adjusted gross margin were primarily driven by favorable product mix compared to Q2 of 2021, led by higher volume sales in our Specialty Sports Group and strong performance in our upfitting product lines. Looking at non-GAAP operating expenses as a percentage of sales, our non-GAAP operating expenses increased by 60 basis points to 16.3% in the second quarter of 2022, compared to 15.7% in the same period in the prior year. Focusing on operating expenses in more detail, sales and marketing expenses increased approximately $6.4 million in the second quarter of 2022 compared to the second quarter of 2021, primarily due to higher commissions of $2.4 million. Research and development costs increased approximately $3 million in the second quarter of 2022, compared to the second quarter of 2021, primarily due to personnel investments to support future growth and product innovation. General and administrative expenses increased by approximately $4.1 million in the second quarter of 2022, compared to the second quarter of 2021 due to higher employee-related costs of $2.9 million as well as higher insurance and facility-related costs of $2.5 million. On a GAAP basis, net income attributable to FOX in the second quarter of 2022 was $53.5 million or $1.26 per diluted share compared to $44.3 million or $1.05 per diluted share in the same period in the prior year. On a year-to-date basis, net income attributable to FOX was $101.5 million or $2.40 per diluted share compared to $82.3 million or $1.94 per diluted share in the prior year period. Non-GAAP adjusted net income was $58.6 million in the second quarter of 2022, an increase of approximately $7.7 million or 15% compared to $51 million in the second quarter of last year. We delivered $1.38 of non-GAAP adjusted earnings per diluted share in the second quarter of 2022, compared to $1.20 in the second quarter of 2021. On a year-to-date basis, non-GAAP adjusted net income was $114.4 million, an increase of approximately $19 million or 19.8% compared to $95.5 million in the prior year period. Adjusted EBITDA increased by 26.5% to $88.1 million for the second quarter of 2022, compared to $69.7 million in the same quarter last year. Adjusted EBITDA margin increased by 50 basis points to 21.7% in the second quarter of 2022, compared to 21.2% in the second quarter of 2021. The increase in adjusted EBITDA margin in the second quarter of 2022 is primarily due to higher sales, favorable product mix and increased efficiency in our Gainesville plant, offset by inflationary cost pressures. On a year-to-date basis, adjusted EBITDA increased by 22.9% to $159.9 million. For the second quarter, which ended on July 1st, 2022, compared to our 2021 year end on December 31st, 2021, we ended with cash on hand of $108.6 million compared to $179.7 million. Our net property, plant and equipment increased to $194.6 million as of July 1st, 2022, compared to $192 million at the end of fiscal year 2021, reflecting capital expenditures of $19.9 million for the year. For the third quarter of 2022, we expect sales in the range of $385 million to $405 million and non-GAAP adjusted earnings per diluted share in the range of $1.15 to $1.35 per share. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}