{
    "symbol": "FOXF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 09:22:11",
    "content": " Our first quarter sales were $378 million, an increase of 34.4% compared to the first quarter of last year. In addition, we reported earnings per diluted share of $1.13 versus $0.90 in the same period last year, an increase of 25.6% quarter-over-quarter. We also reported non-GAAP adjusted earnings per diluted share of $1.32 versus $1.05, an increase of 25.7% over the first quarter in 2021. Q1 2022 marked a record revenue quarter, as PVG delivered first quarter sales of $208 million, an increase of 27.9% over the same period last year. Sales in the first quarter of 2022 were $378 million, an increase of 34.4% versus sales of $281.1 million in the first quarter of 2021. Our Powered Vehicles Group delivered a 27.9% increase in sales compared to the first quarter of 2021, primarily due to strong performance in our upfitting product lines. SSG delivered a 43.5% increase in sales in the first quarter compared to the same quarter last year, primarily due to increased demand across all channels. Fox Factory's gross margin was 31.8% in the first quarter of 2022, a 300 basis point decrease from 34.8% in the same period in the prior year. Looking at non-GAAP operating expenses as a percent of sales, our non-GAAP operating expenses decreased by 30 basis points to 15.8% in the first quarter of 2022 compared to 16.1% in the same period in the prior year. Focusing on operating expenses in more detail, sales and marketing expenses increased by approximately $5.7 million in the first quarter of 2022 compared to 2021, primarily due to higher commissions and marketing-related expenses. Research and development costs increased $2.7 million in the first quarter of 2022 compared to the first quarter of 2021, primarily due to personnel investments to support future growth and product innovation. General and administrative expenses increased by approximately $5.2 million in the first quarter of 2022 compared to 2021, due to higher employee-related costs of $2.1 million, higher insurance and facility-related costs of $2.2 million from our increased revenue and expanding manufacturing footprint as well as increases in various other costs. On a GAAP basis net income in the first quarter of 2022 was $48.1 million or $1.13 per diluted share, compared to $38 million or $0.90 per diluted share in the same period in the prior year. Non-GAAP adjusted net income was $55.8 million in the first quarter of 2022, an increase of approximately $11.3 million or 25.4% compared to $44.5 million in the first quarter of last year. We delivered $1.32 of non-GAAP adjusted earnings per diluted share in the first quarter of 2022, compared to $1.05 in the first quarter of 2021. Adjusted EBITDA increased by 18.8% to $71.8 million for the first quarter of 2022, compared to $60.4 million in the same quarter last year. The decrease in EBITDA margin in the first quarter of 2022 is primarily due to higher inflationary cost pressures and inefficiencies at the Gainesville Georgia plant, due to the move of the last production lines after the close of the Watsonville California manufacturing facility, as discussed earlier, partially offset by the impact of higher sales. Now focusing on our balance sheet, for the first quarter which ended on April 1st 2022 compared to our 2021 year ended on December 31st 2021, we ended with cash on hand of $68.8 million compared to $179.7 million. Now turning to guidance, for the second quarter of 2022, we expect sales in the range of $385 million to $405 million and non-GAAP adjusted earnings per diluted share in the range of $1.10 to $1.25 per share."
}