{
    "symbol": "FOXF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 00:04:04",
    "content": "  Sales in the third quarter of 2022 were $409.3 million, an increase of 17.8% versus sales of $347.4 million in the third quarter of 2021. Our Powered Vehicles Group, PVG, delivered a 25.1% decrease in sales in the third quarter compared to the same quarter last year, primarily due to strong performance in our upfitting product lines and increased demand in our OEM channel. Moving to Specialty Sports Group, SSG, delivered a 9.1% increase in sales compared to the third quarter of 2021, primarily due to increased demand in our OEM channel. On a year-to-date basis, sales were $1,193.9 million versus $956.7 million over the same period last year, an increase of 24.7%. For the third quarter of 2022, non-GAAP adjusted gross margin also increased by 10 basis points to 33.9% versus Q3 2021. Moving to non-GAAP operating expenses as a percentage of sales, our non-GAAP operating expenses decreased by 30 basis points to 15.8% in the third quarter of 2022 compared to 15.5% in the same period of the prior year. Sales and marketing expenses increased approximately $6 million in the third quarter of 2022 compared to the third quarter of 2021, primarily due to higher commissions of $2.9 million. Research and development costs increased approximately $1.7 million in the third quarter of 2022 compared to the third quarter of 2021, primarily due to personnel investment for future growth and product innovation. On a GAAP basis, net income attributable to Fox in the third quarter of 2022 was $50.8 million or $1.20 per diluted share compared to $43.8 million or $1.03 per diluted share in the same period in the prior year. On a year-to-date basis, the net income attributable to Fox was $152.3 million or $3.59 per diluted share compared to $126.1 million or $2.98 per diluted share in the prior year period. Non-GAAP adjusted net income was $57.4 million in the third quarter of 2022, an increase of approximately $6.9 million or 13.6% compared to $50.5 million in the third quarter of last year. On a year-to-date basis, non-GAAP adjusted net income was $171.8 million, an increase of approximately $25.8 million or 17.7% compared to $126 million in the prior year period. The decrease in adjusted EBITDA margin in the third quarter of 2022 is primarily due to change in the product mix, impact of stronger dollar and inflationary cost pressures, offset by increased efficiencies at our Gainesville site. On a year-to-date basis, adjusted EBITDA increased by 20.7% to $245 million, however, the adjusted EBITDA margin decreased by 70 basis points to 20.5% versus the prior year. For the third quarter, which ended on September 30, 2022, compared to our 2021 full year, which ended on December 31, 2021, we ended with cash on hand of $153.1 million compared to $179.7 million. Our net property plant and equipment increased to $199.6 million as of September 30, 2022, compared to $192 million at the end of fiscal year 2021, reflecting capital expenditures of $35.6 million year-to-date. Now turning to guidance, for the fourth quarter of 2022, we expect sales in the range of $370 million to $390 million and non-GAAP adjusted earnings per diluted share in the range of $1.10 to $1.30 per share. For the fiscal year 2022, the company expects sales in the range of $1.565 billion to $1.585 billion and non-GAAP adjusted earnings per diluted share in the range of $5.15 to $5.35."
}