{
    "symbol": "FOXF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-26 10:44:05",
    "content": " Consequently, I am pleased to report fourth quarter sales of $408.6 million, an increase of 19.4% compared to the same period last year. Starting with Specialty Sports Group, we delivered a quarterly revenue of $159.5 million, a decline of 1.9% as compared to the same quarter last year. Shifting to our Powered Vehicles Group, Q4 marked another remarkable revenue quarter led by 38.5% growth in sales versus the same quarter last year, driven by strong performance in our OE channel and outfitted product lines. Sales in the fourth quarter of 2022 were $408.6 million, an increase of 19.4% versus sales of $342.3 million in the fourth quarter of 2021. Our Powered Vehicles Group, PVG delivered a 38.5% increase in sales in the fourth quarter compared to the same quarter last year, primarily due to strong performance in our upfitting product lines and increased demand in our OEM channels. Looking at non-GAAP operating expenses as a percentage of sales, our non-GAAP operating expenses decreased by 50 basis points to 16.2% in the fourth quarter of 2022 compared to 16.7% in the same period in the prior year. Focusing on operating expenses in more detail, sales and marketing expenses increased approximately $1.8 million in the fourth quarter of 2022 compared to the fourth quarter of 2021, primarily due to higher commissions. Research and development costs increased approximately $2.2 million in the fourth quarter of 2022 compared to the fourth quarter of 2021, primarily due to personnel investments to support future growth and product innovation. On a full year basis, operating expenses were $284.6 million or 17.8% of sales compared to $235.4 million or 18.1% of sales in the prior year, a decrease of 30 basis points. Our non-GAAP operating expenses as a percent of sales were flat versus the prior year period, going from $207.8 million and 16% of sales in 2021 to $257.1 million and 16% of sales in 2022. On a full year basis, sales and marketing spend increased by approximately $19.9 million compared to the prior year, primarily due to commissions of $9.7 million, higher head count and employee benefit-related costs of $5.8 million and higher marketing-related costs of $4 million. Lastly, general and administrative dollars spend increased by $18.9 million in full year 2022 as compared to the prior year, but was lower as a percent of revenue by 30 basis points versus the prior year. On a GAAP basis, net income in the fourth quarter of 2022 was $53 million or $1.25 per diluted share compared to $37.7 million or $0.89 per diluted share in the same prior year period. On a full year basis, net income was $205.3 million or $4.84 per diluted share compared to $163.8 million or $3.87 per diluted share in the prior year. Non-GAAP adjusted net income was $60.8 million in the fourth quarter of 2022, an increase of approximately $16 million or 35.8% compared to $44.8 million in the fourth quarter of last year. On a full year basis, non-GAAP adjusted net income was $232.7 million, an increase of approximately $41.9 million or 21.9% compared to $190.8 million in the prior year period. On a full year basis, adjusted EBITDA increased by 21.9% to $321.8 million versus the prior year. For the fourth quarter, which ended on December 30, 2022, compared to our 2021 full year, which ended on December 31, 2021, we ended with cash on hand of $145.3 million compared to $179.7 million. Our net property, plant and equipment increased to $202.2 million as of December 30, 2022, compared to $192 million at the end of fiscal year 2021, reflecting capital expenditures of $43.7 million for the year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}