{
    "symbol": "RAD",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-24 14:11:06",
    "content": " Revenues were up $134 million or 2.2% from the prior year's first quarter, driven by growth at the Retail Pharmacy Segment, partially offset by decline at the Pharmacy Services Segment. Retail Pharmacy Segment revenue for the quarter was $4.4 billion, which was $228 million higher or an increase of 5.5% over last year's first quarter, due to the impact of COVID vaccines and the acquisition of Bartell Drugs. Your line is open. Your line is open. Although it's not a huge part of front-end sales, cough, cold and flu is still down 30%, you know, year-over-year, for quarter-over-quarter, and then our acute scripts on a two-year stack basis are still down of 12%. And so I think what we're seeing is, you know, there is - when you peel back the benefit of the COVID vaccines and you peel back some of the great signs for kind of recovery, the fact that matter is, we're still seeing some trends in our business that are, what I would call, kind of COVID related trends, especially in the acute scripts category. And so I think we're - there is a time, I think when that activity is going to come back, but I can't tell you we've got clear line of sight and exactly how that's going to be, and I think we're being kind of cautious in how we think about that as we think about the year's guidance. Your line is open. I think we are looking at reimbursement rate pressure that's probably pretty consistent with what we've seen over the last year or two, but certainly is a headwind that we always kind of work against in our - as a starting point and kind of our retail business. Your line is open. Yes, I think from - first of all, from a discount card standpoint, we've seen increased volumes in that business, which relates to obviously increased EBITDA and expect kind of the trends that we've seen in the first quarter, kind of continues throughout the year. So I think you kind of look at the first quarter, and you know, things obviously will move around, but that's probably not a bad kind of guiding point to look at kind of the cadence in the Elixir business over the rest of the fiscal year. Your line is open. Your line is open."
}