{
    "symbol": "ALNY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:05:27",
    "content": " Commercially, we achieved 14% product sales growth compared with the first quarter as we continue to drive a steady increase in patients on therapy across our portfolio of marketed products, including ONPATTRO, GIVLAARI and OXLUMO. We were also excited to see positive data presented by Sanofi from the Phase 3 ATLAS-PPX study of fitusiran in patients with hemophilia, which met its primary endpoint and demonstrated that fitusiran prophylaxis, significantly reduce breathing episodes compared to prior factor bypassing agent prophylaxis. We continue to see growth for ONPATTRO achieving $153 million in global net product revenues in the second quarter, representing a 12% increase compared with the first quarter and 35% growth compared with Q2 2021. At the end of Q2, over 2,400 patients were on commercial ONPATTRO treatment worldwide, up from over 2200 patients at the end of the first quarter, representing steady 9% quarterly patient growth. In the U.S. sales of ONPATTRO increased 14% versus the first quarter, and were primarily impacted by an increase in patients on therapy and improved patient compliance following Q1, which was negatively impacted by COVID. In our international markets ONPATTRO Q2 product sales increased 10% versus Q1 2022, primarily due to an increase in patients on therapy and the timely orders in distributor and partner markets. Moving to our ultra-rare disease franchise, first with GIVLAARI, we achieve $45 million in global net product revenues in the second quarter, representing a 28% increase compared with Q1 2022 and 47% growth versus Q2 2021. At the end of Q2, over 200 patients were on commercial OXLUMO treatment worldwide, up from over 160 at the end of the first quarter, representing 25% quarterly patient growth. In our international business, despite an increase in patients on therapy during the quarter, Q2 OXLUMO sales decreased by 15% compared with Q1, primarily due to an increase in gross to net deductions during the quarter and the timing of orders in our distributor and partner markets. Additionally, as with ONPATTRO and GIVLAARI changes in foreign exchange rates also negatively impacted OXLUMO Q2 2022 results with reported year-over-year growth of minus 9% held back by 5 percentage points due to the strengthening U.S. dollar. Net revenue from collaborations for the second quarter was approximately $9 million representing an 85% decrease compared with Q2 2021, primarily due to a reduction in revenue from our Regeneron collaboration, which is subject to quarter-to-quarter variability dependent on a variety of factors including the level of work completed during the quarter, which is reimbursed by Regeneron. Obviously we continue to add new naive patients both in Europe and Japan, but early on we've seen a good, strong dynamic which alludes to us that the physicians believe that there is actually â\u0080\u0093 probably more opportunity to use ONPATTRO as a silencer in the earlier part of the disease to get adequate treatment. What we've also seen is, as I indicated earlier, a good new, prescribers coming into the treatment of this condition and excited to be actually providing this medicine to those patients that probably were on the fence given that was an infusion with ONPATTRO earlier profile and AMVUTTRA tends to offer a very convenient option with great safety and efficacy data."
}