{
    "symbol": "ALNY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 13:28:10",
    "content": " For ONPATTRO, we achieved $137 million in global net product revenues in the first quarter, representing a 1% decrease compared with the fourth quarter and 34% growth compared with Q1 2021. At the end of Q1, over 2,200 patients were on commercial ONPATTRO treatment worldwide, up from over 2,050 patients at year-end 2021, representing steady 7% quarterly patient growth. In our international markets, ONPATTRO Q1 product sales declined 5% versus Q4, despite an increase in patients on therapy due to an increase in gross net deductions following Q4, which included several non-recurring benefits, along with an unfavorable foreign exchange impact due to strengthening U.S dollar in Q1, which impacted results across all three commercial products. Moving to GIVLAARI, we achieved $35 million in global net product revenues in the first quarter, representing a 13% decrease compared with Q4 2021 and 43% growth versus Q1 2021. At the end of Q1, over 400 patients were on commercial GIVLAARI treatment worldwide, up from over 250 at year-end '21 representing robust 14% quarterly patient growth. Flat patient demand, despite a 5% increase in patients on therapy due to reduced patient compliance, which was negatively impacted by COVID in January and February; inventory stocking dynamics, which negatively impacted reported growth by 15%; and an increase in gross to net deductions in the quarter, which negatively impacted reported growth by 7% following the fourth quarter, which included several non-recurring gross to net benefits. Moving now to OXLUMO, we achieved $50 million in global net product revenues in the first quarter, representing a 24% decrease compared with Q4 '21and 59% growth versus Q1 2021. OXLUMO sales decreased in our international markets by 32% during the first quarter compared with Q4, despite an increase in patients on therapy during the quarter, primarily due to an increase in gross to net deductions following Q4, which included several non-recurring benefits, as well as the timing of order in partner in emerging markets. Additionally, even though we were disappointed by the 3-month PDUFA delay for vutrisiran in the U.S., we are poised to launch the product upon potential FDA approval by the new July 14 PDUFA date, and we remain confident that this will continue to represent an attractive option for TTR polyneuropathy patients and an incremental growth opportunity for our TTR franchise. Net revenue from collaborations for the first quarter was approximately $26 million, representing a 38% decrease compared with Q1 2021, primarily due to reduction in revenue from our Regeneron collaboration, which is subject to quarter-to-quarter variability dependent on a variety of factors including the level of work completed during the quarter, which is reimbursed by Regeneron."
}