{
    "symbol": "ALNY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 12:52:07",
    "content": " We saw robust growth in our TTR franchise in Q3, achieving $170 million in global net product revenues for ONPATTRO and AMVUTTRA, representing an 11% increase compared with the second quarter and a solid 41% growth compared with Q3 2021. At the end of Q3 over 2,580 patients were on commercial ONPATTRO or AMVUTTRA treatment worldwide, up from over 2,400 patients at the end of the second quarter, representing a steady 8% quarterly patient growth. In the U.S., combined sales of ONPATTRO and AMVUTTRA increased a robust 30% versus the second quarter and were primarily impacted by the following and 19% increase in demand growth, which was driven by the strength of the initial AMVUTTRA patient uptake, more than offsetting the decrease in patients on ONPATTRO that switched AMVUTTRA. Moving to AMVUTTRA rare disease franchise, first GIVLAARI, we achieved $46 million in global net product revenues in the second quarter, representing a 1% increase compared with Q2 â\u0080\u009822 and 43% growth versus Q3 â\u0080\u009821. In conclusion, we are pleased with the growth in revenues and patient demand achieved in Q3 and particularly with early signs of strong performance associated with AMVUTTRA launch, which we believe represents an important therapy option for hATTR amyloidosis patients with polyneuropathy and an accelerated growth opportunity for our TTR franchise. In our mid- and early-stage portfolio, we are looking forward to milestones that include completion of enrollment in the KARDIA-2 Phase 2 study of zilebesiran at or around year-end, preliminary results expected from healthy volunteers in the Phase 1 study of ALN-XDH in development for patients with gout and submission of CTA filings for ALN-KHK for the treatment of metabolic liver disease, including diabetes, and ALN-APP for NASH. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. When you look at the ONPATTRO, the AMVUTTRA new patient start forms, I noticed that the number of new patients percentage uptick from what was announced in the first quarter of launch, I think we from about a third to nearly 50%. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}