{
    "symbol": "ALNY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 13:46:06",
    "content": " At the end of 2022, over 2,975 patients were on commercial ONPATTRO or AMVUTTRA treatment worldwide, an increase of nearly 400 patients from the end of Q3, which represents a doubling of the quarterly trend that existed prior to the launch of AMVUTTRA, a clear signal of accelerating TTR franchise growth. In our international markets, combined sales of ONPATTRO and AMVUTTRA also increased 12% versus Q3 2022, primarily driven by the success of initial international AMVUTTRA launches in Germany and Japan with growth favorably impacted both by increased patient demand and initial launch stocking. Moving to our ultra-rare disease franchise, first GIVLAARI, we achieved $47 million in global net product revenues in fourth quarter representing a 3% increase compared with Q3 2022 and 16% growth versus Q4 2021. Additionally, as with ONPATTRO and GIVLAARI, changes in foreign exchange rates also negatively impacted OXLUMO Q4 2022 results with reported year-over-year growth of 24% reflected a foreign exchange impact of 9 percentage points due to the strengthening U.S. dollar. In conclusion, we are pleased with the growth in revenues and patient demand achieved in Q4 and particularly with our early signs of strong performance associated with the AMVUTTRA launch, which we believe represents an important therapy option for hATTR amyloidosis patients with polyneuropathy and an accelerated growth opportunity for our TTR franchise. Turning now to a summary of our full P&L results for the fourth quarter and full year, total product revenues for 2022 were $894 million or 35% growth versus 2021 or 43% on a constant exchange rate basis with growth contributions from all four commercial products. Your line is now open. One moment for the next question. Your line is now open. One moment for the next question. Your line is now open. One moment for the next question. Your line is now open. One moment for the next question. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}