{
    "symbol": "DVAX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 20:17:02",
    "content": " Before we begin, I advise you that we will be making forward-looking statements today based on our current expectations and beliefs, including, but not limited to potential market size and market share, impact of ACIP recommendation, financial guidance and trends, expected regulatory filings or approvals of our collaborators, clinical readouts and potential future uses of CpG 1018 adjuvant. Our team has demonstrated strong execution and driving growth of HEPLISAV-B and executing on our adjuvant supply business for COVID-19 vaccine, driving total revenue of $114 million in the first quarter, which was up 37% from the same period last year. In addition to HEPLISAV-B, our global portfolio of CpG 1018 adjuvant supply agreements for COVID-19 vaccine generated $92 million as the largest driver of revenue in the first quarter. Our performance this quarter puts us on track to achieve annual revenue growth in 2022 for both HEPLISAV-B and CpG 1018 adjuvant supply, which is expected to enable a second consecutive year of profitability. We believe the ACIP recommendation will be a significant catalyst for growth, and we estimate the market opportunity could grow to approximately $800 million by 2027, with HEPLISAV-B well positioned to secure a majority market share over time. Additionally, we achieved $92 million in CpG 1018 adjuvant revenues, up 23% from $75 million in the same period last year, driven by continued strong execution on our global portfolio of commercial supply agreements. Our research and development expenses for the first quarter of 2022 were $11 million, reflecting continued advancement of our ongoing pipeline programs in Tdap and shingles and our fully funded Phase II contract with the DOD for adjuvanted plague vaccines. Selling, general and administrative expenses for the first quarter of 2022 increased to $32 million compared to $22 million for the first quarter of last year, primarily driven by increased personnel-related expenses, including stock-based compensation, coupled with focused marketing investments to drive growth in HEPLISAV-B and support our global operations. We ended the first quarter with a very robust balance sheet, including cash, cash equivalents and investments of $503 million, and we continue to believe that we have sufficient capital to support our core business without the need to raise additional funds, which is especially important in this challenging market backdrop. Lastly, we're very pleased to reaffirm our previous 2022 full year financial guidance, which includes CpG 1018 adjuvant revenue of at least $550 million with approximately 50% gross margin for the year; SG&A expenses in the range of $120 million to $140 million; R&D expenses in the range of $55 million to $70 million; and interest expense of approximately $7 million. With a strong first quarter under our belts, as I mentioned earlier, we continue to anticipate another profitable year driven by increasing revenue from our CpG adjuvant supply business and from increasing HEPLISAV-B sales."
}