{
    "symbol": "DVAX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 20:14:08",
    "content": " Before we begin, I advise you that we will be making forward-looking statements today based on our current expectations and beliefs, including, but not limited to potential market size and market share, market trends, impact of ACIP recommendation, and timing of such impacts in financial guidance, and trends, including revenue, profitability and sufficiency of current capitalization, timing of results of clinical trial starts and data readout and potential future uses of CpG 1018 adjuvant. The short summary of the quarter is that we continue to execute well on our core priorities, which has on track for a second consecutive year of profitability with record revenues expected for Heplisav-B and our CpG 1018 adjuvant. We achieved over $32 million in Heplisav-B net product sales in the second quarter, supporting our expectations for another year of growth for Heplisav-B revenues. In the second quarter, our global portfolio of CpG 1018 adjuvant supply agreements for COVID-19 vaccines generated over $220 million of revenue. We anticipate full-year 2022 revenue for CpG 1018 to be between $550 million and $600 million, which represents the remainder of orders from our partners under our commercial supply agreements. In the second quarter, Heplisav-B generated net product revenue of $33 million, its highest single revenue quarter since launch, and an increase of 139% from $14 million in Q2 of last year. Compared to the prior risk based recommendation, we continue to believe that the ACIP recommendation will be a significant catalyst for growth and estimate the Hepatitis B market opportunity could grow to approximately $800 million by 2027 with Heplisav-B well positioned to secure a majority market share over time. Beginning with our revenue performance, we delivered total revenue of $256 million for the second quarter of 2022, up 386% year-over-year. The second quarter marked another record breaking quarter total Heplisav-B net sales of $33 million, including approximately $1 million of sales associated with commercialization in Germany, and represents significant year-over-year growth of 139% for the franchise. Additionally, we continue to execute across our global portfolio of CpG 1018 adjuvant commercial supply agreements for COVID-19 vaccines, achieving $223 million in CpG 1018 adjuvant revenues with a gross margin of 67%. Our research and development expenses for the second quarter of 2022 were $10 million, reflecting continued advancement of our ongoing pipeline programs in Tdap and shingles, as well as our funded Phase 2 contract with the DOD for an adjuvant in plague vaccine. Selling, general and administrative expenses for the second quarter of 2022 increased to $36 million, compared to $22 million for the second quarter of last year primarily driven by increased headcount across field sales and G&A coupled with focused marketing investments to drive growth in Heplisav-B. Lastly, I'm pleased to refine our 2022 full-year financial guidance, including CpG 1018 adjuvant revenues of between $550 million to $600 million with approximately 60% gross margin for the year, which reflects the economics associated with the remaining firm orders under our commercial supply agreements for 2022."
}