{
    "symbol": "MGRC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 21:57:20",
    "content": " Rental revenues grew by 17% with noteworthy increased performance from our education segment where we are seeing recovery post pandemic, and as school districts continue modernization projects in all of our regions. Education rentals, which account for a third of our business mix grew by 9%, which was the largest increase since the beginning of the pandemic in the first quarter of 2020. For our portable storage business, we delivered 38% rental revenue growth and saw strength in demand in all of our markets. Looking at overall corporate results for the third quarter, total revenues increased 16% to 200.5 million. The revenue increase was primarily from improved rental operations, along with higher sales revenues with mobile modular TRA-RenTelco and Adler tanks each growing rental revenues year-over-year reflecting sustained momentum and healthy business conditions. There were increases across all revenue streams, including 17%, higher rental revenues, 12%, higher rental related services revenues, and 10% higher sales revenues. Higher rental revenues were partly offset by 36% higher inventory center costs and 3% higher depreciation bans, resulting in rental margins of 56% compared to 59% a year ago. Average utilization for the quarter was 65.3% compared to 66.9% a year ago, and rental margins were 44% up from 42% in the previous year. At Adler Tank rentals, total revenues increased 3.9 million or 18% to 26.2 million on higher rental and rental related services revenues. The average monthly rental rates increased 5% for the quarter to 3.46%, reflecting improving pricing environment. Average utilization for the third quarter increased to 54.9% from 48.1% and rental margins improved to 57% compared to 51% a year ago, reflecting healthy demand conditions and strong operating leverage. Given the recent increases in interest rates, along with our higher rental equipment capital spending for growth, which incrementally increases total debt we now expect full year interest expense to be approximately 15 million to 15.5 million."
}