{
    "symbol": "MGRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 18:22:13",
    "content": " Looking at overall corporate results for the second quarter, total revenues increased 21% to $177 million. The total fleet average monthly rental rate for the quarter was 2.72%, which was 5% higher than a year ago and reflects improved pricing conditions. Average fleet utilization for the quarter increased to 78.1% from 75.5% a year ago, even as we added more fleet, reflecting continued improvement in market demand conditions. Higher rental revenues were partly offset by 51% higher inventory center costs and 10% higher depreciation expense, resulting in rental margins of 51%, compared to 57% a year ago. Rental revenues for the quarter increased 7%, we saw improved demand for communication equipment rentals, which increased 9% and continued strength in general purpose rentals up 6%, compared to a year ago. Average utilization for the second quarter was 64.5%, compared to 67.7% a year ago, resulting in rental margins of 40% unchanged from the previous year. At Adler Tank Rentals, total revenues increased $3.7 million or 19% to $23.7 million on higher rental, and rental related services revenues. Average utilization for the second quarter increased to 51.6% from 44% and average margins -- average rental margins improved to 54%, compared to 49% a year ago, reflecting improved demand conditions. Given the recent increase in interest rate outlook, and our higher rental equipment capital spending for growth, which incrementally increases total debt, we now expect full-year interest expense to be approximately $14.5 million to $15 million, compared to our April estimate of $13 million to $14 million. Rental equipment purchases were $94.8 million, compared to $58.9 million in the prior year, reflecting increased demand, compared to a year ago and our corresponding increased investment for organic growth in modular and portable storage fleet. It's like 5% of rental revenues in Adler, and so we've really worked to have that be less of an impact on the business, because of the cyclicality of it."
}