{
    "symbol": "CXM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-06 22:59:06",
    "content": " Doc Martens is a great example of our customers land with us, in this case with two product suites, following its IPO last year, the iconic European brand, they entered a new key stage of growth and as they look forward to becoming a digital first direct-to-consumer company with global reach, they partnered with us to support that growth, to drive efficiency, visibility and collaboration across their customer facing teams, bringing them onto one platform and replaced the multiple point solutions in the process. We continue to see strong growth in our fourth product suite for marketing and advertising as well, expanding with customers like Lululemon, TSB Bank and U.S. Marine Corp. As one of the leading banks in the U.K., TSB is a great example of a company that’s already unified CXM across all four of our product suite and continues to grow with us. As you know, we also launched our first two self service products, something that we are very excited about in the long run, Modern Research Lite and Modern Care Lite, which makes it easier for companies that aren’t yet Sprinklr customers to try your platform, especially as we expand our footprint to our second vector of growth, which is focused on companies with $100 million to $1 billion in annual revenue. During the fourth quarter, total revenue was $135.7 million, up 30% year-over-year and above our previously announced guidance range of $129 million to $131 million. This was driven by subscription revenues of $117.7 million, which grew 31% year-over-year and were also above our previously announced guidance range of $113 million to $115 million. During the fourth quarter, total non-GAAP operating expenses increased 57% over the prior year to $108.2 million, representing 80% of revenues, up from 66% of revenues during the same period last year. Turning to a quick summary of financial results for the full year FY 2022, total revenue was $492.4 million, up 27% year-over-year, whereas subscription revenue was $427.7 million, up 26% for the full year. As of the end of FY 2022, total remaining performance obligations or RPO, which represents revenue from committed customer contracts that has not yet been recognized was $586.4 million, up 36% compared to the same period last year and CRPO was $409.2 million, up 30% year-over-year. And finally, we now have 82 customers contributing $1 million or more in subscription revenue over the last year, which is a 26% increase year-over-year. Starting with the first quarter of FY 2023, we expect total revenue for the first quarter to be in the range of $140 million to $142 million, representing 27% growth year-over-year at the midpoint. Within this we expect subscription revenues to be in the range of $123 million to $125 million, representing 28% growth year-over-year at the midpoint. We expect subscription revenues to be in the range of $536 million to $544 million, representing 26% growth year-over-year at the midpoint and we expect total revenues to be in the range of $607 million to $615 million, representing 24% growth year-over-year at the midpoint. Just a quick one from me, I noticed that you added $2 million plus customers in the quarter, which is the lowest net new addition this year and even going back to last year. I have always said that, the price and growth of this industry is inevitable and it’s validated every time we speak to customers who talk to a large global brand, household brand, CPG company that has 60 customer facing brands that operate in 40 to 120 countries each running marketing and care and research and sales in every one of those markets and each one of those teams using different point solution for different channels."
}