{
    "symbol": "INTU",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-19 02:11:05",
    "content": " We're off to a strong start in fiscal year 2022 with continued momentum across the Company, given our strategy of becoming a global AI-driven expert platform, powering the prosperity of consumers and small businesses. First priority is to deliver on our vision of an end-to-end customer growth platform to help customers get their business online, market their business, manage their customers ' relationships, get paid, access capital, pay employees, manage cash flow, and be compliant with virtual experts at their fingertips, all in one place. Moving on to guidance, we are raising our full-year fiscal 2022 revenue and non-GAAP operating income and earnings per share guidance to reflect both the acquisition of Mailchimp and the stronger than expected start to the year in the small business and self-employed group and Credit Karma. Our updated fiscal 2022 guidance includes revenue up $12.165 billion to $12.3 billion, growth of 26% to 28%, including Mailchimp as of November 1st and a full-year of Credit Karma. This updated fiscal 2022 guidance includes organic growth for the small business and self-employed segment of 16% to 17%, up from 12% to 14%, expected Mailchimp revenue of $760 million to $770 million, and Credit Karma revenue of $1.54 billion to $1.565 billion, up from $1.345 billion to $1.38 billion. Your line is open. Your line is open. First and foremost, our number one priority is really around creating one growth platform, and it's really a lot of the work behind the scenes in terms of building data pipelines and connecting the services so that the magical power of the data, both Mailchimp data and QuickBooks data can come together for the customer to put the power of the insights in their hands. Your line is open. Your line is open. Your line is open. There are so many underlying technologies, services where AI is being used to ensure that the platform matches the right customer to the right experts, to make the platform simple and easy-to-use for experts and we feel really confident relative to just the where we are with the virtual expert platform, and our focus, intentionally, has been really about serving customers when it comes to tax time and helping small businesses with the bookkeeping and eventually also with their taxes. Your line is open. Your line is open. Your line is open. I'll take you back to the reason at Investor Day we put the opportunity of Credit Karma is part of TurboTax experience, and TurboTax is part of the Credit Karma platform as a Horizon 3, is we're really focused on the customer and member experience in nailing that because we know over time we can monetize. Your line is open. I would say I wouldn't overly anticipate a significant change in our trajectory international because of Mailchimp where there's some fundamental things, we want to get right to ensure that we can truly be the platform that -- where you can grow your business and run your business and over time it will certainly have an impact internationally and we're excited about that because it gives us another foot in the door outside of the U.S.\n Great. And we have data that shows that the more customers learn that TurboTax, Credit Karma, Mailchimp now, and QuickBooks when they learn that they're part of the Intuit brand and the platforms are all connected, it actually has a positive impact on our potential for growth."
}