{
    "symbol": "GNTX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-22 14:22:13",
    "content": " For the second quarter of 2022, the company reported net sales of $463.4 million compared to net sales of $428 million in the second quarter of 2021, which was an 8% increase quarter-over-quarter. For the second quarter of 2022, global light vehicle production in North America, Europe, Japan/Korea, and China decreased approximately 3% when compared to the second quarter of 2021. Light vehicle production in the company's primary markets of North America, Europe and Japan/Korea, was down 1% on a quarter-over-quarter basis, primarily driven by vehicle production increases in North America that were more than offset by reductions in Europe, Japan and Korea. While we are pleased with our sales performance compared to the light vehicle production, which represents a 9% outperformance to our primary markets and 11% outperformance to the global market, it is important to note that sales for the quarter fell short of our beginning of quarter forecasts by approximately $70 million to $80 million. Our operating expense growth rate for the second quarter of 2022 was significantly higher than our sales growth rate for the same quarter, but was necessary to support previously sourced new program launches, product re-designs in support of component issues and our ongoing commitment to new technology areas. Automotive net sales in the second quarter of 2022 were $452.9 million compared with $420.6 million, an 8% increase over the second quarter of 2021, and auto-dimming mirror unit shipments increased 3% during the quarter compared to the second quarter of 2021. Other net sales in the second quarter of 2022, which includes dimmable aircraft windows and fire protection products was $10.5 million compared to other net sales of $7.4 million in the second quarter of 2021. Fire protection sales increased by 53% for the second quarter of 2022 compared to the second quarter of 2021, and dimmable aircraft window sales decreased by 22% for the second quarter compared to the second quarter of last year. The company's current forecasts for light vehicle production for the third quarter of 2022, and full years 2022 and 2023, are based on the mid-July 2022 IHS Markit forecast for light vehicle production in North America, Europe, Japan/Korea and China. Additionally, based on the companyâ\u0080\u0099s forecasts for light vehicle production for calendar year 2023, the company still expects calendar year 2023 revenue growth of approximately 15% to 20% above the 2022 revenue guidance. Your line is open. Your line is open. Your line is open. Your line is open. I think everything we look at, we kind of take a very careful look, especially at the vehicle production forecast levels, but also our revenue in general, and try to understand and estimate that whatever we're seeing or whatever our customers are telling us is probably going to end up being 2% to 4% higher than what it's really going to come in at. Your line is open. Your line is open."
}