{
    "symbol": "GNTX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 14:14:05",
    "content": " For the fourth quarter of 2022, the company reported net sales of $493.6 million, an increase of 18% when compared to net sales of $419.8 million for the fourth quarter of last year. Income from operations for the fourth quarter of 2022 was $94.1 million, as compared to income from operations of $88 million for the fourth quarter of last year. In the fourth quarter of 2022, net income was $86.2 million, as compared to net income of $84.2 million in the fourth quarter of 2021. For calendar year 2022, the company's net sales were $1.92 billion, which was an increase of 11% compared to net sales of $1.73 billion in calendar year 2021 and represented the highest annual sales in company history. Light vehicle production in 2022 increased by 3% when compared to last year in the company's primary markets, but total revenue for the year outperformed the underlying market by 8% despite the many supply chain challenges and customer order volatility encountered during the year. For calendar year 2022, operating expenses increased 14% to $239.8 million, when compared to operating expenses of $209.9 million for last year. Net income for calendar year 2022 was $318.8 million, down 12% compared to net income of $360.8 million last year. For calendar year 2022, automotive net sales were $1.87 billion, which was a 10% increase over 2021. Other net sales in the fourth quarter, which includes simple aircraft windows and fire protection products were $10.7 million, an increase of 5% compared to other net sales of $10.2 million in the fourth quarter of 2021. Other net sales for calendar year 2022 were $44.2 million, compared to other net sales of $33.9 million in calendar year 2021. For the year ended December 31 of 2022, the company repurchased 4.04 million shares of its common stock at an average price of $28.19 per share for a total of $113.9 million. Fourth quarter 2022 cash flow from operations was $101.8 million, which was an increase from $69.1 million in the fourth quarter of 2021 and year-to-date cash flow from operations was $338.2 million, compared to $362.2 million for calendar year 2021. Capital expenditures for the fourth quarter were $38 million, compared with $30.8 million for the fourth quarter of 2021 and calendar year 2022 capital expenditures were $146.4 million, compared to $68.8 million for calendar year 2021. And depreciation and amortization for the fourth quarter was $23.3 million, compared to $24 million for the fourth quarter of 2021 and calendar year 2022 depreciation and amortization was $96.6 million, compared with $99.1 million for calendar year 2021. Additionally, based on the company's current forecast for light vehicle production for calendar year 2024, the company expects calendar year 2024 revenue growth of approximately 10% above the 2023 revenue guidance range of approximately $2.2 billion. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}