{
    "symbol": "OCSL",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-07 12:16:04",
    "content": " For the first quarter, we reported adjusted net investment income of $37.1 million or $0.61 per share, up 10% from $33.7 million or $0.55 per share in the fourth quarter of fiscal year 2022. If base rates as of December 31st were in effect for the entire quarter, we estimate that our adjusted net investment income per share would have been about $0.03 higher resulting in adjusted NII of $0.64 per share. At quarter end, the Kemper JV had $409 million of assets invested in senior secured loans to 59 companies, up from $385 million last quarter, primarily driven by $25 million of additional contributions from the company and our JV partner, as well as new originations and partially offset by declines in the portfolio due to market credit spread widening. The JV generated $2.6 million of cash interest income for OCSL in the quarter, up from $2.2 million in the fourth quarter as a result of the portfolio's continued strong performance and the impact of rising interest rates on floating rate investments. The pricing is pretty much in the SOFR plus $650 million to $700 million range and with SOFR 4% and with OIDs on origination of two or three points, they're solving to about 12% -- 11.5% to 12% for sponsor-led deals. And Armen, you gave, I would say, fairly downbeat commentary on the outlook for credit quality, at least in the private credit markets broadly, given that fundamentally, it sounds like unlevered business performance is performing not great, given tightening EBITDA margins and then obviously there's pressure on levered cash flow given higher rates. You all provided the estimated range of interest coverage of 2.5 times, which is slightly declined from the prior quarter, which provides some, I think, some value, but really in this marketplace, it's really going to be the tail end risk of those borrowers that are going to be -- is really the tail risk from higher rates on certain borrowers that are running closer to that lower leverage point."
}