{
    "symbol": "VCYT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 20:49:04",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to Veracyte's First Quarter 2022, financial results conference call. As a reminder, today's conference call is being recorded. With me today are Marc Stapley, Veracyte's Chief Executive Officer. Rebecca Chambers, our Chief Financial Officer, Dr. Tina Nova, President of our U.S. CLIA business, and Dr. Giulia Kennedy, Global Chief Scientific Officer and Chief Medical Officer. This news release, along with a business and financial presentation, is available in the Investor Relations section of our website at Veracyte.com. Before we begin, I'd like to remind you that various statements that we may make during this call will include forward-looking statements as defined under applicable securities laws. To better understand the risks and uncertainties that could cause actual results to differ, we refer you to the documents that Veracyte filed with the Securities and Exchange Commission, including Veracyte's most recent Forms, 10-Q and 10-K. Reconciliation of these measures to the most directly comparable GAAP financial measures are included in today's earnings release, accessible from the IR section of Veracyte's website. I'm delighted to share an update on our strong first quarter results, which included revenue of $67.8 million, an increase of 85% year-over-year. Veracyte's success is built upon our ability to answer important clinical questions that enable physicians to make better-informed care decisions, helping patients avoid unnecessary surgeries or other interventions, and accelerating time to appropriate treatment. Our tests address eight of the 10 leading cancers by U.S. incidents, as well as interstitial lung disease, or ILDs, and have benefited over 350,000 patients to-date. Keith is an idiopathic pulmonary fibrosis patient in Southern California whose story demonstrates the challenges in diagnosing ILDs, including IPF, and the important value our Envisia test provides. After the initial incorrect diagnosis of pneumonia, Keith sold five pulmonologists and underwent additional tests and midst diagnosis over a span of 18 long months. Finally, his new pulmonologists at UCLA, an early user of Envisia, offered him our test. Keith is doing well at the moment and is enjoying extensive travel with his wife Lorna, we wish them both well and thank them for allowing us to share Keith's story. With patients like Mr. Ball in mind, we were encouraged to see that an updated clinical practice guideline highlights the role of our Envisia Genomic Classifier in the diagnosis of IPF and other ILDs. Additionally, a review article on separate commentary on the Envisia classifier appear online in Anil's ATFs. All three articles are published in official publications of the American Thoracic Society and reinforce the intended clinical value of our test, which is to enable physicians to make a confident diagnosis of IPF without the need for invasive surgery. We look forward to continuing to engage with the pulmonology community to advance understanding of the role our test can play in patient care, and to further reinforce the evidence supporting the testability to positively impact patient outcomes. We believe our continued growth has benefited from key publications, particularly of clinical utility data from a randomized Phase III trial, which were presented at the recent ASCO GU symposium, and confirmed a key role for the test as a prognostic that can help physicians and patients make first-most treatment decisions in the intermediate risk setting. We are looking forward to the ASCO meeting in Chicago next month where additional clinical utility data will be shared, characterizing the Decipher Prostate test usage and association with treatment decisions for men with prostate cancer in both the post-biopsy and post-surgery phase. The findings are based on data for the Decipher Prostate test which were linked to the National Cancer Institute's Surveillance, Epidemiology, and End Results. Additionally, at the upcoming American Urology Association meeting, our KOL partners will share data to provide new insights into the genomic underpinnings of prostate and bladder cancers. These data are derived from analysis of our extensive and growing decipher grid database, which contains genomic profiling information for over 100,000 clinical samples used in the development and commercial use of our Decipher prostate and Decipher bladder test. Turning to Afirma, our most established and highest volume diagnostic test we were pleased with our test growth of almost 10% during the quarter and our ability to impact more patients. Moving to our lung portfolio in addition to the new ILD guidelines, we are encouraged by early signs of recovery for our Envisia test, which saw a 27% increase in volume compared to the first quarter of 2021. In lung cancer, our team has done a tremendous job to prepare the Percepta genomic Atlas tests for launch. Having carefully evaluated the optimal utilization of this test to address the unmet clinical needs for lung cancer patients, where time to result in precious tissue sample at key factors and to optimize reimbursement, we have made the decision to explore novel channel opportunities for PGA that leverage its unique sample type tissue from diagnosis bronchoscopies directly into our preservative. Researchers there will present consensus findings from procure trial demonstrating European breast cancer experts’ beliefs regarding the role of gene expression profiling tests, including Prosigna, to inform treatment decisions among women with early stage breast cancer. We also delivered very strong quarterly growth in biopharma in tandem with further solidifying our offerings for biopharma partners, which are intended to leverage our robust multiomics and immuno-oncology capabilities along with our extensive clinical data. At the American Association for Cancer Research or AACR meeting last month we introduced our new Veracyte biopharma Atlas, which we believe is uniquely positioned to help advance the next-generation of precision medicine in oncology. Of note, we are particularly excited by some of the novel immuno -oncology insights that we are uncovering through our biopharma and academic partnerships, and look forward to revealing more in several abstracts being presented at ASCO and through other exciting publications that we anticipate in the coming months. As the largest cause of death amongst all cancers by far, lung cancer is a disease that particularly affects smokers or former smokers, and one that can often be successfully treated when caught early. While a highly-sensitive imaging approach low dose CT under existing screening recommendation is very effective at identifying patients with potentially cancerous lung nodule s, physicians need a more objective, accurate tool to determine next steps for those patients. Already clinically validated, our test could be used to assess patient risk, noninvasively, alongside the CT imaging standard of care to help avoid unnecessary procedures for low-risk patients while accelerating time to treatment for high-risk patients. We believe that the ILDs screening paradigm is here to stay given its high sensitivity, proven reduction in mortality rates, inclusion in U.S. PSTF guidelines, and relatively low cost to the healthcare system. With diagnostic tools like our Percepta Nasal Swab, we anticipate the more and more physicians and their patients will achieve greater confidence in annual screening. We look forward to the presentation of new data at the American Thoracic Society meeting this month, which evaluate the ability of the Percepta Nasal Swab test to accurately assess lung cancer risk among current and former smokers with lung nodules, regardless of best smoking burden history. Our IBD development and R&D teams are working closely together to launch our Envisia test as an IBD on the encounter instrument in 2023, followed by our Decipher prostate and Percepta Nasal Swab test in each of the subsequent years respectively. As we build this menu on the encounter, we will be creating opportunities for labs in many countries to make these tests available to their patients. Meanwhile, our commercial and market access teams are working hard to pave the way for reimbursement of these tests country by country, and our scientific teams continue to build a body of evidence needed to support both reimbursement and adoption, leveraging the work that is already done for the U.S. market via our centralized CLIA lab model. By the end of next year, we expect to be fully manufacturing the kits in France, enabling us to benefit from the end-to-end management of the supply chain for these kits. With that, I will turn the call over to Rebecca to review our financial results for the quarter, and expectations for 2022. As Marc mentioned, our strong first quarter performance exceeded our expectations with total revenue of $67.8 million, an increase of 85% over the prior year. We grew total volume to over 23,200 tests of 61% increase over the same period in 2021, and a 4% increase compared to the fourth quarter of last year. We delivered over 8800 Decipher urology tests, which exceeded our expectations, leading in part to testing revenue of $56 million, an increase of 69% versus the prior year quarter. Testing ASP was approximately $2,650 per test, up slightly sequentially. Testing volume was approximately 21,000 tests, including close to 11,000 Afirma tests of almost 10% year-over-year, as Marc mentioned. Due to the change in the billing code for Afirma in 2021, we have had some delays in collections that impacted ASP in the quarter. First quarter product volume was approximately 2,200 tests, resulting in revenue of $3 million, down slightly compared to Q1 2021 as volume growth with more than offset by a decline in the Europe. Biopharmaceutical and other revenue equaled $8.8 million, as growth in our immuno-oncology offering was bolstered by the timing of biopharma milestones and contract IVD activities. This timing impact, as well as better than forecasted urology cash collections added approximately $2 million of revenue to our first-quarter results. We've chosen to call out, select non-GAAP measures to provide useful supplemental information about the financial performance of our business and enable comparison of financial results between periods where certain items may vary independent of business performance. I encourage you to review the GAAP reconciliation of these non-GAAP measures, which can be found in today's release available on our website. Non-GAAP gross margin was 65%, a decrease of 100 basis points sequentially driven primarily by the fourth quarter, $4 million J&J Nasal Swab milestone. Biopharmaceutical and Other gross margin was 49%, exceeding expectations given the timing of milestone and IVD development revenue, and lower sequentially due to revenue from the milestone recorded in the prior quarter. Non-GAAP operating expenses, excluding the cost of revenue, increased $2.9 million sequentially to $49.1 million, primarily driven by higher compensation-related expenses associated with annual merit increases and the timing of payroll taxes. Accordingly, sales and marketing expenses grew $1.4 million to approximately $22.5 million, and G&A expenses were up $2.6 million to $18 million. Research and development expenses declined by $1.1 million to $8.5 million, driven by the timing of clinical trial and project spend. Net cash used in operating activities was $8.9 million, and we ended the quarter with approximately $164 million of cash and cash equivalents. We now expect revenue of $265 million to $275 million, or 21% to 25% growth versus the prior year. This range, compared to our previous guidance of $260 million to $275 million, reflects our strong performance in the first quarter. For the remainder of the year, we are projecting slightly higher Q2 revenue, followed by a sequential decline in Q3 given summer holidays before finishing 2022 was quarter-over-quarter Q4 growth. In closing, we are very pleased with our performance so far this year, we continue to have confidence in our financial position and remain focused on execution in 2022 and beyond. And Tina Nova, President of our CLIA U.S. business, and Giulia Kennedy, Global Chief Scientific Officer and Chief Medical Officer will join us. Your line is open. Hey, I was hoping maybe Tina or somebody could just jump into some of the performance and decide for me to get a little bit more information about what's continuing to drive that growth better than your expectations. And then the second question is, good to see Afirma up around 10% that seems like that's also a little bit better than maybe you guys were thinking about there. Yeah, we're very excited about that performance of Decipher and it's just continue to improve and grow and as you said, increase penetration into the market. And for this last quarter, the sales team productivity was at an all-time high. And we have continued to bring sales reps in as you know, and do a lot of very, very extensive training and we're really making headwinds out in the field. And just as a reminder, the market is still only 20% penetrated, so we still have a lot of room to grow in the future, which makes it a very exciting product. So we're almost back to normal there, so it's great to see that increase in Afirma. Just -- so we saw a 10% volume growth, which I think is great, and our team is doing a really nice job there of getting new physicians and continuing to go off to the long tail there. We did see some headwind on the ASP side that Rebecca mentioned in her comments, and so we're going to continue to focus on that. So when you net it all out, the revenue growth, I'd say, was roughly in line with our expectations, maybe a little bit lower, but it doesn't really change our perspective for the rest of the year. So on a volume basis, I would say an expectation in the high single-digits, maybe not all the way to 10, but we are expecting volume in the high single-digits, but that to be biased down slightly because of some of the ASP items that we're improving on the revenue basis. Your line is open. I'd be happy to and Decipher -- think about the organic and inorganic drivers of this business as being one, happy to give the disclosure that you require -- that you requested. But before we get there, we are managing the business from a portfolio perspective and make resource decisions across the portfolio accordingly. We have a portfolio business that it has different products, each of them are in their respective portions of the life cycle. And when you stack those effectively, what happens is in any given quarter you have pluses and minuses across the board. And that's exactly why the company was foreshadowing and did by the Decipher and Halio assets, and effectively gain the growth that they are offering here. So when it comes down to it, Decipher contributed the vast majority, not the vast majority, but the majority of growth on a year-over-year basis, just over $20 million. You can actually see the full-year number is in the Q I'm sorry, not the full-year number, the total quarterly numbers in the Q and Halio was just over $7.5 million. But this was very purposeful on our point and the acquisitions recognized the strategy of the company and will aid us to that end, and we are pleased with their contribution in the quarter and our expectations for them going forward. I mean, as you know, we talked about this before that Afirma is a very mature, we believe the markets over 50% penetrated by test like Afirma. And so it's towards the latter pub is still growing as you just heard, part of it slides cycle Decipher is a product that's an inflection point of its life cycle. Great, that's helpful, thanks. And, Dan, really good to hear about the continued evidence generation for the Percepta Nasal swab. We can't get any more detail than we've already provided because obviously it's going to be presented, but I don't know Julie, if you want to spend any time on the evidence development that we're doing and our philosophy and approach there. So for the Percepta Nasal Swab, I can't say that the test has been clinically validated and we continue to look at the data and provide more and more detailed information about how the tests can be used in various populations. And specifically, some of the work that we're going to be presenting at ATS is going to speak to how the nasal swab performs in people with varying smoking burden. What are some of the incremental investments that still need to be made ahead of that launch, whether it's expanding your footprint, lab stuff, sales reps, equipment, any color on how to think about that would be helpful. I mentioned it in the remarks, but Nasal Swab is really a first-of-its-kind test in terms of it really is one of the -- it is a noninvasive test for people who are facing a potential lung cancer diagnosis. And as Julia mentioned, this test has been validated for people who have a lung nodule who are smokers or former smokers. In terms of the things that we need to do, we're going to spend the time over the next couple of years building the -- continuing to build the clinical utility evidence that is needed, getting KOL support, working our way towards guidelines and further evidence development. All those things, tried and tested, well-proven paths to getting a test reimbursed, which clearly is the end goal here. And appropriately so, this test will make an incredible difference in the lives of many patients, and it provides something extremely valuable to the physicians who are dealing with these patients themselves. In terms of actually operationalizing, as you know, because we have a broad pulmonology portfolio, we have the sales team already and we'll add salespeople as we need to. The lab is primed and ready to go, and again, it leverages a lot of the work that we've done for many, many years. And so really that's what we've got to focus on over the next period to get the test out as many patients as possible, which is the ultimate goal. I mean, it's just the data is actually hard to get after in terms of share, but we believe that Decipher prostate is doing a very good job at gaining share, but also importantly increasing the overall market. So, if you think about, as I mentioned earlier, Afirma, which is one of our most successful molecular diagnostics launched has gotten significant penetration, that overall market is, is around 50. If I use out of an analog, there's no reason that we shouldn't expect prostate to get there and beyond, so that's what we're working on. Your line is open. On the one hand, the Envisia, you now have the updated clinical practice guidelines, but there's relatively limited therapeutic options for IPF. So as you think about the medium-term here, any color you could share on the relative sizes of Envisia versus Percepta. At this point, the relative contribution from both of them in terms of revenue is relatively small because of two reasons. One there at the early stage, and two, for the last couple of years, they were both severely impacted by COVID given the physician s that we're targeting there and the procedures. As I mentioned in the remarks, Envisia grew really nicely this quarter. And then getting those guidelines out with so much extensive discussion around Envisia and such a significant number of respondents actually recommending the use of Envisia, I think that's a really encouraging sign for that product. And, of course, Nasal Swab, if you think about it, that's by far the largest market that we're tackling with our pulmonology portfolio, and that's where we're putting the bulk of our investment in order to grow this entire lung portfolio. And then, Marc, just given the broader market backdrop here and the geopolitical uncertainty, etc., even concerns of a recession, are you revisiting any of your expansion plans with a focus on perhaps near-term revenue generating opportunities versus perhaps something which is important that potentially is not going to move the needle for you for, let's say, like two-and-a-half years or three plus years? Let me answer the first part and then Rebecca, you can answer the part of around margin, but you're coming in. Of course, we went out multiple years because we have some of the large vectors of growth for the business that a multi-year. But we're also not starving the on-market products investment, which is what you would ask s -- expect us not to do. And so those long-term opportunities to grow, I think our goal,-- I believe our goal is to move as quickly as we can to bring those products to market, whether it's Nasal Swab, all the IVD products outside the U.S., make them available to patients, we know what it's going to take to get there. Meanwhile, we're making sure that Afirma, Decipher and the rest of our products are continuing to get the appropriate level of investment\n And on the margin side, Tejas, not just a similar answer. And obviously we do have opportunities to increase efficiency of the lab, which we are actively undertaking as well as increased efficiency of our collections process which I commented on the script. So those two things will benefit margin accordingly, and we're setting ourselves up for really having a nice profile on a go-forward basis based on the activities we are working on in hand. But when it comes down to it, we're managing this business to be plus or minus, breakeven and we will burn a little bit of cash this year is as we go through some of the contingent consideration of the Halio acquisition. Your line is open. So we did -- in my portion of the script, we did comment that we do expect to see sequential growth in the second quarter and then to see a step back in the third quarter as we experienced typical summer holidays and as the associated seasonality. And when it comes down to it, whether that's growing gangbusters are impacted by COVID, it's really within the scope of our guidance range. Afirma, we saw access improved throughout the first quarter, but effectively where access for our reps was a challenge and perhaps January by the end of the quarter, we made it up. Decipher is contributing very nicely to the total company overall growth rate, and I would say is additive to it but I wouldn't want to go beyond that. Your line is open. So whatever we need to service that IVD business, which is point is primarily Prosigna, next year will be Envisia. On the other hand, thinking -- talking about the biopharma business, what's really great about biopharma now is we've put the biopharma organizations of three companies together into one global organization. And offering our services to biopharma partners who -- we're getting, we're getting a lot of traction with those partners at this point. We announced, as I mentioned, the Alice and you brought that up and that's one of the one of the areas of I think strong interest that we're seeing in biopharma. I mean, using our proprietary assays we're able to populate these databases with multi-cancer data, metastatic initially, and that's a great interest to biopharma partners as they're looking at their clinical trial development that companions their drug development, looking at clinically relevant biomarkers, trying to identify patients, etc. So lots of great work going on in our biopharma business, and we'll talk more about that in the future. And one thing is -- I think, one of the great things that comes out of those relationships actually is publications. Nothing we can really talk about at this point too much, but I think we'll look for some really interesting potential opportunities in the future there. Obviously, you guys just announced the inclusion of Envisia into those ATS guidelines. Yes, I mean, let me start with the kind of macro pointed then, Tina, maybe you want to talk about the approach with Decipher, which I think is really a good illustration of the power of this but typically what we're trying to do with the evidence development that we invest in is to gain KOL support, educate physician, and end up in guidelines as well and that formula has worked very well for us in the past. So whether it's Nasal Swab in the future, which of course we think should be in guidelines and we'd like to get it there or continuing growth in the number of respondents who recommend in busier or continuing on our other products. But Tina, do you want to talk a little bit about the success so far and what's you got more room to go as far as the guidelines. And I think they're very important and continuing to work on trials and to produce more and more clinical evidence to strengthen those guidelines, that's something that we continually think about. It just really focused on the key clinical value of our tests, and that gives us something to go to the physicians and talk about and they are very, very interested in those kind of discussions. Your line is open. Maybe the first one, I don't know if this was covered already, but in terms of labor costs, we're obviously seeing that labor inflation happening in a number of labs. While we are expecting to continue to see that at its current state, it's not necessarily really biasing our margin expectations at this point in time. In terms of -- I am sure you provided -- you have provided some details on Nasal Swab, but I just wanted to understand. Maybe just help us understand; how should we think about this upcoming dataset versus what you have presented, and from a -- in terms of the performance of the data or how meaningful it could be, just help us understand where we stand in terms of the data here. Pretty on that one, I mean, Julia talked a little bit about this earlier on, but I wouldn't -- that dataset isn't going to replace the great data that's already been presented recently it's another cut of the data that looks at smoking burden. But in terms of the overall performance of the tests, I mean, remember, this is a test that is for, it's highly sensitive and highly specific. It's good for rolling in and rolling out, as I mentioned in the script. And the way we see it being utilized in the market is for any patient who has had a lung nodule found bio LDC, which as I mentioned earlier, is very sensitive of finding lung nodules. And then Decipher continues to obviously do well, but maybe this question is more about Afirma. So maybe just can you sort of elaborate, how should we be thinking about the growth rate on Afirma, longer-term given the sort of the magnitude of this, it contributes to your revenue. I think we did our best to address that question a little bit earlier on where we shared that in the quarter, Afirma grew close to 10% from a volume perspective, albeit slightly less than a revenue perspective for the reasons that I stated in the script. As we look forward throughout the course of 2022, I think the mid to high single-digit estimate that was throwing out there is not unreasonable. Obviously, I can't go into the details of that, but we will be showing data that really demonstrates that Decipher increases utilization in the area of active surveillance. In closing, I'd really like to express my appreciation for my leadership team and for all our employees throughout the company. We introduced the brand new organizational structure in January and through the collective team's hard work, dedication, and collaboration, we're already seeing the benefits, and that reflected in our strong Q1 execution. We're also investing in our corporate culture, we completed some important work during the quarter to define the culture we want to enable us to drive our performance and achieve our ambitious goal of becoming a global diagnostics leader. I couldn't be proud of our team or more excited about where Veracyte is headed, and I look forward to updating you on our progress in our next earnings call."
}