{
    "symbol": "VCYT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 00:13:01",
    "content": " Good afternoon, everyone, and thanks for joining us today for a discussion of our fourth quarter and full year 2022 financial results. With me today are Marc Stapley, Veracyte's Chief Executive Officer; Rebecca Chambers, our Chief Financial Officer; and Dr. Tina Nova. Before we begin, I'd like to remind you that various statements that we may make during this call will include forward-looking statements as defined under applicable securities laws. To better understand the risks and uncertainties that could cause actual results to differ, we refer you to the documents that Veracyte files with the Securities and Exchange Commission, including Veracyte's most recent Forms 10-Q and 10-K. Reconciliation of these measures to the most directly comparable GAAP financial measures are included in today's earnings release, accessible from the IR section of Veracyte's Web site. I'm pleased to share that we ended 2022 on an incredibly strong note, hitting an important milestone as we delivered our high value test to more than 100,000 patients and their physicians during the year, enabling better diagnostic, prognostic and treatment decisions are pivotal moments in the race against cancer. Further, our 2022 ending cash balance was slightly higher than the prior year, a result of our philosophy to balance cash generation with investing in our long-term growth drivers. The Decipher test is uniquely suited to address these challenges, given it is indicated for over 90% of prostate cancer patients currently, and we and others are building evidence to demonstrate our test clinical utility in metastatic cancer as well. This growing body of evidence for Decipher Prostate led to us delivering over 12,000 test results in the fourth quarter, demonstrating further penetration into a market where we believe that three out of four men with prostate cancer still don't receive a molecular diagnostic test. In 2022 alone, there were over 40 scientific abstracts and publications demonstrating the prognostic and predictive value of the Decipher Prostate test. Further, we engaged in 23 Phase 2 and Phase 3 clinical trial collaborations with some of the world's most prominent prostate cancer researchers. Last week, data from three trials of the Cancer Clinical Cooperative Group and RG Oncology were published in the International Journal of Radiation Oncology, Biology, Physics, The Red Journal, suggesting that the Decipher Prostate test provides prognostic information to help personalize treatment decision making. Our focus on serving neurologists also includes our Decipher genomic resource for intelligent discovery, or GRID database report, which we share on a Research Use Only basis with physicians who order it alongside the Decipher Prostate Genomic Classifier. We recently introduced an enhanced version of GRID to provide more granular genomic information about a patient's tumor based on whole transcriptome biomarkers that have been broadly evaluated in the diagnosis, prognosis and treatment of prostate cancer. Further, we believe that our Decipher GRID database is helping to advance the science around prostate cancer molecular subtypes, an emerging area of increasing interest for researchers. Among six Decipher-focused abstracts presented at the ASCO GU Cancers Symposium last week, one study's findings suggested that a Decipher GRID-derived signature can enable more personalized prostate cancer treatment decisions for patients based on their molecular subtype. This study demonstrated, for example, that after radical prostatectomy, men with basal immune tumors derived the greatest metastasis-free survival benefit from post operative radiotherapy, while those with other subtypes did not see the same benefit. Looking ahead to 2023, we believe that with our exceptional test, robust clinical evidence, world class sales team and effective marketing programs, we are uniquely positioned to continue driving adoption of our Decipher Prostate test in a growing market that is still only 25% penetrated. Our momentum continued to build in the fourth quarter, which resulted in the new record for tests and revenue delivered. We reported over 12,500 Afirma results with growth driven by new accounts, including competitive wins, and expanding utilization in our existing accounts. As we've said previously, we expect this momentum to continue into 2023, driving Afirma revenue growth in the mid-to-high single digits. Similar to Decipher, we continue to leverage our strong and growing library of clinical evidence to support the continued adoption of Afirma. This included the publication of a meta-analysis of 13 independent studies in the Journal of Clinical Endocrinology & Metabolism, showing that the test real-world performance was similar to and in some cases even better than the original clinical validation results. This study, which covered nearly 2,000 patients with indeterminate thyroid nodules, further demonstrates the clinical utility of Afirma in helping to avoid unnecessary surgery for hundreds of thousands of patients. As we evolve and enhance our test, we believe we will continue to further penetrate this market, especially in areas where we can provide valuable information around personalizing treatment, such as guiding the extent of surgery. We also continue to focus on enhancing the customer experience, including making the test as easy as possible to order and use. Previously mentioned, in Q3 we introduced an online portal to enhance the ability to order test kits, track progress, and see patient test results. This study published in Frontiers in Endocrinology suggests the ability of Afirma testing to help further personalize care for patients with thyroid nodules by informing on TSHR, a rare gene mutation. Decipher and Afirma adoptions are great illustrations of the proven framework we utilize, which starts with identifying a specific clinical unmet need. Then we develop a test to address that need, along with securing the clinical evidence, reimbursement and guideline inclusion to drive market penetration. This successful approach enables us to invest in our long-term growth drivers, namely our Percepta Nasal Swab in lung cancer and the in vitro diagnostic or IVD versions of our tests for global expansion. During the quarter, we continue to make progress on the NIGHTINGALE clinical study designed to demonstrate clinical utility and support reimbursement for our Percepta Nasal Swab test. This study remains a key focus in 2023, as we aim to complete enrollment around the end of this year. We're excited about the potential of the Percepta Nasal Swab to benefit patients and physicians as a non-invasive test to help guide clinicians next steps for patients with potentially cancerous lung nodules, while also contributing meaningfully to the company's long-term growth. As I have previously shared, we were aiming to submit our Envisia Genomic Classifier to European regulators in 2023, and I'm pleased to share that we actually achieved this goal in December ahead of schedule. While the commercialization efforts will begin post the completion of the regulatory process, we have initiated premarketing activities in Europe, including training our sales and market access teams and KOL education. Our other IVD development projects remain on track for regulatory submission according to our previously announced schedule, Decipher Prostate in 2024 and Percepta Nasal Swab in 2025. In addition, the second phase of our transition of our IVD kit manufacturing from NanoString to our facility in Marseille is on schedule to be completed around the end of this year. An example abstract was focused on data derived from the PIONeeR project, a large international trial evaluating patient response to immune checkpoint inhibitors. This study suggested that use of Veracyteâ\u0080\u0099s Brightplex technology could help refine the stratification of patients with advanced non-small cell lung cancer, who are more likely to benefit from immune checkpoint inhibitor therapy. In 2022, we added many new pharma customers, expanding our outreach and forging a stronger presence in the U.S. market. While we see significant opportunities to help our partners advance their oncology drug development programs, we also anticipate some near-term unfavorable impact on our biopharma business due to the current macro environment, and have incorporated this in our guidance for the year. In this role, Annie will not only lead our legal organization, but also our HR team, driving our efforts to embed and grow Veracyteâ\u0080\u0099s unique culture while also attracting and retaining world class talent to ensure our ability to scale the business. In addition, Rebecca Chambers, our CFO, has recently taken on an expanded role as she now also leads our CLIA operations teams, helping to drive continued strong execution and consistency across our three CLIA sites in the U.S. as they deliver our tests to physicians and patients. During 2022, as evidenced in our result, Tina Nova has provided incredible leadership to our CLIA organization and our three businesses of urology, endocrinology and pulmonology in the U.S. Given the progress made and the strength of leadership she has built in our CLIA team, including John Leite as GM of Pulmonology & Market Access; and Brent Vetter as GM of our Afirma business, Tina is asked to continue to support the Decipher franchise while also pursuing other personal interests outside of Veracyte. To enable this, John Leite is now reporting directly to me and is also providing leadership and oversight to the Afirma business supporting Brent, while Tina focuses entirely on urology, also reporting to me. Number one, continue to fuel near and midterm growth by further penetrating the underserved prostate and endocrinology markets. Two, invest in our long-term growth drivers of nasal swab and IVD products as well as in our business infrastructure to grow and scale. As Marc said, we had a record quarter with 80.3 million in revenue, an increase of 19% over the prior year. Testing revenue during the quarter was 70.3 million, an increase of 32% year-over-year, driven by higher than expected Decipher Prostate and Afirma volume. Testing ASP was $2,700 as we benefited from approximately 1.5 million of better than expected cash receipts, due in part to catch-up Afirma collections. Fourth quarter product volume was approximately 2,300 tests and product revenue was $3.2 million, up 17% year-over-year. Biopharmaceutical and other revenue totaled $6.8 million, down 39% year-over-year, driven by the $4 million milestone received in the fourth quarter of last year. Moving to gross margin and operating expenses, I will highlight non-GAAP results, which exclude the amortization of acquired intangible assets, other acquisition-related expenses and restructuring costs but does include routine stock-based compensation. Non-GAAP gross margin was 67%, up approximately 50 basis points compared to the prior year. Testing gross margin was 72%, up 300 basis points compared to the prior year, benefiting from higher lab volume and long data collections. Biopharmaceutical and other gross margin was 30%, down year-over-year due to the milestone recognized in the fourth quarter of 2021. Non-GAAP operating expenses, excluding cost of revenue, were up 11% year-over-year at $51.1 million, driven by ramping clinical trial and project expenses as well as higher personnel costs. Research and development expenses increased $1.5 million to $11.1 million, sales and marketing expenses increased by $2 million to $23.2 million and G&A expenses were up $1.4 million to $16.8 million. We ended 2022 with 178.9 million of cash, cash equivalents and short-term investments higher than the balance of 177.4 million at the end of 2021. We project total revenue of $325 million to $335 billion, or 10% to 13% growth year-over-year. Biopharma and other revenue is expected to decline year-over-year given the impact of a sizeable biopharma customer pulling back on planned spending, the current macro environment and the continued transition of our manufacturing resources from our IVD services business to our in-house IVD development. For the first quarter, we are forecasting a sequential decline in revenue given typical seasonality. We expect non-GAAP gross margin, excluding the impact of intangible amortization, to be in the mid 60s for 2023, roughly in line with 2022 as we implement operational efficiencies to help offset rising costs. As always, our comments are barring potential M&A as well as the known impact of prior acquisition-related contingent consideration expenses. In 2023, we anticipate being able to continue to invest in our long-term growth drivers while maintaining a roughly neutral year-end cash balance. Your line is open. We were pretty explicit about the assumptions from a testing and product basis in the commentary of mid teens for both, and won't necessarily go into the volume versus ASP assumptions for that broader than saying on the Afirma side, we do expect mid-to-high single digits, and that will be a mixture of the two. And on the Decipher side, we expect ASP to be roughly flat on a year-over-year basis with the growth coming more on the volume side. Importantly, we are excited about the biopharma business over the longer term and are really being impacted here by one bespoke  customer as well as expectations on the overall macro environment, as well as moving some of our IVD resources around to help satisfy our own development needs, which we are excited about over the longer term as well. But obviously, with the vast majority of revenue coming from Afirma and Decipher, we have a great outlook for both of those products in 2023. If I heard you correctly, I think you said that should finish enrollment by the end of the year. As we've said before, I think the first key milestone is exactly that one that we complete enrollment around the end of this year. And that's the first kind of real, I think, indication here that things are progressing as they should be and as we're expecting them to on the NIGHTINGALE trial. And then that will be the next time you'll probably hear more from us on that, and then that will help guide both reimbursement and then the premarketing and commercial activities. But as I said, the first key milestone is completing the NIGHTINGALE enrollment. One moment please for our next question. Your line is open. Yes, and maybe just kind of take a bit of a step back and just talk about how we grow our business. But the first one I'd say is if you think about Decipher and that acquisition, which has been incredibly successful for us, products that are at that stage of commercialization, evidence development is there. I wouldn't say -- I'd never say never in terms of indications, but there's a couple of ways that we can expand. We've talked about this internally within our current products that leverage our existing sales force would be expanding within the indications that we currently have, metastatic and prostate cancer is a very good example of that. And then beyond that, we'd obviously need to think about that a little differently in other indications where we currently don't have a presence. But I wouldn't say there's any areas where -- specifically within cancer and we've been very clear that our focus is in oncology, where wouldn't be an area that might be of interest to us. But like I say, our core focus right now as a company is those four things I said. One moment please for our next question. Your line is open. How should we think about this business longer term, and just maybe help us parse that biopharma piece out for '23. One of the things that we've been very successful at in that business is driving repeat business, which means we're doing a really good job for the customers that we have and notwithstanding macroeconomic or budget decisions from them, we've been very pleased with the level of follow-on projects. And one of the things we've done this year is we've added a number of new customers, so diversifying and reducing the level of concentration that we have. And so that's one of the reasons why you've heard our guide from Rebecca here around this, which is in the near term, we're conservative about them. So I think when you think about the biopharma in the other line, recall that's by -- to Marc's point, that's the biopharma business, but as well the IVD manufacturing and development business. As we look ahead, given our focus on our own IVD development, that relationship will change, and it will be more concentrated in the biopharma piece. But actually our number of customers that we have added over the course of 2022 and really diversifying the portfolio is, call it, around 3x more than the number of customers that we have and contributing the vast majority of our revenue. So I think when it comes down to it, we're becoming more and more diversified to Marc's point in that revenue line, and that's going to help us over time have biopharma another revenue that is additive to total corporate growth as opposed to what is happening in 2023. Maybe just to add one more thing that I thought of as we were talking here, Puneet, is the -- there are three primary areas where we're working with biopharma, and one is in terms of identifying clinically relevant biomarkers, and that's probably the area that gets the most hit in these situations. And so, again, we're relatively diversified in terms of how we work with -- and abroad in terms of how we work with biopharma partners. And I'm not clear if you provide, and apologize if you provided earlier, but Decipher volume contribution in the 2023 guide, I think you said ASP will be flat. Obviously, Tina has been instrumental since the acquisition of Decipher and for the whole franchise of prostate. So that includes pulmonology, urology, endocrinology, in terms of those commercial teams as well as our market access in our CLIA lab operations, which includes the labs themselves, billing and customer care. If you just look at Decipher alone, a business that since acquisition on a quarterly run rate basis has essentially doubled in that timeframe and grown significantly. And so one of the things that Tina and I agreed was, especially given the talent that she's brought in and grown in the business, we've gotten to a point where a team is able to focus on urology, but also some other things and not have to spend her entire time working on that vast portfolio that I just described to you. No, I just -- as you know, Puneet, I love urology and I'm really happy to be focusing on it entirely. And as Marc said, it's grown so fast, and there's so much happening in urology. And the good news is we're having such great growth that we're able to do this, and it's the right thing to do at this point. And you may have seen that the cancer numbers have gone up in prostate, so itâ\u0080\u0099s the one cancer that everyone's really focused on for growth. And then, Puneet, you did ask if  explicit Decipher growth number and guide and the answer there is, itâ\u0080\u0099s not explicitly given the concentration of our revenue between Afirma and Decipher and the comments made, you can very easily back into what we're assuming though. But taking a step back, if you think about it, there are a couple of key milestones we've been tracking here. One is the submission of three products to the notified body, the first being Envisia, the second Decipher Prostate and the third nasal swab. And as I mentioned in the prepared remarks, we actually submitted Envisia in December ahead of the schedule we've talked about, and now we're waiting for that regulatory response and process to play out. Part one is behind us is a lot of the fulfillment, but the actual part of getting to the final manufacturing transition is planned for around the end of this year, progressing extremely well. From a CapEx perspective, there will be some CapEx over the course of 2023 for the transfer, but nothing that will come -- nothing from a materiality perspective, if you will, is they are relatively minor in nature, specific to cash and contingent consideration payments. Recall, just as a reminder, our guidance around cash is excluding the impact of contingent consideration payments, and there's actually two to be aware of. One is the HalioDx contingent consideration, which will hit in the first, third and fourth quarter of this year. That would be for the launch of two products, one of which hopefully we have Envisia approved over that timeframe, albeit that's out of our control. And then the second for planning purposes more so than discrete information, we have a partnership that has been publicly announced that there's a potential that they will be launching their product commercially on NanoString as well, which would trigger a second milestone payment for their contingent consideration. So of course, obviously, hitting those two payments is from a signal standpoint indicating that we're now on the path to a commercial product or commercial products. One moment please for our next question. Your line is open. Yes, it's a really great question. One of the first challenges that we have to get through is the regulatory approval, submitting is the partners within our control and responding to their queries and comments is, to a large degree, within our control, but the actual timeline is not. And so it's also hard to predict right now, because this entire IVDR process which replaced the old IVDD process is somewhat of an unknown quantity, both to them and to us. Now in the meantime, as I mentioned earlier in the remarks, we can do some parallel activities in terms of KOL, generating KOL support and so on. But to your -- to the other part of your question, if you think about it, getting the regulatory approval is just one important part of the equation, a really important one. That is a country-by-country activity, one that we've experienced that because that's exactly what we've done and are doing with Prosigna on that exact same platform. But again, as I mentioned, it's something that we have the team to do and we have the experience to do. In terms of the demand, remember, Envisia is a rare disease and there's not an incredible number of instances on an annual basis, even in Europe. Decipher Prostate, on the other hand, is a much greater market with what feels like quite a bit of pent-up demand for that product. And so our belief is by the time we get Decipher launched, then at that point we'd have three products on the menu at least. And that really starts to help inflect adoption more so than Envisia alone where Prosigna would, if that helps. Yes, and there's no real read through from getting Envisia done earlier in respect to the other two products for the simple reason that all three have been progressing in parallel anyway. Your line is open. But just on OpEx, I know you're not giving specific guidance but it looks like consensus is I think around 250 million give or take and implies like 60 million, 65 million in the quarter roughly. Yes, I think that's roughly reasonable, plus or minus a bit. We have a couple of important drivers that we're investing in for next year, which will lend themselves to step up in '23 versus '22, the first of which obviously is NIGHTINGALE, which is an investment we're happy to make given the market size for the nasal swab and the opportunity it presents itself. And then importantly, as we bring these -- as we continue to progress in building the foundation for long-term growth, we are investing a little bit more in infrastructure to really kind of provide cohesiveness, if you will, across the company and really ensure we can scale for growth. Commercial/sales and marketing, I wouldn't necessarily expect to see a ton of incremental investment there outside of a handful of heads here or there to support the continued growth of the urology franchise. And I think there's -- for next year, it's been estimated a little over 62,000 new cases of bladder cancer for 2023, just to give you a percent and 70% of that is in non-muscle and the rest is in muscle invasive. One moment please for our next question. Your line is open. Maybe following up on the prior question on Envisia regulatory submission, I know there are many moving pieces. Yes, I think, again, as I said earlier, to me the real inflection here in terms of our IVD strategy comes from the launch of the test like Decipher Prostate, which has a much larger market than Envisia does. Plus the path in the journey to get Envisia both reimbursements adopted includes guideline support outside of Europe, and the test hasn't been available outside the U.S. in Europe. And so no, I don't think you see a major uptick there from getting Envisia approved right away. If you look at the U.S., Envisia, the path to adoption has been slow, again, because of the fact that it's a rare condition and there's a lot of work to do to move an entire market that doesn't use a diagnostic test in interstitial lung disease over to begin to use one like this. So I think that -- think about it like it certainly helps and again, we learn a lot from both launching the test on the product and going country-by-country and driving reimbursement adoption that, again, helps us with the Decipher Prostate test and of course also menu. Having multiple tests on the platform helps drive adoption, which leads to your other point around the installed base. And so we'll leverage that for Envisia, and then subsequently for Decipher and then at the same time we're working country-by-country and lab-by-lab to increase the installed base and we're making some good progress there. It is both driving into new accounts, and we've talked about this before, the long tail of accounts of physicians who haven't yet adopted Afirma or in any other tests that does similar things to Afirma. And we've seen both of those dynamics over the last year, and especially we talked about that a little bit today on the last quarter. No, I was just going to say, obviously, to ensure we get the benefit of a tailwind of ASP for Afirma over the course of 2023, we've worked through the impacts that we have cited previously over the course of 2022 for ASP for Afirma, so we should naturally have at least in that neutral position going into '23, albeit we do expect, as I mentioned earlier, ASP to be more of a tailwind to Afirma than a headwind. And so I think depending on how successful our billing team is in collections, that could vary anywhere from a small to large tailwind as well. So I think between the impact Marc cited as well as the ASP impact, there's varying shades of gray here in terms of the goodness that we're seeing in Afirma. One moment please for our next question. Your line is open. A lot has been asked, so maybe just one starting on gross margins. As you think about gross margin and inflationary impact, a good portion of our COGS, at least on the testing line, are related to lab supplies and reagents. And given this is the beginning of the year, our contracts all technically allow for some sort of reset, as you would expect, at this time of year, which is why we're feeling it a little bit more today than we would have been six or seven months ago, when it would have been more wage related. As we look forward over the course of 2023, we did do a number of things over the course of 2022, which we'll see the benefit of to help offset some of those reagent costs increases as well as salary increases that we typically see start at the beginning of the year. And so on testing, we do expect to see testing gross margins in those high 60 type ranges, not necessarily the 72 we saw in the fourth quarter, but back more towards a more normalized level of the high 60s. And then obviously on the product line, we've already given explicit guidance there, so I won't necessarily reiterate it. So when you sum all that up, in any given quarter, I think mid 60s is a good a good estimate. And I'm sure we'll have a little bit of fluctuation, of course, through the year, but that's going to be highly dependent on the timing of different factors and so nothing trend worthy to note. Yes, they're really not in terms of how you think about it. Clearly, there's some things that we have to think about there in terms of the tactics. But if you think about the manufacturing transition today, we're already doing it for the Prosigna kits. The timing of these things, and I think if you think about the regulatory approval from Envisia, it's more likely than not that is going to come out of our own manufacturing supply chain, because it's going to take a while to get the approval and then drive adoption, as I mentioned earlier. Your line is open. As we sit here now in the first quarter of '23, weâ\u0080\u0099re really lapping the Omicron situation that we all dealt with a year or so ago. But in terms of in our current business, especially with the testing that we do in Afirma and Decipher, we really don't hear much about access at all. Where we do hear about staffing shortages, and again this isn't an access problem, it's a staffing problem and I'd call it a second or third order effect coming from COVID is with clinical trials, especially in pulmonology. And so I think that's one of the reasons that we've had to really ramp up the number of sites that we're looking at for NIGHTINGALE, which is one of the actions we've had to date, to drive even greater velocity in our NIGHTINGALE trail. 195 million, so very significant progress over the last year or so in commercial payer policy and contracting, still more room to go because that's not the same level we have for Afirma, for example. So as you can tell, I'm incredibly proud of our entire team for their hard work, talent and passion, which enabled us to achieve these great results in 2022. I'm really pleased with the growth in our core testing business, the progress we're making with our long-term growth drivers both in the U.S. and internationally and our strong financial profile, which sets us up for another year of exceptional execution. I want to congratulate the global Veracyte team for making a difference in over 100,000 patientsâ\u0080\u0099 lives in 2022 and to continuing their focus on transforming cancer care in 2023."
}