{
    "symbol": "FRGE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 18:17:13",
    "content": " We are helping investors, companies and private shareholders navigate this unprecedented market with our data, expertise and programs and believe it, with continued enhancements to our offering and with the value we're bringing to customers and potential customers during this disruptive time, we are well positioned to capitalize when markets stabilize. In the meantime, through our data, our expertise, our market insights, we're helping the participants in the private market to navigate this moment and we'll continue to go prudent so that we don't miss the opportunity that we have in this moment to convert that latent economic power into closed trades to cement our leadership position and to advance our powerful trading engine to deliver greater value for our customers and our shareholders. And really, in the quarter of time, that hasn't changed materially, building out our core business, continuing to improve our technology and increase the efficiency of our trading process, building our data business, which we're really -- we continue to be really excited about in terms of the opportunity, and we think the reception that we're getting from the market. Michael to -- and to reemphasize some of the points that was said â\u0080\u0093 that were mentioned earlier and the fact that we're starting to see our trade at valuations that are below the last round is an important indication that the private market, shareholders are starting to acknowledge and recognize the decrease in their valuations and the multiples that they had previously been trading at. And so what's lost in that is depending on the name, the time between when IOI comes on to Forge and a trade can happen is going to rely on interest in that name than the mindset of the seller, particularly in this particular environment where you haven't or just recently seen signaling the market around companies lowering the valuation expectation."
}