{
    "symbol": "FRGE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 01:24:02",
    "content": " At this time, I would like to welcome everyone to the Forge Global Third Quarter 2022 Financial Results Conference Call. Thank you, Emma, and thank you all for joining us today for Forge's third quarter 2022 earnings call. Joining me today are Kelly Rodrigues, Forge's CEO; and Mark Lee, Forge's CFO. Just after market closed today, we issued a press release announcing Forge's third quarter financial results. During this conference call, we may make forward-looking statements based on current expectations, forecasts and projections as of today's date. We discuss these factors in our SEC filings, including our quarterly report on Form 10-Q for the quarter, which can soon to be found on the IR page of our website and the SEC's file Web site. In our presentation today, unless otherwise noted, we will be discussing adjusted financial measures, which are non-GAAP measures that we believe are meaningful when evaluating the company's performance. As always, we encourage you to evaluate Forge's performance on an annual but also on a quarterly basis, while helpful to gauge our performance. Similar to my remarks on the previous earnings call, I'll begin with some brief commentary about what we're seeing in the broader market. As many of you already know, Forge is committed to increasing liquidity, access, transparency and efficiency in the private markets. Despite this challenging market, we made headway in international expansion and growing our data business and in product innovation to deliver future profitable growth. For the first three quarters of this year, we witnessed an 81% decline in the number of IPOs compared to the same period last year and a roughly 92% decline in capital raised by IPOs in the U.S. from $217 billion raised in the period last year to just $18 billion this year. After all, history shows us that many of the largest and most successful companies are created during downturns, which we believe, over the longer term, will become the next generation of private companies traded on Forge. Amid the volatility and facing persistent exit delays, the number of unique companies with sell-side indications of interest on the Forge platform remained above historic averages and in fact, reached an all-time high for any Q3 in Forge's history. Yet, we continue to see widening of the bid-ask spread during the quarter, peaking above 25% in August before beginning to narrow back down to 22% in September. The bid-ask spread is still a far cry from our historic median of about 12%, which is the level where we feel the market achieves price discovery equilibrium or PDE, as we referred to in prior earnings calls. We saw trades cross, on average, at 41% discount to company's last primary rounds. Year-to-date, companies listed on Forge markets traded 44% lower between Q4 '21 and Q3 '22. And while it's good to see more congruent behavior between the private and public markets, the key question is around whether we're reaching trough valuation levels across the markets. And on this front, we've seen some indications that companies are exercising their right of first refusal at slightly higher rates over the quarter. Although it's too early to draw conclusions here, if we start to see additional acceleration of companies ROFR in trade, that could be a sign that existing capital table investors are increasing their positions at current prices and could be an early indicator about trough valuations. Now, I'll briefly touch on the financial highlights of Forge's third quarter 2022, and then Mark will do a deeper dive. In the third quarter, total revenues, less transaction-based expenses were $15.8 million compared to about $16.5 million last quarter. Total custodial revenues were up quarter-over-quarter to $7.7 million from $5.7 million last quarter, reflecting the rising interest rate environment. Forge Europe will deliver to European participants the benefits of a liquid, transparent and efficient global private market. Through Forge Europe, we're moving forward on our commitment to expand internationally and becoming a truly global private market. We continue to see traction in our data business, since debuting Forge Intelligence a year ago. We've added new enhancements, including introducing a new comparison feature, which now enables investors to easily compare similar private companies through metrics such as trade frequency and price change since last funding ramp. This quarter, Forge also began aggregating third-party private market trade data. We're excited not only by the growth in Forge Intelligence's recurring revenue stream but also by the strong pricing power, sell opportunities and positive net dollar retention we're seeing due to increased features and use cases. We also began, for the first time in Q3, providing custodial services for Forge markets trading customers. It goes without saying, the diversification of revenue sources across markets, data and custody is an advantage in unstable markets like the one we find ourselves in today. We're being deliberate about the rollout, starting small and with a long-term strategy of working with banking partners to provide the capital this product requires. During this period of market instability, we've been conscious about cost containment and reduction of cash burn. We will continue to consciously manage spend while investing for growth, but we're committed to lowering our overall cash burn in 2023 compared to 2022. We're excited about the progress we've made, debuting our first lending product to unlock new inventory, increasing the value we deliver to customers through our data products and expanding internationally through Forge Europe, all of which accelerates the network effects of our unique model. I've said this before, but it's worth reiterating, with a strong balance sheet and a growing need for private markets infrastructure, we believe we're well positioned to extend our category leadership and return to revenue growth when the markets stabilize. Given the unique economic environment at this time, I will also be focusing my Q3 remarks in comparison to prior quarter. In the third quarter of '22, Forge's total revenues less transaction-based expenses were $15.8 million, down from $16.5 million last quarter. Of that amount, total placement fee revenues reached $8.2 million, down from $11 million last quarter. Transaction volume in this quarter was $226 million, versus $332 million in the second quarter, the ongoing result of inflationary and recession concerns compounded by geopolitical instability, which continues to create market dislocation. Forge's custodial cash balances totaled $685 million at the end of the third quarter, roughly flat from $680 million at the end of last quarter. And as Kelly previously stated, assets under custody were essentially flat at $15 billion in Q3 of '22 versus $15.3 billion in Q2. In the third quarter, adjusted EBITDA loss was $13.3 million compared to adjusted EBITDA loss of $12.3 million last quarter. Let me spend a minute on the structure of Forge Europe, which was the driver behind the $8.1 million and net cash provided by financing activities in the three months ended 2022. As Kelly has highlighted, the private market in Europe has demonstrated tremendous growth in recent years. Forge and Deutsche Borse have formed a strategic partnership that was funded with $14.1 million, $4.6 million from Forge and $9.5 million from Deutsche Borse Forge Europe's financial results are now consolidated under Forge Global with Forge having a controlling interest. 2023 will be the year of building of Forge Europe and evangelizing our private market vision throughout the EU and the U.K. Cash and cash equivalents ended the quarter at approximately $203 million, down from $205 million last quarter, highlighting a well-fortified balance sheet. We continue to focus on managing our expenses while balancing the need and the opportunity to invest for the growth of Forge platform, products and services and keeping with our vision and strategic plan and delivering and executing on our commitment to shareholders. Your line is now open. When you think about some of the improvement that you're seeing and hopefully that continues, I'm assuming some of the names are getting closer than others. So, remember, we put out this PMU every quarter, which is meant to give the market a broad sense of what's happening. But I think if you're a data subscriber of Forge, you can zoom into one name and take a look at what's actually going on in that name. So, -- but look, I think everyone is affected in some way by the condition that we're in right now. Devin, I would add that while looking at the existing bid-ask spreads is an important and helpful indicator, the other thing that we mentioned during this call was the fact that the transactions that we are closing are being completed at greater and greater discounts to the last round as well as I think 44% decreases from valuations that were created back in Q4 of 2021. And so, I think the important kind of data point to incorporate in addition to the spreads is kind of where are those trades being closed. And we've mentioned in the last call, the more public visible markdowns that private companies are taking. You recall Klarna raising capital at an 85% discount, Instacart going through three rounds of valuation decreases, 57% decline in total; stripe dropping their valuation 64%, that was actually a valuation that   put on their strength holding. So, I do think that the positive information that we're taking from all of this is that we are seeing valuations adjust in the private markets. Well, we're really excited about this, and we really started thinking about lending with a range of different applications. We fundamentally have a view that employees that become owners and not just stock option holders really serve broadly the private market and companies that are participants that are trying to change the world, realizing particularly in difficult times that employee retention is a big deal. And so, the idea that we started with something that was relatively small and relatively low risk, now on an enterprise basis, it's conceivable that you could see companies in the global unicorn crop today that want to broadly institute programs to convert their option holders into owners. And so, it shouldn't be a surprise to anybody that Forge is backed by some of the most sophisticated and interested banks in the world in the private markets. It serves companies' interests, and it really creates a unique opportunity for Forge to enter the market and be competitive. And so, that would be an opportunity to work with Forge to be able to monetize kind of the fruits of their labor, the wealth that they generated while working at those unicorn companies. And I'm sure, Devin, you've seen some of the companies modifying those plans to help assist with employees who have been part of a RIF or essentially looking at the work they put into a company thus far. And so, we think there's a particular acute opportunity here at this moment in the market. We don't think it's going to be -- because these are short-term loans, typically 30 to 60-day loans, we think that the amount of total capital that we need in our initial pilot will be relatively minimum. Actually, maybe more -- since we're talking about the balance sheet, and you ended the quarter with a strong cash position and expect to reduce cash burn from here, which is great, I'm assuming that doesn't assume any improvement in the operating environment. We think that this is a time when our competitors in this funding environment and anybody that's investing in this environment is really a cautious time and for Forge, we think the market needs critical infrastructure. And while we haven't given forward guidance on revenues for 2023, we're working on the assumption that the conditions that we're in right now will continue to persist until we start to see that price discovery equilibrium be reached. So, we're watching very carefully in Q4, but we believe through a combination of careful management of our costs and being really focused in '23 as the market recovers, we've got the potential to both lower our cash burn -- and we're going to do that. We talked about -- if you didn't hear it, the inverse relationship between our interest rate sensitive business around custody and the relationship between that and the relative volatility of both public and private markets. And you could see in the data already that in our Q3, part of our performance was buoyed by better-than-expected cash administration fees from the interest rate environment. And with lending coming online and the uptake of data, we think the quality of revenue and our relative performance in 2023 to other competitors that don't have that composition will serve us. Devin, I would just add that we are looking at other opportunities to continue to improve our markets revenue even in a challenging environment. Our data business and though we're not breaking that out separately, we continue to see a strong pipeline, high interest. Your line is now open. I was just wondering if you could maybe expand a little bit more on the partnership with Deutsche Borse and then maybe how you guys look at the size of that opportunity relative to the U.S. And then I think in the press release, you guys said that you were going to be first movers in Europe. And while we entered into a partnership with one of the most respected market operators in the world, we also weren't naive about the fact that joint ventures often don't work. So, we think it's going to be a nimble, executionally savvy entity, but we also think we've got the right balance of local talent and people that have come from the years of expertise that we've built here. And I'll just tell you, as market operators go they're true believers in the private market. It looks like the U.S. market six or seven years ago, where nobody was doing more than $10 million of revenue. And then you've got the whole issue of companies in Germany versus companies in the U.K. and just generally, the fact that trying to do transactions within the region and across European entities requires a regulatory structure that we could see was going to be complicated and takes some time to invest in. But look, the valuation of European tech and unicorns over the last seven years has gone from $50 billion to $625 billion. Your line is now open. So, our custodial enterprise holds private securities investors and like the asset class that we're all talking about, familiar with, there are periods when those investments have a component of the account that is in liquid cash that sits in idle cash. And so, we think that that's a real value to our business model in terms of both the balance itself and the fact that they grow over time, particularly as people start to liquidate assets and may have to liquid assets if they need cash, so, some of that cash stays idle in our accounts. So, -- and we said this previously, but during periods of lower interest rates, right, our cash administration fees are compressed. And then during a rising rate environment that we're currently in, we're able to increase our cash administration fees. Now, your specific question is what about the mechanics of how that's structured, and I think specifically, when you read reports other firms, brokerage firms and the like, you read about cash sorting issues and that affecting brokerage firms' revenues. It typically tends to be transitional cash, either someone in between an investment or they have residual dividends or income flows from their investments, it's not typically large amounts of cash. And it's from that interest that customers receive interest, and we're able to earn our cash administration fees. The interest that's earned on these accounts, customers earn an amount of interest on their balances and cash administration fees are deducted from that interest. Just because I look at it now, when you include stock comp, I mean, it's over 100% of revenues. We were providing additional information on stock compensation, given the unique nature of kind of what we're going through. And so, what you're seeing in stock compensation is the amortization of the various amounts of restricted stock options that are granted to our employees and our Board. I mean with regard to compensation with the flat head count, I mean as you have described, given that we are maintaining a flat level, as you look forward, you would have to look at the full year impact of those head count in 2023 and any kind of increase that you would model in that we would have to give offers to our employees year-to-year. We're in the process of kind of going through that   planning process with our  Board, Jeff, so I don't think you have any guidance to offer on that at this point. And Jeff, just to keep in mind, a lot has changed in the labor market even with in the last 24 hours, so -- \n Right, right. Your line is now open. In the supplemental schedule that we filed and it's also on our Web site, we're disclosing a level of cash balances, so you can look at kind of our total assets under custody and you can look at the cash balances to see the relationship there. I mean as I kind of commented earlier too, I think it was Jeff's question, we have not been subject to the same type of cash sorting issues that you see at other firms. And as we go through different rounds of increasing rates, it's an evaluation by the management team at the trust company to evaluate and determine the appropriate level of cash administration fees relative to kind of current rates. But Ken, I think we did report a $680 million on the $15 billion, just to speak to specifically the percentage of the $15 billion that's in cash. You mentioned in the prepared remarks the right of first refusal and your comments around that is, based on what you're seeing it could be signaling a trough. One way is employees want to sell, and they're bound by a transfer restriction within those cap tables that requires them to provide typically a 30-day notice of desire to sell, and the company then has within its own private market bylaws extended the right for existing investors to purchase those shares. If there is a ROFR in place and we track it, there's an indication that we can read into this which is that the insiders who are on the cap table already, who see the ROFR being tendered, they see the potential for a sale, they get to elect whether or not they want to step in front and buy the shares themselves. And our view of this is that if you have more knowledge of the company because you're already on the cap table, you may be a Board member, you may have information rights, your purchase of those shares at that price is an indication that it's a deal that is worth getting additional exposure on. And so, if we see that more ROFRs are being executed by existing cap table participants, we could interpret that, that's a price based on knowledge that could be equivalent to a price setting and a fundraising because that's an indication that someone with knowledge and disclosure is willing to buy the company at that ROFR price. And so, when we see that systematically across the company over some duration of time, that could tell us that -- something about a trough, and so, I think what we reported was we could start to see signals of this in parts of our quarter in Q3. Now it could be a market bottom for a name and not the whole market in general, but when you see it across companies, you could start to draw broad trend insights from that. When we look at the listing requirements on the NYC, we're pretty lucky because we have a lot of NYC people working with us to build out the product. And I would add that we did look at it specifically to make sure that we understood the specific rules and as Dom reiterated, we don't really see kind of an issue there at this point in time. And it's everything Kelly just described that we've been working on in the last quarter, European expansion, our data product, stock option, lending, custodial services for our trading clients and obviously much, much more. And there's just no doubt in our minds that while this may be a difficult environment and there's a lot going on out in the world that we don't control, everything that we've said were the foundations for why this company was formed, the vision of it and the size of the market are continuing to be very exciting for people here. And nobody likes to see the stock down where it is, but we continue to be focused on that bigger, bolder opportunity, and we're going to keep focused on that for 2023. It's fundamentally today an institutional product and institutional can mean a lot of things to a lot of people, but we focused it primarily on our institutional buyers. You're seeing capital markets desks and asset managers enter the private markets at levels that you hadn't seen before, and all of them need data and insights. And so, the product was meant and priced initially last September at a starting price in the low mid-$20,000 per seat annually. So, you could essentially take our product, broad data, including all historical data and use it however you want to drive product decisions or essentially generate your own sort of mechanism for passive or passive active trading. We see that we have gotten product market fit, both in terms of the response that we've gotten over the years that it's been out. And the more data that we put out and the more people use it, we think it will increase the decision-making power of the market. And Owen, I think we're going to look at this in '23, and we talked about not giving certain forward guidance during this particularly difficult time. And I'd say one of the things that's particularly interesting about data is, as you look at data products to have a subscription component or you look at SaaS-based software products, there's a booking dynamic that builds over time. But right now, we're really excited about the product market fit of Forge Intelligence. We have very high levels of upsell where our existing clients are interested in expanding the types of products and features that they can use, and we're able to upsell them and provide a higher level of service. In addition to kind of the basic subscription that we talk about, we also provide a data feed product where people can get this information sent to them electronically. When I talked to the data team, there's just a tremendous level of excitement and optimism in terms of what they're seeing and encountering in the market. In the case of the data product, it's very high margin at scale and really is low cost to serve incremental customers. And we firmly believe that our position as the market leader and a marketplace that provides significant liquidity for the space will put us in a position to continue to occupy a competitive advantage in the range of data that we put out, and it should not be lost on anybody on the call that our ability to go out and now aggregate third-party data sources is also key to our scaling of this and that started to happen this year, actually in this last quarter. Owen, I mean, I think we hope that eventually, Forge Intelligence can become like the private market case, but one more thing I was going to add was that our sales team has been going out there and talking to clients. For example, venture lending is turning out to be a very -- an area where there's a lot of opportunity, a lot of people interested in our data products."
}