{
    "symbol": "OLLI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 16:24:05",
    "content": " Our gross margin improved 110 basis points during the fourth quarter to 37.6% compared to 36.5% last year, driven by lower supply chain costs due to increased productivity and reduced transportation expenses. While we are confident in our trends and our current momentum and believe that we are well-positioned, we are planning our business more in line with our long-term annual target of 1% to 2% comp store sales growth, coupled with the new unit growth of 45 stores. With that framework in place, for the full year, which includes a 53rd week, we expect total net sales of $2.036 billion to $2.058 billion; comp store sales of 1% to 2%; the opening of 45 new stores, less one closure; gross margin in the range of 39.1% to 39.3%; operating income of $205 million to $213 million; adjusted net income of $156 million to $263 million; and adjusted earnings per share of $2.49 to $2.58, both of which exclude excess tax benefits related to stock-based compensation. One moment for our next question. One moment for our next question. Obviously, we need to open up that four distribution centers in order to service the stores, that's just a strict volume that comes through the boxes and, obviously, there is a freight savings, but basically our impact that we give to you is net-net, that's the net impact of the margin and it's probably, call it, 10 basis points to 20 basis points on the back half and that's including the freight savings offset by the incremental cost of the four walls that we built. One moment for our next question. Our merchants are being very selective and there's opportunities out there that we see that will help us on the merch margins side to offset the supply chain costs and the 39.1% to 39.3% that we're projecting for the full year, we believe that's very achievable with what we're projecting on the supply chain front and it's just -- we don't feel that's a real big stretch this year coming off of where we were at last year. One moment for our next question. One moment for our next question. One moment for our next question. So I think the prudent thing to do with the margin it came off of last year, 39.1% to 39.3% is a great improvement, and if we can do better we're definitely going to do better than that, but I do think we have a pretty good chance of getting back to that 40% gross margin in 2024. One moment for our next question. One moment for our next question. From the second part perspective, when we think about comps, we used to leverage our expense base right in the midpoint of the 1% to 2%, with the increased investment in wages that we made that -- Eric referenced a couple of moments ago, it's probably closer to 2% to continue to gain leverage on our expenses. I would say, Simeon, it's changing a little bit, but there's still -- I'm not going to get through real big details for competitive purposes, but we're still seeing a pretty wide variation of closeout opportunities in the marketplace from HBA, housewares, clothing, flooring, lawn and garden, auto, there's a lot out there. One moment for our next question. One moment for our next question. One moment for our next question."
}