{
    "symbol": "OLLI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-01 12:11:07",
    "content": " Full year gross margin of approximately 36.4% to 36.6%, operating income of between $145 million to $150 million, adjusted net income between $109.5 million and $113 million and adjusted net income per diluted share of $1.74 to $1.79, both of which exclude excess tax benefits related to stock-based compensation. For the third quarter, we expect total net sales of approximately $426 million to $434 million, comp store sales between 3.5% and 5.5%, gross margin of approximately 39.4% to 39.6%, operating income of $33 million to $36 million and adjusted net income between $24.5 million and $26.8 million and adjusted net income per diluted share of $0.39 to $0.43, both of which exclude excess tax benefits related to stock-based compensation. Your line is open. So I would say youâ\u0080\u0099re going to see a lot of new product and right now, weâ\u0080\u0099re able to give the consumer a great price, and weâ\u0080\u0099re very confident in where weâ\u0080\u0099re sitting with our margin for the Q3 numbers weâ\u0080\u0099ve given out. Your line is open. I think the guide we gave out for Q3 to 39.4% to 39.6%, I would say itâ\u0080\u0099s pretty close to normalization for â\u0080\u0093 itâ\u0080\u0099s a little bit lower than our historical 40%, but with the increased supply chain world weâ\u0080\u0099re living in today, I would say Iâ\u0080\u0099d be very happy with the 39.5% and call that pretty normalized, and I think weâ\u0080\u0099ll get there in Q3 and Q4. Your line is open. Randy, I would say the gross margin would probably sit just a little bit below the 40% mark that weâ\u0080\u0099ve established until we can get supply chain a little bit more back to our historical norms. Your line is open. Your line is open. Like I said, weâ\u0080\u0099re coming up pretty bullish on Q3, itâ\u0080\u0099s just a matter of when the time that the deals present themselves, we didnâ\u0080\u0099t get some of the deals done in Q2 that we had expected and theyâ\u0080\u0099re rolling to Q3, and thatâ\u0080\u0099s really just a shift of timing of when the deal slowed in. Your line is open. Your line is open. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open."
}