{
    "symbol": "OLLI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-08 12:39:08",
    "content": " Full year gross margin of approximately 36.5% to 36.7%; operating income of between $155 million to $168 million; adjusted net income of between $115 million to $125 million; and adjusted net income per diluted share of $1.83 to $1.98, both of which exclude excess tax benefits related to stock-based compensation; depreciation and amortization expense in the range of $28 million to $29 million, including approximately $6 million that runs through cost of goods sold; an effective tax rate of 25.5%, which excludes the tax benefits related to stock-based compensation; and diluted weighted average shares outstanding of approximately 63 million. This reflects a recovery of some of the sales and seasonal items in the second quarter, comp store sales of between flat to up 3%; gross margin of approximately 34.5%, consistent with our prior expectations; operating income of $27 million to $30 million; and adjusted net income of between $20 million and $22 million; and adjusted net income per diluted share of $0.32 to $0.35, both of which exclude excess tax benefits related to stock-based compensation. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So that’s – we just think that and coupled with the deal flow and what we’re seeing, we think we are very well positioned to drive these sales and we don’t think it’s overly aggressive for the remainder of the year. Your line is open. Your line is open. Your line is open. Your line is open. But in terms of thinking about ‘23 and you are now seeing your normalized sales levels that have gotten back above 2019 levels, from a gross margin standpoint, is there anything that you see now that you are seeing better throughput, improvements in deal flow, presumably maybe a more normalized return on the product mix where your gross margins wouldn’t be returning to what your typical levels would be in that kind of 39.5% to 40% for the full year? Your line is open."
}