{
    "symbol": "UNM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 13:03:09",
    "content": " Yesterday afternoon, Unum reported first quarter 2022 net income of $253.5 million or $1.25 per diluted common share, an increase from the $153 million or $0.75 per diluted common share in the first quarter of 2021. So excluding these items, after-tax adjusted operating income in the first quarter of 2022 was $277.3 million or $1.36 per diluted common share, an increase from the $212 million or $1.04 per diluted common share in the year ago quarter. And also related to that age shift, with COVID-related mortality impact in the elderly population more significantly this quarter, we saw the LTC interest-adjusted loss ratio declined by 12 points to 70% in the first quarter. And looking at our capital position, just as we showed strong GAAP earnings this quarter, our statutory results were also quite favorable, increasing by over $60 million on a year-over-year basis to $200 million for the first quarter of 2022. Adjusted operating income showed a sharp increase to $171.6 million in the first quarter of 2022 compared to $81.4 million in the fourth quarter of 2021, primarily driven by strong sequential quarter improvement in the group disability and group life and AD&D lines as well as continued high levels of operating income from the supplemental and voluntary lines. So within the Unum US segment, the group disability line reported a strong rebound in adjusted operating income to $62.6 million in the first quarter from $34.1 million in the fourth quarter. Adjusted operating income for Unum US group life and AD&D also showed strong improvement, with an operating loss of $9.4 million in the first quarter compared to a loss of $71.7 million in the fourth quarter. In the first quarter of 2022, while the mortality count increased to approximately $153,000, the impact to the working age population declined to approximately 24%. In addition, we also saw a lower average benefit size, which declined to slightly less than $55,000 in the first quarter compared to around $65,000 in the fourth quarter of last year. Now looking at the Unum US supplemental and voluntary line, earnings remain at very healthy levels with adjusted operating income of $118.4 million in the first quarter compared to $119 million in the fourth quarter. Then looking at premium trends and drivers, we were pleased with the additional momentum building for Unum US, with growth in premium income of 1.3% in the first quarter on a year-over-year basis. Looking at the group disability line, growth in premium income is closely tracking our outlook, increasing 1.9% on a year-over-year basis, with increasing levels of natural growth as we benefit from high employment levels and rising wages, solid business and persistency trends and careful management of our renewal programs. Then moving to the Unum International segment, we had another very good quarter with adjusted operating income for the first quarter of $27.2 million, in line with the $27.1 million reported in the fourth quarter. The primary driver for our international segment results is our Unum UK business, which generated adjusted operating income of GBP 19.2 million in the first quarter compared to GBP 18.7 million in the fourth quarter. Next, results for our Colonial Life were also very strong with adjusted operating income of $90.1 million in the first quarter compared to $80 million in the fourth quarter. In the closed block segment, adjusted operating income, excluding the amortization of cost of reinsurance related to the closed block individual disability reinsurance transaction, was $94.1 million in the first quarter compared to $76.7 million in the fourth quarter. The interest adjusted loss ratio for LTC declined to 70.2% in the first quarter from 82.2% in the fourth quarter, primarily driven by higher claim and mortality, which was approximately 10% higher than we expected on a seasonally adjusted basis by claim count and by favorable new claim incidents. For the closed block individual disability line, the interest adjusted loss ratio increased to 78.7% in the first quarter compared to 75.4% in the fourth quarter but remain within our long-term expectations. More specifically, total miscellaneous investment income in the closed block declined by approximately $4 million in the first quarter compared to the fourth quarter. Wrapping up my commentary on the quarter's financial results, the adjusted operating loss in the corporate segment was $40.4 million in the first quarter and $45.1 million in the fourth quarter. The weighted average risk-based capital ratio for our traditional U.S. insurance companies improved to approximately 400% and holding company liquidity was $1.3 billion at the end of the first quarter, both well above our targeted levels. Your line is open. Your line is open. Your line is open. Yes, this is Steve. Your line is open. Your line is open. Yes, this is Steve. Your line is open. Yes, this is Steve."
}