{
    "symbol": "UNM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:02:07",
    "content": " Yesterday afternoon, Unum reported third quarter 2022 net income of $410.7 million or $2.04 per diluted common share, an increase of $328.6 million or $1.60 per diluted common share in the third quarter of 2021. Net income for the third quarter of 2022 included the after-tax amortization of the cost of reinsurance of $12.1 million or $0.06 per diluted common share, a net after-tax investment loss on the company's investment portfolio of $3.4 million or $0.02 per diluted common share and the reserve decrease related to reserve assumption updates of $122.5 million or $0.61 per diluted common share. Net income in the third quarter of 2021 included the after-tax impairment loss on internal-use software of $9.6 million or $0.05 per diluted common share, the after-tax amortization of the cost of reinsurance of $15.5 million or $0.08 per diluted common share. Excluding these items, after-tax adjusted operating income in the third quarter of 2022 was $303.7 million or $1.51 per diluted common share, an increase from $210.5 million or $1.03 per diluted common share in the year ago quarter. Our performance in the third quarter continued to build on the momentum of the first half of the year, with growth in operating earnings per share of 47% on a year-over-year basis. In addition, the Unum US supplementary and voluntary lines and Colonial Life had another quarter of strong margins and combined to represent over 50% of our core business pretax adjusted operating income. These many positive operating trends that helped drive our GAAP earnings improvement also helped drive strong statutory income, which for the third quarter doubled over the year ago quarter, and on a run rate basis is back to our pre-pandemic level of close to $1 billion a year. Risk-based capital for the U.S. traditional insurance companies remained at approximately 415% at the end of the third quarter and our holding company liquidity of $1.1 billion remains well above our targeted levels, while we have also delevered to below 25%. Results for Unum US Group Life and AD&D declined from last quarter, with adjusted operating income of $30.9 million for the third quarter of 2022 compared to $67.3 million in the second quarter. So moving on, adjusted operating income in the Unum US supplemental and voluntary lines continued its strong performance in the third quarter at $114.3 million, a slight decrease from the very favorable result of $120.6 million in the second quarter. This result was driven by the voluntary benefits line of business, partially offset by the individual disability block of business which produced another excellent quarter with a benefit ratio further improving from the strong result of 41.3% in the second quarter to 40% in the third quarter. We are very pleased to see the momentum experienced in the first half of the year for Unum US continue into the third quarter, with growth in premium income of 3.9% on a year-over-year basis compared to the 3.3% increase we saw in the second quarter. This momentum was exceptionally strong in the group disability line with year-over-year growth of 7.4% in the third quarter compared to 5.1% in the second quarter, driven by sustained high levels of natural growth. Moving to the Unum International segment, adjusted operating income for the third quarter increased to $29.9 million from the $24.9 million in the second quarter in the face of a weaker pound to dollar exchange rate. Adjusted for this impact, the underlying benefits experienced in the third quarter was still slightly improved from the second quarter as benefits experienced in the group disability line offset an increase in Group Life claims. For Unum Poland, third quarter adjusted operating income was higher than second quarter, and we remain pleased with the growth and performance of the operation and humbled by the resolve of our people. Next, adjusted operating income for the Colonial Life segment was $90.4 million compared to $101.1 million in the second quarter, a strong result following one of the highest results on record last quarter. This quarter's result trended in a positive direction, growing approximately 1% over prior year and demonstrated the strong sales recovery we have been experiencing over the past several quarters, with sales increasing 7.8% for the first 9 months of the year and 3.2% for the third quarter. In the Closed Block segment, adjusted operating income, excluding the amortization of cost of reinsurance related to the Closed Block individual disability reinsurance transaction was $34.1 million compared to $79.3 million in the second quarter. The decline largely reflects lower miscellaneous investment income, which fell $36.4 million from the second quarter as income from our alternative investment portfolio moderated as expected. For benefits experience, long-term care remains stable with the adjusted -- interest adjusted loss ratio at 85.7% compared to 85.9% in the second quarter and 81% on a 12-month rolling basis. So then wrapping up my commentary on the quarter's financial results, the adjusted operating loss in the corporate segment was $49.5 million compared to $36.9 million in the second quarter, primarily driven by higher expenses, including those related to debt management activity. Then after favorable second quarter results and a brighter outlook for the second half of the year, we raised the outlook again to a range of 40% to 45% off of our adjusted operating -- after-tax operating income per share of 2021 of $4.35."
}