{
    "symbol": "UNM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 13:20:05",
    "content": " Net income in the second quarter of 2021 and included the after-tax costs related to the early retirement of debt of $53.2 million, $0.26 per diluted common share, an after-tax impairment loss on the right-of-use asset related to one of our operating leases for office space that we are no longer using of $11 million or $0.05 per diluted common share, the net tax expense related to a U.K. tax rate increase of $24.2 million or $0.12 per diluted common share, the after-tax amortization of the cost of reinsurance of $15.5 million or $0.08 per diluted common share and a net after-tax investment gain on the company's investment portfolio of $600,000 or $0.01 per diluted common share. Adjusted operating income increased sharply to $295.4 million in the second quarter of 2022 compared to $171.6 million in the first quarter primarily driven by strong sequential quarter improvement in the group disability and group life and AD&D lines as well as continued strong levels of operating income from the supplemental and lines. Within the Unum US segment, the group disability line reported an excellent quarter with adjusted operating income increasing to $107.5 million in the second quarter of 2022 compared to $62.6 million in the first quarter. Moving on, adjusted operating income in the Unum US supplemental and voluntary lines continue to be very strong in the second quarter at $120.6 million compared to $118.4 million in the first quarter. So then wrapping up my commentary on the quarter's financial results, the adjusted operating loss in the corporate segment was $36.9 million for the second quarter compared to $40.4 million in the first quarter with higher net investment income and more favorable operating expenses. With our strong performance in the second quarter and our improved outlook for the second half of 2022 relative to our original expectations, we are again increasing our outlook for growth in 2022 to a range of 40% to 45% off of our adjusted after-tax operating income per share in 2021 of $4.35."
}