{
    "symbol": "APEI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 23:25:03",
    "content": " Rasmussen’s total nursing enrollment continued to grow in the first quarter, up 2%, compared to a difficult positive 23% comparison prior year in 2021 and up 12% on a two-year CAGR basis versus 2020. Hondros nursing enrollment represented an 8% growth in the first quarter of 2022, also as compared to a very difficult plus 45% prior year comp and represents a 25% two-year CAGR growth over the 2020 period. At Hondros, a remarkable turnaround was engineered and not only our enrollments up by nearly 1,000 students or approximately 50% in the first quarter of 2022 compared to first quarter of 2020, but we also expanded our footprint from five campuses in Ohio to six and now include two new states in Indiana and with the campus opening later this year in Michigan. Rasmussen’s nursing enrollment continues to grow in the first quarter of 2022, up 2% as compared to a very difficult positive comp in 2021 and up 12% on a two-year CAGR basis. At Hondros, we have approximately 2,500 nursing students, which represent an 8% growth in the first quarter of 2022 versus the prior year period and a 25% two-year CAGR growth over the 2020 period. Overall, APUS experienced increased net course registrations from all the major active duty branches in the first quarter of 2022 compared to 2021, and overall, active-duty military increased approximately 7% year-over-year. APUS’s other online educational learners that only represent 15% of our registrations saw a pullback in net course registrations of roughly 11% in the first quarter 2022 as compared to 2021, due to the broader macro environment. As nursing has accelerated at Rasmussen over the past several years, Rasmussen’s non-nursing enrollments declined 14% in the first quarter of 2022 as compared to the first quarter of 2021 and in line with the broader private for-profit general education sector. At Rasmussen, non-nursing enrollment is expected to decrease by roughly 11% in the second quarter 2022 compared to the prior year due to the general student behavior trends in the United States. At APUS, although net course registrations were up 1% in 2022 compared to the 2021 quarter, APUS first quarter 2022 revenue decreased approximately 6% to $73 million. Hondros revenue increased approximately 4% to $12 million in the first quarter of 2022 versus the comparable prior year period, driven by the year-over-year enrollment growth that Angie touched on earlier. Total costs and expenses for the first quarter 2022 were $150 million, an increase of approximately $72 million compared to the prior period, due primarily to the inclusion of Rasmussen and Graduate School results in the current year period."
}