{
    "symbol": "APEI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 03:25:49",
    "content": " Rasmussen increased select clinical wage rates to ensure adequate coverage for faculty and as a result of the prior year NCLEX scores for Rasmussen's Bloomington ADN program, Rasmussen entered into consent with the Minnesota Board of Nursing, that among establishes the same faculty-to-student ratios for that program that Rasmussen had previously implemented in order to bring NCLEX scores back to the Minnesota threshold of 75%. For the second quarter of 2022, APEI's revenue was roughly $150 million, up 92% compared to the prior year period, as we added Rasmussen during the third quarter of 2021. As a result, we implemented self-imposed enrollment cap to ensure we have the appropriate faculty to student ratios, which resulted in lower nursing starts and caused nursing enrollment to contract to 8,200 in the second quarter of 2022, as compared to 8,300 in the prior year period or down 2%. For the third quarter, our guidance is for Rasmussen's nursing enrollment to be down approximately 8% and non-nursing enrollment is expected to decrease by about 8% in the third quarter as well, compared to the prior year period, due to general student behavioral trends in the United States. Total revenue was approximately $150 million, up approximately $72 million or 92% from the comparable prior year period, due primarily to the addition of Rasmussen and graduate school revenue of $64 million and $4 million, respectively, in the 2022 period. Third quarter adjusted EBITDA is negatively impacted by nursing faculty wage inflation and separately the impact of the enrollment reduction at the Rasmussen Bloomington campus, the latter estimated to be approximately $1 million. If you look at Rasmussen, it's not in the prior number, but if you look at marketing year-over-year, I believe through June, it's up about $2 million, and we're going to spend an incremental $3.8 million in the third quarter."
}