{
    "symbol": "APEI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 15:51:01",
    "content": " As we move to some headlines, first, the APS team, including new President, NewNoFernandis, continued to deliver revenue growth, for both Q3 '22 and year-to-date '22 for new and total student registrations and continues to expand margins due in part to cost savings delivered to last year's headcount reduction and the acquisition of Rasmisin, which provides new allocations of shared services costs. As we begin the second year of ownership of Rasmussen University, we have substantially completed its integration, both delivering our first year target of $10 million in run rate cost savings and accelerating the realization of the years 2 and 3 APEI enterprise savings with the recently completed cost reduction effort that resulted in $13.5 million in annual run rate savings. At Hondros, we saw a third consecutive quarter of year-over-year total student enrollment growth through 3Q '22 and set a record for a new all-time high of new and total enrollments in 4Q of '22. While this will still result in total enrollment declines in 4Q '22 as compared to the prior year period of plus 12% for nursing and plus 5% for non-nursing, these improved stats are in line with our expectations, and this growth momentum keeps Rasmussen on track for second half 2023, total enrollment growth, as described in our last earnings call. Pre-licensure nursing enrollment momentum remains strong at Hondros as student interest in our 3 newest campuses in Detroit, Indianapolis and Akron, along with continued solid enrollment in our 5 legacy Ohio campuses has led to year-over-year enrollment growth of 4% to 2,410 students in 3Q '22 versus the prior year period. In addition to the improved student momentum across our education units and better financial performance in the quarter, APEI's balance sheet remains strong with over $158 million of unrestricted cash on hand and approximately $8 million of net debt at quarter end. While Rasmussen's programs have largely demonstrated historical success on NCLEX exam first-time pass rates, we believe that shifts in the underlying Rasmussen's student preparedness, demographics, along with prior shift to primarily online delivery for several quarters due to COVID have driven recent past rates to lower levels. For the third quarter of 2022, total revenue was approximately $150 million, up approximately $51 million or 52% from the comparable prior year period due primarily to the addition of Rasmussen and graduate school revenue in the 2022 period. Batista's revenue was $61.5 million during the third quarter of 2022, a decrease of 7% when compared to the pro forma 3Q 2021 period, driven by a decline in total enrollment compared to the prior year period. The increase in cash flow from operations was primarily due to payments received from Army during the first 3 quarters of 2022, which totaled approximately $48 million and the impact in 2021 of the timing of the Rasmussen acquisition. At Hondros, fourth quarter total student enrollment increased 4% year-over-year to approximately 2,600 students, our largest-ever total enrollment figure driven by our largest ever new student start for the period."
}