{
    "symbol": "APEI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 19:33:09",
    "content": "  Forward-looking statements include, without limitation, statements regarding expected growth, registrations and enrollments, revenue, net income, earnings per share and EBITDA as well as other earnings guidance, expectations regarding initiatives to improve NCLEX pass rates and reposition Rasmussen University for growth, plans and expectations with respect to other recent, current and future initiatives, including with respect to leadership and future competition, demand or expectations for non-military enrollment at APUS and for nursing education. These risks and uncertainties include, among others, risks related to changes in management, our ability to meet regulatory and accreditor requirements such as NCLEX pass rates and retention rates, regulatory matters such as the impact of amended 90/10 rules or dependence on effectiveness of our ability to attract students who persist and are likely to succeed in our institutions programs changing market demands, impacts of increases in labor costs and enrollment trends, the reduction elimination suspension of tuition assistance, challenges with integrating acquisitions, competitive pressures and those described in our presentation, today's press release, the company's Form 10-K filed with the SEC today and other SEC filings. As a reminder, during 4Q '22, Rasmussen began to implement an important organizational and operational realignment in an effort to achieve three things: to drive sustainable growth for both its on-ground nursing and allied health programs as well as its fully online program, dedicate resources more directly to improve NCLEX first-time pass rates and reduce operating costs. In July 2022, as we previously shared in prior earnings calls, when pre-licensure nursing education returned on ground, Rasmussen introduced enrollment caps in select markets including to ensure students would have the proper clinical experience and also experienced higher costs for in-person faculty to oversee those clinicals. Total revenue for the fourth quarter was approximately $152 million, down 1% from the prior year period due primarily to a $7.6 million or 11% decline in revenue at Rasmussen, offset partly by the inclusion of Graduate School revenue of $5.7 million in the 2022 period. At APUS, revenue was approximately $73 million for the fourth quarter, roughly flat as compared to the prior year period due to a mix shift at higher net course registrations in the current quarter period were driven by active-duty military, offset by a decrease in veterans and non-military, the latter of which are charged higher tuition and fees. Rasmussen's fourth quarter revenue was down approximately 11% compared to the prior year period, driven by a decline in enrollment and a slight mix shift towards more online students, which generally pay lower tuition than Rasmussen's on-ground nursing students."
}