{
    "symbol": "VVX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 10:46:02",
    "content": " Notably, year-over-year organic growth for the legacy Vectrus was approximately 10% in the quarter driven by performance in INDOPACOM, growth on LOGCAP, contribution from Fort Benning, as well as volume associated with rapid response and contingency support. During the quarter, we seamlessly executed across all aspects of our business and successfully reached full operational capability on our new seven-year $850 million Navy Test Wing Atlantic program which included phasing in over 1,000 team members across 35 different aircraft. By successfully defending our recompete and with a solid amount of revenue under contract over the next several years, we believe V2X is well-positioned to focus on addressing new opportunities and revenue synergies to further grow the business. For example, we believe our rapid prototyping, engineering, platform modernization, 5G, predictive maintenance, software development, cyber asset hardening, integrated electronic security and virtual reality training solutions will allow V2X to grow within the DoD's $116 billion Research, Development, Test and Evaluation or RDT&E budget. Pro forma revenue was $961.3 million representing, an increase of 10% year-over-year when compared to revenue of $876.3 million for Vectrus and Vertex in the third quarter of 2021. Organic revenue growth was 10% for legacy Vectrus and was driven by continued strong performance on LOGCAP V, growth associated with the Fort Benning Eagle contract award and volume associated with rapid response and contingency efforts in Europe, as well as INDOPACOM. This noteworthy performance resulted in a $87 million reduction in the company's net debt in less than three months, exemplifying V2Xs ability to generate strong cash flow with low capital requirements. And as I stated in the last quarter's remarks and also in the discussion today as well, we really don't have any re-compete more than 2% of revenue for the next couple of years actually."
}