{
    "symbol": "ELAN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 09:40:33",
    "content": " Through relentless execution on our productivity agenda, we delivered 5% growth in adjusted EPS and expanded adjusted EBITDA margin by 120 basis points, despite a 4% constant currency sales decline in the third quarter. On a year-to-date basis, Elanco's global Farm Animal business grew 1% in constant currency, with growth in poultry, aqua and cattle and US swine, partially offset by the double-digit decline in international swine, primarily in Asia. Our execution on the integration of the legacy Bayer Animal Health business into Elanco's own ERP system, business processes and shared service centers is progressing well, and we accelerated the timing of our go-live to early in the second quarter of 2023 from the middle of the year. However, because of the worsening macro environmental factors impacting Europe and our US Pet Health retail business, continued COVID lockdowns in China, and the strength of the US dollar, we are reducing our full year revenue guidance by approximately $100 million. However, despite a deceleration of the decline of the Swine business in the third quarter compared to the first half of the year, the continued COVID-19 lockdowns, and protein producer profitability pressures are impacting our China business more than our August expectations in the second half, leading us to update our outlook for China to be a 16% to 18% decline for the full year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And to say that we have five potential path to five blockbusters from now through the first half of 2024 is one of the most significant things our company has seen, and it's in front of us, and we're in execution mode against that, but as well as market share and price being a focal point and improving supply situation, our overall productivity that came through in OpEx and in the middle of the income statement, which led to cash and paying down debt."
}