{
    "symbol": "ELAN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 10:05:24",
    "content": " Elanco's focus over the last year on productivity efforts to reduce costs by streamlining our sales and marketing organizations, prioritizing resources in R&D and across our manufacturing footprint allowed us to exceed our top end of our second quarter guidance range with adjusted EPS of $0.36 and adjusted EBITDA of $300 million. Although a notionally smaller business, we continue to see strong performance in Aqua with 5% constant currency growth despite the $10 million of phasing into the first quarter, we discussed in May, which drove Q1 growth of 96%. In the first quarter of the year, Elanco's strong team in China grew market share six percentage points in the parasiticide market through its commercial capabilities and strong portfolio that has just been enhanced with the approval of Credelio, while we don't expect to recapture our lost sales from Q2 as we projected in May, we still expect our China pet health business to grow double digits in the second half of the year. Finally, we are reducing our revenue guidance by approximately $40 million to $50 million to reflect our lowered expectations for our innovation sales ramp, price growth and performance of our US pet health parasiticide business, which will more than offset better than expected performance in poultry, aqua and contract manufacturing. While I covered price earlier for innovation sales, we're lowering our expectations by $20 million to $30 million to $100 million to $130 million for the full year as a result of our updated expectations for Experior, Increxxa and Credelio Plus. Seresto contributed $113 million, representing a 12% decline on a reported basis or a 6% decline in constant currency with softness in the US and Central Europe, where the Russian invasion of Ukraine negatively impacted our business, partially offset by growth in Western Europe. Interest expense was $50 million in the quarter, a year-over-year decline of 17%, driven by the repayment of our 2021 senior notes last August. In the second quarter, our operating cash flow was $312 million, reflecting the lower reported net loss in the quarter year-over-year and a one-time benefit of net $124 million from a cash interest rate swap settlement, the swap settlement provides a cash benefit in the second quarter that will create a headwind in operating cash flow over the next four years as this cash acceleration reverses. The stronger US dollar drives approximately $20 million of the change, while the other $45 million is driven by the approximate $55 million of overachievement and adjusted EBITDA in the first two quarters of the year more than offset by the gross profit drop-through from the sales reduction in the second half and incremental inflation. Although, it's hard to adjust for just one factor, when you reduce our cost of goods sold in 2022 by approximately $100 million to reflect the incremental inflation compared to what we had expected during the December 2020 Investor Day, we would project a 60% gross margin this year. That incremental $100 million of gross profit would have also increased our adjusted EBITDA margin by over 200 basis points, which would have had us tracking to our 31% target for 2024. You're right, we have taken some price, We're still running at the 2% historical level we had expected back at our Investor Day, we do foresee increasing price, and we've called that out as a driver in the back half of this year as we were to growth in Q4 with key biggest lever individually is certainly the integration of the Bayer systems and processes into Elanco. FX clear using rates as of early August and that's the $65 million headwind as we think about the impact in the back half, we had said in May, we expected China to have a V-shaped recovery in Pet Health and to get back all the lost sales in Q2 in the back half of the year that isn't happening the way the recovery is going in China."
}