{
    "symbol": "JAZZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 23:30:29",
    "content": " On slide two, Iâ\u0080\u0099ll remind you that todayâ\u0080\u0099s webcast includes forward-looking statements such as those related to our future financial and operating results, including expectations related to Vision 2025 and our guidance for 2022, growth potential and anticipated development programs and pipeline, regulatory activities and commercialization milestones, goals and expected timing, and statements with respect to our licensing agreement for Zanidatamab that is subject to closing condition, which involve risks and uncertainties that could cause actual events, performance, and results to differ materially from those contained in these forward-looking statements. Your line is now open. So overall, what we're seeing and hearing is that, as a health care provider gets their own first-hand clinical experience with prescribing Xywav in this idiopathic population, and have the ability to observe its clinical benefits within their own practices we really see increase enthusiasm about it, and an effort on their part to start to identify additional appropriate patients in which they can initiate therapy. So all of this, positive signal from those that have utilized as well as those who have not allows us to continue to be really confident in our ability to maximize the potential of Xywav in this really underserved market, and it makes us very pleased that we're continuing to grow Xywav across both narcolepsy and IH and putting us well on track to be the oxybate of choice in 2023. Your line is open. Your line is now open. Please stand by for our next question. Your line is open. And so, by being in the position that we are already, it gives us the opportunity to, between now and 2025, invest in our business, invest in the brands that we're launching, the pipeline, our capabilities, continue to leverage that G&A footprint as our top line grows so that we can scale effectively and efficiently, and then still have the capacity to be active in future corporate development, which, of course, could result in additional commercial or R&D expenses. Your line is now open. Your line is now open. Please stand by for our next question. Your line is open. Please stand by for our next question. Your line is now open. Your line is now open. Please stand by for our next question. Your line is open."
}