{
    "symbol": "CASI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 11:32:17",
    "content": " After today’s presentation, there will be an opportunity to ask questions. At this time, I’d like to turn the floor over to Wei Zhang, Vice President of CASI Pharmaceuticals. Earlier today, CASI issued a press release providing the details of the company’s business update and financial results for the quarter ended March 31, 2022. Today’s call will be led by Dr. Wei-Wu He, our Chairman and CEO, along with Mr. Larry Zhang, our President; Dr. Alex Zukiwski, our Executive Vice President and Chief Medical Officer; and Dr. Jim Goldschmidt, our Chief Business Development Officer. As a reminder, we will be making forward-looking statements, including our business plans, objectives and milestones. I will begin the call with an update on the business followed by our lead programs and near-term catalysts, concluding with our financial highlights. We have experienced significant challenges during the first quarter of 2022, mainly due to the recent COVID-19 lockdown in China, including Shanghai, where we generate significant revenues. The lockdown in several cities continues as of today, and may have a negative impact on the sales of our products for the second quarter and the whole year. Through our partners ventures the CNCT-19 NDA submission to the NNPA is still on track, with potential minor delay due to COVID-19lockdown in cities where we are conducting trials. Meanwhile, our CID-103 Phase 1 study continues. Our experienced specialty sales and marketing team in the hematology, oncology market in China is a major competitive advantage. Our partner to Juventas Cell Therapy continues the development of CNCT19 an autologous CD19 CAR-T investigative product, for which CASI has co-commercial and profit-sharing rights. CNCT19 is being developed as a potential treatment for patients with hematological malignancies, which express CD19, including B-cell leukemia B-ALL and B-cell non-Hodgkin’s lymphoma. Throughout 2021 our commercial franchise has thoroughly prepared for the anticipated China NDA filing of CNCT19 CAR-T program, which we currently expect to be in the second half of 2022. Next I will address other product candidates in our pipeline, BI-1206. Along with our partner, BioInvent, we continue to progress the development and regulatory framework for BI-1206 in China. We in-licensed BI-1206, a first-in-class, fully human monoclonal antibody that targets Fc gamma RIIB receptor for the Greater China market. BI-1206 has a novel mode of action, blocking the single inhibitory antibody checkpoint receptor Fc gamma RIIB to unlock anticancer immunity in both liquid and solid tumors. One is evaluating the BI-1206 in combination with rituximab for the treatment of non-Hodgkin’s lymphoma, which includes patient with follicular lymphoma, mantle cell lymphoma, and marginal zone lymphoma, who have relapsed or are refractory to rituximab. A second Phase 1/2 trial is investigating BI-1206 in combination with anti-PD-1 therapy, KEYTRUDA in solid tumors. Earlier this year, the U.S. FDA granted Orphan Drug Designation for BI-1206 for the treatment of follicular lymphoma, the most common form of slow-growing non-Hodgkin’s lymphoma. Together with BioInvent, we plan to continue to develop BI-1206 in both hematological malignancies and solid tumors, with CASI responsible for development and commercialization in Greater China. In 2021, we acquired CB-5339, a first-in-class VCP/p97 inhibitor from Cleave Therapeutics for the Greater China market. Cleave is responsible for the ex-China development of CB-5339, an oral second-generation small molecule VCP/p97 inhibitor and is evaluating the molecule in Phase 1clinical trials in patients with acute myeloid leukemia and MDS. Together with Cleave, we plan to develop CB-5339 in AML as the initial indication, with CASI responsible for development and commercialization in Greater China. CID-103 is a fully human IgG1 anti-CD38 monoclonal antibody, recognizing a unique epitope that has demonstrated encouraging preclinical efficacy and safety profile compared to other anti-CD38 monoclonal antibodies. In June 2021, we enrolled the first patient in our Phase 1 dose escalation and expansion study of CID-103. Next, we are going to provide updates on our financials and Wei is actually going to give everybody the financial highlights. Today, I will briefly summarize our financial results and provide key highlights for the first quarter. Revenue was $9 million for the quarter ended March 31, 2022, 58% increase compared to $5.7 million for the quarter ended March 31, 2021. Cost of revenue was $3.8 million for the quarter ended March 31, 2022 compare to $2.4 million for the same period last year which includes royalty payment of $1.8 million in first quarter of 2022 and $1.1 million for the same period in 2021. Next, I would like to address two items which are uncertain on our investments . Early this year, CASI announced the receivable of a differentiated lighter from the Listing Qualifications Department of the NASDAQ Stock Market. We continue to actively monitor the closing price of CASI’s common stock and are considering available options, including a reverse stock split. In CASI’s recent proxy statement, CASI has submitted a reverse stock split proposal to shareholders for approval. Next, I would like to address the recent events related to the Holding Foreign Companies Accountable Act which refers to HSCA. According to the HICCA , after being conclusively identified as a commission identified by the issuer for three consecutive years, there will be an initial trading prohibition, while working with the auditor to address a method to comply with the Public Company Accounting Oversight Board rules. In the meantime, we will actually note that China Securities Regulatory Commission is holding talks with U.S. regulators over audit cooperation and there is expectations that an acceptable resolution regarding this matter will be reached between the two respective government entities. We will continue to monitor developments and evaluate all strategic options, which include but are not limited to adding business processes and controls to meet the requirement of the HSCA. As we anticipated, there might be some slight delay, but we are reasonably confident that within the next 12 months, our partner Juventus will be able to complete the filing unless there is substantial additional disruption secondary to COVID-19 impact in China. He mentioned that the COVID-19 impact is there, especially in lockdown in Shanghai and some other big cities. We still don't know and for how long and the pandemic if it will continue, especially for the lockdown in the big cities and hopefully, will go over quickly which I don't know. Yes, Justin, there's still a lot of uncertainty on the big city because most transplant happens in big cities. Our sales people are not even allowed to visit patients, visit the doctors right now in Beijing and Shanghai, so the two pretty big revenue centers for us. We believe that within the next one dose or next one to two dose escalations, we will potentially hit the recommended Phase 2 dose. As soon as there is data available to be put into the public domain, we will seek the most appropriate medical scientific meeting to either have a presentation or poster put out to make sure that we get the information out to the public. So Sean, the milestones would be the initiation of the BI-1206 Study. So we’re targeting a July first patient in, however depending upon COVID-19 impact that could be delayed slightly. For Thiotepa, we are in the midst of discussions on a regulatory submission and the path forward with the CDE and we hope to have some more information ready for the analysts and investors in the next quarter or so. In terms of the Juventus CNCT-19, likewise they have placed their study, their cell based therapy study in some of the most, I think, prestigious institutions in China and that is ongoing. So hopefully, there won't be any further delay or if there is it will be slight on the CNCT-19 side, but I'm optimistic that we'll be able to meet the submission deadlines as outlined by Dr. And ladies and gentlemen, with that we will be ending today's question-and-answer session. We look forward to leveraging our existing commercial infrastructure, pursue pre-commercial launch activities for this CNCT-19 program, drive expanded pipeline progress and continue to observe steady EVOMELA growth."
}