{
    "symbol": "CASI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 12:28:12",
    "content": " I would like to hand the call over to Wei Zhang, Vice President of CASI Pharmaceuticals. Earlier today, CASI issued a press release providing the details of Companyâ\u0080\u0099s business update and financial results for the quarter ended June 30, 2022. Today's call will be led by Dr. Wei-Wu He, our Chairman and CEO; along with Mr. Larry Zhang, our President; Dr. Alex Zukiwski. Our Executive Vice President and Chief Medical Officer; Dr. James Goldschmidt, Chief Business Development Officer, they will also be available to answer the questions during the Q&A Session. As a reminder, we will be making forward-looking statements, including our business plans, objectives and milestones. For a description of important factors that could cause actual results to differ, we refer you to the statements in our SEC filings. It is now my pleasure to turn the call over to our Chairman and CEO, Dr. Wei-Wu He. I will begin the call with an update on the business followed by our lead programs and near term catalysts, concluding with our financial highlights. In the second quarter of 2022 COVID-related lockdowns and associated restrictions, limited access to hospitals in several large cities in China, which had an impact on the sales of EVOMELA. Our sales and marketing team is proven to be resilient, rapidly adapting strategies to address these challenges, to ensure that our priority remain on track. Revenues from sales of EVOMELA increased by 19%, compared to the same period last year. Equipped with experience from EVOMELA and the ability to adapt to a changing environment, I believe our commercial and medical marketing team can efficiently execute the anticipated launch of CNCT19 in China. We expect a CB-5339 to receive clinical trial application, CTA approval from the NMPA during 2022. Meanwhile, our CID-103 Phase 1 study continues. In May, we effectuated a ten to one reverse split of the company's common shares. As a result of the reverse split, the number of shares of outstanding common stock will be plus approximately 13.6 million shares. In the second quarter, we entered into a sub-license agreement with Precision Autoimmune Therapeutics, a Chinese incorporated company, previously known as Beijing Tianshi Tongda Pharmaceuticals Technology. We granted Precision Therapeutics â\u0080\u0093 Precision Autoimmune Therapeutics, an exclusive worldwide license for the anti-CD38 monoclonal antibody for the treatment, prevention, and diagnosis of autoimmune diseases. Precision Autoimmune Therapeutics will make an upfront payment of $10 million, equivalent in two equal installments upon completion of its first and second financing, respectively, plus potential future payments of development and sales milestones, and royalties to CASI. Sub-license agreement will allow CASI to remain focused on the malignant hematology-oncology market, while allowing the clinical entity of CID-103 to be explored for the potential treatment of autoimmune diseases. In patients with multiple myeloma EVOMELA is a proprietary formulation with patent protection until at least 2030, and is currently the only cyclodextrin enabled formulation of injectable melphalan commercially available in China. CASI continues to pursue a similar strategy with respect to marketing efforts and physician visits, to further the adoption of stem cell transplantation as a standard of care in the multiple myeloma treatment setting, and will continue working to address the persistent high-unmet medical needs in this patient population. Our partner, Juventas Cell Therapy continues the development of CNCT19, an autologous CD19 directed CAR-T investigational product for which CASI has co-commercial and profit sharing rights. CNCT19 is being developed as a potential treatment for patients with hematological malignancies, which express CD19, including B-cell acute lymphoblastic leukemia, and B-cell non-Hodgkin's lymphoma. CNCT19 is being locally developed in China and will be locally manufactured, which distinguishes this program from other CAR-T19 therapies developed and manufactured in part outside of China. Similar, CD19 CAR-T developed and manufactured utilizing imported components are subject to certain ex-China CMC and higher cost of goods, making the price point significantly higher than we believe the price of CNCT19 will be. Starting in mid-2021, our commercial franchise has thoroughly prepared for the anticipated China NDA filing of the CNCT19 CAR-T program, which we currently expect to be in the second half of 2022. BI-1206, along with our partner, BioInvent, we continue to progress the development and regulatory framework for BI-1206 in China. One is evaluating the BI-1206 combination with rituximab for the treatment of non-Hodgkinâ\u0080\u0099s lymphoma which includes patients with follicular, mantle cell and marginal cell lymphomas, who have relapsed or are refractory to rituximab. A second Phase 1/2 trial is investigating BI-1206 in combination with anti-PD1 therapy Keytruda, otherwise known as pembrolizumab in solid tumors. Earlier this year, the U.S. FDA granted orphan drug status for BI-1206 for the treatment of follicular lymphoma, the most common form of slow growing lymphoma â\u0080\u0093 slow growing non-Hodgkin's lymphoma. Together with BioInvent, we plan to continue to develop BI-1206 in both the hematological malignancies and solid tumors with cancer responsible for the development and commercialization in greater China. The BI-1206 trial has been initiated, and we expect to dose the first patient in the second half of this year. CB-5339 represents a promising new agent for selectively targeting the VCP/p97 target in cancers, and is a complimentary addition to our pipeline of hematology/oncology assets. Together with our partner, Cleave Therapeutics, we plan to develop CB-5339 in acute myeloid leukemia as the potential initial indication with CASI responsible for development and commercialization in greater China. CID-103 is a short â\u0080\u0093 is a fully human IGT1, anti-CD38 monoclonal antibody recognizing a unique epitope that has demonstrated encouraging preclinical and safety profile, compared to other anti-CD38 monoclonal antibodies. In June 2021, we enrolled our first patient in Phase 1 dose escalation study. Lastly, on final Thiotepa we are in the process of responding to the China Center for Drug Evaluation response to the regulatory submissions for two indications. Revenue was $8.6 million for the quarter ended June 30, 2022, 19% of increase compared to $7.2 million for quarter ended June 30, 2021. Secondary to the COVID-19 lockdowns in the few of the major cities in China, the EVOMELA second quarter revenue was slight compares to the first quarter of $9 million in 2022. Costs of revenues was $3.6 million for the quarter ended June 30, 2022, compared to $3 million for the same period last year, which includes royalty payment of $1.7 million and $1.4 million for the same period in 2021. In May, we entered into a business loan agreement with East West Bank to borrow a revolving line of credit up to US$10 million for working capital purpose. By implementing management and budgetary control, we continue to be thoughtful on how we deploy our cash with the focus on creating shareholders' value. With that, I would like to now turn the call back over to the operator to open up the line for questions. Well actually Justin the COVID situation, because Shanghai is a major part of our revenue. But so far, at least in Shanghai, some of the major cities, the revenue is coming back. The COVID situation is obviously quite unpredictable in this regard, with the China policy on COVID control. As we mentioned, I think, the COVID-19 policy is a pretty unpredictable in China and it is something that can happen again in Shanghai, even though it not impacted our business further yet. But sometimes, we are ready and any time and anything happened and again, it's locked down. And for new wave of COVID-19, that is always and we are ready to deal with. This is one of the key challenges, I would say, for the rest of the year and for predict, forecast and our sales and revenue. So, that's why, and for the second quarter our businesses continually can grow 19% compared to same period last three years. So, we still beat the quarter the previous year, that just means that although it's one country, but the country itself is diversified enough to sustain the business. We have the board and the senior management team, we have made a commitment that CASI is going to focus on hematology-oncology market, because, we have a wonderful commercial team. We have marketing cells, we have wonderful connection with KOLs, but we are still a very small company with very limited financial resources. So, in the autoimmune disease, we actually all know that CD38 have been used to treat many different autoimmune indication off-label. So we just found a local venture capital fund is willing to finance a precision autoimmune company, and they kind of fall in love with the CD38 story on the autoimmune space. For instance, like diseases like lupus, ITT, they're really not one disease, they are actually driven by totally different biology. Some of them are driven by D-cell biology, some of them are driven by T-cell biology, some of them are driven by early D-cell, some of them are driven by more, later stage plasma cell. We think actually the major technology breakthrough in this space is the genomic sequencing technology, and also the single cell technology. So we teamed up with professors in Peking University who is really, really at the leading edge of single cell analysis technology. So, by contributing our CD38, we are being part of this brand new precision autoimmune indications. We think this is extremely exciting blue ocean since the single cell technology really opened up a lot of new, potential settlements for autoimmune cell treatment. And clearly, our CD38 is almost finishing Phase 1 studies, and we so far like our data. And so, with additional financing from new investors, CASI does not need to bear the burden of clinical development for these drugs for CD38 in autoimmune diseases. But the NewCo will spend the money to develop autoimmune indication, which could actually help our hematology-oncology indication. And we also will receive about $10 million upfront on payment, which is significant for CASI today's depressed capital market. And with this $10 million, we actually got a very low interest rate loan from East West Bank. Two questions for me first, is as we anticipate the availability of CNCT19, wanted to ask Wei-Wu to the extent that you would have any visibility, what the timing could be on potential NDRL listing. And then my second question would be if you look in the literature there is evidence of many, many anti-CD19 CAR-T cell therapies that are being looked at in China. I think many of them probably academically, in addition to yours and the pharmas. CNCT19 was still, I mean, with all indications Juventas is still on track to file the NDA in 2022. Before end of 2022, investors should expect to see Juventas NDA filing. The approval is most likely going to happen if the CDE agrees with our data, the approval is most likely going to be happening in 2023. Secondly, because of the collaboration between CASI and Juventas, we already have a very experienced commercial and sales team through the launch of EVOMELA, so because the KOLs for EVOMELA are the same sets of KOLs for CAR-T19 treatment. And we hopefully will be the number three, but the first domestic CAR-T19 in China. My understanding is we have sufficient manufacturing capacity for at least â\u0080\u0093 for the first year, at least 5 to 1,000 patients, which we don't expect the first year to exceed 1,000 patients in the first 4 years. Now if our commercial team did such a great job, it's over 1,000 patients, we might actually have to invest into additional manufacturing capacities. On the final Thiotepa, we are working with our partner, ESTEVE, to address all of the recently received CDE questions. On the BI-1206, that program is moving forward. As I noted, the CTA has been approved in China. Well, thank you again for joining today's call. We look forward to leveraging our existing commercial infrastructure, pursue pre-commercial launch activities for the CAR-T19 program, drive expanded pipeline progress and continue to observe steady EVOMELA revenues."
}