{
    "symbol": "AMC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:30:24",
    "content": " In my opinion, there are five reasons why AMC shareholders should be especially excited and smiling today: first, the increasing size of our industry as it recovers; second, AMC's performance in Q4; third, the fact that we are outperforming our competitors; fourth, our agility in raising cash and reducing debt; and fifth, this morning's Walmart-AMC Perfectly Popcorn announcement. Indeed, in full year 2022, AMC saw our annual revenue increase by more than 54% year-over-year, and our adjusted EBITDA improved in a single year by more than $338 million versus 2021. By contrast, AMC has been masterful in raising equity as needed, and we ended 2022 with over $840 million of cash in the bank or undrawn revolving credit line. Regarding capital allocation, our priorities remain unchanged: one, we need to maintain sufficient liquidity to manage through the recovery phase of our business; two, we just strengthened our balance sheet by extending debt maturities, reducing debt and reducing associated interest costs; three, invest in our business to continue to enhance the guest experience; and four, opportunistically pursue value-enhancing initiatives, including those that lead to diversification of our business and revenue streams. Since September of 2022, the creation of APE units resulted in AMC successfully raising $314 million of gross cash proceeds and allowed us to reduce the principal balance of our debt by more than $221 million, most of which was profitably repurchased at a substantial discount. As you already know, the two key proposals are to: one, increase the number of authorized AMC common shares from 524 million to 550 million and combine the AMC common shares and 8 preferred units; second, to effect a reverse stock split of one share for every 10, which, together with the increase in authorized common shares permits that automatic conversion of 8 units into AMC common stock."
}