{
    "symbol": "PYR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 16:32:07",
    "content": " So it just underscores the fact that it's not a mistake, or something that will reverse them, we had two solid years, and six solid months 2020, 2021, $17 million, $31 million, $10 million now we're there. These achievements include producing and delivering plasma torches for the first ever in-factory use within an iron pelletization furnace, a major upstream step in the steelmaking process, and the movement from sample size to commercial scale batch production of titanium metal powder for 3D printing and additive manufacturing, utilizing the company's groundbreaking next-gen plasma atomization system. We continue to execute on our business growth strategy by offering technology solutions that provide benefits from greenhouse gas emissions reduction, clean electric fuel sources, safe waste destruction, and improved production output and quality that take advantage of the company's expertise in patented ultra-high temperature processes for heavy industry. We believe that the PyroGenesis organic growth will be spurred on by a multitude of events including: one, the natural growth of our existing offerings, which continue to accelerate; Two, leveraging our insider golden ticket advantage that we have discussed, and the fact that the in-line hot DROS-enabled DROSRITE metal recovery system is installed inside the customer's facility versus the legacy cold DROS rotary salt furnace approach that is installed off-site. Other previously announced clients, Client B, one of the largest iron ore processors in the world, who has signed a $6 million contracts with the company for 4 plasma torches for their pelletization system, and Client C, who is not only a significant player in the iron ore pelletize industry, but is also a major player in the steel industry both continue to progress at their own pace. It's also important to note that in Q2, 2021, and includes $3.3 million of patent sales, which are not repeated in the first half of 2022 and such sales represent a significant high gross margin percentage. Moving forward, we plan to take advantage of our unique position and expect our main business offerings to accelerate growth with a particular emphasis as I mentioned, our offerings geared towards aggressively reducing greenhouse gas emissions and the world's carbon footprint, while finding and offering solutions even more the world's most pressing environmental engineering and energy challenges."
}