{
    "symbol": "PYR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-18 17:27:04",
    "content": " On the call with us today are Peter Pascali, Chief Executive Officer; Andre Mainella, Chief Financial Officer; and Kosta Darsaklis, Controller; and Steve McCormick, Vice President, Corporate Affairs of PyroGenesis. The company issued a press release yesterday on May 16, 2022 containing business update and financial results for the 2022 first quarter ended March 31, 2022, which is also posted on the company’s website. If you have any questions after the call or would like any additional information about the company, please contact the IR department. The company’s management will now provide prepared remarks reviewing the financial and operational results for the 2022 first quarter ended March 31, 2022. Forward-looking information provided in this call speaks only as of the date of this call and is based on the plans, beliefs, estimates, projections, expectations, opinions, and assumptions of management as of today’s date. In addition, during the course of this call, there may also be a reference to certain non-IFRS financial measures, including references to adjusted net loss and adjusted EBITDA, which do not have any standardized meaning under IFRS and therefore, may not be comparable to similar measures presented by other companies. For more information about both forward-looking information and non-IFRS financial measures, including a reconciliation of each of adjusted net loss and adjusted EBITDA to net loss, please refer to the company's management discussion and analysis, which along with the financial statements are available on the company’s website at www.pyrogenesis.com and the company’s corporate filings on SEDAR at www.sedar.com. To say that I’m disappointed, would be an understatement, because what should have been one of our best quarters was negated by logistic issues being dealt with by our clients. But although I'm disappointed for investors and for our production team, because as I said, this should be one of our best quarters, I'm extremely excited at where we are, where we're going, and the foundation upon which we have built this company. We also continue to build upon established customer relationships, introducing new solutions, and entering new markets, which is setting us up for ongoing success for years to come. Despite the continuing challenges of the global marketplace due to COVID, plus new challenges resulting from the conflict in Ukraine, as well as energy supply shortages in Europe and China, impacting both the cost and output of aluminum and steel opportunities for PyroGenesis continue to expand across the board. In fact, these factors and the global push towards fossil fuel reduction at both industry and government levels gives us the ability to further showcase the PyroGenesis advantage. Our core competencies allow PyroGenesis to lead the way in providing innovative ultra-high temperature solutions, including plasma torches, plasma’s waste processes, metallurgical processes, and engineering services to the global marketplace of heavy industry sectors such as aluminum, steel making, and iron ore production. Additionally, since our acquisition of Pyro Green-Gas, we now offer technologies equipment and expertise in the area of biogas upgrading and air pollution control, which further demonstrates our commitment to offer technology solutions that provide benefits from greenhouse gas emissions reduction. As the war in the Ukraine drove supply chain issues with additional sanctions on Russia, aluminum spot price spiked as high as 60% year-over-year in March 2022, up to $3,487 a ton, which was a 30-year high. All of these factors underscore that with global metal demand growing – anticipated growth by 80% by 2050, and industry carbon-reduction targets not yet on track to meet their goals, aluminum producers must find ways to improve their efficiency, and increase their yield of high-quality metal from current production, all while lowering their carbon footprint. Our range of technology solutions provide just such an opportunity, with the company’s DROSRITETM systems providing industry-leading dross recovery rates of high-quality aluminum, in-line and on-site, with a lower OpEx and lower carbon footprint than all   competing technologies. Additionally, the company’s mainstay plasma torch offering provides another technology-driven solution for metal producers looking to reduce their reliance on the volatile natural gas supply chain or any fossil fuel, for that matter within any aspect of their operations that require metal melting or heating. These same or similar pressures are affecting the global steelmaking industry, into which we have already sold initial torches for final pre-order trials; and we expect similar positive outcomes as a result of these additional pressures. For clarity, as stated many times, most of PyroGenesis’ product lines do not depend on environmental incentives, such as tax credits, GHG certificates, environmental subsidies to be economically viable. We believe that with the increased commitments by the steel making aluminum industries to carbon reduction, it is anticipated that our growth drivers will expand, and shareholders will see increased value. We believe that the PyroGenesis organic growth will be spurred on by a multitude events, including: one, the natural growth of our existing offerings, which continue to be accelerated given our strong balance sheet; two, leveraging off our insider “Golden Ticket” advantage, for example, the fact that the in-line, hot dross-enabled DROSRITE metal system in installed inside a customer’s facility versus the legacy cold-dross Rotary Salt Furnace approach that is installed off-site. This allows us to see first-hand some of the additional and peripheral needs of our customers; and three, exploring, testing and rapidly commercializing new ways to provide unique solutions in value that helps industries deal with some of the most pressing environmental, engineering, and energy problems they have ever seen. Our insider Golden Ticket provides the opportunity to either cross-sell other products, or ideally identify new areas of concern that can be addressed uniquely by PyroGenesis’ solutions. Over the past several years, PyroGenesis has successfully positioned each of its business lines for rapid growth by strategically partnering with multi-billion-dollar entities. I like to highlight that we are now one of the largest, if not the fastest growing dross recovery solutions in the world, with 11 dross DROSRITE systems in use or slated for delivery to markets around the world, and three more under LOI. We also continue to increase the price and the efficiency of our systems, and are pitching several more contracts as we speak. During the quarter, we received a $4 million purchase order for the first of three 10-ton DROSRITE systems from an existing client, which followed the receipt of an LOI from the existing client on June, 2021. As most of you know, steel-making is one of the most carbon emission intensive industries in the world, estimated to be responsible for between 7% and 12% of all global fossil fuel and greenhouse gas emissions. This pressure of the steel-making industry allows PyroGenesis to expect demand for its upstream, iron ore pelletization solution to increase significantly, as steelmakers look to all aspects of the production lifecycle for carbon reduction opportunities. In fact, during the quarter, we announced the scheduling of a factory acceptance test for plasma torches for client A, a multi-billion dollar international producer of iron ore. Subsequently, on February 8, we announced the completion of the factory acceptance test and further announced that the torch system would be shipped to the client’s facility and it is expected to rise on or above the end of the second quarter of 2022. On February 1, we also announced a request for a cost estimate for 36 plasma torches from the same Client A. In addition, we are proactively targeting other industries, which are experiencing significant pressure to reduce greenhouse gases, and which utilize fossil fuel burners as well, such as the cement, aluminum, and automotive industries. Additionally, we are also offering plasma torches to emerging niche markets where there is a high probability of on-going sales from successful implementation. An example of this was our announcement that we had signed a contract with the European Research Center, to manufacture and deliver a 50 kilowatt methane plasma torch, which will be used by the client to develop a process to convert hydrocarbons, including methane, a greenhouse gas, into useful chemicals such as olefins, thereby significantly reducing greenhouse gases. For each new market we open, we also benefit from providing proprietary spare parts and service, which generate significant recurring revenue thus complementing our long-term strategy to build a recurring revenue business model. With respect added manufacturing, we continue to expect to see significant year-over-year improvements in our 3D metal powders offering as our NexGen facility, is now officially online and operational. This new facility incorporates all the previously disclosed benefits, such as increased production rates and lower capital & operating expenditures. Notably, a major tier-one global aerospace company has already entered into an agreement with us to formally qualify its powders, at considerable expense to the global aerospace company, with a view towards having us become a supplier. In conclusion, PyroGenesis sees 2022 as a foundational year from which we will drive exponential growth and position ourselves as a leader in the market for decades to come. We plan to take advantage of our unique position in the market and our broad offerings to accelerate growth with a particular emphasis on offerings geared to aggressively reducing greenhouse gas emissions and the world's carbon footprint, while finding and offering solutions to pressing environmental, engineering, and energy challenges. I'll be back with some final thoughts at the end, but at this point, I like to turn the call over to our Chief Financial Officer, Andre Mainella, to go over the financials in detail. Total revenue for the three months ended March 31, 2022 was 4.2 million, a decrease of 33% from 6.3 million for the same period last year. The revenue decrease was mainly caused by the   in sales related to DROSRITE and , as well as a decrease in support related sales to the U.S. Navy offset by an increase in torch sales and an increase in bio gas upgrading and pollution controls. As of May 15, the yesterday's filing date, the company had a backlog of signed contract of $41.2 million. Gross profit for the three month period ended March 31, 2022 was 1.1 million or 25% of revenue. The decrease in cost of sales was primarily due to a decrease in direct materials and manufacturing over overhead of about 1.8 million, offset by an increase of approximately 600,000 in employee compensation, sub-contracting and foreign exchange. If we look at SG&A and exclude the cost associated with share based expenses, and just to mention, this is a non-cash item in which the option expenses amortized over the vesting periods. Net expense for the three-month period ended March 31, 2022 is 3.9 million, representing an increase of 41% and compared 2.8 million for the same period in 2021. The increase in SG&A expense was mainly attributable to an increase in employee compensation as a result of additional headcount as we continue to build up our base in our facility, as well as an increase in professional fees, office and general travel, depreciation of property and equipment and depreciation of rate of these assets along government grants, IT fees and other expenses. Additionally, share based expenses increased by 81% to 1.7 million for the quarter, compared to 922,000 for the same period in 2021. R&D expenses for the three months period ended March 31, 2022 were 482,000, an increase of 69% or 286,000 for the same period of last year. For comprehensive loss for the three months ended March 31, 2022, was 4.1 million, compared to a net income of 3.7 million for the same quarter of 2021. Modified EBITDA, which we consider a useful metric in measuring ongoing operations was at a loss of 2.8 million, compared to a loss of 761,000 in Q1 of 2021. Modified EBITDA excludes 1.7 million of non-cash share-based expense, as well as a 1.2 million adjustment for the fair market value of strategic investments in Q1 2022. Modified EBITDA also adjusts for an increase in depreciation of property and equipment 67,000, an increase in depreciation of right of use assets right around 60,000, increase in amortization and tangible assets of 212,000, an increase in financial expense of 131,000. We had a strong balance sheet on March 31, 2022 with 6.6 million of cash and cash equivalents. With a strong and clean balance sheet, we believe we're well-positioned to execute on our strategy of growth for organic and through synergistic mergers and acquisitions. Additionally, it's key to point out better revenues and our gross margins this quarter, both reported downwards were impacted by certain accounting procedures that negated the recognition of certain revenue. More specifically, the company had nearly completed several projects that were delayed due to global shipping challenges, and not completed as quickly as we would have liked. With these factors related to external shipping and logistics factors and not to the company's sales and production effort, it's noteworthy that this should be mentioned for the benefit of investors understanding. In addition, those contracts which are close to the final delivery stage tend to incur cost at a slower pace, as well as the corresponding revenue. Moving forward, we plan to take advantage of our unique position and expect our main business offerings to accelerate growth. The particular emphasis on offerings goods were aggressively reducing greenhouse gas emissions and the world's carbon footprint, while funding and offering solutions to even more of the world's most pressing environmental engineering and energy’s challenges. Our strong financial position, we are well funded to execute our growth strategy of the foreseeable future and have absolutely no plans and no need to raise additional capital. So, there's no change in the revenue direction, there could be a slight change in the maker contract, but there's no indication of   now. I think just to underscore that, it was to be factual and include all the contracts that come within three years, but most of them are, as we said within 18 months. Our next question, from the MD&A, SG&A costs were up significantly on lower revenue and insurance costs seem to be increasing by a lot. Whereas at Q1 of the current year has a significant portion of , so that's one the main drivers for the SG&A increase along with the additional head count as we're building up our fundamental of the business and the core business as well. So, I mean, basically the revenues that you've delayed recognition of is for work that's already been completed and for reasons you haven't articulated you're delaying the bank. No, I'm referring to, I mentioned earlier that during the CFO’s remarks that, when he talking here about liquidity and apparent care versus, I guess cash in reality that the company in a customer have mutually agreed to delay revenue from a contract. So, our accounts receivable was balanced, of course to 17 million at March 31, 2022, but again, that's an intentional agreement that we had with our customer to favor ourselves and to favor the customer to delay the payment, which has delayed the collection of the receivable. So that's why it's sitting in receivables, but it has nothing to do with the backlog of a contract of 42 million. So back to your backlog, just remind us what's the timeline for converting the 41.2 million? So, most of that is within the 18 months, but there are some outlying ones like on a U.S. military contract that made well three years. We expect them to roughly play out over the next 18 months barring any supply chain issues or when I say supply chain issues, I’m also talking about shipping. So, if there are delays in getting onto of that truck or onto that ship to get them shipped, they can be sitting in our warehouse, and we will miss the quarter and not be able to present complete them although they are completed, but for accounting purpose until they're actually out of our hands, they can be presented completed. Regarding the racing to 50 million and beyond, I just want to dig into that a little bit because your estimate to client A and the steel making far exceeds that 50 million amount. And I chose that $50 million mark just as a psychological market, just a number that's above 41 right now, but I do point it out quite rightly. Everyone’s moving forward, everyone's investing time, effort, and money. And now that's even further aggravated by the cost of diesel increasing, which as you know our torches don't run on diesel. So, I’ve got on  and suggest that if somebody should pop out a that field, maybe it will increase the cost to us of providing a full system. Maybe we’re going to have to add something, but I do not see at this point, anything that would critically affect the actual contract. Now, I say that with a lot of caution because crazy things can happen, but that's the way it's looking. And as you rightly point out Jeffery, it’s just that one order is between 95 million and 115 million and we anticipate actually from beginning to end delivering that well within nine months, not from now, but from when it’s awarded. So that particular contract if you just want to focus on that, could very well sell a very significant business 9 months out, 12 month out. And while this seems to logically support the need for greater productive efficiency, less throughput and higher operating costs also suggests capital to invest in efficiency might be harder to come by. However, on the demand side, there is increased demand, because it increased interest that aluminum waste stream, now with aluminum is a much more value obviously because aluminum has gone up in price. And the demand, it's – what it actually does is better because the output of the aluminum that we recover is now of a higher value than it was a year ago. Basically what I was trying to say was, is that if the – it sounds like from what you said, there's some stresses on the aluminum producers base with regard to perhaps so much throughput they can get out. And also, their operating costs are higher because we all know aluminum uses is a lot of power and power prices are up. And I suspect if you can get more value from your waste stream, it sort of offsets any other costs or increase your profitability to the other end no matter what's happening to you. So, the fact that they've got this valuable aluminum in their waste stream and that value has increased significantly over time. So, PyroGenesis’ DROSRITE system is a proven entity, it's out there, it's won some of the biggest bids, it's working. And now as we’re covering basically at the same cost, I mean to us it's even lower cost because as I say, we’re buying in bulk. So, again, no matter what's happening on other side of their business, we added an advantage by actually increasing the value of their – increase in what the value that they extract from their waste stream. Maybe I'm not visualizing this correctly, but it seems like the plasma torch installation can be managed more incrementally than just having to buy a whole comprehensive system. That's what we've been doing for 20 plus years, manufacturing all sorts of torches. I mean, we can do it with no one advanced notice within nine months, but with advanced notice we can get it done and installed we're hoping we're targeting three to four months. What's interesting also is that we can – when we make these shortages, we can make them offsite if we have a large number, so we could drop ship them to the iron ore pelletizer site where they have a significant engineering expertise. If they need, we can do it remotely or  team if what they need to every so often, but this is one of the most exciting one of our offerings because we don't need to really invest in manufacturing space, we can leverage off of other people's manufacturing facilities. And if it wasn't exciting enough the year ago, now, as I said, and I hate to repeat myself with the increased price of diesel, the business case for these things goes out the roof – through the roof. So Client B, I believe is the  client who has ordered four torches, if I recall them for about $1.5 billion a piece, so it's about $6 million. That client has also given us some visibility as to what we should expect, should these four torches be put in place and they work. Interestingly enough, both Client A and Client B have in their annual reports reflecting the fact that they're actually working with plasma and plasma torches, although we don't name them, we do have the patent on that."
}