{
    "symbol": "SNPS",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-15 20:43:02",
    "content": "  Operator: Ladies and gentlemen, welcome to the Synopsys Earnings Conference Call for the First Quarter of Fiscal Year 2023. And as a reminder, today's call is being recorded. With us today are Aart de Geus, Chair and CEO of Synopsys; and Shelagh Glaser, Chief Financial Officer. Before we begin, I'd like to remind everyone that during the course of this conference call, Synopsys will discuss forecasts, targets and other forward-looking information regarding the company and its financial results. While these statements represent our best current judgment about future results and performance as of today, our actual results are subject to many risks and uncertainties that could cause actual results to differ materially from what we expect. In addition to any risks that we highlight during this call, important risk factors that may affect our future results and performance are described in our most recent filings with the SEC, including our most recent annual report on Form 10-K and subsequently filed quarterly reports on Form 10-Q. Revenue was $1.36 billion, with non-GAAP operating margin at 35.2%, resulting in GAAP earnings per share of $1.75. Based on the continued robust design activity, we remain confident in our business. In the last few years, Synopsys has grown and evolved substantially. Starting in Q1, we are reporting our business in three segments: Design Automation, which includes design software, verification software and hardware and other EDA products. Design IP, a broad portfolio, including libraries, embedded memories, connectivity solutions, processor cores and security devices. And Software Integrity, which remains unchanged from previous reporting and deliver solutions to improve software quality and security. To give you a relative sense of proportion, Design Automation is about 65% of our revenue. While these numbers are approximate, the 65%, 25%, 10% split is easy to remember and represents well how we think of our present business. As the market leader in design automation, we see continued technical innovation towards still much, much more complex silicon and system designs. As the company with the broadest portfolio of IP, we see a continuation of designs, needing more communication bandwidth, processing, storage and security in still more advanced silicon technologies. And for our Software Integrity business, we are a key enabler of modern software security with a leading portfolio of products for developers, the DevOps groups and the corporate security teams. Looking at the overall market picture, already 12 years ago, we identified the intersection of big data and machine learning as leading us into the age of Smart Everything. While some present market undercurrents drive many companies to strive for efficiency, our semiconductor and systems customers continue to prioritize investments in the design of complex chips and software to make all of this possible. Synopsys is in the midst of this quest, and we see our purpose to be a key catalyst enabling the smart everything world. With our customers and partners, our role is to make this all work to the state-of-the-art solutions ranging from the deep physics of silicon to the heights of performance, power and security of complex hardware software systems. Over the past several years, we have successfully invested in groundbreaking innovations that radically advance how silicon and system design is done. So let me begin with the Design Automation segment, which accounts for about 65% of our revenue and share some highlights around our groundbreaking DSO.ai artificial intelligence design solution. Applied simultaneously to multiple steps of the design flow, it reduces efforts from months to now weeks while simultaneously delivering higher performance and lower power. We already put in production designed by nine of the top 10 semiconductor leaders, customers such as Samsung, Intel, MediaTek, ST Microelectronics and many others are reporting impressive achievements. In Q1, we saw multiple additional deployments across verticals, including mobile, data center and memory designs. Meanwhile, we have extended our machine learning capabilities to other EDA workloads ranging from verification to test to custom design. Specifically, our Fusion Compiler momentum is manifested across a wide spectrum of market verticals and manufacturing processes. During the quarter, we achieved multiple advanced node design wins, including a key win at a large hyperscaler and a three-nanometer node design at a leading mobile provider. Fusion compile is used a 95% of advanced node designs at three-nanometer and below with the majority exclusively using Synopsys flows, stimulated by a wave of high-value innovations customers from high-performance computing to hyperscalers continue to expand their reliance on Synopsys throughout our portfolio. Our custom solutions, for example, saw continued market momentum in Q1 and as we added nine new logos in the quarter with a robust market pipeline. All these highly complex designs need to work both correctly and work under multiple conditions and scenarios like temperature, voltage, manufacturing variability and so on. While verification is fundamentally an unbounded problem, our state-of-the-art simulation, emulation and prototyping products tackle these tough challenges at unparalleled speed with the fastest engines, highest capacity and lowest cost of ownership. Building on another record year in 2022, we continue to see excellent growth in hardware with both our ZeBu emulation and HAPS prototyping products. This quarter, we achieved major expansions with our Zibo EP1 and HAPS 100 hardware as several of the largest semiconductor systems and hyperscaler companies in the world. Meanwhile, multi-die system design, sometimes also called chiplet-based design is opening a whole new era of silicon complexity. In Q1, our differentiated multi-die solution around 3D IC Compiler continued its strong momentum deployed on production tape-outs at the top, high-performance computing chip supplier and a large networking systems company. Let me move to Design IP, which is, as I mentioned, about 25% of our business. Third-party IP, think of it as the LEGO blocks of chip design continues to grow in complexity and importance. Our market-leading IP portfolio, by far the broadest in the industry, continues to grow with high demand in high-performance compute, automotive and mobile markets fueled by Smart Everything, multi-die systems and high speed and secure connectivity. While maintaining technical leadership, we've broadened our portfolio with new high-speed interfaces in three and four-nanometer processes to serve HPC and mobile applications at the leading edge. In the automotive market, we see strong adoption of automotive-grade IP solutions by OEMs and Tier 1 suppliers now developing their own chips. Meanwhile, multi-die systems require a whole new portfolio of state-of-the-art die-to-die interface IP. This brings me to our Software Integrity segment, which as mentioned, accounts for about 10% of our revenue. As every vertical market is developing highly complex, big data-driven systems, their requirements for security and safety continue to expand. Our Software Integrity solutions enable organizations to improve and manage the security and quality of software across a wide range of industry verticals from semiconductors and systems to financial services, automotive, industrial, health and more. While this continues to be one area where we feel some caution from the macro environment, we had a good start to the year with several multiyear, multiproduct transactions and sustained momentum in our indirect channel. In summary, Q1 was a very solid start to the year, delivering strong financial results. Notwithstanding continued macroeconomic choppiness, our customers continue to prioritize their investments in chips and systems. In addition, our resilient business model provides a level of stability uncommon in most software companies. Meanwhile, our high-impact innovation pipeline across our entire portfolio is driving technical differentiation while solidifying our foundation for continued business growth. With that, I'd like to welcome Shelagh Glaser to our first Synopsys earnings call. We are thrilled to have her on board as a financial, operational and scaling experience as well as a deep understanding of the semiconductor industry are a great asset to Synopsys as we drive exciting growth ambitions. We delivered a very solid start to the year with revenue above the midpoint of our guided range, non-GAAP operating margin of 35.2% and non-GAAP earnings above the high end of our target range. Robust chip and system design activity despite lower semiconductor industry revenue growth and a resilient, stable, time-based business model was $6.9 billion in non-cancelable backlog. We remain confident in our business, and as a result, we are reaffirming our full year 2023 targets for revenue and non-GAAP operating margin improvement and raising our full year outlook for non-GAAP EPS due to a lower tax rate. Total GAAP costs and expenses were $1.11 billion, which includes approximately $41 million in restructuring costs. Total non-GAAP costs and expenses were $882 million, resulting in non-GAAP operating margin of 35.2%. 75, non-GAAP earnings per share were $2.62. As Aart mentioned, we are expanding our segment reporting to align with how we're managing the business. Starting in Q1, we are now reporting three segments, Design Automation, Design IP and Software Integrity. Design IP segment revenue was $344 million, and adjusted operating margin was 34. For fiscal year 2023, the full year targets are: revenue of $5.775 billion to $5. Total non-GAAP costs and expenses between $3.81 billion and $3.84 billion, resulting in non-GAAP operating margin improvement of more than 100 basis points. 12 to $7.30 per share, non-GAAP earnings of $10.53 to $10.60 per share. Cash flow of operations of approximately $1.65 billion, which includes approximately $40 million to $50 million in restructuring costs. Revenue between $1.36 billion and $1.39 billion, total GAAP costs and expenses between $1.085 billion and $1.105 billion, total non-GAAP costs and expenses between $917 million and $927 million, GAAP earnings of $1.62 to $1.72 per share, and non-GAAP earnings of $2.45 to $2.50 per share. While the underlying macroeconomic environment is choppy, we continue to execute and for the year, expect 14% to 15% revenue growth. Our confidence reflects our innovative technology portfolio, ongoing design activity by our customers who continue to invest through semiconductor cycles and the stability and resiliency of our time-based business model. Well, going backwards on your question, yes, I think it will drive positive growth for Synopsys. It's been actually quite remarkable as we started to travel again this year that after a number of years of being at least physically distant, the relationship with many of our customers have evolved substantially. And actually, in a good way, meaning that both this continuation on the traditional Moore's Law, but there's also a whole set of systems interactions be it when you have multiple dies or if you have hardware and software interactions that all demand a degree of automation that is way more sophisticated. And so in the midst of that, comes the entry now for us a little bit over two years ago of capabilities that really change how design is done. And moreover, it changes them in a very similar fashion like Synthesis literally many decades ago, it automates things that previously were thought to not be automatable. And the very fact that we can point at so many production designs, we're not talking people trying stuff out. And then in the midst of the trial, they said, well, I want to reuse these results because they're better than what I had before, and that project is not finished yet. Well, what slows it down is, are they sure that the tools don't make mistakes that it's actually proven technology. Well, that's the negotiation scale that we will need to bring to bear and they will need to bring to bear. I guess, has anything changed in terms of design starts influencing the IP business. And obviously, you're reiterating the full year. And as you note, I mean, really, the timing of revenue and the timing for us is aligned with when we sign the big deals and when the customers have pulled down things for their own product schedules. I think, first of all, thanks for breaking out the Design Automation margins and the IP margins. Well, I think the first thing to think about it is while it was not visible individually for these pieces, over the last four, five years, we have substantially improved the margins throughout the company. And by disclosing some of the numbers, specifically on the IP, which you probably haven't seen before, I hope that you realize that this was probably better than you were expecting. Because as you know, developing IP is actually a very sophisticated and somewhat labor-intense job. Having said that, I think we have improved steadily largely because we're actually getting better at what we do and we do more of it. And in IP, we see actually a very fertile horizon because with the increasing complexity that I mentioned earlier, there are a lot of companies that are coming into doing chips that have never done it before. In many ways, the same is true on the Software Integrity side, but from a different perspective, which is the perspective that as you grow as a software company, you get leverage out of the sheer business model and the leverage on the work that you have to do. And so we have said all along that by the time Software Integrity would be around the 10% of our business, which it is, we will continue now to push on the ops margin while continuing to push on growth and there's opportunity on both sides. And when you look at yourself, you always saying, wow, there's so many things we could do better. And so yeah, I do think that there's opportunity there as well. Hey, I really want to come back and ask you around AI and the ChatGPT, I'm just taking it as an example. I think that some people are thinking about this is the competition between really between Microsoft and Google, but there are some other people think this is actually a competition between GPU and TPU, I mean, tensor processing unit that Google internally developed. So I just want to check because I don't exactly want you to comment on your customer, but this hopefully, you can provide you a vision on this. Well, I want to agree with every statement you made, meaning the race is on in every dimension because whenever in our field, and this is true for history, there's some major breakthroughs, some everybody realized, wow, this is possible. It is also true that we had said for, I want to say, at least half a decade that from our perspective, chip design is increasingly driven by verticals down, meaning that every end market has by now realized that they need to do something smart and that their domain can benefit by doing it specifically for their problem. And so optimizing for agriculture is just not the same as for automotive, and it's not the same as finance and phone. And of course, people want to win and they can win with better algorithms but they can also win with better algorithms multiplied by much better chips. And so that's why we see -- we will see a continuation of new chips, derivatives of chips and I think a very fertile ground for the semiconductor industry and therefore, for us. Maybe a follow-up question back to this question, another analyst had just asked. On the operating margin side, very pleasantly surprised by the 41% operating margin of your Design IP business in Q1 '22. I think there's a premise that the IP may be structurally lower margin than EDA, well, partly because it's more labor-intensive Aart, as you mentioned, but it looks like it's probably not always the case, at least on a quarterly basis, but on an annual basis going forward, shall we be thinking about IP operating margin is kind of in line with design automation or there may still be some gap despite there may be some quarter-to-quarter fluctuations from here? There's the natural ebb and flow when customers pull down, and they've got a design that we're supporting and that is a bit more labor-intensive because we're building out IPs, just as already even talked about for multiple nodes, multiple IP standards. And over time, we think about that margin is slightly lower than the overall corporate margin and EDA as being slightly higher. I'm curious if this assumption is based on higher upfront licensing and I guess more specifically, maybe some lumpiness related to the hardware verification business. So as we think about our business, our design IP business has a lumpiness to it just in terms of aligning with customers' product starts our schedules aligned with that. We do, as you mentioned, have a significant backlog that we balance through the year, and then hardware does have some lumpiness with customers depending on when their schedules to take possession of it. If you look at our revenue quarter-by-quarter over, I'd say, four, five, six, seven years, you would see that 2022 was actually an anomaly with a particularly high push early in the year. And you may recall that at that point in time, there was also euphoria in the market. And of course, there's some sales phenomena that the first quarter tends to be weaker than the last one because everybody works hard on the last one. But having said that, I think this is, in many ways, the profile of a normal year. Aart, I haven't heard you mention silicon life cycle management recently or maybe I missed it. Actually, recently, must be the last 30 minutes because it's actually a topic I love to talk about because we're making excellent advances in there. And I'm not thinking here of the electrification, which is also happening that the whole notion of essentially a software-driven device literally. And that is where the life cycle management is essentially a set of steps that start at the very development of the chip of putting certain sensors inside of the chip, having the ability to query them in a smart way about potential failures or abnomalies, I should say, and then do that through the manufacturing, through the installation through the early years but also over life cycle, literally of the car. Turns out that the other fields that have life cycle stresses that are in a different way just as high, such as compute centers that are really very sensitive about some servers going down and wanting to hide that from their customers or, I should say, protect their customers from that. And this fits very well, I think the Synopsys profile because One of our skill set is that we have skills in many different phases of the whole system design development and utilization. Aart, one of the interesting phenomenon in your organic headcount growth over the last number of years has been the seemingly large investments you've made in AE capacity. And so the question is, could you speak generally about the utilization that you're seeing of that AE capacity investment. And specifically, what kind of resources are being called upon for DSO.ai SLM, which you just mentioned or any other newer product areas to which AE capacity is being directed. Well, it's a great question because whenever we introduce new technology, you have two or three different steps. The first thing is, obviously, how quickly can 1 make it useful for a customer given their flows, their ways of doing things and adapt it essentially to their situation while at the same time, teaching them the basics of how to run it to get good results. Once you have done that, it never ends because once you get good results, they want great results. And of course, there's a lot we can do by optimizing things for their circumstances. By the time you talk about something like SLM, it goes in many different directions because now you have the intersection of testing techniques, built-in sensor or techniques all the way to how ultimately does this get designed into the system with learning capabilities and fast interpretation on chip. And so in general, I think we are going to broaden the skill set to be more and more multidisciplinary as we have some people that obviously are very deep in different areas. And the people that can handle a broader swath of the design flow for the customer or with the customer, I should say, is important. The last two comments is with some of the newer entrants into chip design, they really are looking for a lot of automation as much as possible upfront. And one can start right away with brand new flows, reuse of IT and so on. So in general, it's a multiplier on our business and the quality of our people and the trust relationship becomes more and more important as we are working deep in the production designs of our customers. So with regard to segment reporting, once upon a time, which is to say, back in the primary era of 2018, one of the segments you used to report was DFM which is reasonably sizable at the time, and I imagine it's grown as a whole physical verification category has grown. But with all of the new fab construction activity that's underway, particularly here in the U.S., could you perhaps talk about the progress of that business? Or how are you looking at the growth of that DFM business since you last talked about it, at which time was already $0.25 billion. Well, while we don't disclose in detail what the size is of this, it is part of our Design Automation segment. And there's absolutely a great return for the customer in doing that because more and more doing and the fab is extremely expensive, but it also takes a long time before you have results. And again, I'll use the word trust because -- this -- we are really very much inside of the silicon kitchen here. I'm probably nitpicking here, but if I go over the last few years, you were able to raise full year sales outlook almost consistently every quarter. And even when I go to the last call, there was a statement about steady growth throughout the year. I mean 14%, 15% is obviously still very impressive. But what is different or do you think, between this year versus the last few years in terms of how you saw steady upside throughout the year, but you're not seeing it so far this year. Well, let me just remind you that last quarter, many of you commented that they were surprised that we do 14% to 15% given the uncertainty in the market. -- we all understand that there's still some open questions on the market, but it feels at least in our domain that we were relatively correct in estimating what would be reasonable to shoot for, for this year. And -- but right now, I think we're on a really good track. Does it mean fewer design starts because it's very expensive to do three-nanometer or two-nanometer design, but then maybe they become more tool intensive. Well, for starters, I don't think that there are fewer design starts. Secondly, we've always believed that complexity is a good thing for us because we are an enabler, and I saw and in all of the people developing the new technologies. And I think we have now a fabulous new horizon, which is going from one to multiple chips that are in very close proximity is actually a technology feat in itself. And we're in the midst of that, and it is really exciting that a number of the top leaders in this field are doing production design with us already. And so this is active learning, and so I'm not worried that it's going to get in the way on the contrary, I think. And I'm on record of having said many times now that a whole new age of systemic complexity has opened up and it retains one characteristic from the past, which is there's unbelievable exponential ambition formulated by Gordon more many years ago. The race is on, there's new opportunities. And I guess the first part of my question is in terms of implementation of the tool, can you talk a little bit about how your customers guide  to see the 100 commercial pays. Remember, though, that the most advanced customers, the biggest ones have themselves enormous clouds. But it's interesting, even there, we see a number of people that say, well, what it had way more compute for a couple of weeks. So I think we'll continue to see both, but overall, it's going to be spreading among more and more customers. And the follow-up to that is the beauty of AI and Generative AI, we've been hearing a lot about it, obviously, over the last few weeks and months is the concept of learning as the systems get more information. And so I would think that, that would tend to mean that as we move forward here and the system gets better on learning, whether it's fiscal layout or improving some of the sensification  that you talked about, that it should accelerate in use cases. But generally, it's not only the product that's getting better. And we often forget that, well, a lot of people talk about, is this new design we're doing and new design we're doing. In fact, there's many of these signs are derivatives of already existing designs. And that includes, by the way, if that chip needs to go to a different silicon technology or if that chip gets a few other additional blocks to let's say, personalize it to a different customer of the customer. And I think there is a lot of potential in all of these things to still do way, way, way better, but the advances are remarkable. And we're tracking this, and we see quarter-by-quarter new breakthroughs in many things. However, I mean, it's still great to see that growth is higher from our breakdown as well as margin improvement. Well, in any case, there are always a couple of dimensions to the progress because what has been interesting, we have invested now for a few years in a platform that brings multiple tools together. And increasingly, what the people would want to have that are in charge of security, so more top-down in the company is an overview of which what gets caught where and how do you bring these diagnostics together to have a better assessment of the risks that they have to manage. At the same time, the normal business continues as mentioned in the economic surroundings, what we see essentially is that the levels of signatures needed to close the deal takes a little bit longer. But overall, there's no doubt that this is an area that continues to grow and has still a lot of potential because a lot of customers are barely at stage one of automating this. And so we're looking at growing between 15% and 20% this year, which is exactly on the target that we had told you before. It seems like you guys are both doing sort of like a race towards capturing the most amount of the market, and it seems to be a great growth opportunity. There's training of the tool, this training of the user. And I must say, I have personally been surprised because initially, when we had these fantastic results in early 2020. I thought, okay, well, that's great, but it's going to take a while before they adopt it. But the results were so good that people actually couldn't resist adopting it even not having fully appreciated what it would take to do things, and of course, our own AEs, as Jay mentioned earlier, we are well trained to help them. But initially, we didn't do it with too many customers. And so that first year, year and half years, we had a limited set of really advanced customers, and we follow the same recipe, whoever runs fast is with us, we will run fast with them. It means that I think we are well equipped to take the design processes that our customers have, which we, by the way, know very well and adopt the tool to it and modifies likely the process for the tool. It's hard for me to compare to competition, and it always feels like difficult to be objective about that. And we are very, very rapidly moving to next generations of our tool and solution -- and the very fact that we are now well over 100 production designs I should tell you that this is not driving with training wheels, so to speak, this bike is going down the hill at high speed has only kids we dare to do. And I think I had also mentioned in the preamble that we've broadened substantially the applicability not only in the digital space, but some of the parallel spaces of test and verification and also logic signal. So DSO.ai question from a Synopsys perspective, is the margin opportunity -- is it similar to your core EDA tools? It's more like, okay, can they find the budget to keep moving here. And I don't want to be too light about a statement like that because we work with people for many, many years. But overall, I think there's no question. These are technical advances of extremely high value, and they directly multiply the opportunity space that our customers have. A portion of it is sitting in Q1, about $41 million of that is hitting in Q1. I would like to turn the call back over to our Chair and CEO, Aart de Geus. Well, thank you very much for participating in the call."
}