{
    "symbol": "AIMC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 12:27:03",
    "content": " On today's call, management will refer to non-GAAP diluted earnings per share, non-GAAP income from operations, non-GAAP net income, non-GAAP adjusted EBITDA, non-GAAP operating income margin, non-GAAP adjusted EBITDA margin, non-GAAP organic sales, non-GAAP gross margin, non-GAAP operating working capital, non-GAAP net debt, non-GAAP free cash flow and non-GAAP adjusted free cash flow. The primary drivers of the margin improvement will be operating leverage on organic growth, pricing, supply chain cost reductions, both as demand and supply balance out generally and through specific internal initiatives to reduce costs, such as PPV and VA/VE -- continued synergy capture, productivity improvements by reducing waste in all aspects of the business through ABS and by focusing on higher margin opportunities while deemphasizing opportunities with lower margins. As we outlined at our Investor Day, this includes leveraging our technology differentiation and proven Altra Business System tools in strong secular markets to achieve 3% to 5% annual organic growth, actively managing the portfolio through disciplined M&A to drive further upside, delivering 300 basis points of margin expansion by 2024 and achieving consistent free cash flow conversion greater than 100%. On a pro forma organic basis, excluding JVS First quarter sales for A&S increased 8.5% overall year-over-year, again demonstrating the strong demand in the ongoing businesses. Non-GAAP net income from operations increased by $6.2 million from Q1 last year or 7.4%, primarily due to volume leverage, partially offset by higher operating expenses due to inflation. Non-GAAP adjusted EBITDA was $103.1 million for the first quarter, up 1.5% compared with Q1 last year or 20.1% of net sales, down 140 basis points compared with Q1 last year. Excluding JVS, pro forma adjusted EBITDA grew to $93.8 million or 20.1% of net sales, down 30 basis points year-over-year. Working capital grew from year-end 2021 by approximately $80 million, reflecting growth in inventory and accounts receivable, primarily driven by strong March sales, which were up 25% when compared to the month of December 2021 and reflecting our investment in inventory to support the strong underlying demand. With that as background, our guidance for the full year 2022 is as follows: Including the JVS contribution in 2022, we expect annual sales in the range of $1.9 billion to $1.94 billion, GAAP diluted EPS in the range of $2.59 to $2.69, non-GAAP adjusted EPS in the range of $3.35 to $3.50 and non-GAAP adjusted EBITDA in the range of $388 million to $403 million."
}