{
    "symbol": "TRP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 18:57:07",
    "content": " But if you believe, as I do, that the war in Ukraine has caused a fundamental shift with respect to where our European allies source their gas from and that this incremental demand for natural gas is going to keep prices in Europe and Asia in the $13 to $20 range, which is where they currently are for 2023 and 2024, a $2 transportation rate for incremental pipeline capacity to the Gulf Coast may well clear the market. Yes, Robert, it's Joel here. So first, it's really worth noting that when you look at all of our major projects, including Bruce Power, the MCR program there, expansion projects along our U.S. natural gas pipeline footprint along with Liquids Pipelines, those all remain on time and on budget. And if you look at the 1.4 Bcf a day of projects that the FERC approved that are under construction right now, when you look at the other opportunities that we have, I could see a scenario where over the next two or three years, fit's another 2 or 3, maybe 4 Bcf a day of capacity to the LNG terminals that we're adding on our systems. So at the same time, as we're comfortable allocating approximately $20 billion of our $25 billion program to natural gas, we're also bullish on pursuing alternate sources of energy, be they renewables, hydrogen, CCUS or otherwise because we do have to achieve not only reliability and affordability, but also the lowest possible emission profile for -- in order to allow the industry to prosper. Yes, Robert, it's Joel here. Look, our key messages are we continue to be opportunity rich beyond our $25 billion existing program, when you look at LNG export growth, when you look at our RFI program to electrify our own power consumption, you look at pumped hydro storage, you look at hydrogen, you look at CCUS, you look at recoverable maintenance capital, we're very confident in our ability to deploy $5 billion a year in a responsible manner, consistent with our historical risk and return preferences."
}