{
    "symbol": "WSBC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:44:04",
    "content": " During the first quarter, we successfully completed a Tier-2 capital raise through our public offering of a $150 million of 10-year fixed to floating rate subordinated debt priced at 3.75%. Regarding our residential lending group, we continue to see good growth from our team of mortgage loan originators as their books of business have shifted significantly to home purchases and construction, which accounted for approximately 75% of the originations during the first quarter. As of March 31st, our residential mortgage pipeline, while down slightly from a year ago, has grown to approximately $215 million, an increase of 33% from the fourth quarter. Based on our strong commercial pipeline as we entered the first quarter, these experienced teams generated gross loan production of roughly $640 million during the first quarter, nearly double the year-ago period. In addition, they have continued to seek new business opportunities, which has helped our commercial pipeline reach a record $990 million as of March 31st, a nearly 70% increase from the pipeline year-end, with our Mid-Atlantic region accounting for approximately 28% of our current pipeline. The net interest margin in the first quarter was 2.95%, decreasing 32 basis points year-over-year, primarily due to the low interest rate environment, as well as the mix shift on the balance sheet to more securities, which now represent approximately 24% of total assets versus 21% last year. Despite record trust fee income and record securities brokerage income this quarter, non-interest income for the first quarter of 2022 was $30.4 million down 8.5% primarily due to lower swap fee income and lower mortgage banking income from our continued efforts to retain more residential mortgages on the balance sheet. Reflecting the rising rate environment and general lack of inventory, residential mortgage originations declined 17% year-over-year to $271 million during the first quarter, with mortgage refinancing representing 26% of production compared to 57% in the first quarter of last year. Excluding restructuring and merger-related expenses, non-interest expense for the first quarter of 2022 increased $0.5 million, less than 1% to $86 million compared to the prior year. Salaries and wages, which increased at $2 million, or 5.5% compared to the prior year, reflect our new hire strategy, normal merit increases, and the hourly wage increase that we implemented last year, partially offset by lower deferred loan origination costs. So right now, just to kind of ball packet, let's call it for every 25-basis point -- for every 25-basis point increase in rates, we're projecting between a three to five basis point improvement in the quarterly margin after it's been in place -- after that 25 basis points has been in place for a full three months, since a lot of our loans reprice every three months. Loan production office in Northern Virginia was last July or so that we get that going and that's been representing about 15% of our quarterly Company-wide production in residential mortgage so that came on really quickly and you know with the new hires and Nashville, and if we mentioned in the prepared remarks and in Indianapolis, already starting to see deal flow on the commercial side. And I think if we had a more normalized, typically $85 million a quarter commercial real estate payoff to the secondary market, we were up above that a 130 -- $536 million or so, if we had a more normalized $85 million, we actually would've been around 5.5% annualized loan growth for the quarter. Remember we did last year in terms of maybe as the year before we originations like $1 billion -- 7 to $2 billion or so in commercial loans so I think when you look at that, I think the pipe -- the pull-through would be well above 50% and I would imagine that would continue."
}