{
    "symbol": "WSBC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:48:03",
    "content": " Reflecting the strength of our markets and lending teams, we again reported strong broad-based loan growth during the quarter, despite elevated commercial real estate loan payoffs of $173 million. Total commercial loan year-over-year over year growth of 3.4% was impacted by elevated commercial real estate payoffs, which were approximately $83 million above a more normalized historical average. Loan balances for the third quarter of 2022, which grew both year-over-year and sequentially, reflected strong performance by our commercial and consumer lending teams and more one-to-four family residential mortgages retained on the balance sheet, partially offset by the continuation of SBA PPP loan forgiveness and elevated commercial real estate payoffs. For the third quarter of 2022, non-interest income of $32.3 million was down just $0.5 million year-over-year, primarily due to lower mortgage banking income, which decreased $3.3 million due to a reduction in residential mortgage originations consistent with the industry in general and the retention of more loans on the balance sheet. Excluding restructuring and merger-related expenses, non-interest expense for the three months ended September 30, 2022 totaled $91.9 million, a 5.6% increase from the second quarter and just a 1.8% increase year-over-year. And that's kind of our plan is that on a kind of rolling quarter basis that you see that that upper single digit loan growth and particularly related to some of the commercial real estate payoffs, which abated in the second quarter came back in the third quarter, but we think are updating again because interest rates are going up. The 4% deposit beta that'll go up over time, we think that competitive advantage on deposit pricing will really exist through the entire cycle relative to peers, but they are going to have to go up to address what the needs are and I think just funding that loan growth that we would expect to have, we have to have a continued focus on deposits."
}