{
    "symbol": "WSBC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 16:35:19",
    "content": " The key story of this quarter was the strength of our balance sheet as we demonstrated year-over-year growth in both total deposits, which increased 5.3% when excluding certificates of deposit and total loans, which increased 3.8% when excluding SBA PPP loans. We continued to see good production from our commercial lending teams based upon our record commercial pipeline of $900 million to $90 million in March 31, our commercial teams generated gross loan production of roughly $740 million during the second quarter. While we do not anticipate similar sequential loan growth, the next few quarters, our teams continue to find new business opportunities, which has helped our commercial pipeline remain relatively strong at approximately $825 million as of June 30 with roughly 30% of that pipeline in Kentucky and Maryland. Our team originated $328 million of mortgages during the second quarter, which was a 21% increase from the first quarter and comparable to the level of a year ago. The net interest margin in the second quarter of 3.03% increased eight basis points sequentially, which reflects the 125 basis point increase in their federal funds rate during the last three months, as well as our successful deployment of excess cash through loan and securities growth. For the second quarter of 2022 non-interest income of $27 million was down $9.1 million year-over-year due primarily to lower mortgage banking income, which decreased $6.5 million and a $1.3 million net loss in other assets, which compared to a $4 million net gain in the prior year period. While mortgage originations of $328 million were roughly flat to the year ago period, as well as up 21% sequentially, mortgage banking income was lower as we retained 80% of production on the balance sheet due to customer preferences for adjustable rate products, as well as construction, which are not saleable into the secondary market. Excluding restructuring and merger-related expenses, non-interest expense for the three months ended June 30, 2022 totaled $87 million, a 5.3% year-over-year increase and a 1.2% increase from the first quarter of this year. Salaries and wages increased $3.8 million, or 10.1% compared to the prior year due to higher salaries expense related to normal merit increases and the hourly wage increase that we implemented last year, lower deferred loan origination costs and higher bonus and stock option accruals. Based on these efforts to strengthen our employee base for long-term growth combined with normal merit increases implemented this summer, higher seasonal healthcare and occupancy expenses, we currently anticipate a similar quarter-over-quarter increase in operating expenses from second quarter to third quarter as we incurred last year in the 6% to 8% range. So those hikes that occur in the third quarter and currently weâ\u0080\u0099re projecting 75 basis points today and another 50 basis points in September, those hikes would really take effect in the fourth quarter, just given the fact that most of our are about 50% of our available rate loans reprice every three months. We do have as well about $2.2 billion of loans that repriced every three months as I mentioned, itâ\u0080\u0099s about half of our portfolio, and those also repriced upward about 80 basis points here in the second quarter and would expect those to continue to reprice as we see rate increases. So if you were to normalize employee benefits in the second quarter, you would add that $1.2 million back to the expense run rate, so between and then just kind of seasonally higher healthcare expenses that just something weâ\u0080\u0099ve seen on a historical basis."
}