{
    "symbol": "APTV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 14:23:14",
    "content": " The partnership between Aptiv and Intercable will enhance the strength and breadth of our combined product portfolios, allow Intercable to leverage Aptiv's global scale, manufacturing footprint, especially in North America and China, further strengthen our capabilities to design and deliver fully optimized high-voltage architecture solutions that reduce vehicle weight, mass and costs, and we can leverage these synergies to accelerate the revenue and earnings growth of our combined businesses. In the Signal and Power Solutions segment, as the demand for vehicle electrification continues to accelerate, we're experiencing significant growth in our high-voltage business, which will reach $1.2 billion in revenues this year and accounts for 25% of year-to-date new business awards in the segment. As I mentioned, third quarter new business bookings totaled $5.1 billion, bringing our year-to-date total of $25.4 billion surpassing our previous full year record, further validation of the strength of our portfolio of advanced technologies and our ability to deliver exceptional value for our customers. Despite the constrained environment and macro headwinds, we continue to take actions to increase the underlying resiliency of our business model and deliver sustainable value creation by enhancing our portfolio of full system solutions to increase our addressable content on the electrified software-defined vehicles of the future, recovering increased material input costs and optimizing our cost structure, smartly deploying capital to further strengthen our capabilities to meet the evolving needs of our customers and intelligently diversifying our revenue base into less cyclical nonautomotive markets. EBITDA margins expanded 330 basis points versus third quarter last year and grew 560 basis points sequentially, reflecting flow-through on increased volumes of approximately 32%, both year-over-year and sequentially, continued progress on customer recoveries of direct material inflation, as well as other performance and cost savings actions, partially offset by a return to a more normalized price down environment and the impact of FX, commodities and nonmaterial cost increases. And although we expect to benefit from overall demand for key technologies like smart vehicle architecture, high voltage and active safety, the progress we have made on material cost recoveries and operational performance and the inclusion of the Wind River and Intercable acquisitions, we remain cautious of the lingering headwinds and believe continued supply chain tightness and deterioration in economic conditions, particularly in Europe, will negatively impact overall 2023 vehicle production levels as well as the smoothness of vehicle production schedules, making it potentially more challenging to recapture operating leverage. Obviously, the bookings are pretty remarkable this year, about $13.5 billion and what you're hiding in your in active safety, high-voltage and SVA, there's almost $12 billion that's outside of those 3 technologies."
}