{
    "symbol": "APTV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 11:58:08",
    "content": " Beginning on Slide 3, through the first half of the year, two themes stand out; the first is strong broad-based demand across our portfolio of product offerings reflected in over $20 billion in bookings during the first half of 2022, including a record $14 billion in the second quarter alone, almost double where we were at this time last year. Operating income and earnings per share totaled $213 million and $0.22 respectively, reflecting strong revenue growth more than offset by material inflation, incremental costs related to supply chain disruptions, shutdowns in China and some softening in vehicle production schedules in Europe. Turning to Slide 8 in our Advanced Safety and User Experience segment, active safety revenue growth remained strong, up 21% during the quarter, driven by the continued penetration of advanced ADAS systems partially offset by semiconductor shortages impacting production in Europe and North America and User Experience revenues were down 6% in the quarter, primarily the result of continued chip supply constraints in Europe and the impact of China shutdowns on volume, but we expect to finish the year with approximately 10% revenue growth. Second quarter revenues in our Signal and Power Solutions segment rose 10%, 9 points better than global vehicle production, reflecting high-voltage revenues that increased 22% during the quarter, driven by the launch of new electric vehicle programs, particularly in Asia and North America and revenues in non-automotive markets that increased 14%, the result of strong growth in general industrial, semiconductor, datacom and commercial space markets. Adjusted EBITDA and operating income were $365 million and $213 million respectively, reflecting flow-through on incremental volumes and positive price in the quarter offset by an increase in supply chain disruption costs related to the China shutdowns as well as higher levels of material inflation and the negative impact from FX and commodities, primarily related to the lower euro and changes in copper prices. Volume growth contributed approximately $18 million of incremental earnings, representing a flow-through of 33% and price was a positive 1.1% versus prior year, offset by increased material input costs. In addition to the changes in European vehicle production, we have increased our estimate of the total price recovery we expect to receive in 2022 by $260 million, bringing the full year recovery to approximately $500 million. Lastly, we have included incremental supply chain disruption costs to our revised outlook, including the $30 million incurred in China in the second quarter. In summary, although negatively impacted by vehicle production, other macro factors and supply chain constraints, we continue to drive strong top line growth and improved performance, with revenues of $17.15 billion, up 13% from 2021, operating income growth of 16% with 50 basis points of margin expansion, EPS growth of 8% and operating cash flow growth of 25%. For 2022, we would estimate the discrete second half benefit totals approximately $150 million, implying a more normalized operating margin rate of 10% to 10.5%. On your $166 million, the question on the disruption costs, the performance and lower disruption costs, weâ\u0080\u0099ve got about $80 million improvement first half to second half in disruption costs, $30 million is China, $50 million is just the overall improvement. So thatâ\u0080\u0099s $80 million in total with â\u0080\u0093 including the $30 million and youâ\u0080\u0099ve got about 40 plus â\u0080\u0093 right around $40 million, $45 million of the cost saving actions hitting in the back half of the year that get us there. And youâ\u0080\u0099ve got growth over market  add three over the next 2 years and 30%, but  just additional color, either from the $1.6 billion  or the $1.8 billion, $1.9 billion that youâ\u0080\u0099re implying is kind of a normal run rate for the back half? So maybe just you can clarify for us, either from the full year guidance  hopefully, you hear me, the $1.6 billion midpoint or you implied like $1.8 billion or $1.9 billion at a 10% to 10.5% sort of normal run rate in the back half. But at the same time, you are still calling for a fairly strong second half, and I would argue that the miss versus expectation prior the action happened in the second quarter, where this sort of maybe operating income was maybe $100 million below what the Street looked at. So, $166 million, you look at $80 million is improvement in COVID and supply chain disruption costs first half to second half, 30% is China going away â\u0080\u0093 $30 million is China going away."
}