{
    "symbol": "MTZ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 16:11:04",
    "content": " For the full year, 2022 revenue was $9.8 million, a 23% year-over-year increase; 2022 adjusted EBITDA was $781 million; and 2022 full year adjusted earnings per share was $3.05. Through the acquisition of IEA at the end of this year, we've significantly increased our market share in the clean energy space and now expect our Clean Energy and Infrastructure segment to approximately $5 billion of revenue in 2023 versus $1.5 billion in 2020. For example, our non-Oil and Gas segments are now expected to generate almost 88% of our revenue in 2023, having gone from $4.5 billion in 2020 to $11.5 billion in 2023, a 2.5x increase in three years. As a point of reference, to highlight the significance of our 2022 end market operation shift, Oil and Gas segment operations experienced a year-over-year $386 million adjusted EBITDA decline, which was largely offset by approximately $271 million and increased non-Oil and Gas segment adjusted EBITDA. Both our fourth quarter and second half 2022 results highlight an important developing business trends, namely, consolidated results showed strong second half 2022 improvement with consolidated revenue at $5.5 billion compared to $4.3 billion in the first half of the year. Importantly, fourth quarter results are the first time in 2022 were increased non-Oil and Gas segment adjusted EBITDA exceeded the decline in Oil and Gas segment results with consolidated fourth quarter adjusted EBITDA increasing 17% over the fourth quarter of last year to approximately $258 million. Annual 2022 Communications segment revenue was $3.2 billion, a 27% increase when compared to last year, and 2022 adjusted EBITDA margin was 10.3%. For the first quarter, we expect communication setting revenue to grow by approximately 15% over 2022, with adjusted EBITDA margins in the mid-7% range. Fourth quarter Clean Energy adjusted EBITDA margin was 7%, a 260 basis points sequential improvement and the segment's highest adjusted EBITDA margin performance over the past two years. Annual 2022 Clean Energy segment revenue was approximately $2.6 billion, adjusted EBITDA was 4.2%. For 2023, we expect Clean Energy segment revenue of approximately $5 billion and adjusted EBITDA margin will improve to the mid- to high 6% range. For the first quarter, we expect Clean Energy revenue to approximately $800 million with a low single-digit adjusted EBITDA margin. Fourth quarter Oil and Gas segment revenue was $292 million, with adjusted EBITDA margin of 11.5%. Annual 2022 Oil and Gas segment revenue was approximately $1.2 billion, with adjusted EBITDA margin of 14.1%. Based on expected project start-ups, we expect this growth to occur in the second half of the year with second half revenue approximately 60% of the annual total and second half adjusted EBITDA margins in the mid- to high teens. As we've been messaging in our public comments for some time, we expect a slow start in the first quarter with expected revenue of $2.4 billion; adjusted EBITDA of $100 million or 4.2% of revenue; and an adjusted diluted loss per share of $0.57. For our annual guidance, we are projecting 2023 revenue of approximately $13 billion, a 33% increase over 2022 with adjusted EBITDA ranging between $1.1 billion and $1.15 billion. We're going to see about $100 million of revenue less than what we expected in the first quarter, and it's made up of a bunch of reasons. As we leave '23 and we exit with the second half we're going to have I think next year's first quarter in '24 and even the first quarter in '25 were going to be significantly different than what we saw in '22 and '23 because we're going to have broad-based strength across all of our segments, which is going to make those comparables really easy. If you think about our second half of this year, and let's break it out by business, so if we look at Clean Energy, our expectation is that in '23, in the second half, margins are going to improve over '22 by about 200 basis points - just over 200 basis points."
}