{
    "symbol": "EL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-18 15:20:03",
    "content": " We achieved better-than-expected results in our fourth quarter, leading to above guidance organic sales growth of 8% for fiscal year 2022. For fiscal year 2023, we expect to deliver strong organic sales growth fueled by our diversified growth engines and enticing innovation and to take the opportunity in a volatile year to continue investing for our exciting future to build global share. We are confident in the long-term growth opportunity in Mainland China, evidenced by our expansion into almost 100 new doors and 3 additional cities in fiscal year 2022 as well as our introduction of Aveda last month. For the Americas and EMEA, we anticipate ongoing strength from our growth engines across categories and channels as well as across developed and emerging markets given the broad-based gains of fiscal year 2022. Our fourth quarter organic net sales fell 8%, a bit better than we expected, reflecting the disruptions in China related to COVID restrictions, including travel retail in Hainan as well as the suspension of our commercial business in Russia and Ukraine. Based on July 31 spot rates at 1.018 for the euro, 1.215 for the pound, 6.746 for the Chinese yuan and 13 03 for the Korean won, we expect currency translation to dilute reported sales growth for the full fiscal year by 3 percentage points as well as an additional 1 point due to the impacts of foreign currency transactions in key international travel retail markets. As you may recall, last year, we mentioned that some of our retailers in North America secured holiday shipments earlier due to supply chain concern, contributing 1.5 points to our growth in the first quarter of fiscal 2022. So, part of the strength that we saw this year â\u0080\u0093 this past fiscal year in terms of the growth in makeup and the improvement in margin that we saw in makeup was related to the recovery, in particular, in brick-and-mortar in our Western markets, so in the Americas as well as in Europe. As it relates to the margin, the makeup category has been particularly hit by the pandemic that is now going on for 3 years because of the brick-and-mortar distribution of makeup, and in particular, with a few of our makeup brands where services in-store are very well loved by our consumers and the in-store experience, that took â\u0080\u0093 that was a bit of a challenge with doors closed and with traffic down."
}