{
    "symbol": "BZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-23 14:24:06",
    "content": " Welcome to our second quarter 2022 earnings conference call. Before we start, we would like to remind you that today's discussion may contain forward-looking statements which are based on management's current expectations and observations that involve known and unknown risks, uncertainties and other factors not under the company's control, which may cause actual results, performance or achievements of the company to be materially different. Welcome to our second quarter 2022 earnings conference call. On behalf of the company and our employees, I would like to express our sincere gratitude to our users and investors for your ongoing trust and support. First, I would like to share with you our performance for the second quarter. Our average MAU reached 26.5 million, representing a sequential increase of 5%, and this was achieved solely based on existing users. These two factors have, to a certain extent, unfavorably affected both our users and revenue growth. In terms of profitability, exclude share-based compensation expenses, our adjusted net income reached RMB257 million in the second quarter, continuously demonstrating our enhanced operating efficiency. Now I would like to share some updates on our new users, which many of you may care about. At the end of June and beginning of July, the proportion of newly registered students users are higher since fresh graduates led the school during that period. Starting end of July, blue collar user numbers have gradually picked up and the white collar users grow steadily. From the perspective of the city tiers, the first- and second-tier cities continue to contribute to majority of the user growth for this quarter. Moreover, on the other hand, they also proved that our innovative job-seeking and recruitment model has established a compelling influence and brand reputation among users. In July, the number of newly posted drops on our platform increased 15% on a sequential basis. In August, the overall recruitment environment has revived further with better growth momentum in industries such as new energy, high-end manufacturing, real estate, media, medical and health as well as positions, including sales and marketing that clearly implicates business expansion. Among all the industries, the blue collar sector has shown a relatively more robust growth trend, especially in the urban service sector. As for the recent job hunting needs of a large number of fresh graduates, we made a great effort to create more job opportunities for them including holding various online job fares through cooperating with our enterprise customers and participating in the live broadcast job for you initiated by CCTV news channel. Furthermore, for those college students looking for summer internship and part-time jobs, we explored more potential opportunities on our platform that may accept short-term employment by utilizing our optimized recommendation algorithm to improve their experience and achievements. In July, job seekers and recruiters on our platform completes more than 100 million times of resume exchange following their one-on-one confirmation of initial intentions. Despite the macro uncertainties and the resurgence of COVID-19, our total revenues for the quarter decreased slightly by 5% to RMB1.11 billion year-on-year, mainly due to the revenue decrease from small-sized accounts, partially offset by revenue increases from key accounts and midsized accounts, respectively. Calculated cash billings decreased by 32% to RMB979 million in the quarter, primarily due to the negative impact of COVID-19 outbreak in several top-tier cities, which also are main revenue contributors to our business. Total paid enterprise customers in the past 12 months increased by 5.6% to 3.8 million, while decreased by 7% quarter-over-quarter due to the same reason. Excluding share-based compensation, total operating costs and expenses decreased by 4% year-over-year to RMB892 million in the quarter. Cost of revenues increased by 22% to RMB174 million, mainly driven by the headcount increase in second half last year, especially for security-related staff as well as higher server and bandwidth costs. G&A expenses decreased by 90% to RMB160 million, which was mainly attributable to the one-off share-based compensation expenses related to the issuance of Class B ordinary shares to Tech Wolf Limited recorded in the second quarter of 2021. Excluding share-based compensation expenses, our G&A expenses increased by 34% year-over-year, resulting from the increased headcount. With the reopening of user registration and gradual recovery of recruiting industries, we are confident on our future business growth and we'll continue to invest in critical areas like algorithm engineers and high-profile product managers with other personnel-related costs showing more operating leverage. Despite the decrease in revenue, we achieved a net income for RMB107 million compared with a net loss of RMB1.41 billion for the same period last year. Excluding share-based compensation, our adjusted net income for the quarter was RMB257 million, representing an adjusted net margin of 23%, once again proved the resilience of our business model. As of June 30, 2022, our cash, cash equivalents and short-term investments increased to RMB13 billion, RMB1-3 billion, which will support our sustainable growth in the long term. Before we go into the outlook for the next quarter, I would like to take some time to discuss the difference between our cash revenue and GAAP revenue. Being as a fast -- a like enterprise service, our business nature is to receive cash payment before starting our service, while GAAP revenue will be recognized later on an accrued basis. As a result, management view cash collections as a main operating metrics and reflect company's growth momentum in a timely manner following our user growth. So for the third quarter, we expect our total cash collections to be around RMB1.3 billion, or RMB1.22 billion as calculated cash billings, which is after business tax. Our GAAP revenue affected by the lower cash collection from previous 4 quarters is estimated to be between RMB1.15 billion to RMB1.16 billion, a slight year-on-year decrease of 5.9% to 4.3%. Lastly, we are pleased to be back on track with our user growth being as key business driver. No matter how the external environment changes, we believe that our superior user experience and an efficient business model will drive the continued growth of our user scale and further strengthen our monetization capabilities. First question will be on sales, marketing expenses in the second half this year. Thank you for your question. We are -- first of all, on July, we haven't spent too much or more than June -- compared with June on marketing expenses. But overall, we are expecting more than 25 million newly verified users in the later half of this year, and we are expecting to achieve that under a normal marketing expense or input. In terms of our revenue, we are seeing gradual recovery from July and August, and we are seeing a better recovery trend. We won't spend, especially -- we won't spend extra money to buy users or to buy our revenue. And regarding your second question for live streaming on recruitment -- on recruiting industry, I have not discussed the matter in detail in the past, but I would like to take your questions now because it's actually one person with multiple person pattern. And technology, based on recommendation, will be more used and preferred under that circumstances which the recruiters and job seekers need to have a mutual consent and need to agree on both each other to have a successful hiring, and that's my opinion regarding the live streaming. Since the resumption of the user registrations, in most of the time in July, we did not spend extra money, marketing dollars in July but we achieved a very healthy new user registration numbers in July and early August. So our key message is that we would like to spend money wisely, and we won't overspend money in the second half. So it seems like when we first started to resume user growth, the job seeker growth is faster than the enterprise user growth. Thank you for your question. But actually, from the trend of July and early August, we have been witnessed that the recovery of our enterprise users are quite decent. As we just discussed, the newly posted jobs in July have increased by 15% compared to June. And the enterprise users number who have posted those jobs increased by 23%, which is a clear recovery trend and indicator. And in terms of the relatively higher ratio of job seekers to enterprise users because we have -- we already have a quite large user pool, we are capable to adjust our ecosystem through our technology to make people feel better in terms of both their user experience and their achievements. For your second question regarding how can we achieve a quick growth recovery for next year and the year after that, and what's the contribution of our blue collar revenue. Currently, we have accumulated users of around 100 million. And our last 12 months paid enterprise customer number is around 4 million and -- which is a relatively small portion and which means that even within the white collar users, our paid user penetration rate is still quite low. We can see that we still have quite a huge growth potential in terms of white collar users to either more lower tiers and further penetrate into more diversified industries, et cetera. First of all, we will -- currently, we are still forcing on to make our ecosystem better, which is to continue as priority, which is continue to regulate all those blue collar intermediary agencies before we can pursue a meaningful revenue growth. If we do our monetization too early, we will step into a potential trick, which -- it has been existing in the blue-collar industry for quite a long time, where the users have with the platform, and there are a lot of frictions between the -- for each transaction. The first one is regarding the 12-month total paid enterprise customers decline, which is the number declined to 3.6 million from 4.1 million in the first quarter. So if you look at the paid enterprise users versus the overall verified enterprise users, the paying ratio in second quarter showed a little bit decrease. Basically, our paying ratio with the online -- I mean, the active business users, online enterprise users, that paying ratio was quite stable in the past most of the time. So the drop of the second quarter paid enterprise user, mainly because of the total online or active business users in second quarter dropped. And that's the overall pay, the enterprise customers dropped -- that number dropped. So in the second quarter, so because of the COVID outbreak, so some enterprise users, they didn't show up on platform. But meanwhile, because of -- we were under cybersecurity review and we cannot grow our new users, that means no business users can be added onto our platform. So because of that, online business users on our platform dropped. So that's our situation for the second quarter, paid enterprise users drop. And after second quarter, starting from like June 29, we were able to grow new users. And around that time, the total active like online business users was at the lowest level because of -- in the past nearly 4 quarters we were -- we cannot grow new users. So that means at the beginning of July, online business users, the overall number was at lowest level. So especially after mid of July, we see acceleration of business users. So that means as base of our paid enterprise users, as just mentioned, the overall paying ratio is quite stable. And along with the increase of online or active business users growth, so our paid enterprise users starting from through July and August grow as well. So we are very confident that in next quarter and even in the following quarters, we would like to see the trends to continue, and that can help to let us achieve better revenue growth in probably the third quarter and even fourth quarter. First of all, for Internet sector, the whole Internet sector, the recovery trend is in line with our overall growth. And we have witnessed a much faster recovery pace for the blue collar users like manufacturing sector, like logistics and especially for urban service sector, which is worth focusing on because we have certainly large portion of blue collar users in the urban service sector. And some other emerging industries like new energy, like electronic vehicle, like health care and high-end electronic manufacturing, we have witnessed a better growth. Thank you for your question. And at current stage, even though we have a very large team and heavily invested in technology, but we still need to focus our capabilities and that is to help the job seekers to resolve the most critical things of their job seeking. For the graduate -- 10.76 million fresh graduates this year, majority of them doesn't know what they do or what they can do, what industries they need to try for, and that's the reality. So we are utilizing all of our technology power to better match their potential sectors, potential personal skills and in terms of their area, in terms of their social relationships and et cetera within well, they are viewing all of those potential opportunities on our platform, we will help them to figure out the best kind of jobs that are suited for them, and that's the most urgent since we need to fix at present. And we have tried to encourage the recruiters to posting jobs, which are available for fresh graduates and encouraging recruiters to post jobs in the -- in those area with severe COVID-19 outbreak like Beijing, Shanghai and Jilin."
}