{
    "symbol": "BZ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-20 12:30:04",
    "content": " Total paid enterprise customer number for 2022 was 3.6 million, down by 10% compared to 2021, mainly due to the decreases in small sized accounts affected by the user registration suspension in the first half of the year, as well as COVID outbreak in second quarter and fourth quarter. Total operating costs and expenses were RMB1.4 billion in the quarter up 70% year-on-year mainly due to number one, increases in employee related expenses, including share based compensation related to Hong Kong IPO. For the full year of 2022, cost of revenues increased by 36% to RMB755 million, with an increase -- with an 84.1% adjusted gross margin down by three percentage points compared to 2021 due to similar reasons. Sales and marketing expenses increased by 83% year-on-year to RMB682 million in the quarter, which was primarily due to the marketing campaign of 2022 FIFA World Cup. Excluding the world class sponsorship expenses, we saw a 46% year-on-year decline in branding and customer acquisition costs in 2022, demonstrating our improved marketing efficiency as a result of stronger brand recognition and user satisfaction. G&A expenses in this quarter increased by 108% year-on-year to RMB248 million, primarily due to increases in employee related expenses and professional service fees related to our dual primary listing in Hong Kong. Excluding share-based compensation and Hong Kong listing related fees, our adjusted G&A expenses in this quarter was RMB123 million, up by 50% year-on-year. And for the full year of 2022, G&A expenses decreased by 64% primarily due to the one-off share-based compensation expenses of  (ph) billion recognized in 2021 related to our US IPO. Our simple calculation shows that if we exclude the share-based compensation and World Cup sponsorship and the professional service fees related to our Hong Kong listing, our adjusted operating margin was 20% for this quarter and 19% for the full year of 2022."
}