{
    "symbol": "BZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-30 04:08:06",
    "content": " We maintain the rapid growth in our user-base while further improving our profit margin to obtain  over adjusted net income for the third quarter which is gross share-based and compensation expenses, achieved a quarter-on-quarter growth of 5% -- 25% reaching RMB377 million. First, the average monthly number of successful mutual communication between job seekers and enterprise users have hit a record high in this quarter representing a more than 20% year-on-year growth rate and our MAU grew by 12.5% year-on-year. The revenue of urban service industry the -- sorry, the cash billing of the urban service industry for the third quarter recorded a 28% year-on-year growth. Our total revenues being dragged down by the impacted performance in the previous quarters due to new user registration suspension and COVID resurgence in the second quarter recorded a 6% year-over-year, 6% quarter-over-quarter growth to RMB1.18 billion. The number of total paid enterprise customers in trailing 12 months ended September 30, slightly decreased to RMB3.73 million, down 1% from RMB3.77 million of June 30. But quarterly-wise, the number of total paid enterprise customers in the third quarter increased by 15%, compared to the second quarter, mainly due to the increase in small-sized accounts, driven by our active enterprise user growth in the relative mild recovering macro conditions. Excluding share-based compensation expenses, our adjusted net income for the quarter was RMB377 million with an adjusted net margin of about 20 -- 32% which rebounded back to the historical record in the third quarter last year, further demonstrating our high-quality and sustainable operating leverage and profitability. Looking forward, as the near-term resurgence of COVID cases are still at a high level across China which are affecting the recruiting demand of enterprise users we expect our total revenues to be between RMB1.05 billion and RMB1.09 billion in third -- in the fourth quarter, with a slight year-on-year decrease of 3.8% to 0%. The second question is, if we expect that the reopening to gradually happen in next year, so what's our expectation in terms of the -- your sales, marketing and customer acquisition costs because we believe that certain of the other online recruitment platform will also spend some money to acquire new customers. So -- but because of this trailing 12 months, so it's -- the second quarter did have some impact to our -- the total paid enterprise customers, the number."
}