{
    "symbol": "GRIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 14:41:04",
    "content": " For the second quarter 2022, our gross profit, adjusted EBITDA and adjusted net income increased materially year-over-year, achieving $64.6 million, $73.9 million and $53.3 million or $2.81 per ordinary share, respectively. For the first half 2022, our gross profit, adjusted EBITDA and adjusted net income increased to $105.3 million, $124.1 million and $83.1 million or $4.42 per ordinary share, respectively. On May 12, 2022, we agreed to extend the long-term charter on the 2014-built supramax bulk carrier, IVS Crimson Creek, for a period of 11 to 13 months at a charter rate of $26,276 per day commencing May 1, 2022. On August 17, 2022, our Board of Directors declared an interim quarterly cash dividend of $0.84 per ordinary share payable on or about September 19, 2022, to all shareholders of record as of September 9, 2022. In the second quarter of 2022, revenues increased to $161.6 million compared to $109.8 million for the same period of 2021. Revenue increased due to improved market conditions in the drybulk business which was slightly offset by a reduction in short-term operating base and the sale of the medium-range product tanker, Matuku, in the second quarter of 2022  continuing operations for the same period 2021. Net profitable -- sorry, net profit attributable to owners of the company increased to $56.8 million or $2.99 per ordinary share in the second quarter of 2022 from $22.8 million or $1.18 per ordinary share in the second quarter of 2021. For the first half of 2022, revenue increased to $271.9 million compared to $178.3 million for the same period 2021. Handysize TCE per day was $27,479 per day for the three months ended June 30, 2022, versus $18,104 per day for the same period 2021. Supramax/ultramax TCE per day was $31,021 for the three months ended June 30, 2022, versus $21,916 per day for the same period 2021. For the first half of 2022, handysize TCE per day was $24,990 for the six months ended June 30, 2022, versus $15,285 per day for the same period 2021. Supramax/ultramax TCE per day was $27,604 for the six months ended June 30, 2022, versus $17,606 per day for the same period in 2021. The average long-term charter-in costs per day for the supramax\\ultramax fleet for the third quarter of 2022 is expected to be approximately $14,921 per day. On the liquid side, we continued our flexible dividend and capital return policy in the second quarter, materially rewarding shareholders with a cash dividend of $0.84 per share, our highest since we commenced our dividend policy in Q3 2021. And that explains some years of cash, especially given that your cash balance is, call it, $170 million, it looks like the -- $170 million that's well above the purchase options."
}