{
    "symbol": "GRIN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-25 12:58:11",
    "content": " For the first quarter 2022, our gross profit, adjusted EBITDA and adjusted net income increased materially year-over-year, reaching $40.7 million, $50.2 million and $29.8 million or $1.60 per ordinary share, respectively. As of March 31, 2022, we had cash and equivalents of $106.5 million and restricted cash of $6.6 million, which was similar to the year-end despite the strong results as there was a working capital increase due to the timing of certain receivables selected shortly after the quarter end. On May 10, 2022, we exercised the purchase option on the chartered-in 2015, both supramax bulk carrier, IVS Pinehurst, for an amount of $18 million, with delivery planned on or about June 18, 2022. Also on May 10, 2022, we agreed to extend the long-term charter on the 2014-built supramax bulk carrier, the IVS Pinehurst for a period of 11 to 13 months at a charter-in rate of $26,276 per day, commencing May 1, 2022. On May 24, 2022, our Board of Directors declared an interim quarterly cash dividend of $0.47 per ordinary share, payable on or about June 20, 2022, to all shareholders of record as of June 10, 2022. Handysize TCE per day was $22,201 for the three months ended March 31, 2022, versus $12,053 per day for the same period 2021. Supramax/Ultramax TCE per day was $24,385 per day for the three months ended March 31, 2022 versus $13,259 per day for the same period 2021. As of May 19, 2022, we have contracted approximately 1,310 operating days at an average TCE of $26,875 per day for our Handysizes and approximately 1,568 operating days at an average TCE of $29,498 per day for Supramax/Ultramax. The average long-term charter-in cost per day for the Supramax/Ultramax fleet for the second quarter of 2022 is expected to be approximately $13,997 per day. During the first quarter 2022, approximately 90% of our fleet was predominantly trading either on index-linked cargo contracts, short-term time chartered or in the spot market, leaving our company well positioned to take advantage of the strong freight rate environment. Breakeven per vessel per day was as follows: for long-term charter-in, which includes a daily G&A allocation on top of the charter rate, the cost was $14,890 per day; for our own fleet, it was $11,782 per day; and the combined average total for the core drybulk fleet was $12,474 per day. As reported earlier, the first quarter was the strongest in over a decade with an over 12-fold increase year-over-year in our adjusted net income per share while our commercial strategy continues to demonstrate its potential with material profits generated from both our long and short-term charter in vessels, while we have opportunistically exercised the purchase option on the IVS Pinehurst at very attractive levels. As for our peak performance to date, as of May 19, 2022, our contracted days for the second quarter have been fixed at higher charter rates relative to Q1 2022 and those achieved during Q2 2021."
}