{
    "symbol": "UAA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 11:23:11",
    "content": " Having successfully executed a multiyear transformation after delivering the best year in Under Armour's history in 2021, results for our transition period came in lighter than we had expected due to ongoing supply challenges and emerging COVID-19 impact on our Asia-Pacific business. And finally, our accessories business was down 18%, due to expected lower sales of our sports masks compared to last year, which we anticipate normalizing by the second quarter of fiscal 2023. SG&A expenses were up 16% to $594 million, primarily due to increased marketing investments, higher salaried and non-salaried workforce wages due to last year's compensation increases for our teammates and higher consulting services. For gross margin, we expect the full year rate to be down 150 to 200 basis points from the baseline period rate of 49.6% due to expected inflationary pressures on freight and product costs, unfavorable channel mix and changes in foreign currency. One of the reasons why we have been, so let's say considerate in terms of how we have approached the inventory in the transition quarter, and also in the beginning of 2023 is that, we did not want to be getting product in late that we would have to drive through a promotional liquidation. And then, as we go forward long-term, we do believe that there is a lot of opportunity there to be able to get to that 50%-plus gross margin, when you think about the APAC growth and that being a higher gross margin region for us, when you see the over-index growth that we're continuing to drive in the longer term relative to direct-to-consumer as a mix of business and the gross margin benefits there as well. So you will see the inventory growth go up a little bit in the back half of the year, as we buy into that and get ready for that demand that we can actually service better in the back half of the year, and then also going into a bigger growth in fiscal 2024. So excited about that some disappointment of course in terms of our ability to fulfill demand in the stub quarter to some extent but also early in 2023 but to Dave's earlier point, we'll see inventory start to build back towards the back half of the year and into our fourth quarter."
}