{
    "symbol": "LPTH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-10 22:39:05",
    "content": " As mentioned we now have underway a number of large NRE projects for the development of new custom freeform optics and sub systems, projects which represent revenue in the form of development work that is paid for by the customers with resulting intellectual property owned by LightPath are expected to lead to production orders that require a series of lenses or assemblies, which would substantially increase the company’s current manufacturing volumes. Sales of infrared products comprised 55% of the company’s consolidated revenue in the second quarter of fiscal 2022, as compared to 48% of consolidated revenue in the same period of the prior fiscal year. Specialty products continue to be a small component of the company’s business, representing 4% of consolidated revenues in the second quarter of fiscal 2022 and 2021. The quarter ended backlog is the highest level in a year, which accounts for new contracts signed and the renewal of our single largest contract valued at $4.2 million, which have been partially offset by the reduction of certain telecom business as we’ve discussed. Yes, well, I don’t think we look at NRE as a major revenue stream or something sort of usually worth talking about, I brought it up in such an extent this time, because, the share of increase in how much interest we’re getting and the money customers are willing to put into sometimes accelerate the development or be a earlier in line is, I think a very good indicator to just how relevant the technology that we’ve been developing is. And then last for me, I was hoping you guys could kind of touch on M&A, I know it was a little more prominent in the last couple quarters calls, but what are you thinking there, are you still seeing, a fair number of potential opportunities or has that, kind of moved to the back burn as you work on some of these organic…\n Yes, it’s a bit of though because some of those opportunities and such new development and nurturing over time."
}