{
    "symbol": "LPTH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-12 18:59:09",
    "content": " On a consolidated basis revenue for the third quarter of fiscal 2022 was $8.3 million, compared to $10.7 million in the year ago period. The decrease in revenue from sales of infrared products is primarily due to a decrease in sales to customers -- excuse me, in the industrial market and for temperature sensing applications, which peaked in demand during the third quarter of fiscal 2021. PMO sales increased 3% in the third quarter of fiscal 2022, compared to the third quarter of fiscal 2021, since the drop off of PMO sales in the fourth quarter of 2021, sales of PMO products in China have improved sequentially each quarter of fiscal 2022, driven in part by other telecommunication customers, as well as an increased sales to customers in the industrial, commercial industries. Gross margin in the third quarter of fiscal 2022 was approximately $3 million, compared to approximately $3.9 million in the same period of the prior fiscal year. Selling, general and administrative costs were approximately $2.6 million for the third quarter of fiscal ’22, a decrease of approximately 187,000 or 7%, compared to the same period of the prior fiscal year. The decrease in net income for the third quarter of fiscal 2022, as compared to the same period of the prior fiscal year was primarily attributed to our revenue and gross margin, partially offset by lower operating expenses. Our total backlog at March 31, ‘22 was approximately $19.7 million, an increase of 1% as compared to $19.5 million as of March 31st 2021, compared to the end of fiscal 2021 our total backlog decreased by 8% during the first nine months of fiscal 2022. In terms of the free form optics, that's a bit of a different play in the sense that this is a technology that we've already developed and matured enough now is the time for the customers to take that in and to utilize it, we've mentioned in the last months that Attollo Engineering, for example, have already adopted free form optics into their LIDAR products and it looks very promising and successful, they have some very unique products in the sense of being able to very quickly monitor the location of drones of fully autonomous drones making sure they don't collide with other and so on and the free form optics are really a key elements there."
}