{
    "symbol": "IFS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-18 14:16:06",
    "content": " ROE for the quarter came at 16.5%, still impacted by a low ROE in Wealth Management of around 8%, insurance with 13.8%, and as previously mentioned, a strong quarter for banking and payments with 20.2% and 22.3% ROE, respectively. When looking at the full-year figures, reported earnings reached PEN1,671 million or PEN1,448 million when excluding the one-off registered in the third quarter, due to the accounting revaluation from book value to the price paid of the previously owned 50% of Izipay at Interbank. The low normalized annual ROE was mainly due to the negative impact from investments as ROE for banking, insurance and payments for the full-year are all high at 19.8%, 26.6%, and 26.7%, respectively. On insurance, earnings were shy due to a stronger discipline on pricing and rates paid for annuities, which slightly impacted market share, and ROE of 13.8% was below average levels, despite another strong quarter and investments with return on the investment portfolio at 7.4%. Finally, on our payment business, on one side, Izipay continues with a solid growth in business with acquiring fees up 8% on the quarter and 32% year-over-year, strong growth in number of merchants and transactional volumes and gaining market share within our volumes in e-commerce this year. On Slides 8 and 9, total recurring revenues for IFS grew 6% in the quarter, thanks to the growth registered in banking of 7%, payments of 15%, and the recovery in revenues from Wealth Management from PEN3 million to PEN56 million this quarter. Core Equity Tier 1 ratio at Interbank is at 12% as of December 2022 and the total capital ratio stands at 15.1%, well above the industry's average of 14.4%, despite the strong growth in loans registered this year. Second, we had a strong year in core banking business with some moderation in growth in the second half of the year. On Slide 16, moving to the good news of banking, we have continued to see a good performance in activity in the quarter, despite continued slowing down in financing growth as discussed during the previous calls as we have just adjusted our credit underwriting standards in specific sub pockets of low income clients which start to see some impacts of the slowdown of the economy and sustained inflation and now on top of the disruption of December and also January. On the SME front, disbursement continue to be strong in the fourth quarter and are 17% above third quarter and twice the level of last year and are helping this portfolio to grow nicely during 2022 starting from a very low base of less than 3% market share in the segment. Fee income grew 12%, thanks to the strong growth of credit cards fee income, due to the evolution of credit and debit cards purchases, but also to the sustained strong growth in fee income coming from cash management services in commercial banking. All-in-all, total core revenues grew 20% in the fourth quarter when compared to the fourth quarter of 2021, a very strong recovery in banking revenues, which continues with a positive operating leverage, as previously mentioned. These effects, together with the increase in the SME loan book, still small, and the increase in rates is pushing yield of loans upwards 70 basis points in this quarter and 220 basis points in the year reaching 10.5%, and NIM, 40 basis points in the quarter and 100 basis points in the year reaching 5.4%. On Slide 25, in-line with our digital strategy, we continue to see an important growth in our customer base of 18% in retail, 29% in digital retail customers, and 20% in commercial banking customers reaching more than 5 million customers as of the end of December. Second, we had a strong year in core banking business with some moderation in growth in the second half of the year."
}