{
    "symbol": "AA",
    "quarter": 4,
    "year": 2021,
    "date": "2022-01-20 00:40:06",
    "content": " Meanwhile, our quarterly adjusted net income increased 21% from the prior quarter, setting a quarterly record for our company at $475 million. But excluding special items we recorded quarterly adjusted net income attributable to Alcoa Corporation of $475 million, our highest since becoming a standalone company and an increase of $84 million from the prior quarter. On a full year basis, revenues were up 31% to $12.15 billion; net income attributable to Alcoa change from a net loss of $170 million to net income of $429 million and adjusted EBITDA increased 140% from $1.15 billion to $2.76 billion. Special items netted to negative $867 million and included non cash charges for pension annuitization, the Wenatchee smelter closure, the San Ciprián smelter curtailment as well as the positive impacts of non core asset sales, primarily the Rockdale site sale. Higher alumina and metal prices, as well as increased aluminum shipments drove the $168 million increase in adjusted EBITDA excluding special items, while partial offsets came from higher energy and raw material prices. Looking at the segments; bauxite segment's adjusted EBITDA more than doubled to $49 million on lower production costs, favorable shipments and the annual true up of mine lease royalties. The left side of the slide shows the drivers of the sequential increase in cash on the balance sheet which increase from $1.46 billion into $1.92 billion, including the $110 million of restricted cash primarily related to the San Ciprián curtailment. The roughly $0.5 billion cash increase came from strong EBITDA as well as non core asset sales partially offset by capital returns to stockholders, capital expenditures and increase working capital On the right side of the slide on a full year basis, sources of cash were $4.2 billion and uses $3.9 billion. Other major cash uses were increased working capital of $699 million, $611 million for pension and OPEB funding, which includes a $500 million discretionary pension contribution in the second quarter. A significant change from 2021 is expected in the payment of approximately $325 million of prior year income taxes, a result of higher 2021 taxable earnings in Canada and Australia. On the portfolio transformation, as noted earlier, we've now addressed roughly 75% of our 1.5 million metric tons of smelting capacity, as we're just now past the two year mark on the five year program, which we first announced in October of 2019. And the second question is really broader about San Ciprián in particular, so first off, you had said it would be about $100 million hit in the fourth quarter, I was wondering if that materialized. We had projected, I believe, around $85 million of sequential EBITDA impact from San Ciprián, we saw around $75 million of sequential negative impacts from San Ciprián that's around $65 million in the smelter, and approximately $12 million, I guess it's $77 million in the refinery from the strike there. And given the fact that we had around 50,000 metric tons of shipments that didn't go, it was at least $100 million of working capital that's tied up at the end of the year. And that breaks down that we've committed to around $68 million of capital spend at the facility over the next couple of years, and $35 million of restart costs. And I'm not sure I would talk too much about cannibalization, simply because while we are enjoying positive aluminum prices, and certainly like when it's above $3,000, we're seeing a lot of that same type of commodity price inflation across some of the competing metals as well."
}