{
    "symbol": "AA",
    "quarter": 2,
    "year": 2021,
    "date": "2021-07-15 23:26:12",
    "content": " After today’s presentation, there will be an opportunity to ask questions. Before we get started, I want to take a moment and emphasize once again that Alcoa’s actions are always guided by our values. That is true every quarter, but it’s been especially important in this past year and a half as the world has wrestled with unprecedented challenges brought on by the COVID-19 pandemic. While risks remain, vaccines have helped to move many of the world’s economies forward again. Second quarter earnings per share was $1.63 per share, $0.70 per share higher than the prior quarter and $2.69 per share higher than the year ago quarter. Now turning to our markets, as Bill noted, the Aluminum segment has a significant role in our profitability and we saw a continued upward trend and realized pricing last quarter. We actually said that, I think, I said in my prepared remarks that Bauxite outlook had increased by 100,000 tons. If you look at the chart, it’s increased by 1 million metric tons which makes a lot more sense than 100,000 tons. We have a net debt target, which for the first time, we are in that target range after the second quarter. And I think over the last five years, you’ve seen that we’re a very disciplined about how we allocate capital. And just given the move in billet premiums and some of the other value-added products, I mean, maybe it’s simply demand. But as far as the value-add premiums flow through, the large majority of North American value-add products are done on an annual pricing basis. Obviously if we’re able to pick up spot business from time-to-time, as you’ve seen we’ve picked up spot business this year, because our value-add products volumes have been growing. We’ve been able to sell more spot market business, but the pricing is largely at least in North America on an annual basis. The fact is right now with demand picking up so much in the U.S. and North America and then also in Europe, what we’re seeing is that spot premiums particularly on billet but also on other products are going up. And then also kind of in parcel with that, I think, previously you’ve talked about incentive pricing for new smelters around 2,600 metric ton. When you look at the amount of capital that’s going to need to be spent globally to address the carbon issue, I know that there’s some significant capital that potentially could occur for you in the refinery system on the compressors. To start at the very beginning, from our perspective, because of the portfolio that Alcoa operates and the fact that we are low carbon compared with much of the industry. And so as we look at around the world regionally and we think about the development of these types of mechanisms, on the whole, they’re going to be positive for Alcoa. Now, when you start to look at something like the European border adjustment mechanism, there’s a lot of details that we need to sort through to really be able to understand what are the gives and takes. However, it is a step absolutely in the right direction, it’s going to help to establish the fact that there is a true difference between what is low carbon aluminum and higher carbon aluminum, and to me that is a very positive step forward. And Curt, if I address the incentive pricing question, let me come at it from a slightly different perspective. So if you then consider incentive pricing outside of China, there’s really two areas that you could consider. The first is restarts and today’s pricing, I would think that a lot of producers are running the numbers around restarts and trying to make a determination whether that restart makes sense for them. But then on top of that, there’s greenfields and you’ve seen in the rest of the world very few greenfield announcements for smelting projects and they take a while to come online. So at this point, if anyone’s considering greenfields, it’s probably a couple of years down the road. So, clearly, there’s scope for the company to accelerate more growth spend ahead. But given the free cash flow outlook, it seems like you’re going to have plenty of wherewithal to do both. If you back that out of cash from ops, our cash from ops was close to -- was over $400 million after you back that out. We’re going to ramp that up to $40 million additional by the end of the year, because we’re at a $50 million target as you see in the outlook. So not significant return seeking capital growth at this point, but we’ll use the current capital allocation model to determine how we allocate capital going forward. And I’d like to add my congrats on good quarter, good outlook and also hitting your -- the net debt targets. So, the return seeking capital budget for the year is $50 million, we spent $10 million year-to-date. So we’re trying not to give a view of how much it will cost to reposition the portfolio, because it will depend on how we do that. One, we need to be good stewards of the environment, and so for those closed and curtailed sites, we have to do them -- manage them in a sustainable way for the communities and the environment around them. And Lucas, if I can just complement that, I think, one of the reasons I most enjoy working for Alcoa is that we manage those sites all the way from inception down to closure and then redevelopment. I’ll follow-up on one other point, the $150 million available, that’s the existing $200 million buyback. I think we alluded to $10 million in the Alumina segment and that is -- there’s really two components to that. In the Aluminum segment, really on a sequential quarter basis we’re seeing around $25 million of higher costs. That’s a combination of coke and pitch costs, which are starting to trend up, and some transportation costs. I -- it’s not surprising in our industry for the folks who have followed us for a long time that when you see a run up in Aluminum prices that there will be a trailing higher raw material cost and we’re starting to see that today. And one follow-up if I may, just around the Alumina market, it seems like that’s sort of trailed aluminum for a little bit of time now. Emily, I’ll take that one and I appreciate the question. So, I mean, first and foremost, I think it helps to demonstrate the fact that these are two very different markets with very different set of fundamentals. The first is freight, as you look at the increase in freight costs, it’s really driving China to be to import less alumina, and therefore, operate more domestically. And so that tends to, as you see, even those price increases happening inside of China, it tends to incentivize less imports and so that helps to constrain to a certain extent the Aluminum pricing environment. And the second one, which really ties in with that is the fact that, when you look at the transactions happening on a day-by-day or week-by week-basis, there are buyers, as many buyers as there are sellers and so the market is balanced and in fact probably balance to a slight surplus. So right now you don’t have a lot of very specific catalysts that are driving the price upwards, the same as you don’t have a lot of catalysts to drive the price downwards. I would also just note as well that Aluminum tends to be driven very much by sentiment and by looking at how that demand changes, and because the actual production of Aluminum is less sensitive, it means that Alumina is a bit less sensitive to some of those macroeconomic trends. Carlos, I’ll take the first one, and that’s a great catch to see that how much we contributed versus the change in the liabilities and that we did contribute $500 million. The reason why we re-measured part of those U.S. pension plans is because when we offered the lump sum offer, we’ve had enough people taking the lump sum out of the pension plan that the accounting treatment requires us to re-measure a part of that. When we look at China today, we’re already starting to see different provinces take active steps to start to meet those targets. And it’s the reason we highlight of the dual control methodology, because not only is it a pretty, pretty neat graph, it’s also having actual effects and impacts on the ground. And so we’re starting to see China become tighter and tighter, and in fact, we believe China’s in a deficit situation. And so the -- I think the answer to your question is, I think, you’re already seeing the impact of those changes. So, first of all on the Bauxite business, I think, last quarter it was a $59 million EBITDA line and the commentary around the second quarter was flat quarter-over-quarter came in at $41 million and the guidance for the third quarter is flat quarter-over-quarter. With the decline in Bauxite prices that we’re seeing globally, we adjusted that. For the third -- as we said, for the third quarter, we’re expecting that to be flat. And then it’s actually kind of dovetails into my next question, which is in the Alumina segment. Last quarter the list of special items for consideration for the next quarter, meaning this quarter was a $25 million in total one-time increase in costs. And I noticed or noticed that there wasn’t any commentary around a reduction -- $25 million reduction in cost in the third quarter in the Alumina business. I think we said alumina costs, I think, we say that, it will be a $10 million negative in the third quarter and that’s related to higher raw materials and higher energy costs. Given the strength of the metal markets largely but to a lesser extent in alumina, we are spending a little bit more maintenance than what we had anticipated in the third quarter versus the second quarter. And as you’re walking down our segments, you’re probably going to get to Aluminum here shortly. In the case of Aluminum, we are investing a little bit more in the third quarter on part restarts than what we had anticipated. Given the strength of the overall metal prices, we’re trying to make sure that we have all the parts online that we can possibly have online to be producing metal that paybacks very quickly in today’s prices. So, yes, that’s the case. In the first half, we had some inventory in the San Ciprian facility that because of the labor dispute at the time was hung up and inventory going into the first quarter that we are able to ship out in the first quarter that elevated shipments higher. Secondly, you have to remember included in those shipments also for the first quarter was the Warrick rolling mill and we’ve subsequently divested the Warrick rolling mill. And Alex, I’ll take your question on the Midwest premium and I think you started to answer yourself. Outside of that, though the fact is that there’s just unprecedented demand and so there’s just not enough metal inside of North America, which is really what is the very basic structural change that is driving those premiums up. Second question, you described the 10% cost increase in Alumina being driven by caustic, of course, currency and energy is part of that. It is growing very quickly and I would argue that that premium also has headed upwards, but right now it’s still relatively immaterial, John. In the case of the refining business, as you can see in the back up, we gave you the cost structure of the refining business and some of the big components there are caustic, natural gas, which is on a lag, underlying labor costs. In the case of, as I said, in the case of the Alumina cost, we had some higher maintenance in the second quarter. We’re starting to see caustic prices increase, Bauxite is much more stable. Just a question on portfolio transformation and non-core affiliates combined in this certainly you’ve done a very solid job of not only you achieving excess, but invisible on what you’re doing here. You highlighted San Ciprian and Rockdale, but in the three-year plus, you’re talking about portfolio transformation. I would also highlight the fact that it is a program that can result in a fundamental change in the overall cost structure and Portland is a great example of that, as well as curtailments and closures or divestitures. And to be quite honest, the going between those different axes might change depending on what’s happening in the circumstances around us. So you really don’t have access if you have a power contract expiring in 2023, for example, until you get to that point to be able to actually make that step change and make a decision about the plant. But the underlying purpose of having very cost competitive plants and having plants, frankly, that are also low carbon and that meet the demands of the future aluminum market are very much top of our minds. Over the next 24 months or so, do you see a significant investment or how have you staged or structure some of the progress that you’re seeing obviously with some of your initiatives and when do you think there will be required lot more or accelerate the investment or potential from Alcoa, some of capital to be allocated much more aggressively in those areas, which I think most people would probably appreciative of? The way that we have grown have given us a portfolio that is going to be very rich and very positive from -- when you look at it from a green perspective, which doesn’t mean that we stand still at all. We’re just getting started on Mechanical Vapor Recompression inside of Alumina, which is the step change. And I would also highlight the ELYSIS research and development project, which is that next and most green Aluminum that could be on the planet. However, when you get to be able to prove that and we’ve said that would be done by 2024 when we have the commercial package available, that would open up a question about how that investment would take place and investment for licensing. Just a quick follow-up really, just I wanted to ask, you mentioned the value-add a few times here, obviously. It -- is there -- I am sorry, perhaps, I mean, is there a way to give a bit of a kind of a bit of a framework around what you’re -- just on average, so you don’t give up any commercial issues or anything like that. We will continue the strong momentum, stay focused on continuous improvement and operational stability across the Aluminum value chain to capture benefits from improved markets."
}