{
    "symbol": "PWSC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 21:39:06",
    "content": " As you see on Slide 4, Fourth quarter revenue reached $161 million, growing 10% over the prior year, and our adjusted EBITDA grew 59% year-over-year to $53 million, representing a 32.8% margin. For the full year, we eclipsed $600 million in revenue, finished with annual revenue growth of 13%, improved our adjusted EBITDA margin by 2.2 percentage points to 31.1%, and generated $104 million of free cash flow. With these strategies, our team and our resilient market, we expect to deliver another year of low double-digit revenue growth, combined with the meaningful margin expansion, which you will see in our guidance, -- let me now pass the call over to Eric to review the financial details of the fourth quarter and the full year 2022 and provide the details of our guidance for 2023. Fourth quarter total revenue came in at $161 million, up 10% year-over-year and in line with the guidance range we provided on our last earnings call. Full year 2022 revenue was $631 million, representing a growth rate of 13% for the year. Our services business generated revenue of $15 million, an increase of 6% year-over-year, which has moderated from prior period growth rates driven by our faster implementations and more efficient deployment cycles. Adjusted gross profit for the quarter came in at $112 million with a 69.5% margin, representing a 110 basis point sequential increase and a 370 basis point year-over-year improvement. For the full year, adjusted gross profit reached $429 million or a 68.1% margin, representing an 80 basis point improvement over 2021. Looking at fourth quarter operating expenses, our non-GAAP research and development expense came in at $22 million, representing 13.8% of revenue compared with 16.9% last year. Non-GAAP SG&A expense declined 3% year-over-year in the fourth quarter to $37 million, representing 23% of revenue, which is 320 basis points lower than the 26.2% in Q4 of last year. Full year adjusted EBITDA was $196 million, representing a 31.1% margin and 22% higher than 2021 and 190 basis points higher than the original guidance we provided at the beginning of 2022. Fourth quarter free cash flow, a non-GAAP measure, was $33.2 million, up 182% from the same time period last year and was driven primarily by increased profitability. We ended the quarter with $137 million in cash and equivalents, an increase of 59% over the same period last year, driven by strong free cash flow performance. For the full year 2023, we expect total revenue in the range of $688 million to $694 million, with the midpoint representing a 10% year-over-year growth rate and adjusted EBITDA of $222 million to $227 million, representing a 32.5% adjusted margin at the midpoint. For the first quarter, we expect to deliver total revenue in the range of $158 million to $160 million, representing a 7% year-over-year growth rate at the top end, and we remain committed to our low double-digit full year top line growth expectations. So I think it's important hit that head on because I know certainly some of the -- as you look at the Q1 guide, we'll note that it's going to be a little bit lower, but obviously, the full year, we're right at the 10%, which is our commitment. As more and more the 40%, the legacy is space is seeing challenges around being able to cope up with some of the digital transformation needs, whether that's around more automation, more data visibility as well as more data security and all those things are kind of key drivers which are actually driving the legacy customers to ex-rate, and that's why you see a growth actually accelerating post pandemic, and we expect that to continue as most of the districts who are kind of kept themselves -- went through the pain during the pandemic and realizing that they've got to start modifying this."
}