{
    "symbol": "PWSC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 13:43:04",
    "content": " Subscription and support revenue, which is our most strategic recurring revenue stream continued to grow at a double-digit rate coming in at $135 million for the quarter, representing an 11% increase over the same time period last year and was 85.7% of total revenue for the quarter. Our services business continued to execute well generating $19.1 million of revenue in the quarter, which was 19% higher than the same time period last year, as we experienced continued demand from our customers for our services and training to deploy and adopt our mission-critical solutions. Our cross-sell momentum continued as demonstrated by the number of customers that use four or more of our 19 products increasing from 1,880 at the end of 2021 to over 2,200 at the end of this quarter representing more than 50% of our annual recurring revenue. In the second quarter, our adjusted research and development expense came in at $22.2 million, representing 14.1% of revenue, which compares to 14.7% in the same period last year. Adjusted SG&A expense in the second quarter was $36.8 million, representing 23.3% of revenue, which compares to 19.5% in the same time period last year, which is related primarily to the various public company costs that we have taken on since our IPO. For the third quarter, we expect to deliver total revenue in the range of $162 million to $164 million, representing a 9.4% year-over-year growth rate at the midpoint and adjusted EBITDA of $49 million to $51 million, representing a 30.7% margin at the midpoint. But we're also seeing demand across not just large customers, a lot of small and midsize on learning management or assessment product or specialist or behavior management, all those really playing to the critical needs that districts are dealing with right now, which is how do you engage students, how do you retain teachers and pretty much our entire platform really comes in as one of the most important pieces to help them manage their entire operations. But as well, as I mentioned, when you look at the holistic aspects of connecting the data and understanding what kind of support each child needs, lot of both our core platform and some of the innovation we have talked about like MTSS and intelligence, as well as some of the add-on tuck-ins we have done around communication and attendance intervention, curriculum, social emotional, these are top of the mind for our districts, and we are able to meet their key demand that's actually helping us drive our sales cycles to be even more efficient and more faster. So, yes, I mean, as we get through the end of this year and then start setting up next year, I mean, we certainly could, especially as we've seen some of these technical tuck-ins that we have and those capabilities really come to market and provide additional products to our customers, we could be in a situation where for sure, as we've said in the past, all of these things we're doing, it derisks our double digit â\u0080\u0093 low double-digit organic growth. As you know, we talked about â\u0080\u0093 we just actually launched this product last week at our conference and we had Snowflake present with us about the opportunity and how the entire Connected Intelligence not only leverages some of the analytics we're talking with our Unified Insights product, we're able to open up the connection to the other data, whether that's coming from systems outside PowerSchool or even outside that organization, outside the district, whether it's social services or juvenile crimes or other areas of how to really bring all the data together, including almost K-20 view about the student, so you have a much more longitudinal view."
}