{
    "symbol": "PWSC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 21:38:03",
    "content": " Our services business, which generates revenue through fees related to new product implementations, customization and customer training, delivered revenue of $19.9 million, representing an increase of 8% year-over-year driven by higher implementation, customization and our in-person PowerSchool university training events. Finally, revenue from license and other, our least strategic and most variable revenue stream representing 3% of total revenue came in at $5.4 million for the quarter, representing a slight decline of $800,000 from the same time period last year as we continued to place more focus on subscription based partner relationships. We ended the third quarter with an annual recurring revenue balance of $585.4 million, representing an 11% increase over the same time period last year. In the third quarter, our non-GAAP research and development expense came in at $22.6 million, representing a 13.9% of revenue compared with 15% in the same time period last year. Third quarter adjusted EBITDA was $52.2 million or 32.2% margin, exceeding the high end of our guidance range for the quarter, representing an increase of 530 basis points from the same time period last year. I think when you look at almost working with the districts to help address million jobs of teacher and not just on the recruiting new teachers, but managing almost 750,000 plus substitute teacher over the quarter, we are kind of right in the middle of helping these districts deal with all these challenges and itâ\u0080\u0099s actually creating more level of trust and partnership with these districts. What we have seen is that as we've started taking and putting a little bit more direct, we brought in a VP of International sales based out of Dubai and now we are building a team to actually cover the broader, call it, greater almost seven countries, right, we are seeing that the opportunity to almost 52 million-plus students. I think Iâ\u0080\u0099ve kind of mentioned a few times, and I can reiterate, analytics definitely is a big focus area for a lot of districts across the nation and even globally because a lot of the understanding of learning costs, what you need to do, how youâ\u0080\u0099re spending your SM money and whether itâ\u0080\u0099s providing the right recovery on the learning costs, all that is tied to understanding where the students are, how do you provide the right interventions and how do you address it."
}