{
    "symbol": "PWSC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 18:10:20",
    "content": " This consistency has been the cornerstone of our success driven by: first, the power of our unified comprehensive platform, which enables continued demand and growth through cross-sell into existing customers; second, our track record and opportunity to continue expanding the depth and breadth of our differentiated platform; third, our position and continued growth as a platform leader in the K-12 SaaS market from not just in North America, but also with the net new logo wins in international; finally, and above all, the impact of our compliance-driven must-have platform has on K-12 education, which is one of the largest, most predictably funded and least cyclical markets. Subscription and support revenue totaled $129.8 million, up 26% year-over-year, driven by balanced growth across our product portfolio and strong customer retention. We ended the quarter with an annual recurring revenue balance of $556.7 million, and net revenue retention of $106.7 million, up 30 basis points from Q4, highlighting the continued success of our cross-sell strategy and the stickiness of our products. R&D in the first quarter totaled $26.6 million or 17.8% of total revenue compared with 15.7% a year earlier, reflecting our ability to maintain operational scale while continuing to invest in areas of innovation and our information security infrastructure. SG&A expense in the first quarter was $40.1 million or 26.8% of total revenue versus 21.4% from the year earlier, primarily driven by an increase in public company-related costs, higher post-IPO stock-based compensation expense and headcount to accelerate our go-to-market strategy. We now expect total revenue in the range of $623 million to $627 million, with the midpoint coming in at $625 million, representing an 11.9% year-over-year growth rate and adjusted EBITDA of $182 million to $186 million, representing a 29.4% adjusted EBITDA margin at the midpoint. Well, especially what I'd call out is that some of the pipeline, as I mentioned a little bit in my prepared remarks, like take example, analytics, it's definitely an area where we're seeing tremendous interest and increase, not just at the district level from small and large, but even at the state level, there understanding of how they can use the longitudinal view about the student, the whole child view so they can have the right support and policies. So we see a lot of those -- I'm mentioning last year, but we see this pretty common in hundreds of other school districts who have actually taken the benefit of having an integrated learning and an assessment environment to be one of the game-changers for them, not just for dealing with some of the pandemic and the learning loss even before that as to how this really helps them better provide an engagement to the students so they can support every child better. The fact that these are sticky solutions, pandemic-only, it has been an accelerator in helping them look at additional transformations to be faster, but it's definitely not a sign where the renewals or anything is really sidetracked because even all these solutions are applicable to them on an ongoing basis, and they don't really move up and down based on the situation in one quarter or certain students, it actually is deployed across the entire district."
}