{
    "symbol": "BRAG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 01:49:04",
    "content": " At this time, I would like to welcome everyone to the Bragg Gaming Group Second Quarter 2022 Conference Call. Good morning, everyone, and thank you for joining our second quarter 2022 earnings conference call. I'll be hosting today's call alongside my colleague, Chief Executive Officer, Yaniv Sherman, welcome Yaniv, who will comment on our second quarter performance; and our CFO, Ronen Kannor, who will review our second quarter results and our guidance for the remainder of 2022 calendar year. If you have not already done so, you can follow our Q2 earnings call presentation from our website at investors.bragg.games, that's investors.bragg.games in the section called Investor Presentation. On this call, we'll review Bragg's financial and operating results for the second quarter of 2022. Statements about expected growth, prospective results, strategic outlooks and financial and operational expectations, opportunities and projections rely on a number of assumptions concerning future events, including market and economic conditions, business prospects and opportunities, future plans and strategies, technological developments and anticipated events, trends and regulatory changes that may affect the corporation and the subsidiaries and their respective customers and industries. While we believe these assumptions to be reasonable, they are subject to a number of risks, uncertainties and other factors, many of which are outside the company's control and which could cause the actual results, performance or achievement of the company to be materially different. As Yaniv mentioned, we'll be going over our second quarter highlights, financials and operational updates. Revenues came in at 34% higher to a record â\u0082¬20.8 million, while EBITDA rose 63% to â\u0082¬3.1 million. During the passing quarter, we completed our acquisition of Spin Games, a key milestone in our U.S. growth strategy. The Spin deal closure follows Wild Streak Gaming's acquisition last year, and we're excited to welcome the Spin and Wild Streak teams to the Bragg's global family. Bragg went live with our proprietary content from the very first day of the newly regulated Ontario market, which was complemented by market entry and expansion in Europe. After the quarter ended, with me joining the Bragg executive team and Board, we've marked another U.S. market entry in Connecticut and rolled out our very first integrated Spin-Oryx proposition in North America. The second quarter revenue was up by 34.2% year-over-year to â\u0082¬20.8 million and up by 7.6% from the previous quarter, representing the record quarter we ever had. This performance drives mainly from organic growth from its existing customer base, the onboarding of new strategic customers in various jurisdictions, mainly the Netherlands, in the PAM and turnkey solutions segment. In addition, we had a strong revenue performance from Wild Streak Gaming, the business acquired in June 2021. From a KPI perspective, the total wagering generated via games and content offered by Oryx and Wild Streak and Spin Games in the period was up by 9.2% from the prior quarter to â\u0082¬4.2 billion, and 9% up from the previous year. As you can see from the wagering chart on the right-hand side, the new German market restrictions on gameplay had an effect during Q3 2021, but ever since we are seeing a positive trend and momentum. Gross profit increased by 65.5% to â\u0082¬11.6 million with margin increasing as well by over 1,000 basis points to 55.9%. This is primarily attributed to a higher proportion of revenue derived from the growth in the proportion of the platform and Turnkey revenue, alongside with Wild Streak proprietary games revenue, which have not cost of sale compared to the license game and content, which have third-party costs associated. Adjusted EBITDA for the quarter was up by 62.9% to â\u0082¬3.1 million, with adjusted EBITDA margin reaching 14.9%, increasing by 260 basis points from the same period in the previous year. The increase in margin is mainly as a result of scale and improvement in the product mix of PAM and turnkey solutions, offset by the increased salaries and subcontractors cost as part of the corporation strategy of investment in the expansion of its software development, product and senior management function with focus on margin control. During the quarter, we closed the acquisition of Spin Games and its trading was including from the 1st of June 2022. With respect of the guidance, as a result of the positive momentum in trading, we're updating the financial year 2022 both revenue and adjusted EBITDA guidance. The new revenue guidance is expected to be in a range of â\u0082¬76 million to â\u0082¬80 million, representing a 11% increase from the previous consensus guidance. The adjusted EBITDA is expected to be in the range of â\u0082¬10 million to â\u0082¬11 million, represents a 5% increase from the previous consensus guidance as the guidance includes the impact of continued investments in the business focused on driving further top line growth. As I mentioned earlier, our entry into new markets, in particular the Netherlands, has been exceptionally strong, coupled with new client wins and the ramping up of operators launched early in the year gives us significant momentum in this financial year. During the quarter, the new customers revenue, which related to customers joined in 2021 and 2022, was up by 3.9% quarter-over-quarter, driven by new market performance. Legacy customers, including German-facing customers, has also seen a growth quarter-over-quarter by 6.8%, with a limited drop from the previous quarters due to the new German market regulations introduced in July 2021. Overall, the underlying recurring group revenue, including licensed Germany increased by 7.6% quarter-over-quarter. As you can see on the right-hand side, we have presented the Q2 underlying business revenue mix that is moving into the next quarter and for the whole year after offsetting the headwinds for the German markets since the new regulatory changes took place in July 2021. Overall, the new business pipeline, new markets entry, and more focused sales underpin 2022 financial year revenue guidance. As you can see from the margin slide, the gross profit margins are in the growth momentum since Q2 2020. The product mix changed since third quarter of last year and now trading towards PAM, turnkey solutions and proprietary content, while improving gross profit margins and profitability. As we indicated in the past, platform and proprietary content products are carrying non-third party costs, which is giving us the ability to scale up gross profit margins. In Slide 10, we would like to demonstrate that our continued revenue growth is monitored with margins control. Total operational costs, excluding cost of goods associated with third-party content providers, continued to scale down since Q3 2021 and amounted to 40.6% as a proportion of the total revenue. While the corporation continued to invest in expanding its technology, product and games development, the total cost of salary and subcontractors as a proportion of the revenue scaled to 23.9% and targeted to scale further with further growth. IT and hosting costs scaled to 2.9% of the total revenue, mainly as a result of the Group U.S. expansion and organic revenue growth. In Slide 11, I'll detail how we reconcile our operating income to positive adjusted EBITDA in this quarter. Transaction and acquisition costs, costs associated with the corporation M&A strategy and the gain on re-measurement of contingent consideration, which is mainly related to the share consideration element of the Spin Games acquisition. Net working capital was â\u0082¬1 million compared to â\u0082¬11.6 million at the beginning of the year, with the main difference between the period was the â\u0082¬9.1 million investment in the consideration paid upon the Spin acquisition. From a cash flow perspective, in the 6 months ended in June 2022, we generated â\u0082¬7.5 million from operating activities, while investing â\u0082¬12 million in the acquisition of Spin Games and software development costs as part of the investment in our technology. While the Spin acquisition was only completed on June 1 of this year, since the deal was announced, we've been making great progress in laying the groundwork to allow for fast and streamlined integration into the Bragg business. The technical integration between Spin and Oryx platform has been completed in record time, allowing us to start leveraging on Spin's wide distribution network in the U.S. shortly after deal completion. This was coupled with an extensive licensing effort to allow us to go live in Connecticut and Ontario shortly after closing, and this should help expedite our content rollout during the second half of the year and beyond. Our recently acquired Wild Streak team headed by Doug Fallon out of Las Vegas is already producing and developing proprietary content under our Atomic Slot Lab studio, which is now 1 of 4 in-house Bragg studios targeting the global iGaming market. This growing content portfolio is powered by Oryx's remote gaming server and player account management, equipping Bragg with a full stack product offering and using state-of-the-art technology. We believe these synergistic assets will give us a competitive edge in the markets we aim to grow in across North America, Europe and Latin America. Focusing on the U.S., with access to a material part of the addressable iGaming market through existing relationships and integration, you see on Slide 15 that we aim to enhance our footprint in the American market and help our operating partners grow revenues and profitability using Bragg's proprietary, exclusive and aggregated games portfolio. In the next slide, as for our longer-term business goals, Bragg has embarked on a mission to diversify its revenue sources from both the market and product perspective. As you can see, we've made good progress, driven by organic and inorganic growth in those directions. We are equally focused now on complementary revenue growth with higher margins, our aim to further diversify our product revenue mix through more proprietary gains and turnkey customers, all while maintaining operational discipline and cost control. We will be using this momentum to further integrate our recently acquired U.S. subsidiary into the Bragg business, becoming a truly global iGaming solution provider. Launching new products into new markets will be complemented by enhancing existing relationships, helping our customers compete and grow their businesses. I'd also like to take this opportunity and thank the Bragg's executive team and our employees across Slovenia, Malta, London, Nevada and India, for their hard work over the past few months, which resulted in these impressive achievements. Ronen, do you want to take that? So yes, we presented 25% growth from the legacy business, I mean excluding the acquisitions. The majority of the growth, as we know, from a nominal perspective, is in Dutch market as we're doing, I would say, quite strongly from 4, 5 customers that we have there on managed services -- turnkey solutions, sorry, and iGaming platform and content aggregating. We're also seeing growth of 10% growth from the legacy business, which is in various markets, some from the European market. We can see some growth coming also from -- picking up from the U.K., although in small scale, and we're seeing some kind of Portugal, which just entered, and some other markets that we're operating in general in other European markets. So, I can't say in particular there's one particular market that is as significant as a Dutch market per se at this moment, but we're growing organically from all other markets simultaneously. Maybe for my second question would be, obviously last year was -- you had a couple of acquisitions with Wild Streak and Spin Gaming. Well, you're right in the sense that we've completed two meaningful acquisitions. Having said that, management's current focus is integrating or further integrating Bragg into a new global business across three continents and I think that strengthening the skeleton that can house additional deals in due course is our #1 priority. But at this point, as you correctly outlined, default would be in the next few quarters is to further enhance and drive organic growth through the newly acquired assets. North America -- the North American market, predominantly U.S. and Canada, has been -- we've been making great progress in basically distributing or establishing a new distribution network on top of the one that's been already established in the market and the idea would be to utilize that network. We're seeing some good initial signs, but at this point, we've only deployed limited amount of proprietary content into it. So that will be our focus for the second half of the year, getting as many of the integrations live in most of the iGaming markets in North America, and then building up our content portfolio with each operator. And I think it was mentioned on the call itself, the first half of the year was demonstrating some healthy growth based on both the acquisition and the existing Bragg business and I think we'll be looking to accelerate those. In terms of market share, it's a trickier point. I know that total addressable market was a topic of the conversation, but I think that we're coming off from a relatively low base in North America. There are various ways of measuring, especially on the B2B level, but I think that we don't need to take double-digit market share in those areas to make a meaningful impact on the business. So, I was looking at some of the results of some of the other B2C operators operating in Europe and so some of them exited the Netherlands markets to get a license, they received their license. So far, we've seen material growth from our clients in the Dutch market. We haven't seen -- actually during the first half, we haven't seen or felt through our clientele the negative impact from the increased competition, but I think it's a bit soon. But definitely, I think, the Netherlands, the Dutch market will continue to grow on the back of increased competition, but the pieces of the ply would inherently have to go smaller. Our focus is to onboard and launch additional clients and grow with the existing ones to sort of defend our position, but I think the other point is also diversifying our revenue sources just so it becomes well balanced. It doesn't mean that they're not happening, but again, our exposure to the market at this point after having exited it is limited. I'll start with a question on the Spin acquisition and just comments regarding Wild Streak plus Spin revenue, up 50% sequentially, it's great to hear. Ronen, do you want to take that? To be honest with you, it's not really presentable to present on a pro forma until last year. And in the quarter-by-quarter, there's a 50% increase. The part of Spin was just 1 month during the consolidation of this quarter, so it's not significantly impacted the growth. So it's all about our proprietary content with Wild Streak with the existing legacy customers and with the content that actually we're rolling out into the U.S. land-based casino, so it's online and land-based casino, which is impressive on its own from our perspective. And then, just looking at the MD&A comment, it's nice to see you added 30 customers, it looks like sequentially 26 of those came from Spin, I believe. So maybe -- and that's a good sign, just given the Tier 1 operator relationship. And I think right now, it's mostly around 2 or 3 elements, which is time to market, certification and positioning. But all in all, the Spin team headed by Kent Young and his team in Reno and Vegas has been extremely effective and sort of relaying the new solutions and the new story, and we've been operating ever since the deal closing in tandem with them. So leveraging on all of that, I think it's up to us to now complemented with some sound content delivery that will make an impact. And then just maybe one last question, just given your debut in the newly regulated Ontario market, which just went live in April, so very timely. Just wondering, are you seeing any parallels to other markets you've recently entered and had success in, of course the Dutch market was kind of a unique opportunity, but nonetheless they have a home run opportunity as well. Well, I think generally speaking, Ontario resembles more of a, what I call, a transitional regulation rather than a market restart. Market restart, just like the Dutch or most of the American markets by the way that have basically shut down at a given moment and then restarted the Dutch market. The Canadian, the Ontario regulators took a more transitional approach in sort of bringing existing dotcom operators under the tent, which means it's a more gradual process. So initial numbers suggest it's a growing market, and it's going to be a healthy one. I think that's what we've seen in other markets, both for Bragg and generally speaking. And I do think it's also a much more competitive marketplace than the Dutch, meaning as far as I know, well over 100 applications in the marketplace and that is only growing, which means, of course, for someone like us, it's a much bigger playing field, but it also means it's quite fragmented initially. And we're also waiting for a set of the formal numbers to come out of the regulator desk, like we have in North America, to get a bit more intelligent around it. But I would -- from the numbers that we've seen so far, and generally, I think it will be more gradual and would demonstrate consistent growth, but it won't be as dramatic as the Dutch market, which was basically sort of a day one launch this will take a bit more time when the  have a lot on their plate to go through, as I mentioned. We knew that a few months ago, we knew the quarter's Spin acquisition and $10 million we have to pay the initial payment. I believe in the next few weeks, we're going to conclude about the process we started and we will notify the market. The second question I have here, I noticed that the customer concentration risk definitely increased tremendously in this quarter. I see here, based on my calculation, over about 46% of Q2 revenues are from one customer. So, it's definitely -- we assessed that we were fortunate enough to partner with market leaders and we think that we don't break out with specific customers due to naturally confidentiality reasons. The other part of it, actually the other side of any customer that's fast growing takes us a growing part of your total revenue base. And the solution there is the need to further diversify our revenue streams and grow businesses in other parts of the world and markets, and that's exactly what we're doing. I mean, at the end of the day, company's growth was powered or driven by this early success, and we want to leverage that to sustain that growth trajectory and mitigate that risk, but that's a great reading of the current momentum drive. I wanted to ask a question on the platform strategy with the player account management, obviously seeing strong traction in the Dutch market. As Yaniv mentioned, we have opportunities in the Dutch market and someone that already have track record in it. Other European opportunity in that regard, we're evaluating those sort of in a case by case basis, naturally PAM deals are more comprehensive in their approach, and more intimate relationships because all the entire online proposition is powered by us. But -- and in regulated markets, as you can imagine, operators need to have certain assets and resources in order to push something through to meaningful scale. But there is definitely, I think, some of the climate around pluses, we also feel that has changed and sort of shifted towards profitability, which means that there are a lot more conversations around outsourcing technical competencies. I think operators realize that managing a full turnkey technical and product stack is material, which some things changed our pivot to their business. So they're looking to partner with someone that cannot just provide them with that, but also some ancillary services, managed services, and we have all that at hand. And then, just on the proprietary content, I think you guys mentioned in your press release this morning about 22 proprietary games to be released through the balance of the year. And as I've mentioned, we've seen some initial success from the Atomic Slot Lab content deployed like Egyptian Magic and a few other key titles. And they're not just demonstrating early success, but they're also allowing us and enabling us to start building a data set that we can both share with partners, but also take back internally and see what works and what doesn't and if is more complicated than just the game itself. This is definitely something sort of a flywheel we're looking to start implementing in North America on the success that we've had in Europe with it, distribution that we've had with it to enhance that distribution in North America and start collecting a data set that will enable us to develop proprietary customized or sometimes adapted content for those markets. The proprietary part is not just the art or the math, it's also the data set that you're able to collect and then develop against that. Just on the Italian market, that seems like I think the U.S., we've got a good sense of where that's going. The second is, if I remember correctly, it's the second biggest market. So it's definitely something that we need to tend to just -- we're also conscious of the research that we need to put in Italy, much like Central Europe. Actually Italy is also divided into two submarkets if you look at this, Southern Italy and Northern Italy that are somewhat different in terms of customer preferences. The land-based market has sort of put a certain flavor to games, content that you see in different venues, very distributed and local incumbents are very effective there that we would look to partner with, but it requires different data sets. We've had some early success in other markets where we've taken Central European developed so focus our content, both develop internally and also aggregated or some of our exclusive content and we were able to adapt it to localize it to other markets. But it is, let's call it, more of a midterm to longer-term focus because, again, it is just like its size is, it's near size, it requires some specific attention. And naturally, the technical integration involved in the market itself is something that we will need to focus on, but let's see that sort of mid to longer term, just to make sure that we have our resources focused on our key growth markets."
}