{
    "symbol": "VSCO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-03 12:04:07",
    "content": " However, we are evolving and innovating our business focused on our three key pillars, and we have organic growth strategies and new customer experiences well identified for 2023, including the recent launch of the Victoria's Secret and PINK customer loyalty program and a pipeline of bra launches. Your line is open. Secondly, we're going to leverage the technology and try on at home that Adore Me has perfected, and we're going to apply that to our much larger scale customer base in Victoria's and PINK and the same with subscription services that will be applied towards the back half of the year. Your line is open. Within that, the VS and PINK business for the North America business, primarily is about $430 million or flat to last year in the first quarter, even with those investments in technology, marketing and also bonus-related costs. So hopefully, that helps. Your line is open. I think the one item of note because I know that then reading some of the sell-side notes from last night and even this morning, the first quarter guide from a sales perspective was a little different than maybe some were expecting Just to underline for you something Martin mentioned in his prepared comments, and that was the drag in the quarter of the impact of PINK apparel being challenging. So hopefully, that helps. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I think the second piece, building on Adrienne's question, we're going to continue to lean into the marketing spend to invest in the business, both at top of funnel and also to support the new version of our fashion show, which is to come later this year. So a slight margin benefit -- more benefit on the expense line to fund some of the growth initiatives that I mentioned as we move through 2023, get to the fourth quarter and into 2024, that's really where you'll see the amount of savings from the Transforming the Foundation goal start to grow and it will grow most notably from a margin perspective and cost of goods around initiatives that we're working on with Dean and Chris Collier and their leadership team."
}