{
    "symbol": "TROX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 12:24:06",
    "content": " Despite a 34% TiO2 volume decline in a 44% zircon volume decline in the fourth quarter of 2022 compared to the prior year, we were able to achieve full year 2022 adjusted EBITDA of $875 million and adjusted EBITDA margin in the mid-20s, while generating full free year cash flow $170 million after investing $428 million in capital expenditures. As we highlighted in the fourth quarter, the unanticipated events, namely the fire at our KZN insight in South Africa, and historic flooding in Australia unfavorably impacted costs by $30 million in the fourth quarter. As I previously outlined, the fourth quarter includes approximately $60 million of idle facility and lower cost to market charges along with higher costs from Q4 events and lower fixed cost overhead absorption. This impacted result by an additional $30 million, resulting in a total of approximately $60 million of impact to the fourth quarter EBITDA. As a result of the commercial dynamic John previously outlined and the hangover effect from the fourth quarter event, we expect the first quarter 2023 adjusted EBITDA to be in the range of $120 million to $130 million and adjusted EBITDA margin to remain in the high-teens. Based on this in our current bottoms-up analysis, we expect adjusted EBITDA to be in the range of $120 million to $130 million for the first quarter. Furthermore, due to these two events, we have incorporated into our first quarter range, approximately $25 million in higher production costs. And then just kind of a balance sheet question, volumes were down big last year, but yet your inventory was up over $200 million and now you're guiding to working capital being up another $150 million this coming year as you're calling volumes kind of flattish. So on newTRON, David, Remember, we talked about an improvement of about $50 million for 2022 and we will maintain that obviously in 2023 and we're probably going to slightly increase it by, I'd say, another $20 million through automation of some of our plant and continuous development of our advanced process control and our maintenance practice because all of those elements, the investments were done in '22 and the benefit will start to show in '23. So there are a variety of compounding effects that have happened from that flood that are continuing to roll into Q1 and when we think about where we are now in our expectations, as we said, as we would expect to see the fourth quarter cost are actually, our cost to improve as we move into the latter half of the year as we start to get the roads back in full production through the additional capacity, we'll be able to ship on that primary road again. It's about $15 million on zircon, $10 million on Atlas and $15 million on South Africa, which is not going to repeat because as JF mentioned, South Africa is coming back online at the end of this month and that's from the fire. So John, to take the different pieces of that, as it relates to our Q1 run rate, there's about $10 million of incremental Atlas cost that we normally would not have had. And when you're down 30%, our benefits of vertical integration, we struggle a bit because we target 85%, but when you're down 30%, we've got to slow our mines down a little bit, which we are doing as part of Q1 and that's an additional $15 million of unfavorable over absorption. But my confusion kind of stems from, if I take a look at let's say, the Q1 guidance of $120 million to $130 million in EBITDA you guys have given. The weighted average shares are obviously are coming down because we did buy $50 million of shares back in Q1 and Q2, but that's a weighted average calculation by quarter. As we mentioned, Europe, we're seeing a strong recovery again, it's not as strong as we had been previously, but we would expect some of that volume that's being brought online to be offset by some of the exports that were coming from China into Europe, there was a significant increase in the fourth quarter of exports from China into Europe and now with the China economy picking up, we would expect some of that's going to stay in country. So it's a good point on Lunar New Year because what I would say in January, our volumes were down in China, probably 50% lower than what we would have seen in the prior fourth quarter. On last quarter's calls, I guess, just a few minutes ago, you said you'd entered $125 million ARR securitization solely, which were Australian and receivables."
}