{
    "symbol": "IMPL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 13:24:05",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to Impel Pharmaceuticals Third Quarter 2022 Earnings and Business Update Conference Call. And now, I would like to turn the conference over to Impel's Chief Financial and Business Officer, Dr. John Leaman. We are delighted that you could join us today for Impel Pharmaceuticals quarterly earnings conference call to review our third quarter 2022 commercial and financial results, as well as to provide a general business update. Before we begin, I would like to remind everyone that we have a slide presentation to accompany our conference call this morning, which can be viewed at our website at www.impelpharma.com. I'd like to remind you that during the call, the company will be making forward-looking statements that are subject to risks and uncertainties that may cause actual results to differ from the results discussed in the forward-looking statements. I am pleased, as always, to update you on the commercial and corporate progress we have made in quarter three and year-to-date 2022. The agenda for today's call can be seen on our next slide, slide number three. During this call, we will provide a prescription performance update for Trudhesa, in addition to covering ongoing prescriber, market access and patient dynamic data for the third quarter and year-to-date 2022. With this said, let's turn to slide number four to begin our commercial performance review with Trudhesa. As you can see on this slide, Trudhesa has continued a consistent and positive launch trajectory with sustained quarter-over-quarter growth in total prescriptions. We are delighted that cumulative total prescriptions since launch have now reached close to 50,000, with this growth highlighting the clear unmet need that persists for people with migraine, patients who need predictable, consistent and well-tolerated pain relief, a profile that can be delivered with Trudhesa. We're also pleased to see that the average weekly Symphony nTRx numbers for Trudhesa increased from an average of 1,245 per week in August to close to 1,500 per week in October. We believe that this inflection in performance is a direct result of our field force expansion with all lead performance indicators relating to new prescribers, new patient starts and consistently high refill rates, all moving in a positive direction. On the right-hand side of this chart, you will note that the Trudhesa market share is now over 5% within the acute branded market among prescribers. Please now refer to slide number six, where we will take a closer look at the encouraging early signs related to the clear impact of our sales force expansion. New prescriptions, the key to continued product growth increased by 45% versus the second quarter, signaling a significant acceleration. On the right-hand side of the slide, you will note, we also saw another sizable jump in normalized new Rxs from September to October as we moved into the fourth quarter of this year. Importantly, these clear productivity gains from the sales force expansion go beyond just the number of reps deployed. In September, on the second month after our expansion was complete, our original 60 territories saw normalized new prescriptions increased 53% compared to the average monthly new patient totals in the second quarter of 2022. On this slide, I would like to highlight the 30% increase in new prescribers when comparing August to October, the three months post sales force expansion to the previous three months. And it is also worthy of note that since our launch in October 2021, only 64 or 3% of Trudhesa prescribers have lapsed, meaning they have gone longer than eight weeks without another new prescription, an impressive retention rate compared to other product benchmarks in this space. We believe this loyal prescribing comes from strong sales execution, a smooth prescribing experience for our health care professionals and most importantly, rapid, consistent and sustained pain relief for patients. This now reaching close to 60% versus 53% and 54% in the first and second quarters, respectively. The refill rate with Trudhesa has remained both consistent and high, averaging 63% since launch. This is impressive, and we believe, again, reflects high patient satisfaction and signals that patients are using Trudhesa for more than the occasional severe migraine. These data are consistent with feedback we have received from previous patient research and importantly, with the clinical results seen in our pivotal STOP 301 Phase III study. When surveyed on key product benefits, such as rapid onset, consistent pain relief at two hours, tolerability and ease of use, patients reported very high satisfaction scores between 80% to 87%. When compared Trudhesa to the previous therapy, 67% to 74% of patients agreed or strongly agreed that Trudhesa is more convenient, better tolerated, faster working and more effective during a migraine compared to their previous therapy. We have maintained that despite new options for those suffering from migraine, patients and physicians are still in search of efficacy and in light of the patient data we have just shared, the opportunity for continued significant growth for Trudhesa comes into view. Given the tolerability of these products, it is our contention that the primary reason for this continued churn order with gepants is that prescribers are not finding the rapid, sustained and consistent efficacy they're looking for in acute migraine treatments. This churn over in the market opens up a large pool of eligible patients and more specifically, a significant ongoing opportunity for Trudhesa. Looking at the right-hand side of the slide, you can see that while Trudhesa does draw from a broad pool of patients, gepants represent the most common previous therapy, whether replacing a previous therapy are used in addition for specific attacks, we believe physicians are increasingly filling an efficacy board with Trudhesa. With that, I will now turn the call over to John to review our financial results for the third quarter of 2022. On our next slide, slide number 12, you will see our financial results for the third quarter of 2022. The decrease was primarily due to reduction in Trudhesa clinical expenses, as the Phase III study was closed, partially offset by an increase in spend for the clinical development of INP105. Selling, general and administrative expenses for the third quarter of 2022 were $19.7 million, which compares to $16.3 million for the same period of 2021. For the third quarter of 2022, Impel reported a net loss of $31.1 million or $1.31 per common share compared to a net loss of $25 million or $1.24 per common share for the same period of 2021. Before closing, I did want to make a few remarks on the market opportunity and projected timing with INP105, a product we are developing for the acute treatment of agitation and aggression in autism. This next slide, slide number 14, provides some background on this autism market opportunity. The impact on the children, their families and caregivers of the over 100 million episodes annually is significant and effective treatment options with favorable safety and tolerability profiles are desperately needed. In CALM 101, a Phase Ib clinical study with INP105 , Impel administered five milligram, 10 milligram and 50 milligram doses of INP105 and compare the plasma levels and pharmacodynamic effect to an intramuscular injection of olanzapine or IM and placebo. We recently initiated a Phase IIa proof-of-concept two-way, two-period crossover double-blind study, the CALM 201 study to evaluate the safety and efficacy of INP105 as an acute treatment versus placebo in adolescence with ASD experiencing agitation. With that, I would like to turn to our final slide, slide number 16, which summarizes our call today. Our prescriber base has increased by 30% and just one year into our launch, we have drawn depth to over a 5% share of the acute branded market within that group. Importantly, the investment we made in our field force expansion is showing rapid results with a 45% increase in new prescriptions and efficiencies seen across both new and existing territories. On the development front, we are pleased with the progress of the CALM 201 study and the potential for INP105 to have a major impact on children and families looking for a trusted at whole and as-needed treatment for children and adolescents on this autism spectrum coping with agitation. And finally, in addition to our continued focus on disciplined execution, we are currently assessing a number of financing and strategic opportunities in line with increasing shareholder value over time. This is, I think, the first time you're showing a slide like that, which is very helpful. Just wondering if it is -- is it supporting that new kind of the sales force push here is that more sampling, if you could kind of address that as well. I mean, given its efficacy and tolerability profile, we anticipate that physicians would start to use and get experience with the product and post-gepants failures. What we've been very encouraged to see, and this is all we predicted in this marketplace is that given this profile and in particular, given this very high level of churn over with gepants, Nurtec and Ubrelvy in this market, but indeed, the product is being used not only in patients who fell gepants who need that extra efficacy and tolerability, but being used alongside of those products as well. When you talk to clinicians as you have, that is the best practice, it's called the toolbox approach and most managed care plans are silent on it and, therefore, not restricting the ability to have Trudhesa added on as a rescue when needed to a patient that's using Nurtec or Ubrelvy as their base therapy. As Adrian said, I think what you see some patients getting Trudhesa prior to a gepants depending on the patient dynamic. I think one of the things that we've been very pleased with, right from the first month of launch, and as we mentioned, I think we're now almost one year into the launch, the refill rent has been consistently high at that kind of 60% to 65% level. So clearly, I think if one looks at the most recent data within the quarter, around kind of 63% level. And clearly, we always see this as being a very important measure because clearly, that's a direct -- sorry, an indirect kind of manifestation of patient satisfaction. So moving forward, I think we anticipate that as the product gets more and more established and used, that refill rate is going to be maintained over the course of time. And so as they are continuing to get appointments booked and continuing to expand their reach and the depth of their frequency, that coupled with what we anticipate to be further investment in awareness-generating activities like very targeted non-personal HCP work as well as DTC in the coming quarters. As Adrian said, we do expect that to continue to stay steady throughout 2022, even as PODS per prescription have increased to approximately 6%. We've not seen any change in refill rates leading us to believe that patients are using that drug, getting good relief and we'll continue to refill. So -- and clearly, the dynamics in this marketplace where not only are we increasing the number of prescribers but also the new patient increase, I think, as a direct result of the expansion is we're very, very pleased with that, not only from the fact that, obviously, the platform that it creates for moving into 2023. It was all a pleasure to have this call, and we look forward to updating you on our continued progress throughout the remainder of this year as we continue to create value for patients, health care professionals and you the shareholders we server."
}