{
    "symbol": "LTRX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-25 19:26:08",
    "content": " For the fourth quarter of fiscal 2022, we reported record revenue of $35.9 million, an increase of 74% when compared to $20.6 million for the fourth quarter of fiscal 2021 and up 11% sequentially, as compared to $32.3 million reported in the third quarter of fiscal 2022. Now, turning to the full-year results, net revenue for fiscal 2022 was $129.7 million compared to $71.5 million in fiscal 2021 representing an all-time record and an increase of 81% driven by organic growth of 31% and contribution from the acquisition of the TN Companies. Now, turning to the balance sheet, we ended the June 2022 quarter with cash and cash equivalents of $17.2 million as compared to $9.7 million in the prior fiscal year. For fiscal year 2023, we're targeting revenue of $149 million to $162 million representing growth in the range of approximately 15% to 25% and non-GAAP EPS in a range of $0.39 to $0.44 per share, representing growth in the range of approximately 18% to 33%. Starting with Q4 as Jeremy revealed to you, revenues for the quarter totaled $35.9 million, up 74% year-over-year and 11% sequentially. Looking at our fourth quarter, embedded IoT solutions totaled $18.4 million up 20% sequentially and 68% year-over-year and represented 51% of total revenues. For the full-year 2022, System Solutions totaled $59 million or 46% of revenues up 144% from fiscal 2021. We exited the fiscal year with a high margin subscription ARR of approximately $900,000 while shy of our goal of $1 million to $1.5 million exit rate this fiscal year we continue to make progress on this front, with continued uptick by our customers given our slated release of compelling new software products and services. Yes, Mike, I'll give you two other pieces of color as well, we just at the end of July, I believe it is we're off that transition services agreement with CSI, so kind of final integration, warehouse move completed, that was basically $1.2 million a year that doesn't repeat in fiscal 2023. And if I could just lastly follow-up on some Mike's questions around the guidance, nice to see that 15% to 20% outlook for the year, you didn't mention that it starts a little bit slower in September, I'm wondering kind of what that means sequentially in terms of the trajectory of revenues. So if I could get enough supply we are able to ship against that late CRD number of $10 million be able to certainly outperform in the September quarter it's just, we're truly at a juncture at this point where we're supply chain constraint."
}