{
    "symbol": "LTRX",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-11 21:40:10",
    "content": " For the first quarter of fiscal 2022 we reported record revenue of $27.7 million, an increase of 62% when compared to $17.1 million for the first quarter of fiscal 2021. GAAP net loss was $2.3 million or $0.08 per share during the first quarter of fiscal 2022, compared to a GAAP net loss of $302,000 or $0.01 per share during the first quarter of fiscal 2021. We did have – we did see an increase in that delinquency to CRD, and it's basically customers requesting it in the quarter, so about an additional million, $6 million in total revenue that customers would like us to deliver that we just can't quite deliver in the time frame that they want due to lead times. On some of the big design wins, you know we did highlight one of them that we said can be $10 million to $20 million, you know kind of starting at the very end of ‘22 and going to ’23. You know once we sign that supply contract, it'll likely be something that we’ll announce as well, but we do have programs and introduction today that we are seeing some meaningful $10 million plus revenue run rates on. One that we didn't highlight, you know we talked about remote environment management and data center financial institutions being quite strong, we do have some of our classic blue chip customers that are rolling out to the tune of $1.2 million infrastructure upgrade opportunities that will consume $1 million plus worth of Lantronix products. It seems like given – you know I think you guys had previously talked about in an environment that wasn't component constrained, you know you would target kind of a 15% organic growth rate and we've already kind of talked about we’re, you know that we're still on a component constrained environment, but we're going to grow north that. But it seems to be like – I think you mentioned the number, but in a pre-COVID environment, if you were doing the same revenue that you're doing today or projecting to do today for example, roughly $110 million to $125 million in revenue and we were just starting the December quarter and going into the next calendar year."
}