{
    "symbol": "TTEK",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-02 16:09:04",
    "content": " Our net revenue was $737 million in the quarter, up 8% from the prior year, a new all-time high for any quarter in the company's history. When we actually combine Tetra Tech and the RPS Group, we now have an organization collectively with 27,000 employees, working from 550 offices worldwide, servicing 22,000 clients and we collectively deliver 100,000 projects a year with an annualized revenue of approximately $4.5 billion. And when looking out over the next three years, we expect to; first, increase the actual EBITDA margins of RPS from the lower historical levels to be more in line with Tetra Tech generating margins well over 13%. And secondly, through improved RPS profit margins and cash flows, along with Tetra Tech's strong positive cash flows from operations, we expect to delever our balance sheet to a level to be more in line with our long-term net debt-to-EBITDA goal of one times to two times. The addition of RPS also advances Tetra Tech's global energy strategy by giving Tetra Tech access to a Â£15 billion per year offshore wind market in the United Kingdom and Europe, significantly increasing Tetra Tech's renewable energy opportunities. With respect to the contributions, the financial contributions for RPS for the second quarter, we have estimated that they will contribute approximately $100 million of net revenue to Tetra Tech, with an associated earnings per share of minus $0.10 in the second quarter. For the entire fiscal year of 2023, the eight months that they will be with us in total, we expect that they will contribute approximately $400 million of net revenue and be neutral to our earnings per share on an adjusted basis, excluding transaction and integration costs. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}