{
    "symbol": "IVZ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 12:20:04",
    "content": " For the full year, ETFs brought in $28 billion of net long-term inflows, the equivalent of 11% organic growth rate. Fixed income capabilities in the institutional channel have been pillars of organic growth for several years now and growth persisted in both of these areas in the fourth quarter with $800 million and $900 million of net inflows, respectively. For the full year, our China joint venture delivered $7 billion of net inflows, the equivalent of 11% organic growth rate. Active global equity remains the biggest drag on organic growth with $6 billion of net outflows in the fourth quarter, including $3 billion in our developing markets fund. Global market increases, foreign exchange movements and reinvested dividends increased assets under management by $61 billion, and total net inflows were $25 billion, inclusive of $30 billion into money market products. As Marty mentioned earlier, the firm experienced net long-term outflows of $3.2 billion this quarter, equivalent to a 1% annualized organic decline. Passive capabilities returned to net inflows this quarter was $7.3 billion, while net outflows were $10.5 billion in active strategies. These capabilities also delivered positive organic growth for the full year along with our Greater China business, which enabled Invesco to offset outflows and strategies that experienced net redemptions as investors sought risk-off trade throughout 2022. For the full year 2022, net long-term inflows into our ETF capabilities were $28 billion, equivalent to an 11% organic growth rate and we gained market share. For calendar year 2022, the channel achieved net inflows of $13 billion or a 4% organic growth rate. Retail net outflows were $4.1 billion in the fourth quarter, a meaningfully lower pace of outflows than the prior quarter as the channel achieved positive flows in Asia-Pacific and ETF flows improved in both the Americas and EMEA, despite an uptick in investors harvesting tax losses as the year ended. Despite that, we raised over $3 billion in the fourth quarter from new products and investors showed signs of shifting back into equity products where we garnered $1.8 billion of net long-term inflows. Looking at full year 2022, our China joint venture delivered $7 billion of net long-term inflows, an 11% organic growth rate, and we're gaining market share. Net outflows in the active equity strategies have been concentrated in global and developing markets equities, which experience $6 billion of net outflows in the quarter, including $3.1 billion from our developing markets fund. Adjusted operating income was $339 million in the fourth quarter, $30 million lower than the prior quarter due to flat net revenues combined with higher operating expenses. So the $1.2 billion, about $640 million is held for regulatory purposes, so itâ\u0080\u0099s a little bit higher than the last quarter, and thatâ\u0080\u0099s really FX related."
}