{
    "symbol": "IVZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 12:23:10",
    "content": " Our Greater China Business delivered $2.1 billion of net long term inflows this quarter, Invesco Great Wall our China joint venture has fueled our growth and we continue to successfully launch new products, most notably in fixed income. While net inflows into ETFs are relatively flat in the third quarter, demand for ETF slowed industry-wide -- despite the slowdown, we maintain the leading position in ETFs and we expect to see growth rebounds as market volatility eases. Considering the combined investment we haven't seen in co-investment vehicles, which totals $900 million, along with $2.5 billion in commitment from MassMutual in various alternative strategies is compelling partnership that enables us to bring products to market more quickly and brings with it the strong reputational backing of a world class financial institution. While growth continued in key capability areas I mentioned, the firm experience net long term outflows of $7.7 billion during the quarter, equity strategies would have been under pressure industry wide were the largest contributor to net outflows totaling $7.4 billion for the quarter. Offsetting growth and institutional were $11.6 billion of net outflows and the retail channel this quarter, primarily in the Americas and EMEA, as investors continue to seek lower risk exposure amid extreme market volatility. Despite one of the most difficult bond markets in years, the third quarter was no exception to that reliability with $6.5 billion of net long-term inflows. Global and developing market equities continue to account for the majority of net outflows in the asset class, with $4.3 billion in the quarter, including $2.8 billion from our developing markets fund. Net revenue of $1.11 billion in the third quarter was 5% lower than the prior quarter, and 17% lower than third quarter of 2021, primarily due to decline in active asset levels. The drivers of the decline from last quarter with G&A expenses, which were $11 million lower than last quarter and marketing expenses, which declined by $7 million consistent with the seasonally lower activity we often see in third quarter as well as the decline in discretionary spending. Moving to slide nine, adjusted operating income was $369 million in the third quarter $43 million lower than the second quarter due to lower net revenue driven by market declines partially offset by lower operating expenses. Your line is open. Your line is open. I don't think it's a new normal necessarily, but if you think about just the activity levels, and just really the pretty outstanding volatility we experienced inside of the third quarter and it did put pressure on that category, and that will recover as activity levels recover. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I don't think we're setting some new level, very volatile quarter, given the risk-off environment that we've been in, it obviously impacted market levels, but also activity levels and transaction levels, as you saw, it was pretty holistically challenging. Your line is open."
}