{
    "symbol": "BY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 14:47:09",
    "content": " Moving on to the income statement, total revenue came in at $88 million, a record for the company and up 9% quarter-over-quarter, the increase in revenue was driven by higher net interest income, which was up 12% linked quarter reflective of growth in earning assets along with an expanding net interest margin, which was up 36 basis points to a strong 4.4%. And good morning, everyone. Our net income increased to a quarterly record of $77 million, an increase of 12% from the prior quarter, primarily due to loan and lease growth, higher rates, which more than offset the impact of higher interest expense on deposits and other borrowings. The one comment we would make is in terms of the current rate environment, in terms of which business is impacted, at least initially, much quicker, I think I would say would be real estate, both from the standpoint of new originations as well as payoffs, certainly rising interest rates causes new projects, there's, I think the market is still adjusting to that higher cap rates, higher equity requirements, the cost of equity going up so you throw in there also for new construction, higher input costs that have just now started to subside. And good morning, everyone. Maybe just two kinds of think about the trajectory of the margins in the first half of this year, I know there's a number of dynamics at play, including continuing accelerate upward deposit costs, pressures and perhaps slowing loan growth as well. I think just to add a little bit to Tomâ\u0080\u0099s caller, I think what Tom is saying is, look, we have a pretty healthy margin, we're likely to see some additional expansion here, given the outlook on rates and the factors now with deposit costs certainly I think, everybody in the market waking up to the fact that rates are much higher with liquidity draining, I think you've seen all the other banks now realizing that we can only hold back deposit pricing only so much. I think we've always been of the belief that loan to deposit ratios, particularly when the market participants are publicly stating that they want to have their loan growth be funded by core deposits, that's really important driver to determine kind of the level of competition in the market, just observing some of our competitors and some of the other players in the market, I think you're seeing loan to deposit ratios entire as they basically shed perhaps some excess liquidity that they were carrying. And I think our sense is that there'll be some degree, particularly at the margin, there'll be some degree of change in the mix for the reasons that you just stated, and I think that's consistent with what I think as an industry we're seeing, meaning it's consumers, businesses you could buy one month bills or three month's bills that probably with a handle in the 4% range, and if you want to maintain deposits and if you want to attract deposits, you have to, you're going to have to be competitive with that."
}