{
    "symbol": "CHK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:45:05",
    "content": " I would tell you that based on the setup of growing supply that we see across the market today and demand that is really going to rely on weather in the short term, we certainly have our -- we're very well prepared for a weaker gas market here as we move into 2023. Yes, this is Josh. Really, where we're looking at that is going to be in the Marcellus specifically, and one of the things that we're attempting to do there is not only increased lateral links, but we're also looking at adding additional wells per pad, and that's one of the advantages we find with the toe development. So I wouldn't plug that to that, but I do have a question on use of proceeds if and when you eventually sell the Eagle Ford, what should we think in terms of how you deploy that -- those proceeds, whether it be to incremental acquisitions to the balance sheet or indeed, to share buybacks, given that, I guess, you and -- does continue to see your share price undervalued. Yes, this is Josh. Well, anything that we were -- I guess maybe on the momentum question specifically, I think anything that we've done in '22, of course, that's going to be an incremental capital expenditure that we would need to layer in. In addition to that, I'll just add something that's not necessarily layered in here explicitly which is with the upper and co-developing it with the lower, we can put more wells on a pad, and that creates additional capital efficiencies, which we think can only further enhance the returns that we've specified in the deck today. So we think this is an area that will evolve pretty significantly as the world recognizes the huge need for growing natural gas production and the big demand that really does exist out there today and should continue to grow as the world seeks to have more of the affordable, reliable and lower carbon energy that solves some of the biggest challenges facing the economy today."
}