{
    "symbol": "CHK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 12:21:10",
    "content": " On the proceeds, weâ\u0080\u0099ve talked a lot about power value today and weâ\u0080\u0099ve talked a lot about what that means to us and how we think about capital allocation, so pretty clearly we have devoted a significant amount of our free cash flow to returning cash to shareholders, both through an attractive yield as well as through a very sizeable buyback. The turn-in lines for the Eagle Ford that are coming out of our capital program are pretty heavily weighted to the fourth quarter, and so thatâ\u0080\u0099s going to give us quite a bit of volume momentum going into 2023, which is a nice time to be thinking about a decision like this. But we think we can make it better over time by being focused on just the Haynesville and the Marcellus, so this is really about the strength of those two assets and how the capital allocation model comes together and how we continue to make it better. Weâ\u0080\u0099re going to maintain an open mind about what the best way is to return capital to shareholder, and obviously with an announcement like this today, where weâ\u0080\u0099re talking about leaning towards buybacks with proceeds, given what we see and the valuation of the company today, we think our stock is undervalued and we think that incremental cash beyond what weâ\u0080\u0099ve designed in our returns profile should go to buybacks. Well, actually when we look at our returns, and thatâ\u0080\u0099s how we choose to allocate capital, the returns today, even at the commodity prices you see and the margins you might expect in oil assets, the returns are still far superior in the Haynesville and in the Marcellus, and thatâ\u0080\u0099s really whatâ\u0080\u0099s ultimately guiding this decision. Our experience that we have, the technical expertise that weâ\u0080\u0099ve developed, the contracts that weâ\u0080\u0099ve put in place and how we partner with service providers also allows us to be able to manage our cost performance in these basins, and so you put these two together and you end up with that chart that you see in the upper left-hand side of Slide 5, with us providing you the best capital efficiency across our gas basins. Itâ\u0080\u0099s both firmly grounded in our belief that Chesapeake has the strongest assets, capital returns and balance sheet of any gas name today, and that by focusing all of our attention on the Marcellus and Haynesville, weâ\u0080\u0099ll demonstrate that weâ\u0080\u0099re the premier gas investment opportunity in the sector."
}