{
    "symbol": "CHK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 12:39:09",
    "content": " During this morning’s call, we will be making forward-looking statements, which consist of statements that cannot be confirmed by reference to existing information, including statements regarding our beliefs, goals, expectations, forecasts, projections, and future performance, and the assumptions underlying such statements. With me on the call this morning are Nick Dell’Osso, Mohit Singh and Josh Viets. We’ll get to Q&A shortly, but first I want to spend a couple minutes talking about where the industry sits today and how we’re seeing the year unfold. In the Marcellus, we closed on Chief and we’re busy integrating these great assets. Our team is excited to unlock the value we saw in the acquisition, and we’re encouraged about the early opportunities we see for further upside. Additionally, we also continued to lower our emissions profile, having completed over half of our pneumatic retrofit program and we’re well on our way to having our Marcellus assets join the Haynesville as independently certified responsibly sourced gas. As a result of this increase and the further uplift we expect following the close of Chief in March, we’ve increased the 2022 free cash flow outlook by $700 million raising the midpoint of our range to $2.7 billion. Today, our free cash flow per share and free cash flow per debt adjusted share lead the peer group by a significant margin with $10 billion of free cash flow anticipated over the next five years, a robust dividend combined with a large buyback program were poised to execute what we believe to be one of the most powerful cash return frameworks in the industry. Given the current valuation of our stock, it’s certainly possible. We will exhaust our $1 billion buyback authorization early and would then expect to seek Board approval to increase the authorization and continue retiring our shares, which will further enhance our already leading free cash flow and cash dividend metrics per share. In total at today’s strip, we expect to pay over $7 billion in dividends over the next five years. The war in Ukraine is horrible on every level, and we’re eager to see an end of the invasion. We’re also eager to help ensure the citizens of Europe and by extension, the rest of the world are not left without adequate energy resources should Russian supply to continued or either even further interruptions. We’re investing in the Eagle Ford again in 2022, after pausing through the pandemic, restarting our program at a logical pace. We’re continuing to press for max volumes out of our Marcellus asset every day, as has been discussed at length by us and others for constrained by lack of pipeline access to underserved markets, particularly New England. We’ve also proactively reached out to partners in midstream and downstream markets, as well as our government contacts to discuss the best ways to see supply increase in the U.S. I think you’d be delighted to know, I’m not going ask you about variable dividends. So it’s, I would like to ask you to be the elaborate on your comments around U.S. gas crisis, what I’ll kind of trying to figure out how sustainable or long end of the curve as the dislocation between Europe and the U.S. is pretty obvious, but $8 gas is pretty surprising as well. And my second question, if I may is, I guess we can’t ignore what happened yesterday with Cambridge . I guess asset sales Eagle Ford is probably part of the discussion, and just offering perspective, we can at this point to the extent that you can and I’ll leave it there. Let’s talk about gas prices first, was your first question. And for a couple years, we’ll be above four bucks on the curve. And we think if you have really adequate infrastructure to deliver gas to all of the markets where it’s needed, it should be back around three or maybe a little over three in this environment. And which means that, the volatility on top of that weather demand and things like that, it’ll go below the recent sometimes above three other times, and maybe bounce as high as $4 and see some lower prices too. And so, for example, if we increase production significantly in the Marcellus, it’s not going anywhere, so it’s not going to lower anybody’s prices. And so that’s not helpful that won’t create value for our shareholders, and we’re not going to pursue that path. And those kinds of constraints we think probably particularly in the Marcellus we think those will be sticky for a long time, but those constraints exist on a micro level and a lot of other places, whether they’re access to services, equipment, access to pipelines and so we think they’re persistent at least in the near term. And so prices are going to stay up for a bit, but ultimately they should supply and demand forces will went out and they’ll come back down to a more reasonable level. So that’s really all that we’re expressing there is that we’re not going to change our strategy to a view that says, six or seven or eight, where we are on the prompt is a more permanent price. And, I’ll just note that, we have a lot of discussions with shareholders including Cambridge. Just in 2022 alone, we’ll generate $1.2 billion of free cash flow out of the Eagle Ford before hedges, about $600 million after the effect of hedges. And what we’re doing in the field today, we think is going to add significant value to the asset for our shareholders. And we want to, have our heads down, and execute on that because we think we’re adding some good value here in the near term, but ultimately we’re going to let the results of those programs, just as we’ve been saying, inform us on whether we think we can maximize the value of this asset through our development, or if we should maximize the value of the asset by selling it to someone else. And so we’re, going to have our heads down executing on this program in the near term, and we think we’ll have results certainly in the second half of the year to talk about. It’s a great question, Matt. So, we do have a lot of incremental free cash flow as you’ve noted. We’ve been constrained with our disclosure requirements around the Chief asset, we haven’t been cleared of MNPI. But we’re, like I said, eager to do quite a bit more. On the debt reduction side, we have a little bit outstanding on our revolver today, following the Chief transaction, we’ll probably let that go back to zero. And I would call that, just it’ll just happen as it happens. And then as my follow up question, just curious, if you might be able to provide a little context in color on how you’re thinking about marketing your gap in the Haynesville we’ve seen a little bit of congestion causing a basis to widen out a bit. There’s a lot of projects in the queue that might ultimately evacuate gas further south and opening up the door for stronger realizations, as well as possibly tying in more volumes down the road into LNG opportunities. So one of the things we’re happy about today is there’s all these projects that are being proposed and there’s, all of the new LNG facilities that’ll be built over the next several years. And at the moment, we’re a bit of a free agent when it comes to where we deliver our gas. I’ll actually let Mohit talk to you a bit more about how we’re thinking about it, but we’re excited about out what this represents. Yes, Matt, that’s a good question. Don’t want to front run that, but more news to come on that front hopefully. This is obviously the first, quarter we’ve seen with the Chief acquisitions and trying to understand a little bit of the guidance. So, I’m hoping you could explain kind of, I guess what the goal is right now with Marcellus in terms of kind of maintaining production where you think the maintenance level is with the new assets and kind of where things are kind of post acquisition on those volumes relative to kind of where acquisition volumes initially were expected. I’ll let me just add a little bit of color to that, I think with the Chief acquisition we’re course just in the very beginnings of integrating that asset. And I do, I really feel like we’re off to, a great start with that. We are, as we – if we look at our till schedule, we’re a little bit back and load in the quarter. So, for our gas assets, I think we’ll have, 40 pills to 45 pills but 20 of those come in June, so, definitely you will see a little bit of lumpiness to the production there. And so that was a choice that we made, but that’s all volume that’s going to come back into the system. So it sounds like this is fairly transient, because I think you guys were growing production in Marcellus and it just does not, it’s not 800 plus fourth quarter, which is where my math, the simple math was on kind of Marcellus, but it sounds like this is more transient in terms of where production levels are. I’ll start this one and then Mohit may have something else to add, we’re pretty little hedged for 2022. For 2023, you can see the way we lay it down in our slide now, we put a bullet on there that tells you what we’ve added since the last disclosure. Some of the collars that we’ve done have been as wide for the full year of four by 10 which is, pretty awesome spread to have access to a floor of four and a ceiling of 10. Yes, I think the only thing I would add is, traditionally a lot of these hedges that we had locked in at emergence, they were done through swaps, but the skews on these collars have been so attractive that almost, I would say on an exclusive basis going forward, what we are doing is trying to prefer these collars. And my follow up, you mentioned in regards to the buybacks that some of those were privately negotiated, and obviously there’s some I guess in, overhang in some of the ownership, in Chesapeake, do you all see that as an opportunity to continue to utilize the buybacks to potentially do some more private negotiated deals. But we intended when we put the buyback in place to be ready, if any of those large holders wanted to sell to make sure that there was no disruption in the trading dynamics of our stock in the market, if there’s a large chunk that wanted to sell. One of the things that’s been really interesting about the perceived overhang of the shareholders in our stock is that they’re reasonably happy shareholders from, what we hear from them and patient. And so we’re generating great returns, the cash return elements, the pending buyback that can be accelerated now all of these things, point to a tremendous amount of upside in the stock. And so I call it a perceived overhang, because I think a number of these shareholders could be there for a while, but we’re totally ready when any of them want to sell to be prepared to be a buyer. So, we’re – I think your sentiment is directionally correct. Well, it’s something that we talk about in almost every day, Scott. I think they’re, if we had a little bit more turnover in the shareholder base that would probably help. And, when I say our shareholders are happy I think, I’m sure that they would all share our view that the stock is undervalued today. So, we’re all focused on how to drive this stock price higher and have it better represent the underlying value of the assets that we own. And if they want to hold, then we’ll buy from others in the market. So, we’re eager to execute on that because at this point that cash can go a long way towards retiring the share count, which is going to make all of our per share metrics that we talked about earlier that much better and should really continue to highlight the value in the stock that should drive the share price higher. So, we’re going to continue to execute on our plan. And it’s about the Chief assets up in the Marcellus, when I look at that map of, what Chief brings the table next to your map, that moves your center gravity or extends you kind of Northwest into more, I guess, central Bradford County. I don’t not, no, I don’t think so. We do think there’s some opportunities to make the asset better and a couple things that, we’re specifically looking at that’ll maybe point to is, we think there’s some room to improve completion designs. We think there’s some opportunities to potentially, widen spacing a little bit, and specifically around existing producers, those are things that we’ve proven within our own assets and are transferable, and even a little bit more tactical than that. It’s just simply, how we choose to steer a well and land it within a particular zone. And as we’ve looked at, some of the Wells in the Chief data set relative how we operate, we’re convinced we’ll improve performance there. I mean, really it’s about, us using the history and I think the technical expertise that we have to expand it in, into that acreage rather than it’s something unique about the rock that we’re developing there. And then Mohit will probably have something add here too again, but we’re really excited about the opportunity to do something like that, Josh exactly where we land on that spectrum of signing off, take agreements, taking position and facilities. At the end of the day, these prices anything you do in the LNG world’s going to be a very long term contract. And so while there is a big delta between U.S. gas prices in European or Asian gas prices today over the tenor of that contract, you’d expect there to be plenty of volatility in that spread. And so it’s really about a diversification strategy and, we’ll continue to think about the right way to approach that. And we’re seeing a lot of opportunities to do it with a number of different counterparties, and we’re going to take our time to work through it, but we’re excited about that potential. The only thing I would add is the, from a diversification angle, if the deal is linked to Henry Hub, that’s not as attractive to us. So whether it’s TTF, and the arguments or the discussions we are having internally is what’s the right amount. So from a diversification point of view, I would encourage you to think of maybe 10%, 15%, 20% of our production, if we can link it to some sort of an LNG index price, whether it’s through some of these agreements or whether it’s synthetic kind of a dent bag deal, then that’s what we are driving towards. And then you guys have been a lot of oil management since reemerging, you a little bit over a year ago, you still have the East Texas asset in the portfolio and just wanted to see what activity you’re doing there this year. Yes, Josh, we don’t have anything material in East Texas. Sometimes there’s some rights that show up on an acreage map depending on what you’re looking at, but we don’t have anything material that we maintain in East Texas. One, I was just curious that based on some of what I’ve been hearing from other producers, I wonder if you would comment on as far as services quality and what you’re seeing in this field, how things have been as far as the quality of the equipment its maintenance, reliability and so forth. And of course, what we’d expect from supply chain and parts. And when in an industry like ours, where we’ve seen growth with rigs being added, over the last year, clearly that’s stretch in that service organization. And so generally across the industry, that’s going to lead to some inefficiencies as that equipment gets warmed up, so to speak, and crews get some experience operating it. And I think anytime you’re in a construct – as a constructive commodity price environment that we’re in with activities ramping up, those struggles are going to persist. So it’s really, I think, I would say it’s present everywhere, as an operator, of course, what we do is, we try to manage our strategic partnerships very closely such that we’re constantly on top of our service quality, safety obviously is a huge focus and a concern of ours. We feel really good about our – the sources, which we supply the basins that we operate in, of course, we’re advantaged in Texas. I think, the biggest issue that we fight not to the point that it’s created any problems for us, but it’s just an ongoing challenge that we face day-in and day-out. It’s just sand logistics is probably, the bigger issue that varies by basin. A lot of it’s just the distance from a mine to a location, you interesting in the Marcellus it’s been with railcars we’ve had union strikes there, which created some problems for us, something we maybe wouldn’t have expected out of our control, but glad to say it didn’t necessarily disrupt any operations materially. In places like the Haynesville and our assets in Texas, it’s just about availability of truck drivers. Today within our frac fleets, we’re running roughly five frac fleets. That’s definitely, there’s been some learning curves there. We were one of the first adopters of that up in the Marcellus, really, I felt like we’ve kind of hit a stride there, and seen some efficiencies, theoretically those electric frac pumps should be more efficient, but you’re course relying upon the quality of the gas and the generation that’s being used on site to manage it. But just like most equipment within the service sector equipment’s tight, and for more e-fleets to end the market, they have to be built, which requires capital to be deployed. So, we’re in constant communications with our suppliers. Yes, I’ll take that one, John. That’s a big assumption and we’re in a world where people do care a lot about capital discipline and we think that’s right and appropriate, but, I think if you said you wanted to get a new rig and start going after a growth wedge, I think you’re at least six months from that rig showing up at least. And we’re committed to ESG excellence into answering the call for reliable, affordable, and lower carbon energy the world desperately needs today. We’re eager to provide a deeper dive into the depth of our portfolio and what we believe it will deliver for our shareholder at our Analyst Day, which we intend to host later this year."
}