{
    "symbol": "APAM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 15:21:03",
    "content": " Emerging Markets Debt brings together a number of attractive investment and business characteristics, a large and growing investment opportunity set to differentiate from the index and peers; a large addressable market of sophisticated investors and allocators to build a long-duration client base with attractive fees and a limited supply of investment talent with the experience resources and degrees of freedom possessed by the Artisan EMsights Capital Group. Underlying the AUM outcome is tremendous business value creation, investment leadership surrounded by additional talent and resource well established investment process and emerging investment team cultures, compelling early investment track records and foundational business development on which to build broader investment platforms. Over the last 10 years, since approximately the time we launched the credit team and began focusing in earnest on degrees of freedom, we have more than doubled our AUM from $74 billion to $160 billion, more than doubled our annual revenue from $506 million to $1.2 billion; maintained an adjusted operating margin in the 40% range and inclusive of our upcoming dividend distributed $30.31 per share to our shareholders, more than our IPO price of $30 per share in 2013. Looking forward, we will continue to focus on building business value, investing in our existing franchises, recruiting new talent and launching new franchises, launching new strategies with broad opportunity sets and large addressable markets, expanding our operating platform in fixed income, private investing in Greater China and further investing in digital marketing, accessing the wealth channel and other global distribution capabilities. Adjusted operating expenses increased $6.6 million year-over-year, reflecting the addition of the EMsights investment team, annual merit increases and an increased number of full-time employees consistent with our talent-driven business model. We also continue to invest in our talent through, annual grants of franchise capital and restricted stock awards to align our key talent with clients and shareholders and in technology and data through the expansion of the breadth of our operating and distribution capabilities within active management to support new teams and strategy launches. And as we stated on the call, we think that there is a lot of leverage built in the on-boarding of new teams and new asset classes that as you expand, your capabilities in credit, you have really sunk that cost into the business and the incremental cost of a new team in credit will be much lower given the two teams we have today."
}