{
    "symbol": "APAM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:51:06",
    "content": " Before we begin, I would like to remind you that comments made on today's call, including responses to questions, may include forward-looking statements. Artisan Partners is a high value-added investment firm, designed for talent to thrive in a thoughtful growth environment. In that way, Artisan's thoughtful growth directly benefits existing clients and existing strategies. Through thoughtful growth, we also grow and evolve our strategy lineup to align with evolving asset allocations. Through growth, we extend the duration of existing talent and expand the number of investment decision makers. Our commitment to thoughtful growth explains why we are not investing in passive investment strategies, a highly concentrated scale business or why we don't invest in a large sales force to transact directly with retail and wealth clients. We spend time and money on investment capabilities that enhance our high value-added strategies, differentiate them from passive and exposure products and evolve in the direction of alternative investment allocations. On last year's third quarter earnings call, I laid out long-term investments we are making in three areas to broaden into alternative-oriented strategies, differentiated credit, private investing and China. Over the last 12 months, we have successfully launched the Artisan Floating Rate strategy, which invests in floating rate leverage loans, the Artisan Emerging Markets Debt opportunity strategy, a blended currency emerging markets debt strategy, the Artisan's Emerging Markets Local opportunity strategy, a local currency emerging market debt strategy, and the Artisan Global Unconstrained strategy, a global macro portfolio. As shown on Slide 2, we now offer clients six differentiated credit strategies. Consistent with who we are, we have focused on high value-added asset classes characterized by attractive absolute return potential, large investment opportunity sets allowing for alpha and differentiation, long-term demand from sophisticated asset allocators and attractive economics consistent with the value we can deliver. 2022 may appear to have been an inauspicious time to launch 4 fixed income-oriented strategies, but we have never attempted to time the market with new teams or new strategies. Once we launch, we are patient, maximizing the investment team's time spent investing, establishing a track record. For the trailing 5-year period, Lipper ranks the Artisan High Income Fund as the number 4 fund out of 338 high-yield funds. In addition, unlike many high-yield managers, the Artisan Credit team invest opportunistically and at times significantly in floating rate levered loans. The Artisan Credit opportunity strategy, which now has a 5-year track record, provides the investment team additional degrees of freedom, greater concentration, more distressed and less liquid credits, shorting and private investments. As an additional reference point, since 2017, we calculate the middle markets private lending has generated an average annual return of approximately 8% before fees with less liquidity. In order to provide clients access to the investment team's credit picking skills with minimal duration risk, we launched the Artisan Floating Rate strategy at the end of last year. We also further developed the team's leadership, promoting Seth Yaeger to Co-Portfolio Manager of the floating rate strategy. Since establishing the Artisan Credit team 8 years ago, we have consistently grown the team's business over time, raising almost $7 billion in cumulative net flows. As the team became more established at Artisan and extended its track record, we have diversified the business with institutional allocators and separate accounts, which remains a focus. The weighted average fee across the team's AUM is 64 basis points, reflecting the team's value production for clients and demand for scarce alpha. Looking forward, we believe the Artisan Credit team has the leadership, breadth and depth of talent, resources and ambition to become a multidimensional credit franchise, managing an array of high value-added strategies, vehicles and investments. Future strategies may offer amplified participation in a particular theme or a subset of investments, such as a dedicated distressed or dislocation strategy or co-investment opportunities. The team also has the capability to expand further into private investing and to manage structured vehicles, which would expand their client base into insurance and bank balance sheets. Slide four summarizes the three strategies managed by our second fixed income team, the EMsights Capital Group. Since inception, on May 1, emerging market debt opportunities has outperformed its index by 735 basis points after fees. Since inception on April 1, Artisan Global Unconstrained has generated a 2.51% return after fees, a positive absolute return during a period in which most global markets have declined significantly. We are still very early with the EMsights Capital Group, but we believe this team has enormous potential to generate differentiated returns and build a high-quality, sizable business. Our build-out of differentiated credit capabilities is similar to the development of our global strategies and distribution between 2005 and 2013, and our high degree of freedom strategies beginning in 2014 and continuing to today. The strategies we launched during our globalization phase account for approximately $42 billion of our current AUM, and run rate revenues of approximately $234 million. Once we invest behind new talent and strategies, we are disciplined in seeing these investments through with operational and distribution alignment. As shown on Slide five, since 2012, we have grown from 5 to 10 investment teams, from 12 to 25 investment strategies. And from only public equity to now include long/short equity, high-yield credit, long-short credit, public private hybrid, emerging markets debt, and global macro. Because of our build, not buy approach, all of our investments run through our income statement, reducing short-term profitability. The P&L impact of current investments has been amplified by the market drawdown, pushing our adjusted operating margin from 45% a year ago to 33% for the prior period. Through the third quarter, the 60-40 portfolio was down 21%, the second worst performance since 1900. We have built our business and financial model with these periods specifically in mind, to be a source of stability for talent, clients and stockholders, to allow us to capitalize on the investment and business opportunities that present themselves in periods of heightened volatility, uncertainty and fear. More than half our expenses automatically adjust down with AUM, including the vast majority of investment team compensation. We have been through these periods before, our investment teams, our management team, our Board of Directors. Since our founding in 1995, there have been 12 calendar quarters in which the indexes, to which our strategies are compared, have declined by more than 10%. In 8 of 11 12-month periods, following a 10% drawdown, our firm-wide asset-weighted performance has exceeded benchmark performance. The three periods in which we underperformed were particularly sharp recoveries with clients and our firm benefiting from absolute returns of 31%, 23% and 59%. If you extend the time horizon and look at the following 3-year periods, we have outperformed 8 of 10 times, with performance averaging 308 basis points. If you reduce the drawdown triggered to 5%, there have been 23 such quarters since our founding, including all three quarters of 2022. We are well positioned as a firm to take advantage of opportunities that present themselves in times like these, whether it be talent seeking a better home or clients seeking a more stable partner. For example, total adjusted operating expenses have decreased $11.6 million on a year-to-date basis, despite investments in new investment teams and strategies, and investments made in people and technology to build operational capacity. Our single largest expense, incentive compensation paid to our investment and distribution teams decreased as a result of our variable expense model and was cut by 17% or $47 million in the 9 months of this year compared to 2021. While year-to-date market declines have been sharp, our financial model allows us to continue to focus on the long term rather than react to short-term market swings. Consistent with previous market cycles, we intend to be thoughtful and cautious with cost additions in the current environment, but we'll continue to execute on our growth initiatives and be opportunistic despite the impact on short-term results. These results give us confidence that our approach to long-term growth has historically served us well, with revenue and adjusted operating income, compounding at annual growth rates of 7% and 6%, respectively, over the last 10 years. Even with the recent pullback, our financial model has allowed us to generate operating margins in excess of 30% throughout market cycles. In addition, we have paid investors cash dividends of $31.47 per share since going public, representing an average 8% annual dividend yield. Global equity markets declined approximately 7% for the quarter, and 26% for the year-to-date period. As a result, our AUM declined to $120.6 billion at the end of the September quarter, down 8% compared to last quarter, and down 31% compared to the September quarter in 2021. Clients continue to reallocate away from risk during the quarter, resulting in net client outflows of $1.1 billion for the quarter and $4.6 billion for the year-to-date period. Year-to-date, average AUM has declined 14% compared to the first 9 months of 2021. Across all generations, AUM was impacted by declining global markets during the quarter and year-to-date periods. Year-to-date, adjusted operating expenses decreased 2% compared to the 9-month period ended September 2021. The $47 million decrease in incentive compensation expense, resulting from our variable cost structure, was partially offset by increases in travel as well as base compensation, technology and office space expenses to support future growth. Likewise, adjusted net income per adjusted share declined 11% for the quarter compared to the second quarter and declined 34% for the year compared to 2021. As previously announced, during the quarter, we closed on the refinancing of $90 million of maturing senior notes pursuant to an agreement executed in December 2021. During the quarter, we invested an additional $30 million of seed capital into new investment products and currently we have $118 million of seed capital invested in products that are building towards scale. Accordingly, we currently plan to retain a portion of the special dividend to fund future seed investments. Even with the investments in future growth, we continue to return capital to shareholders on a consistent and predictable basis through quarterly dividend payments. In accordance with our capital management policy, our Board of Directors declared a quarterly dividend of $0.56 per share with respect to the September 2022 quarter, which represents approximately 80% of the cash generated. In the fourth quarter, we expect the Artisan funds to complete their annual income and capital gain distributions. Based on current estimates and assumptions, we expect fourth quarter distributions to result in approximately $300 million of net client cash outflows from investors who choose not to reinvest their distribution. Obviously, with yields moving up and people matching that to their assumed rate of return, we think there'll be some asset allocation movement in the first half of next year. And given the mix of strategies that we have and our minds -- emphasis on equity and high value-added strategies and more risk appetite strategies, we need to see a little bit more of that to come back to get into a really offensive position. We held back 5% of the total cash generated last year, which reduced the special by about 25% had we paid out the full. But that would result in us holding back about $10 million, $12 million and then paying out 75% of the amount that we've held back for the special, which is right where we were last year. Certainly, the -- as we mentioned in the remarks that the Credit team really established a strong foothold in the wealth channel or our intermediary channel, and we built up a very diverse client base. But as you've heard in the past that we -- basing each team off their revenue share, and we look a lot at the right clients on the right terms and build a broad client base, and we like to extend the duration of that client base as much as possible. And then obviously, the newer strategies are in the earlier stages and we don't have the same focus and restriction on those asset bases for those strategies. And as you've seen in our history, our mindset is to find the high-quality teams and then see those through their first couple of years and build a strong team, a strong foundation and a strong asset base."
}