{
    "symbol": "INPX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 17:55:24",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to Inpixon’s First Quarter 2022 Business Update Call. Thank you for joining today's conference call to discuss Inpixon’s corporate developments and financial results for its first quarter ended March 31, 2022. With us today are Nadir Ali, the company's CEO; and Wendy Lenderman, the company's Chief Financial Officer. Today, Inpixon released financial results for the first quarter ended March 31, 2022. If you have not received Inpixon's earnings release, please visit the company's investor relations page at ir.inpixon.com. Some of these risks are described in the Safe Harbor section of today's press release and the periodic reports, the company files with the Securities and Exchange Commission. In addition to supplement the GAAP numbers, the company has provided non-GAAP financial measures in our discussion. I will now turn the call over to Nadir Ali, Inpixon's CEO. So first of all, I'm pleased to report that Inpixon’s strong growth trajectory has continued through the first quarter of 2022 across multiple fronts. We saw a 77% increase in revenue over the same period of last year, primarily driven by an increase in sales related to our Indoor Intelligence segment, and particularly our enterprise employee experience app. We also saw continued high gross profit margins in the 73% range, and we expanded our customer base as compared to the same period last year, leveraging our indoor intelligence products to drive enhanced more connected employee experiences and smarter safer, more secure work environments. So today what I want to do is talk about where we are focusing our attention, both in order to capitalize on where we see the greatest opportunities, and also to address some of our challenges. It's the number one thing that keeps me up at night, because I know we're executing on the business. And yet it's not reflected in the stock price, given all of the macro economic trends that are happening. Let's control what we can, and that a lot of what is happening has nothing to do with us. Right, the overall market and tech stocks, in particular have been hammered by a number of macroeconomic headwinds, including the war in Ukraine, COVID-19, supply chain challenges, inflation, increasing labor costs, etc., etc. And as I said, what we're seeing isn't unique to Inpixon, or even to microcap companies. So that is where what the reality is, we believe the trends are what we're seeing in our stock price doesn't really reflect the successes we've realized in the execution of our business plan, or the opportunities in front of us. I certainly believe that growth, and you'll hear this from a lot of analysts as well, the growth and value stocks like Inpixon are an opportunity. But while we're on the subject of stock price, I do want to just make sure everyone knows that in terms of our NASDAQ listing, we did receive a letter from NASDAQ on April 26, 2022, granting us an additional 180 calendar day extension. All right, so let's go on to the opportunities and what really is happening with the business. Our Indoor Intelligence segment has really two drivers of growth, for redefining experiences, and bridging the gap between our digital and physical worlds. This includes our CXApp acquisition from last year, the events business, executive briefing, business, etc. And that includes the most recent acquisition of IntraNav in December last year, on the front end, coupled with the hardware from our sensors, tags, chips, etc., that we've been building over the last couple of years. So I want to touch on a few of these trends, and how that's affecting our business and why that's driving the growth that we're seeing. And these are somewhat intertwined, although remote employee experience is also important and something that our employee experience app does help address to create equity across, employees that are in the office versus working remotely entirely. So when you think about back-to-office and the employee experience, there's a few things that are going on. Obviously, we don't know, it's debatable whether the pandemic has ended, or if we’ve moved on to an endemic status, some people might say. In terms of number of days, you might be in the office or 100% remote versus in the office locations. People are working from various locations, and there's a lot of moving going on. And we believe they're necessary in a post-pandemic world, right. Some of the other things that are going on, ABC News reported more than 47 million Americans quit their job last year, the most ever on record. Harvard Business Review recently published an article by Unisys a couple of weeks ago saying exit interviews revealed that a lack of technology, that enables seamless communication and collaboration among teams is often a factor in resignations. They said in a historic shift, employees are abandoning companies that don't prioritize the employee and user experience. Or more specifically, they're ditching the leadership that doesn't provide the technologies and infrastructure required for their workforce to succeed in this new digital workplace. Talent acquisition and retention can be one of the most significant challenges a company faces, and those that choose to value their employees are the one that will succeed. That will get you the results in terms of the products, in terms of the profitability, in terms of your customers, etc. So the companies that are focused on that, those are the types of companies that are our customers, that we want as customers; companies like Adobe Aruba, Warner Media, Pfizer, Clorox and many more. Our enterprise app platform delivers to these modern enterprise organizations that are focused on its people by providing a smart, innovative and connected space, with technologies that provide end-to-end logistics management tools, analytics for the workplace, for events, and customer experience programs. Over the last few years, the effects of the pandemic have created some challenges, with customers adjusting open data as a result of various COVID-19 variants that have emerged. We believe we deliver the best employee app experience in the market today, from news feeds to surveys to polls and notifications, we're simplifying the modes of employee communication, and making it simpler and easier for employees to communicate -- employers to communicate with their employees and for employees to find, communicate and connect with each other no matter where they may be. And they want a platform that's rich, with lots of features that's already integrated with all their existing enterprise software. They also want something that's easy to scale globally, right. So our platform allows customers to start with one campus, and then scale quickly by adding additional campuses, desks, rooms, and buildings all within the same app. This also provides management visibility in one location or across all the locations to better understand what's happening in their space, space utilization and how better to serve their employees. Today, our enterprise solutions are driving experience for employees in roughly 300 campuses across more than 50 plus customers, and in a number of countries globally. And this is part of what's going on here, right. And certainly the other segment of our business has onetime sales, but the reoccurring revenue that we start building in with these customers is very key. And as these customers expand I touched on this last quarter, we're seeing that we land, we start with one campuses or a few campuses. But after initial deployment, we're seeing our bookings with these customers increase by 89% within the first year, right. And so we're seeing for every 100,000 for example, 89,000 in additional bookings that we're receiving. Hybrid events is another piece that I've touched on in the past, but it's important to bring up here. So whether it's an executive briefing event with 50 people or an industry conference with 50,000 people, they're almost all turning hybrid. And they're looking to use product like Inpixon’s award winning event platform to deliver the best possible experience for attendees in person, or online. And again, all of these products use -- the enterprise solutions use our products across the board, right. So whether it's the maps, whether it's the analytics, whether it's the on-device positioning, they're all integrated, and delivering towards a complete solution. So I want to talk about another trend here, the third trend on the industrial automation side, right. We're in the middle of what's being called the fourth industrial revolution, focused on internet connectivity, automation, machine learning, AI, and real time data, with more changes in innovation coming just behind all of this, right. It's all about the data and the intelligence that you get from the data, we refer to as indoor intelligence, if you will. And as Accenture puts it, it's by bringing new life to physical machinery and connected products, allowing us to digitize manufacturing and operations, right. So with all these new technologies, with 5G coming in, it's all becoming more and more of a reality today. And winners using this technology will design things smarter, engineer things safer, manufacture things faster, service things remotely, and produce things sustainably, making everything better. We have a breadth of software and hardware products that make up our RTLS solutions, and make us -- and give us a differentiator in this space. Inpixon’s location aware enterprise class multi-technology RTLS solutions are helping organizations deliver on the concept of smart factories, smart warehouses, paperless factories, smart yard management, digital supply chains, and the list goes on and on. Finally, I want to just touch on one other trend that is in the news a lot and we haven't touched on today is obviously the metaverse and the extended reality that encompasses. So a lot of the focus of extended reality, which includes augmented reality, virtual reality and mixed reality. So from digital twins that you upload into the metaverse, to the use of augmented reality and business operations, from factories to hospitals, to entertainment venues, the opportunities to profoundly improve business activities is tremendous. We can leverage our proprietary technologies and skilled employees in the areas of hardware design, software development, wireless communications, mapping, positioning, augmented reality, computer vision, 3D rendering, visualization, etc., for delivering on what our customers need in the metaverse, right. So we have lots of different ways that we're able to help our customers not only improve the employee experience, but also help them launch into the metaverse. So the way in which our technologies are aligned with all of these huge market trends that we just talked about, I believe positions us well for what we think will be continued substantial growth in markets that are only just beginning to gain traction. But before I do, I'll just note that we achieved $5.2 million in revenue during this first quarter of ‘22 which as I mentioned earlier is a 77% increase compared to the same period of ‘21. And we've seen a generally consistent revenue growth rate over the last two years, primarily due to the execution of our growth strategy, which is a combination of organic revenue growth, and the addition of newly acquired complementary products and technologies aimed at ensuring we could offer our customers a one-stop-shop, if you will, for their indoor intelligence needs. While we're still open to continuing to explore strategic acquisitions to enhance your business, we've got all the foundation technology pieces already in house, and we're anticipating continued strong revenue growth, but now with a primary focus on the organic growth over the acquisition growth. All right, so with that, I'd like to now turn the call over to Wendy to discuss our financials. Revenues for the three months ended March 31, 2022 were $5.2 million, compared to $3 million for the comparable period in the prior year, for an increase of approximately $2.3 million, or approximately 77%. This increase is primarily attributed to the increase in indoor intelligence sales, particularly the addition of the CXApp product line during the second quarter of 2021. Gross profit for the three months ended March 31, 2022 was $3.8 million, compared to $2.1 million for 2021, representing an increase of about 86%. The gross profit margin for the three months ended March 31, 2022 was 73%, compared to 70% for the three months ended March 31, 2021. Net income or loss attributable to stockholders of Visualix for the three months ended March 31, 2022 was a loss of $11.2 million, compared to a loss of $12.6 million for the comparable period in the prior year. This decrease in loss of approximately $1.3 million was primarily attributed to the increased gross profit of $1.8 million, lower operating costs of approximately $26 million and higher non-controlling interests of $24 million offset by the $1.5 million unrealized loss on the Sysorex shares. Non-GAAP adjusted EBITDA for the three months ended March 31, 2022 was a loss of $8.8 million compared to a loss of $5.6 million in the prior year period. Non-GAAP adjusted EBITDA defined as net income or loss before interest, provision for income taxes, depreciation and amortization, plus adjustments for other income and expense items, non-recurring items and non-cash items including stock-based compensation. Pro forma non-GAAP net loss for basic and diluted common share for the three months ended March 31, 2022, was a loss of $0.07 per share, compared to a loss of $0.08 per share for the prior year period. Non-GAAP net loss per share is defined as net loss per basic and diluted share, adjusted for non-cash items including stock-based compensation, amortization of intangibles, onetime charges and other adjustments, including loss on the exchange of debt for equity, unrealized gains or losses on notes and acquisition costs. As of March 31, 2022, we have approximately $75.9 million in cash, cash equivalents and treasury securities. So we're currently seeing the most traction with our enterprise app solutions, which, given the return to office environment that we're in makes sense. So indoor intelligence is obviously in terms of our business segments, the one that's seeing the most growth. As I mentioned, they're at risk, if they don't, right. We've seen what can happen with this great resignation going on, when you don't prioritize the employee experience. So enterprise apps is definitely allowing us to build tremendous growth, with increased recurring revenue streams and more value for Inpixon shareholders. So this was, done to and completed to really clean up some of the restrictions -- challenges related to those prior warrants, which would then allow us to more easily execute a strategic transaction if and when appropriate. And in fact, we're already integrating our Chirp technology into the IntraNav IoT platform because we see a strong opportunity for Chirp in what's referred to as the yard area. And as we discussed earlier, we see strong potential for growth in the IoT sector, right. And there's, there's a lot of spend in the industrial verticals. In fact, we're just featured to speak at the Logistics Day event, put on by BVL, the German logistics Association next week. But as you'll see, we're still seeing growth despite that. As I said, we're focused on executing and growing the business. Ladies and gentlemen, this does conclude today's teleconference."
}