{
    "symbol": "INPX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 20:07:03",
    "content": " This includes any projections of earnings, revenues, cash or other statements relating to the company's future financial results, any statements about plans, strategies or objectives of management for future operations, any statements regarding completed or planned acquisitions or strategic partnerships and the anticipated impact of those transactions on the company's business, any statements concerning proposed new products or solutions, any statements regarding anticipated new customers, relationships or agreements, any statements regarding expectations for the success of the company's products in the U.S. and international markets, any statements regarding future economic conditions or performance, including, but not limited to, the impact of COVID-19 on the company's operations, any statements regarding the valuation attributed to any of our securities instruments, any statements of belief and any statements of assumptions underlying any of the foregoing. We regained compliance with NASDAQ's bid price requirement, and we announced the signing of a definitive agreement for the spinoff and sale of our enterprise apps business to KINS Technology Group in a transaction that will deliver shares of KINS capital stock based on a pre-transaction value of $69 million to holders of Inpixon securities as of a record date to be announced. Revenues for the 3 and 9 months ended September 30, 2022, were $4.2 million and $14.1 million, respectively, compared to $4.5 million and $10.9 million for the comparable period in the prior year for a decrease of approximately 6% and an increase of approximately 30%, respectively. Gross profit for the 3 and 9 months ended September 30, 2022, was $2.9 million and $10.1 million, respectively, compared to a gross profit of $3.3 million and $7.9 million in the 2021 reflective period, representing a decrease of approximately 10% and an increase of 28%, respectively. Net loss attributable to stockholders of Inpixon for the 3 and 9 months ended September 30, 2022, was $17.6 million and $48.7 million, respectively, compared to $33.6 million and $31.4 million, respectively, for the comparable periods in the prior year. This increase in loss was primarily attributable to lower gross profit, a $7.6 million goodwill impairment and other noncash items, including unrealized net loss on equity securities offset by decreased operating expenses in the 9 months ended September 30, 2022. Non-GAAP adjusted EBITDA for the 3 and 9 months ended September 30, 2022, was a loss of $8.2 million and $26.9 million, respectively, compared to a loss of $6.7 million and $18.5 million for the prior year period, respectively. Pro forma non-GAAP net loss for basic and diluted common share for the 3 and 9 months ended September 30, 2022, was a loss of $3.96 and a loss of $13.44, respectively, compared to a loss of $3.77 and a loss of $13.68 for the prior year period. As of September 30, 2022, we had approximately $53.2 million in cash and cash equivalents, which amount was offset by payments of approximately $45.8 million related to redemption of shares of our Series A preferred stock and increased by $15 million in gross proceeds received from the sale of securities subsequent to the end of the quarter."
}