{
    "symbol": "GGG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 17:39:01",
    "content": "  Operator: Good morning, and welcome to the first quarter conference call for Graco Inc. Graco has additional information available in a PowerPoint slide presentation, which is available as part of the webcast player. During this call various remarks may be made by management about their expectations, plans and prospects for the future. Actual results may differ materially from those indicated as a result of various risk factors, including those identified in Item 1A of the company's 2021 annual report on Form 10-K and in Item 1A of the company's most recent quarterly report on Form 10-Q. Beginning this quarter, our high-performance coatings and foam product offerings, historically included within the Industrial segment were realigned and are now managed and reported under the Contractor segment. The change will allow business leadership to address the overlap in markets, products, end users and distributors for all of our contractor focused businesses. Yesterday Graco reported first quarter sales of $494 million, an increase of 9% from the first quarter of last year. After adjusting for the impact of excess tax benefits from stock option exercises, net earnings were $99 million or $0.57 per diluted share. At current costs and volumes, we expect that our 2022 pricing actions will offset these input cost pressures on a dollar basis and result in a modest gross margin rate improvement in the second half. Total operating expenses increased $7 million in the quarter, which includes a $3 million charge for the full exposure of our receivables in Russia and Belarus. The adjusted effective tax rate was 19% for the quarter, which is comparable to the first quarter of last year. Cash flows from operations totaled $31 million a decrease of $70 million from last year, mostly driven by an increase in annual incentive payments and inventory purchases to meet demand levels. During the first quarter, we repurchased 1.5 million shares for $109 million, which will largely offset our dilution in 2022. As I mentioned earlier, we prepaid $75 million of our private placement debt. Finally, our full year estimates for currency impacts unallocated corporate expense tax rate and capital expenditures can be found in the conference call slide deck on Page 11. In Contractor, North America and Asia Pacific remained positive but EMEA saw a decline in the quarter driven primarily by limited product availability due to component shortages for large paint sprayers. Long lead times in key materials and components such as electronics, castings, engines and motors resulted in a 19% increase in our backlog from the end of last year. Our consolidated backlog was approximately $445 million at the end of the first quarter, which is $70 million higher than what it was at the end of last year. However, as expected due to the size of our year-end backlog, which is at last year's pricing, we did not realize its full impact during the quarter. Therefore, we should see a greater impact from pricing on profitability for the remainder of the year. At current costs, we believe that our pricing actions will be enough to offset cost pressures from inflation on a dollar basis. After a very strong first quarter last year, the Contractor segment was up low single digits in the quarter. We were heavily impacted by component shortages for our large paint sprayers, which primarily serves our North America and EMEA customers. Our incoming order rates have continued to grow in all product lines resulting in a backlog of over $100 million, which is up 20% since the end of last year. While mortgage interest rates have increased recently, contractors remain busy. We believe that our 2022 pricing actions largely implemented in the quarter, along with improved product mix should positively impact profitability in Contractor for the remainder of the year. Sales remained strong in all major geographies with solid demand in many product categories such as liquid finishing, powder coating and sealant and adhesive equipment. We are still facing component and logistical constraints, which have contributed to an increase in backlog of $24 million compared to the end of last year and $75 million compared to the same time last year. We saw continued strength in demand for worldwide lubrication equipment, process pumps and semiconductor products. However, we are keeping a close eye on how economic and geopolitical conditions may impact the balance of the year. Michelle, we're ready for questions. Please state your question. So in 2021, our backlog across all of our businesses grew about $50 million. This quarter as Mark mentioned, the number is $70 million. And look, we're used to, this is the playbook for Graco is to put the price through annually in January and it takes a bit for that price realization to read across. Yes, without getting into like real specifics, because it does vary based on the businesses and the geographies that we participate in. And there are obviously some customers that push back, but I would say generally speaking no one was surprised by what we did and the pricing increases and the actions that we've had have been received kind of in line with what we had expected. Please state your question. Obviously, our numbers we haven't really seen, a whole lot of that happening in our Industrial businesses. So, that's one area that we're keeping a close eye on, and the second one is China. I would add that we're tracking interest rates, of course. And while there's not so much we can do, but -- on the issue of foreign exchange, so far that's been a modest headwind for us. So, then on the capital deployment side, maybe just some thoughts, I know you guys have elevated internally how you're thinking about the M&A side of things. I mean for sure, we've put it on the radar for our teams that we'd like to see a little more activity on external growth as an organization. They make sort of high-purity fluid-handling valves and cylinders and spray guns and things like that, so it's a nice complementary business for that particular segment. It's small, so it's not like going to move the needle, but I would say that we're hoping to have a little bit more growth out of M&A here over the next five years or so during our planning horizon. So, I think, that in terms of the financial capacity for the company, the acquisition activity that Mark is talking about, we have good dry powder for that. And I think that, we will be following the movements in stock price closely, as we always do. And in the event there are opportunities based on pricing, I think, that we won't be shy about taking steps that we think are consistent with our long-term value approach. As I think you know, we do track our stock purchases on an ROI basis. And there are times in markets when industrial companies trade at a bit of a discount and we want to be ready, if and when that opportunity presents. Your line is open. I was wondering if you guys might -- it would be helpful if you're able to somehow parse out a little bit maybe in Q1, how much of the headwind you saw to operating earnings was driven by unabsorbed inflation versus some of the mix challenges you've been referencing throughout, Mark. And if Kathy wants to chime in, I'll let her do so, but I think at a high level, like we said in our opening comments, we're really covering the price cost right now with our pricing actions and looking at the costs that came in, in the first quarter. So in particular, when you look at the Contractor business, which is really where you saw the margin rate come down pretty substantially, it was -- the majority of that decline was really driven by the mix of the products that they sold in the quarter. And hopefully, as we work our way through the year, those trends equalize. Yes, I think, that's right. Anybody that follows the industry knows that, getting electronic components, which is really mostly what we're talking about, the chips and then the motors too, is still challenging for us. And I have high confidence that we're doing everything that we can, but we haven't seen a meaningful shift, I would say, in terms of our ability to get components in here. We are shipping those products out, but we'd like to be able to do it at a much higher rate as possible. And then, on the Industrial side, I mean, yes, they've had tremendous earnings growth here in the quarter and really good leverage. And I don't see any real reason why, as long as they can continue to put points on the board on the top line that the bottom line should really suffer from here. Your line is open. Hey, just on these kind of components that are short supply, particularly Contractor that's delaying kind of shipments on the large sprayers. It hasn't gotten worse, but it hasn't really gotten better either. So I think, it's sort of the same as what we were experiencing in Q1. And I'm just wondering, what your confidence is that this kind of Jan one price increase captures all that inflation. Yeah, I'd say, right now we're in good shape. And beyond right now, I don't have great visibility into what's going to happen three, six months from now. I never like to say never, about anything, but for now I think we're going to stick with our current plan. I would add when we look at the impact of pricing in the first quarter on our actual business, I've been impressed with the realization that we've seen. And when you consider that, at the same time we were working through a big chunk of our December 2021 backlog, I think that's particularly impressive. So, I'm feeling very good at the moment about, how pricing is going to contribute to results over the balance of the year. And then just last one, on Contractor. If you look in the orders -- because I understand volumes were probably -- unit volumes were, probably negative but seems more of a supply than a demand issue. I mean, orders were solid in the quarter. Your line is open. And specifically like in terms of managing inventory and the pricing dynamics, as it relates to this table that you guys present every year about how 40% of your sales have average number of units sold zero to one a day. I mean, I think the pricing actions that we took in Industrial are being realized and they're showing up in the incremental margins. So, so far this year, I think they're on very solid footing. And is it fair to say for the Process segment as well, like same type of dynamics playing out. It's more or less the same, kind of sell through distribution, industrial end-markets, complex product lines, but it's something that we also feel pretty good about right now. I mean, I think that -- I was just going to say yes. The -- I mean, it's not that pricing power is unlimited. So, it is part of the overall company's value proposition that, yes as -- we strive and -- to do a good job with the customer service and deliveries. And over the long haul, we think that has justified perhaps the premium you see on many of our products. So for the Industrial, when you see kind of an eye-catching 36.4% operating margin over 60% incremental margin that's – you do think that, that is somewhat sustainable as long as the volumes are there, right? I think, they're in really good shape. Your line is open. Yeah, it's hard to know exactly what would have happened, but for sure we would have shipped a lot more product out the door, because we've got large backlog in Contractor. And our team there is doing everything they can to get as much product out the door as they can every single day, while chasing a lot of these component shortages. In terms of whether things have gotten different from the end of the fourth quarter, I would probably say not really. I mean, I think that, even at the end of last year we were faced with a lot of these challenges. And when we started, knew going into the year that this could be an ongoing situation. We've got our engineering teams looking at alternative ways to manufacture the products to get more products out the door, so very confident that we're doing all hands on deck and everyone is working hard on those issues. I think we think they're going to stay kind of where they are for a while, but hopefully by the end of the year, we start to see things loosen up a little bit. All right, well thank you very much for participating in today's call."
}