{
    "symbol": "GGG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 00:43:19",
    "content": "  Operator: Good morning, and welcome to the second quarter conference call for Graco Inc. If you wish to access the replay for this call, you may do so by visiting the company's website at www.graco.com. At the request of the company, we will open the conference up for questions and answers after the opening remarks from management. During this call, various remarks may be made by management about their expectations, plans and prospects for the future. Actual results may differ materially from those indicated as a result of various risk factors, including those identified in Item 1A of the company's 2021 annual report on Form 10-K and in Item 1A of the company's most recent quarterly report on Form 10-Q. I will now turn the conference over to Kathy Schoenrock, Executive Vice President, Corporate Controller and Information Systems. Good morning, everyone, and thank you for joining our call. Yesterday, we reported second quarter sales of $549 million, an increase of 8% from the second quarter of last year. The effect of currency translation rates was a substantial headwind in the quarter on both sales and earnings, decreasing sales by 4% or $15 million and decreasing net earnings by 8% or $7 million. At current exchange rates, we expect the full year unfavorable effect of currency translation to decrease sales by 3% and earnings by 7% with the impact in the second half being similar to what was experienced in the second quarter. During the quarter, material costs accelerated from the already elevated levels of the previous year. Given the cost increases we are experiencing, we are implementing interim price increases across all segments and regions. At current costs and volumes, we expect that our 2022 pricing actions will offset the input cost pressures on a dollar basis. Cash flows from operations are $135 million for the year, a decrease of $85 million from last year, mostly driven by annual incentive payments made in the first quarter and increased inventory purchases to meet demand. For the year-to-date, we have repurchased 1.7 million shares for $120 million, which will more than eliminate dilution in 2022. We also prepaid $75 million of our private placement debt, made capital expenditures of $89 million with $48 million related to facility expansion projects and had dividend payments of $71 million. Finally, our full year estimate for unallocated corporate expense and capital expenditures can be found in the conference call slide deck on Page 10. Thank you, Kathy, and good morning, everyone. In Contractor, North America remained positive, but EMEA and Asia Pacific saw declines in the quarter. Product availability remained challenging in Contractor due to component shortages, and labor constraints at our suppliers. Our consolidated backlog was $430 million at the end of the quarter, which is $65 million higher than at the end of last year and $190 million higher than the same period a year ago. While we are still experiencing regular supply disruptions, weekly material receipts have increased since the beginning of the year with 9 of our top 10 suppliers either improving their out-the-door performance or remaining consistent. Electronic components, board assemblies, electric motors, gas engines and certain castings remain bottlenecks. Despite these challenges, factory output was strong resulting in a $15 million decline in backlog from the end of the first quarter. Since 2018, we have invested $425 million to expand our global manufacturing capacity. These investments, combined with improving component availability, gives us confidence that we will be able to deliver enough products to reach our 2022 revenue outlook. Since commodity prices and component costs have continued to rise, we will be implementing another round of price increases starting this August. While we recognize the cadence is different than what we've done historically, our actions are not isolated given the current operating environment. After a very long strong second quarter last year and following several years of record growth, the Contractor segment was up low single digits for the quarter. However, contractors remain busy and forecasts for commercial construction and remodeling activity remain positive. In addition, we still have an elevated backlog of near $95 million, which is up 10% since the end of last year and is nearly double the same period a year ago. Despite the impact of the pandemic-related shutdowns in China, demand remains robust in multiple product categories. The Process segment grew sales 27% for the quarter, resulting in records for both revenue and operating earnings. We saw strength in worldwide demand for lubrication equipment, process pumps, environmental and semiconductor products. Our outlook for EMEA remains cautious due to softening economic conditions and geopolitical uncertainty, pandemic-related shutdowns in China also affected incoming order rates. With our backlog near record levels, plus the effects of our pricing actions, we are confirming our 2022 revenue guidance of high single digits on an organic constant currency basis, with growth expected in every reportable segment. In closing, I want to thank all of our employees for overcoming the many commercial and operational hurdles we have seen in this difficult operating environment. Operator, we're ready for questions. And I expect that internally, you all made a bigger deal out of this or anguished over it then the way we look at it from the outside because these are just extraordinary circumstances. And I know maybe legacy was keeping you a little bit hesitant on pulling the trigger, but it makes perfect sense. And then thank you for clarifying, you'll be back to the cadence and at Europe in January as well. Yes, Deane, it's Mark. We do like to make decisions based on facts and simply put a lot of our input costs accelerated since the beginning of the year, and we started to see what we call negative PPV, which is variance between what we planned our cost to be versus what they are actually coming in at. And that started to creep into the P&L, I would say, kind of in the latter half of the March month of the first quarter. And then as we start to work through the beginning of Q2, it became a little bit more meaningful. We looked at the facts really across the board, we were saying pretty substantial increases in a lot of the major components that we buy as an organization. And we recognize that by sharing that being transparent with our customers, and our distributors that we really had a good case to make to raise prices now versus waiting. Everyone participated, all the different business segments and all the different regions are all participating in the pricing actions that we're going to take. Well, I would suggest distributors don't usually complain that loudly, if at all. All right, but that's really good color. Can you comment on free cash flow and some of the dynamics there with higher inventory, buffer inventory and so because we're seeing that everywhere. But I think in Q2, we bought about 170,000 shares at -- I think we committed approximately $10 million or about $63 a share in purchase price. And I would add on that -- now on cash flow, we saw improvement in operating cash flow in Q2 versus Q1. One of the big investment items was the -- I'd say, the ongoing inventory build that we have been committed to as we work through our current environment in some cases -- in a lot of cases, the inventory levels are elevated because we're waiting for that exotic component that golden screw. And as we receive those chips, as we receive those screws and bolts and O-rings, we would -- in the normal course of business, expect that inventory level to normalize as the year rolls along. It was the lowest level since, I believe, around 2009 for you guys. So we had not only the cost pressures that we've talked about, but also the translation rates, the currency rates really knocked by, I think, about 100 basis points off of the gross margin this quarter. So that piece is obviously hard to manage, and there's not much we can do. But when we looked at the pricing actions that we're doing, it's similar to what we did last year from the standpoint. We looked at our PPV, which I referenced before, and we made an estimate of what that would look like for the balance of this year and then heading into, I'd say, like the first half next year. Obviously, if you're in the camp that thinks that inflation is going to moderate, costs are going to come down a little bit that should be beneficial to our gross margin rate. But if they stay where they're at and they -- even if they go up, that would be sort of neutral to the rate and maybe slightly negative if costs accelerate. No, I think that sums it up really well. I think that I would just add that on a dollar cost basis, we have -- we implemented the price increase at the beginning of the year. And on a dollar cost basis, I think you touched on it, Kathy, has kept -- the incremental pricing has offset those costs on a dollar basis. However, as Mark touched on, in Q2, watching where certain costs were certain prices for key components, we concluded that this was the time to make a further adjustment to make certain to increase the probability that we would continue to offset incremental costs with price on a dollar basis. Obviously, you did a little bit of buybacks in the quarter, but you still have a net cash position. Well, I think our -- I'll take a start here. As you know, we have a strong capital position and are in the position to move aggressively when we make the decision to do so. Yes, I think our priority this year was really to eliminate the creep, which we've done. And then as a go forward, we hope to be able to do that again on a regular basis, but David is right. Well, we don't have any targets or specific things that we try to run the business based off of. We're obviously in the early stages of trying to deploy an M&A strategy, which hopefully will absorb some of that and also increase our leverage in the process of doing that. And if we aren't successful there, obviously, we can look at share buybacks. But there's no targets or mandates or anything like that, that we're trying shoot for when it comes to balance sheet management. My own view is that the real test of, I'll call it, a financing strategy is how it performs in alternative real-world scenarios. As Mark said, we have an M&A program that we will willingly make investments in as we see good business opportunities. And as you've seen over the last couple of years, we're coming -- we are, I should say, in the middle of a major capital expenditure program that has already drawn several hundred million dollars investments, and we're not completed yet. So central to our evaluation of financial strategies is we don't want to -- certainly would not view it as a positive to interrupt any of our strategic plans in the event that underlying business conditions change in the short term, we would think that's a mistake. One moment for our next question. I just wonder things are so good right now, and we're starting to -- there are concerns around Europe and broadly recessionary scenarios. So again, we try to like to operate on facts. And when you look at what's actually happening, I mean, the orders are still coming in. But certainly, if you look at what's going on over in Europe with the geopolitical stuff that's happening over there and just overall forecast for GDP and industrial production being pulled back. But in the meantime, we're not stopping anything from what it is we're trying to do to grow the business here. We are managing the P&L pretty tightly, just making sure that we're making smart decisions. And if things change, we can adjust pretty quickly here. At Graco, we've got a good team, and we can turn on a dime if we need to. So I feel like as we sit here today, as you said, things are in pretty good shape. We have a huge backlog, and hopefully, we're able to put up the kind of numbers that we're targeting here for the year that everyone has got in their models. I think Europe is probably the biggest chunk of our -- I'm sorry, Industrial is the biggest chunk of our European business, and it's a nice profitable business for us. You've got the traditional Graco legacy businesses, which are our sealant and adhesive business and our liquid finishing businesses that typically go through a distribution channel and are sold to integrators and things like that. And then you've got our powder equipment business, which is the Gema business that we've had in our portfolio for 10 years or so now. And looking across those 2 segments, again, not to get too granular, but we factor all of that into our overall equation when we talk about outlook. And then as a part of that, you sort of roll it up and you look at, okay, what do we think is going to happen and the forecast and that's what get us to this high single-digit growth, including what's going on in Europe, Asia, China, Asia Pacific, everywhere. Personally, I do think that there's still plenty of project business going on over in Europe, speaking with the team over there, they're optimistic. No, I just was going to say, I think Mark gave a comprehensive answer the way I just would summarize, especially on the Industrial side, the breadth of demand for the business, for the segment, the segment continues to impress me, both geographically and served markets. I guess the margin capability, incremental margin strength of the business has been very solid, and it seems to have a good foundation, including the realized pricing that we've seen that series of businesses generate. And the quality of the backlog around the world, especially in that space and not to get too granular, is very good and very broad. And the mix of products, the mix of geographies is, I think, very solid. One moment for our next question, that will come from the line of Thomas Johnson with Morgan Stanley. Generally speaking, they have a good backlog of business that they're working through. They're busy, and they're working on all kinds of different projects, including commercial projects residential projects, remodeling projects. So we don't have great visibility into like exactly where our sprayers are used on a daily basis, but a good professional painting contractor really serves a fairly broad base of customers. And of course, the pro part of our product line is more profitable than the DIY part of line. You look at like at the home centers, foot traffic is down. You guys probably know that, but that's probably the one area in North America that I would be wanting to keep my eye on. And over in the regions, again, it's more of a professional product mix. There is some home center in Europe, but for the most part, again, similar dynamics. And so by using power equipment to do a job versus throwing manual labor to job, you're more efficient, number one, but you also have to worry about finding labor in a tight market. We'll see what happens, still bullish on that market long term. That ultimately will get caught up, and we think we're in a good spot. We're definitely not out of the woods yet, but things are in better shape. It's hard to know exactly how much higher the revenue could have been if we had gotten everything in that we wanted on time, but for sure, it would have been higher. If you look at just what's happened here since the end of the year, it's about $65 million of additional backlog, and we were at high levels when we started the year off. But hopefully, as throughput gets better, factories are up and running. We've got a lot of new machine tools, new equipment coming in, our throughput will be better, and we hope to really make a dent in that backlog here throughout the rest of the year. And then as a follow-up, is there any way -- I know in a typical, more typical year, you would typically go out and look for 150 to maybe 200 basis points of price. As we think about the price increase earlier this year, which is obviously, I'm sure considerably higher than that. And beyond that, I really can't help you. One moment for our next question. But the home centers you are seeing lower throughput, lower sell-through at the home centers. Well, I think that the sort of the data that we hear from our own team and some of the other stuff that's published is foot traffic in home centers is reported as being lower. And that, I think, has been evident for some months. On the pro paint side, just to underline a couple of Mark's points, when we talk to our own team as recently as earlier in the week, the professional -- contractors they check in with. They're very interested not just in labor savings, which we alluded to, but also they're very much even today hiring painters when they can recruit additional painters to help them. And it suggests a level of activity in that arena is going to be pretty good, I think, for the foreseeable future. Where are some areas where there could be some weakness, and I referenced the fact that the DIY, the low end, the consumer home center traffic, those things are things for us to keep an eye on. And maybe in a similar way contractor -- well, maybe this one. It's around 20%, 25%. Yes, yes, it's a nice sizable business. And it is, I would say, are largely a pro paint as well as protective coatings market, which gives it some level of presence in Eastern Europe, including markets like Russia and the Middle East. Well, thank you for participating in today's call. Before we conclude, I'd like to especially thank our manufacturing and purchasing teams here at Graco for delivering more products this quarter than any other quarter in our company's history. Manufacturing is definitely one of our strongest competencies, and it's been rewarding to me to see the teams rise to the challenge during the last 2 years, where we've had to battle some really ridiculous cost pressures and supply chain constraints. It was initially supposed to the last 5 days, I think it went more than 2 months. And once the restrictions were lifted, the team got back into business, we got orders, and they started to get product out the door and they really responded very quickly, which I'm very happy about. Finally, I'd like to acknowledge the efforts of our team in Europe."
}