{
    "symbol": "GGG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 16:09:04",
    "content": " Please state your question. Europe's been surprisingly resilient, given all the negative headlines and of course we got a big headwind with Russia and losing, I think it's somewhere around $30 million of revenue on a 12-month basis in Russian sales, but despite that the absolute level of activity there has been probably better than what we expected, we're all holding our breath a little bit for what's going to happen with this winter, with energy and all those other things, it's sloppy where everyone reads in the paper. Please state your question. So margin rates are higher on that stuff, they're more professional units, as I said in the comments that I think that the contractors feel like they're busy, they're still hard to find, pipelines are pretty good, so that's sort of a short-term thing that's going on right now. Please state your question. Yes, I think and that group in particular has been hit pretty hard on the cost increases, probably disproportionate to some of the other businesses they have a lot of electronic components that really go into all of their products and when you step-back and you run the math on our -- what we call, purchase price variance, which is the difference between what we thought, costs would be versus they actually are in our factories, the vast majority of that goes into that business outsized, compared to what their revenue is. And that leads us to on the share side and I think that we have been consistent in stating that we believe that it's wise to remain opportunistic, we believe that while Graco has got great investments and cash flow characteristics, because we serve markets that are cyclical in nature, the street rightly or wrongly uses as a cyclical and when you're cyclical in the market, there are opportunities to buy and when we see those, we like to think in the past over several years, we've been aggressive and that will continue to be our position. I think maybe some of that is due to the fact that we did some restructuring last year that I think we talked about where we put a couple of the groups together and I think we're just getting better leverage out of those teams, particularly on the contractor side and also on the industrial side, but we're not holding anything back there, we continue to make investments, we know that products are the lifeblood of the company and you shouldn't expect any changes. Please state your question. Our lubrication businesses are very good and in particular our industrial lubrication businesses, where we sell injectors and things in the machine tool industry and I think our product availability and our availability to serve customers is maybe a little bit better than some of the big competitors there, and I think that's one area where we have gained new accounts and once you have them, they are pretty sticky, so we're excited about that from a going forward perspective. Please state your question. The good news of all of the actions that we took or have taken this year is that nobody has really been surprised by them, we haven't really had any push back even from some of the larger partners that we have, so everyone understands that we do try to manage it a little bit, so like if we see an industrial distributor that's all of a sudden ordering a bunch of products and we can tie it to a project we may ask them about it and I know that our teams do push back on occasion, but my comments on the upfront are more of that we would expect in a normal situation when we were raising prices that there is a little bit of buy ahead. Yes, it's a good question, as we sit here today, when we run the math, we think we've really done a good job of offsetting the cost pressures that we have today that we're experiencing really over the next 12-months, but we don't have a great crystal ball on whether input costs are going to go up or down, they're just based on where things are today. Please state your question. Yes, we really don't -- itâ\u0080\u0099s hard to tell, because when you buy a paint sprayer at Sherwin-Williams store you don't really know where that thing is going to go, it could be on a commercial job when they are residential the next day, I would say that it's a good mix, we're having a broad exposure to a lot of different customers and end-markets and but getting granular in terms of the details is pretty tough. Please state your question. Please state your question."
}