{
    "symbol": "TDW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 10:43:16",
    "content": " Average day rates improved over $2,400 per day for the full year, a pace of improvement we have not seen during the past 20 years, and we expect that 2023 will reflect a full year improvement of over $3,000 per day. With Clarksons Research reporting new global one-year time charter rates for the largest PSVs at circa $24,501 per day levels compared to $15,131 per day in 2021 and one year time charter rates for large AHTSs averaging $33,456 per day compared to $23,427 per day in 2021. The team has remained very disciplined and has been very successful at pushing our composite fleet rate from $10,583 per day in Q4 2021 to $13,554 per day in Q4 2022, an increase of more than 28% across the whole fleet from our smallest crew boats to our largest vessels and almost double what we have seen achieved in previous up cycles. This region had a very strong year overall with significant day rate increases across all vessel classes with average day rates jumping from a composite fleet rate of $11,917 per day in Q4 2021 to $15,364 per day in Q4 2022. And as we look out to 2023 and beyond, the traditional lower season periods of Q4 and Q1, we again expect to see strong demand in this region for larger AHTSs and PSVs longer term with forward rates continuing to improve throughout 2023 for all vessel classes driven in part in Norway where we saw $27.2 billion of offshore oil and gas project CapEx being approved in 2022 for new projects and work out beyond 2025. Moving in to Africa where we have our largest fleet we saw a significant increase in activity across all the countries that we operate in during the course of 2022, which in turn led to an increase in our composite fleet rate of $9,052 per day in Q4 2021 jumping to $12,272 per day in Q4 2022, which is a 35% increase. During Q4 2022, we saw leading edge day rates for our medium class PSV in excess of $27,000 per day and our largest AHTS winning work on rates in excess of $32,000 per day. But as we've mentioned on prior calls this is a very large and competitive market with over 500 active vessels in the region, but which still continue to see strong levels of tendering from the NOCs during 2022 that enabled us to drive our composite fleet rate for the region from $8,217 per day in Q4 2021 to $9,498 per day in Q4 2022. In the Americas we again saw a significant improvement throughout 2022 with the fleet composite data rate jumping from $14,603 per day in Q4 2021 to $18,271 per day in Q4 2022. Outside of the Jones Act, we saw dayrates for our largest PSV class in excess of $35,000 per day during Q4 2022 and rates in excess of $35,000 per day for our largest class of AHTS during the same quarter. But we were still able to push composite fleet rates from $10,683 per day in Q4 2021 to $17,868 per day in Q4 2022, a 67% increase, most of which is due to the acquisition of the spot fleet earlier in the year. Operationally average day rates improved almost $2,400 per day for the full year and vessel operating margins increased by 10.5 percentage points, year-over-year. Vessel operating costs for the quarter were $115.5 million, an increase of $2.5 million from Q3 principally driven by higher repair costs and higher fuel costs, as we continue to mobilize vessels in and out of new contracts to achieve higher vessel margins. We generated $53.3 million of free cash flow this quarter, which more than doubled the Q3 amount, driven by strong cash from operating activities including increased accounts receivable collections as we began to monetize working capital resulting from prior quarter revenue increases. Day rates continue to increase as we saw a 7% increase to $12,272 per day in Q4 from $11,467 per day in Q3."
}