{
    "symbol": "JPM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-14 12:23:04",
    "content": " NII ex Markets was up $2.8 billion or 26%, driven by higher rates and balance sheet growth. NIR ex Markets was down $3.6 billion or 26%, largely driven by lower IB fees and higher card acquisition costs, and Markets revenue was up $1 billion or 15% year-on-year. Expenses of $18.7 billion were up $1.1 billion or 6% year-on-year, predominantly on higher investments and structural expenses, partially offset by lower volume and revenue-related expenses. With that as a backdrop, this quarter, CCB reported net income of $3.1 billion on revenue of $12.6 billion, which was down 1% year-on-year. Expenses of $7.7 billion were up 9% year-on-year driven by higher investments and structural expenses, partially offset by lower volume and revenue-related expenses. In terms of actual credit performance this quarter, credit costs were $761 million, reflecting net charge-offs of $611 million, down $121 million year-on-year, driven by card and a reserve build of $150 million in card driven by loan growth. Investment Banking revenue of $1.4 billion was down 61% year-on-year or down 53%, excluding the bridge book markdowns. Lending revenue of $410 million was up 79% versus the prior year, driven by gains on mark-to-market hedges as well as higher loan balances. Total revenue was $7.8 billion, up 15% year-on-year in both, fixed income and equities against a strong quarter last year. Security Services revenue of $1.2 billion was up 6% year-on-year, with growth in fees and higher rates more than offsetting the impact of lower market levels. Expenses of $6.7 billion were up 3% year-on-year, predominantly driven by higher structural expenses and investments, largely offset by lower revenue-related compensation. Revenue of $2.7 billion was up 8% year-on-year, driven by higher deposit margins, partially offset by lower Investment Banking revenue. Expenses of $1.2 billion were up 18% year-on-year, predominantly driven by higher structural and volume and revenue-related expenses. For the quarter, revenue of $4.3 billion was up 5% year-on-year, driven by growth in deposits and loans as well as higher margins, partially offset by investment valuation losses versus gains in the prior year. Expenses of $2.9 billion were up 13% year-on-year, largely driven by investments in our private banking advisory teams, technology and asset management as well as higher volume and revenue-related expenses. AUM of $2.7 trillion and overall client assets of $3.8 trillion, down 8% and 6% year-on-year, respectively, were predominantly driven by lower market levels, partially offset by net long-term inflows."
}