{
    "symbol": "JPM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-14 11:45:09",
    "content": " We had a record third quarter -- we had record third quarter revenue in Markets of $6.8 billion, we ranked number one in retail deposit share based on FDIC data, and credit is still healthy with net charge-offs remaining low. Expenses of $19.2 billion were up $2.1 billion or 12% year-on-year, driven by higher structural costs and investments. This quarter, CCB reported net income of $4.3 billion on revenue of $14.3 billion, which was up 14% year-on-year. Expenses of $8 billion were up 11% year-on-year, driven by the investments weâ\u0080\u0099re making in technology, travel, marketing and branches. In terms of actual credit performance this quarter, credit costs were $529 million, reflecting net charge-offs of $679 million, which were up $188 million year-on-year, largely driven by loan growth in card as well as a reserve release of $150 million in Home Lending. Record revenue of $3 billion was up 21% year-on-year, driven by higher deposit margins, partially offset by lower Investment Banking revenue. Gross Investment Banking revenue of $761 million was down 43% year-on-year, driven by reduced capital markets activity. For the quarter, revenue of $4.5 billion was up 6% year-on-year, predominantly driven by deposits and loans on higher margins and balances, largely offset by reductions in management fees linked to this yearâ\u0080\u0099s market declines. Expenses of $3 billion were up 10% year-on-year, driven by compensation, including investments in our private banking advisory teams, technology and asset management initiatives. AUM of $2.6 trillion and overall client assets of $3.8 trillion were down 13% and 7% year-on-year, respectively, driven by lower market levels, partially offset by continued net inflows. While weâ\u0080\u0099re not giving 2023 NII guidance today, you will recall that at Investor Day, we talked about a fourth quarter 2022 NII ex Markets run rate of $66 billion, with potential upside for the full year 2023."
}