{
    "symbol": "SO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 16:16:05",
    "content": " Georgia Power's share of the total project capital cost forecast reflects a projected increase of $201 million to fund the extension of Unit 3 and Unit 4 projected in-service dates to the end of the second quarter 2023 and to the end of the first quarter 2024, respectively, plus modest increases in the projected cost of resources to complete the remaining work and testing on Unit 4. Expected drivers for 2023 versus 2022, our continued growth in our state-regulated subsidiaries, including the contribution related to Vogtle Unit 3 going into service, offset by higher parent company interest expense including financing costs for Plant Vogtle Units 3 and 4 with costs in excess of $7.3 billion seemed reasonable by the Georgia PSC and share dilution, reflecting the full year impact of the mandatory conversion of our equity units in August 2022. Several upside opportunities inherent in the top end of our original range, like renewable and storage investment opportunities at both our state-regulated electric companies and Southern Power have been deferred to later years largely due to adverse market conditions, including more challenging, contracting requirements and global supply chain constraints. Adding the potential for Vogtle 4 to be completed at the end of the first quarter of 2024 which would have a negative $0.05 per share impact solely in 2024, we are providing an adjusted 2024 earnings guidance range of $3.95 to $4.10 per share. Our robust capital investment program continues to be driven by significant investment in our state-regulated utility businesses, our total base capital investment plan of approximately $43 billion which excludes the capital required to complete Vogtle Units 3 and 4 reflects a $2 billion increase in state-regulated utility investments relative to our previous five-year forecast. Thing one is just like we did with the $4 to $4.30, will further narrow this range as we get line of sight on Unit 4 and have our fourth quarter earnings call next year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}