{
    "symbol": "ARMK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-08 14:14:02",
    "content": " FSS International organic revenue grew 28% year-over-year and reflected notable improvement compared to the previous quarter, as Europe and Canada experienced improved activity levels in the Sports & Entertainment and Education businesses. As John mentioned, organic revenue in the quarter reached 92% of pre-COVID fiscal '19 levels compared to 65% at this time last year, with meaningful improvement across all segments. While this year-over-year performance reflected a continued steady recovery in pre-COVID base revenues, was also driven by the impact of pricing pass-through and the initial contributions from last year's record net new business as we began operations at those new client sites. The first quarter reflected a solid start to the year, and we are extremely encouraged by the upward trends of the business that included organic revenue improvement, cost discipline, effective cash management and notable new client wins. Based on our current view of the business, we maintain our previously stated full year fiscal '22 outlook of organic revenue growth between 23% and 27%, AOI margin of between 5% and 5.5%, free cash flow between 300 million and 400 million and annualized net new business in a range of 550 million to 650 million, which would represent at the midpoint 5% of prior year revenues and 3.7% of fiscal '19 revenues. As a company, we've implemented a number of meaningful initiatives across the businesses and have continued to build upon last year's momentum, which included record net new business. I'll talk about the self-op conversion process first, and that we are seeing an accelerating trend of organizations in multiple segments of our business continue to evaluate self-op conversion opportunities and that's happening in higher education and healthcare, in K-12 and in some very non-traditional markets, as we just discussed, and also in the facility sector."
}