{
    "symbol": "ARMK",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-15 15:15:09",
    "content": " Aramark's strong growth performance was broad based coming from multiple lines of business and geographies, as well as from clients with large and small, annualized gross new business went exceeded $1.6 billion, representing 10% of pre-COVID fiscal '19 revenues and retention rates were once again about 95% as we sustained a step change improvement. In client retention collectively, this resulted in $790 million of net new business, which is more than 50% higher than fiscal '21 and over eight and a half times greater than the company's historical five year average between fiscal '16 through fiscal '20. Our U.S. food and facilities segment delivered over $400 million of net new business more than 40% higher than fiscal '21 and about 20 times higher than fiscal â\u0080\u009819 driven by strong retention and significant growth new business wins, particularly in facilities, healthcare and corrections. John mentioned we signed an historic high of $1.6 billion of annualized gross new business in the year and our client focused field empowered approach delivered retention rates above 95% once again, resulting in record net new business levels. Performance is driven by strong net new business pricing pass through and ongoing recovery of COVID related volumes, which is just over 90% of pre-COVID levels for the year progressed each quarter from an estimated 85% in Q1 about 95% in Q4. As we've mentioned before, the significantly higher levels of new business we have delivered over the past two years tend to have a short term drag on margins due to the related startup costs and natural account profitability ramp. The year-over-year increase was the result of improved profit performance and slightly lower capital expenditures, partially offset by higher working capital related to net new business growth and recovering base account activity. We remain on track to reduce leverage below 3.5 times as mentioned at analyst day, and we believe we are well positioned to navigate the current environment with a net debt portfolio of more than 80% fixed rate instruments inclusive of swaps, no significant maturities until 2025 and over 1.8 million in cash availability of fiscal year end. We expect the components of growth to include 4.5% to 5% of net new business, 3% to 4% from recovery of COVID related volumes weighted to the first half of the year, and 3.5% to 4% pricing in any inflationary environment remains constant, as we partner with our clients to balance operating costs with quality service. This year, we achieved the highest annual revenue results in company history, more than doubled our AOI margin compared to last year, and realized the second consecutive year of record net new business performance exceeding the midpoint of our original targets by nearly $200 million. Your line is open. Your line is open. Well, there have been a number of actions taken over the last couple of years to drive this step change in terms of new business growth the first of which was, as you described working on the sales organization, adding resources, adding sales management expertise, and really giving the sales organization and the operating organization, the freedom to respond to customers, and develop proposals that are highly customized to meet their particular needs. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}