{
    "symbol": "GBX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-07 16:06:04",
    "content": " Following today's presentation, we will conduct a question-and-answer session. At the request of the Greenbrier Companies, this conference call is being recorded for replay purposes. At this time, I would like to turn the conference over to Mr. Justin Roberts, Vice President and Treasurer. Good morning, everyone, and welcome to our first quarter of fiscal 2022 conference call. Today I'm joined by Bill Furman, Greenbrier's Chairman and CEO; Lorie Tekorius, President and COO; Brian Comstock, Executive Vice President and Chief Commercial and Leasing Officer; and Adrian Downes, Senior Vice President and CFO. Following our update on Greenbrier’s performance and our outlook for fiscal 2022, we will open up the call for questions. In addition to the press release issued this morning, additional financial information and key metrics can be found in a slide presentation posted today on the IR section of our website. Throughout our discussion today, we will describe some of the factors that could cause Greenbrier’s actual results in 2022 and beyond to differ materially from those expressed in any forward-looking statement made by or on behalf of Greenbrier. Thank you, Justin, and good morning, everyone. Fiscal 22 is off to a good start, driven by strong commercial performance, disciplined management of our production capacity and continued growth of our railcar and lease fleet. As a result, Greenbrier posted its fourth consecutive quarter with book-to-bill ratio over one times. New railcar orders of 6,300 units were worth 685 million, were across a broad range of railcars. We ended the quarter with a backlog of approximately 3 billion, the highest level about three years. In addition, in a moment, our Chief Commercial and Leasing Officer, Brian Comstock will share more about this and some other exciting customer focused initiatives. Importantly, we are harnessing our flexible manufacturing footprint to extract more production from each line. Intensive management of safety, hiring and supply chain issues continue. Continued success in these areas is key to maintaining our strong start to the year, specifically on the supply chain, our global sourcing team continues to do an exceptional job of mitigating disruptions to support increased production. Naturally, this lowered our consolidated margins which were below our expectations to begin with. As we speak to the changes, we're making to improve the performance of our Maintenance Services business unit. Asset utilization, a key performance metric for the leasing business is high at 97.1% for the portfolio that is well-diversified across car types and strong lessee credits as well as maturity ladders. Additionally, we exceeded the initial investment target for GBX leasing by $200 million to a portfolio of $400 million in only nine months of operations. I'm sure there may be questions on this or other comments by management, but be sure to read the footnote in our press release, having to do with leasing supplemental information is very informative. As a result of well-established safety protocols, our operations have not been significantly impacted at present by the rising cases globally and in North America, but we are closely tracking the rapid community spread of this variant and we're taking all appropriate precautions. There are indications that the current variant carries milder symptoms than previous versions of the virus, particularly for those who are double vaccinated and those with boosters. After two years, the full contours of the pandemic remain dynamic and unpredictable. These are supported by industry metrics as well as operating momentum, driven by a strong order book, demand backlog and manufacturing ramping. For example, a portion of idle railcars in North America decreased to 32% in July to just below 20% by December. Industry forecast for 2022 and 2023 are very encouraging, as Brian Comstock will share with you. And again, Brian Comstock will add more on these points in a minute and we can talk in questioning and answering. Before I turn the call over to Lorie, I'd like to provide some closing remarks on where Greenbrier stands today. I became the CEO, when we were founded, when my partner and I cofounded a small asset leasing business in 1981. Today's manufacturing is our largest unit, comprising about 80% of our total annual revenues. But manufacturing is both driven and complemented by a robust commercial and leasing business, as well as asset management services. Today, our asset management Maintenance Services touch about one-third in the North American fleet. Greenbrier steadily grown industry footprint and today is the leading railcar manufacturer in North America, allowing us to operate and scale. We also now operated in four continents serving global railcar markets worldwide, with similar market shares issue this. All of this has been accomplished through the hard work of remarkable people without guidance through their capacity for innovation, discipline management, and unyielding focus on the needs of our customers, as well as our workforce, and other stakeholders. Under Lorie's administration, she plans to do more of that along with some new initiatives of row. As global railcar markets emerge from a cyclical trough, one that was really exacerbated by the pandemic. As Greenbrier continues to drive innovation as an industry, broaden its footprint globally and by product line and expand this leasing and services business. I also would like to congratulate two directors who served throughout almost the last 18 years to 20 years on our Board, Duane McDougall and Donald Washburn. Next week, we'll put out a brief congratulatory note marking this milestone, but I want to assure them that we remember them. I'll now turn the call over to Lorie Tekorius, Greenbrier's Incoming CEO. Lorie next time, you're going to be running this call. And before I get into the details on the quarter, you may have noticed and I think they'll reference that renamed two of our reporting segments. Greenbrier's fiscal Q1 reflected continued labor challenges in the United States, competitive pricing from orders taken during the depths of the pandemic troughs, and production and efficiencies from line changeover and ramping of capacity. I'm proud of our employees around the world that continue to perform well, even as uncertainty about. It is certainly an understatement to say that increasing headcount safely by several thousand employees, and increasing production rates by 40% to 50% is challenging. So with an experienced leadership team, we'll meet this opportunity to scale our operations all up keeping our workforce healthy and safe. And the quarter just ended, we delivered 4,100 units, including 400 units in Brazil. Deliveries decreased by about 9% sequentially, which primarily reflects the timing of syndication activity, and line changeovers in North America. Our global sourcing team continues to perform minor miracles on a regular basis, ensuring we avoid significant production delays. We've made a number of changes to our hiring and training practices, and we're seeing improved retention rate that maintenance cycle times can be 75 to 90 days. Further, this business was impacted by lower real change our volume. Between the portfolio assets and origination from Greenbrier, GBX leasing grew by approximately 200 million in the quarter. And as of quarter end, that fleet is valued at nearly 400 million, nearly doubling in value across the quarter. Importantly, this growth reflects a continued disciplined approach to portfolio construction, underwriting and credit quality standards. In addition to managing our lease fleet, our Management Services or GMS group continues to provide creative railcar assets solution for over 450,000 railcars in the North American freight industry. When other positive developments subsequent to quarter end, is that our leasing team successfully increased the size of our 300 million nonrecourse railcar warehouse facilities by 50 million to 350 million. Our Capital Markets team executed well this quarter, and we expect syndication activities to grow throughout the year, similar to our overall cadence of delivery. Looking ahead, we see strong momentum for fiscal 2022 and beyond. Thanks, Lorie, and hope everybody had a great holiday season as there's a lot to be excited about as we move forward. As mentioned in October, I remain excited about the momentum we are seeing in all of our markets globally. In Greenbrier's first quarter, we had a book-to-bill 1.5 reflecting deliveries of 4,100 units and orders of 6,300 units. New railcar backlog of 28,000 units with a market value of 3 billion provides strong multiyear visibility. In addition to new railcar orders, we recently received orders to re-body 1,400 railcars, as part of Greenbrier railcar refurbishment program. This program is an important part of our growing partnership with our customers to sustainably repurpose North America's aging fleet, to ensure that rail remains the most environmentally friendly mode of surface transport. As of November 30th, our modernization backlog included 3,500 units, valued at $200 million. In addition to our railcar refurbishment program, we announced another sustainable initiative, in early December, a collaboration between U.S. Steel, Norfolk Southern and Greenbrier for a new gondola using an innovative formula for a high strength, lighter weight steel developed by U.S. Steel. The work done by Greenbrier and our partner promises significant benefits to all three companies and the freight transportation industry as a whole, as we lead the way to a net zero carbon economy. In December, we also announced Greenbrier's joining of the RailPulse coalition. This has a potential to improve safety and operating efficiency, while providing enhanced visibility to customers, reinforcing rails competitive share of freight transportation. North American industry delivery projections saw an increase in nearly 49,000 units in 2022 and over 60,000 units in 2023, given the strong reduction in railcars and storage that continue to congestion as the pores, which is impacting traffic and overall economic growth. We believe, these projections are very reasonable and see similar dynamics in Europe. As you can see from our recently announced initiatives, Greenbrier's global commercial and leasing team remains focused on providing innovative solutions to our customers. Thank you, Brian, and good morning, everyone. As a reminder, quarterly financial information is available in the press release and supplemental slides on our website. Highlights for the first quarter include revenue of $550.7 million, deliveries of 4,100 units which include 400 units from our unconsolidated joint venture in Brazil. Aggregate gross margins of 8.6%, reflecting competitive new rail car pricing from orders taken earlier in the pandemic and labor shortages. Selling and administrative expense of $44.3 million is down 20% from Q4, primarily as a result of lower employee-related costs. Net gain on disposition of equipment was $8.5 million, like many leasing companies we periodically sell assets from our lease fleet as opportunities arise. Non-controlling interest provides the benefit of 5.2 million, primarily resulting from the impacts of line changeovers and production ramping at our Mexico joint venture. Moving to liquidity, Greenbrier has a strong balance sheet. As mentioned last quarter, our cash receivable spends at 106 million as of November 30, and we expect to receive most of these refunds in the second quarter of fiscal 2022. Liquidity also enables Greenbrier to invest in growth, as demonstrated by the railcar portfolio purchase in Q1 and the expansion of GBX leasing at a pace exceeding our initial announcement. Today, we announced the dividends are $0.27 per share, which is our 31st consecutive dividend. As of yesterday's closing price, our annual dividend represents a yield of approximately 2.3%. Since 2014, Greenbrier returns nearly 370 million of capital to shareholders through dividends and share repurchases. Additionally, you may have noticed an increase of approximately 70 million and Greenbrier's notes payable balance, when compared to the prior quarter. This non-cash increase is a result of Greenbrier adopting a new accounting standard, which simplified accounting for convertible notes and no longer requires the calculation of debt discount and associated equity components. Based on current business trends and production schedules, we're adjusting Greenbrier's fiscal 2022 outlook to reflect the following. Increase deliveries by 1,500 units, now to a range of 17,500 to 19,500 units, which includes approximately 1,500 units from Greenbrier-Maxion in Brazil. Gross capital expenditures of approximately 275 million in leasing and management services, 55 million in manufacturing, and 10 million in maintenance services. Gross margin percent is expected to steadily increase over the course of the year from high-single-digits in the first half to between low-double-digits and low-teens by the fourth fiscal quarter, as railcar's orders during the pandemic trough are delivered and conditions in the maintenance services business improve. We expect deliveries to continue to be back half waited with a 45%, 55% split. As reminders in fiscal 2022 approximately 1,400 units are expected to be built and capitalized into our lease fleet. As mentioned in the commentary earlier on the call, momentum continues to build in our business. I know on the last call, you were very clear about the timing of 1Q and that being the low point of the year. So, you're right, we always have very high expectations. But we did run into some headwinds in certain areas as they work through, as we said, orders that were taken during the downturn. And then we continue to face labor difficulties, particularly here in the United States to our facilities here in Portland, Oregon, as well as our operations in Arkansas. So, it's not only the impact of COVID, but it's also attracting and retaining the labor to be able to be efficient in our shops. To the degree that our margins were to lag, we expect as been indicated in guidance that our production rates will increase significantly than earlier guidance. So, I think it will certainly be offset. Our expectation is as we move across this quarter, I mean, sorry, across the year, margins will improve and get to that double-digit area. We've seen what's happened with COVID cases popping up, weather and others difficulties. So, I would say that, we always have high expectations, but I don't want to get into that quarter-by-quarter guidance. The operating momentum should drive the expectations, but I think the timing is really what's happened here, Justin. But again, we're going to have higher volumes than we expected before. And things are going well in manufacturing so there is a bunch of glitches is really ramping up, and I've already said earlier, that's not a seamless matter by just going very, very well. At the end of the day, we had a bit of a tail on orders coming out of the 2020 that moved into Q1. Looking beyond Q1, we don't have many of those orders left in the backlog. So, we start to get into what I call the newer price backlogs in Q2, Q3 and Q4. So, not a lot of tail beyond Q4, but certainly there was quite a bit of tail going into Q1, on some of the legacy price deals in the trough of the market. Yes, I would say, it's markedly improved. Now, I mean, the industry landscape looks really different from a couple of years ago. I know your gross margin peak in 2016 was 22%, but that was a highly anomalous time, deliveries from the crude by rail will probably not be repeated. Matt, it's a great question. And I think that's one of the things that keep many of us in this industry for a long time, because you never know what's going to happen. So, we certainly think that there is a lot of opportunities over the coming years. So, a lot of it depends on mix, we have had a really disciplined approach to how we're taking orders and thinking about things. So I could see margin getting into the upper teens, be excited if they were in the mid-20s, but a lot of that does come down to mix. And while our competitive landscape here in North America has changed a bit, we also have some very strong customers that pay attention to what they're investing and these are long lived assets. So, we also look at how many cars we want to build and sell versus we're building cars, and we can put them into a fleet, where we will see that repeatable revenue and cash flow over the coming year. So, it's a nice layering effect, and it's a good blend of different activities that we have here at Greenbrier. Just in terms of the industry forecasts, I think we can do remind everybody what those industry forecasts look like. Yes, I think that's good Bill just to kind of remind everybody that is as you look at the projections, in 2023, they're projecting 60,000 railcars will be billed. The other interesting dynamic, as you think about where the future is headed for rail is that the North American fleet continues to contract. I think we're in the 21st month of contraction, which means that there's a heavy, heavy scrap rate that is going on even while new cars are being injected into the system. So as you know, as we think about the future, as the chip situation resolves itself as supply chain starts to become more fluid, you're going to see more and more pressure in demand on the railroads to ship more and more products. So, 60,000 right now is the industry's best guess, but you can see that extend beyond 2023 as well as demand comes on as we think it will. And as the world continues to focus on carbon neutrality, zero emission goals things like that, we continue to believe that there will be a medium to long-term growth in the fleet because there has to be a shifting of modal transportation. So, we continue to believe that what we see for the next few years is great and it's going to be a great market. And that's especially true in our second largest market, which is in Europe, where we have significant industry momentum to move to net carbon zero goals much earlier and removed congestion is reason, government mandates are really pushing this. I kind of go home that next, so I want make sure I understand sort of your industry view. Yes, I think, this is Brian. Again, think about the contraction you've seen as a fleet and how many cars are being added. There's a scrap rate, probably somewhere in the 40,000 car range per year. And so when you think about 60,000 cars, it's almost, depending on how many cars are scrapped a year, it really has almost just replacement to them versus organic growth. And, again, keep in mind that is today with a very light footprint in auto, because of the chip shortages. And when that starts to free up, it's going to put more pressure on railroads and velocity and just moving equipment. And on the leasing side, obviously, growing quicker, which is good better than you expected, fleet leverage at 65%. Most of it is in 2022 does have a tail into 2023, based on our fiscal year lays out that a lot of it is calendar 2022. It looks like the order book went up about, 9%, 10% year-over-year in terms of price per car. I've said this before and it continues to ring true, is that, the mix is the most diverse I've seen in my 41 or 42 years in the industry, which does not date me as a real man. But it's just the baby, just the baby when I started. But, it really is a little bit of everything, which is a fantastic for us growing our lease fleet as well from a diversity perspective, credit profile perspective, and just lease maturity perspective. But it is everything from multiple types of covered hopper cars, auto, intermodal, gondolas, box cars, very, very, very diverse. There is no single particular area that is creating the demand cycle this time, which normally would be an ethanol boom. It's very, very diverse. And the other thing I would say that, it is obviously impacting ASP. And we are doing, because these are very large program and based on our customer needs, we are going to be running this work through our manufacturing facilities, because that kind of repetitive work that we think that we can do very efficiently and effectively at those facilities from a margin percentage perspective, it's going to flow through in manufacturing is what you are going to see on your financial statements. And it's going to be beneficial, because these are competitively-priced transactions, and the work that's going through the facilities is going to add to the overhead absorption. So, we don't see it as a drag on manufacturing earnings. It's interesting to note that, this is a fairly deep market given the modernization capabilities of the aging fleet. And both Trinity and Greenbrier are finding that, this modernization is becoming the ESG goals as well. So, I think it's a very attractive future market is going to go through this cycle. No, it's absolutely correct. This actually is something that as you see, scrap car rates go up and you see the value in repurposing components. Yes, it's going to be, I think, it's going to be positive for our overall margins. Obviously, we don't look to take work into our shops, that isn't going to be positive overall, for Greenbrier and for our shareholders. Just look at it this way, another 200 million of backlog. If you look at it that way, but we're not calling the industry convention and we're including it in our manufacturing backlog is being done in our manufacturing plants, not principally in our repair facility system. Brian, you talked a few times about the 60,000, 2020 delivery projections for some of the industry forecasters. Obviously, we take guidance from exterior entities as well. But we've really, for the last few years, relied more on our internal consensus, which is built up by a multiple number of touch points we have with customers, and outreach programs that we have in the industry. We think we can generate high-teens margins, again, is a 60,000 kind of environment, whether or not that happens exactly in '22 or '23. I think yes, that's, I think that would be fantastic, that would be great to be at that kind of that 60,000 level and stay at that steady level for a while, because obviously, the ramping up or ramping down or things that can be headwind to efficiencies. Adrian, you talked about the tax receivable the last couple of quarters. We'd expect quite, quite positive cash flows in the back half of the year. We're, as you say, your supporting ramp up and our business and our working capital at the moment. So, that's not maybe as efficient as it would be in normal times, where we're protecting ourselves by having extra inventory on hand. Brian, you said not a lot of lower margin cars left in backlog, but I believe Adrian said gross margin would be single digit in the first half. I think what we would say is, Q2 was always a challenging quarter for our maintenance business because of weather, typically. And if you kind of look back at years, it's many times, that's our most challenging quarter in our business. So we see that as normal seasonality, we would expect it to be better than first quarter, which was much more challenging than we expected. But with the manufacturing piece, we do see that there's opportunities for improvement and growth in the margin in Q2. And while most of the competitively priced cars are out of it, we are still ramping up various production lines and that's where you see as more of the overhead under absorption that we're trying to be maybe cautious around a little bit. So I guess, I mean, I hear you on seeing better momentum in some of the lines of business. And we had a little bit disappointing start in half, but it was dragged down by maintenance and some of the things that I think are self correcting. Obviously, and I would have to go back and I probably shouldn't admit this, but sometimes I have a hard time remembering last week, last quarter's call and what we might have said, but we are a lot more positive. When we put together our initial expectations for this fiscal year, we see a lot of opportunities where we are ramping, or adding lines more quickly than what we expected. But we, as Brian had said we're seeing broad demand on a variety of car sites and we're figuring out, how can we address that demand solve our customers problems. Again, that's getting into trying to parse quarter by quarter and that's part of why we try not to get into. We think we are going to have, as we move through this year, it's going to increase and you are going to see the margins improve. Let me just elaborate on the economics of that, as we look at the backlog and that's really significant factor in our business. With backlog, we are able to ramp and increase production in every line or many of the lines. In one case on a car type, we've got a good strong backlog, we're tripling production, that absorbs overhead, as Lorie said. So the timing of it is more problematic, but we are still very optimistic about the year and the financial results for the year. So, shortly after you guys acquired American Railcar, I think in July of 2019. Obviously, the world changed and the production cycle got cut short basically have for the industry in 2020 and stayed at 30,000 in 2021, which is below replacement. So, I guess this production up cycle this year and much more so next year, if you are at 60,000 ARI. Can you talk about how different this could look from your prior extensions for you guys, how the mix will be different, what the impact on pricing and margin will be. And I realized that this could be more at 2023, calendar 2023 dynamics then calendar 2022. Just as referenced, Lorie and Brian can address this question. The acquisition of ARI, you're right, the timing, we got hit by COVID. ARI is a real asset and we are very positive about the addition that ARI has made to our product portfolio, which is reflected in ability to attract stronger backlog and stronger customers. So, I think that's just a general background for how we see ARI today. We are a U.S. company that gives us a production capability, in the Heartland, and it's a positive thing for Greenberg. But Lorie, why don't you go into the grant, the other things. The other things, you're exactly right. As we go into this uptick in demand, we do have a strong-skilled workforce there. They've got experience, building a variety of covered hoppers and tank cars. They have got a lot of experience delivering rail cars to shipper-base customers that have been a nice addition to our portfolio, and an enhancement of our portfolio of customers. So, these are all things that are going to be positive. So, we actually see that this upturn in demand turning into something that we should see more positive growth got out. We believe, it's favorable going forward. I would say, again, very strong order activity, even through the holidays, which is unusual for the month of December, we're continuing to look. Bill mentioned, Lorie, you will have existing and new initiatives. I think you're going to see, we'll get into more detail that as we move a little bit further into the calendar year."
}