{
    "symbol": "GBX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-06 15:53:05",
    "content": " As a reminder, our new rail car backlog does not reflect 3,200 units valued at $180 million that are part of Greenbrier’s refurbishment program. We were – I'm fortunate enough to be with a bunch of shippers a few weeks ago, talking to them exactly about what they are transporting and how they are dealing with the situation, and while it's difficult to predict exactly how those transportation lanes are going to change, everything seems to come back to it should improve transport, have goods on the rails, so that’s going to be fertilizers, it’s going to be grains, it's going to be crushed rock, it's going to be petroleum products. It’s across the board that we're going to see that sort of pick up, and while the railroad themselves can be very efficient, sometimes these increases in traffic, it takes a little bit of time for them to catch up, which tends to drive demand for more rail cars. And going back to the January call and some of the intra-quarter comments, you know I believe you said that you think the business gets through the upper teens, you know maybe even back into the 20’s over time, at least in the manufacturing margin. I'm back and I’ll take that, because I think I'm the one that was saying that, because I think I was being – really trying to look forward if we were to see sustained demand in the 50,000, 55,000 rail cars per year basis here in North America, and if we were able to enjoy that sort of sustained demand, we would expect our manufacturing margins to get that. Yeah, as Justin said, we’re north of 21 lines at this point and we have all of the transitions are well underway and we see that will be increasing production somewhere in the line – neighborhood of between 90 to 110 cars per day once we get our full stride here this quarter. As Brian was talking about, we are focused on margin dollars versus percentages and across the time since we were in the crude by rail, we’ve improved our manufacturing production processes that I still think would allow us to achieve higher margins than we've achieved in the past when we’ve had broad based demand."
}