{
    "symbol": "APG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 16:22:06",
    "content": " Reported net revenues for the 3 months ended December 31, 2022 increased by 53.1% to $1.7 billion compared to $1.1 billion in the prior year period. For the year ended December 31, 2022, reported net revenues increased by 66.4% to $6.6 billion compared to $3.9 billion in the prior year period, driven by revenue from acquisitions completed in Safety Services. Adjusted gross margin for the 3 months ended December 31, 2022, was 27.8%, representing a 319-basis-point increase compared to the prior year period, driven by acquisitions in Safety Services and an improved mix of inspection service and monitoring revenue. For the year ended December 31, 2022, adjusted gross margin was 26.8%, representing a 288-basis-point increase compared to the prior year, primarily driven by reasons provided in the review of the fourth quarter. Adjusted EBITDA margin for the 3 months ended December 31, 2022, was 10.7%, representing a 40-basis-point increase compared to the prior year, driven by an improved mix of inspection, service and monitoring revenue and leverage on higher volumes in Safety Services. For the year ended December 31, 2022, adjusted diluted earnings per share was $1.33, representing a $0.30 increase from the prior year period driven by accretion from acquisitions and strong organic growth in Safety Services and Specialty Services. For the 3 months ended December 31, 2022, Safety Services reported net revenues increased by 111% to $1.2 billion compared to $569 million in the prior year period, driven by revenue from completed acquisitions and strong organic growth. For the year ended December 31, 2022, Safety Services reported net revenues increased by 120% to $4.6 billion compared to $2.1 billion in the prior year period, and net revenues increased on an organic basis by 17.1%, driven by reasons provided in review of the fourth quarter. Adjusted gross margins for the 3 months ended December 31, 2022 was 32.4%, representing a 146-basis-point increase compared to prior year, driven by the impact of completed acquisitions, pricing initiatives and disciplined projects and customer selection. For the year ended December 31, 2022, adjusted gross margin was 31.3% compared to the prior year adjusted gross margin of 31.5%, driven by inflation and certain supply chain disruptions, which caused the decline in productivity. Adjusted EBITDA margin for the 3 months ended December 31, 2022, was 13.2% compared to prior year adjusted EBITDA margin of 13.5%, primarily -- driven primarily by SG&A mix impacts from completed acquisitions. For the year ended December 31, 2022, adjusted EBITDA margin was 12.2% compared to prior year adjusted EBITDA margin of 14%, driven by SG&A mix impacts from completed acquisitions and the reasons provided in review of gross margins. Specialty Services reported net revenues for the 3 months ended December 31, 2022 declined by 8.9% to $510 million compared to $560 million in the prior year period, driven by timing of projects at our specialty contracting businesses and a robust sales performance in Q4 2021. For the year ended December 31, 2022, Specialty Services reported net revenues increase by 6.4% to $2 billion compared to $1.9 billion in the prior year period, driven by an increase in service revenue, increased demand at our infrastructure, utility and fabrication businesses and improved capture of inflationary-driven price and cost pass-through. Adjusted gross margin for the 3 months ended December 31, 2022, was 16.7% representing an 83-basis-point decline compared with the prior year, primarily driven by margin declines, which are arose due to inflationary cost pressures and productivity constraints on select jobs. For the year ended December 31, 2022, adjusted gross margin was 16.2%, representing a 100-basis-point increase compared to the prior year, driven by improved productivity and improved mix of service revenue. Adjusted EBITDA margin for the 3 months ended December 31, 2022, was 10.4%, representing a 139-basis-point decline compared to the prior year due to the reasons provided in the review of gross margins. For the year ended December 31, 2022, adjusted EBITDA margin was 10.3%, representing a 12-basis-point increase compared to prior year due to the leverage of higher volumes. For the 3 months ended December 31, 2022, adjusted free cash flow was $230 million, above our previously guided range of $190 million to $210 million and representing an $84 million increase compared to the prior year period. For the year ended December 31, 2022, adjusted free cash flow was $412 million, and our adjusted free cash flow conversion was approximately 61%. These include solid organic growth, targeted adjusted free cash flow conversion of 80%, adjusted EBITDA margins of 13% by 2025 and targeted net leverage ratio of 2 to 2.5x, which, as Kevin mentioned, we expect to achieve near year-end 2023, supplemented by our recent $200 million reduction in term loan debt. You are right, as we look at 2023 and our full year guidance right now in underlying what we are expecting our safety business in service side continued double digit growth, the math that you laid out and implication of specialty business services seems directionally correct and what I would add what we are going to continue to focus in that business in 2023 on disciplined projects customer selection and end market where Russ talked about it a little bit on the chip side that its relevant in those specialty businesses too as they continue to see increased work opportunity from some of the infrastructure billing and some of the other earnings so we are going to continue to be disciplined in our project selection and I think you will see that through 2023 and the growth rates in that business."
}