{
    "symbol": "APG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 14:21:07",
    "content": " Russ and Kevin will speak to the performance of the business in more detail, but I would add that in our view, APi's continued execution against its goal, despite challenges faced in an uncertain macro environment speak to the strength of the Company's recurring revenue, services focused business model and the discipline of the organization and its leadership team. As you can see from the Company's significant organic progression, including growth in organic net revenues of 14% year-to-date for the legacy APi business as well as Chubb delivering topline growth, the go-to-market strategies are working. Key highlights from our performance for the three months ended June 30, 2022, compared to the prior year period include the following: First, as expected, our revenue momentum continued into the second quarter, and we saw growth in net revenues on an organic basis of approximately 12% and 14% on a year-to-date basis. Reported net revenues for the three months ended June 30, 2022, increased by 68.6% to $1.6 billion compared to $978 million in the prior year period. Adjusted gross margin for the three months ended June 30, 2022, was 26.7%, representing a 282 basis point increase compared to the prior year period, driven by an improved mix of inspection and Service revenue in Safety Services, supplemented by acquisitions in Safety Services as well as improved productivity in Specialty Services. These factors were partially offset by supply chain disruptions and inflation, which caused downward pressure on margins. For the three months ended June 30, 2022, Safety Services reported net revenues increased by 124% to $1.1 billion compared to $512 million in the prior year period, primarily driven by revenue from completed acquisitions. Adjusted gross margin for the three months ended June 30, 2022, was 30.6%, representing a 121 basis point decline compared to the prior year, driven primarily by margin declines on contract revenue in our HVAC services business, which arose due to inflationary cost pressures on pre-existing longer-duration in-place contracts where inflationary costs could not be absorbed or passed on. Adjusted margins for -- EBITDA margins for the three months ended June 30, 2022, was 11.8%, representing a 287 basis point decline compared to the prior year, driven primarily by SG&A leverage impacts from completed acquisitions and the reasons provided in a review of gross margins. Specialty Services reported net revenues for the three months ended June 30, 2022, increased by 8.8% to $518 million compared to $476 million in the prior year period. Adjusted gross margins for the three months ended June 30, 2022, was 17.4%, representing a 246 basis point increase compared to prior year, driven primarily by improved productivity and improved mix of service revenue. These factors were partially offset by supply chain disruptions and inflation, which caused downward pressure on margins. Adjusted EBITDA margin for the three months ended June 30, 2022, was 11.6%, representing a 108 basis point increase compared to prior year due to leverage on higher volumes and improved mix of service revenue."
}