{
    "symbol": "CRGE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 13:51:03",
    "content": " These charts depict how our revenue and gross profit mix have changed over the past five quarters as our infrastructure business which carries higher gross margins, captures its significant growth opportunity, and contributes a growing proportion of our revenue and profit basis. Revenues within our telecommunications segment are generated via the routing of voice, data, and SMS text messages, process albeit at lower margins, have provided us some necessary fuel to help build a strong public company foundation and launch our EV charging infrastructure business. Looking at our results for fourth quarter in the five quarter trend, first, our infrastructure segment contributed on average 15% to 20% of total revenues while providing 85% to 90% of gross profits with an average gross margin of approximately 23%. Fourth quarter 2022 proforma gross profit of 8.5 million grew 32% from the fourth quarter of 2021 and 29% sequentially, driven by higher relative growth and contribution from our infrastructure segment, partially offset by lower gross profit from telecommunications due to partner mix. Fourth quarter 2022 gross profit within infrastructure benefited from sequential revenue growth combined with flattening into some degree lessening inflationary, and labor pressures. Our charge infrastructure business, which only formed in the second half of 2021, gathered revenue momentum in 2022 and is poised for rapid revenue growth in 2023. Turning to slide 11, to look at our full year performance on a proforma basis, 2022 revenue increased 34% to just over 698 million, driven by growth in both segments, particularly in the infrastructure segment, which grew 55% year-over-year. 2022 growth profit grew 26% to just over 28 million driven by a 43% year-over-year increase in our higher margin infrastructure segment following record revenues and a mix of higher margin projects within BW specifically within our operating expenses, we made significant investments in 2022 to build our team processes and technology, primarily within corporate and our EV charging infrastructure business. Our EV charging infrastructure business just started at the end of 2021 and revenues began in 2022, whereas our well-established A&S and BW businesses experienced record revenue growth this year. In our infrastructure segment, while we expect revenues will continue to grow, I would remind everyone that we experienced record revenue growth in 2022 within A&S and BW, so we're up against some tough grow over in 2023. Our EV charging infrastructure business gained momentum in the fourth quarter of 2022, and since it's in early days, we expect revenues in our EV infrastructure business to grow at a faster rate than our mature businesses."
}