{
    "symbol": "DAO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 20:20:27",
    "content": " As for smart devices, strong new product sales approaching 100% year-over-year growth on November 11 Shopping Festival, and facilitated growth of net revenues from this segment to the best level of RMB 407 million in Q4. Net revenues reached RMB 2.9 billion in second half of 2022, increasing 36.8% year-over-year. Net revenues from smart devices hit RMB 407 million, up 28.1% year-over-year. As for our learning services, net revenues reached RMB 806.3 million in Q4, up 39.2% year-over-year. Net revenues from our learning services were RMB 806.3 million or $116.9 million, representing a 39.2% increase from the same period in 2021. Net revenues from our smart devices were RMB 407 million or $59 million, up 28.1% from the same period in 2021, driven by the popularity of Youdao's newly launched products, such as the Youdao Dictionary Pen X5. Net revenues from our online marketing services were RMB 240.8 million, or $34.9 million, representing a 58.6% increase from the same period in 2021. For the fourth quarter, our total gross profit was RMB 774.7 million or $112.3 million, representing a 74% increase from the fourth quarter of 2021. Gross margin for learning services was 64.1% for the fourth quarter of 2022, compared with 51.4% for the same period in 2021. For the fourth quarter of 2022, our net income from continuing operations attributable to ordinary shareholders was RMB 12.3 million or $1.8 million, compared with net loss from continuing operations attributable to ordinary shareholders of RMB 215.9 million for the same period of last year. Net revenues from our learning services for 2022 were RMB 3.1 billion or $447.2 million, up 26.3% from 2021. Net loss from continuing operations attributable to Youdao's ordinary shareholders for 2022 was RMB 720.9 million or $104.5 million, and basic and diluted net loss per ADS from continuing operations attributable to ordinary shareholders for 2022 was RMB 5.83 or $0.84. Looking at our balance sheet, as of December 31, 2022, our contract liabilities, which mainly consist of deferred revenues generated from our learning services, were RMB 1.1 billion or $154.7 million, compared with RMB 1.1 billion as of December 31, 2021. If you go back to the net loss numbers in the first half, we almost lost about RMB 600 million and probably, we will look at the second half as below the -- is narrowed down to the -- even below the RMB 200 million, and we also decreased our cash outflow over RMB 100 million in the second half compared to the first half."
}