{
    "symbol": "DAO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 13:42:06",
    "content": " For smart devices, the first 100,000 units of the newly launched Youdao Dictionary Pen X5 have been sold out, propelling net revenues from smart devices to RMB 356.5 million in Q3, a new record. Smart devices revenue reached RMB 356.5 million in Q3, a new record for the sector and up 40.1% year-over-year. Net revenues from learning services reached a record-high of RMB 888.5 million in Q3, up 37.2% year-over-year, with a relatively flat gross margin of 64.5%. Net revenues from our learning services were RMB 888.5 million, or USA 124.9 million, representing a 37.2% increase from the same period in 2021. Net revenues from our smart devices were RMB 356.5 million, or USA 50.1 million, up 40.1% from the same period in 2021, driven by the popularity of the newly launched products in 2022. Net revenues from our online marketing services were RMB 157.5 million, or USA 22.1 million, representing a 14.9% increase from the same period in 2021. For the third quarter of 2022, our net loss from continuing operations attributable to ordinary shareholders was RMB 183.9 million, or USA 25.9 million, compared with RMB 225.3 million for the same period of last year. Non-GAAP net loss from our continuing operations attributable to ordinary shareholders for the third quarter was RMB 164.4 million, or USA 23.1 million, compared with RMB 200.2 million for the same period of last year. Looking at our balance sheet, as of September 30, 2022, our contract liabilities, which mainly consist of deferred revenue generated from our learning services, were RMB 996.5 million, or USA 140.1 million, compared with RMB 1.1 billion as of December 31, 2021. So second, Smart Devices revenues are at, as you can see, a record high of RMB M356 million, up 40% year-over-year in Q3. With the launch of our new services with digital content services since quarter 2 and the relevant sales increased very quickly and reached over RMB 400 million in this quarter, along with over 60% gross margin increased from 50% in Q2."
}