{
    "symbol": "ABG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 14:46:05",
    "content": " Our adjusted EBITDA for the year was $1.3 billion, an increase of over $500 million and we expanded adjusted earnings per share by 38% to $37.66. We grew adjusted EBITDA by $71 million to $319 million, an increase of 29%; expanded adjusted EPS from $7.46 to $9.12, an increase of 22%; delivered an 8.2% adjusted operating margin; increased revenue by $1.1 billion to $3.7 billion; and grew gross profit by $196 million to $738 million. For the full year 2022, we generated $987 million of adjusted operating cash flow, an increase of $355 million over last year, which speaks to our robust business model. Overall compared to the fourth quarter of last year, adjusted net income increased 24% to $202 million and adjusted EPS increased 22% to $9.12. Adjusted net income for the fourth quarter 2022 excludes expenses of $2.7 million related to a significant acquisition that did not materialize and gains on dealership divestitures net of $202.7 million, primarily related to the North Carolina stores, all of which netted to $6.83 per diluted share. But because of a SAR below $15 million and all the things I've stated, we think it's going to be a pretty good year for new car margins. You mentioned $14.5 million SAR, it seems like getting to 55 from $38, still 50% EPS growth, it would need a pretty sharp recovery in the industry, both new and used. So between the combination of the SAR growth over the next few years, the opportunity with acquisitions, the efficiencies with Clicklane and our ability to lower SG&A over time, I wouldn't say so much in â\u0080\u009823, but over time with the use of software and tools to become even more efficient, we think all those things still give us the potential and the opportunity to get there. We just don't -- we think it's too early to make that call and we still see the next three years growing SAR, and our opportunity to acquire more stores and get better with our software. On the used car side, you've seen margin fall pretty good, but we don't think it's going back to â\u0080\u009819 levels, because you still have a supply issue in the marketplace where it's been depleted the last few years."
}