{
    "symbol": "CVGW",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-06 23:43:05",
    "content": " Grown segment revenue was $118 million, down $45 million from last year as the average selling price of avocados decreased by 35% as prices continue to adjust from their highs in the summer. Prepared segment revenue was $108 million, down $4 million from the prior year quarter as higher prices partly offset volume declines of about 13%. Consolidated gross profit was $14 million, up over $1 million from the prior year quarter, primarily driven by a $3 million increase in Prepared segment gross profit partially offset by a $2 million decline in Grown segment gross profit. In the Prepared segment, gross margins in the fresh cut division will be at or near the low end of the 10% to 12% range as we end the fiscal year primarily due to softer volume in the near term, although new customer distribution points and volume are scheduled to launch in the back half of the year. I guess my first question is, so I guess with Project Uno and the whole -- the plan was that it would take a couple of years, 3 years plus to get back to like your performance, your EBITDA generation back in fiscal '19 and somewhere you did, I think, roughly $80 million in fiscal '19. I think we'll be in a period in avocados, we've probably been several weeks now, months where demand has exceeded -- or sorry, supply has exceeded demand, and we've got some volume coming on from California and Peru in a heavy Mexican season, so I think we're trying to be cautious and respectful that there's some volatility in Grown margin as well. So one of the other things that I think is hard to see is we made great progress in getting lower input costs and taking advantage of that market, we made really good progress in yield and labor efficiency in our guac plant, but some of that was, let's say, used up by lower fixed cost absorption because of lower volume. But the category is -- remember, just to be clear, produce for the second half of the year, total produce unit sales was down 3%, avocados was still -- that last quarter was up 3%."
}