{
    "symbol": "XHR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 04:06:02",
    "content": " Seven of our top 10 markets as measured by contribution to 2019 EBITDA, have yet to fully recover back to 2019 levels, which is reflective of the greater dependence on corporate transient and group demand in the hotels we own in those markets. Six of our larger corporate and group-focused hotels, namely Marriott San Francisco Airport, Hyatt Regency Santa Clara, our two Dallas hotels and our two Westins in the Houston Galleria markets, were collectively more than $20 million behind in terms of hotel EBITDA in the first half of 2022 as compared to the first half of 2019. April continued the strong occupancy trend, with an occupancy of 72% at an average daily rate of $280.62, both post-COVID records, reflecting occupancy down 9.8 points to 2019, while rate increased by 18.3%, reflecting continued strength in leisure business and strengthening group business, particularly our large resort hotels. June occupancy of 68.3% reflects historically lower levels of group and leisure business, which was offset by continued strength in individual corporate business and a decline of 11.1 occupancy points to 2019. In the quarter, our group business benefited from solid in the quarter for the quarter bookings and strong rate growth, resulting in higher groups revenue, group, higher group rooms revenue as compared to the second quarter of 2019, which were high-quality, reflecting healthy corporate group demand, particularly in our larger resorts. Corporate transient demand continued to recover, with Monday, Tuesday and Wednesday occupancies building through the second quarter, although still down in the low to mid-teens occupancy point range compared to 2019. Now switching to profit, second quarter hotel EBITDA was $86.5 million, an increase of 15% on a total revenue increase of 2.4% compared to the second quarter of 2019, resulting in 365 basis points of margin improvement. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}