{
    "symbol": "XHR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:47:14",
    "content": " Same-property hotel EBITDA of $52.2 million represented an increase of 1.4% from the third quarter of 2019, marking the second consecutive quarter of growth relative to 2019. Same-property hotel EBITDA margin continued to show improvement over 2019, increasing by 48 basis points for the third quarter, which followed an outsized 365 basis point improvement as compared to 2019 in the second quarter. The property is making good progress, building its book of group business, with group pace for 2023 as of the end of the third quarter exceeding the pace for 2022 at the same time last year by over 20%. We continue to see significant continued rate strength in our resorts and our drive to leisure markets, with RevPAR for the quarter compared to 2019 up 41% at Park Hyatt Aviara, 34.5% at Kimpton Canary Santa Barbara, 31.8% at Royal Palms, 27.1% at Hyatt Centric Key West, and 26.8% at Hyatt Regency Grand Cypress. Third quarter same-property hotel EBITDA was $52.2 million, an increase of 1.4% on a total revenue decline of 0.7% compared to the third quarter of 2019, resulting in 48 basis points of margin improvement. While most of our hotels are operating at staffing levels between 90% and 95% of pre-COVID levels, increasing wage costs resulted in labor costs being nearly equal to 2019 levels in the rooms department, the largest operating department in our hotels, despite growing overall margin by just 48 basis points. I think when you're looking at the comparison of 2019, and I think we kind of all saw this that it was a little bit of a -- that will -- you would hope the business travel would be a little bit more robust in August, that people really seem to stay off the road in terms of hardcore business travel, not only until after Labor Day, but as we saw actually further into the second week after Labor Day, when we really saw that corporate \"demand\" really kind of kicked into gear one, which really accounts for, at least in our view, most of the difference between the growth in September over 2019 and the decline in August over 2019. And we've seen a lot of very robust booking activity here over the last quarter or so, narrowing the gap very significantly or actually eliminating the gap here for the fourth quarter as compared to '19, but also really seeing some really good bookings going into '23, also at pretty robust rates still going back to various point as far as not receiving a ton of pushback on rate increases, either on the group side or on the transient side."
}