{
    "symbol": "TRIP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 12:48:02",
    "content": " As we said in the Shareholder Letter we published last night, we saw a strong recovery with 65% consolidated revenue growth relative to 2021, reaching nearly 96% of 2019 revenue for the full year and exiting the year at 106% of 2019 levels in the fourth quarter. But first let's start with Viator, where the team continued to drive accelerated growth in 2020 to delivering record revenue and scale, with gross bookings value of approximately $2.7 billion, or 186% of 2019 levels. Finally, in our Tripadvisor Core segment, we saw a positive trajectory, with revenue of $966 million growing 45% year-over-year, and reaching 79% of 2019 levels. At Tripadvisor Core, we saw better-than-expected performance in the quarter as revenue reached 85% of 2019 levels, which is a modest step back from third quarter's result of 88%. Tripadvisor's Core's experience and dining revenue saw strong growth in the quarter, reaching 113% recovery versus 2019. Turning now to the full year 2022, we reached nearly $1.5 billion in revenue and consolidated revenue, which is 96% of 2019 levels and represent 65% year-over-year growth rate. Growth in recovery was driven in large part by our Viator segment at 171% of 2019 levels and 168% year-over-year growth, and to a lesser extent, our Tripadvisor Core Hotel meta and experiences revenue and TheFork. In our Tripadvisor Core segment, the primary drivers of the lower adjusted EBITDA margin versus Q4 2019, or increases in performance marketing to drive experiences as well as hotel meta traffic mix shift. Your line is open. Your line is open. Your line is open. Your line is open. Over time, as this business again, moved beyond 2023, which is a very different business than it was in 2019, where, as I mentioned, we had that very large other piece of core revenue as that mix becomes bigger in even TA Core with experiences as we have continued recovery in our media business, which we do think is lagging kind of overall travel -- the travel industry as our B2B business comes back online. Your line is open. Your line is open."
}