{
    "symbol": "FLGC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-28 17:51:04",
    "content": "  Jessie Casner: Hello, everyone, and welcome to the Flora Growth Third Quarter 2022 Earnings Results Webcast. On the call with me today are Luis Merchan, Chief Executive Officer and Chairman of the Board; Jason Warnock, Chief Commercial Officer; and Elshad Garayev, Chief Financial Officer. Today, we will discuss the results of the third quarter of 2022. Finally, please note on the call today, management will refer to certain non-IFRS financial measures such as adjusted EBITDA and adjusted EBITDA margin, in which Flora excludes certain expenses from its IFRS financial results. And with that, it's my pleasure to introduce Flora Growth's Chief Executive Officer and Chairman of the Board, Luis Merchan. At Flora, we seek to create a world where the benefits of cannabis are accessible to everyone. Today, we reported approximately $10.8 million in revenue for the third quarter of 2022. Additionally, our third quarter gross margin improved from 29.6% to 46.2% compared to the third quarter last year. This year, we were awarded a high-THC cannabis quota of 43 tons by the Colombian government, that we intend to leverage through the remainder of 2022 and throughout 2023. As we achieve these key milestones across our core business units, we also added key executives to our roster, appointed Brandon Konigsberg, our former JPMorgan executive to our Board of Directors and Elshad Garayev, a former Boeing and Amazon executive as our Chief Financial Officer, further enhancing our Financial Controls and Corporate Governance capabilities. Finally, Flora has been active on the M&A front in 2022 with the acquisitions of JustBrands and No Cap. Earlier this month, we announced a definitive agreement to acquire Franchise Global Health, a pharmaceutical distributor with primary operations in Germany and licenses to import and distribute medical cannabis into the most important legal, medicinal cannabis market in the world today. We expect to close this transformative acquisition in mid-December and based on both of our company's guidance for 2022, we expect to have a company with at least $100 million in revenues for 2023. With that, I'll hand it over to our CFO, Elshad Garayev, to review our financial performance for the third quarter of 2022. The period's gross margin expanded significantly from 29.6% in the prior year to 46.2% and also improved from 43.9% in the first half of 2022, reflecting our ability to organically optimize our business. The increase in operating expenditures was primarily driven by OpEx from acquired businesses, administrative infrastructure, sales and marketing and expanding our operations, all of which are enabling us to deliver on our growth objectives. Adjusted EBITDA margin improved significantly from negative 150.1% in Q3 2021 to negative 36.5% in Q3 2022, first a signal in our path to profitability. The decrease was primarily attributed to $60 million cash paid for the acquisition of JustCBD as well as higher operating expenses related to sales and marketing of acquired businesses and one- time expenses for our cost of channels operations, Flora lab expansion and M&A related transactional activities. Since Flora's inception, the value of our House of Brands has been to drive meaningful consistent revenue streams that allow entry to new target markets regardless of the legal status of cannabis, opening up supply chains, distribution networks, and building customer bases. The third quarter saw record sales, improvement in margins and strong direct-to-consumer and wholesale performance with more than 80% of Flora's revenues being driven by the House of Brands division, with the majority being attributed to JustCBD and Vessel. Today, we are actively cultivating four psychoactive cannabis strains including a balanced one to one strain and three high-THC cultivars for export into international markets. Flora is actively engaged in building the commercial export pathway for THC products, specifically through Germany, being our pending acquisition of Franchise Global Health. To fully realize the potential of the EU market, we have redirected our EU GMP certification efforts towards the certification of dry bulk flower, and have actively engaged our European partners seeking distributors to fit strategically within our long term commercial wholesale strategy going into Q4 of 2022 and beyond. First, we have greater Flora lab 4, expanding our capabilities to manufacture custom formulations as our products with cannabis derivatives and traditional master formulas to serve the medicinal cannabis market in Colombia. Alongside the completed construction of Flora lab 4, we have formulated eight new prescription grade cannabis medications and are awaiting INVIMA certification of the lab to launch commercial. With these successful operational and research steps completed, we expect that our Life Sciences division could begin realizing revenues via prescription formulations as early as the fourth quarter this year. Our third quarter has been a formative time for our company and despite the macro headwinds, I am proud to say that we are continuing to execute on our strategic goals and remain on the track to meet our 2022 revenue guidance of 35 million to 45 million. In 2023, we will see a full activation of revenues of our Colombian grown cannabis as we accelerate the supply to meet the world's demand for high-THC and high CBD products. We continue to set ourselves apart from the other players in the industry, appending what an international cannabis company looks like, supporting scientific research, working with international standard setting bodies, and of course, promoting best practices that continuously streamline our supply chain."
}