{
    "symbol": "SWI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 12:14:02",
    "content": " We had several highlights in the fourth quarter, including strong subscription revenue growth in line with our subscription-first strategy; continued execution on customer retention, demonstrating the value proposition of our solutions; growing traction with our observability solutions representing the superior value that we believe we deliver to customers; continued innovation in our service management, ITSM and database product lines, representing an increasingly diverse portfolio participating in growing markets; healthy cash flow generation and adjusted EBITDA margins, reflecting our commitment to our expense and operating discipline; delevering our balance sheet, which Bart will discuss further; and continued progress with our partners and global system integrators as we extend our reach to customers through our partners in a scalable and cost-effective manner. We ended the fourth quarter of 2022 with 889 customers who have spent more than $100,000 with us in the last 12 months, an increase of 7% over the comparable period in the previous years. We finished the fourth quarter with total revenue of $187 million, which is a slight increase compared to the prior year and above the total revenue range of outlook we provided of $178 million to $183 million. On a full year basis for 2022, revenue finished at $719 million, which was slightly higher than the prior year and well above the total revenue range of the outlook we provided of $710 million to $715 million in our Q3 earnings release. On a constant currency basis, our fourth quarter total revenue would have been approximately $191 million, which is an increase of 2% year-over-year. On a full year basis for 2022, constant currency revenue would have been approximately $733 million, which is also a 2% growth compared to the prior year. Digging into the revenue details, our fourth quarter subscription revenue was $50 million, up 45% year-over-year, with full year subscription revenue of $168 million, up 35% year-over-year. Maintenance revenue was $115 million in the fourth quarter, which is a decrease of 3% from the prior year and $459 million in 2022, which is a decrease of 4% from the prior year. For the fourth quarter, license revenue was $22 million, representing a decline of approximately 34% compared to the fourth quarter of 2021 and $93 million in 2022, which is a decrease of 19% from the prior year. For the first quarter, we expect total revenue to be in the range of $177 million to $182 million, representing a 1% year-over-year growth at the midpoint. For the full year, we expect total revenue to be in the range of $725 million to $740 million, representing 2% year-over-year growth at the midpoint. Adjusted EBITDA for the year is expected to be approximately $290 million to $300 million, representing a 5% year-over-year growth at the midpoint. While this has resulted and will likely continue to result in some variability in our reported revenue, the accelerated shift to subscription is consistent with how our customers want to consume our products and a key to our long-term strategy to achieve $1 billion in ARR at mid-40s adjusted EBITDA margins in the coming years. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}