{
    "symbol": "SWI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 15:09:05",
    "content": " As you will notice in our results, our teams made significant strides in improving customer retention to our historical levels, continuing to focus on subscription revenue growth and evolving to platform-based solutions that we believe offer the best time to value, time to detect issues and time to resolve issues for our customers in their multi-cloud environments. We finished the second quarter of 2022 with 879 customers who have spent more than $100,000 with us in the last 12 months, an increase of 13% over the previous year. We finished the second quarter with total revenue of $176 million, which is a slight decline compared to prior year and near the high end of the total revenue outlook we provided of $174 million to $177 million. On a constant currency basis, our total revenue would have been approximately $180 million, which is a 2% increase over the prior year. Second quarter subscription revenue was $37 million, up 25% year-over-year. As we have discussed recently, our maintenance revenue has been impacted primarily by the conversion of a portion of our maintenance customers to subscriptions as well as the lower euro to U.S. dollar conversion rate in 2022 compared to the prior year. We finished the second quarter of 2022 with 879 customers who have spent more than $100,000 with us in the last 12 months, which is a 13% improvement over the previous year. Second quarter adjusted EBITDA was $67 million, representing an adjusted EBITDA margin of 38%, which is in line with our outlook for the quarter even as we continue to invest in our business. For the third quarter, we expect total revenue to be in the range of $180 million to $185 million representing a slight decrease to 2% growth over prior year. For the full year, we now expect total revenue to be in the range of $715 million to $725 million, which is a slight decrease to a 1% increase year-over-year compared to prior guidance of $730 million to $750 million. On a constant currency basis, our total revenue guidance would be $730 million to $740 million, an increase of 2% to 3% year-over-year."
}