{
    "symbol": "SWI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 19:24:06",
    "content": " We had several highlights, including continued subscription revenue growth in line with our subscription-first strategy; continued execution on customer retention; healthy EBITDA margins, reflecting our commitment to expense and operating discipline; expansion of our route to market with the announcement of our Transform Partner Program; strong adoption of hybrid cloud observability representing the superior value that we believe we deliver to customers; continued federal business execution demonstrating our strength in and commitment to the public sector; and major product announcements including key milestones in our observability evolution. Excluding an approximately $1 million currency headwind since we provided guidance, revenue, assuming foreign currency exchange rates used in our previously issued outlook, would have been within our guidance range, and on a constant currency basis, we delivered a 1% year-over-year growth. By shifting to a subscription-first strategy has resulted in some total revenue headwinds, we continue to believe it is the right strategy for our business as we focus on growing annual recurring revenues to over $1 billion in the coming years. We ended the third quarter of 2022 with 882 customers who have spent more than $100,000 with us in the last 12 months, an increase of 12% over the comparable period in the previous year. We finished the third quarter with total revenue of $179.4 million, which is a slight decline compared to the prior year, and below the total revenue range of outlook we provided of $180 million to $185 million. We ended the third quarter with total ARR of $623 million, roughly flat compared to the prior year, and on a constant currency basis, our total ARR would have represented an increase of approximately 2% over the prior year. We finished the third quarter of 2022 with 882 customers who have spent more than $100,000 with us in the last 12 months, which is a 12% improvement over the previous year. Third quarter adjusted EBITDA was $70.3 million, representing an adjusted EBITDA margin of 39%, which is in line with our outlook for the quarter even as we continue to invest selectively in our business. For the fourth quarter, we expect total revenue to be in the range of $178 million to $183 million, representing a slight 3% year-over-year decline at the midpoint. On a constant currency basis, revenue at the low and high end of the range would be approximately $5 million higher, and it would represent a range of 2% decline to 1% growth year-over-year. On a constant currency basis, our total revenue guidance would be $725 million to $730 million, or growth of 1% to 2% year-over-year. The midpoint of the outlook Bart provided still represents year-over-year growth on a constant currency basis, which reflects our continued belief in the relevance of our solutions, the execution ability of our teams and most critically, that trust our customers and partners place in us. While this has resulted and will likely continue to result in some variability in our reported revenue, the accelerated shift to subscription is consistent with how our customers want to consume our products, and a key to our long-term strategy to achieve $1 billion in ARR at mid-40s adjusted EBITDA margins in the coming years. As you know, we have continued our engagement with our federal customers for a long time and in particular, for the last 2 years, and look at the quarter results as a further, call it reflection of the confidence that the federal customers have in us and broadly speaking, public sector because we did well across the entire public sector, fed and SLED last quarter."
}