{
    "symbol": "CNA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 15:40:06",
    "content": " The consolidated CNA portfolio yield was 4.4% for the third quarter as compared to 4.3% for the second and first quarters of this year, reflecting the higher P&C yields with the Life & Group portfolio yield about flat in the current year -- current quarter as compared to the first 2 quarters of this year. In total, over $2.7 billion of long-dated fixed income securities were acquired in the Life & Group portfolio over the last 2 quarters with an average yield of 4.9% and an average rating of A+. While higher rates are positively impacting the outlook for investment income, from a balance sheet perspective, they have continued to adversely impact our net unrealized investment position which ended the quarter at a $4.1 billion loss, down from a $4.4 billion gain at the end of last year. The current quarter results include $41 million of after-tax net losses in our fixed maturity security portfolio, reflecting portfolio repositioning and a $35 million noneconomic loss related to the expected novation of a coinsurance agreement in our Life & Group segment and associated funds withheld embedded derivative. The P&C all-in combined ratio improved to 95.8% from 100% in the third quarter of last year and we achieved continued strong production performance, including 9% gross written premium ex-captives growth and 10% excluding currency fluctuations. On a pretax basis, in the quarter, limited partnerships and common equity returns were lower by $121 million year-over-year which was largely offset by an increase in the P&C underwriting gain of $85 million and an increase in income from fixed income portfolio of $28 million due to an increase in yield and a higher asset base. In the third quarter, the P&C all-in combined ratio of 95.8% is 4.2 points lower year-over-year, reflecting a stable underlying combined ratio, lower catastrophe losses and increased favorable prior period development. The P&C renewal premium change in the third quarter was 8%, consistent with the second quarter, comprised of 5 points of rate increase and 3 points of exposure increase, of which half acts like rate. Specialty retention improved by 2 full points to 87%, the strongest level since 2019 and particularly benefited from higher retention in our health care segment as our underwriting actions over the last several years and cumulative rate increases have improved the performance of the portfolio."
}