{
    "symbol": "MITT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 12:03:04",
    "content": " Good morning, everyone and welcome to the full year and fourth quarter 2022 earnings call for AG Mortgage Investment Trust. Before we begin, please note that the information discussed in today's call may contain forward-looking statements. Any forward-looking statements made during today's call are subject to certain risks and uncertainties which are outlined in our SEC filings, including under the headings Cautionary Statement regarding forward-looking statements, risk factors and management's discussion and analysis. We encourage you to read the disclosure regarding forward-looking statements contained in our SEC filings, including our most recently filed Form 10-K for the year ended December 31, 2021 and, our subsequent reports filed from time to time with the SEC. To view the slide presentation, turn to our website, www.agmit.com and click on the link for the fourth quarter 2022 earnings presentation on the home page in the Investor Presentation section. 2022 was an extremely challenging year across markets, but particularly in mortgage markets, where an abrupt pivot by the fed created convexity movements we haven't seen since the taper tantrum of 2013. Well, MITT did experience mark to market losses on assets it owns coming into the year. During this volatile year, MITT remain disciplined by programmatically terming out its financing, and avoided taking undue risks by holding loans on warehouse lines, hoping things would simply get better. As a result of this discipline, we believe MITT is materially de risked with ample liquidity as we head into 2023 in a position to play offense when others may not be. We used a portion of our excess liquidity to repurchase almost 2.7 million shares at a weighted average price of $6.82, creating 7% accretion for shareholders. We ended the year in a strong financial position with approximately $87 million of liquidity, and 1.3 returns of economic leverage. But December was the first month almost all year to show signs of life, with a significant reversal in interest rates, lower new issue volumes, creating a catalyst for spreads within the non-agency space to tighten. As such, we saw our adjusted book value improved 3% from $10.68 to $11.03 per share. Now while the markets in January got off to a nice start, we don't think the path forward is going to be a straight line towards tighter spreads in our market. We believe the company was able to materially deliver and raise liquidity during a challenging 2022 in order to face 2023, with a clean balance sheet and lots of liquidity to deploy into this new, higher interest rate environment. The management team is frustrated with our stock price, particularly given what we believe to be a year in which made effectively navigated choppy markets created lots of excess liquidity and return capital to shareholders via its share repurchase program. We will continue to work hard in earning the confidence of the market by remaining focused executing our strategy and taking advantage of compelling opportunities, which we believe will translate into the earnings power to generate attractive risk adjusted returns for our shareholders over the long-term. In spite of what they may be another year of challenging market conditions, we and AG are excited about outlook for the year and look forward to sharing our progress in the coming quarters. Thanks, T.J. Sticking with Slide 7, as you might recall from our Q3 prepared remarks, we stated that we estimated that our book value was down approximately 5% to 6% for the month of October. As T.J. noted, our book value ultimately recovered 3% in the fourth quarter, and we estimate that it is up another approximately 3% to 4% in January. Consistent with this messaging, this past quarter's modest recovery represents only a small fraction of these unrealized losses. Our economic leverage ratio has significantly declined due to the tune, additional Non-Agency securitizations executed in the fourth quarter and into the beginning of the year. Combined, these transactions decreased our warehouse exposure by approximately 600 million significantly outpacing additional Home Loan purchases of approximately 140 million. As you can see, our securitization issuance in the fourth quarter and into the beginning of the first quarter continued to outpace our acquisition of new loans. The table on the right shows the continued growth of our securitized loan portfolio, along with the corresponding reduction in warehouse exposure. In previous quarters, we have emphasized that we believed it prudent to right size our aggregation risk considering both current market volatility and expected future volatility. Although we are still cautious and believe it critical to appropriately size, our aggregation risk based upon current and expected market conditions. Very recently, we've seen increased competition as a likely consequence of lower volumes coupled with improvements in broader market conditions. Despite the recent tightening, we still believe we can source new credits around an 8% yield with equity returns in excess of 20% on the retrain tranches, while the point one to two turns of leverage. As we have emphasized previously, the weighted average mark-to-market LTV of the underlying residential home loans is approximately 66% and the 60 plus day delinquent population across over 4 billion portfolio is less than 100 bps. Although the forward-looking economic backdrop is likely to remain uncertain, we have not seen any early signs of deterioration in the portfolio's performance. For the transactions issued in the third and fourth quarter, we believe these options are likely to prove valuable given the historically inverted yield curve and wide spreads at time of issue. As mentioned earlier, we expect the markets to remain volatile consequently, don't expect the recovery in book value to be a straight line. As you can see, the fair value of this morning certificates is at over a 30-point discount to face representing historically elevated spread and interest rate levels. On page 11, we outline our investment portfolio, along with the corresponding size and cost of the securitized debt and repo financing. As a reminder, given our continued involvement in securitizations issued, we consolidate the loans and securitized debt on our balance sheet. As noted on this slide, our investment portfolio currently contains asset yields of 5.1% with a weighted average cost of financing of 4.3%. Here you can see the loans transitioning from warehouse lines to securitize debt, bringing down the recourse leverage to where it is today. In the last quarter's prepared remarks, we stated that although we had made substantial progress and renown our recourse leverage ratio from its peak, that it was likely to go lower. As you can see, a recourse leverage as of quarter end was approximately 1.3x, which subsequent to quarter end has been reduced further 2.7x. As of quarter end, recourse debt accounted for approximately 16% of the aggregate down from 24% at the end of last quarter. As you can see in the table to the right, origination volumes continue to fall in the fourth quarter contributing to an after-tax loss of $6.1 million for Arc Home. Although there's still room to become more efficient, most of the cost cutting measures are behind us and we have likely seen the lows and origination volumes. As of quarter end, Arc Home has $20.7 million of cash and MSR is validated approximately $92 million with modest leverage of just under $20 million. We continue to believe Arc Home is well positioned relative to many of its competitors expect this challenging period to show its resiliency, while gaining market share. Turning to Slide 14, we provide year to date and quarter to date reconciliations of book value per common share. And our 2022 earnings is reflective of unprecedented increases in benchmark interest rates, coupled with historic credit spread widening. In addition, a portion of our book value declined during the year related to upfront securitization expenses, as we were disciplined throughout the year and securitizing our warehouse population executing eight deals during 2022. During the fourth quarter, we did experience some book value recovery, which increased by approximately 3% as a result of recording GAAP net income available to common shareholders of approximately $7 million or $0.33 per fully diluted share. This was offset by $1.5 million of transaction related expenses, which were associated with the securitization that closed in October. We also remain active and share buybacks during the year, which contributed to book value accretion of approximately 2% for the quarter, and 7% for the year. During the fourth quarter, we repurchase approximately 850,000 shares at a weighted average price of $5.68 per share. For the full year, we deployed approximately $18 million of capital to repurchase 2.7 million shares at a weighted average price of $6.82 per share. Overall, we repurchase about 11% of our outstanding shares during the year at an approximate 40% discount to our December 31st adjusted book value. As a reminder, we authorized a $15 million repurchase program in August of 2022. And our remaining capacity under this program is $7.3 million as of today As T.J. noted earlier, beginning with the fourth quarter, we've decided to change the name of core earnings to earnings available for distribution, or EAD with no changes to the definition. Although as we've discussed in prior quarters, it continues to have important limitations, as it does not include certain earnings or losses our management team considers and evaluating our financial performance. On Slides 15 and 16, we provide the components of earnings available for distribution, as well as disclose a reconciliation of GAAP net income to EAD for the full year and the fourth quarter. On Slide 15, you can see that EAD for the full year was $0.08 per share. Overall, our net interest income on our investment portfolio exceeded our hedge cost, expense load and preferred dividends by $0.83, which was offset by losses contributed to EAD from Arc Home of approximately $0.75. It is important to note that EAD from Arc Home does not include mark-to-market gains on its MSR portfolio, which was a significant portion of its GAAP earnings during 2022. Arc Home gain on sale of loans sold to MITT approximated $6 million or $0.26 per share for the year, which you can see is also excluded from EAD. Turning to Slide 16, we present the fourth quarter EAD, which was $0.05 per share. Net interest income, inclusive of interest earned on our hedge portfolio exceeded operating expenses and preferred dividends, generating earnings at $0.18 per share. Lastly, we ended the quarter with total liquidity of approximately $87 million and as of today, liquidity was approximately $120 million with the increase primarily due to cash generated from our February securitization. Your line is open. If you look at kind of our historic leverage ratios over the last 12,18 months, so I think we've got kind of significant liquidity right now. Our expectation is over time that we'd be able to take out more liquidity from those securities, although realistically, that's although maybe some of them are under levered today. I think, broadly speaking, I think you have to see sort of that deleveraging occur before we could take out a ton more cash. Your line is open. The $0.05 implies a low-single-digit ROE, just kind of wondering how you're thinking about the timeline for getting to that 16% ROE on slide 10. So, I think on the earnings power, the reality is are quarter-to-quarter earnings, I think are going to be choppy, because of things like transaction expenses for securitizations, et cetera. That's obviously, I think showing a portfolio or company that has significant liquidity to invest that those yields, if not higher, in 2023 terms. And so that is how we're thinking about things in terms of the medium long-term, but I do think like the quarter-to-quarter numbers could still be choppy. I think we would obviously hope to take advantage of opportunities to employ to deploy this capital in a timely manner, as we think the opportunity set is probably going to present itself in the near-term. In terms of buybacks, I think depending on where we are on the stock price, we obviously have good liquidity to continue buying back stock accretively. Maybe just kind of on that one on the discount of book, appetite for some type of strategic transaction, whether it be rolling it back into the parent company or merging with a smaller company for some scale and operating leverage. This I think holistically we think the company is in a very good position, financially from the balance sheets perspective from a leverage perspective. Your line is open. I think if you think, no warehouse lenders lost money and obviously very volatile year last year and given the short duration of the asset, it's very desirable lend. I think, we also given sort of the broader pullback in the residential mortgage market. So, we've not seen our cost of financing go up, if anything, I think, it'll stay the same or get lower, we've also not seen advanced rates decrease or given the amount of folkâ\u0080\u0099s sort of looking to still enter this space or grow their warehouse positions for non-agencies. And I mean, the simple answer is I think we're looking at sort of a March 2020 COVID shock in terms of like credit spreads. Your line is open. We did sort of conveniently see the implementation, or maybe it hasn't been implemented yet, but it's been announced it will be implemented for May deliveries for Fannie and Freddie, new LPAs. So, we see opportunity there and given wide spreads, as spreads come in the private label market, the private label market will become increasingly competitive versus that bid. We think there's an opportunity, given the cash out market, more or less being shut out for key locks in second lien to take that space. So, I think we announced last quarter, we saw opportunities in securities. We were able to deploy a little bit of capital there, I think spreads tightened in December and kind of into January, where that's probably shifted back to loans. But I think we announced the market, we're open to taking advantage of those opportunities within call it new resi mortgage credit."
}