{
    "symbol": "PROV",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-26 13:49:08",
    "content": " Additionally, our single-family and multi-family pipelines are modestly smaller in comparison to last quarter suggesting our originations in the December 2022 quarter will decline from this quarter, but still remain within the range of recent prior quarters, which has been between $60 million and $95 million. For the three months ended September 30, 2022, loans held for investment increased by approximately 6% as compared to June 30, 2022, ending balances with increases in single-family and multi-family loans more than offsetting small declines in the commercial real estate and construction loan categories. Our net interest margin expanded by 12 basis points for the quarter ended September 30, 2022, compared to the June 2022 sequential quarter as the net result of an 18 basis point increase in the average yield on total interest earning assets and an 8 basis point increase in the cost of total interest bearing liabilities. Notably, our average cost of deposits increased by just 2 basis points to 13 basis points for the quarter ended September 30, 2022, compared to 11 basis points in the prior sequential quarter. 3.05% net interest margin this quarter was positively impacted by approximately 4 basis points as a result of lowered net deferred loan costs associated with fewer loan payoffs in the September 2022 quarter, in comparison to the average net deferred loan cost amortization of the previous five quarters. And to the extent that our growth rate with respect to the loan portfolio increases to such an extent that our deposits -- core deposits are not keeping up, we will be funding ourselves more wholesale and that will bring deposit costs up as well to the extent that brokered CDs are coming in, but that's only at the margin because again the base is stable, call it $950 million of a stable base, which will rise very slowly in cost in comparison to growth of the balance sheet, which will be funded at the margin with respect to wholesale deposits, federal home loan bank advances or other types of funding. So you can see that further quarter, I think our deposit costs went up by 2 basis points in comparison to the June quarter that was driven by the $30 million of brokered CDs."
}