{
    "symbol": "LASR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 13:27:02",
    "content": " Revenue grew 12% year-over-year in the first quarter to $24 million, representing 37% of total sales. More importantly, industrial revenues from customers outside of China increased 77% year-over-year to record $20.7 million. Total revenue for the first quarter of 2022 was $64.5 million, an increase of $3.1 million or 5% compared to the first quarter of the prior year and above the midpoint of our guidance range. Product revenue for the first quarter of 2022 was $51.1 million, an increase of $3.7 million or 8% compared to the first quarter of the prior year. Development revenue for the first quarter of 2022 was $13.4 million, a decrease of 600,000 or 4% compared to the first quarter of the prior year. The year-over-year decrease in product gross margin was driven by sales mix, and as discussed last quarter, decrease capacity utilization of our Shanghai manufacturing facility, increase investments in U.S.-based manufacturing and continued increases in production and freight costs. Non-GAAP operating expenses for the first quarter of 2022 were $18.2 million or 28% of revenue, compared to $15.1 million or 25% of revenue for the first quarter of the prior year. Adjusted EBITDA for the first quarter of 2022 was $2 million, compared with $6 million for the first quarter of the prior year, but well above our guidance range. Today we can meet a significant portion of our U.S. and non-China customer demand by utilizing inventory we had strategically put in place as part of our supply chain risk mitigation strategy, and through U.S. production capacity, but ongoing COVID related lockdowns and further disruptions to the supply chain have created significant uncertainty our operating activities, making it more challenging than typical to predict our business in the second quarter. I would not highlight 77% as the quarterly year-over-year growth target, but I think over time, we expect again the industrial business to be among the faster growing areas of our business."
}