{
    "symbol": "LASR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 22:14:01",
    "content": "  Revenue declined 10% to $242 million driven by a 62% decline in revenue to customers in China, which now represents less than 10% of our business. However, during 2022, we saw continued growth in our product revenue outside of China that grew 14% to a record $171 million. In particular, strong execution of our strategic growth initiatives enabled us to achieve 21% growth in industrial and Microfabrication revenue outside of China this year, which grew to record $133 million, more than double the revenues achieved in these markets in 2020. As our exposure to markets in China has decreased, we have increased our products revenue from customers outside of China by more than 50% since 2020. In the Microfabrication end market, full-year 2022 revenue declined approximately 11% to approximately $62.8 million due to a 51% year-over-year decline in China that began in the middle of the year and remained soft through Q4. Turning to the industrial end market, industrial revenue declined 4% year- over-year in 2022 to approximately $91.1 million, representing 38% of sales. Outside of China, however, industrial revenue increased 27% year- over-year to a record $81.9 million and more than doubled versus the full-year 2020. In the fourth quarter, industrial revenue increased 6% year- over-year to $23 million. More importantly, industrial revenue from customers outside of China increased 13% to approximately $21.2 million a record high. Finally, in Aerospace and Defense, our revenue declined 16% year-over-year in 2022 to approximately $88.2 million, representing 36% of total sales. In the fourth quarter, our defense revenue declined approximately 22% year-over-year to approximately $22.3 million, representing 39% of total revenue. Total revenue for the fourth quarter of 2022 was approximately $56.7 million, slightly above the midpoint of guidance, compared to $67.4 million for the fourth quarter of 2021. However, it is important to emphasize that, revenues for industrial and Microfabrication products outside of China increased 21% year- over-year to a new record of $133 million. Gross margins in the fourth quarter included approximately $6 million or 13 percentage points of products gross margin in non-routine inventory charges primarily related to business restructuring, including automation and elevated scrap and reserve charges."
}