{
    "symbol": "LESL",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-03 18:15:29",
    "content": " As you can see, the primary drivers of the change in margin rate are: number one, business mix, driven by acquisitions that disproportionately impacted margins in the quarter; two, incremental product costs in excess of retail price increases; three, incremental DC expense associated with the execution of our strategy to peak store and DC inventory earlier in preparation for pool season; and four, deleverage of occupancy costs driven by a decrease in comp sales. First, despite the macroeconomic and weather challenges in the quarter, our consumer file was flat versus the prior year's quarter and improved 200 basis points from our fiscal Q4 2022. For the first quarter, we reported record sales of 195 million, an increase of 6% or 10 million when compared to the first quarter of fiscal 2022. Our noncomparable sales totaled $17 million in the first quarter of fiscal 2023, which was driven by seven completed acquisitions that added 32 locations, as well as eight net new store openings since the end of fiscal 2021. Gross profit decreased 3% or 2 million when compared to the first quarter of fiscal 2022, and gross margin rate, which decreased in-line with expectations was down 290 basis points to 33.5% from 36.4% in the prior year. Adjusted diluted earnings per share was negative $0.14 in the first quarter of fiscal 2023, compared to negative $0.06 in the prior year. We ended the first quarter of fiscal 2023 with 430 million of inventory, an increase of 185 million or 76%, compared to 245 million at the end of the first quarter of fiscal 2022. And I know we've said that a lot, but again, trying to extrapolate trends from this first quarter, which is, a, small; and b, had a really outsized weather impact, I just think that's tricky. Again, when you think about that composition of product that we're bringing in early, it's high-turn product, top SKUs that we know we need for full season and where last year we talked a lot about, kind of getting behind the curve and replenishment cycle, we have more inventory available to distribute out to whether e-commerce, customers or to our retail locations to serve those consumers as season really gets kicked off."
}