{
    "symbol": "ASND",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 22:36:36",
    "content": " the U.S. â\u0080\u0093 excuse me, the commercialization of TransCon hGH for the EU market, our progress on our pipeline candidates and our expectations with respect to their continued progress, statements regarding our strategic plans, our goals regarding our clinical pipeline, including the timing of clinical results, statements regarding the U.S. market approval of SKYTROFA and our product pipeline candidates, statements regarding our planned filings, our extension â\u0080\u0093 our expansion into the new therapeutic areas and statements regarding our ability to create a sustainable leading global biopharma company. For TransCon PTH, we have reported positive Phase 3 data, which met the composite primary endpoint and all key secondary endpoint highlighting its potential to address a major unmet medical need for adult patients with hypoparathyroidism. We believe that we are well positioned to drive sustainable, long-term growth without 3 additional independent clinical product candidates in rare disease endocrinology and oncology that as the same algorithm for innovation that we used for SKYTROFA or TransCon PTH. These positive results were consistent across TransCon PTH treated adult patients, independent of their disease spectrum or conventional therapy dosed at baseline, which give me comfort that basically all adult hypoparathyroidism patients have the potential â\u0080\u0093 have the potential to benefit from treatment with TransCon PTH. Thanks, Jan. As Jan noted, we are in a very strong position to achieve Vision 3x3 to become a sustainable cash flow positive biopharma company with the U.S. commercialization of SKYTROFA, near-term regulatory filings for TransCon PTH, and nearly â\u0082¬1 billion on hand. Your line is open. And our obvious feeling that is give me comfort that if you in up to 2 years treating a pediatric population and not see anyoneâ\u0080\u0099s leave is because the seed Also feeling that itâ\u0080\u0099s very important to show to you what is happening in open-label extension because the first group, the 6-microgram group, other core as other low group in treatment, basic got switched up now to 100 micrograms because then you have basic and situation where you also can follow and patient group that were treated for 1 year with 6-microgram and then suddenly got switched up to 100 microgram and then see what is the expected outcome. Your line is open. We need to find how we can optimize the treatment received, so we really get the best out of CNP treatment and that is what we are hopeful we will get some clues about, we can give you some comfort that is possible when we come out with our data in Q4 with basic are coming from a patient group from age 2 up to age 10, because we also believe that should have a treatment option on the front. Your line is open. Your line is open. Your line is open."
}