{
    "symbol": "ASND",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 23:29:04",
    "content": " Examples of such statements may include, but are not limited to our U.S. commercialization and continued development of SKYTROFA for the U.S. market, the commercialization of TransCon hGH for the EU market, our progress on our pipeline candidates and our expectations with respect to their continued progress; statements regarding our strategic plans, our goals regarding our clinical pipeline, including the timing of clinical results, statements regarding the U.S. market approval of SKYTROFA and our pipeline product candidates; statements regarding our planned regulatory filings, our expansion into new therapeutic areas and statements regarding our ability to create a sustainable, leading global biopharma company. TransCon Human Growth Hormone or TransCon hGH is approved by the FDA in the U.S. under the brand name SKYTROFA for the treatment of pediatric patients one year older, weighing 11.5 kilograms and have growth failure due to inadequate secretion of endogenous growth hormone. As a reminder, the Phase III results at week 26 That data showed that 95% of TransCon PTH treated patient, that is 57 out of 60 patients, was able to eliminate convinced treatment, retail product doses of KCSM, software, Mint, and exit vitamin D. In addition, for key secondary endpoint to sip of our quality-of-life instrument show TransCon PTH treated patients reported significant decrease in disease symptoms and significant improvement in the physical function. Your line is open. So, we basically having positioned that as we also have seen from the data that Scott released, the majority of the patient is still coming from  patients, so still many of them will have daily growth hormone supply, and first of all, it will take some time before they have used up the daily growth hormone supply before they start with SKYTROFA. So basically, what we're doing here when we talk about net revenue, the basic at some of what I call basically a worst-case scenario, both we incorporate already at those states if that's a product recall and other things like that, because we don't want to be in position that we suddenly are in a position that we need to redo a lot of expected revenue basis on a net base because some wins incomes up in the end of the year. Your line is open. Your line is open. Your line is open. And this is a strategy that is built on not spending 120 million and generate $5 million in revenue, it's building and P&L play because we are a European company, essentially enough know what to do, because it's -- I've seen certainly not a lot of company coming into Europe and believe that is a place where you basically can execute and make a highly profitable business on what are called rapid global expansion. Your line is open. Your line is open."
}