{
    "symbol": "KRMD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 17:25:29",
    "content": " Q3 '22 revenue of $7.8 million and 28.5% growth marked our fourth consecutive double-digit growth quarter, and we saw strength across all of our businesses. The majority of this business comes from the growing SCIg market, where patients receive our reusable pump at the start of their therapy and the disposable consumables are delivered to their home once per month, generating approximately $750 per year in recurring revenue per patient. We are excited by the growth and momentum in both our core SCIg business and by our novel therapies pipeline and by the opportunity it presents, a $2.5 billion TAM, as the market for at-home subcu delivery continues to expand. I'm excited to report our fourth consecutive quarter of double-digit net sales growth, ending the third quarter with net sales of $7.8 million, a 28.5% increase from $6 million for the same period last year. Our domestic core business grew by 16.2%, or $823,000, and was primarily driven by increased volume growth ahead of SCIg market growth and label expansions, including prefilled syringes. Domestic core also benefited from clearing of $300,000, or 6% of domestic growth, of backorders from the second quarter of 2022. International net sales were $1.1 million for the 3 months ended September 30, up 46.8% compared with the same period last year, due to volume growth in several European markets. As a reminder, our outlook is rooted in several key drivers: SCIg market growth in the high single digits; plasma supply; clinical trial activity and expansion of the novel therapies pipeline; inflationary impacts, including labor and supply price increases; supply chain and labor shortage impacts; timely receipt of other receivable tax credits; and planned inventory reductions by year-end '22. For full year 2022, we are raising our revenue guidance to $27.5 million to $28 million, previously $27 million to $27.5 million, based primarily on the strength of our novel therapies pipeline and continued growth in the U.S SCIg market."
}