{
    "symbol": "KRMD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 21:38:02",
    "content": " We are excited by the positive momentum in the overall market and the year, including fourth quarter reported script growth of 17% and SCIg drug market growth of roughly 12%. In our geographic expansion efforts, we have seen positive momentum, with 8% year-over-year growth in our international core business driven by an impressive second half growth of 15% as we accelerated and focused our efforts internationally. Iâ\u0080\u0099m excited to report a strong year of approximately 19% double-digit growth with total net revenues of $27.9 million, an increase of $4.4 million. Domestic core growth was 11.3%, driven by increased volume attributed to SCIg market growth and new label indications, including pre-filled syringes. The international business showed strong second half results of 15% growth, led by new distributor revenue growth in Germany and a new label indication launched in several EU markets. Our Q4 net revenues were $7.3 million and represented a growth of 13.2%, novel therapy sales grew by 260% or $584,000 and was primarily driven by significant milestone progress related to an NRE innovation service agreement. Domestic core growth of 6.2% was driven by growth in FreedomEdge system revenues for pre-filled syringe payments, offset by store consolidations and a large specialty pharmacy account and the impact of lower SCIg script volumes from Q3. International core revenue was lower by 3.2%, driven by prior year timing of orders from two distributors, partially offset by new distributor growth in Germany and growth in other markets related to new label indications. We expect full year â\u0080\u009823 revenues of between $32.5 million and $33.5 million, representing growth in the range of 17% to 20%. These include core SCIg drug market growth of approximately 10%, pre-filled string penetration of 15% to 20%, expanding our novel therapies pipeline with 6 new collaborations, bringing our total number of collaborations to approximately 20 and two new 510(k) filings in the back half of the year."
}