{
    "symbol": "KRMD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 21:48:02",
    "content": " New subcutaneous patients start, the leading pillar of increasing our core SCIg penetration, was up 6.9% in the quarter, with our U.S. business outperforming this with 8.7% growth in the quarter and with FREEDOM pumps as a leading indicator, up 21% year-to-date. I'm excited to report our third consecutive quarter of double-digit net sales growth, ending the second quarter with net sales of $6.5 million, an 18.4% increase from $5.5 million for the same period last year. Starting with Q2 2021 and walking through the margin bridge from left to right, our total gross margin for the core business was 56.2% and was lower than prior year by 192 basis points due to amortization of manufacturing variances from the supply issues we experienced in Q1 2022, partially offset by a nominal increase in average selling prices. Total cash used in the first half of the year was approximately $7 million and was driven primarily by net losses and investments in our new headquarters of approximately $2 million, which will not be repeated, and also increases in raw material and work-in-process inventory. We expect in the second half of the year to reduce the cash usage by planning for lower net losses due to higher sales and gross margin improvements in line with our guidance; in addition, lower working capital, driven by raw materials and work-in-process reductions as we continue to transition our manufacturing to Command. As a reminder, our outlook is rooted in several key drivers: SCIg market growth rate in the high single digits; plasma supply, clinical trial activity and expansion on the novel therapies pipeline; inflationary impacts, including labor and supply price increases; supply chain and labor shortage impacts; timely receipt of equipment financing and credit; and planned inventory reductions by year-end 2022. We have met our third quarter double-digit growth, are making continued progress within the novel therapies pipeline and new deal advancements and our core domestic business is outpacing a rebounding U.S. SCIg market."
}