{
    "symbol": "EVOP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 21:43:06",
    "content": " First, we're delighted to announce that we've entered into a definitive agreement to acquire EVO Payments, significantly increasing our target addressable markets, enhancing our leadership in integrated payments worldwide; expanding our presence in new geographies; further scaling in existing faster-growth markets; and augmenting our business-to-business, B2B, software and payment solutions. Third, we reached a definitive agreement to sell Netspend's consumer portfolio to Searchlight Capital and Rev Worldwide from $1 billion to further align our businesses with our strategy while simultaneously enhancing our organic growth and margin characteristics. As expected, we will retain Netspend's B2B assets which delivered strong mid-teens normalized growth in the second quarter and will be included in our Issuer Solutions segment beginning with our third quarter. Post the acquisition of EVO and Netspend sale, Merchant Solutions will then represent approximately 75% of our adjusted net revenue; with Issuer Solutions, including Netspend's B2B assets, comprising roughly 25%. Merchant Solutions achieved adjusted net revenue of $1.43 billion for the second quarter, an 11% improvement from the prior year or 14% on a constant currency basis, ahead of our expectations despite our exit from our Russian business in the quarter. Our Issuer Solutions business delivered $459 million in adjusted net revenue, a 6% improvement on a constant currency basis from the second quarter of 2021, consistent with our expectations and long-term growth target for this segment. On a constant currency basis, we expect full year adjusted net revenue before dispositions to be in a range of $8.48 billion to $8.55 billion, reflecting growth of 10% to 11% over 2021. In combination with incremental adverse FX headwinds, the reclassification of Netspend's consumer assets to held for sale and the exit of our Russian business, we now expect to report adjusted net revenue in a range of $7.9 billion to $8 billion for calendar 2022. So if you look at what we report and what Josh said this morning, if you're growing like-for-like revenue, where I think ex Netspend, is something like 11% constant currency revenue growth, ex Netspend, a lot of that is going to fall to the bottom line because our business is all about how we generate incremental rates of revenue growth."
}