{
    "symbol": "SYTA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 12:35:24",
    "content": " This positive variance of $1.3 million or 111% was due mainly to the new revenue source earned from the SD7 and its related accessories in the quarter of $1.4 million, an increase in revenues from legacy rugged devices, offset by a decrease in sales of cellular boosters in the period. We have previously announced the SD7 has certified and approved for use with many North American carrier customers, including FirstNet and AT&T, Verizon Communications, U.S. Cellular and international channel customers, including Logic Wireless Europe, a leading distributor of business critical communication solutions across the United Kingdom, Australia, New Zealand and the Pacific Islands and TASSTA, a global mission-critical push-to-talk software provider and ESChat, a leading U.S.-based push-to-talk software provider. Iâ\u0080\u0099m pleased to report that the increase in number and signs of our aforementioned customer base translated into our much anticipated volume growth for our SD7, which was the primary growth driver of our rugged devices and related accessories which increased 588% year-over-year to $1.9 million in the third quarter. I think that one of the largest verticals for us is going to be the schools, the education market, and we recently put out a press release about a company that weâ\u0080\u0099re working with CrisisGo and CrisisGo makes very, very innovative SOS functionality for this type of a device for the SD7 and as there are millions of teachers in the United States, thereâ\u0080\u0099s up over 100,000 schools in the United States, we think that, thatâ\u0080\u0099s going to be a great market for us. But when youâ\u0080\u0099re going after a school or a hospital or a utility that are right now using radios, and youâ\u0080\u0099re at AT&T and youâ\u0080\u0099re saying, listen, forget your radios, we can do the exact same thing over a cellular network and youâ\u0080\u0099re not getting it from a small radio provider, youâ\u0080\u0099re getting it from AT&T, and itâ\u0080\u0099s not going to cost you much, itâ\u0080\u0099s only going to cost you $20 a month."
}