{
    "symbol": "VIRI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 14:37:05",
    "content": " The results were confounded, particularly when viewed in the context of both mechanistic data highlighting the role of active replicating herpes infection in patients diagnosed with fibromyalgia, as well as the results of our previously successful phase 2a Fibromyalgia trial. In stark contrast to the first half study in all this, the IMC-1 treated patients enrolled during the second half of the trial, which totaled 214 patients demonstrated a statistically significant improvement on the primary pain reduction endpoint at week 14 as well as statistically significant improvements in fatigue and fibromyalgia symptoms. Alternatively stated, we as a team believed the positive outcomes demonstrated in the patients recruited during the second half of the FORTRESS study, a sample of patients that is roughly one half the size we believe was required to demonstrate statistically significant pain reduction over the full trial required deeper exploration. However, as Greg mentioned, responses of patients enrolled in the second half of the trial from November to April 2022 were consistent with the expected efficacy profile IMC-1 and at all time points, the safety and tolerability of IMC-1 was outstanding. In the original post hoc first half second half analysis that Greg mentioned, the subgroup of patients recruited from November to April demonstrated statistically and clinically significant improvements with half the original plan sample size. First observation is that post hoc analysis of the FORTRESS trial results indicate that FM patients who were new or naive to clinical research studies, which we will call new patients, demonstrated clinically and statistically significant reductions in pain, fatigue, fibromyalgia symptoms, anxiety and depression symptoms. In contrast, enrolled patients who are prior-Fibromyalgia trial participants and our study site database patients, who we will call experienced patients now appear to represent a more treatment refractory or treatment resistant cohort of patients, and they did not exhibit a meaningful treatment benefit in this study in either timeframe. While we can't guarantee that future research will be conducted in a COVID free environment, we're confident in IMC-1's potential when targeting new patients who we believe represent our optimal patient target moving forward, given that they demonstrated lower placebo response rates, and the expected drug response rates irrespective of which half of the study they were recruited in. We do believe in summary that the fortress data reveal that fibromyalgia patients that are new to research are an excellent target for progression of IMC-1 development ideally to phase three, based on the demonstration of significant IMC-1 benefits including reduction in pain reduction and fatigue, improvement in overall fibromyalgia patients symptoms and an improvement in overall patient's global health."
}