{
    "symbol": "TKR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-06 14:15:03",
    "content": " And we achieved record fourth quarter adjusted earnings per share of $1.22, up 56% from last year and over 20% than our next best fourth quarter. Organically, fourth quarter sales were up 10.2% from last year driven by strong growth across most end markets and sectors, and with healthy contributions from both volume and pricing. Turning to slide 16, adjusted EBITDA in the fourth quarter was $186 million or 17.2% of sales compared to $135 million or 13.4% of sales last year. Overall, we delivered an incremental EBITDA margin of 68% on the higher sales driven by our positive price cost performance, which enabled us to expand margins by 380 basis points, versus the fourth quarter of last year. Process Industries adjusted EBITDA in the fourth quarter was $143 million, or 24.4% of sales compared to $105 million, or 20% of sales last year. In the fourth quarter, Mobile Industries sales were $496 million up 3.3% from last year, organically sales increased 6.4% with the off highway and rail sectors posting the largest revenue gains. On the bottom line, we expect record adjusted earnings per share in the range of $6.50 to $7.10 per share, which represents around 5% growth at the midpoint versus last year on a comparable basis. And I would expect a modest step up from Q4 to Q1, and then further sequential pricing and gains through the year like we've done the last couple years, I think the difference this year could be if steel prices moderate, then there would be a little more netting, which again, we factored into that more than 2% outlook for the year. Yes, I would just say Dillon, in 2022 with some movements in the currencies, and on the transaction side, we had some transaction favorability in 2022, which was actually, it was a margin tailwind actually helped our margins in 2022 and really, the non-recurrence of that -- of those positive gains in 2022 kind of not repeating in '23, coupled with the continued headwind on the top line, is going to produce year-over-year, pretty significant headwind to margins, just by the flip of that, if you will, from one year to the next. And then, as you know, M&A comes in at really an EBITDA margin, when you back it out, our organic incrementals with the pricing and operational execution cost moderating I mean, the organic incremental implied in the guide would be much closer to 30% versus 20% and I think that speaks to a lot of the work we've been doing the last year, year plus in getting the price cost move in our favor."
}