{
    "symbol": "TGTX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 14:06:10",
    "content": " The fourth quarter of 2022 was a milestone movement for TG as we received FDA approval of BRIUMVI to treat adult patients with relapsing forms of multiple sclerosis, also referred to as RMS, which includes clinically isolated syndrome, relapsing remitting disease, an active secondary progressive disease. Weâ\u0080\u0099re approximately four weeks post-drug availability, so itâ\u0080\u0099s still quite early, but Iâ\u0080\u0099m excited to share some initial insights and color around our progress and the reaction weâ\u0080\u0099ve been seeing at BRIUMVI in the MS community. As part of this comprehensive program, we provide robust financial assistance program for eligible patients including copay assistance, quick start and coverage interruption programs, and weâ\u0080\u0099re appropriate a program that will provide BRIUMVI at no cost to eligible patients who may have challenging â\u0080\u0093 who may have challenges accessing BRIUMVI. Iâ\u0080\u0099m very happy to share that we now have coverage policies in place for approximately 35% of covered lives across the U.S. We are extremely pleased by these early coverage decisions and we believe it validates our pricing strategy and reflects BRIUMVIâ\u0080\u0099s strong clinical profile and value proposition, and of course, the hard work of our payer and national account teams. We look forward to working with providers, patients, payers, and advocates to continue to broaden access to BRIUMVI for patients with relapsing forms of MS. And given that weâ\u0080\u0099re only a few weeks into the launch and weâ\u0080\u0099ll not go into a lot more detail at this point, but Iâ\u0080\u0099m very pleased with where we are to date and look forward to sharing more progress in the next quarterly call. Our $53 million net loss in the fourth quarter of 2022 was an increase of $17 million quarter-over-quarter from Q3 of 2022, where we saw a GAAP net loss of approximately $36 million, which was primarily the result of a one-time milestone payment triggered by the FDA approval of BRIUMVI, which was expensed in Q4 of 2022."
}