{
    "symbol": "JXN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 14:15:17",
    "content": " A number of important factors, including the risks, uncertainties and assumptions discussed in risk factors and managementâ\u0080\u0099s discussion and analysis of financial conditions in the companyâ\u0080\u0099s 2021 Form 10-K and the most recent first quarter 10-Q could cause actual results to differ materially from those reflected in the forward-looking statements. In addition to our second quarter results, weâ\u0080\u0099ll discuss Jacksonâ\u0080\u0099s financial strength, our continued capital return to shareholders and our favorable business outlook. Despite a challenging market, our disciplined approach to risk management and the profitability of our healthy book resulted in strong capital levels that both are operating and holding companies. Looking forward, we see a clear path to achieving our 2022 capital return target and remain confident in our long term capital generation. For the second quarter, we reported net income of nearly $3 billion, driven by sizeable net hedging gains that protected our business during equity market stress conditions. Our hedging strategy performed as intended preserving statutory capital during periods of significant stress, which was evident in our healthy and growing operating company RBC ratio. Although market volatility was high during the quarter, some benefit of higher rates was realized in hedging costs that were largely in line with our guaranteed benefit fees. From an operating standpoint, we focus on adjusted operating earnings excluding notable items, which were 481 million for the quarter driven by the impact of the equity market on separate account fees. This quarter, our asset base commissions declined, which partially offset the market impact on our fee income. Separately, we also realized to benefit from lower stock based compensation expense in the quarter, reflecting our June 30 share price. Throughout the quarter, we were once again deliberate in returning capital to shareholders, which totaled $116 million, and included share repurchases and shareholder dividends. In the second quarter, we also completed the last step in our re-capitalization and issued senior notes to repay term loan debt. And yesterday, we announced approval of our third quarter dividend of $0.55 per share an indication of the sustainability of our cash flow and our long term commitment to return capital to shareholders. Throughout this period of market uncertainty, we remain well-positioned as a market leader with stable and highly valued service that our distribution partners and policyholders have come to expect and rely upon. Given the weak equity market and demand for principal protection, traditional variable annuity sales declined across the industry, including for Jackson. However, our asset retention remains high, consistent with our experience and expectations of policyholder behavior during periods of market volatility and highlights the long term value proposition or annuities provide over the course of market cycles. Annuity industry sales for the quarter are estimated to have reached a record of over 77 billion, due largely to a shift towards fixed and fixed indexed annuity products. For the industry RILA sales growth continues and second quarter sales were over 10 billion, while traditional VA sales were 15 billion. We see continued value in the diversification benefits, cost effectiveness, and stable statutory capital generation this business provides. We have returned 308 million through share repurchases in shareholder dividends during the first half of this year, which highlights our commitment to providing shareholder value. Last quarter, we stated that our adjusted RBC range of 500% to 525% represents a long term target during a normal market condition. While our adjusted RBC was slightly below our long term target this quarter absent the nuances of the calculation of this metric under stress conditions, the ratio would have been within the target range. Cash at our holding company exceeded $800 million well above our minimum buffer, and the excess represents nearly two years of current holding company expenses and shareholder dividends. During the second quarter, our capital formation exceeded our capital return to shareholders. While our adjusted RBC provides insight into capital across the company, we know that sustainable capital return is supported by both the current balance sheet strength of our operating company and its ability to continue to generate statutory capital. The largest driver was higher deferred acquisition cost amortization, resulting from lower comparatives separate account returns, but it was also impacted by lower fee income from reduced separate account assets under management, as well as lower limited partnership income. As a reminder, we believe Jackson has taken a conservative approach to the treatment of guarantee fees within our definition of adjusted operating earnings as all guarantee fees are moved below the line, with no assumed profit on guaranteed benefits included in adjusted operating earnings. In the second quarter strong net income resulted in a growing adjusted book value, even after returning 116 million to shareholders in the quarter. For more transparency, weâ\u0080\u0099ve included a slide in the appendix that provides some helpful directional guidance for the change in the LDTIs shareholders equity impact for movements in various market factors. Slide 6 outlines the notable items included in adjusted operating earnings for the second quarter, starting with a market driven acceleration of DAC amortization expense. In the second quarter of 2022, there was market driven acceleration of amortization resulting in a $227 million increase in DAC expense in the quarter on a pre-tax basis. In contrast, in the second quarter of 2021, there was a deceleration of amortization, resulting in a pretext $72 million reduction in DAC expense, primarily due to a 6.5% separate account return in that period, which exceeded the assumed return. As a result, the market driven DAC effect was a net negative impact of 299 million on a pre-tax basis when comparing the current second quarter to the prior year second quarter. Additionally, we would note that the second quarter of 2022 included lower levels of limited partnership income, compared to the same period in the prior year. Limited partnership income, which is reported on a one quarter lack was slightly below the annualized long term expectation of 10%, which led to earnings being $11 million lower in the current quarter than they would have been heavy turns matched the long term expectation. Comparatively in the second quarter of 2021 LP income was well above the long term expectation, with a benefit of 61 million to earnings, creating a comparative pre-tax negative impact of $72 million. In addition to the notable items, the second quarter of 2022 had a lower effective tax rate than the prior yearâ\u0080\u0099s quarter. Second quarter 2021 pre-tax operating earnings were higher than the current year quarter, which meant that the tax benefits that were similar on $1 basis and these two periods lead to a larger reduction to the effective tax rate in the current period. Adjusted for both notable items and the text effects, earnings per share was down from the prior yearâ\u0080\u0099s quarter, primarily due to the reduced fee income resulting from lower average AUM. Slide 7 provides insight into the impact of rising interest rates to the results of our VA business, both immediately and going forward. Unlike the first quarter, where reserves were floored at both the beginning and the end of the period, this was less of an issue in the second quarter, as declining equity markets led to increasing reserves, and this reserve increase was partially mitigated by the higher level of interest rates. As I discussed last quarter interest rates are also a key driver of hedging expenses, both in the cost of the hedging instruments used to protect our book which is driven by short term rates and in the volume of hedging necessary to stay within our risk limits, which is driven by longer term rates. In the first quarter, we disclosed that our hedge spend was above our fees which impacted our capital generation. In the second quarter, our hedge spend declined and was roughly in line with fees despite continued market volatility. As we show in the appendix slide, which covers the gap below the line impact from macro economic factors under current GAAP rules, higher rates, and lower equity markets are a combination that leads to significantly positive net hedging results. As shown in the table, the total guaranteed benefits and hedging results or net hedge result was a gain of $2 billion in the second quarter. Starting from the left side of the waterfall chart, you see a robust guarantee fee stream of $765 million in the second quarter, providing significant resources to support the hedging over guarantees. These fees are calculated based on the benefit base rather than the account value, which provides stability to the guarantee fee stream and protects our hedge budget when markets decline. There was a $2.8 billion gain on freestanding derivatives, which was driven by gains on equity hedges in the quarter as a result of declining equity markets. There was a loss of 772 million on net reserve an embedded derivative movements, which were also driven by declining equity markets, but partially offset by higher interest rates. Now letâ\u0080\u0099s look at our business segments starting with retail annuities on slide 9, where we see resilient sales in the face of significant market volatility. As Laura mentioned, variable annuity sales are down industry wide, which is not inconsistent with prior periods of equity market decline. Importantly, our sales without lifetime benefits as a percentage of total retail sales increased from 35% in the second quarter of last year to 38% in the second quarter of this year. Looking at pre-tax adjusted operating earnings on slide 10, we are down from the prior year second quarter. As of the end of the second quarter, we have built up 735 million of account value on RILA and as Lauren noted, we recently passed the $1 billion mark of total cumulative sales since our launch in October. Higher interest rates are allowing for more frequent re-pricing of our fixed and fixed index products, helping to make them more competitive in the marketplace going into the second half of the year. We reengaged in institutional sales late last year, and this continued through the second quarter of 2022 with 201 million of sales. We see the value of the institutional business is broader than just GAAP earnings, as it provides a diversification benefits is cost effective and helps to stabilize our statutory capital generation. In the institutional segment, our pre-tax adjusted operating earnings of 19 million during the second quarter of this year was up from 6 million in the prior yearâ\u0080\u0099s quarter, primarily due to increased net investment income. Lastly, our closed life and annuity black segment reported a decline in adjusted operating earnings compared to the prior year reflecting lower levels of limited partnership income. As Lauren noted, we managed our exposure through a challenging market, successfully maintained our financial strength and continue to make progress toward our capital return goals. We believe that this level provides us the financial flexibility to navigate potential market volatility, as well as any future accounting impact of LDTI. Moving on to statutory capital, our primary operating company Jackson National Life Insurance Company reported a total adjusted capital position of $8.7 billion, up from 5.4 billion as of the first quarter. Importantly, despite the heightened volatility, our hedging span was roughly in line with our fees this quarter, in part due to the benefits of higher interest rates discussed earlier. Taking into account both the tech and the CAL movements the estimated operating company RBC increased from the first quarter and was above 450%, a very healthy level of capitalization at the regulated entity. This quarter, we are speaking to both our operating company RBC and adjusted RBC, to provide additional transparency and clarity into our capital position, capital generation and adjusted RBC target definition. Since separation, weâ\u0080\u0099ve primarily focused on our adjusted RBC as the best representative the companyâ\u0080\u0099s capital position and was agnostic to capital movements between the holding company and the operating company. Additionally, we defined the 500% to 525% adjusted RBC ratio target as an RBC target range under normal market conditions. Most importantly, as previously stated, and adjusted RBC target for normal market conditions, is not intended to be an official barometer of Jacksonâ\u0080\u0099s excess capital, or ability to return capital to shareholders. At the end of the second quarter, the adjusted RBC ratio was down modestly and slightly below the normal market target range. The other was the fact that during periods of stress, which would not be considered normal conditions, the CAL can move materially from quarter we experienced this in the second quarter where the increased CAL reduced the RBC ratio benefit of the excess cash held at the holding company. Without this CAL effect on excess capital at the holding company, the adjusted RBC ratio would have been roughly flat and still within our target range. During the market stress, this quarter, the adjusted RBC level and movement was less meaningful in terms of providing a lens into quarterly capital development. Under these circumstances, the increase in the operating company RBC ratio gives a clear indication of the performance of our underlying business and hedging program. Despite the reduced benefit to the adjusted RBC ratio, our holding company cash position exceeds 800 million and continues to be well in excess of our minimum buffer. In summary, we are pleased to have continued to stay ahead of pace on our capital return target, increased operating company RBC in a very difficult market environment, maintain significant excess holding company cash and to be operating below our target leverage range. As a reminder, when we separated we established a 325 million to 425 million capital return targets in the first 12 months, and we reach this target within the first six months of our spin off. In summary, the second quarter demonstrated the continued resiliency of both our business and our balance sheet. But I think what weâ\u0080\u0099re seeing is that through market cycles, weâ\u0080\u0099ve historically operated in a 400% to 500% RBC range. So weâ\u0080\u0099re, I think you can see from quarter two as an example, how resilient our businesses and how strong our risk management program is under stress, and as weâ\u0080\u0099ve shown in some prior materials for our investor day, our analysts, excuse me, there were some examples shown of other prior past stress periods where we were able to maintain a really stable RBC, all things considered. Yes, we have looked at possibilities for flow reinsurance in the past, but just havenâ\u0080\u0099t necessarily come to anything that has met our target returns and kind of filled the whole picture in the way we would like it to but weâ\u0080\u0099ve also done that under a lower interest rate environment. Thanks, and good morning, I think you made the comment in your prepared remarks that capital formation in the quarter was above the capital that youâ\u0080\u0099ve distributed. So first of all, I guess we want to just step back and kind of look at the performance of the quarter and recognize that we saw during a volatile market period we saw positive RBC generation as an operating company. And we can see that relative to the impact of the capital return on our RBC, and that definitely is a favorable relationship there in terms of the ability to cover off the capital return with the capital that we generated during the period. And we continue to expect, as we go forward, two additional benefits that we saw begin to emerge in the second quarter with regard to hedge spend under the higher short rates. And so we think, as we look at those two items, certainly have seen benefits already kind of emerge a little bit here in the second quarter, and then with recent actions would expect those to continue. I think on the last quarter call, you talked about expectations for annual dividends in the kind of the $500 to $700 million range. Well, at this point, and I think consistent with what we did for 2022, weâ\u0080\u0099ll have to wait until we see how our year end results play out before weâ\u0080\u0099ll know what weâ\u0080\u0099ll be doing with regard to any kind of dividend out of the operating company. But just as weâ\u0080\u0099ve said before, we are operating in a position thatâ\u0080\u0099s very consistent with what weâ\u0080\u0099ve done for many years, and weâ\u0080\u0099ve routinely been able to get dividends out of the operating company. Yes, the interaction you saw with hedges typically what happens is when we get to more volatile markets, often one of the things that we need to do both to be more nimble and to just to deal with the overall cost is shorten up hedge experts, which is something that you would have seen coming into the year with both low rates coming into the year. And as the market became more volatile, as Marcia alluded to, we would see things changing rates going higher and ball coming down a little bit, weâ\u0080\u0099ve been able to extend maturities, weâ\u0080\u0099ll back out. I mean, we can sort of see just based on what youâ\u0080\u0099re saying, on year end â\u0080\u009820 versus where you sort of are communicating today having a much less material impact, that thereâ\u0080\u0099s probably still a fair amount of net income movement under that accounting framework. I think we will take the same approach, largely driven by kind of the way reserve movement come through back 157, where you have sort of that higher level of interest rate sensitivity, that comes from more of a market consistent or fair value type approach whereas I think when you see a healthy block of business, like we have, the primary risk, really in the business comes from the equity markets because unless you have poor equity market performance, youâ\u0080\u0099re not going to have future benefit payments that you need to make. So, I think we would continue to have that same view as we move forward, that there will be certain elements that will flow through non-operating income, that will result from just kind of a mismatch between the way the assets and liabilities will be moving. So if we can achieve higher yields on the investment and a higher interest rate environment, then naturally we would be able to pass that on through a higher accredited rate and a higher value proposition for the consumer and still maintain our same level of return. But as the volatility in your stock year-to-date, and particularly over the past quarter, changed your view at all on the value of having more of a first dollar hedging program. I donâ\u0080\u0099t think weâ\u0080\u0099ve had any change in our view, I think we have had a really strong record of good performance out of our hedge program, the way itâ\u0080\u0099s worked, I think we recognize that weâ\u0080\u0099re also still in a new company and some of the volatility maybe related to the fact that that track record isnâ\u0080\u0099t necessarily as familiar to everyone as it is to us."
}