{
    "symbol": "WMS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-05 18:38:08",
    "content": " And welcome to Advanced Drainage Systems, First Quarter Fiscal 2023 Results Conference Call. My name is Brika, and I am your operator for today's call. I would now like to turn the presentation over to your host for today's call, Mr. Mike Higgins, Vice President of Corporate Strategy and Investor Relations. With me today I have, Scott Barbour, our President and CEO, and Scott Cottrill, our CFO. Actual results may differ materially from those forward-looking statements because of various factors, including those discussed in our press release and the risk factors identified in our Form 10-K filed with the SEC. While we may update forward-looking statements in the future, we disclaim any obligation to do so. You should not place undue reliance on these forward-looking statements, all of which speak only as of today. With that, I will turn the call over to Scott Barbour. We achieved a record $914 million in sales in the first quarter, an increase of 37% compared to the same period last year. Sales growth was primarily driven by strong demand across our geographies and construction end markets, supported by continued strength in our priority states. We saw attractive volume growth in Allied Products, Infiltrator and within our residential end market, driven by share gains from our storm sewer pipe and on-site septic products. Pipe volume in our nonresidential and agriculture end markets started slower than anticipated due to a wet spring for agriculture, job site delays, production limitations and difficult comps relative to the last year. However, volumes improved month-over-month through the end of June and into the second quarter. And working closely with our distribution partners, engineering partners and contractors to monitor market demand, we collectively remain bullish on activity through fiscal 2023. Infiltrator sales increased 31%, driven by favorable pricing and strong volumes of septic tanks and Storm Tech chambers. Although housing growth has slowed from the previous levels, Infiltrator has a good line of sight is continued if somewhat moderated growth for the remainder of fiscal 2023, given its healthy backlog and the impact of new capacity additions that will accelerate share gains. Looking beyond Infiltrator into the legacy ADS residential business, performance was strong overall. Growth was robust in both our residential segments with growth related to single-family and multifamily development increasing 75% year-over-year led by share gains against traditional materials, pricing, and demand in single-family subdivision development and multifamily development. Our retail segment increased 40%, primarily driven by pricing. Project identification, quoting, and order activity remains positive in the horizontal low-rise type of non-residential projects we participate in including warehouse, distribution centers, commercial, and institutional projects. Rounding out our topline performance international sales increased 9% this quarter, driven by sales growth in our Mexican and exports businesses. Moving to profitability, our adjusted EBITDA increased 80% this quarter. Favorable pricing continued to cover inflationary cost pressures on transportation and labor as well as raw material costs, which have moderated, but remained elevated as compared to previous years. Overall, our backlog and cadence of orders remain favorable as well as our ability to capture price in the market. While there is uncertainty around the current macroeconomic environment, especially in residential construction, the momentum we are seeing in project identification quoting book-to-bill and order trends gives us confidence in our ability to achieve the updated guidance we issued today. As previously announced in May, Bob Kidder retired as Chairman of our Board of Directors effective as of our Annual Shareholder Meeting on July 21st, 2022. We also elected Kelly Gast to our Board of Directors at our Annual Meeting on July 21st, 2022. Lastly, we issued our fiscal year 2022 sustainability report this week. With that, I will turn the call over to Scott Cottrill to further discuss our financial results. On slide five, we present our first quarter for fiscal 2023 financial performance. From a topline perspective, we generated significant growth year-over-year across our business. Legacy ADS pipe products grew 36%, Allied Products sales grew 5.4%, and Infiltrator sales increased 31% with double-digit sales growth across our domestic construction end markets. Consolidated adjusted EBITDA increased 80% to $299 million, resulting in an adjusted EBITDA margin of 32.7% in the quarter. As Scott mentioned, favorable pricing continued to cover inflationary cost pressures related to our material input costs, transportation, and labor. From a resin perspective, costs have moderated a bit but they remain at elevated levels from a historical perspective. Price cost continues to be favorable due to the pricing actions we've already taken and as we move through the year, we expect price cost to remain favorable. Moving to slide six, we generated $214 million of free cash flow year-to-date compared to $79 million in the prior year. Strong growth in adjusted EBITDA coupled with improvements in working capital helped drive significant free cash flow generation, which was approximately 71% of our adjusted EBITDA for the quarter. From a capital allocation perspective, our priority remains focused on investing organically in the growth of our business to increase our competitive position and accelerate market share gains. For the full year, we continue to expect between $150 million and $180 million in capital expenditures with our largest investments focused on future growth followed by our productivity and automation initiatives. In addition, we are monitoring our acquisition pipeline to identify opportunities that fit within our solutions offering, strategically increase our pipe capacity and grow our recycling capability to support the growth of the business. Lastly, we continue to opportunistically buyback shares as part of our share repurchase program. In the first quarter, we purchased 800,000 shares for a total of $67 million. And in June, we issued $500 million of six 3/8 senior unsecured notes due in 2030. Overall, our liquidity and leverage position remains strong with over $1 billion of liquidity and a trailing 12-month leverage ratio of 1.1 times. While there is uncertainty in the market, particularly, in residential construction the strength we are seeing in our leading indicators including project identification, quoting, book-to-bill and order trends give us confidence in the updated guidance we are issuing today. So a question on that I guess the last point you made there Scott C. The -- sounds like the second half expectations haven't changed in your basically what you saw in Q1 and to-date in Q2 I don't want to put words in your mouth, but it sounds like that's the bulk of the change. I think if you look at the EBITDA bridge in the earnings presentation for the first quarter, it gives you kind of that sense of the trends that we're seeing. Again, as we've often talked about we have really good visibility as you go out three-plus months. So really as we looked at kind of the guide and the performance, we kind of looked at again that first quarter performance that we had those favorable trends kind of, what we're seeing through July into the second quarter. But again, some very favorable trends that we're monitoring as we go through. I think it's important to highlight again, price cost we see that covering that as we go through the entire year quarter-over-quarter -- I'm sorry year-over-year as we do that. But again, very favorable trends, line of sight and kind of just leaving it for kind of a 1H, 2H look right now. And second one just taking a step back on, sort of, the longer-term profitability. So now I mean you're guiding this year to 350 basis points of margin improvement at the midpoint and the long-term guide was, I believe, 400 to 500 basis points. Yes, Matt, it's Scott here again. If you remember at Investor Day, for three-year, the planned horizon that we put out there, we did say 400 to 500 bps margin expansion. But suffice it to say, the management team is very happy with the trends in performance that we see, so I'll just leave it at that. I would just say, it's the first quarter of the first year of that plan. And we kind of had some line of sight on that price cost, as we came out of last year. We didn't think it would be to this magnitude, but we did have an idea that we could front-end load that, which we view as good, front-end getting ahead of the plan. Well, thank you both and good luck in the next quarter. But on the margin side, obviously, exceptional margins in the quarter. I certainly understand all the price cost commentary you've been making, Scott. Good morning, Michael, Scott Barbour here. So kind of the volume got better, the leverage got better, our performance, particularly in deliveries got better. And then, from a capacity perspective, obviously, you're doing more work in the Infiltrator campus right now. I mean, the equipment there has meaningfully impacted the Allied product and the Infiltrator tank sales. But you are correct in that, there is additional capacity needed outside of just the Southeast and the Eastern seaboard where most of that new pipe equipment went that would allow us to get volumes up better, or more aligned with when the customer wanted it. So I kind of think of it as like, peaking capacity of pipe and our ability to kind of produce that more on demand is something we can improve upon, will be further investment, gives us upside potential as we go forward. Is that kind of -- I think, that was the question. So pipe volume is positive in everything, but the retail shipments and agriculture shipments. I mean, that small negative of $3.3 million in the bridge is really driven by a wet spring, which impacted agriculture some northern markets of non-res and we saw that recover late in the quarter and in July. And Michael, it's Mike Higgins. So the leading indicators, that you guys talked about, obviously part of it is the trend you're seeing through this July time period. But maybe just a little more depth on, what you're seeing on the leading indicator side. So the way we look at that is we look at, when we start working with a contractor or a developer on a project, that's a project formation. And I'm talking about the pipe side right now, which is driving the Allied Products, which is driving the residential pipe, which is driving the nonresidential pipe. In addition, the agriculture segment is going to be pretty good. We saw good order increases in that over the last 30, 60 days and that will mature in October, November. We're watching it, but it's too early to call. And right now we are very confident that -- let's call that residential piece tied to starts and completions that drives the on-site septic, it's right on plan. I mean, it's falling right in there nicely where we wanted to. Obviously, you're not really competing a lot with other folks who have resins and input. So price cost is good but maybe relative to some folks, who are looking at it a bit differently. We had a price increase in March, also that's stuck. So it's still -- we're still kind of getting some of the benefits from that, Josh. It's just we're not further increasing their prices, unless something happens and we feel we need to go do that. And we feel very good about where we are right now on our price levels, and our ability to be competitive, and win what we want to win in the market. That's a good segue to my next question is, obviously you guys are benefiting immensely right now from what's going on, on price cost, and the good volume and all that kind of stuff. And we might talk -- well honestly, we haven't had to toggle the pricing much to go win what we want to go win. But I would say that versus a year ago Josh, where we were actively staying on the sidelines particularly in the agriculture market because, we didn't have material, we didn't have capacity, we are not in that situation now. So we think we want to toggle to get something we'll do it, but we're not going to do it to the extent where we compromise this bridge on a price cost right nowâ\u0080¦\n I would add one comment. Yeah, I was going to say versus using pricing as a toggle I think what we've kind of learned through the demand environment with the strong demand in these inflationary cost pressures is you can get share by improving service and availability. So, I think really what we've been focused on so far is let's not use price to do that. Clearly, what we've done there, where we like I said we really haven't had a toggle much, if at all. I mean, it's astounding the number of trucks we're rolling every day right now. So that's a very good point, Mike. Hey, good morning guys. So again, as you look at our EBITDA bridge and you see that volume again different â\u0080\u0093 based on the different segments we have Allied and Infiltrator up pipe down. But still getting a lot of pricing year-over-year, we look at it sequentially as well as that year-over-year trend. So again, I'll answer the last part of your question first. When you go back and look, I've been here seven years, I've been in different resin environments resin going up, resin going down. So I would tell you that, again, it's going to be market dynamics. Everybody always defaults to resin, it's much more than that. It's transportation, it's labor, it's that value proposition and as Mike and Scott were just talking about that ability to serve and that availability of product in the right place at the right time. So when you talk about pricing and keeping it, it's much more than just talking about resin. We talked in our prepared remarks about that price cost being favorable in the first quarter and the fact that, we see it being favorable as we move through the rest of the year. So a high confidence level there, again, it's a key part of our playbook, if you will, but we're also not letting up on productivity initiatives, CI initiatives lean. The capacity that we've added, we always said that, Infiltrator was going to add that capacity first. And we've seen it really and Scott mentioned, it as well on the tanks, on the Storm Tech product that they make that goes into Allied Products. Having that inventory being out there to service the demand that, we've had we've really seen that come through in a powerful way. And that's one of those favorable trends that we mentioned that, we saw in the first quarter that, we're looking forward to as we go into Q2 and beyond. This is Scott Barbour, and we continue to make a lot of progress in Texas in a public approvals, I think our sales in Texas were up like 49% or something like that. So very strong quarter in Texas, we're not through the whole approval process yet. Lots of hard work by the people in the company at ADS, Infiltrator, Cultec unbelievable kind of journey that we're going through together in this year. It's turning out different than last year, but a good start."
}