{
    "symbol": "LU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-24 02:29:04",
    "content": " Our core small business owner segment, which makes up 87% of our new loans facilitated excluding customer finance loans, has been significantly impacted by the deteriorating macro environment in the third quarter. In the third quarter of 2022, data from market analysts suggest that GDP share of cities with high- and medium-risk pandemic controls increased versus the second quarter, which we believe is having a broader impact on small businesses, given a backdrop of declining business and customer confidence. As a result, third quarter profit was CNY 1.4 billion, declining 67% versus a year ago. As a result of progressively tightened credit standards, new loan volumes were CNY 123 billion, declining 27% versus a year ago. Third quarter revenues declined by 17.2% versus a year earlier to CNY 13.2 billion, and our outstanding balance of loans facilitated declined by 1.3% versus a year earlier to CNY 636 billion as of September 30, 2022. During this quarter, while technology platform-based income decreased by 30.3% to CNY 6.7 billion, our net interest income grew 21.5% to CNY 4.6 billion, and our guaranteed income grew by 44.1% to CNY 1.9 billion. In terms of wealth management, our platform transactional service fees decreased by 22.1% to CNY 364 million in the first quarter from CNY 467 million in the same period of 2021. Our other income, which mainly includes account management fees, collections and other value-added services charged our credit enhancement partners as part of the retail facilitation process, was negative CNY 129 million in the third quarter of 2022 compared to CNY 997 million in the same period of 2021. Our total expenses, excluding credit and asset impairment losses, finance costs and other losses decreased by 12.7% year-over-year to CNY 6.7 billion in the quarter. Our total sales and marketing expenses, which mainly include expenses for borrowers and investor acquisition costs as well as general sales and marketing expenses, decreased by 11.7% to CNY 4.1 billion in the third quarter. Our general and administrative expenses decreased by 36.8% to CNY 592 million in the third quarter from CNY 937 million in the same period of 2021, thanks to our stringent cost control measures. Our operations and services expenses decreased by 3.6% to CNY 1.6 billion in the first quarter from CNY 1.7 billion a year ago, mainly due to the decrease of transparent management expenses and our effective expense control measures. Our finance costs increased by 82.1% to CNY 306 million in the first quarter of 2022 from CNY 168 million in the same period of 2021, mainly due to the increase in interest expense."
}