{
    "symbol": "LU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 03:34:06",
    "content": " During the first quarter our total income grew by 13.5% year-over-year to RMB17.3 billion, and net profit increased by 6.5% year-over-year to RMB5.3 billion. In the first quarter about 40% of our new direct sales hires for lending facilitation net our upgraded target profile for the ongoing channel transformation, first quarter direct sales productivity for lending increased 4.8% versus a year ago. During the quarter, our total income was RMB17.3 billion, up 13.5% year-over-year, and our net profit increased by 6.5% to RMB5.3 billion year-over-year. At the highest level, our total income in the first quarter grew by RMB2.1 billion or 30.5% year-over-year growth, while total expense increased by RMB1.6 billion, or 19.1% year-on-year growth and net income grew by 6.5% year-over-year to reach RMB5.3 billion. Our investment income decreased by 11.2% to RMB435 million in the first quarter from RMB490 million in the same period of last year, mainly due to the decrease of investment assets, partially as a result of share buyback. Turning to our expenses, in the first quarter, our total expenses grew by RMB1.6 billion or 19.1% to RMB10.2 billion from RMB8.5 billion in the same period of 2021, primarily driven by the increase of credit impairment costs. Total expenses, excluding credit and asset impairment losses, finance costs, and other losses increased by 2.7% to RMB7.2 billion in the first quarter of 2022 from RMB7.1 billion in same period of 2021 remain almost the same as we further improved operating efficiency. Our total sales and marketing expenses, which include expenses for borrowers and investor acquisition, as well as general sales and marketing expenses, increased by 5.9% to RMB4.5 billion in the first quarter. Our operation and servicing expenses increased by 4.5% to RMB1.6 billion in the first quarter from RMB1.5 billion a year ago, primarily due to the increase of trust plan management expenses, which resulted from the increase in consolidated trust plans. Our technology and analytics expense increased by 0.2% to RMB448 million in the first quarter of 2022, from RMB447 million in the same period of 2021, mainly due to the company’s ongoing investments in technology research and development. Our credit impairment losses increased by 168.2% to RMB2.8 billion in the first quarter from RMB1.1 billion a year ago, this was mainly driven by 2 factors. Our finance costs decreased by 25.7% to RMB211 million in the first quarter from RMB284 million a year ago, mainly due to the increase in interest income resulting from the increase in deposits. As a consequence of the aforementioned factors, our net income increased by 6.5% to RMB5.3 billion during the first quarter from RMB5 billion in the same quarter of 2021. For the first half of 2022, as we become more prudent in underwriting, we expect new loans facilitated to decrease between 7% to 10% year-over-year to the range of RMB294 billion to RMB301 billion, client assets to grow by 1% to 3% year-over-year, to the range of RMB425 billion to RMB434 billion, total income to grow by 8% to 10% year-over-year to the range of RMB32.5 billion to RMB33.1 billion."
}