{
    "symbol": "UMH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:42:10",
    "content": " The sequential increase in normalized FFO is primarily the result of the savings that we realized from the recapitalization of our $247 million, 6.75% Series C perpetual preferred. During the quarter, we added 142 new rental homes to our portfolio as compared to 96 last year, resulting in a 48% increase. As we had previously announced on July 26, 2022, we redeemed all 9.9 million shares of our 6.75% Series C perpetual preferred stock for a total of $247 million. Rental and related income for the quarter was $42.9 million compared to $40.2 million a year ago, representing an increase of 7%. Sales profitability was $919,000 in net profit this quarter compared to $611,000 a year ago, resulting in a 50% increase. As we turn to our capital structure, at quarter end, we had approximately $726 million in debt, of which $500 million was community level mortgage debt $127 million was loans payable and $99 million was our newly issued 4.72% Series A bonds. So it's a little early to know what the fourth quarter would bring but we have built expansions, obtained homes from the manufacturers, trained our people, have the best finance rates in the industry, do great marketing and just believe that our sales will continue to grow. So you had a 100 basis point increase in the expense ratio, we believe that next year because we are now able to obtain rental homes, homes to sell and we'll raise the rents 5% instead of 4% that we'll be able to reduce that expense ratio again. So we're going to grow our number of $200,000 home sales as a percentage of sales, and they're going to grow in and of themselves, and they are priced at the 30% profit level with $200,000 gross sales prices. It's a community of mostly older homes and as they turn over, we'll be able to increase the rents from the existing number of about 450 on average to what we believe is market, and we experienced at our property down the road of rents close to $800. We'll probably do loans of $165 million and be able to take $100 million, maybe a little less out for other projects, including acquisitions and purchase of rental homes."
}