{
    "symbol": "UMH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 15:16:11",
    "content": " In 2022, we completed the acquisition of seven communities containing 1,500 developed homesites for a total purchase price of approximately $86 million and through our joint venture with Nuveen Real Estate, we acquired a community containing 144 developed homesites in Sebring, Florida for a total purchase price of $15.1 million. Moving on to operations, total income for the year increased 5% to approximately $196 million. Our operating expense ratio increased to 44.4% from 42.8% in 2021, which resulted in community NOI of approximately $94.8 million or an increase of 4% over last year. In March of 2022, we completed a $25 million addition of the rental homes to this credit facility. Although, our sales for the year declined by 6%, we are very pleased with these results, given that 2021 was our highest gross sales year in our company history, with sales of $27.1 million and 2022 was our second highest gross sales year in our company's history, with sales of $25.3 million. Despite gross sales decreasing by $1.8 million, sales for 2022 generated income of $2 million, which is in line with the income from sales for 2021, because our gross profit percentage increased from approximately 26% last year to 31% this year. At a 40% expense ratio, same property community NOI for 2024 will increase by $11 million. Additionally, home sales are estimated to increase by 20% to $30 million, with $1 million or more in increased sales profits. Funds from operations, or FFO, was $10 million or $0.18 per diluted share for the fourth quarter of 2022, compared to $10.1 million or $0.20 per diluted share for the prior year period. For the full-year 2022, FFO was $28.5 million or $0.51 per diluted share, compared to $39.1 million or $0.83 per diluted share for 2021. Normalized FFO was $46.8 million or $0.85 per diluted share for 2022, compared to $41.1 million or $0.87 per diluted share for 2021. Rental and related income for the quarter was $43.7 million, compared to $40.7 million a year ago, representing an increase of 7%. For the full-year, rental and related income increased from $159 million in 2021 to $170.4 million in 2022, an increase of 7%. For the full-year, community NOI increased from $91 million in 2021 to $94.8 million in 2022, an increase of 4%. For the full-year, sales decreased 6% from $27.1 million in 2021 to $25.3 million in 2022. The companyâ\u0080\u0099s average sales price was approximately $84,000 in 2022, as compared to $73,000 in 2021, resulting in a 15% increase. As we turn to our capital structure, at year-end we had approximately $762 million in debt, of which $509 million was community-level mortgage debt, $154 million were loans payable, and $99 million was our newly issued 4.72% Series A bond. As we previously announced on July 26, 2022, we redeemed all 9.9 million shares of our 6.75% Series C perpetual preferred stock for a total of $247 million. Our preferred stock, combined with an equity market capitalization of $927 million and our $762 million in debt, results in a total market capitalization of approximately $1.9 billion at year-end. We also completed the addition of approximately 1,100 rental homes to our Fannie Mae credit facility for total proceeds of approximately $25.6 million. Subsequently, in conjunction with a new $34 million mortgage, we added another tranche of 250 rental homes to this facility for total proceeds of $4.1 million. We have approximately $423 million of rental homes on our balance sheet that may now qualify for highly competitive financing, providing us an important source of capital going forward. During the year we sold 5 million shares of common stock through our common ATM programs at a weighted average price of $20.58 per share, generating gross proceeds of $102.6 million and net proceeds of $100.8 million after offering expenses. Subsequent to year-end, we sold approximately 1.9 million shares of common stock under the common ATM program for gross proceeds of $32.7 million. Additionally, we sold 406,000 shares of our Series D Preferred Stock through our preferred ATM program at a weighted average price of $22.90 per share, generating gross proceeds of $9.3 million and net proceeds after offering expenses of $9.1 million. Subsequent to year-end, we entered into a new $100 million ATM program and sold 640,000 shares of preferred stock under our preferred ATM program for gross proceeds of $14.6 million. But as these homes are setup, we're going to assume we continue at the 8:1 ratio of eight rentals per every one home sale and we believe we will fill 800 of these homes during the course of the year as rentals at better than $10,000 revenue per house and we will sell the 200 homes at higher sales prices and higher sales profits."
}