{
    "symbol": "CSSE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:27:23",
    "content": " The asset includes a large content library, our significant IP ownership, a valuable original production pipeline, a fully developed ad sales engine marketing machine with expanded ad inventory, and streaming assets that include our AVOD networks, Redboxâ\u0080\u0099s TVOD, PVOD and free live TV channels, along with their cash-generating kiosk network, and donâ\u0080\u0099t forget the service business. Redbox will file its second quarter 10-Q tomorrow, and as youâ\u0080\u0099ll see the kiosk business is starting to show renewed growth as the theatrical release market slowly comes back to life and prior cost cutting is beginning to work its way into its P&L. We reported net revenue of $37.6 million compared to $22.1 million in the prior year period, the year-over-year increase of approximately 70% and compared to net revenue of $29.2 million in the first quarter of 2022 for a sequential quarterly growth rate of 29%. Itâ\u0080\u0099s worth reiterating Billâ\u0080\u0099s comments earlier that we believe the unique combination of Chicken Soup for the Soul Entertainment and Redbox will be in the best position to benefit from the continued growth in the AVOD and FAST markets, driving revenue growth in all of the revenue categories that I just mentioned. In addition to continued scaling benefits, as we integrate Redbox, realize revenue and cost synergies, and continue growing and expanding our original and exclusive content library, we expect to drive further EBITDA growth and margin expansion over time. In closing, we had an excellent quarter from a Chicken Soup for the Soul Entertainment standalone business perspective that sets the stage for the continued strong growth that we expect to amplify with our acquisition of Redbox. The combined company going forward creates an entertainment company for value conscious consumers that we believe will generate over $500 million in revenue, and $100 million to $150 million in adjusted EBITDA on an annualized basis, exiting this year, with multiple opportunities to accelerate our growth in 2023 and beyond."
}