{
    "symbol": "RICK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-10 10:30:25",
    "content": " And basically, I think we're just --- like I said, it's just been strong basically across the board. We spent $5 million down payment on the Miami acquisition last week, and I think we're probably sitting on $38 million, I suspect by next – by Tuesday by tomorrow, cash counts will be closer to $40 million in cash again. So we're generating a tremendous amount of cash every week right now and we're putting about only about $500,000 week into our stock buyback right now, because I want to hold about $40 million cash on hand as we do these acquisitions. So we're looking at those two versus – normally, we would look at like 2021, but 2020 isn't really viable so basically what we decided is trailing 12 months plus 2019 is kind of our gauge and we're kind of seeing what the difference is whether way up way down and coming up with what we think is a fair market valuation based on that. Theoretically speaking if we're looking at $24 million in March and then April beat that if we had a $75 million quarter in revenue and everybody knows what I said on the call, which was our adjusted EBITDA to revenue ratio is about 30%. When I look at 2017, 2018, 2019 right just looking at the Nightclub segment in particular I'm seeing the service revenues used to be in the high 30s, sometimes it's hitting the 40% of our sales mix, right. But I mean look if you just take your M&A schedule that you presented at Noble the $20 million in calendar 2022 and we're halfway through the year now so 2020 and 2022, 2024, and 2023 and 2028 if I just add up those numbers, you're increasing your EBITDA from a $100 million base by 75% over the next three years not including Bombshells. But I'm just saying if you were just to do it and say, okay I'm at 100 right now, you're basically -- just based on your acquisition schedule, you're going to basically be double in two and a half years not including Bombshells. But I still think, if you took and basically calculated the COVID effect from last year and get the free cash flow and you take free cash, we're still going to be well over 20-plus percent free cash flow per share growth for this year, even though we issued another 500,000 shares. That's like obviously in the absence of having your cost of capital, you're going to grow accordingly, you'll buy back stock if it gets cheap and you'll do things intelligently. I mean I think it's important to clarify that like you guys aren't doing this to – I think Samford asked on one of the other things you said, well, will you commit to not selling the stock. And we can basically evaluate and then immediately respond so that we're turning those trends around on an individual club basis within weeks of any type of downturn and getting them back on course whether it's through discounting, whether it's through changing management or whatever outside sources are causing the issue at that club we're adjusting to it. There's 385,000 square feet under roof here of which the club uses about 47,000 square footprint with two stories, which we have about 70 -- with the new build I think we're over a little over 78,000 square feet. But even when they offer us $3 million, $4 million over in appraised value, they can't replace the $25 million that Tootsie's is going to make this year."
}