{
    "symbol": "WU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 23:14:02",
    "content": " In the short term, as we highlighted at Investor day, this new marketing program will have a negative effect on revenue due to introductory and new customer segment pricing, which should enhance our ability to accelerate our digital new customer acquisition engine in North America. This new model is a combination of promotional offers, including new customer segment pricing, targeted lower funnel marketing, and a focus on rapid issue resolution, and was successful in driving a 26% year-over-year increase in U.S. outbound new digital customers in the month of September. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Please ask your question. By the mid of 2022, I think we came to realize particularly in some of the most competitive corridors in the largest market that was going to be required, while at the same time influencing our ability to drive those other dimensions in terms of customer experience, transaction completion rates, ongoing retention and loyalty programs, all of which add up to ultimately the ability to return the digital business to strong growth rates. Additionally, we believe that as the market continues to mature, and we've highlighted it, and this has been true for other digital experiences, the omni-channel ability to interact with customers and allow customers to move seamlessly across the retail and the digital experience will become more prevalent and will become a stronger value proposition than a pure digital or a pure retail-only customer. Please ask your question. We're looking to strengthen our collective ability to retain, which again coming back to Investor Day was less than 50% retention, to retain those customers and generate ongoing economics for both us and the retail partners. Please ask your question. Please ask your question. And as I said, we're playing with multiple levers of that both for the acquisition part in terms of the right promotional pricing and the right marketing, particularly in the lower funnel, but also ensuring that we're acquiring the right customers and we're getting those second and third transactions so that we're making sure we're getting lifetime value out of the investments we're making to acquire customers. Please ask your question."
}