{
    "symbol": "WU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 20:10:09",
    "content": " It requires us to move from a model focused on growing revenues through geographic expansion, and price optimization independently across our retail and digital channels, to one that focuses on growing customer counts, and customer relationship value on an integrated basis across our channels, and our geographies by providing a market leading experience and a wider range of product and services. As we move towards this new model, we will be managing the business using a regionally based operating model is accelerating the development of better end-to-end customer experiences across both retail and digital products, moving to a more granular corridor level marketing strategy, and using our pricing capabilities to maximize customer growth and customer lifetime value. In particular, the slowing of our digital business is disappointing, with revenue declining 3% on a constant currency basis, including a 6% negative impact from our decision to suspend operations in Russia and Belarus. Mexico is a great example of the growth opportunity for us, as it is home to over 125 million people where we have strong brand recognition, a growing population of digital savvy customers, and where today, only approximately 10% of our total revenue in Mexico is generated from within the country. Digital money transfer revenue, which includes our branded digital product and digital white label partnerships, was down 6% on a reported basis or 3%, constant currency largely driven by the suspension of our operations in Russia and Belarus, which impacted revenues by 6%. The suspension of operations in Russia and Belarus including our digital white label partnership, substantially impacted results in the quarter, reducing reported revenue by 6%, constant currency revenue by 7% and transactions by 22%. Additionally, two key retail agents in the region are discontinuing their retail relationship and moving their customers to our kiosk and digital offering, which will impact the revenue generated from these agents, some of which will start in the fourth quarter of this year. Other operating margin was 40.1% compared to 16.2% in the prior year period, primarily due to increased revenue, a decrease in divestiture and acquisition costs and the reimbursement of expenses associated with transition services provided after the first closing of the sale of Business Solutions. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Certainly, and Ramsey as we talked about on the prior call, as part of our strategy development work, the team has uncovered this customer segment that we have affectionately referred to them as hoppers, which we have about 1.5 million of those customers transact with us across both retail and digital channels, and have a nearly two times revenue generation profile as either a pure digital customer, or a pure retail customer. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Please ask your question."
}