{
    "symbol": "RXST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 20:19:10",
    "content": " As consistent with our January pre-announcement, RxSight reported fourth quarter revenue of $16.1 million, up 91% compared to $8.4 million in the year ago quarter and up 28% compared to $12.6 million in the third quarter of 2022. We sold 57 LDDs in the fourth quarter of 2022, up 27% compared to the 45 units in the year ago period and up 16% compared to the 49 units in the third quarter of 2022, when strong LDD unit growth overcame the third quarter's usual seasonality expectations for slower capital equipment purchases. Fourth quarter 2022 LDD unit placements generated $6.6 million in revenue, up 24% versus the year ago quarter and up 16% versus the third quarter of 2022. These procedure volumes translated into LAL revenue of $9 million in the fourth quarter of 2022, up 210% compared to the $2.9 million in the year ago quarter and up 38% compared to $6.5 million in the third quarter of 2022. Fourth quarter 2022 SG&A expenses were $15.7 million, up 35% versus $11.6 million in the year ago quarter, higher costs associated with new sales, marketing and commercial personnel, we hired in latter part of 2021 and early 2022 drove the increase. On a sequential basis, SG&A expenses rose 5% from $14.9 million in the third quarter of 2022, due primarily to a major professional meeting, increased travel and increased incentive compensation on higher revenue. Research and development expenses for the fourth quarter of 2022 were $6.7 million, up 13% compared to $5.9 million in the year ago quarter and up 5% compared to $6.4 million in the third quarter of 2022. We reported a net loss in the fourth quarter of 2022 of $15.6 million, or a loss of $0.56 per basic and diluted shares using weighted average shares outstanding of 28 million shares. Note also that stock-based compensation in the fourth quarter of 2022 was $3 million, resulting in a non-GAAP loss with $12.6 million or a loss of $0.45 per basic and diluted share. In the first quarter of 2023 to-date, we raised approximately $64.8 million net of expenses and fees through additional ATM sales of our common stock and a public offering of 4.6 million shares of our common stock at $12.50 per share before underwriting discounts and commissions and offering expenses. We expect our gross margin to expand to a range of 52% to 54%, reflecting an increased revenue contribution from the higher margin LAL procedure volumes partially offset by LDD sales, which carry a much lower gross margin due in part to lingering supply chain constraints and inflationary pressures. We expect operating expense to be between $105 million and $108 million, which represents an increase of 24% to 28% over 2022, and reflects the ongoing investments weâ\u0080\u0099re making to establish a large and durable post-operative light treatment infrastructure to support sustained LAL procedure growth."
}