{
    "symbol": "RXST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 20:53:05",
    "content": " RxSight continues to establish track record of strong year-over-year and sequential growth with 2022 second quarter revenue of $11.4 million, up 132% versus the year ago quarter and up 27% versus the quarter of this year, first quarter of this year. Given this performance we're raising our 2022 full year revenue guidance to a range of $44 million to $46 million, which implies a 95% to 104% growth rate versus 2021. During the second quarter of 2022, doctors implanted 5,400 new LALs, representing an increase of 196% versus a year ago quarter and 30% versus the first quarter of 2022. With these new second quarter placements, our installed base rose to 294 units, up 126% compared to the year ago quarter of 130 units and up 23% versus first quarter of 2022. As Ron noted, total revenue in the second quarter was $11.4 million, increasing 132% compared to the second quarter of 2021 and 27% compared to the first quarter of 2022. This compares to 25 LDD unit sales for 3 million in revenue in the second quarter of 2021, representing growth of 96% new units and 92% growth in revenue. Compared to the first quarter of 2022 when we sold 40 LDDs for $4.6 million in revenue, our second quarter 2022 LDD placements rose 23% and the corresponding revenue rose 24%. We sold 5,400 LALs in the second quarter of 2022, generating $5.3 million in revenue. This compares to 1,825 LAL unit sales for $1.8 million in revenue in the second quarter of 2021. In the first quarter of 2022, we sold 4,166 LALs for $4.1 million in revenue, representing quarterly sequential growth of 30% for both units and revenue. Second quarter gross profit was $4.8 million or 42% of revenue compared to a gross loss of $800,000 or 17% of revenue in the second quarter of 2021. Selling, general and administrative expenses in the second quarter of 2022 were $14.4 million, up 121% compared to the $6.5 million in the year ago quarter and up 5.6% compared to the $13.6 million in the first quarter of 2022. Research and development expenses for the second quarter of 2022 were $6.2 million, down 5.6% compared to $6.6 million in the year ago quarter and down 7.8% compared to $6.7 million in the first quarter of 2022. Over the last four quarters, we have grown our LDD installed base by 164 units or 126%, guided dramatic growth in LAL adoption with over 14,500 new LAL implantations representing an increase of 122%; enhanced the LALs ease of use with the addition of ActivShield technology, established a formidable collaboration with more than 80 RxSight practices to collect and share a wealth of useful clinical data stored on practice LDDs, expanded the size and scope of our commercial team to effectively target premium IOL surgeons while helping existing customers take full advantage of our unique technology, and delivered triple digit growth in quarterly revenue while managing expenses in line with expectations and building a healthy balance sheet."
}