{
    "symbol": "MCS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 20:29:06",
    "content": " The risks and uncertainties, which could impact our ability to achieve our expectations identified in our forward-looking statements, are included under the heading Forward-Looking Statements in the press release we issued this morning announcing our fiscal 2022 first quarter results and in the Risk Factors section of our fiscal 2021 annual report on Form 10-K, which you can access on the SEC's website. Given the significant changes in the state of the business today compared to the environment we were operating in a year ago, Chad will provide comparisons to our prepandemic fiscal 2019 first quarter as he gets into the results of each business. Meanwhile, our average concession and food and beverage revenues per person at our comparable theaters increased by 5.7% during the first quarter of fiscal 2022 compared to last year and has increased by 36.1% compared to fiscal 2019. As a significant number of theaters in both our circuit and the industry as a whole were closed during large portions of the first quarter last year, we believe a comparison of our results to prepandemic results in fiscal 2019 may be the best way to compare our performance to the industry this quarter. When you compare our first quarter fiscal 2022 admission revenues to fiscal 2019, our admission revenues were down 39.4% during this quarter, including the pro forma impact of the Movie Tavern acquisition, which was part of our results for 2 of the 3 months in the first quarter of '20 -- fiscal 2019. Due to the impact of 2 strong blockbusters released or showing during the first quarter of fiscal 2022, which were The Batman and Spider-Man: No Way Home, the first quarter box office was more weighted towards our top movies as compared with the first quarter of fiscal 2021 and fiscal 2019. But even if you take the Saint Kate out of both years' numbers, our fiscal 2022 adjusted first quarter revenues were still a very healthy 91% of adjusted 2019 levels. Breaking out the first quarter numbers for the 7 comparable hotels more specifically, our overall RevPAR decrease during the fiscal 2022 first quarter compared to fiscal 2019 was due to an overall occupancy rate decrease of approximately 15.7 percentage points, offset by an 11.5% increase in our average daily rate, or ADR."
}