{
    "symbol": "MCS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 00:25:04",
    "content": " The risks and uncertainties, which could impact our ability to achieve our expectations identified in our forward-looking statements are included under the heading Forward-Looking Statements in the press release we issued this morning announcing our fiscal 2022 second quarter results and in the Risk Factors section of our fiscal 2021 annual report on Form 10-K, which you can access on the SEC's website. As of the end of the second quarter of fiscal 2022, on a trailing 12-month basis, consolidated revenues were nearly $646 million and consolidated adjusted EBITDA was $94 million. Meanwhile, our average food - our average concession food and beverage revenues per person at our comparable theaters increased by 2.9% during the second quarter of fiscal 2022 compared to last year, which was primarily due to pricing changes implemented in response to food cost inflation. When compared to fiscal 2019, our per capita average concession food and beverage revenues increased by 23%, which we believe is the result of several factors, including our industry-leading mix of non-traditional food and beverage options, shorter lines at the concession stand, the emphasis we are placing on online ordering through our mobile app, as well as pricing changes. As a significant number of theaters in both our circuit and the industry as a whole were closed during large portions of the second quarter of last year, we continue to believe a comparison of our box office results to pre-pandemic results in fiscal 2019 may be the best way to compare our performance to the industry. While film costs as a percentage of admission revenues increased significantly year-over-year due to a limited number of new films and fewer blockbusters last year, resulting in abnormally low film cost percentages in the prior year, they were generally in line with our costs in the second quarter of fiscal 2019 prior to the pandemic. Shifting to our hotels and resorts division, revenues were $69 million for the second quarter of fiscal 2022 as we continue to see strong seasonal demand for leisure travel in the early summer and improving conditions for business travel. But if you take the Saint Kate out of both years numbers, our fiscal 2022 adjusted second quarter revenues were still 92% of adjusted 2019 levels. According to data received from Smith Travel Research for the fiscal 2022 and fiscal 2019 periods and compiled by us in order to evaluate our results, comparable competitive hotels in our markets experienced a decrease in RevPAR of 9% during our fiscal second quarter compared to the second quarter of fiscal 2019, indicating that our hotels once again outperformed by approximately 2.7 percentage points during the second quarter. Breaking out the second quarter numbers for the seven comparable hotels more specifically, our overall RevPAR decrease during the fiscal 2022 second quarter compared to fiscal 2019 was due to an overall occupancy rate decrease of approximately 11.2 percentage points, offset by a 9.3% increase in our average daily rate or ADR. I want to start by recognizing our hotels team for delivering a record $11.8 million of adjusted EBITDA for the second fiscal quarter, a record for any second quarter either pre or post-pandemic. Our group room revenue bookings for fiscal 2022, commonly referred to in the hotels and resorts industry as group pace, is now running with an 8% of where we would historically be at this time in pre-pandemic years and is up significantly from where we were at this time last year and from the prior quarter. And we're sort of midway through that shift back to where we were pre-pandemic as to how long it takes us to get all the way back there, I think, will also be influenced by potential macroeconomic changes and whether or not there's some sort of recession on the horizon in future quarters. But the three together really drove a higher percentage of the total box office, and as we look forward over the next few quarters, I don't see things aligning to kind of recreate that dynamic and - but even with the three, ultimately, the film cost as a percentage of box office revenues, was slightly higher than where it would have been in 2019 pre-pandemic, but not hugely higher."
}