{
    "symbol": "DBRG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 17:12:05",
    "content": " First, we're going to launch our next DigitalBridge Partner Series; two, we're going to finish raising around our core and credit strategies that we started last year, where we have excellent momentum heading into the first part of this year; Three, we're going to continue to grow our co-invest program, supporting the acquisition of new platforms as well as providing additional capital to existing portfolio companies to fuel their growth. We're confident that we can achieve these targets because we continue to see very strong interest in the digital infrastructure asset class by the world's leading institutional investors, that naturally are attracted to its combination of persistent growth, durability and the recognition that DigitalBridge is the leading investor in the sector. We've seen that case study, full force at Switch, where we're outperforming our leasing projections, our full year of leasing in '22 exceeded our 3-year guidance, and customers want to be in data centers and they want to be around digital infrastructure that has renewable energy. And I think what you're seeing is -- and when I say high-quality, businesses that have contracted cash flows greater than 5, 10, 15 years that are more than 80% exposed to investment-grade counterparties and businesses that have securitized debt, long-term capital structures that are portable. It's one of the Boards that I personally sit on and investors can go to sleep at night knowing that I'm very involved in that business day to day with Steve Smith, and I quite enjoy it, and I like the management team, and I know where we're going, and it's headed in the absolute right direction and the financial performance will show that this year. I mentioned on the call, we did invest a lot in SG&A last year because we're building a growth engine, Jade to get to $150 billion of assets under management. And then just secondly, maybe for Jacky, the targets you put out imply corporate overhead goes from $50 million this year to about $40 million in 2025 at a time when we're obviously seeing meaningful inflationary headwinds and the business is scaling. So I think when we first underwrote the deal, we had FRE overlays in the low to mid-20s millions, and we're now looking closer towards 30, and that's principally because of the fact that we've been able to plug and play and have those funds really plug right into our back office and our scalable processes."
}