{
    "symbol": "DBRG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:54:03",
    "content": " It's a road map, but as you can see in the middle of this slide, it was unlocked earlier this year with the repurchase of a minority stake in our Investment Management platform and our related transition to a traditional C-Corp. Those were seminal decisions that allowed us to leverage our comparative advantage, which is centered around our long history of operating and successfully investing institutional capital across the digital infrastructure ecosystem. When you complement that with the steady growth that we're seeing in our digital operating assets, it's a unique profile that's built on giving you, our investors, access to what we think are the most compelling investment platform and opportunities at scale in the digital infrastructure sector today. Today, when we look forward to 2023, we see a business that's going from roughly 1/3 investment management, 2/3 operating to really flipping that around with most of our earnings coming from our IM platform. Now it's our partner, helping to accelerate the Investment Management platform's growth with GP commitments, warehousing capabilities and positioned to co-invest alongside our LPs in great digital infrastructure opportunities, not competing with them. When I look forward to the second half of '22, the other area we expect to have further success is in co-investments, where some of the new signature transactions we've announced create opportunities for existing and prospective investors to partner alongside of us in some of the highest quality global infrastructure businesses. In the first part of the transaction, we'll be harvesting $230 million and that may rise over to over $400 million through subsequent closings, allowing us to both recycle capital into new digital M&A as well as maintain a significant participation in the continued growth of DataBank. Looking at the right side of the page, our Digital Operating segment has continued its growth with annualized revenues increasing from $131 million last year to $160 million and annualized EBITDA increasing from $55 million last year to $68 million, driven primarily by successful acquisitions at Vantage SDC and DataBank. There's plenty of room for continued growth here in phase 3, which is one of the reasons we're so pleased to welcome Swiss Life, EDF Invest and other new investment investors to the platform alongside of our significant commitment from our balance sheet to continue to grow DataBank. When you're running an Investment Management business where your average -- weighted average fund is 11 to 12 years, that's actually longer than a data center lease or a fiber lease that's 5 to 10 years long. But at the same time, we're paying down prefs, which are typically costing us 7%, 8%, but mark-to-market, more like all-in yield 9% to 10%, there's an awesome accretion trade here, which creates more free cash flow, which is something that Jacky and I are both focused on, which is continue to grow free cash flow and to grow the earnings potential of this business."
}