{
    "symbol": "DBRG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 15:07:04",
    "content": " We'll talk about the progress today that we're making on first, building a full-stack digital infrastructure investor; second, investing in high-quality digital businesses; and lastly, scaling our high-performance operating platform. And now that we've gone completely digital, it's time to consolidate 100% ownership back under DigitalBridge and unify our relationship with them so that we have 1 set of investors focused on 1 business plan. When you consolidate these deals, we have increased DigitalBridge shareholder earnings from our Digital IM platform by 74% since we laid out our guidance back in February, which was already a beat and raise, going from $82 million in at share fee-related earnings to $143 million once these deals close. The first was the purchase of Wafra share of our IM business, and the second was the acquisition of AMP Capital's global infrastructure equity business, which will significantly increase fee-related earnings and add 4 new digital infrastructure portfolio companies to our IM platform. So there, you have our progress against our key objectives for the year as we remain focused on building a high-growth digital infrastructure platform that serves customers and generates most importantly, strong returns for you, our investors, and our shareholders. Secondly, as we think about where we're putting capital to work in our digital operating business in this quarter, we didn't find anything in the hyperscale front that fit Vantage YieldCo's objectives in our returns. And further to that, the biggest pipeline we've ever had in the company's history with over $28 million of leasing in the backlog and roughly about a dozen new construction projects where we're expanding capacity in -- across our core markets. Second, we found a structure where we could fix our cost of debt, which I've always been very clear with you and our investors that, that is a key tenant and how I've built great companies over the last 27 years is using the securitization marketplace to have 30-year backed notes and securities that really codify the capital corporate structure, which we've done very thoughtfully. When that capital comes back and the new strategies are realized and that capital comes back to the balance sheet, certainly, that's a fair game for us to go and redeem the preferred so long as we don't see another higher and better use of capital for digital infrastructure for our shareholders. If there's -- if we've got excess cash on hand, and there's no digital infrastructure businesses immediately for us to go and see the new products or go and acquire to our balance sheet, we will go and quickly redeem those things where appropriate. And as we fundraise more and realize the rest of the year's guidance and beyond for certainly FEEUM and fundraising, add that to the $23 million that we're acquiring from AMP and the $38 million that we get back from Wafra, the earnings per share, you could see is going to accelerate pretty substantially in the very near-term."
}