{
    "symbol": "L",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 12:23:11",
    "content": " And for the nine-months, ending in September 30, Loews Hotels reported $261 million of adjusted EBITDA, which is higher than the company's pre-COVID full-year 2019 adjusted EBITDA of $227 million. Moving on to CNA, CNA's core income of $213 million during the third quarter includes $87 million in pre-tax catastrophe losses related to Hurricane Ian. In a show of support for CNA, its strategy, and its management team, in the third quarter, Loews brought about 670,000 share of CNA common stock for approximately $26 million. For the third quarter of 2022, Loews reported net income of $130 million or $0.54 per share, compared to the net income of $220 million or $0.85 per share in last year's third quarter. Book value per share declined from $71.84 at year-end 2021, to $58.14 at the end of the third quarter due to effect of higher interest rates lowering the market value of CNA's fixed income investments. Turning to our largest subsidiary, CNA contribute a net income of $150 million to Loews this quarter compared to $229 million last year. Even with the $87 million impact from Hurricane Ian, catastrophe losses were lower year-over-year as last year's quarter was impacted by Hurricane Ida and incremental losses from Winter Storm Uri. Turning to Loews Hotels, despite facing Hurricane Ian at the end of September, the company had another strong quarter growing adjusted EBITDA from $59 million in last year's third quarter to $77 million in this year's third quarter. The company contributed $25 million in net income to Loews this quarter versus $13 million in the third quarter of last year, driven by continued strong performance across the board due to robust leisure demand, a significant pickup in group travel, and the return of business travel. Wrapping up with the Corporate segment, Loews recorded an after-tax impairment loss of $15 million in the quarter, compared to a $23 million loss in the prior year's quarter."
}