{
    "symbol": "FNHC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 17:32:11",
    "content": " While we ended the first quarter with $47 million of liquidity at the holding company, ongoing underwriting losses, driven primarily by catastrophe weather losses, and the uncertain outlook for maintaining appropriate capital levels at FNIC with outside capital infusions led in part to the downgrade from Demotech and the action by the Florida OIR. FNIC's average premium per policy in Florida increased by $176 in the first quarter compared to the fourth quarter of 2021, and $607 higher than the first quarter of 2021. Most importantly, these rate increases helped improve the attritional loss ratio in FNIC's Florida book, which dropped to approximately 32% for the first quarter of 2022 as compared to 38% a year ago. As Mike mentioned, our first quarter 2022 results were impacted by $29.2 million of catastrophe losses, which were primarily from 11 large storms that affected Florida, Texas, Louisiana and South Carolina. Approximately $10 million of these net catastrophe losses are related to books of business that the Company is in the process of running off, including FNIC's non-Florida book and Maison's book of business. If one were to adjust our first quarter operating losses for the impact of the cat events and reserve strengthening and then apply to federal tax rate, it indicates that FedNat's adjusted operating result in the quarter would have been income of approximately $2.3 million or $0.13 per share. With the change in strategy to refocus on the Florida market, our attritional loss ratios have improved, reaching 27.8% in the first quarter of 2022 compared to 36.5% in last year's first quarter. Excluding the impact of catastrophe losses, our first quarter 2022 combined ratio was approximately 118% as compared to 157% in the prior year quarter on a comparable basis, a decline of 39 points, driven primarily by lower excess of loss reinsurance costs and the benefit of rate increases that continue to earn into the book. As a proof point, first quarter 2022 gross written Florida premiums decreased 4% from last year's first quarter, while policy count decreased 23%, reflecting the impact of our price increases."
}