{
    "symbol": "CRWS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-08 15:58:06",
    "content": " But if you exclude Carousel from the prior-year fourth quarter, sales would have been $20.6 million. If you exclude Carousel from both years, net sales for the current year would have been $86.7 million compared with $73.8 million last year, which represents an increase of 17.5% for NoJo and Sassy. Fourth quarter net income was $2.4 million compared with $238,000 last year. When you exclude the impact of Carousel from both quarters, net income would have been $2.6 million for the current year quarter or $0.26 per diluted share compared with $2 million or $0.20 per diluted share last year. When you include the impact of the forgiveness of this one from the current year and Carousel from both years, net income for the current year would have been $9 million or $0.89 per diluted share compared with $8 million or $0.79 per diluted share last year. As Olivia mentioned, net sales were $25.7 million for the fourth quarter of fiscal '22 compared to $21.8 million for the fourth quarter of the prior year, an increase of $3.9 million or 17.7%. For the year, net sales were $87.4 million for fiscal '22 compared with $79.2 million for the prior year or an increase of $8.2 million or 10.4%. Sales of bibs, bath, developmental toys, feeding, baby care and disposable products increased $9.9 million over the prior year, which was partially offset by a decrease of $1.7 million in the sales of bedding, blankets and accessories, which included a decrease of $3.5 million due to the closure of Carousel Designs in the first quarter of fiscal '22. Gross profit increased from $587,000, but decreased from 26.7% of net sales in the prior year quarter to 25% of net sales in the current year quarter. Gross profit decreased from $789,000 and decreased from 30.4% of net sales for the prior year to 26.7% of net sales for the current year. The closure of Carousel resulted in a $2.2 million decrease in gross profit, which in fiscal year 2022 included the sale of inventory below cost and the recognition of charges of $334,000 associated with the settlement with a supplier of a  to purchase fabric, and $265,000 associated with the liquidation of Carousel's remaining inventory upon the closure of the business. Marketing and administrative expenses decreased from $3.6 million in the prior year quarter to $3.4 million in the current year quarter and decreased from 16.6% of net sales to 13.2% of net sales over the same period. Marketing and administrative expenses decreased by $1.2 million and decreased from 18% of net sales for fiscal year 2021 to 14.9% of net sales for fiscal '22. Other items in fiscal '22 included the $2 million -- almost $2 million gain recognized in the first quarter from the forgiveness of the PPP loan, and other items in the fourth quarter and full year of 2021 include a $2.2 million impairment loss related to the impairment of the assets of Carousel. Net income for the fourth quarter of fiscal '22 was $2.4 million or $0.24 per share compared to net income of $238,000 or $0.02 per share for the fourth quarter of fiscal '21."
}