{
    "symbol": "CRWS",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-10 16:04:05",
    "content": " But if you include Carousel Designs, which ceased operations in May of 2021, from both quarters, second quarter sales for both years would have been $20.2 million. And once again if you exclude Carousel from both years, net sales for the current year-to-date period would have been $38.3 million compared with $34.9 million last year, which represents an increase of 9.8% for NoJo and Sassy. When you exclude the impact of Carousel from both quarters, net income would have been $2.4 million for both quarters, or $0.24 per diluted share this year compared with $0.23 last year. When you exclude the impact of the forgiveness of the Paycheck Protection Program loan from the current year and Carousel from both years, net income for the six months period of the current year would have been $3.9 million or $0.38 per diluted share, compared with $3.6 million or $0.36 per diluted share last year. As Olivia mentioned, net sales were $20.2 million for the second quarter of fiscal 2022 compared with $21.7 million for the second quarter of the prior year, a decrease of $1.4 million or 6.6%. Sales of bedding, blankets and accessories decreased by $1.9 million, which included a decrease of $1.5 million due to the closure of Carousel Designs in the first quarter of this year. Net sales were $38.9 million for the first six months of fiscal 2022 compared with $37.9 million for the same period of the prior year, an increase of $1.1 million or 2.8%. The increase in sales is primarily due to $3.1 million higher sales of bibs, toys and disposables, partially offset by lower sales of bedding and blankets, including a decrease of $2.3 million due to the closure of Carousel. Gross profit decreased by $1 million and decreased by 32.8% of net sales in the prior year quarter, to 30% of net sales in the current year quarter. Gross profit decreased by $1.4 million and decreased from 32% of net sales for the prior year six-month period, to 27.5% of net sales for the same period in the current year. The closure of Carousel resulted in a $1.9 million decrease in gross profit, which in the current year six-month period included the sale of inventory below cost and the recognition of charges of $334,000 associated with the settlement with the supplier of a commitment to purchase fabric and $265,000 associated with the liquidation of Carousel's remaining inventory upon the closure of the business. Marketing and administrative expenses decreased by $638,000 and decreased from 17.6% of net sales in the prior year quarter to 15.6% of net sales in the current year quarter. Marketing and administrative expenses decreased by $652,000 and decreased from 19% of net sales for the prior year six-month period to 16.8% of net sales for the same period in the current year. The decrease in amounts for the current year period includes lower charges incurred by Carousel of $547,000 for the two-month period and $807,000 for the six-month period."
}