{
    "symbol": "CRWS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-09 15:11:08",
    "content": " Carousel Designs didn't affect the current quarter, but for the prior year quarter if you exclude Carousel which ceased operations in May 2021, net sales for last year would have been $18.4 million which represents an increase of 23.8% for NoJo and Sassy. Net sales for the first nine months of fiscal year 2022 were $61.7 million, compared with $57.3 million last year. If you exclude Carousel from both years, net sales for the current year-to-date period would have been $61 million, compared with $53.2 million last year, which represents an increase of 14.6% for now NoJo and Sassy. And when you exclude the impact of Carousel from the prior year quarter, net income would have been $2.2 million last year or $0.22 per diluted share compared with $0.24 this year. When you exclude the impact of the forgiveness of the Paycheck Protection Program loan from the current year and Carousel from both years, net income for the nine month period of the current year would have been $6.3 million or $0.63 per diluted share compared with $5.9 million or $0.58 per diluted share last year. As Olivia mentioned, net sales were $22.7 million for the third quarter of fiscal 2022 compared with $19.5 million for the third quarter of the prior year, an increase of $3.3 million or 16.8%. Sales of bedding, blankets and accessories increased by $349,000, which is net of a decrease of $1.1 million due to the closure of Carousel. Net sales were $61.7 million for the first 9 months of fiscal 2022 compared with $57.3 million for the same period of the prior year, an increase of $4.3 million or 7.6%. The increase in sales is primarily due to $6 million higher sales of bibs, toys and disposables, partially offset by a decrease of $1.7 million in sales of bedding and blankets including a decrease of $3.5 million due to the closure of Carousel. The increase in the gross profit amount is net of the effect of the closure of Carousel, which recognized a gross profit of $319,000 in the prior year quarter. Gross profit decreased from $1.4 million and decreased from 31.9% of net sales for the prior year nine month period to 27.4% of net sales for the same period in the current year. The closure of Carousel resulted in a $2.2 million decrease in gross profit, which in the current year nine month period included the sale of inventory below cost and the recognition of charges of $334,000 associated with the settlement with a supplier of a commitment to purchase fabric and $265,000 associated with the liquidation of Carousel's remaining inventory upon the closure of the business. Marketing and administrative expenses decreased by $326,000 and decreased from 17.6% of net sales in the prior year quarter to 13.6% of net sales in the current year quarter. Marketing and administrative expenses decreased by $978,000 and decreased from 18.5% of net sales for the prior year nine month period to 15.6% of net sales for the same period in the current year. The decrease in amounts for the current year periods include lower charges incurred by Carousel of $494,000 for the 3-month period and $1.3 million for the nine month period."
}