{
    "symbol": "ECL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 18:25:26",
    "content": " So when you're talking about April, so it's trending towards this full second quarter of 30%, which we expect that for the full year we should end up with 25% inflation for  when we were thinking initially that it would be 15%. But if things happen well, we'll end up in the right place with a very strong second half, that I'm sure about it where we end up for the full year exactly that's harder to tell, but it's just a matter of one month or two plus or minus at the end of the year that's going to bring us to the final result. It will still keep growing but not at the same pace as it used to over the last 98 years, of the 99 years that we've been in business, because digital automation is obviously helping us automate a lot of transactional work that our team is doing today, like driving a bunch of stuff you can do so with remote monitoring, preparation as well of sales calls, you can do much more so on the computers now, and we've implemented all that over the past few years, as you know, that requires less homework as well to get ready for customers, fixing equipment as well, we can do that remotely. But so far, so good. So the demand is higher than the supply we can provide, which is the reason why we are building a new plant in Pennsylvania and extending another one in the UK as well, and that's going to come online in the second half of the year. And what I like the most is that we can build a lot of things around it to really build that growth platform like we did 20 years ago with pest elimination and all the businesses that we have in the company than 10 years ago,  that came as well, so around food safety and hygiene at Ecolab and now we have Purolite that can serve the life science business, but also the industrial businesses to which we can add as well some M&A down the road, which makes it even more interesting. And what's really interesting is that there are some new engines as well in there, as we call them, like global high techs; with data centers growing fast as well, chemical industry as well, which is a new business that we've created; and animal health as well, which are kind of those future growth businesses that are adding to the momentum of that group, which is doing really well, broad based, all businesses, most countries around the world; in China, a little bit more tricky for the reasons I mentioned as well before, but otherwise, in a very good shape. And it's going to be the same in this one with one big difference is that usually the inflationary cycle will last much less time this time, well, we're already planning for two years, last year and this year. The second quarter ending June, as you say, Well, it's a transition quarter because obviously, we start from zero on April 1st and we hope to be as close to kind of -- in cruising speeds in June or July, which is why I'm not perfectly accurate on where we're going to be at the end of June because there's a lot of realization that needs to happen for those thousands of customers, millions of locations around the world in 170 countries. So that's the way we think about it in terms of net impact, an offset for the second quarter, well, it's not going to be a straight line to heaven, but it's going to end up in a good place sometime this summer. Because when all that comes together that the pricing gets ahead as well of inflation, I firmly believe that the institutional margins will be even better after that cycle than it was pre-COVID, whenever the past is going to be or the future is going to be but let's assume it's going to be '23. You maybe remember the margin improvement we had in 2020 was growing north of 20% in terms of operating margin and ended up in a very good place, which is why I just mentioned before as well earlier on the call, even the margins are down 10% in Q1, they're higher at 19% than they were in 2019 as well. What you mentioned as well on net zero is obviously something that was much less relevant a few years ago, but that's becoming very relevant right now and going forward because many of our customers have made commitments on the sustainability objectives. And the only one that's below 2019, roughly 10% in terms of volume is Institutional & Specialty and is expected to cross that line during the second half of the year, where we're going to be in a place where all businesses, I mean, all major businesses will be ahead of 2019 in terms of volume during the second half of the year. That's why we're saying it's going to take -- it's kind of a two, three year cycle where demand is going to be higher just because the industry is recovering from a demand perspective and staffing, as we talked about before as well as you get more staffing in hotels, for instance, you've probably been in hotels lately, so the service is a little bit different, than it used to be even though you're paying the same prices for your rooms, well, it's not because hotels won't have it that way, they don't have staffing to do it. Well, it's not going to happen because we started zero on April 1st and at the end of June, we won't be 100% done either for all the reasons that you're mentioning. So I expect plan to slow down a little bit to get the pricing right but that's why we want to get pricing done as quickly as we can to make sure that new business maintains momentum as well down the road, it's hard to do both at the same time. The third thing and last thing that I'd say as well here is that when we move through slower times or more extreme recessionary times, which we don't assume it's going to happen in '22, could happen in '23, who knows, obviously, that we've gone through many times as a company. I want to make sure we keep our organic momentum, which is extremely strong right now while we get the pricing right, while we keep the customers because down the road, that's the beauty of the Ecolab model when your fundamentals are right of new business of innovation, of pricing, of customer retention and that inflation eases you get very significant windfall in margin, which we know always happens. But so far, so good."
}