{
    "symbol": "ECL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 17:17:08",
    "content": " Our customer retention has remained largely unchanged, still north of 90%, with the industry's largest and best trained sales force, with the resources and the capabilities to get the job done and serve our customers better than ever, with a business model with over 90% consumable revenue, with innovative technologies and services that are helping customers reduce their total operating cost when they needed it most like right now and a growing $152 billion market opportunity that will remain huge no matter what happens to the world economy. So the 30% as well so that we are experiencing so right now and going forward for the next few quarters as well, just to put it in perspective, so represents $1 billion, of course, that our teams had or will have to overcome so during the year to 2022. We got structural pricing plus energy surcharge kind of well implemented during the last month of the quarter, and that's how we got ahead of delivered product cost inflation so at the end of the second quarter. And ultimately, that's why, as I've mentioned as well in my earnings calls that the shift from primarily focusing on pricing to primarily focusing on new business will come at the right time as well, which is a shift that we've done many times as well in the past. And if you look at Q4, it's going to be the combination of business momentum, so driven by new business, as mentioned before, added to a pricing that's going to keep strengthening together with the energy surcharge as mentioned, so we'll be in the low double-digit territory as well. It's not going to be an improvement versus last year, but it's going to be a sequential improvement from Q2 to Q3 to Q4, which, by the way, David is really playing in our favor longer term as well as we rebuild our margins fully and then afterwards even expand that. As you've mentioned, it's derivatives, second or third of feedstock as well, which means that it takes time to get through the system for us as well, which means as well the spikes are not that high, but it goes higher and stay longer as well so for us. And I'll just -- and on one thing, it's been especially a part of our business where at every inflationary cycle, they've done really good work in pricing and they helped improve the gross margin as well at each of those cycles as we're going forward. If you look at our SG&A, as well as over the past few years, we've done some very good progress as well in terms of productivity, and we're going to keep doing that as well going forward, mostly driven by digital automation, which means that with the same team we can serve more customers and do more with the customers that we're serving as well are directly driven by digital automation. It's going to take some time as much as I hated and you hated as well I think so, thinking about the fourth quarter, so to see growth in Healthcare, not in the group, Healthcare and Life Science. So if you think about CapEx, for instance, 6% of our sales, that's been steady for a very long time and it's going to stay as well like that. First and foremost, pricing in our company is happening in every business every single year, and that's been true for a very long time, maybe since the company started as well. That being said, it's important to keep in mind as well that Institutional like most of our businesses in the company post this cycle are going to be in a stronger place than they were before, driven by 3 things: First, we've gained share. So it's a business that's getting stronger as well from a geographic perspective, which is also good in terms of stability going forward."
}