{
    "symbol": "CNI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 18:07:07",
    "content": " As we laid out in our green plan earlier this year, we're confident that we have the resources to move this year's crop over the crop year, and we expect to see continued strong Canadian grain volumes well into next year. Moving on to page 15, following a solid performance after three quarters and strong volume expectations in Q4, we are raising our 2022 financial outlook and now expect adjusted EPS growth of approximately 25% and free cash flow to be around $4.2 billion. We're running the railroad to the plan, we're doing an integrated way at every level of the organization, and we're driving top line growth to the bottom line, and I'm comfortable that we will deliver on our upgraded guidance of 25% EPS growth since 2022, and we remain committed to deliver value to our customers, to our employees and to our shareholders. And as we've leaned into the scheduled railroad, and it's one of the points of the scheduled operations that you get a pretty good look at where you have capacity and where you don't -- and so we focus Doug and his organization and making sure that we have sold properly into the capacity in the network. So the first place where we serve with that, of course, is with our customers and what business, what volumes are out there, where we can be helpful in providing solutions and how we need to invest in our network, our capacity, whether it be rolling stock, track, people or capability in order to provide those solutions going forward, and we'll lock arms with our customers and step into that where we can see it on a sustainable basis. We know that running that tight efficient operation is a necessary condition in order to kind of lift our head and grow, but we're pretty excited about some of the growth opportunities that we see as we go forward and around capitalizing them both in existing capacity in our network as well as in some areas that we look forward to investing to expand our capacity."
}