{
    "symbol": "CNI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 21:08:04",
    "content": " I just wanted to understand, given what's going on in the U.S. right now with the STB, I think there is some, obviously, in U.S. we have Class 1 railroads regarding the performance and deliverables basically, and their focus on operating ratio. Now the supply chains in the last 2 years, 2.5 years, there's been a big shock in the supply chains, and we're working very hard to get our rhythm back and our operation back and to serve our customers well. In order to grow, you need -- we need a tight, efficient operation that moves quickly, delivers effectively to our customers, and that's where we're going to get at our real capacity, and we're going to be able to grow. As we think about capital allocation, we will always prioritize -- we look at it through the lens of long-term value, and we'll prioritize building our business, always going to be our first priority, and we want to maintain the strong balance sheet. But what -- Tracy, what's your intuition in terms of -- are there some things from an operating perspective that can be changed fairly quickly, 6 to 12 months to really drive that network improvement or if we're talking about reworking the book, it makes me think this is more like kind of a 2- or 3-year type of play to really drive that network improvement. I think to Rob's point, we're getting our cadence back in terms of our network fluidity and we can see that clearly in the latter part of March and then in April. Correct me if I'm wrong, but I think in your prior role, you were a rail customer and may have been a CN customer side as well, so I'm wondering if there's anything that you're bringing to the table on day 1, you could ever thought to yourself those people at CN, if I was ever their CEO, what I do on day 1, I think, again, maybe a general railroad versus a super question or a specific question about CN and your experience there. That positions us in a really unique way to think about how we step into some of the growth, whether it's as we've had the questions on today, some of the consumer products or container traffic, whether it's stepping in a different way with our partners in the industry, some of the domestic traffic or whether it's looking at the change in flows of some of the commodities as a result of what's going on in Europe or what I think will be a pretty fundamental change in energy flows over time."
}