{
    "symbol": "GEN",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-08 21:37:05",
    "content": " Supported by our strong execution in a challenging environment, we delivered our 13th consecutive quarter of growth, with Q2 bookings up 11% and revenue up 12% in constant currency which includes 7 percentage points of contribution from Avast. And while our direct customers count declined by roughly 60,000 quarter-over-quarter on the NortonLifeLock side and 190,000 on the Avast side, our short-term focus and opportunity coming out of the acquisition is to work on the increasing -- on increasing the value for millions of our customers and consequently their satisfaction and retention rate. While paid direct customer count is an important metric, it is also important to highlight that we have multiple levers to drive booking growth in more diversified ways such as growing in ARPU with the opportunity of cross-selling new products, growing in memberships, offering a platform approach to Cyber Safety and growing in retention rates, especially on the Avast side, supported by our best-in-class support and services organization. Excluding Avast, Cyber Safety bookings grew 5% in constant currency as we drove increased value through cross-sells in the Norton customer base and our key partner channels continue to scale, including identity-driven partnerships with international telcos and employee benefit partners in the U.S.  Q2 non-GAAP reported revenue was $748 million, up 12% in constant currency and up 8% in USD. Direct customer count went from $23.3 million reported at the end of Q1 as NortonLifeLock to $38.6 million at the end of Q2 as Gen, including approximately 15 million Cyber Safety customers from Avast. Q2 direct monthly average revenue per user, or ARPU, was USD 6.98 which reflects a blended ARPU of NortonLifeLock and Avast combined with a vast ARPU of approximately $4.30 and mobile ARPU of approximately $2.50. With the addition of Avast, our complementary strengths provide increased levers to drive top line growth across the combined $500 million existing user base. For Q3, we expect non-GAAP revenue in the range of $925 million to $940 million which reflects the first full quarter of contribution from Avast and reflects Cyber Safety mid-single-digit bookings growth."
}