{
    "symbol": "CTHR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-03 19:47:07",
    "content": " At $13.8 million, this new record is a 13% increase to the year-ago quarter and maintains our strong 49% gross margin. Our signature collection sales are up 89% compared to the year-ago quarter, and our Moissanite business continues to grow % over the year-ago quarter and 72% quarter-over-quarter, while our lab grown diamond sales are up 266% versus the year-ago quarter and 152% quarter-over-quarter. In total, net sales for Q2 2022 totaled $13.8 million versus $12.1 million or an increase of 13%. And for the six-month period ended December 31, 2021, net sales totaled $24 million versus $20.1 million or an increase of 20% from the year-ago period. Net sales from our online channel segment, which includes charlesandcolvard.com, moissaniteoutlet.com, marketplaces, drop ship retail and other pure-play outlets, totaled $9.3 million for the quarter or an increase of 23%, representing 68% of total net sales. Online channel net sales for the six-month period ended December 31, 2021, increased 22% to $14.7 million or 61% of total net sales. Net sales for our Traditional segment, which consists of wholesale and retail customers, totaled $4.4 million for the quarter, a decrease of 3%, representing 32% of total net sales. Finished jewelry net sales increased 28% for the quarter as we continue to see strong demand from our premium jewelry and our online direct-to-consumer channels, with our brick-and-mortar retail customers. Finished jewelry net sales for the six-month period ended December 31, 2021, increased 29% to $16.2 million or 68% of net sales, up from 63% of total net sales in the year-ago period. Loose jewel net sales for the six-month period ended December 31, 2021, increased 4% to $7.8 million or 32% of net sales. International net sales decreased 4% for the quarter and were flat to last year for the six-month period ended December 31, 2021, as we continue to see impacts from the pandemic. For Q2 2022, total operating expenses increased 52%, representing 38% of total net sales compared to 28% in the year-ago quarter. In support of our brand awareness initiatives, sales and marketing expenses increased 64% to $4.1 million, and G&A expenses increased 22% to $1.2 million for the quarter. Our liquidity and capital position remains solid as we ended the quarter with $21.3 million of total cash compared to $21.4 million at our last fiscal year ended June 30, 2021, and compared to $19.2 million in the previous quarter, increasing our cash position by $2.1 million. And that's why we talk about our increase in lab grown diamond sales versus a year-ago quarter, 266%."
}