{
    "symbol": "CTHR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-01 22:31:03",
    "content": " Most notably, charlesandcolvard.com experienced an increase of 24% over the prior fiscal year, from $14.7 million to $18.1 million and moissaniteoutlet.com experienced exciting growth in its first full year of existence, further validating our business strategy and underscoring the importance of our focus on direct-to- consumer initiatives. We'll start with Q4, 2022 revenue, in total net sales for Q4, 2022 totaled $9.3 million versus $9.7 million or a decrease of 4%. Net sales for online channels segment which includes charlesandcolvard.com, moissaniteoutlet.com, marketplaces, drop ship retail and other pure pay outlets total $5.7 million for the quarter, or an increase of 3% now representing 62% of total net sales. For the full fiscal year of 2022, we reported $43.1 million in net sales, a 10% increase from fiscal year 2021. First, in our online channels segment, net sales for fiscal year 2022 increased 15% to $26.8 million, or 62% of total net sales evidencing our continued growth as an e-commerce driven business. Second, finished jewelry net sales for the fiscal year 2022 increased 22% to $29.7 million, or 69% of net sales, up from 62% in net sales in fiscal year 2021. A key for our 2022 and continued support of our growth initiatives, total operating expenses increased 14%, representing 40% of total net sales compared to 34% in the year ago quarter. We reported net income for Q4 2022 of $41,000, or $0.00 per diluted share, compared with a net income of $8.4 million or $0.27 per diluted share in the year ago period, which included an income tax benefit of $6.3 million driven by the release of our deferred tax valuation allowance on our net operating loss carryforwards and the $974,000 extinguishment of debt related to our PPP loan, which was forgiven by the SBA in June 2021. As an update to our $5 million stock repurchase program we announced in May 2022 during our Q3 2022 earnings call, as of August 26, 2022, 273,257 shares of the company's common stock had been repurchased, that are held in treasury stock for an aggregate purchase price of $356,122 at an average purchase price per share of $1.30. Finished jewelry inventory which carries higher intrinsic valued than those gemstones for Q4 increased 9% from the prior year quarter as we continue to strive to become a leader in the finished jewelry and direct-to-consumer space, further positioning Charles & Colvard as a leading fine jewelry destination. So the distribution partners are feeling some weakness within that category, international is also weak, given the COVID constraints between the Asia Pac market in which we were very strong, and we had a nice position there, we have not been able to rebound that, but fortunately for us, it's still delivering the highest revenue at $43.1 1 million, it just means that we've been vigilant in overcoming those gaps and overcoming those weaknesses, looking more towards direct-to- consumer to be able to drive the sales and revenue and the growth of our company. Yes, there's different types of philosophies, right, some people get preoccupied with kind of that 40% of revenue is all on the total OpEx side on the net income and it impact that but in order to grow a business and find a catalyst that's going to take this company to another level, management has to make those really, really firm decisions and growing it and looking where that revenue is and looking where that consumer is shopping. So a lot of those expenses that you're seeing, and we're realizing now not only contributed to the millions of dollars in increased, but also it helped build out our infrastructure and our capabilities for video content production and outs, our fashion photography, we now have two studios, that enables us to do live photoshoots, where we used to spend $20,000 - $30,000, bringing in models and doing off site lifestyle shoots, live stream shopping capability to be able to hit that consumer with direct response."
}