{
    "symbol": "HAS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-18 12:24:05",
    "content": " Revenues were impacted due to innovation timing, including later product releases in NERF and games this year versus last, accelerated direct import shipments in our Consumer Products segment, which shifted revenues from Q3 to Q2 and release calendar more heavily Q2 and Q4 weighted for our Wizards and Digital Gaming and Entertainment businesses. For Q4, we are projecting Hasbroâ\u0080\u0099s revenue to be approximately flat on a constant currency basis, buoyed by growth in My Little Pony, Peppa Pig, Marvel, starting lineup and key gaming brands, in particular, our Wizards and Digital Gaming segment behind one of our best Q4 Magic slates ever, as we kick off the brandâ\u0080\u0099s 30th anniversary and celebrate Hasbroâ\u0080\u0099s first ever $1 billion brand. Fourth quarter adjusted operating profit for the company is expected to improve by mid double-digits year-over-year driven by a more favorable product mix, improvements in distribution, disposal of low-profit non-core businesses and the impact of our new operational excellence program we announced at our Investor Day on October 4. This is largely in our Consumer Products business, which incurred a greater amount of sales allowances in the third quarter of this year versus last, lowering net revenues and higher product costs. For the full year, on a constant currency basis, we expect high single-digit revenue growth with operating profit margin over 40%, down from 42.5% for full year 2021 as we continue investing for long-term growth in these valuable brands. For the full year, on a constant currency basis and excluding music, we expect revenue to decline in the mid-single digits as we divest of certain non-core businesses and certain deliveries of scripted TV and film releases moved to the first quarter of 2023. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. So, certainly, from a consumer product standpoint, we not only expect to have that improvement that you asked about with regards to net revenue, but we expect and we will continue to focus on that operating margin expansion, which you will see from the consumer products unit next year as we exit businesses, but also work on our operational excellence program that both Chris and Deb mentioned in their opening remarks. Please proceed with your question. I think with regards to businesses we are exiting, which is the second part of your question, we do expect that as we exit those businesses, both this year in Q4 as well as throughout next year, that we will manage that decline through the growth in other brands focused on our Franchise Brands. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. That said, we feel really good about where we are positioned for consumer products, both on the innovation we have coming out this Q4 and how that comps into the first half of next year, a stacked entertainment lineup, which creates a lot of tailwinds for us that I think more than compensates for the business exits that we have."
}