{
    "symbol": "HAS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-19 12:48:02",
    "content": " While we've been advancing our long-term strategic work, our teams have been busy delivering a strong second quarter with 4% revenue growth absent FX, 14% adjusted operating profit growth and 200 basis points of margin expansion, adjusted earnings per share of $1.15 and 6% growth in adjusted EBITDA. As we forecasted, our digital revenues were down for the quarter and are expected to be down for the full year as we comp both Dark Alliance for DUNGEONS & DRAGONS and Magic: The Gathering Arena's mobile launch last year. Our second quarter results have us on track to achieve our full year guidance, including low single-digit revenue growth in constant currency, operating margin expansion to 16% and operating cash flow at the low end of the $700 million to $800 million range. The second quarter, the team delivered revenue growth, margin expansion and $1.15 in adjusted earnings per share while returning $221 million to shareholders through our quarterly dividend and share repurchases and adding an important growth engine to both our gaming business and our direct-to-fan capabilities with the acquisition of D&D Beyond. Our full year view for CP remains low single-digit revenue growth in constant currency, with operating margins flat to up slightly from last year's 10.1%. For the full year, we continue to expect revenue growth in mid-single digits and operating profit margin expansion from 8%, both absent the Music business sold last year. And Entertainment delivery timing is unfavorable in the third quarter, including comparisons to several film releases to streaming platforms last year, including My Little Pony: A New Generation, Finch and Come From Away and a heavier slate of scripted TV deliveries in Q4 this year versus Q3 last year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And I think that's just kind of as big as that product -- as big as that movie is going to be, it's just an appetizer for what's going to be a fantastic first half to next year, including the Dungeons & Dragons Honor Among Thieves movie, some fantastic new releases from our partners at Disney and then Transformers Rise of the Beast come next June. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}