{
    "symbol": "HAS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 12:44:04",
    "content": " In October, we laid out our new strategic plan for Hasbro, Blueprint 2.0, built on fewer, bigger, more profitable brands; a sharpened focus on the categories where Hasbro can be best-in-class; an Operational Excellence program to speed our agility and improve our cost competitiveness; and growth initiatives in digital games, Hasbro content, direct-to-consumer and licensing. Tolkien's Lord the Ring series, Tales of Middle Earth, growing our distribution for MAGIC: Arena with our upcoming launch on Steam, and reaching all new global audience scale for D&D with our new blockbuster movie, Dungeons & Dragons: Honor Among Thieves; and AAA video game, Baldur's Gate 3, from our partners at Larian later this year. As we think beyond 2023, our focus remains on growing more of our franchise brands to $1 billion businesses, extending our blueprints through partnerships, content and new digital experiences and driving significant bottom line and margin growth through a more focused, agile and leaner organization. When we combine this with the fact that 60% of our approximately $300 million in revenue headwinds are in the first half of this year and the early timing of retail orders and shipments last year arising from supply chain challenges, we anticipate our first half revenue to be down approximately 20% compared to the first half of 2022 with Q1 revenue down approximately 25%. Adjusted operating profit was $538.3 million, down 2% driven primarily by higher product costs, increased royalties due to MAGIC Universes Beyond and increased product development, partially offset by decreases in advertising, promotional and depreciation expense versus 2021 gaming launches as well as lower incentive compensation. Lower revenue, higher sales allowances, closeout and warehousing contributed to a decline in adjusted operating profit margin to 7.6%, which was partially offset by savings realized from our Operational Excellence program within cost of sales and distribution expense as well as lower airfreight, royalties, advertising and incentive compensation. For the full year 2023, Consumer Products revenue is expected to decline mid-single digits from full year 2022 with adjusted operating profit margin improvement of 150 basis points to 200 basis points from the adjusted op margin in 2022. For the full year 2023, we expect entertainment revenue to increase low single digits, and adjusted operating profit margin is expected to increase slightly from 8.6% in 2022. But then when we look at kind of like our release calendar for entertainment, for Wizards and for our Consumer Products business, we look at kind of the retail promotions we have lined up, the feedback we're getting and the volumetric testing that we're doing on the items because we've expanded that basically threefold this year versus what we did for 2022, we feel like the second half of the year, when you combine that with what we anticipate will be improving macroeconomic conditions, should yield the growth that we have projected."
}