{
    "symbol": "FLNG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 11:42:03",
    "content": " Looking at our dividend, earnings belong to our shareholders, and I think we have demonstrated that today with our $1.00 dividend, bringing it to $3.75 in total for the fiscal year 2022, which compares to earnings per share of $3.54 or adjusted earnings slightly below that at $2.83 as we had significant gains on derivatives which has been unrealized during the year. In the quarter, we also amended $100 million 10-year swap where we had unrealized gains of $15.5 million, which we used to enter into a new shorter interest rate swap of two-and-a-half year, but increasing the notional value to $181 million which was then entered into an attractive level of 0.9%. This year, Russia despite all the sanctions -- sanctions don't apply to LNG; Russian exports were 9% and 3 million tonnes in total; Malaysia also recovering, up 11%, and then, other countries up 2%, bringing the total export market for 2022 to 400 million tonnes. So, if we look at the headline MEGI/XDF spot rates, as you can see, these rates went up to about $0.5 million a day at the peak in October, November, as we had less floating storage, they started to slide from November been sliding down to around $100,000 per day, which is still up with the good level at this time of the year, and actually now in week seven we do see a small uptick in the spot freight rates. This is driven by higher building prices, we have definitely seen inflation, our new building prices as Knut mentioned, on our balance sheet, we have ships booked at the bottom of the market when prices were at around $180 million, $185 million per ship. So with that, I think we will conclude today's presentation just to remind you of our highlights, revenues $98 million in line with guidance, strong earnings $41 million or $55 million, respectively for net income and adjusted net income, which gives earnings per share and adjusted earnings of $0.78 and $1.02 respectively. In November, we are upbeat about the prospects of adding further backlog to our company, Knut has finalized the balance sheet optimization program, we still have some loans to be executing during Q1, which clearly will bring the total net proceeds from this refinancing of utility in ships to $387 million which as he has highlighted will give us our very strong cash position."
}