{
    "symbol": "FLNG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-24 15:27:04",
    "content": " In addition, this time, we are also paying a special dividend of $0.50 bringing it to $1.25 per share because as I mentioned, we have been through a big refinancing phase where we have boosted our cash balance to $284 million at the end of second quarter. Our earnings are strong, the market outlook is good, we have a fantastic backlog, our liquidity position with $284 million is very strong, we are passing all the financial covenants with flying colors, we have no upcoming debt maturities near-term and all the ships have been delivered, so CapEx liability are only related to the ordinary dry-docking of these ships, which we will have fall of next year, but such cost is about $3 million per ship. Even though the Henry Hub now is at a 14-year high of around $10, it's immensely profitable to export these cargos from U.S. to either than Europe or Asia with arbitrage of around $200 million per cargo. So if we are looking at, for example, prices today of $55 per million Btu, if a spot steamship is making $15,000 per day, which is basically it's OpEx level. We bounce back a bit quicker this time and the market recovery were very strong with rates above $100,000 during May into June before we had this closed down of the Freeport LNG export plant in U.S., the Freeport LNG export plant has 50 million ton of annual production. As we learned yesterday, this might delay the uptick a bit by a month or so, but the future rates for LNG spot rates are super strong for Q4, where we can see probably rates in the $200,000 range again and then also explain why we have a EBITDA range in our Q4 revenue guidance as we have one ship linked to the spot market. Of course, I think we can easily scale our company for a size, which is at least doubled easily, but kind of investing in ships now at the price, which we just shown ahead of around 200 â\u0080\u0093 close to $250 million per ship."
}