{
    "symbol": "VOD",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-15 08:41:01",
    "content": "  Nicholas Read: Good morning, everyone, and thank you for joining us for our H1 results. Before Margherita and I have a chance to answer your questions, I thought I'd just touch on 4 key points from the presentation. Firstly, in the first half, we delivered a resilient financial performance. You saw that our group service revenue remain constant at 2.5%, although we experienced a slowdown in Europe, offset by a stronger performance in Turkey and Africa. We remain confident in delivering our full year adjusted EBITDA within our original guidance range, although higher energy costs in the second half means that we will be towards the lower end. We're also confirming our interim dividend at EUR 0.045, in line with our annual commitment of a minimum of EUR 0.09. Second, we're making good progress on our shorter-term operational and portfolio priorities, which include, obviously, significant improvements in IT and networks within Germany, alongside an improved commercial momentum, establishing the joint venture in Germany for our fiber-to-the-home build. And then last week, we obviously went out with our Towers transaction, which achieved our 3 strategic objectives at an attractive price of 26x EBITDA. Third, given the current macroeconomic environment we face, we have taken a series of group-wide actions, predominantly in 2 areas. 11 markets out of 12 had pricing actions, 7 have a CPI or inflation linked formula. In terms of cost, we've obviously made a lot of progress over the last 3, 4 years, and Margherita's leadership across the business, and we want to continue that. So we came out with a new target of additional EUR 1 billion over the next 3.5 years, and that will be achieved through streamlining simplification of the group moving forward. And fourth, while our short-term focus remains very much on dealing with the current conditions with the right level of urgency required, we also want to make sure that we remain focused on the long-term growth potential of the company and investing appropriately behind that. Our European consumer business, which represents about half of the business, we highlight in the presentation the formula that we have done in the U.K., which is part of our overall European proposition road map and has led to very significant growth in the U.K. business. Around 18 months ago, we made the conscious decision of investing beyond connectivity for business, and you're seeing good service revenue growth in our business segments, and over 20% growth in the beyond connectivity areas. And then lastly, in Vodacom, again, good growth rates and investing behind financial services, which again are growing over 20% year-over-year. So that combination of actions, immediate short-term actions, long-term investment for growth, we believe, on top of our strong financial position in terms of our balance sheet, ensures that we're well positioned for our midterm growth ambitions and sustaining improvements in shareholder returns. From the debt reduction, you've highlighted within the foreseeable future, it looks like you could end up below your leverage floor, below the 2.5 to 3x. Maybe just in terms of logic, clearly, the IPO was a really important step for us to establish independence for the tower company, and that was really important to then accelerate our organic growth potential through third-party selling. And I think I was vindicated with our transaction last week, which was highly attractive at 26x. I think a private vehicle now is appropriate, and it's appropriate because we can have true co-control governance within a private setting. We can also set the right capital structure to really ensure that we can get behind not only the organic growth, which we were executing, but also the inorganic opportunities. The market is highly fragmented, and there is a real opportunity, I think, to capture and consolidate the market. And of course, we have 2 strong investors behind us with a lot of experience and expertise and obviously strength and depth in terms of financial capability to achieve that goal. On capital allocation, as you mentioned, we have always indicated that our near-term priority would be deleveraging. And I think this is proving the right approach in the current macroeconomic conditions, so you should expect us initially to allocate the proceedings towards further strengthening our balance sheet. Just as a reference point on the proceedings, the way to look at it is, assuming all the minorities tender their shares and the consortium reaches its target of 50% ownership as intended, then we are talking about EUR 5.8 billion. I think the new prices didn't land yet, but perhaps you could put me straight on that, so a bit more color in Germany, please. Robert, I'll let Margherita maybe handle outlook, et cetera. If I was going to give you some color to that, so that you say, \"Okay, I understand what you mean by that,\" I would say, first of all, our front-end systems that were originally not stable have now reached a greater than 99.7% availability. We've also got our IT trouble tickets, so where we have issues, down to normalized levels. I'm also pleased with, obviously, our continued commercial regaining of momentum, if you like. The commercial engine is back in Germany, and that gave us the confidence to do the pricing action that you referred to. Yes, in terms of outlook in your multipart question, I would cover service revenue, commercial performance and pricing and how it's landing. Starting from service revenue, first, we should expect a lower performance on service revenue in the second half compared to Q2. So I'll take first the mechanical part, which is related to effectively what we would call tough comps in the prior year. You may remember that last year in Q3, we called out a peak in B2B revenues, which can be quite lumpy sometimes. And in Q4, we then called out some service revenue year-end adjustment related at things like contract with service providers. Of course, this will not repeat in the second half this year. And then in terms of ARPU trends, we have called out a shift in channel mix in mobile as we exited pandemic, and we saw a reacceleration of volume movements with the new telco law. We have seen a higher weight for indirect channels and service providers, therefore, with lower ARPU, and we expect this trend to continue in the second half. However, as you look beyond this year into FY '24, we expect structural service revenue reacceleration for the 2 points you were raising earlier, which are commercial performance and pricing. On the commercial front, as a result of the action that Nick was highlighting, you have seen us now growing for 2 quarters in mobile and having effectively stabilized our cable base in fixed. Actually, 1 has attracted a lot of attention, but I think they are both important. First of all, we have raised prices on the front book in fixed by EUR 5 to EUR 10, and this was against the increase on upload speeds that we could offer to our customers, but we have also reduced the promotional intensity in mobile. And this is important because if you were looking at our inflow ARPU as it stands today, in the month of November, for example, our mobile acquisitions are coming in at a price point net of promotions, which is above 5% higher than where it used to be before. So ARPU support in both fixed and mobile, which, together with the better commercial dynamics, will support reacceleration into FY '24. I think we can say that for us, fundamentally, Germany remains a strong market. So the first is just on inflation linked pricing, and I see you are rolling that out across markets progressively now. I know in the U.K., they've talked about sub-50% of the gross price increases coming through because you obviously have to manage the customer base, et cetera. And then just my second question that I'm going to sneak in there, Margherita, we saw Telefonica putting through a new hybrid yesterday, paying over 7%. I think you've got about EUR 10 billion or so in the hybrid stack, so you could obviously look to take bond financing on, I think, 10% of that, But are you comfortable sort of thinking about effectively refinancing at sort of 7% post levels right now. Can I suggest -- I'd like to just touch on the strategic elements of pricing and then maybe Margherita can answer more directly your question, because I think the important thing is that, clearly, energy cost and higher rate of inflation has put in the sector under pressure in Europe, and there's only so much that we can do on cost. We have advocated the CPI model because we believe that, that is more transparent for the customer, and also it's simpler for us to manage in our back-end systems, which, of course, every operator should be trying to achieve versus, say, repricing model, which adds a lot of complexity continuously in the back end. I would also say, I think it leads to a more sustainable model for the industry as well, as we've seen in the U.K. in terms of being more investment-led model going forward. I would say if you stand back, we, obviously, in every market, depending on the quality of our asset, set out a strategic positioning of our pricing versus our peers, yes, brand by brand, mobile, fixed, et cetera, converged. But of course, it's dependent on competitor moves as well. I would say, considering all the actions we have taken so far, we are looking at a material impact on European service revenue growth next year. In Spain, we have just introduced CPI in our contracts in September, October, and we will apply our first increase on that basis in Q4. And then in Italy, we have migrated, as you know, almost 5 million of prepaid customers towards a simplified range of tariff plans in an ARPU accretive way. Taken in aggregate, as I was saying, potential of very material impact on European service revenue with the actions we have in place so far. Clearly, you flagged an important point, which is the potential for erosion when there is a difference between front book and back book as time moves on. But it's important to say that, as Nick was flagging, we are very keen to maintain alignment as Vodafone between front and back. And we have been successful in doing so in fixed broadband, as we have seen in the U.K.  And when even there is more competition on the front book, again, U.K. mobile would be a case of that, we managed to retain a proportion of the benefit over time through the upgrade cycle through our CVM. So you do get a net positive impact, I'd say, in all circumstances, but important to maintain alignment wherever possible. On your question on financing, instead, this gives me an opportunity actually to reiterate what I believe is a really strong position in our balance sheet today because, as you know, our rates are 100% fixed on 2.5%. I think it's one of the strongest position across sectors in the whole of Europe, which puts us in a good position to deal with the current environment. And in our presentation, we show year-by-year what's due for refinancing. I'd say we have, a, plenty of time to decide what to do because we are talking about January '24. And then also because the hybrids themselves have long maturities, we are not talking about very significant amounts in the next 3 years. It's around, I think, 3 million, if not 3.5 million, on which we will have also flexibility given that we have now started a journey of deleveraging also with the support of the towers transaction. We said we wanted to get to the lower end of our range, and we've been executing consistently against that prioritization. I just wanted to follow up on the German recovery confidence, following on from Robert's questions. Obviously, you've highlighted your confidence in that recovery, but the share price and investor feedback has shown investors don't share that confidence. And one of the key things is while the KPIs look better this quarter, investors just fear that, that's been paid for by higher acquisition costs, customer acquisition costs, and coinciding with the 7% decline in EBITDA. In terms of A&R in Germany, it's important to consider that we are comparing ourselves in half 1 this year to a first half of the year last year, which still adds the weight, in a way, of some pandemic restrictions at the time. Since then, we have seen then an acceleration of the volume movements into half 2 last year with the new telco law, which has then continued into the first half of this year. So when you look at the impact on the P&L of A&R in , you need to consider that there has been a volume increase, pandemic restrictions in a simplified way to post telco law intensity of volume now, so simply more volumes. And together with the additional volumes, we also had, and you see it in the other revenue line of the P&L, handset mix shift towards higher tiers. We've had very successful iPhone promotions in the last quarter, and this has brought, of course, higher ARPU customers in, but also more volumes of handsets, which have impacted both higher revenues and A&R. As we move into the second half of the year then, because phasing is so important, A&R will not be a drag to EBITDA anymore in Germany. You know that we are talking about a much better EBITDA performance as we move into the second half compared to the first half, and this is because we will not see this drag anymore because we will compare to -- ourselves to an half year, which had already the impact of the commercial intensity of the new telco law. And also we had some one-offs last year that supported EBITDA in the first half that, of course, won't recur. And Andrew, if I would just paint in a slightly bigger picture, first of all, you've seen all our competitors' results. Germany remains a really attractive market, probably one of the best performing European markets, of which we have a strong asset in that market. It's behind us now, and you're seeing our commercial momentum regain, and that's what gave us the confidence to do the pricing changes that we proposed. Maybe in the next quarter, there's a relative performance adjustment because of the pricing action we'll see. But if we look through that, clearly, we're regaining commercial momentum. We've got very much the management team focused now on the proposition road map for Q4 and next fiscal year, which we are finalizing in terms of regaining focus on convergence, cross-selling capability that we've been constrained on up until now because of the remedial action that we've been taking. Also structurally, I'd just say, look, we have a really good mobile network. And at the same time, we announced the fiber to the home on a targeted basis for housing associations. I'm really pleased with the combination of both of those things, the cable upgrade program that we've communicated, plus the FTTH program because, together, it's given real confidence to housing associations. So I just look at it, yes, there was a ball dropped, management changing -- management changes were done. My question, please, is just sticking with the phasing of the EBITDA throughout the year. If you look at your guidance at the group level, you've delivered minus 2.5% in H1. You're targeting, I think, just over 1% for the full year, so it looks like 5% EBITDA growth potentially in the second half of the year. And in particular, if you could reference Italy where EBITDA was down, I think, 6.5% in the first half of the year. I think when you look at the year-on-year elements of EBITDA, it's important once again to consider the year we are comparing ourselves to, because there were a couple of elements in last year's performance that are relevant then to the growth rates themselves. In the first half, we had a one-off settlement specifically in Italy, which flattered our EBITDA performance last year, and we called out. And then instead into the second half of the year, we had what we were discussing before in Germany in terms of, if you want, reacceleration of the commercial intensity into the second half. These elements are relevant when you look at the guidance we are giving for a significant reacceleration in half 2, despite, and this may be a little bit counterintuitive, the fact that the energy cost drag will be higher in the second half than it has been in the first half because, of course, the pre-Ukraine hedges that we had in place are rolling off. But the reason why we will have this phasing of EBITDA growth is that we will have 3 big swings between half 1 and half 2, which are actually broadly of similar size. And you are right, it's not all about Germany. So the first swing, as you may have already seen yesterday, is related to Vodacom. Vodacom EBITDA was marginally down in half 1, and we expect good growth into the second half also supported by the dynamics in the international markets. Number two is A&R, the drag we have suffered from in half 1 won't recur in half 2. And then number three, it's clearly our OpEx initiatives where we are accelerating. You've heard about the new EUR 1 billion cost target '22 to '26, and this will also be loaded towards the second half of the year. Net-net, as you mentioned, we have guided to an EBITDA growth at the lower end of our original range, and the only reason why I'm using the word lower end is because of energy movements. Between May, when we issued our guidance, and today, the energy drag has increased, which is why we are zooming in into the lower end, but it's -- it means growth definitely in the second half. Specifically on Italy, the EBITDA dynamic is very much -- once you exclude the settlement, very much driven by the top line. But again, overall, Europe and group will have the dynamics we have just talked about. Your medium-term targets of mid-single-digit EBITDA and free cash flow growth, and obviously, we've seen a 1.5% underlying decline in EBITDA, and guidance for this year is for free cash flow at 4%. And then post the Vantage sale, is the 2.5 to 3x leverage range still appropriate? So in terms of midterm outlook, I'd say -- fair to say that when we set our ambitions 18 months ago, we were coming out of the pandemic, and we were looking forward to more normal economic environment. And we were particularly, in our case, a significant shock coming from energy prices with also the broader inflation. So I'd say until that environment normalizes, we will not be able to deliver what were all our midterm goals within the time frame that we have flagged. As we were discussing earlier on both pricing and costs, we have ahead of us a big peak of energy costs to go through, as you have seen from our presentation. You should think about it as the actions we are undertaking have been designed in such a way that energy cost peak aside, they will maintain us on a good growth trajectory. So when you calculate growth rates, you need to keep that in mind because of simply a technical deferral of a cash tax payment in Germany. So maybe just to frame how the Board would think about the dividend, we have a minimum commitment of EUR 0.09. We are doing a number of portfolio actions that will materialize synergy benefits, et cetera, if we complete everything that we want to complete. And when we look through it and, let's say, the exceptional inflation, and we have the balance sheet effectively to absorb that, if we look through it, management still remains on the ambition of the midterm growth. I would say that, as I said before, we've gone through our cable upgrade plans and the fiber build plans. Because in the end, many of them don't want the disturbance associated with, if you like, upgrading to fiber. So they're just as interested in the cable upgrade plan over time, and there's either disruption on the build outside the building. And then, of course, there's disruption in the building at the same time. And they would really prefer to time that for general refurbishment of buildings, which are longer cycle times. So I think the combination of these 2 things is providing them a lot of clarity on our road map, proving that we really are the natural partner of choice because we can now offer them both options and over a long time frame. I would say that we targeted the fiber build to the housing associations because, frankly, the economics are attractive for us to do that. And also, as we do that, we obviously have additional build around the areas. So what we wanted to do -- and they've already started building in Germany, and what we wanted to do was purpose the build engine onto our build, prioritizing how we want to roll out fiber to our housing associations and areas. So what I'd say is it was more to do with us having a targeted build, taking the capacity in the market. By the way, we're also talking to a number of other construction companies to supplement the Altice build because they're doing the majority, but there's still some residual that we will be building, and those are well advanced as well. So what I'd say is that when I look at -- to your point of NPS, because we've been upgrading our network, I can't point to any particular NPS stats at this point that would suggest a big deviation. Certainly, with our experience in Spain as an example, where we have been having fiber completely overbuilt with cable offering both, we haven't seen any difference at all on the NPS. I think it's about offering a high-quality network, either through that mode or total fiber. On energy, we have quantified the headwind for next year at EUR 500 million in our presentation, and this is based on current spot prices and doesn't have any government intervention benefit in it. You mentioned the German plan, which is definitely the largest, but other countries are also working on anything from tax rebates all the way to the more material price caps. If we talk about Germany alone, it could be over EUR 100 million benefit to our P& L with the type of measures, which are being discussed at the moment. Just two questions on revenue growth, if I could. So I think I'm right in saying that there is no plan at the moment for the most part to lift prices in Germany, specifically on existing subscribers. Let me just answer the base one because it's simple, and then I'll let Margherita maybe talk to the business revenue composition. In terms of -- you're right, at the moment, it's front book changes that we've made. We have not announced anything at this point, and it wouldn't be appropriate to talk about anything in the future on pricing at the moment. And on the service revenue growth in business, 3.4% in the quarter, this is still, I would say, in the main with limited impact from the big initiatives of the European recovery funds. Cloud, 30% year-on-year, there is a wide range of digital services accelerating. And also if you look at it, instead of from the product mix, from a segment mix, I would say we are still -- we are seeing strong acceleration into the public sector where we are growing double digit at the moment. And in terms of the margin of that growth, it's similar to the group margin, it's not dramatically different. Nick, we deliberately don't go after, let's say, product, services, that, let's say, are very, very low margin. I mean, that's not the type of business that we focus on. Our next question today, and this is the last question that we have time for today, comes from James Ratzer from New Street. But given you have the slide in there where you talk about some of the considerations for it, I was wondering if I could just drill along in that a little bit in more detail. So firstly, on the margins, you seem to have kind of 3 red ticks down and 2 green ticks up on how the margin...\n We miss you . But at the same time, you've also mentioned that doesn't include potential uplift that could come in from energy caps. And if you could say anything about kind of what we should think about for the base level for free cash flow for next year, if you can say anything on that. And then the second question I had, just a broader question on Germany. I mean, I think a lot of the commentary you've talked about today, and it has been about successfully fixing some of the problems that were there in the past. On FY '24, of course, we need to wait for the guidance in May, but we wanted to use the presentation to start highlighting the key moving parts end of FY '24 given the macro environment we are facing. And going on to , I'd say we see 2 major drags to our performance next year. Take it as current condition, current spot prices, EUR 500 million. The second is, of course, the wider inflationary pressure that will affect wages and also other costs. Against these, I think, on a more positive note, we should expect Europe to have some structural elements of reacceleration embedded in its performance as we have discussed today. So we will have a weaker exit this year because we have suffered from customer losses, but we have reaccelerated the commercial performance in Germany and Spain. On the demand front, there is the possibility of some macro pressure, but we will also have the benefits of the price increases that we have just talked about. And then finally, we will have the actions that we are undertaking on costs as part of the new EUR 1 billion target that will also be favorable. But I'd say you will have seen us for '23 confirming our EUR 8 billion CapEx spend, excluding Vantage growth CapEx. And looking ahead to FY '24, we feel broadly comfortable in maintaining our current level of capital intense. But if I sit back, I was just thinking that there's really been 4 things that I've talked a lot to Philippe about and what he's been focused on. First was sort of rebuild the team with the right skill sets, capabilities to execute the plan, and he has done that. I'd tell you, secondly, it was about execute through on the plan that was in place for the remedial actions, and he's accomplished that. The third, which they have been working on for the last couple of months was, I was concerned about there were too many initiatives in that business, and it needed to be rationalized, focused down with clearer prioritization to drive execution success and growth. And I was really pleased that we had a review a couple of weeks ago in Germany for a whole day with the team, and they were presenting back on that, that prioritization and trade-offs that need to be made for execution for next year. Now clearly, I can't go through what all of those were, but we're very happy that now is a more focused plan. And then the fourth thing from my perspective was really just continue to execute through on all the investments we're doing around the network, both mobile and fixed. It's a big agenda because if you think about the mobile side, coverage obligations, ensuring that those are executed through. I think it's next week or the week after, go through detailed next steps, et cetera. So these are, I would say, the first 4 things. He's understanding the challenges, issues, what more we could do to improve the experience. That is all the questions we have time for today, so I'll hand back to Nick and Margherita. I'm sure that we will meet in due course over the next couple of weeks, one way or another, and thank you."
}