{
    "symbol": "FWONA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 13:30:19",
    "content": " I would now like to turn the conference over to Courtnee Chun, Chief Portfolio Officer. Before we begin, we'd like to remind everyone this call includes certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in Liberty Media's most recent Forms 10-K and 10-Q or Liberty Media Acquisitions most recent Form 10-K and 10-Q filed with the SEC. These forward-looking statements speak only as of the date of this call and Liberty Media and Liberty Media Acquisition expressly disclaim any obligation or undertaking to disseminate any updates or revisions to any forward-looking statement contained herein to reflect any change in Liberty Media or Liberty Media Acquisitions expectations with regard there to or any change in events, conditions or circumstances on which any such statement is based. On today's call, we will discuss certain non-GAAP financial measures for Liberty Media and SiriusXM, including adjusted OIBDA and adjusted EBITDA. The required definitions and reconciliations for Liberty Media and SiriusXM schedules one and two can be found at the end of the earnings press release issued today, which is available on Liberty Media's website. Now I'd like to turn the call over to Greg Maffei, Libertyâ\u0080\u0099s President and CEO. Today on the call besides myself we will also have Formula Oneâ\u0080\u0099s President and CEO, Stefano Domenicali and Liberty's Chief Accounting and Principal Financial Officer, Brian Wendling. While not a fulsome list, potential actions we might consider include reducing data LSXM to enable a combination and a not overly levered Siri LSXM, steps to better illuminate the value of our live stake, and other potential actions. I would remind you with Liberty Media and some of our various fun entities  we have a long history of corporate action to capture discount and these include structuring the GCI acquisition in such a way it was a mid-lane ATB, the Direct TV RMT and subsequent sale to AT&T, and the subsequent -- the separation of Liberty Expedia and subsequent merger with Expedia. So let me turn to Siri itself which I believe is handling the market challenges well and maintaining their financial guidance despite a reduced sub guidance due to a weak SAR, which has been well documented for reasons like chip supply issues. They had robust financial results for the second quarter, including revenue up 4%, churn steady at 1.5%, and new and used car penetrations up to 84% and 51%, respectively. We also announced extensions with important automaker partners, including Mazda and Mitsubishi. We made continued progress on our connected TV platforms like Amazon Fire, Android TV, LG, and Roku. And on demand music listening in the SiriusXM app is up 41% year-over-year, and that's partly driven by the addition of new, unique, and diverse content. Lastly, we're very excited about our continuing work in podcasting. Versus 2019 AOI is up 50%, free cash flow was up 72%, and that rose to $379 million. Sponsorship AOI was up 81% over 2019 and important new clients included Google, AWS, and Hulu. We have an outlook for a record of 2022 with 100 million concert tickets already sold, fan attendance up 13% in operated venues and almost 30 new venues in the pipeline. Turning to Formula One Group, F1 continued to see record attendance and viewership in the second quarter. Suddenly, we've had record in person attendance, four races this year have had over 300,000 attendance with incredible demand for the Paddock Club. The Hungarian weekend attendance for example with 290,000 was the largest ticketed sporting event in history in Hungary. Turning to our most recent work in Las Vegas, we completed the land purchase at the foreign corporate level. The main Paddock building, which is estimated to be 900 feet long, was the length of three football fields will be exciting, and we're actively working with potential commercial partners to expand our opportunities there. We are building out the F1 team in Vegas across sales, marketing, race operations, and more. We are leveraging local expertise and talent as well, including the LVCVA and our partners at Live Nation. We're still working through the specifics on capacity but I'd note that our founding partners in Vegas; Caesars, Wynn, and MGM are seeing incredible demand and we haven't even announced the formal date. While some of you are excited, you don't have to wake up early for races over the summer break, we here at Liberty look forward to restarting Formula One at Spa on August 28th. As of today, we're just under 600 record for the season and since June 1st we have the best record in baseball despite a sad loss to the Mets last night. We've had six All Stars named this year, most of the team since 2011 and double the amount from last year. We just signed an extension with Austin Riley, a 10-year deal, a $212 million, the largest in franchise history after outstanding performance by Austin this season including a historic July. We do remember how well this worked out last year, acquiring Grossman in left field and Odorizzi a pitcher, both insurance to our lineup, adding also bullpen capacity. We have nothing to report today on LMAC but we do continue to review opportunities and look at the environment, it was difficult for specs as an opportunity for us. Thanks, Greg and good morning, everyone. At quarter end, Liberty SiriusXM Group had attributed cash, liquid investments, and liquid public debt and equity securities of approximately $368 million, which excludes $126 million of cash held directly at SiriusXM. As of August 4th, the value of our SiriusXM stock held at Liberty SiriusXM Group was $21.5 billion, and the value of the Live Nation stock was $6.8 billion. Total Liberty SiriusXM Group attributed principal amount of debt is $13.7 billion, which includes $10 billion of debt at SiriusXM. Formula One Group had attributed cash, liquid investments, and monetizable public holdings of $1.1 billion at quarter end, which excludes $935 million of cash held directly at Formula One. Total Formula One Group attributed principal amount of debt was $3.2 billion, which includes the $2.9 billion of debt at Formula One, leaving $306 million at the corporate level. During the quarter, we repurchased $146 million face value of 1% FWONK cash convertible notes due in 2023 for approximately $240 million, effectively retiring 3.95 million underlying FWONK shares at an average price of $59.88. As we discussed last quarter, under the current Concorde Agreement team payments now take the form of an entirely variable price fund, which is calculated with reference to a measure of F1's adjusted EBIT rather than the adjusted EBITDA measure used in previous agreements. Also at Formula One, other F1 revenue was running materially higher than the prior year, up about $80 million in the second quarter and $130 million year-to-date compared to 2021. Note that the Paddock Club didn't run until July of last year, while year-to-date through the second quarter, F1 has welcomed over 35,000 guests at the 7 events where we've ran our Paddock Club. These costs were up $76 million in the second quarter, approximately 75% of which is due to freight and hospitality cost variances. Finally, at F1, at last year's Investor Day, we included an appendix slide detailing F1's foreign exchange exposure. Finally, the Braves Group at quarter end, they had attributed cash and liquid investments of $207 million, which excludes $66 million of restricted cash. The Atlanta Braves also announced several new construction projects for 2022, a new office building will be constructed known as 5 Ballpark Center that will house the national headquarters for Truist Securities under a 15-year lease. The Braves were also working on a new project with Goldenrod Development Company called the Henry, a luxury apartment building. If completed, the Braves would have a minority equity stake in exchange for two acres of contributed land with no additional cash contribution from the Braves. This is still in the evaluation phase, but would be another minority investment with a modest cash investment. The Battery is generating healthy cash flow, which is partially used to support the operations of and future investments in the Battery and partially to support Braves Baseball. With that, I'll turn it over to Stefano to discuss Formula One. We are now over halfway through the 2022 race season, and we have seen unpredictable outcomes and a lot of wheel to wheel racing, especially in the mid field. This action on the track has drawn in the fence will set out crowds at our events with 420,000 --; 400,000 at Silverstone; 300,000 in Austria, 300,000 in Hungary, and 338,000 for Canada. We're coming over 35,000 people across nine events this year, including record-breaking attendance of Silverstone where we have 7,500 guests. The TV audiences is also tuning in with the average audience program through France , up to 9% versus 2001 season average. Bidding on demands for our media rights, we reached a renewal agreement with Bandeirantes in Brazil throughout 2025, which will cover all qualifier session and Grand Prixâ\u0080\u0099s all live free to our bases. Additionally, we secured a strategic partnership with Claro Brasil to be the exclusive distributor of F1 TV Pro in the country. F1 TV Pro has proven to be a compelling product for our fans, so it's worth a brief overview. F1 TV Pro office coverage of every F1 session live on demand as well as live access to all 20 onboard drivers cameras and teams radio channels, session replays and highlights, live streaming of every F2, F3, and F4 super cap session, and a library spending over 2,000 hours of archives and feature programming. The platform was revamped in 2021 and is now more accessible than ever before with the release of the service across many of these streaming platform, enhancing the viewing experience for Formula One fans around the world. On to the racing promotion side, we were pleased to reach a long-term agreement with Melbourne that will have us racing there through 2035. On the sponsorship front, we announced PATRÃ\u0093N Tequila as the first-ever official tequila partner of the F1 Paddock Club. They recently completed the auction for the 1990 Leyton House CG901, which placed second in the French Grand Prix, sold for over 500,000 Pounds. It is already in development with support from our key stakeholders, the FIA, Aramco, and from the F1 global partners, fuel providers, and F1 piston manufacturer. While racing fuel represents only 0.7% of our emission, we believe sustainable fuels where we can have a greatest impact on the global transportation  sector. While we have already instituted significant changes to create the more sustainable sport, we are now focusing on the following areas; exploring carbon reduction measure for fast revenue to Formula One events, sharing the cover induction activities from across our sporting community, taking steps and continue to investigate our measures to deliver more efficient logistics and travel arrangements from air, sea, and land. Furthering our commitment to the environment, we have partnered with Banco Santander to amplify the Santander ex-Global challenge come down to zero, a competition that challenges entrepreneurs to create sustainable solution for the future. First launched in 2021, the Women Wildcard represents another route into F1 eSports for female participants. We also announced earlier in the year our extended funding commitment to the Formula One Engineering Scholarship Program for unrepresented group until 2025, continuing its drive to increase diversity within the sport. While the teams and the drivers enjoy a much deserved break, we will continue to capitalize on the growing popularity of F1 and convert this into opportunities to drive the business forward. Greg, a couple of things on the structural side I want to ask you about, you mentioned separating Live Nation. Maybe just talk about sort of the pros and cons...\n Ben, just to be crisp, I said, highlight the value. And then I wanted to -- we get the question quite a bit, I'm sure you do too about a hard spin of the Braves. So on the structural side, look, we're not here to announce anything today. And the advantages of our structure have been with the trackers have allowed us to have flexibility to move assets around, have allowed us to have flexibility to align things in the most attractive way, to manage our taxes in the most efficient manner. As far as how we might highlight value, there are ways from spinning to creating another tracker to other kinds of actions we can take. The history of Liberty is as we've tended to, over time, take this business to where we thought we could add value, keep them internally and then at some point spin them out. We thought that they would be more attractive as independent entities for the long term, not just in the short term. So obviously, I've given you as much of a non-answer as I can, Ben, but that's just with our history. But I think you should look at our history and say, we have taken corporate actions to spin things off, and I went through a few of them and the subsequent disposition of those companies. On Vegas, it's a little hard to forecast the CAPEX because we are still putting together the program that we will undertake there. And I mentioned our goal is to have a facility which is not only magnificent for the race, but has the opportunity to be an ongoing activation, have ongoing activations and events at that facility even when the race is not underway. It's not going to drain us in any way, and it's not going to forestall us from doing other actions, including potentially investments around the SPAC repurchases, debt management, and the like. If I can, Greg, just to add on the fact that, of course, the CAPEX builds and the tight program is there, with just almost six months -- 16 months ago. I guess Greg, I also had a structural question. I guess, another option that you have would be to distribute SiriusXM shares to Liberty shareholders. So on the first point, I think, Bryan there's a wide range all the way from distribution of shares, which would probably not -- would be -- unless you can figure out some way to get compensated for our controlled position, probably not optimal. There are things that are halfway in the middle, like as you may remember, with Lemidia where we did where we spun our DIRECTV shares, but we still had in the form of the B shares having influence to hard spins that are just fully away or even subsequent spin mergers like the GCI example or like effectively what we did in Expedia. I think there's a full range of opportunities, and we'll try and do the one that we think maximizes long-term value. On the side of expenses, I'll let others comment as well, but we'll know we did have some increased expenses, increased investment to start up the round in Vegas, including some issues there. So as far as the longer term, I think we're not at an elevated level, but I'll let others add their views. There were some minor onetime professional fees that we wouldn't expect to repeat and, I would say, pretty minor Vegas expenses at this point in time. On Formula One, obviously Greg, the equity is like because there's a contractual nature of the business. I think you're right to note, Vijay, the highly contracted nature of the business and which manages downside. Obviously, there's FX downside and there's cost potential downside. But in general, we've seen demand that's been able to outstrip those. And while we made budget conservatively with contingencies is our nature, we've been able to outperform those contingencies even in light of the cost structures. But obviously, we can't foresee every inflationary impact. But in general, I think we've been able to work through those and the FX. And if I could follow up, obviously, on the -- maybe a little early on the race calendar for next year, but there's a bunch of European races that come sort of under contract. It looks like France, Belgium, Monaco, and obviously, you have a couple of new races next year Qatar coming back and Shanghai coming back. As I've stated before, we will come back to the early October due to the process of course, having the clearance from the world multiple council of our calendar. Of course, there are discussions to make sure that the calendar is robust, it is following also the fact that we would like to keep the right flow in terms of efficiency around the world, considering the needs of a calendar to be spread out from March to November, all around the world. Of course, the effect that you were seeing before on the choice between the Europe and then out of European races has an effect on the revenue side. But I would say the main point is to have an excited calendar, the demand is very, very high, and it's our responsibility to put in place a calendar that is available to our stakeholders but also valuable to respond to the request that we are all around the world. So we cannot spot anything more than what we are saying because we are, of course, finalizing all the details but we, for sure, expect to have, I would say, capital raises more than this year, but less than 25%. First off, we've seen in the press the possibility of some auto OEMs entering F1 either on the manufacturer or engine side. And then separately, with other F1 revenue, I know there's a lot of noise in there because of the freight cost. I mean with regards to the two new OEM coming in, as you can imagine, it's not for us to say anything that will be, let's say, we shouldn't say. I think that in terms of what is the benefit, the beneficial credibility, the benefit is showing that our strategy of the future will help the manufacturer to have another route that will allow them not to be only fully electric in the offer to the mobility side, but also using the expertise that only follow on through the technology. That we have -- can help them in order to find new way of being present in the market with average engine with sustainable fuel that will be able to be much more effective in our opinion, all around the world if we want to achieve the goal of carbon neutrality. And on the other hand, from the sporting point of view, the more manufacturer we have, the more structure in terms of having manufactured with other teams will enable the sporting side to have, I would say, more things that could be seen even in the more independent into the sport. We strongly believe that our technological platform for the future, if that is the right one in terms of redundancy. As Stefano just said, obviously, and Stefano touched on this, it's a great validation to have these OEMs want to enter or reportedly want to enter. If they were, they're both the ones discussed or both enormous engines of innovation and enormous engines of promotion and all of those have only seem to be good for our sport. We see and this is what we have already seen for this year, incredible numbers with regard to Paddock Club, with regard to new license that will be seen as an effect on our balance sheet. In the other F1 category, 98% of what we're seeing on the increase is all coming from Paddock Club and freight, as we talked about in our prepared remarks, where we didn't have races last year, and we weren't traveling as much. But within primary revenue, we're seeing increases across the board, as Stefano just mentioned. So licensing to your point and F1 TV as well as the main three categories, promotion, sponsorship media rights. If you look at some of these things like Paddock Club, yes, just to add to Brian. I mean if you look at some of these things like Paddock Club, we've never seen more demand. And we've not only seen demand, we've been able to, in some cases, promoters are able to increase the size of the Paddock Club areas and still manage it at a higher number and higher prices. Greg, the discount at Liberty Sirius versus Sirius is so much larger than the discount you would see at Liberty Broadband and Charter. Barton, it's a great question. I think you could argue a little more complexity, you could argue investor fatigue, you could argue the relative scale and size of the two entities compared to the broadband entity. Hard to attribute any certainty to any of those, but those are probably all factors that -- still that we're not going to act on it in some way, where is it broadband, maybe it's more crisp where the future is going. I think as you said -- as we've said before, and I said earlier on this call, we're going to take advantage of that through the discount. And at some point, we're going to take an action, and we're looking at those actions to do -- to tighten that discount. But in the interim, we're going to buy that stock and take advantage of it and drive our NAV relative to the underlying NAV up. I don't know if anybody else on the team, Ben or somebody else wanted to add something, but I think it's hard to be determinative about which of these factors is driving the difference. Well, I think baseball has a more complicated situation because of the regional sports network situation than other sports, in particular, the cleanest comparisons or the completeness is football. And certainly, my understanding is that MLB would love to find a structure where they could deliver more national rights, which is really not available or difficult today on some kinds of games. And obviously, the RSN weakness is going to create an opportunity, whether that happens this year or next I do think there will be some change in that given where Diamond appears to be headed. Looking just at the Braves, we're blessed, as we've said before, with a lot of demand and good audience in our territory. So we remain optimistic about our relative position on any kind of streaming deal, and we feel good that we have a product which people want in a big territory and probably what some people estimate may be the most profitable RSN, where we're getting paid pretty well, but the RSN owner is also making money. Greg, I think you mentioned in response to Brent's question, something about the reasons to keep things together until you have full ATV flexibility. No, I think we are -- if I could just interrupt, David. That's not the only reason, I think I mentioned to keep the Corpus together or to keep things as I mentioned, some of the other reasons around ability to move assets, tax advantage, tax flexibility, etcetera. I just wanted to set before you set the question, I wanted to make clear that's notâ\u0080¦\n No, that's fine. Yes, I don't -- I can't -- I don't know only on the top of my head, but I'll just note the one you called out. So if we deserve any credits for finding the right management teams and backing them and doing the great work that they've done, I'm not sure we can take much beyond that. And the good news is that on the other side, the investment on our side is not relevant because we don't own any CAPEX in that respect. We have a lot of people that have to invest a lot because when we are talking about big events, we are talking places where the needs of energy for hosting a Grand Prix where there are more than 400,000 people needs to have a path of evolution of this technology. So I think we should be very, very proud of this idea of pushing forward this technology to our leadership on that respect. Matthew, on the second point, I'm not sure exactly what you're referring to. Maybe you could help -- repeat the question, sorry. Well, I think it's part of Live Nation strategy to be ubiquitous as possible in making buying tickets as simple as possible. And the technologies that they built to distribute their ticket buying capabilities are a unique advantage, I think, compared to most in the industry. And the same thing, I think, about SNAP, which has obviously had music aspirations as well. So I think it's an important element of continuing to grow the strategy, but I'm not sure it's uniquely different than anything else we've done. Obviously, these have been trophy assets that people have wanted to buy the best of. We've certainly looked at purchasing in a lot of cases, other sports assets and have been surprised at some of the prices. And I think for the right kind of trophy assets, the valuations are going to continue to rise. And with that, we'll conclude today's question-and-answer session. No, I just want to say thank you to all our listening audience for your questions and your attention. Hope to see you next quarter, if not sooner. With that, we'll conclude today's conference."
}