{
    "symbol": "FWONA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 17:50:26",
    "content": " Before we begin, weâ\u0080\u0099d like to remind everyone that this call includes certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in Liberty Mediaâ\u0080\u0099s most recent 10-K and 10-Q or Liberty Media Acquisitionâ\u0080\u0099s most recent Forms 10-K and 10-Q filed with the SEC. These forward-looking statements speak only as of the date of this call and Liberty Media and Liberty Media Acquisition expressly disclaim any obligation or undertaking to disseminate any updates or revisions to any forward-looking statements contained herein to reflect any change in Liberty Media or Liberty Media Acquisitionâ\u0080\u0099s expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based. On todayâ\u0080\u0099s call, we will discuss certain non-GAAP financial measures for Liberty Media and SiriusXM including adjusted OIBDA and adjusted OIBDA. The required definitions and reconciliations for Liberty Media and SiriusXM Schedules 1 and 2 can be found at the end of the earnings press release issued today, which is available on Liberty Mediaâ\u0080\u0099s website. Now, Iâ\u0080\u0099d like to turn the call over to Greg Maffei, Libertyâ\u0080\u0099s President and CEO. Today speaking on the call, we will also have Formula Oneâ\u0080\u0099s President and CEO, Stefano Domenicali; and Libertyâ\u0080\u0099s Chief Accounting and Principal Financial Officer, Brian Wendling. Last quarter, we discussed our intention to reduce debt at LSXM and we took actions during the third quarter. Effectively, this was a share repurchase across the LMC equities with $179 million effective cost to repurchase 4.5 million LSXMA shares and $1.1 million FWONA and $500,000 BATRA intergroup interest shares effectively repurchased. The resilient sub base experienced a record low churn of 1.5%, revenue was up 4% and EBITDA was flat as we continue to make investments, including end product development. Despite soft auto sales, we continue to achieve vehicle penetrations with an enabled fleet of approximately $150 million. SiriusXM also set out strong cash flow business and guidance for the year, full year guidance for 2022. Sports has proven obviously to be high appeal for new subs to both convert at a higher rate and higher retention, once they are obtained. Versus 2019, AOI was up 45% and free cash flow was up 88%. Live also beat last quarterâ\u0080\u0099s record for highest quarterly attendance with over 44 million fans across 11,000 events. Per fan spending was up 30% through September in U.S. amphitheaters, and Ticketmaster experienced all-time high GTV, which was up 62% versus 2019. Live is closing out a record year, but there is more growth to come with 115 million tickets already sold and sponsorship for 2023 up 30% over this point last year. We continue to come up with new analogies, which are familiar and F1 continued to fire on all cylinders with incredible fan demand. Importantly, as weâ\u0080\u0099ve invested, there has been a continued growth also in the U.S. market with three races planned for next year, including our landmark Vegas race. We also announced the renewal of our ESPN contract at a value, which was many multiples of the prior contract. We also announced a record 24 race calendar for the coming year, including renewing in Monaco, where we have a 3-year agreement to keep that iconic race on schedule; renewing in Mexico City, where we have a 3-year deal, which highlights the value that F1 brings to all cities. For example, between 2015 and 2021, the Mexico City Grand Prix generated $2.4 billion of economic activity and created 57,000 jobs. At the corporate level, we refinanced the FWONK convertible on attractive terms with fewer shares underlying the instrument and a lower initial conversion price of $86.06. For the first time since 2003, they won over 100 games and it was an epic comeback for the second half of the season. As you may recall, beginning -- the start of June, we were 10.5 games behind the Mets. And there are wonderful things that come from that, but it also can lead to increased costs. We think they ultimately create value for the franchise and fan engagement, which will drive revenue. There were also modest cost increases for post World Series activities, for example, a trophy tour and creating special merchandise. While the results have not been what we wanted in terms of finding the deal that we thought was attractive, I would tell you we evaluated over 140 targets, but the high valuations for 2021, the poor IPO market, plus overall market volatility led us to the conclusion that we could not find a solid target with attractive valuation and return characteristics. Finally, the recent tax law changes under the IRA created additional corporate liabilities if we were to extend the unwind into 2023. At quarter end, Liberty SiriusXM Group has attributed cash and liquid investments of approximately $225 million, which excludes $39 million of cash held directly at SiriusXM. In September, Liberty SiriusXM Group paid approximately $284 million to repurchase $210 million aggregate principal amount of the 1.375% cash convertible notes. This was funded with $179 million of cash on hand as well as cash from the Formula One Group and Braves Group from the settlement of their intergroup interest held at Liberty SiriusXM, corresponding to the amount of notes repurchased. As a result, 1.1 million FWONA shares and $500,000 BATRA shares underlying the portion of their respective intergroup interest held by LSXM were canceled. As of November 3rd, the value of the SiriusXM stock held at Liberty SiriusXM Group was $19.5 billion, and the value of the Live Nation stock held was $5.3 billion. Total LSXM Group attributed principal amount of debt is $13.4 billion, which includes $9.9 billion of debt thatâ\u0080\u0099s directly at the SiriusXM level. Formula One Group had attributed cash, liquid investments and monetizable public holdings of $1.1 billion at quarter end, which excludes $1.1 billion of cash held at Formula 1. Total Formula One Group attributed principal amount of debt was $3.5 billion, which includes the $2.9 billion of debt directly held at Formula 1, leaving $567 million at the corporate level. During the quarter, we issued $475 million aggregate principal amount of 2.25% FWONK convertible notes due 2027. A portion of the proceeds from the offering were used to repurchase $213 million aggregate principal amount of the 1% FWONK convertible notes due 2023, leaving just $27 million outstanding at the end of the quarter. As Greg mentioned, LMAC filed a proxy statement to obtain stockholder approval to unwind before year-end. On unwind, these are material investments will not be recoverable, but the $250 million forward purchase agreement that Formula One Group had committed to LMAC will be terminated. On the Formula 1 operating business, we will remind you that F1 is best viewed on a full year basis, given some volatility in the quarters. However, there wasnâ\u0080\u0099t one additional flyaway race during Q3 of â\u0080\u009821 with Russia having taken place last year and France hosting a race this year. As a reminder, we recognize team payments pro rata across the race calendar, though a quarter where we recognized less revenue due to the mix of races, the team payment percentage may appear disproportionately larger. F1 also recognized higher other cost of revenue, primarily due to one additional Paddock Club operating in Q3 2022 and from the cost of servicing significantly larger Paddock Club attendances compared to the prior year period. Looking year-to-date, revenue increased 35% and our adjusted OIBDA grew 43% with 140 basis points of margin expansion. Finally, at the Braves Group, at quarter end, they had attributed cash and liquid investments of $159 million, which excludes $15 million of restricted cash and the Braves Group had attributed principal amount debt of $601 million. The interest in Formula 1 is huge from fans, potential partners and those who want to host the race. Formula 1 just finished a couple of amazing weekends in Mexico City and in Austin, and the 2022 season has delivered exciting action on the track. Max Verstappen has been an incredible this decision, setting a record for most wins in the season with 14 Grand Prix wins so far in 2022 with his win in Mexico City last weekend. He secured his second world championship in Suzuka and Red Bull won the Constructorâ\u0080\u0099s Championship, their first since 2013. Certainly, weâ\u0080\u0099ve seen that in the race attendance and now had 10 races with crowds over 300,000 with three of those exceeding 400,000. A great example of growing interest is Austin, where we welcomed 440,000 fans across the event, more than double the attendance in 2019. The promoter states that the ticket demand could have reached 500,000, but for this focus on maintaining a high-quality fan experience. Across the 10 races where we gathered spectators data this year, first-time attendees were about 50% of the total crowd. And weâ\u0080\u0099ve seen surge in demand on the higher end, too, with record sale in Paddock Club and our hospitality products. We were happy to renew our agreement with Monaco and will race there through 2025, with expanded rights for Formula 1 related to broadcast, Paddock Club and sponsorship. As Greg mentioned, the economic benefit F1 has brought to Mexico City since 2015 has been incredible. They have selected Sauber as their strategic partner and plan to acquire a stake in the Sauber Group, who will compete as a now de facto team from 2026. Formula 1 presents a global stage for the Audi brand, and they see the high performance and competition in our sport as a driver of innovation and technology. Audi was further attracted to F1 given our efforts in sustainability and cost efficiency, which will aid in achieving their own sustainability goals. It also shows the increasing value of the teams in the current environment, driven by the stability provided under the new regulation and the growth of the sport, of which everyone in F1 continues to benefit. And with this new deal, at least 16 races per year will air on either ABC or ESPN with all broadcast commercial-free. Through 18 races in 2022, theyâ\u0080\u0099ve seen an average audience of 1.2 million up from 994,000  in 2021. The Miami Grand Prix drew an average viewership of 2.6 million, the largest U.S. audience on record for a live GP. Additionally, we extended our agreement with ServusTV in Austria until 2026 and secured a partnership with Telcel and Telmex in Mexico to bring F1TV Pro to a subscriber who can easily add the service on to their existing contracts for mobile or internet services. The F1 Esports Series Pro championship presented by Aramco returned for 4 events, each spanning over 3 years. This includes more live show as the teams and the drivers battle for their $750,000 prize spot. Similar to F1, we have seen several high-profile drivers move across the grid. This year, we had 1.3 million players attempt to qualify, almost 3 times the amount we had in 2021. And finally, to further our progress to net zero, Formula 2 and Formula 3 announced a partnership with Aramco to pioneer sustainable fuel for 2023. This is an important step to reach a 100% sustainable fuel by 2026, which will be a requirement of all FIA championships. I want to thank the whole F1 family, our fans and our investors for all the support this year. We look forward to seeing many of you at our Annual Investor Day on Thursday, November 17th. If youâ\u0080\u0099d like to submit questions in advance, you can e-mail investor@libertymedia.com. Greg, I just wanted to focus on Liberty SiriusXM Group. And I guess as part of that, specifically, just curious if you could talk about the strategy around the Live Nation stake at Liberty and whether thereâ\u0080\u0099s ways for Liberty to create value with that stake beyond just being sort of an ongoing shareholder of Live Nation, which Iâ\u0080\u0099m sure youâ\u0080\u0099re bullish on. Well, Doug, I think -- thank you for the question. I think weâ\u0080\u0099ve gone through some of the options that are on the table and discussed them before, and Iâ\u0080\u0099m probably unlikely to do that -- to go through them all again, but to say we are aware. I just want to reiterate, we think Live is very attractive. And we think there are things that -- businesses that are worthy to add on to Live that could be interesting, that are opportunities for us. Maybe, Greg, as just a quick follow-up, you could help investors kind of shape time frames. Doug, I give you full credit for persistence, but I think I said what Iâ\u0080\u0099m going to say. I think on past calls when asked about the ATB status of SiriusXM, you said that you believe it is an ATB. And then Stefano, your comments on the attendance increases, I think, were really interesting. Iâ\u0080\u0099m going to let Stefano cover attendance first and then Iâ\u0080\u0099ll touch on the things Iâ\u0080\u0099m not going to answer with you, Bryan. The attendance increase is just magnificent in terms of what Formula 1, is bringing mainly to new audiences. And that is true that the business model we are having with certain promoter is more related to the fact that there is a fee that they have to pay, there is the high-end Paddock Club that is on our side. And thereâ\u0080\u0099s -- not a challenge, but the big opportunity to move forward is how we can maximize the revenue and monetize the revenue that we can take from the fact that Formula 1 has become more and more attractive. We have a different way to do it, and Iâ\u0080\u0099m sure that weâ\u0080\u0099re going to capitalize this growth in the best way that we can in the next couple of years. Iâ\u0080\u0099m going to restate, I still believe SiriusXM as an ATB, no change in our position. These things tend to get resolved and firmed up at the time something gets tested, but that -- we still have that position. Is there -- but when I step back and I think about sort of broader Liberty, it feels like there is sort of a slow march towards asset-backed securities, right, like eventually the terminal year, it seems to me everything is going to be asset backed. Off the top of my head, I can think of the media, which was effectively DIRECTV, CommerceHub, Expedia, Liberty Expedia going to Expedia. And weâ\u0080\u0099ve obviously breaking curate off on its own, I mean I can -- many, many times. I think itâ\u0080\u0099s a recognition of these things have a life, the market. Unlike many sponsors of SPACs who were playing for the carry, we had committed real capital and weâ\u0080\u0099re concerned about and aligned with our shareholders in wanting to have a good return, not just a pop. I think SPACs are obviously challenged for many reasons, both because of the market reaction right now and also because of the regulatory profile towards them. Stefano, I wanted to see if you could expand a bit on your media rights renewal with Sky. And then, Greg, just wanted to see if you could update on how youâ\u0080\u0099re thinking about using Formula 1â\u0080\u0099s cash balance in light of your net leverage and decision on LMAC. I think that when we talk about media rights is a landscape where we have to consider the evolution, mainly in the new market that is becoming attractive for Formula 1. In the more, letâ\u0080\u0099s say, traditional mature market, I think thatâ\u0080\u0099s what we have taken as a decision to invest and to be stable with Sky means a lot, because in terms of the other opportunities in this market are not really the ones that can extend from the financial and also for the awareness point of view and the country point of view what we want to achieve. It is clear that the fact that we are growing give us potential for the future to see how in that kind of the dimension, not only pay TV, but also other means that could be interesting for us to be attractive for our business. Of course, we want to make sure that -- for the future decision, there is also the possibility for our F1 TV that is going tremendously well to be incorporated in the offer to our customers. And this is, I would say, if you go back to Sky, the recognition of the value of that investment for the value of our F1 content in the world. If I could just add on -- I mean, I reinforce the point. And I have to tell you, Iâ\u0080\u0099m always very impressed with what they do and securing that and ensuring that good partnership for a longer period of time was attractive. As far as what our uses of cash are going to be, we have a high-quality problem that we have a great free cash flow generating entity in Formula 1 with, we believe, the potential to increase that over time. But we also think there are potentially in this market opportunities for all the reasons that I talked about the difficulty in the market, a nonmarket tested or no need to do external financing, ability to do something on our own could create interesting opportunities. So, we will continue to weigh both the flexibility that weâ\u0080\u0099re provided by those free cash flows and the delevering against share repurchase, against other alternatives in the space like investing in our business at Las Vegas and outside opportunities. A few on F1 for -- I guess, for Greg or Stefano or both of you, on the ESPN deal, which is -- or Disney deal is now formally announced, at least from the press, you guys took less money -- itâ\u0080\u0099s a lot of money, but less money than you could have had. And then, maybe this is for Brian, but just -- you didnâ\u0080\u0099t mention currency in the press release at F1. And G&A and corporate costs were both up quite a bit year-on-year and quarter-on-quarter, maybe Vegas related. Look, we have had a belief in the strength of the business, which caused us to cut initially a shorter deal without getting the highest paid last time. So far, betting on ourselves has been the right strategy, betting on growth, betting on breadth rather than a current pay has been the right strategy and I think you saw that exhibited. There were other things that ESPN has been a great partner about, and I think the opportunity to work with them on things like F1 TV was a part of why they were a good partner and go forward on that basis. So, Iâ\u0080\u0099m -- weâ\u0080\u0099re very excited about F1 and ESPN being together for the next three years. But I have to tell you, weâ\u0080\u0099re also excited about the kind of opportunity weâ\u0080\u0099ll see in three years when we renew with somebody. A couple of years ago, there were not so many media rights holder in U.S. that wanted to invest with us. And now we need to give the credit to ESPN that in terms of content, in terms of attention, in terms of how they are really following Formula 1, they did a phenomenal job, which will be even stronger in the next three years because we have agreed the positioning of the race in certain channels to have more attention to that. And I think that the fact also that with this agreement, we keep as mentioning the F1 TV on our side means a lot. So I think that the best solution in three yearsâ\u0080\u0099 time, we see how the market will develop. And then on the G&A question, again, I would just reiterate, always better to look at this on a full year basis, but we did have a mix shift in the number of races that were either European versus flyaway. And then, as you pointed out, on Vegas, still not material, but obviously, there are some costs in there related to Vegas as they have their prepared for their launch event and ticket sales. Itâ\u0080\u0099s really kind of at levels that we havenâ\u0080\u0099t seen in years, maybe in my lifetime, I donâ\u0080\u0099t know about others. But I think that the way that we are structured, the way that we have done the deal will protect us -- will enable us to move forward in this direction. Therefore, I would say this kind of situation lets us think that we should be optimistic in this context that is, of course, we monitor. I think -- and then if I can just add weâ\u0080\u0099re seeing a case where look across our business, high-end consumers are still purchasing, whether thatâ\u0080\u0099s at Formula 1 or at Live Nation or at the Atlanta Braves. And I think that is reinforcing the point that Stefano made, we have many promoters who are doing very well, including those in Europe. And then, the other thing I was curious about is the fact that weâ\u0080\u0099ve got the race winner, the team winners pretty well sown up well before the season is over at Formula 1 versus last year, things were pretty competitive, right, until the very end, the last lap. I mean, first of all, we have the last two races with sold down tickets and the number is really growing. Maybe -- team didnâ\u0080\u0099t take the right opportunities, but what we saw on the track is with real racing, thatâ\u0080\u0099s what we wanted. And Iâ\u0080\u0099m totally confident that next year, the fight on the track will arrive up to the end of the calendar. And as you have seen in the last races, on the sporting side, there is a lot of attention. There is a fight for places that also, for the team perspective, is related to the financial position and the financial rewarding, if they achieve a position better than the other team. First, I was wondering if you could help us understand whatâ\u0080\u0099s incremental in the new agreement with AWS. So the fact that we have a new for -- so many years with an interesting increase in terms of financial contribution, it means that also AWS recognizes the power of our platform. With regard to the value or the process related to the possibility of F1 team to be into the championship, of course, there is the primary step that both us and FAA has to be an agreement for that. If so, of course, weâ\u0080\u0099re going to discuss it internally and we see if this has any kind of a real potential new entry can give the benefit for the value of the championship. On top of it, there is a value that has to be recognized to the teams that are already into the championship because, of course, they cannot allow any dilution of their financial partnership with the F1 championship. It will be a real incredible new entry team that we want to discuss with us, we are ready to discuss, but we are not in a best position today for that. With the big inflection in interest in F1, especially in the U.S., are you seeing a lot more activity on the EA game, Codemasters game thatâ\u0080\u0099s been around forever, I guess, since 2000? Now that youâ\u0080\u0099ve got a movie, it feels like video games and such are another area where you could probably increase your ancillary potential a little bit. Matthew, I think that the fact that we are bringing in new customers that are getting younger and younger will allow us to see on the licensing point of view an incremental opportunity to increase the revenue stream for us. On the other hand, I would say what we need to stay always focused is that we are a physical sport on the track. Thank you all for your interest in the Liberty Media Group, and we look forward to seeing many of you in a couple of weeks in New York."
}