{
    "symbol": "FWONA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 22:03:10",
    "content": " Before we begin, we'd like to remind everyone that this call includes certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Liberty Media expressly disclaims any obligation or undertaking to disseminate any updates or revisions to any forward-looking statements contained herein to reflect any change in Liberty Media's expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based. On today's call, we will discuss certain non-GAAP financial measures for Liberty Media and SiriusXM including adjusted OIBDA and adjusted EBITDA. The required definitions and reconciliations for Liberty Media and SiriusXM scheduled one through three can be found at the end of the earnings press release issued today, which is available on Liberty's website. Today speaking on the call, we will also have Formula One's President and CEO, Stefano Domenicali; and Liberty's Chief Accounting and Principal Financial Officer, Brian Wendling. First, let me start with an update on the split-off of the Braves and the creation of Liberty Life Tracker. We expect we will have a simplified structure following the recapitalization of LSXM and the creation of Liberty Life Tracker, and we are focused on rationalizing this structure in the near-term. Looking at SiriusXM, the underlying asset, reported strong fourth quarter results with record high ARPU and EBITDA and record low churn. The ad market remains soft, especially in the first half of 2023, and we are seeing moderating marketing spend ahead of the fourth quarter app revamp. We expect peak satellite CapEx in 2023, and we are now a taxpayer, something which previously we had not fit. We are building improvements around commerce and identity to reduce friction, and the new app will have more personalization as it has within 360L. We do expect these negative trends in the ad market and the SAAR will turn, and we have a resilient business model with meaning free cash flow, so we still remain optimistic about our longer-term prospects. And last year, it also benefited from 20 million of tickets that were rescheduled from prior periods due to COVID. Formula One Group, right into the 2022 year, attendance records were set, we were up 36% over 2019. Our fan base is increasing diverse with new fans being younger, and the share of females within the fan base 40% larger than the share in the established fan base. One in three fans globally started following F1 in the last four years in the U.S., it's even higher at one in two. This is a result of many efforts and most of them related to our efforts to drive the access to -- our drivers across all channels, not only Drive to Survive, but the driver preference on social pages, coverage in larger use publications, late-night comedy appearances on people like Jimmy Kimmel. And it's interesting to note, for example, look at our Instagram followers and comparing GOATS (ph), Lewis Hamilton has 31.5 million versus Tom Brady at 13.6 million. And looking at the younger talent, Leclerc has almost 10 million and Luka Doncic is at 8 million. We will have three U.S. races in 2023, the second year of Miami, capitalizing on the first year success with several improvements around hospitality and security. We grew baseball revenue in 2022 even though we had experienced less post-season gains, capitalizing on the tailwinds from our 2021 World Series win. We had year-over-year growth across ticket sales, sponsorship, concessions and retail. Bleacher Report called the Braves front office, the number one in Major League Baseball for the 2023 season, and we tend to agree. And GM Alex Anthopoulos invested smartly in the off-season, adding to the already core talent we have by locking them up in multiyear deals. At quarter end, Liberty SiriusXM Group had attributed cash and liquid investments of approximately $305 million, which excludes $57 million of cash held at SiriusXM. As of February 28, the value of our SiriusXM stock held at Liberty SiriusXM Group was $14.1 billion, and the value of the Live Nation interest was $5 billion. Total Liberty SiriusXM Group attributed principal amount of debt is $13.1 billion, which includes $9.5 billion of debt that's down at the SiriusXM level. Formula One Group had attributed cash, liquid investments and monetizable public holdings of $1.8 billion at quarter end, which includes $752 million of cash at Formula One. Total Formula One Group attributed principal amount of debt was $3 billion, and this includes $2.4 billion of debt down at the Formula One level, leaving $565 million at the corporate level. During the quarter, F1 refinanced its term loan and revolver at attractive rates and an extended maturity. F1 repaid $477 million of its term loan B in connection with this refinancing, using cash on hand. And at year end, Formula One's $500 million revolver is undrawn. On the F1 operating business, given quarterly variability in the year-over-year rate calendar, a reminder that this business is best analyzed on an annual basis. Team payments as a percent of the pre-team OIBDA as reported was 66% in 2022, down from 68% in the prior year, benefiting from the team -- the terms of the 2021 Concorde agreement. As a reminder, other costs of Formula One revenue are largely variable in nature and relate to both primary and other F1 revenue opportunities. As mentioned in Q3, we did have some modest increases in personnel costs due to the change in the company's LTIP from a stock to a cash based long-term bonus program and increased headcount to support growth. Also included in SG&A in 2022 was $19 million of costs from the Las Vegas Grand Prix, mostly related to personnel and marketing initiatives. Looking at 2023, we look forward to a record '23 rates calendar. As we've discussed before, flyaway races typically pay higher fees than the European races. And on Las Vegas, as previously communicated, we expect total revenue approaching $500 million. Looking at total rate specific economics, Vegas is projected to be in the top five of all races in year one in terms of total profit to the company. Hepatic (ph) building is progressing on schedule, and the concrete structure will be completed by the end of March. The majority of our CapEx spend will be incurred at the corporate level, primarily because year-round activations of hepatic building will be separate from Formula 1. We will not be providing a forward-looking allocation between F1 Opco and Formula One corporate CapEx, but you'll be able to see it in our historical numbers as they get reported. LBGP will pay rent and other fees out of Formula One Opco to the Formula One corporate for use of the building during the raise period, which will show up in our financial statements as revenue at the corporate level but will eliminate in consolidation. We'd expect grandstand and GA tickets as well as sponsorship revenue to be recognized in primary F1 revenue as rates promotion and sponsorship revenue, respectively. On cost recognition, we expect the vast majority of the rates related to costs also be recognized when the rate takes place as cost of F1 revenue. Finally, at the Braves Group at quarter end, they had attributed cash and liquid investments of $151 million, which excludes $22 million of restricted cash. And with that, I'll turn it over to Stefano to discuss Formula One. 2022 was a fantastic season on track, commercially with our partners and financially in our results. The new regulation meant that cars could raise more closely, and we saw some great results on the track. We welcomed more than 5.7 million fans to raise weekend, up 36% compared to 2019. We have 60.6 million total followers, up 23% from 2021 and saw significant growth in markets like the U.S. where social followers were up 42% versus 2021 to 4.5 million. Additionally, across f1.com and the F1 app, unit users were up 11% versus 2021 to 125 million. On viewership cumulative TV audiences for the 2022 season was 1.54 billion, an average viewership raise was 70 million. With our newer younger demographic, the digital share of F1 video minutes consumed grew from 16% in 2021 to 24% in 2022. As an endorsement of F1 growing global popularity, technological relevance and sustainability efforts, Ford announced the return to F1 from 2026 in a new partnership with Red Bull. Ford is a celebrated name in Motor Sport with a storied F1 history getting (ph) back into the '60s, and they are the third most successful engine manufacture in F1 history. We expect Ford involvement as a technical engine provider will bring value not only to Red Bull, but to the sport. F1 grew revenue across all primary sources: promotion, media right and advertising and sponsorship. In addition, our Paddock Club hospitality product performed especially well in 2022, its first full season of operations since the onset of the pandemic. In 2023, we are focused on optimizing the value of our Paddock Club by expanding the premium services we offer, continue to enhance the guest experience and adjusting pricing. On race promotion, we extended our  from 2024 and 2025, and the '23 Dutch Grand Prix is already sold out. The promoter has focused on sustainability from travel with 99% of general admission ticket holdage in 2022 arriving by public transportation, bike or on foot. We signed a number of large broadcast agreements throughout 2022, including renewing our partnership with Sky, a major European markets and with ESPN in the U.S. More recently, we entered into a multiyear media rights agreement with BeIN Sports to exclusively broadcast F1 in 10 territories across Asia. On sponsorship, just last week, we announced the addition of Qatar Airways as a global airline partner under multiyear agreement. Looking forward, there are a number of areas we continue to explore for additional sponsorship opportunity, including travel, financial services, food and beverage, telecommunication and more. The 2023 F1 is four (ph) qualified round is being held through May 25, and we hope to build on the strong engagement from last year when 1.3 million players attempted to qualify. The new license program, F1 RK (ph) launched its first location in London in December, hosting over 600 F1 guests and celebrities at the official launch party, who experienced the excitement on F1 with 60 full motion racing simulator. The second venue will open in Birmingham in the UK in the fourth quarter 2023, with additional locations planned to follow. Bahrain testing finished last week and with another year of improvements to the track, we are expecting even fiercest competition on the track. There will be new phases on the grid with Nyck Debris, Oscar Piastri and a promising young and American driver Logan Sargeant as well as the return of Nico Hulkenberg. And in spring, the world begins on resurfacing the track roads with digital plans in place to minimize disruption to the Las Vegas flow of traffic in the process. We have made a long-term investment in Las Vegas, which we expect to set us up to the race for day gets to come. F1 recently announced a global charity partnership with UNICEF to help bring quality education to the world's most vulnerable children, building on F1 long history of promoting STEM education worldwide. This series intend to maximize the potential of young female drivers to reach the highest level in motorsport, providing those currently in go-cart  with access to the fundamental experience needed before racing in F3 and working up to Formula One. Wrapping 2022 and looking to 2023, I think F1 is the strongest position it has ever been. This year, we launched a new brand campaign demonstrating F1 place in the sporting and entertainment world, giving new fans reason to actively engage with the 2023 season and keep coming back for more. F1 is an admissible and extraordinary spectacle and adrenaline field and intoxicating world of action, innovation and entertainment, both on and off the track. And to our listening audience, we appreciate your continued support of and interest in Liberty Media. Please proceed with your question. Greg, with the Braves has been about to get done and the recapitalization, the reattribution of Liberty Live. And you sort of talked about the rationalizing the structure of Liberty Sirius, I think. When you did Liberty entertainment many years ago, even before you talked about a combination with DIRECTV, you did a hot spin and then over time. And then for Stefano, you have, I think, 10 global sponsors. And if I could, one final , it looks like the logistic costs that is sort of paid by the teams, but that seems sort of elevated. So look, we have lots of things we could do, including a spin of Sirius (ph). And as we said, we look -- we're looking at those with renewed vigor, and we believe we're much better to execute on any of those post the Liberty Live reattribution and the brave spin. This logistic cost, its true last year it was a combined factor that we had to pay for that and included the team. And on that respect, there is also the other element that we are trying to be even more efficient in order to make sure that the things are done in the proper way. And on the other side, with regard to the partners, of course, we want to keep the exclusivity as a main value and we don't want to put on the other side, the final number of that. Please proceed with your question. Two -- sorry, one question. I guess, first for Greg or Stefano, whoever wants to take it or certainly both. It's pretty clear, and I think Stefano made this point last year that the value of the teams has significantly increased, especially from where you bought the business years ago. But I don't know if I have a clear idea of sort of how that benefits F1, the company and ultimately, shareholders. And in particular, given the word of asking the first conquered agreement question for 2026. So that's, I guess, the maybe more interesting question. And then I'm going to try, I know, Brian, you guys don't like to give guidance, but I just wanted to take another -- take a stab at the G&A commentary because we're getting a lot of questions on that this morning, $80 million Opco in Q4. So Stefano, I'm happy to take a cut and then or let you lead the other way. One of the things we are credit chase and credit Stefano, so it's easier for me to go first to let and give them the credit. One of the things that we at Formula One and with Liberty's Health have been trying to do is build a mentality that I'll credit the NFL for, which is one league that we benefit when everybody benefits. And yes, the teams compete very hard on Sunday, but on Monday, we need to think about growing the entire ecosystem. We've seen pretty good increases in our value, but we are here to play the long game. And doesn't mean we won't have disagreements with the teams about how much of the pie is, ours and how much the pie is theirs. And so I think we will have a strength in hand in the next  agreement, not a whip hand, but a hand saying, hey, look, we're here to grow the value and you're going to be benefit from it, and we want to see your team value grow dramatically. And we don't have to forget that not many years ago, the teams were suffering and we, as F1, were there, to support them financially. That's why we really believe that the more value we give to the team, the more value will go back to the system and to the entire business. And Ben, on the SG&A piece, I'll talk about it from the full year basis first. But you've seen an increase, obviously related to the Las Vegas Grand Prix that's $19 million. We also talked about the LTIP moving from stock compensation expense to a more like a personnel expense, that's in there now. You won't see that increase, so it's in the base. Please proceed with your question. To switch gears to sports teams and -- just wanted your kind of views, Greg, on what's behind the kind of vibrant activity we're seeing right now in acquisitions of sports teams in many sports at premium prices. I'm thinking of the talk around Manchester United, Milwaukee Bucks, Phoenix Suns, maybe Washington Commander, certainly Denver Broncos. I think that's certainly going to be true of the Atlanta Braves is true of them as a -- on their trading value, the longest continuously operating franchise in the United States, story and history of winning a storied history of economic success, hard to think of a more perfect franchise in many ways. There -- I think that's in the short term, at least, that's almost inevitable as some of these contracts are done. Having the largest cable household or a broadband household territory having a very large dedicated fan base, having a relatively modest RSN fee given the scale of those, that territory all anecdotal evidence, we know suggests that we have the most profitable RSN for the RSN owner and distributors. And there are a lot of other broadcast outlets, which would want to be involved with the Braves given the strength of all the things I started with. So the disruption is certainly there, the potential, but I feel very good about our relative (ph) position. Please proceed with your question. I think you said that roughly a third of the fan started following F1 over the last few years, and that certainly makes sense with looking at the attendance increases if there is. But maybe looking ahead, could you talk a little bit more about your confidence in converting the fans that have come into the sport, maybe because Drive to Survive or social media over the last few years into lifelong fans in the sport. Well, I'll comment, but I also want Stefano to add. Look, we are very focused on sustaining the growth and interest in F1 in many, many ways. That's with new innovations on the track, ensuring more competitive racing with new innovations on -- around the weekend like the Sprint races. Drive to Survive was obviously a key part, but not the only one. I think we're helping and the teams are helping create what will be a very exciting movie next year with Brad Pitt and the directors of Top Gun: Maverick and the  of Top Gun: Maverick, all of which we think will be another thing to sustain growth. While there are 16 and 17 year olds who are crazed and get up every Sunday morning to watch, there are many people who really do not follow Formula One. So we're not only thinking about things which are current, but we're thinking about things for the long term to try and sustain that interest, convert that interest into long-term fans. We talked about raising on the sporting side, on the technical side, on the financial side, these are elements of which we really are focused because we have shown in the short term that we've fund ideas to improve the respect of the race in itself. But if we have to add another dimension related to the fact that we are an entertainment platform that is growing, we are working on a new form of fan engagement with different social content, with a new way of connecting with media, but also we don't have to forget one thing that I would say is getting more and more relevant. When we are talking about our ideas to develop on the sustainability side of it, I think that all these new elements of discussion are elements that are tracking new people, new fans of Formula One. But as we've talked about before, with the '21 concord agreement as our profitability grows, we have increased leverage on those team payment counts. And as we pointed out before, there's some onetime items in SG&A. Please proceed with your question. A question on F1 operating expenses, in particular, I wondered if you would discuss puts and takes for OpEx as we move beyond 2023, given that 2023 OpEx includes some onetime costs for the O&O (ph) event in Vegas. It's obviously on the rise, and we all agree that the U.S. is going to see a wonderful benefit from Vegas. And as that happens, I wonder as you look at other professional sports leagues in the way they leverage their brands, what best practices outside of the core events are you looking at that you think you might be able to replicated F1. So I'll take the OpEx one, first. But as we pointed out, freight margins have been one of the biggest pressures on our other cost of revenue. Hospitality costs, as we just said, there's good margins. We've just given the revenue number and overall profitability, but you'll see OpEx increase associated with Vegas, as you would expect. No, I think that the global popularity as you said, is growing, and this is a fact. And -- but of course, we are quite humble in that approach because we want to learn from everyone around the world, what we can capture in order to increase let's say, our way of growing. If you think about gaming, if you think about the fact that the -- then the fans wants to attend to the race, if you see that fans wants to follow the count in our social media. And I think on that, we will work even hard to make sure that this voice is even stronger. Please proceed with your question. The ability to go negotiate and make something happen on a street circuit rather than an own circuit, made it easier in many ways, there wasn't a promoter, natural promoter. And we don't have to forget that in such a short time, we moved in a new dimension that has been the promoter in a way that no one was thinking before possible. And then, of course, I'm sure that this will -- an incredible push for all the promoter to see what is really -- what can be done better. We have a huge demand around the world to host Grand Prix, not only in the U.S. but also in Paris. But so far, let's make sure that we are totally focused on making Vegas super special there. So operator, I think we are done. We hope to speak with you next quarter, if not sooner."
}