{
    "symbol": "MIRM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 16:12:03",
    "content": " But we have historically used a surgical interruption of the enteropathic circulation of bile acids, which requires the formation of stoma an external bile drainage every day, which we do believe has helped approximately 50% of patients who have been treated in that way, but it is a fairly major surgery, and I believe, as a consequence many patients have not been off of that form of surgery because there's quite a high threshold to offer surgery then you have 50% chance of significant improvement. A number of clinically and biologically important secondary endpoints are shown on the right-hand side, in particular, similar changes in pruritus, we'll look for in the all rest of the PFIC cohort that's biologically improvements in serum bile acid as a marker of cholestasis. Slide 14 shows you the same data now for the other PFIC cohort and in parallel to the previous data, which are shown you for pruritus, these data are reflected in the serum bile acid changes, which were much greater in the really showed no change in the placebo group. On the left-hand side is the pruritus responses, and that is measuring improvements of greater than 1 point on the hetro scale and previously, and this is published data change of greater than 1 point has been associated with a clinically meaningful improvement in pruritus, as you can see, 26% of the placebo group responded and 64% of the treatment group responded, which is a very highly significant difference. And as you can see, there was a very small response in this parameter in the placebo group, but 52% of the all PFIC cohort met this change in serum bile acids, which we had previously, as I say, associated with long-term native liver survivors of  transplantation in retrospective surgical studies. I do think that we've seen much greater improvements in this study compared to the Phase II study that was undertaken some years ago with maralixibat, where the responder rate was less and the difference between the studies really is that I think we have now optimized the dosing and most of these patients ended up on a significantly greater dose of drug in the previous studies. From my point of view, I'm equally interested in the bile acids because I've shown you that I do believe because it is absolutely the heart of these diseases, it logically should transition into a reduction in the damage to the liver and the avoidance of long-term interventions such as transplant and that's as I say that what we're expecting to happen in our previous experience."
}