{
    "symbol": "MIRM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 22:40:22",
    "content": " This is driven by the Mirum team and the tremendous potential of LIVMARLI for patients, which was highlighted this year by data showing that in Alagille syndrome patients showing  with LIVMARLI, 88% of them remain event-free at 6 years. And as the results reported today demonstrate, our commercial team has been highly effective at driving the LIVMARLI launch further into the addressable market, and we remain confident in continued growth going forward, consistent with our guidance that 2023 LIVMARLI U.S. sales will grow by 50%. Looking forward to 2023, we expect to see continued demand growth and sales contribution from partner markets in Eastern Europe and the Middle East, as well as new partner markets coming online in Latin America and Asia, including Korea, where LIVMARLI was recently approved. At the end of last year, we presented groundbreaking Phase III data for LIVMARLI and PFIC, in which LIVMARLI drove a statistically significant reduction in pruritus and serum bile acids across the broadest genetic PFIC type study to-date, showing a magnitude of treatment effect, which is approximately double from previous studies and exceeded our expectations. And lastly, I'm really proud of our team's academic and collaborative efforts as well as our continued scientific leadership, which was showcased throughout 2022 through our congress presentations and a number of publications characterizing the benefits of LIVMARLI in pruritus and beyond, mirroring what we're hearing from the real-world experience. In addition to the continuing strong commercial growth for LIVMARLI adoption in Alagille syndrome, we have the potential PFIC label expansion and data readouts for our pipeline programs as we get further into the year. Your line is now open. Your line is now open. As we think about the sort of portfolio of readouts that you're coming throughout this year in Phase II, on what time horizon should we expect to get a little more clarity on what is and is not pivotal, just relative to when we're getting the data, I know there's a little bit of uncertainty around exactly what a pivotal endpoint might be, for example, in biliary atresia, et cetera. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}