{
    "symbol": "UAN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 15:19:06",
    "content": " The summarized financial highlights for the first quarter of 2022 include net sales of $223 million, net income of $94 million, EBITDA of $123 million, we repurchased approximately 112,000 CVR Partners common units for $12.4 million and the Board of Directors declared a first quarter distribution of $2.26 per common unit, which will be paid on May 23rd to unit holders of record at the close of the market on May 13th. 04:22 During the first quarter of 2022, we sold approximately 322,000 tons of UAN, at an average price of $496 per ton and approximately 40,000 tons of ammonia at an average price of $1,055 per ton. The first quarter of 2022, we reported net sales of $223 million and operating income of $104 million, compared to net sales of $61 million and an operating loss of $14 million in the first quarter of 2021. Direct operating expenses for the first quarter of 2022, were $60 million, compared to $37 million in the prior year period. Excluding inventory and turnaround impacts, direct operating expenses increased by approximately $17 million, primarily related to higher electricity and natural gas costs and higher share-based compensation, as a result of the increased unit price. Between the refinancing of the senior notes completed in June of 2021 and the $95 million reduction in debt outstanding, we have reduced our annual debt service costs by approximately $26 million per year, a reduction of over 40%. Consistent with this feedback the USDA's spring 2022 planting intentions report from last month estimated planted corn acres will be $89.5 million, down 4.1% from $93.4 million in 2021 and soybean acres are estimated at $91 million, up 4.3% from $87.2 million acres in 2021. 11:57 Product netbacks in the first quarter were higher by over $750 per ton for ammonia and over $330 per ton for UAN relative to the first quarter of 2021, reflecting the escalation and market prices it started in the fourth quarter."
}