{
    "symbol": "PBH",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-06 03:55:26",
    "content": " Thanks operator, and thank you to everyone who's joined today. On today's call, we'll review the second quarter fiscal 2023 results, discuss the full year outlook and then take questions from analysts. The slide presentation accompanying today's call can be accessed by visiting prestigeconsumerhealthcare.com, clicking on the Investors link and then on today's webcast and presentation. On today's call, management will make forward-looking statements around risks and uncertainties, which are detailed in a complete safe harbor disclosure on page two of the slide presentation, which accompanies the call. Business environment uncertainty remains high due to COVID-19, supply chain constraints, high inflation and various geopolitical factors, which have numerous potential impacts. We are encouraged by our second quarter results, which continued Q1's solid start to fiscal 2023 that we discussed back in August. This trend underpinned our ongoing brand-building, which generated Q2's record revenue performance and was the highest in company history for the second quarter in a row. The strong sales performance was led by our International segment and the Hydralyte brand, along with other areas of strength across numerous brands and categories. Solid sales continued to translate into strong profitability, generating $1.02 in diluted EPS and $55 million in free cash flow in Q2. Last, our consistent cash flow profile continues to enable our disciplined long-term capital allocation strategy. In Q2, we completed our previously authorized $50 million share repurchase program while still finishing the quarter with lower leverage at 3.7 times. So, in summary, more than halfway through the year, we are off to a solid start, building off of a record fiscal 2022, thanks to consistent execution of our time-tested business strategy. Now, let's turn to page six and discuss Dramamine, which is an excellent example of the long-term brand-building that's driven our results. Even for our brands that are synonymous with their category, like Dramamine, we look to leverage consumer insights to continue to meet ever-evolving healthcare needs and look for opportunities to grow the brand. Since acquiring the brand in 2011, we have expanded our leading number one market position via meaningful brand-building in innovation in order to deepen consumers' connection to the franchise. Our early success was driven in large part by expanding with new forms and flavors, launching products like less drowsy, non-drowsy and chewable offerings that help match consumer needs and increase usage occasions. Over the last five years, Dramamine grew sales about 10% annually, driving growth across both categories in winning with both consumers and retailers. The proven strategy and resulting growth enabled us to expand on our number one share in motion sickness and in recent months, became the number one market player in the nausea category as well. Now, let's turn to slide seven for an update on e-commerce. This growth rate, well in excess of our company average, is solid continued growth against difficult comparisons and in an environment where other non-healthcare categories have faced challenges. Our success is driven by a simple yet effective strategy of targeted content and marketing, effectively managing our product assortment and making broad investments across e-commerce partners to better connect with consumers. Shown on the lower right of the slide, Goody's headache powders utilize engaging digital marketing to help explain the benefits of fast pain relief to consumers. Meanwhile, a benefit of e-commerce is product assortment and availability, where consumers can typically find the widest assortment of products from their trusted brands. Shown on the upper right of the slide, you can see our DenTek content, where we have reminders around the broad assortment of offerings that can be used as part of a daily oral care routine. Last, we are making investments across all partners in e-commerce and brick-and-mortar, which positions us well for wherever consumers shop. So, in summary, we continue to win with consumers across e-commerce through our investments in online content and digital advertising and are well-positioned for further growth. As a reminder, the information in today's presentation includes certain non-GAAP information that is reconciled to the closest GAAP measure in our earnings release. Q2 revenue of $289.3 million increased 4.7% versus the prior year and increased 5.5%, excluding the effects of foreign currency. As a reminder, we continue to face lumpy comparisons in the prior year when we experienced higher sales as consumers' habits shifted, most notably in travel, with increased vaccination rates. Our International segment revenues of $37.2 million were up over 50% in Q2, excluding FX. As a reminder, we experienced these quarterly timing variations in orders and shipment patterns due to the distributor nature of our International business. EPS and EBITDA were flat and down slightly in Q2, respectively in the prior year with higher revenue largely offsetting the inflationary pressures and higher interest costs. For the first six months, fiscal 2023 revenues increased 2.2% versus the prior year on an organic basis. The performance drivers were largely similar to what we experienced in Q1 with the largest benefits coming from our International segment performance, as well as strength of Dramamine and robust cough and cold category growth. We also continue to experience double-digit year-over-year growth in the e-commerce channel, continuing the long-term trend of higher online purchase. The gross margin change was anticipated and attributable to cost increases, partially offset by pricing actions across our portfolio, which offset the dollar amount of inflationary cost headwinds. We continue to anticipate an approximate gross margin of 56% for fiscal 2023, including gross margins of just under 55% in Q3. Advertising and marketing came in at 14.8% for the first six months, approximately flat to the prior year on a percentage of sales basis. For fiscal 2023, we now anticipate an A&M rate closer to 13% of sales, reflecting spend at a lower percentage of sales in the second half, owing to the timing of certain initiatives and reduced spending around certain categories due to strong consumer demand. Finally, diluted EPS of $2.11 compared to $2.16 in the prior year down slightly as higher revenues were more than offset by the gross margin compression just discussed. For the remaining quarters, we still anticipate a tax rate of approximately 24%. In the first half, we generated $112.4 million in free cash flow, down versus the prior year due to the timing of working capital. At September 30, our net debt was approximately $1.4 billion, and we maintained our covenant defined leverage ratio of 3.7 times. Finally, during Q2, we completed the previously authorized $50 million share repurchase program, in total repurchasing approximately 900,000 shares in the first half. More than halfway through the year, we have solid business momentum, thanks to our proven business strategy and leading consumer health care portfolio. We are reaffirming our full year fiscal 2023 outlook, which anticipates solid growth even in the current supply chain and inflationary environment. For fiscal 2023, we continue to anticipate revenue growth of approximately 3% to 4%, including organic revenue growth of 2% to 3%, consistent with our long-term target. For Q3, EPS is expected to be between $1 and $1.02, a slight increase versus the prior year. Our disciplined pricing actions and cost management are helping to offset inflationary headwinds, while the benefits of our strong free cash flow continues to help offset the impact of higher interest rates. Lastly, we continue to anticipate free cash flow of $260 million or more. So, in summary, we remain confident we have the right business attributes and strategy to deliver results that reward our stakeholders across business environments. So, I guess, with the North American over-the-counter growth, you guys had minimal growth this quarter. When I look back, this quarter was the highest level of sales that we've ever had for our North American segment. Excluding FX rate, Canada's in there, the segment was actually up slightly year-over-year. So, I would say North America was really largely as we expected through the quarter. And at this point, we really aren't expecting any that would impact our business outside of what we talked about today. And I think I've mentioned this the last couple of these earnings calls is that it seems like, in our categories, everybody is looking for more inventory, whether it's the retailers, us or our suppliers, as we continue to really operate in a challenged supply chain environment these days. And I know that, that can be dangerous at times, and there are big disconnects perhaps between consumption and shipments, particularly in any given quarter. Our read, it looked like consumption was down mid single digits in measured channels in the quarter. So, we've been saying I think every single quarter since the beginning of time that it's tricky to look at that data, and there's a whole bunch of things that are excluded from that, including some of our fastest growing channels and geographies. I guess compiling on top of that in this lumpy period over the last couple of years, right, are all of the noise and movements around the COVID-impacted brand. Generally speaking, I think we expect consumption to approximate sales on a full year basis. It did grow in the double-digits in the second quarter, and that business is about 15% of our sales now. I think it was fiscal -- just a few years ago, 1%, right, climbed to 5%. And then, just trade inventory levels, Ron, you kind of mentioned this I think in the response to the first question. Again, we continue to operate in a challenging environment, even though the height COVID is behind us, and a lot of ways the supply chain is still catching up on that. So, in general, I think there's opportunity for improvement of in-stocks at retail and improvements in our service level. Jon, excuse me, I would say about half a beat timing related, but still strong -- very strong performance from the business, right, as you mentioned. So, at this point, pricing was about half of our growth in the second quarter. And again, we feel confident that we'll be able, on a dollar basis, to offset inflation should we continue to see the trends worsen."
}