{
    "symbol": "BABA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-24 11:44:04",
    "content": " Our December quarter net income declined by RMB 58.8 billion to RMB 19.2 billion, which was primarily driven by, firstly, RMB 25 billion in goodwill impairment related to our digital media and entertainment segment as previously mentioned; and secondly RMB 21.7 billion decrease in interest income -- investment income net to RMB 18.4 billion, primarily due to lower net gains from fair value changes of our equity investment. Customer management revenue, slightly declined by 1% primarily due to; firstly, slow moving condition -- a slowing market conditions and competition in the China e-commerce market that resulted in single-digit physical goods paid GMV growth for Taobao and Tmall, then by categories year-over-year, GMV growth in the FMCG and home furnishing categories were faster than overall average. Revenue of international commerce continued to exhibit strong growth of 18%, primarily driven by solid transaction growth by Lazada in Alibaba.com businesses. The slower year-over-year revenue growth compared to last quarter was mainly due to: first single-digit revenue growth of AliExpress, this was primarily due to a year-over-year decrease in number of orders for AliExpress as a result of the value-added tax levied on cross-border parcels below €22 in value in Europe, and second, significant depreciation of Turkish lira, against RMB that negatively impacted Trendyol's revenue. Adjusted EBITA loss widened by RMB1.5 billion to RMB3 billion, primarily attributable to the increase in Lazada's marketing and promotional spending for user acquisition and engagement, partially offset by steady profit growth of our international wholesale commerce business. Adjusted EBITA loss increased RMB0.7 billion to around RMB5 billion, primarily due to the increased losses of our to destination businesses including Amap, losses of our two home businesses including Ele.me slightly increased year-over-year, but narrowed quarter-over-quarter, driven by our disciplined user acquisition spending and reduced delivery costs. Revenue from Cainiao before inter-segment elimination grew 23% to RMB19.6 billion, which was primarily driven by the growth of fulfillment solutions and value-added services provided to our China commerce retail businesses as well as the increase in revenue from third-party merchants in our cross-border and international businesses. The solid 20% year-over-year growth reflected robust growth from financial and telecommunications industries, partially offset by the continuing impact of a top cloud customer's decision to stop using our overseas cloud services for its international business due to non-product-related requirements and slowing demand from customers in the Internet industry such as online entertainment and education."
}