{
    "symbol": "PFG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 14:10:24",
    "content": " Specialty Benefits premium and fees increased 10% compared to the first quarter of 2021, driven by record sales, strong retention and employment growth. The increase in deposits, strong sales and retention as well as a benefit from fewer dollars of withdrawals due to lower equity market performance, drove $3 billion of positive account value net cash flow in the first quarter for RIS-Fee. As of the first quarter and excluding significant variances, non-GAAP EPS increased 13% over the year-ago quarter, and ROE improved 50 basis points from the end of the year to 14.5% and is well on the way to 15%. Excluding significant variances, first quarter non-GAAP operating earnings of $478 million or $1.81 per diluted share increased 8% and 13%, respectively, compared to the first quarter of 2021. Impact to reported pretax operating earnings included a positive $3 million compared to fourth quarter 2021, a negative $4 million compared to first quarter 2021 and a positive $11 million on a trailing 12-month basis. Relative to the fourth quarter, PGI's margin and pretax operating earnings were pressured by expected expense seasonality and lower fee revenue, including a 4% decline in management fees as well as lower performance fees, which can be volatile quarter-to-quarter. At the end of the first quarter, we had $1.7 billion of excess and available capital, including $1.4 billion at the holding company, higher than our $800 million to cover 12 months of obligations, and approximately $325 million in our subsidiaries. We had, I think, a very across the board, strong net cash flow in the first quarter, both in some of the income-orientated investments that I highlighted earlier, along with real estate that we discussed a little bit earlier, along with some alpha generating equity strategies. At the end of the quarter, we're sitting at about $2.4 billion of assets in the program, and that was up a bit over the first quarter, and we continue to see opportunities to potentially grow that."
}