{
    "symbol": "VRNA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 12:47:12",
    "content": " Top line data from both ENHANCE trials will include the primary endpoint, improvement in lung function as measured by average force expiratory volume in one second or FEV1, area under the curve or AUC 0-12 hours post dose at week 12, as well as secondary endpoints comprising measurements of COPD symptoms and health-related quality of life, including ER-S and SGRQ endpoints, as well as overall safety data. We believe our cash and equivalents at March 31, 2022, expected cash receipts from the U.K., R&D tax credit program and funding expected to become available under the $30 million Silicon Valley Bank debt facility, will enable us to fund our planned operating expenses and capital expenditure requirements through at least the end of 2023. No, a great question and as you know we've been very focused on executing the COPD program over the past couple of years, and I think that’s served ensifentrine well and Verona well to have that focus, and it’s one of the things that we did when we joined the companies to make sure that that occurred, including raising the capital that was you know dedicated to executing the COPD program. I think one of the things that we've done with ensifentrine and Verona is really though the commercial build-out around our milestones and the first clinical milestone being positive data coming out of the ENHANCE-2 trial, and upon that that data will start to work toward building out the commercial organization and really starting to work around securing and discussions with payers to ensure that we have proper access. As a reminder, our near term milestones include completing enrollment in the Phase 3 ENHANCE program in the second quarter of 2022; reporting top line data from ENHANCE-2 in the third quarter of 2022 and from ENHANCE-1 around the end of the year; and a condition of on positive results, submitting an NDA to the U.S. FDA in the first half of 2023."
}