{
    "symbol": "VRNA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:04:03",
    "content": "  Operator: Welcome to Verona Pharma's, Third Quarter 2022 Financial Results and Operating Highlights Conference Call. Earlier this morning Verona Pharma issued a press release announcing its financial results for the three months ended September 30, 2022. Before we begin, I'd like to remind you that during today's call, statements about the company's future expectations, plans and prospects are forward-looking statements. These statements are neither promises nor guarantees and involve known and unknown risks, uncertainties and other important factors that may cause our actual results, performance or achievements to be materially different from our expectations, expressed or implied by the forward-looking statements. While the company may elect to update such forward-looking statements at some point in the future, it disclaims any obligations to do so, even if subsequent events cause its views to change. Thank you, and welcome everyone to today's call. With me today are Mark Hahn, our Chief Financial Officer; Dr. Kathy Rickard, our Chief Medical Officer; and Chris Martin, our Senior Vice President of Commercial. During the third quarter, we announced positive, top line results from our Phase 3 ENHANCE-2 clinical trials of nebulized ensifentrine for the maintenance treatment of COPD. We have significantly strengthened our financial position with access up to approximately $400 million, including our upsized $150 million equity operating in August and $150 million debt financing facility with Oxford Finance in October. We expect these funds to extend our cash runway through at least the end of 2025, supporting the ongoing pre-commercialization activities and the planned future commercial launch of ensifentrine in the United States. First, I'd like to take a step back and provide a brief overview of our Phase 3 ENHANCE clinical program. As a reminder, the ENHANCE-1 and ENHANCE-2 trials were each designed to enroll approximately 800 moderate-to-severe symptomatic COPD patients for a total of approximately 1600 subjects across sites, primarily in the United States and Europe. Subjects received ensifentrine or placebo as either monotherapy or added on to a single long-acting bronchodilator with approximately 50% of subjects receiving either a long-acting muscarinic antagonist or a LAMA, or a long-acting beta agonist or a LABA. Additionally, up to approximately 20% of subjects may receive inhaled corticosteroids with their concomitant LAMA or LABA. As previously announced, the ENHANCE-2 trial successfully met primary and secondary endpoints demonstrating statistically significant improvements in lung function. Importantly, ensifentrine demonstrated a 42% reduction in the rate of moderate and severe COPD exacerbations over the course of the study compared to those receiving placebo and recently reported subgroup analyses confirmed these positive effects in the overall population across all subgroups analyzed over 24 weeks. The top line data from ENHANCE-1 are expected to include the following: the primary endpoint improvement of lung function is measured by average force exploratory volume in one second for FEV1 area under the curve, zero to 12 hours post dose-at week-12. These secondary endpoint comprising measurements of COPD symptoms and health related quality of life including ERS and SGRQ endpoints as well as peak and trough FEV1, exacerbation data and finally overall safety results. Following our outstanding ENHANCE-2 data initial steps were taken in the third quarter with the addition of key leadership positions in commercial, HR, IT and finance. Today, over 380 million patients suffer from COPD worldwide, and it is the third leading cause of death. Despite the availability of existing COPD treatments, more than 1 million patients in the U.S. remain symptomatic on maximal therapy, highlighting the urgent need for novel medications to provide relief to these patients. We remain committed to our goal of delivering ensifentrine, a novel inhaled PDE3 and PDE4 inhibitor, and first-in-class product candidate for the maintenance treatment of COPD. For the three months ended September 30, 2022 the net loss after tax was $15.6 million compared to a net profit after tax of $11.1 million for the same period in 2021. This represents a loss of $0.03 per ordinary share or $0.24 per ADS for the quarter, compared to a profit of $0.02 per ordinary share or $0.16 per ADS in the third quarter of 2021. Research and development costs were $9.8 million for the three month ended September 30, 2022 compared to $22.6 million reported for the same period in 2021. Selling, general and administrative expenses were $5.3 million for the three months ended September 30, 2022 compared to $10.9 million reported for the same period in 2021. The UK R&D tax credit for the three months ended September 30, 2022 was $2.1 million compared to a credit of $4.7 million for the same period in 2021. And another question is for your European commercialization strategy long time ago, I think you guys said that EMA might require a comparator study. Well, we â\u0080\u0093 it's still a bit of a variable because there are visit windows, et cetera that happen. I think that with regard to the data readout, we're doing everything we can to have it as soon as possible. But at the same time we're transitioning across a holiday or two and patients visits, et cetera that come in through there. So we'll see how that goes, but our intention is to do everything we can to do that in the 2022 but we're not sure exactly where it will land. With that said with regard to European strategy, we purposefully have not, not with the EMA yet we intend to do so with the ENHANCE-1 and ENHANCE-2 data to meet with them, review the results and totality, and based on that discuss the plans forward there. As you know, we do have background therapy comparator within the context of ENHANCE-1, ENHANCE-2 and so I think we have variations of data. They may be interested in based on precedent, and so we'll be reviewing all that with them and understand a plan going forward. Thank you for taking my questions. Thanks so much for the question. And so with regard to ENHANCE-1, the studies of ENHANCE-1, ENHANCE-2 are designed essentially identical with regard to inclusion/exclusion criteria. And so at this time, there's no reason to believe there is any misalignment in results. With that said the study's still ongoing and of course we all look forward to the readout, but there's nothing. And just as a reminder, a nebulized ensifentrine will be primarily reimbursed through Medicare Part B as in boy versus Medicare Part D. Medicare Part D would be the second channel that ensifentrine would be reimbursed in the second most likely channel. And they've continually told us that ensifentrine's novel mechanism of action, the efficacy that we've seen with lung function improvement symptoms and exacerbation is an extremely appealing profile to them and something that they would feel like they need to cover to provide. So in that research, what we see is about 85 â\u0080\u0093 over 85% of lives will be covered with ensifentrine at launch or around launch based on that data. I think as we, as we continue moving to 2023, we'll continue to reach out and discuss more on an individual plan level to discuss how that that coverage will take place. Additionally, since ensifentrine is covered through Medicare Part B, we'll be working through that that channel and that that distribution strategy, which is through DME pharmacies to ensure that we're able to get ensifentrine to the patients at launch. Given the size of the opportunity for ensifentrine in, we believe the majority of the initial use will be driven by pulmonologists. I think of course, as we get ready for sales force, we're still internally prepping with marketing, market access, medical affairs so those individuals will come on again gated toward milestones. The first was being ENHANCE-2, second being ENHANCE-1 and so on. So we've structured the organization to grow as we achieve significant milestones within the community, within our process and development. Thank you for taking my questions. Thanks so much for the question. May be, I'll start in reverse order and maybe we'll take the manufacturing first and then I'll turn it over to Mark to talk about the agreement with Nuance. On the manufacturing CMC front, I think we're very well progressed from my perspective. So I think overall we're in a very good shape on the CMC and our planning, of course appropriately so at the right time to make sure we make the commercial batches, which is all tied to our validation strategy. And the way it's structured is that essentially while they're in development if there is a, an acquisition or a partnership opportunity that would include the U.S. or Europe, and that partner wants to have rights to China, then we can claw it back. I think you also asked about a timeline for a European partnership, and that's â\u0080\u0093 that's something we're working on. I think in line with Dave's comments about the EMA review, I think that would be an important element in the discussions that we would be having with any type of EU partner. So, firstly, I've seen some publications that highlighted that COPD patients with exacerbation exhibited increased serum levels of C-reactive protein also called CRP. Yes, we have looked at CRP actually for a long time in COPD and quite frankly, the results are not always consistent about whether they show us a different response or not. Ensifentrine we have looked at the initial data on CRP, we did measure it, and we do see a trend to decrease CRP, but again with the scientific data, there is no clear indication of how to interpret that data as of yet. Well first, I think, we just want to level set on that. But whether there is actually any real differences between, in this example smokers or non-smokers, for example, is not really where we're looking at conclusions based on the data. Yes, I think actually my takeaway is that we actually show a significant decrease in exacerbations no matter what group we look at, including smokers. So if you can reduce exacerbations by level of smokers, I think, that's a great result. And as Dave said, I don't think he can make a lot of comparisons between the groups, because it wasn't powered to do that. On the commercial front, I'm wondering if you've thought about commercial partners maybe to do some of the lifting, maybe a limited time engagement. For the questions, I mean, I'll take the latter one first. I think that we're still looking into it and of course, I think, we'll be additionally informed by ENHANCE-1 data as well. So I think that right now the discontinuation rates which happen in studies of duration and also tend to happen more in placebo groups, in studies where drugs are effective could be a contributing factor to the observation of the placebo group over time on patient reported outcomes. And then maybe Chris, if you want comment on our strategy commercially on partnering. And based on our market research, what we understand about the patient dynamics and the patient flow is those patients that remain symptomatic on either single, dual or triple therapy start to migrate out of primary care and move into pulmonology. In fact we believe there's about 12,000 to 13,000 physicians that we would need to target. So I'll give two examples here, one is YUPELRI, revefenacin, if we look at the data there there's about 70% of their TRX volume comes from about 1200 doctors. And then if I go to the opposite end of the spectrum, which is Trelegy, which has an asthma and COPD indication, which means it's moving more into primary care because of the asthma indication, there is only about 19,000 doctors that do 70% of that business. So again, we are very confident that a 100 reps going to about 12,000 to 13,000 physicians is an effective launch plan. Additionally, with COVID, we've found new ways to interact with physicians that can allow a smaller a biotech like Verona to be very effective in launch. So firstly, for ENHANCE-1 and ENHANCE-2 you mentioned, well, firstly you mentioned that your target patients are pulmonologists and the patients that migrate from the primary care because they are progressing on single, dual, triple therapy. For the follow-up, yes the Inflation Reduction Act, I think, quickly we have looked at it. So, we're looking at it from all different perspectives, getting outside inputs as well. And we're looking to see how that impacts ensifentrine, specifically around different formulations, different indications as you would expect. So, in the front end of evaluating that, then we'll continue to do so and have a, I think, a more formed opinion as we get into 2023 and its impact which, I think, still gives us plenty of time to understand the best strategy for moving forward with it. So, I think as far as patients being enrolled in the study and how many were symptomatic on dual or triple, I think, that is a complicated question to answer. I think what we have done is enrolled patients in the study who are either not on background or on a LAMA, LABA plus minus in ICS who are all symptomatic. So in a sense we have patients who are on single or dual, if you call ICS as the second product who are all symptomatic coming into the study. Well, Iâ\u0080\u0099m showing no further questions at this time. As a reminder, our near term milestones include reporting top line data from ENHANCE-1 around the end of 2022, and of course, conditional upon positive results submitting an NDA to the FDA in the first half of 2023. We are presenting at several upcoming investor conferences, including Stifel, Jefferies London, Piper Sandler, and we look forward to speaking with many of you then."
}