{
    "symbol": "CBT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-03 11:27:07",
    "content": " Thank you for standing by, and welcome to the Cabot’s Second Quarter 2022 Earnings Conference Call. Last night, we released results for our second quarter of fiscal year 2022, copies of which are posted in the Investor Relations section of our website. During this conference call, we will make Forward-Looking Statements about our expected future operational and financial performance. I will now turn the call over to Sean, who will discuss the second quarter highlights and provide an update on our progress in the areas of Battery Materials and ESG. I’m very pleased with the results in the second quarter, as we delivered record adjusted earnings per share of $1.69, which was up 22% compared to the same quarter last year. Demand across all businesses was strong and we continue to leverage our global scale, a differentiated portfolio and our strong track record of operational excellence. While geopolitical events, the persistence of COVID-19 and global supply chain disruptions presented execution challenges to industries globally, we demonstrated continued resilience across our operations driving strong earnings and discretionary free cash flow generation. Results across our businesses were very strong, with record performance in both the Reinforcement Materials and Performance Chemical segments, as we delivered volume growth, while mitigating the impacts of rising raw material and energy costs. And finally on the capital allocation front, we moved forward with strategic high-value growth investments, while continuing to return capital to shareholders through our robust dividend and share repurchases. I have talked quite a bit about Battery Materials over the last few quarters, as I believe it represents a transformational opportunity for Cabot. Over the past several years, we have been systematically building out the product portfolio, technical expertise, customer support and global footprint required by the leading lithium-ion battery producers. Cabot is the only global conductive carbon additive player that has the broad product range of conductive carbons, carbon nanotubes and carbon nanostructures, each of which offers different levels of connectivity and formulation flexibility for battery manufacturers. Our portfolio breadth and ability to formulate blends of conductive carbon additives, allows us to tailor the solution for our customers’ unique Battery chemistries. During our recent Investor Day, we outlined an investment plan that will triple capacity over the next three years across our Battery Materials portfolio. We have also commenced the debottleneck project to expand capacity at our carbon nanotube plant in Zhuhai, China and have begun the technology conversion of our newly acquired plant in Tianjin, to further add capacity for Battery Materials. This portfolio of projects is capital efficient, and we intend to execute these projects with speed to capture the market growth opportunity and meet the needs of our customers. Year-to-date, EBITDA in this business increased by approximately 80% compared to the prior year, driven by rapid market growth for electric vehicles and continued momentum with customer adoptions for our products. We believe there is tremendous potential to deliver greater perform from lithium-ion battery chemistries, through innovation and optimization of conductive carbon additive blends and we are seeing active engagement with our customers in this area. In the quarter, we achieved a key conductive carbon additive blend win with a top five battery manufacturer that will be utilizing a blend of our conductive carbons and carbon nanotubes. This customer win further supports our belief that blends of conductive carbon additives will play a key role in the future of battery innovation, as the formulations can be tailored to optimize both short range and long range conductivity. Given our strong momentum, we are tightened our EBITDA guidance range to $30 million to $35 million for fiscal year 2022. We reported record results in both reinforcement materials and performance chemicals with adjusted EPS in the second quarter of $1.69 up 22% compared to the second quarter of fiscal 2021, and up 31% sequentially. During the second quarter, EBIT for reinforcement materials increased by $12 million as compared to the same period in the prior year. Globally volumes were up 3% in the second quarter as compared to the same period of the prior year due to 6% growth in the Americas, 2% in Europe and 1% in Asia. Higher volumes in Europe and the Americas are largely due to volume gains and our customer agreements and our unique position in Mexico, which is enabling us to capture the strong volume growth in that country. Looking to the third quarter of fiscal 2022, we expect the reinforcement materials EBIT to improve sequentially due to our expectation that strong volume levels will continue with seasonally stronger growth. Now turning to performance chemicals, EBIT increased by $12 million in the second fiscal quarter, as compared to the same period in fiscal 2021. Year-over-year volumes in the second fiscal quarter increase by 1% in performance additives, and decreased by 17% in formulated solutions. As we look ahead to the third quarter, we expect a sequential volume increase led by growth in Battery Materials applications, and the benefit from our specialty compounds plant being fully back online. We anticipate that unit margins will remain strong, but we do not expect to see the same benefit from price increases ahead of raw materials in our Fumed Metal Oxide product line. Based on our second quarter results and the outlook across our businesses, we are raising our guidance for adjusted earnings per share to be in a range of $5.80 to $6.20 for the fiscal year. The upward revision represents a $0.30 increase at the midpoint, compared to our prior guidance, as we anticipate the strength of the first half of the year to continue with second half results, at a similar level to those in the first half of the fiscal year. To-date, our plants have continued to operate with limited impact in China and our local team has done an exceptional job navigating lockdown related supply chain disruptions. However, we are expecting some impact on the economy and our China volumes in Q3 from COVID driven lockdowns, which is included in our fiscal 2022 guidance. Margins are expected to remain strong in the second half, as we realize the full-year benefit from the calendar year 2022 Reinforcement Materials customer agreements and spot market pricing actions remain timely to address dynamic input costs. I continue to be very excited about the momentum across our growth factors, particularly in Battery Materials. So, certainly, the recent customer win we commented on will have impact in the back half of the year, and is embedded in the tightened guidance range for this business that we provided on the call here. Now, as you may recall from our Investor Day materials, we outlined our strategy here, for this business. We, we bring a broad portfolio of winning conductive carbon additives, and ability to formulate blends for optimal performance. And we have built a longstanding culture of operational excellence, and this application is a demanding one and I think our customers value that. So, certainly it is - let me start with the reality that it has been a very trying time for many of our European colleagues, who are impacted by this war and the Russian invasion in Ukraine and we are fortunate that all of our employees are safe and their families, and we have none that work in Russia or Ukraine. At the moment, we are seeing significant interest from customers and customers that we already serve, as well as some customers that we do not serve that are urgently looking for carbon black supply and I think that links directly to your comment, which is correct that the European market does import a significant amount of carbon black today from Russia and that has suffered significant disruption from the war in Ukraine. I think both in terms of sort of supply chain potential, for sanctions and perhaps, most importantly, I think customers just concerned about long-term reputational impacts of continuing to source from Russia. So our view here, as we go forward is we are trying to work with customers to help them in any way that we can, although, most of our capacity is contractually committed in Europe. We are working with customers to try to help them from the rest of our global network, including in Asia and China if the pricing and logistics make sense for customers here. And again, I think the uncertainty that customers have right now has caused many of our customers to reach out early to begin negotiations for 2023. And what we are hearing from customers is that they are concerned with the security supply, as well as the reputational risk of continuing to do business with Russian suppliers. And so we have begun negotiations, given the balanced supply demand conditions and I think the uncertainty around Russia, we feel very good about our prospects and the importance that is placed on the Cabot value proposition by customers here. So our team has done an exceptional job here, not only this quarter, but I think this has been a consistent narrative over the last year when we have had more dynamic input cost movements. I think first and foremost the products that we provide in specialty carbon is going to a range of applications, and the loading in those applications while it varies tends to be on the lower end yet the performance requirements in the application tends to be very high. Second, I would say is supply reliability, our network of plants, our operational reliability, the fact that we can serve customers all over the world and given the general tightness and the disruptions that are out there in the sort of macro environment. So given the performance and application aspect of this product line and the supply reliability, I think customers understanding of that we are needing to pass on these input costs and I would expect that to continue. This business, particularly in Reinforcement Materials tends to be make-in region, sell-in region business for a whole host of supply chain reasons. I think right now, given the stress that the industry is under because of the lack of Russian supply, customers are certainly reaching out and having to entertain a range of different options including importing from other parts of the world. But, we are working with customers to try to help them out from our network to the extent that the cost and the supply chain, the lead time makes sense. And then within Battery Materials, you seem to be growing fairly well organically and taking advantage of opportunities. But, I was wondering if there is other, I don’t know, small companies out there that might be a target I mean, because of the technology that they have or something they can offer just to kind of broaden our portfolio and if you are thinking about growing in that direction. Well, definitely very pleased with the performance here in Battery Materials. And as I said, I think our value proposition with customers in terms of conductive carbon additives is definitely resonating here and we think we are in a great spot because the market is growing and we are growing much faster than that market because of the value proposition. In fact, it was not long ago that we made an acquisition to buy a carbon nanotube player in China to do exactly that, to broaden our portfolio and support our growth strategy. And so, but I would say this is very much in scope, because I think this is a transformational opportunity here, as the whole industry shifts from ICEs to EVs. And as I think you know, we have a number of manufacturing sites, China, but we have one in Shanghai and thanks to the extraordinary performance of our staff there, we have been able to operate during the entirety of the Shanghai COVID lockdown. As we look forward though, we have adjusted down our forecasted Q3 China volumes and this is implied in the guidance range that we gave on the call here today. For exactly that, we do expect that there will be some impact to economic growth, and we expect that there will be some impact to our customers and then on our volumes. So, we have taken that down ranges by specific business, but we have taken down the Q3 expectation in the 5% to 15% range in China. So, to the extent that, European tire makers are relied on Russian carbon black, and to the extent they can - are able to I guess transition away from that, that carbon black presumably the Russians will still want to find a home for it and someone suggested that they will look to maybe China as an end-market. I’m just curious if there is any evidence of a much Russian carbon black finding its way into the Chinese market currently, it seems like that also would be somewhat logistically challenged and not necessarily cost competitive with established and operations in China and including yours obviously, which is probably produce much more in a sustainable manner than the carbon black that is produced in Russia. But I think at this point, customers are I think rightly earned about long-term supply reliability. And I think the reputational impacts of sourcing, even if you can, the reputational impacts are becoming more pronounced certainly for the global tire customers. So, now, they are going to need carbon black, and so how the rest of the world kind of adjusts course here to flow some carbon black to meet their needs and is - I mean that will, that will happen likely yet much higher costs landing carbon black from a place like China, which is where some excess would be available, trying to land that into Europe is pretty expensive. So I think it is a tough proposition from an economic standpoint, but there will be some flows that will have to happen and we are working with our customers to try to help them from our global network. I don’t think we have seen any evidence that it is flowing into China and that would really surprise me, my own personal perspective. I think China, has its own material to support its own supply chain and I don’t think that would happen. If I could just sneak in one more about the Battery Materials business, currently the lithium-ion battery industry is sort of Asia, really China centric, and even you or assets are there, but if you look at the bigger picture and the pipeline of gigafactories globally, there is a tremendous ramp of gigafactories under design in both Europe and North America. We produce battery material grades in Europe today, and would expand and broaden the product portfolio as those plants come online. And as a result, you are seeing us outpace the market by a significant margin in terms of growth and I think it is because of that. And I think there is a few things I would just underscore, one is the portfolio of products that we have the broad range of conductive carbon additives, and the ability to formulate blends. I think our view on this one is right, and there is evidence that that is the way this industry will go over the longer-term. And then finally, it is one thing to develop the product that works and build the capacity, but the culture around operational excellence, this is a demanding application, but we have a lot of experience in demanding applications like this from CMP back some years ago selling directly to fab - chip producers, a very demanding application, Inkjet is a very demanding application. So, I think all those things are coming to light for customers and it is part of what is driving our significant outperformance in growth relative to the market. As I said at the end of my prepared comments, very pleased with our performance in the quarter here, both at the operational sort of execution level, but also on the strategic front."
}