{
    "symbol": "CBT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-08 14:27:03",
    "content": " In fiscal 2022, volumes grew 58%, revenue increased 74% to $132 million and EBITDA grew 81% in the year to $29 million. During the fourth quarter and full year of fiscal 2022, EBIT for Reinforcement Materials increased by $42 million and $79 million, respectively, as compared to the same period in the prior year. Looking to the first quarter of fiscal 2023, we expect a sequential decrease in EBIT due to lower energy prices impacting our energy center revenue, lower volumes from normal year-end seasonality and downtime at a North American plant that will impact both volume and fixed costs. Looking ahead to the first quarter of fiscal 2023, we expect a sequential volume decline of approximately $10 million to $15 million as the economic slowdown in Europe and customer destocking is expected to unfavorably impact demand in this segment. We expect the year-over-year EBIT results in the first quarter of fiscal 2023 will be lower than the first quarter of fiscal 2022, given demand softness and inventory destocking and our intention to also reduce inventory levels. In Performance Chemicals, excluding Battery Materials and inkjet, volumes are expected to be impacted by customer destocking and economic softness in Europe and China, predominantly in the first half of the year, with volumes returning to a more normalized level in the second half of the fiscal year. As we look at our margin expectations, we achieved strong pricing gains in our calendar year 2023 Reinforcement Materials customer agreements, driving an expected bottom line improvement in EBIT of approximately $20 million per quarter starting in Q2. As we think about the quarterly shape of earnings, the first quarter results are expected to be down year-over-year and accelerate as we move through the year with the expectation that the second half of the fiscal year will deliver higher year-over-year adjusted EPS. Adjusted earnings per share grew 25% year-over-year and we generated $395 million of discretionary free cash flow in fiscal 2022, putting us in a strong position to achieve our 3-year target of greater than $1 billion."
}