{
    "symbol": "CBT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-01 12:35:23",
    "content": " Last night, we released results for our first quarter of fiscal year 2022, copies of which are posted in the Investor Relations section of our website. During this conference call, we will make forward-looking statements about our expected future operational and financial performance. Additional information regarding these factors, appears in the press release we issued last night, and in our 10-K for the fiscal year ended September 30, 2021. In order to provide greater transparency regarding our operating performance, we refer to certain non - GAAP financial measures that involve adjustments to GAAP results. I will now turn the call over to Sean, who will discuss the first quarter highlights, provide an update on our strategy and then discuss our progress in the areas of Battery Materials and ESG. I'm very pleased with results in the first quarter as we delivered adjusted earnings per share of $1.29, which is up 9% compared to the same quarter last year. Performance across our businesses was strong, and I'm very proud of our execution discipline across all facets of the Company. Additionally, our discretionary free cash flow during the quarter was robust and this is important in the repurchase of shares and an increase to the dividend of 6%. We recently concluded our calendar year 2022, Reinforcement Materials, customer agreements, and are very pleased with the outcomes having achieved substantial price increases in all regions. As we shared during Investor Day, the market environment remains supportive and Cabot's value proposition of supplier reliability, quality, and global reach continues to resonate with customers. During the quarter, we also continued to build momentum in Battery Materials and we advanced a number of ESG priorities. I will elaborate on both of these fronts, but before I do, I think it's important to connect our priorities to our strategy. And we will deliver on this strategy by advancing three key pillars; driving advantaged growth, delivering innovative chemistry to enable a better future, and relentlessly pursuing continuous improvement in everything that we do. As a result, our targets call for strong growth of adjusted earnings per share and robust discretionary free cash flow to fund growth and return capital to shareholders. Of our many compelling growth options, we are particularly excited about the momentum we are building in Battery Materials. As one of our key growth vectors along with Inkjet and E-2C, Battery Materials, is a key part of our creating for tomorrow strategy, and is expected to be a major driver of our growth and reshaping the valuation of the company. The market size for conductive carbon additives in lithium-ion batteries is expected to be approximately $2 billion by 2025, with 30% plus growth expected through 2030. Cabot is very well-positioned given the breadth of our conductive carbon additive portfolio, our global footprint of assets, and our strong local commercial and technical support. The Cabot value proposition is resonating strongly with leading customers, as evidenced by our success in selling to six of the top eight battery producers which represent approximately 90% of the market. During the first quarter, volumes increased 58% year-over-year and we were recently qualified in a new EV platform with the top five battery manufacturer, with sales expected to start in fiscal Q3. Given the strong demand outlook, we advanced important capacity projects in the quarter, including the announced acquisition of a plant in Tianjin, China. Also, we are on schedule to start up our new specialty carbons plant and Xuzhou, China, which is expected to free up additional Battery Material capacity in other parts of our network. Given the strong momentum, we expect our fiscal year 2022, full year EBITDA to be in the range of $25 million to $35 million. For many years, we have focused on reducing our environmental impact and our net zero ambition is a natural progression in our sustainability journey. First, we were recognized by Newsweek as one of America's most responsible companies. Bringing the power of innovative chemistry to solve our customers sustainability challenges, and reduce our impact is what motivates us and it's essential to our purpose. We reported another strong quarter with adjusted EPS for the first quarter of a $1.29, up 9% compared to the first quarter of fiscal 2021 and up 16% sequentially with better-than-expected results in both the Reinforcement Materials and Performance Chemicals segments. This is an increase from our range last quarter, largely due to higher growth investments expected for Battery Materials in relation to the acquisition and conversion of the new plant in Tianjin, China. During the first quarter, even for Reinforcement Materials decreased by $3 million as compared to the same period in the prior year. Globally, volumes were up 4% in the first quarter as compared to the same period of the prior year. Due to 13% growth in Asia, flat volumes in the America and a 10% decrease in Europe. Looking to the second quarter of fiscal 2022, we expect a Reinforcement Materials EBIT to improve due to the outcome of our calendar year 2022, customer agreements. We expect volumes will remain solid with sequential improvement expected in Europe and the Americas, and the normal seasonal pattern in China, related to the Lunar New Year. Now, turning to Performance Chemicals, EBIT decreased by $2 million in the first fiscal quarter as compared to the same period in fiscal 2021 primarily due to lower volumes. While overall segment volume declined, we delivered impressive volume growth of 58%, as Sean noted, in products sold to Battery Materials application as we continue to see growth driven by higher EV demand. Partially offsetting , we delivered higher unit margins from favorable product mix in both our specialty carbons and fumed metal oxide product lines and strong pricing in our fumed metal oxide product line. Looking ahead to the second quarter of fiscal 2022, we expect a step up in sequential volumes as our specialty compounds and fumed metal oxide plants come back online. As we talked about at Investor Day in December, we're making capital allocation decisions that aligned with and support our Creating for Tomorrow strategy. In addition to these growth investments, we are also focused on providing an attractive return of cash to shareholders. Based on our first quarter results and the outlook across our businesses, we are raising our guidance for adjusted earnings per share to be in the range of $5.50 to $5.90 for the fiscal year. As I mentioned earlier, we're very pleased with the outcome of our calendar year 2022. Reinforcement Materials customer agreements, and expect to see a corresponding step-up in earnings starting in the second quarter. We're also seeing strength across our Performance Chemicals segment with strong volumes, robust margins, and product mix, and disciplined pricing execution. Additionally, our new specialty carbons plant is expected to come online in the second half of fiscal 2022. The long-term fundamentals of our businesses are strong, our end markets remain robust and we continue to execute at a high level. Looking ahead, we believe we have a winning formula, a talented team, an excellent portfolio of businesses set for growth, and a strong balance sheet, all of which position us to deliver on our strategic objectives and continue to grow and lead in our industry. Your line is open. In terms of Reinforcement Materials, I think you are asking about higher margins and the quantification. The increase in margins was $5 million year-over-year in the quarter and as we do each quarter when we forecast, we use the forward-curve of oil. So across Reinforcement Materials, given their resilience of the replacement tire market, as well as some real strength in the OTR, off the road market. But there's real strength across these applications due to a combination of factors and infrastructure related applications continue to grow very nicely and an emerging applications like batteries, given the growth in EV, continues to be quite strong. In terms of restocking, I think in general inventory levels to remain pretty tight across most value chain. First question for Sean, I was hoping you could flesh out a bit more what's driving the higher EPS outlook. Obviously, the first quarter was ahead but it looks like the remaining three quarters are now expected to be incrementally better than you thought a few months ago. Yeah, so demand remains quite robust, Mike, but overall it's really strong execution on pricing and so, let me try to give you a bit of color there. So, in Reinforcement Materials we realized better than expected outcomes for the 2022 tire customer agreements and so that definitely contributed to the raise in outlook for that business. And then in Performance Chemicals, while input factors are rising pretty much everywhere and the chemical industry is having to address that like everyone else. And so sometimes in a period of rising inputs, we may be chasing it a little bit but the team has really done a fantastic job and executing really well. And then finally, I'd say continued confidence in how the businesses are performing in terms of our growth vectors, in particular, Battery Materials. And then second question for Erica, maybe two quick things on cash flow this quarter. First, working capital was a $143 million use of cash. And second, I think if I look at the press release, the change in other assets line was a $36 million use of operating cash and the other financing line was $27 million use of cash. The first question which is the working capital, it is mainly the higher oil prices. We will see higher receivables, balances at the higher pricing in the Reinforcement Materials contract flows through in Q2. And then in terms of the cash flow, in terms of those other operating items, I'd say the only thing notable items flowing through there are, impacts from -- as we're restoring our plant in Belgium, there are impacts in there in terms of repairing of the site and then the insurance proceeds that come through that are pretty -- should pretty much offset that over time. Your line is open. Hi, thanks for taking my question and congrats on a really strong quarter and outlook. Given you guys have a leading position there, there's definitely increased focus around what's going on in China, demand and COVID impacts, etc. So, first in terms of China, what we saw in the quarter was quite strong performance. And so in Reinforcement Materials across Asia - Pac, volumes were up -- were up strongly, and our perform -- and China as a be a big piece of that. And I think that that continued to show through in the quarter were plans ran well and while the situation at this time is dynamic, we're well able to manage that. I think the government there has recently adopted some new policies related to this power shortage issue that was well discussed in the early fall, autumn period. So, there were some issues related to policies there that I think have improved the situation, and so we don't we don't expect any material disruption going forward. The government is also in an effort to balance economic growth along with their other priorities has been, looking to stimulate the economy in certain ways, reducing interest rates, accelerating suspending, infrastructure, and some of these areas that are helpful. I think they're sort of keenly focused on trying to, trying to balance this. Now, on the -- on the COVID front, they've definitely managed in terms of at least reported cases to a much lower level than anywhere else in the world and have had this zero-COVID policy. I think ultimately sustaining that policy will probably prove to be challenging but on balance, I actually consider it to be positive as it relates to our businesses because when there are COVID outbreaks, they tend to take fairly draconian actions which can cause disruptions. And I think if it, over time, transitions to more of a management -- managing COVID approach, then there probably will be a little more stability and that -- that will -- on balance be I think a good thing. We're definitely have been impacted in the first quarter with some plant related impacts, where we're pleased that this quarter, the Belgian masterbatch plant will be coming back online. I think the best way to think about, first of all, it's a diverse portfolio across Performance Chemicals of applications but on balance, these grow at somewhere one-and-a-half to two times GDP and may cause differences by application. The best example there, of course, there are efforts in batteries where we're expecting to grow at a very high rate above the market growth rate for that business. We feel, we feel pretty good about -- about the volume -- the volume outlook in this business, and as we bring on some new capacity later in the year. Particularly around specialty carbons, that will continue to support the volume growth, both for our legacy, especially carbons applications, but also, we'll have some capacity support for batteries. Now, as we have shared during our Investor Day, and we have expectations to outpace that and so over the next three years, we are expecting to grow this business at 50 plus percent. And that's purely a function of the Cabot value proposition here in terms of the breadth of our conductive carbon additives portfolio, our global footprint of assets, and the fact that we've got application technology labs and technical and commercial teams all over the world. That'll one lock some capacity elsewhere in our network to support batteries and then the Tianjin announcement that we just made, where we'll convert an upgrade that facility will provide, then further runway for these high-value conductive carbons. So, if you think about over the next three years, there's somewhere on the order of a $100 million of CapEx that we'll be spending across the conductive carbon whack and carbon nanotube footprint to build capacity to keep fueling this growth here. Again, we're -- I think it holds great promise and we're certainly determined at our efforts here. It hasn't had a material impact on us and as I said, I think there were some actions taken by China a few months ago that have eased some of the power shortages there. So, I think that's good in the short-term and China will obviously have to continue to balance how it supports economic growth and how it transitions to continue to reduce the environmental impact. But in terms of Cabot's operations, we've not had any material impact. And I think it's again, as a function of all of the things that we've built over the years and why we're a great operator there. Certainly, a lot of experience in our 30 + years, really strong joint venture partners where together, we can manage through these things and our -- the way we operate, run our plants, the level of environmental performance that we deliver, I think is appreciated by the Chinese regulatory authorities. Your line is open. So Chris, just as a recap, I think a few things driving the upward revision on guidance, certainly the outcomes from the entire customer agreements and I'll comment on that a bit more but also I think really strong execution on pricing and Performance Chemicals and really real time we've passed through there. And then third, the continued momentum in these growth vectors of Battery Materials, but also Inkjets. Now, the net impact of all of this, probably the best way to think about it is maybe somewhere in the order of $15 million per quarter net of rising costs around the world. So these contract outcomes included factors like cost-based prices but also factors to recover rising costs like higher natural gas costs or in certain parts of the world, if there are CO2 costs, we've been able to negotiate the recovery of those. So important to understand that point, but net of those rising costs which were recovered, the net impact is somewhere in that 15 million per quarter range, is probably the best way to think about it. That's helpful, then you alluded to the follow-up, but just the spike in gas and energy prices in Europe, were you simply able to mitigate that through DTA or other actions, or was there converse, I guess any benefit from your energy's center Cogen operations from what's going on over there. So certainly as energy prices are higher than that, benefits in terms of the Energy Center contributions for sure. Then as energy prices are higher then, some of the technology and yields we're -- that we do is more valuable. With respect to higher natural gas costs, certainly they've shot up in Europe, but we've been able to largely offset that through combination of DCA adjustment, flow - throughs. And on the more spot side of the business, whether it's in reinforcement or in specialty carbons through spot market actions. So in the Battery Materials business you've talked about that market growing and I get it, 30% to 35% a year through the decade you guys outperforming that. So how do you gauge that out-performance, sir is it on a -- are you -- do you have visibility on a customer-by-customer basis from the specifications where you get qualified that you're getting an outsized benefit from relative to the market growth or any way to, just comment on how you're validating that out performance relative to the market. So one is certainly our volume growth, and that's a backward-looking indicator. But in the quarter, our volumes in this business grew at 58%, so certainly that's well above the market growth, and an indicator of our strong performance here. And so that's something that is always a little bit of a moving target, but our participation is pretty broad."
}