{
    "symbol": "DOV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 12:40:27",
    "content": " Expected revenue growth price actions and productivity measures from 2022 lay the foundation for margin accretion in 2023 have high confidence in Dover's end markets, flexible business model and proven execution playbook continuing to deliver earnings growth. First to remind everyone that in 2021 bookings of $9.4 billion driven by post-COVID demand surge, as well as constrained supply chains the required customers drew order in advance were roughly 20% higher than our revenue that year resulting in an unprecedented backlog that requires time to ship and unwind while bookings normalize. I think to get to that level of backlog at the end of the year looks like it's roughly I don't know, like a $2 billion backlog assuming a mid-single digit growth rate, which would imply roughly 6 billion of orders. So I think if we're going to -- I think that we may have a little bit more difficult H1, but I think that we've got a better and even chance to have a better-than-expected performance in the second half of the year. So let's not the card before the horse, but we're going to basically do what we did back in 2019 and try to give you a 3-year forward role by segment and what we think the contributing factors to it. I mean if you look at our growth rate in Europe, I don't think anybody would have modeled that considering kind of the overall caution about Europe in total, but frankly, a lot of what we do out of our production base in Europe gets -- we recognize the revenue in Europe, but it may end up around the world at the end of the day. I don't -- I think that Europe, any kind of let's call it destocking would have happened during this past year because they were on the front end of the curve. I think that our comment that we made on that particular business is that the margins are quite robust, and it's all about what kind of revenue growth we can get from here. But I wondered just sort of thinking ahead, is there maybe the appetite to drive -- make sure that 2024, let's say, has stronger margin expansion and that might require more restructuring this year. Well, Julian, I mean, I think to the extent that we have flat margins despite the fact that our biopharma business, which is clearly our most profitable portion of the portfolio being down, one could argue that once we get to the strong -- we get through this destocking period, which we expect to be an H1 2023 event is that inflect back to the positive that the incremental margins that we're going to see there."
}