{
    "symbol": "TUYA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-30 10:30:25",
    "content": " Thank you for standing by, and welcome to Tuya Inc. Second Quarter 2022 Earnings Conference Call. Hello, everyone, and thank you for joining us on our second quarter 2022 earnings call. In the second quarter, our total revenue was $62.5 million, in line with the midpoint of our previous guidance range. However, on a year-over-year basis, we recorded a 26.1% revenue decline as we lapped a period of robust growth across the IoT industry in 2021. In particular, our IoT PaaS business revenue increased to $47.6 million, up 13.9% sequentially but down significantly year-over-year. During the second quarter, global inflation continued to rise while the Russian, Ukrainian conflict regional triggering the tsunami dramatically impacted the world economy. High inflation impacts the economy, the industrial value chain and consumers' wallets, changing people's lifestyles and consumption habits. Meanwhile, we note that the downstream players in the IoT device industrial chain, including IoT device brands, OEMs and the distribution channels faced massive inventory pressure from supply mismatches, which are expected to take longer to fix. As a result, our IoT PaaS business, DBNER as of the end of the second quarter declined to 84%. However, our other core business, the 2B focused SaaS and other segments remained strong for the sixth consecutive quarter since we completed our public listing with revenue reaching $7.2 million, up 114.3% year-over-year. Our SaaS and other segment has sustained the year-over-year growth rate of over 110% for 10 consecutive quarters, despite the recent turbulence in the global economy. Our IoT PaaS gross margin was 42.5%, representing a slight improvement over the same period last year and remained at a healthy level despite the headwinds. Since the beginning of the second quarter, we have implemented several operational and business optimizations, as well as product and technology iterations, I will share some highlights here. For example, we added a Fortune 5 German business group whose DIY retail channel private label shipments cover a wide range of segments such as electrical, lighting, outdoor and small appliances. The number of our IoT PaaS premium customers, mainly the existing customers was 267 in the second quarter, down from 285 in the same period last year. This resulted in certain customers reducing their orders, thus falling below the premium customer revenue contribution threshold, which is $100,000 in the last 12 months. However, we also have new customers qualified, including the top brand from North America that we announced in the fourth quarter last year, whose primary business is outdoor travel. During the first half of 2022, our commercial lighting and property SaaS achieved a year-over-year growth of around 100% in the number of new brand owners acquired, new customer projects served and a new device interfaced. Going forward, carbon accounting, theoretical energy consumption analysis, events hub and other similar functions will be in our products and the business key development direction. In the second quarter, we developed a baseline version of our domestic hotel SaaS that integrates voice and central control. On the foundation of the baseline version, we expanded our business to the new digital commercial circuit vertical and optimize our products with more cost-effective features such as room monitoring, e-gaming hotel and advanced construction. Looking ahead, we will focus on industrial leading service providers and hotel groups, improve our product offerings, expand model use cases and continue penetrating the industry leaders. However, by leveraging our solid software products and hardware device ecosystem, the intellectualization projects being implemented by various through  group customers that signed contracts with us before maintained smooth operations. One of our new customers, like  Group is a large enterprise specializing in the production of high- and low-voltage electric control  has been a long-term material supplier and a high-quality partner of large-scale industrial enterprises. utilized our industry equipment management system to monitor and collect equipment operation data such as temperature, current and the voltage of power distribution equipment in order to assess electrical stability and safety and receive timely malfunction warnings. We also help  develop the power distribution energy efficiency management platform that can analyze the power distribution equipment's current, voltage, power factors, active energy and other operating parameters. Based on the analysis, the joint developed platform established a distribution, energy efficient model to conduct statistical analysis of the electricity consumption for various purposes to improve the electrical parameters, in fact, saving 60% to 15% of electricity. Recently, when serving customers in factories and industrial pubs,  also developed the need for managing new energy sources such as photovoltaic in addition to utility power management. For example, our OEM app and value-added services such as the app function enhancement and related services as well as voice capability generation and services grew more than 100% or even higher year-over-year. In addition, services such as IoT certification and the cloud development framework product have also delivered solid performance. Such results indicate that in the current macro environment, customers and brands are still investing and are confident in the smart business. As of the second quarter, we have acquired exemplary private cloud customers such as a prominent Chinese integrated industrial investment group and multinational electrical, electronics and automotive brand headquartered in Southeast Asia with one of the world's most extensive manufacturing and R&D facilities. As we expand our customer base, we see tremendous business opportunities from these industrial customers in their pursuit of smart solutions, and we will strive to convert them to our customers. As one of our core long-term strategies, Cube smart private cloud unwinds a series of product technology upgrades in the second quarter. We also packaged the  business into the SDK of the Cube app, which significantly accelerated the customer's new app development process. We completed the independent operation and maintenance system, which fully covers the IoT infrastructure, meet operations and business operations under the Cube solution, enabling the technical staff to better understand Cube's operations to quickly locate and solve problems. Lastly, it is worth noting that on July 12, ioXt along with  authoritative experts released the 2022 global IoT security white paper, in which Tuya was nominated as the best security practice in the IoT industry. Overall, the severe challenges throughout the quarter are persisting, and we do not expect the economic downturn, high global inflation, supply chain inventory and other issues to improve soon. As Jerry just mentioned, we continue to face a series of unprecedented challenges, specifically global inflation, COVID resurgence in Mainland China caused significant business disruption and inconvenience and the macroeconomic headwinds further exhibited downstream inventory backlog issues. Despite the challenges, we continue to focus on executing our efficiency improvement strategies towards our goal of prioritizing profitability and leverage our competitiveness to explore new long-term opportunities in the IoT industry. For the second quarter of 2022, our total revenue was $62.5 million, within our previous guidance range and down 26.1% year-over-year. The decline was driven by a 38.1% year-over-year decrease in our IoT PaaS revenue, which was down to $47.6 million for the quarter. Based on our own estimate glean from downstream and the consumer discretionary industry sources, broad-based demand declined in a consistent trend with our revenue decline. The smart consumer electronics sector is subject to fast-changing short-term demand, which is thus more susceptible to a slower economy versus other sectors, such as industrial, agriculture, automobile and new energy, in which companies, especially those with large scale or in the electrical vehicle sector are more resistant to short-term downside risk. Total gross margin and IoT PaaS gross margin for the quarter were stable at 42.8% and 42.5%, respectively, as we effectively implemented a series of business management and efficiency improvement initiatives. During the quarter, non-GAAP total operating expenses decreased by 21.1% to $49.1 million from $62.2 million in the same quarter of 2021. Specifically, non-GAAP R&D, sales and marketing and G&A expenses decreased to $33.8 million, USD13.2 million and USD5.3 million, respectively, and other operating income net was $3.2 million. The significant improvement in the non-GAAP operating expenses was mainly due to the large decrease in the basic employee-related costs, such as payroll and benefits, partially offset by one-off additional costs arising from, for example, headcount optimization and restoration and indemnification related to rental termination. We optimized operations during the quarter, especially with 2 major initiatives to improve our technology research and the development efficiency. First, we established an R&D Project Review Committee to carefully reevaluate each of our R&D projects and develop an itemized evaluation system to conduct value management on the aspect of internal efficiency improvement, key and the core capability construction and opportunities and the revenue generation. We also launched a system function to collect services fees to recover the internal time costs incurring in executing less cost-effective, many others, so as to promote order bundling and improve customer service efficiencies. Our non-GAAP loss from operations narrowed by 15.9% to $22.3 million in the quarter from $26.5 million in the same period of 2021, and our non-GAAP net loss narrowed by 19.1% to $18.7 million in the quarter from $23.1 million in the same period of 2021. Our non-GAAP operating margin and non-GAAP net margin in the quarter were negative 35.6% and negative 29.9% compared to negative 31.3% and negative 27.3% in the same period of 2021, respectively. Our non-GAAP operating margin and non-GAAP net margin for the quarter would improve to negative 31.2% and negative 22.7%, respectively, after a sequential decrease during last 3 quarters. Our operating cash flow, excluding the cash received from ADS sharing program has improved greatly to an outflow of $1.5 million in this quarter compared to the outflow of $7.2 million, $46.1 million, USD53.2 million and USD57.4 million for each quarter since last Q2 to this Q1. During the second quarter, we repurchased approximately 11.2 million ADS on the open market at a cost of approximately $30.0 million. We have totally bought back 23.1 million of ADS with total cost of USD109 million, which represents our commitment to shareholders and the market and shows our high confidence in Tuya's long-term growth prospects. Before I close, I would like to emphasize that the global consumer discretionary industry and the consumer spending are expected to be challenging in the second half, due to softening economy conditions, high global inflation, the downstream inventory glut and a greater competition brought on by technology iteration in the IoT industry or other factors that are outside of our control. Despite these challenges, we are confident in our long-term growth prospects and are committed to iterating our products and services, further enhancing our software and embedded hardware capabilities, expanding our customer base, diversify our revenue streams and further optimizing operating efficiency. So to address your question, first, we have not seen signs of a turning point of overseas demand for IoT device â\u0080\u0093 consumer electronics devices yet. In the United States, for example, according to the latest, our brand customersâ\u0080\u0099 feedback, consumer electronics retail quantity is currently down about 30% year-over-year at the retail side. So we have seen Europe is experiencing a significant weakening demand of discretionary product, which include IoT consumer electronic devices. Also based on numbers from the National Bureau of Stats, total retail sales of consumer goods nationwide fell 4.6% year-over-year in the second quarter. In terms of IoT PaaS, we are making progress in developing the business of, for example, energy-related equipment, IoT or commercial and industrial environment. In Q2, close to 2% of our current IoT PaaS shipment went through industrial segment. So itâ\u0080\u0099s outside of consumer electronics, including like industrial sensors, professional lighting or commercial lighting, industrial energy reservation products and the commercial and the industrial security products and also like central HVAC equipment for the large commercial buildings. At the same time, we are expanding our customer base beyond the consumer electronics devices industry through our multiple SaaS offerings. So in July, Tuya and Amazon launched the Matter solution and expected to complete some operating capital with other products. Simply put, using the Matter protocol, devices can be directly shared with the Apple HomeKit or connected to different brands of smart speakers such as Alexa and Google Assistant without having to be interfaced in the development process to achieve basic local interaction. Both products will have increasingly rich IoT capabilities and personalized demand, but cloud service will still be a rigid demand. Overall, we will â\u0080\u0093 Tuya will incorporate Matter into our technology system based on one-stop capabilities, including Wi-Fi threat and especially gateway and central controller, as well as our product level solutions across all categories. While adjusting the need for standard local connectiâ\u0080\u0093ty features, our cloud-based IoT capabilities, software algorithm and app capabilities will help make devices within Matter protocol smart. In addition, our Matter solution will enable customers to achieve information transfer and OTA upgrades with smart device directly through the Tuya IoT PaaS without having to rebuild DCL servers. Overall, with the Matter as a complement  protocols in the IoT industry, we have participated in various tests of project measure and brought first-time installation to our customers. Therefore, in the second half, we will use the same approach to manage our operations and driving expense control while exploring measures that can more efficiently support our operations, sales, product and R&D systems. Basically, our organizational structure and internal adjustments are centered on the strategy we adopt at the beginning of 2022 to first, the upgrade of product and research centered on Cube smart private cloud offer. We are also actively transforming and upgrading from a developed platform based on consumer electronic products to using the accumulative experiences and the technical advantages of IoT PaaS, platform that serves the industrial commercial and industrial fields are targeted to implement key customer strategies. After comprehensively evaluating factors such as business demand, stage of development and the demand characteristics, we assign teams and members with characteristics that provide targeted support and expansion. In general, in the future, we strive to achieve an appropriate team size by operating and managing more efficiently and through fine-tuning adjustments while supporting our new strategies, develop a platform product, basic capabilities and the R&D tasks. At our current scale, we will dynamically evaluate the demand -- the market demand and the business expectations to ensure that efficiency output and the financial results are in line with our goal."
}