{
    "symbol": "TUYA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-15 11:17:03",
    "content": " Thank you for standing by, and welcome to Tuya Incorporated First Quarter 2022 Earnings Conference Call. Our revenue reached $55.3 million in the first quarter, exceeding the high end of our previous guidance range. Revenue represented a year-over-year decrease of 2.7% compared to the quarter of 2021, where we saw rapid growth across the industry. Consumer discretionary spending was adversely impacted by high inflation and the Russian, Ukrainian conflict that started in the first quarter further exacerbated global inflation. On the other hand, our 2B-based SaaS and other segments maintained a strong growth momentum for the fifth consecutive quarter with revenue reaching $5.8 million, representing a year-over-year increase of 146.7%. In addition, since our smart private cloud product, Cube Solution was launched in the last November and officially released in early this year. On the customer front, as we continued to iterate our products and services, our total number of customers increased by 29% from the same period last year to approximately 3,900 in the first quarter. IoT PaaS premium customers with revenue contributions of more than $100,000 during the past 12 months increased from 216 as of March 2021 to 303 as of March 2022. Our ability to maintain a large-scale customer base enabled us to leverage our platforms, economies of scale and improve the network effects between our business as well as our customers. In addition, the diversity of customers also helps reduce external risks in an increasingly uncertain macro environment. For example, the deployments of an established Canadian smart home brand with business across over 100 countries and regions, reaching the millions in the first quarter, 6x more than what they ordered in the same period of last year. In the first quarter, both our overall gross profit margin and IoT PaaS gross margin improved slightly year-over-year to 41.2% and 42.3%, respectively, remaining relatively steady compared to the same period of last year and the previous quarter. During the past 12 months that ended March 31, 2022, the dollar-based net expansion rate of our IoT PaaS business segment was 122%, remaining at the top of the cloud path and the SaaS industry. We garnered nearly 500 new customers on our IoT PaaS business, growing the total number of our IoT PaaS customers by 21% year-over-year. In this Q1, we continue to attract and acquire reputable new companies across the globe as customers of our IoT PaaS business through our Tuya Plus Strategy. In Europe, for example, we officially started a partnership with a German supermarket giant with business worldwide. Another customer is a leading Dutch brand, Smartwares, with products sold all over the world. This Dutch customer entirely shifted from its own IoT platform to the Tuya platform, which will enable them to achieve breakthroughs in all their product categories, starting from home appliances and sensors. In Asia, we enabled Korea's top 3 smart home brand listed company, Kocom, to implement visual capabilities into installed bell products. We are also in the process of helping India's well-known emerging consumer electronics brand boAt to expand into TWS Bluetooth handsets and IoT consumer electronics products, including smart glasses in the future. Given the current macro environment, like smart Bluetooth products will be the key strategic focus in 2022. In South Africa and other regions, notable new customers included , a leading brand in Argentina that focuses on offline product distribution and has more than 1,000 partners covering the entire South America continent. In North America, a listed company and the market leader in the R&D and the production of RVs, pickup trucks, yards and spare parts confirmed their partnership with us in the first quarter to build a smart RV ecosystem. We now also further expanded our customer base in North America with a leading audio and video solutions and  brand, a leading residential irrigation equipment brand, a leading environmental appliances, health and personal care brand and many others. This new customers' business both covering from personal entertainment to environments, outdoor and others. Domestically, the resurgence of COVID after holiday season in the second half of the first quarter substantially limited our business activities in China. However, our outdoor business line, which has been one of our key product categories, still acquired multiple customers with immense business potential. These customers included leading the eco information system developed and the undisputed leader of the domestic , and the leader in the portable and home energy storage industry. In addition, we launched the 100 Days for 100 Brands plan to penetrate Chinese e-commerce  brands before the spring festival this year and successfully acquired more than 100 target customers by the end of April. In the first quarter, we continue to diversify our business and our IoT PaaS product categories are increasingly balanced. Among them, the electrical and lighting categories, which constitute a significant portion of our revenue, has been largely affected by inflation, recording a year-over-year decrease. This decrease was mainly because consumer-grade electrical and lighting products are price-sensitive products, usually sold in large quantities. In other categories, we observed that the smart IPC and security sensor products, which have relatively high IoT penetration rates, are in strong demand. Meanwhile, household appliances with little price gap between IoT and traditional products maintained a solid year-over-year growth momentum. First, in commercial lighting, our premium SaaS solutions were adopted by China Construction Development Corporation, which has been ranked among the Fortune Global 500 for 5 consecutive years for its street lighting project in Xiamen. Mexican industrial lighting brand, Dimas Lighting also leveraged our software capabilities to complete construction of its intelligent platform for commercial lighting and implemented several industrial lighting projects. Internationally, the leading hotel system integrator in Malaysia, Core System Technologies, is using Tuya's hotel SaaS solution to land at the first smart hotel in Malaysia. Additionally, the smart products arm of a world famous Fortune 500 group is cooperating with us to use our hotel rental SaaS and platform SDK capabilities for overseas hotel rental operations. For value-added services, the strong momentum of our customer paid tariff services carried through into the first quarter with revenue broadening over to 100% year-over-year. Finally, let's talk about this year's core strategy, our smart private cloud product, Cube Solution. In the first half of 2022, we have made substantial progress in our private cloud business. After thorough evaluation and license and inspection, several leading customers in different countries and industries have recognized our private cloud solution. For example, Telkom Indonesia, the largest telecom operator in Indonesia with service coverage of over 55% of all Indonesia household and hundreds of millions of registered users will use our Cube Solution to tap into the strong consumer spending power of consumers in its network to accelerate the development of its Indonesia smart home appliances market. Our goal in such collaboration is to become its long-term partner in 3 ways: first, private cloud platform software development; second, powered by Tuya ecological smart devices interconnections; and finally, additional recurring value-added services for the end users. In China, a China leading utility giant is establishing the long-term collaboration agreement with Tuya to build its own IoT intelligent platform in stages. So far, we are getting positive feedback from our customers that they choose our products and trust us because of our product innovation of technology covering cloud edge and application and the scale effect of the integrated software and hardware products based on our deep cultivation in the intellectualization field for more than 7 years. As well as our reach powered by Tuya device ecology through a long-term accumulation in the years, we believe in our ability to capture long-term opportunities in the market with strong demand for smart private cloud solutions. Overall, the first quarter is full of challenges, economic and other disruptions that started in second part of the 2021, intensified in the first quarter, aided by the Ukraine war. While we remain cognizant of these major challenges in our IoT PaaS business, we will explore additional growth drivers through our smart private cloud and smart industrial SaaS segment. On profitability, in this quarter we focused on the optimization of our organizational structure efficiency as we aim to better balance our business growth and time line to profitability. Nonetheless, our total revenue in the first quarter exceeded our previous expected guidance range. For the first quarter of 2022, our total revenue were $55.3 million, down 2.5% year-over-year. The decline was driven by a 16.1% year-over-year decrease in our IoT PaaS revenue, which reduced to $41.8 million for the quarter, impacted by factors Jerry mentioned earlier. If we look into the ultimate demand contributions to our revenue across the globe, which represents our estimate based on various businesses information from and regarding our customers, we did experience a slowdown in the U.S. and Europe, but we were able to deliver growth in China, Latin America, Southeast Asia and other Asian regions. Moving along to our customer base, we had 303 premium IoT PaaS customers for the trailing 12 months ended March 31, 2022, up 40.3% from 216 a year ago. During the quarter, premium customers accounted for approximately 85.6% of our IoT PaaS revenue, forming a solid customer foundation for our business. Our dollar-based net expansion rate for IoT PaaS segment maintained at a healthy level of 122% for the trailing 12 months ended March 31, 2022. On the other hand, as Jerry mentioned, we delivered a satisfactory performance in acquiring new customers with exciting business potentials. For example, in the first quarter, we still made decisive efforts in the Chinese market by launching the 100 Days for 100 Brands plan, under which we obtained more than 100 China brand customers in various segments within 100 days. Among these customers, who did agreement with us, about 40% were customers in small and large household appliances, kitchen appliances and pet appliances, 40% were electrical and lighting-related brand customers. And the rest 20% were customers in emerging verticals including personal, health care, home decoration, home safety, outdoor, automating products and other fields. We believe that our cooperation with this benchmarked brand across different verticals such as according to the public industry ranking, 1 of the top 3 baby care brands in the Chinese market, 1 of the leading brands in the vertical category of electric , 1 of top 10 brands of bathroom heater switches, and 1 of top 10 brands of screen lights, et cetera, in China, will further complement us and enrich our business in the China market. Our overall gross margin and IoT PaaS gross margin for the quarter remained stable at 41.2% and 42.3%, respectively, as we effectively implemented a series of initiatives to improve our business management efficiency. For example, our average salaried R&D employee headcount increased by approximately 30% in this quarter versus a year ago. Our non-GAAP loss from operations was $37.8 million in the first quarter, representing 68.4% of total revenue. And our non-GAAP net loss was $37.3 million in the first quarter, representing 67.4% of total revenue. As part of our efficiency-first strategy, not only have we refined our team structure, we are also reducing our office lease by toning down our office plans to match our current growth trajectory. For example, in our IoT PaaS and smart device distribution business, a small percentage of large orders contributed to the majority of the revenue, while the rest are mostly small and scattered purchases. In the first quarter, specifically, if we exclude those one-off expenses related to the compensation paid to employees due to team restructuring, rental penalties and the restoration costs, our non-GAAP operating margin and net margin would have increased about 5%. During the first quarter, we repaid approximately 4.9 million ADSs from the open market for a total consideration of approximately $25 million pursuant to the share repurchase program, representing around 12.5% of the $200 million authorization announced pursuant to the share repurchase program. Now turning to outlook for the second quarter of 2022, we expect total revenue to be in the range of $60 million to $65 million. As you can see in the market, in the second quarter today is full of uncertainty and the factors leading to the industry-wide challenges everyone's facing have not significantly improved. In terms of economy last Friday, the CPI of the United States increased by 8.6%, hitting a new high, representing a very high level of inflation. Regarding the COVID epidemic in China, April and May were the most challenging months and inventory backlogs experienced throughout the supply chain, including OEMs, brands and retail channels, have hidden the players from placing orders to upstream. My question is that while we face challenging environments in the EU and U.S. market, can management share some colors on the progress of our China business? Therefore, we're expanding a few of our business to grow quickly and to grow the revenue contribution from China, including PaaS, SaaS and Tuya Cube, our new strategic private cloud product. And for the SaaS business, since the end of 2019, we have started SaaS business in hotel, property, community and the commercial lighting in China. For example, we formed a strategic partnership with Alipay in hotel SaaS business in the first half of this year to build up hotel-centric digital commercial ecosystems for thousands of hotels covered by Tuya SaaS network. This PaaS partnership will enable us to quickly integrate business resources to provide 7 days, 24 hours customized quality and diversified digital services nearby for the guests in the hotel room that stayed there, which will be converted into revenues. Commercial lighting SaaS has launched many energy-saving use cases in China this year and are widely recognized very positively, including implemented in gas station factories, communities, group lights in city centers, large-scale parking lots, et cetera. We have signed up contracts with a number of industry-leading players in China for this new strategic product, including leading telecom operators, leading utility companies and auto group, and with a few other large enterprises are in the process of signing contracts such as leading energy companies. First, Tuya's IoT cloud connected hundreds of millions of devices on a global basis with 8 years' track record for safety and reliability; second, our technology system is most comprehensive that can provide a full service coverage, IoT cloud, IoT OS, app and SaaS; and thirdly, our hardware ecosystem is unparalleled; and number four, our deep focus in IoT. And for the new strategic Tuya Cube product, the revenue contribution will start to reflect in Q3. In Q1 and Q2, we mainly signed up new customers and start the deployment of the private cloud and the recognition of the revenue will start in Q3. The second question is, could management update in terms of the overseas consumer electronic device-related demand outlook going into the second half assuming the -- I think management mentioned the CPI will continue to be high. We saw the -- for the first question, we saw the most impact on our business activities in China happened in end of March, April and May, including customer acquisition efforts has been significantly slowed down and especially delivery of our SaaS solution, which requires the customer to be satisfied with the result give us a paper confirmation that was delayed as well. All the specific market sizes are not too big; and second, we refined our team structure and focus on improved organization efficiency; and thirdly, to improve our PaaS long tail business model to more focus on large customers and the large contracts. We also tiered our orders to adjust expenses for small orders, which led customers to combine into large orders to significantly improve our efficiency. In terms of product categories, consumer electronics and lighting categories in the overseas market was impacted most by the inflation and the price gap between IoT products and the traditional counterpart is large, especially in lighting and electrical product segments. So as a result, in like lighting and electrical segments, consumers tend to prioritize traditional products over IoT products. However, for different other segments of products, for example, the whole home consumer, camera, sensor products and home appliances, we saw less impact by the inflation. So -- we -- for the second half year, we think major factors coming from how U.S. Treasury can effectively control the high inflation and also the European Central Bank. If the inflation can be quickly controlled, we do believe and also our brand customers believe that the -- the demand will recover quickly from the end user side. One more thing is worth noting is that our customer-facing value-added services -- for example, cloud storage recorded an overall 200% year-over-year revenue growth in the first quarter. So for home appliances as a category with relatively high overall value, also have a single-digit year-over-year growth in the first quarter. And also despite our brand customers are facing huge challenges, they are conservative in terms of placing orders to OEMs, but the majority of them keeping very optimistic for the long-term trend of IoT. And based on  number in the first half of this year, for all the brand customers, we acquired before end of 2020, about 48% of them have expanded into new IoT devices, SKUs this year. Most of our private cloud services customers are new customers, almost all of them. So we are promoting the Tuya Cube product, not to our existing customer base, but to new industry -- new customers. So we are currently also have a very healthy pipeline for large-scale companies, including leading energy companies in the stage of negotiating contracts and also a very large European retail groups. So this kind has all demonstrated our private cloud technologies can be implemented in many different industries, which we feel very excited that the Tuya Cube product can enable Tuya grow outside of consumer electronics industry. And we all have seen consumer electronics industry can be impacted significantly by high inflation, by the economy cycle, the consumer down cycle in China. So we believe our focus on the Tuya Cube Solution, which will not only provide a lot new growth field for us, but make our business in the long term, much more sustainable in a down cycle of the economy. And because this is still a pretty new business in early stage, we need to time to determine the best pricing and the deployment strategy. So based on our experiences with existing and prospective customers, our private cloud projects are typically operated at a large scale for very large customers given their commercial value and the business finding model. So in addition to the implementation and deployment in the launch stage, there will be more business cooperation and the revenue opportunities in the IoT product ecosystem and our SaaS capability for those large Tuya Cube customers in the long-term future. As such, future customers can even have their in-house R&D team or hire third-party implementation team to deploy our Cube products directly. So we want to emphasize that while private cloud customer-specific systems, there will be a standardized product because it is providing very infrastructure-like capabilities. First is to use all kind of different communication with including Wi-Fi, ZigBee, Bluetooth, the Cat 1, NB-IoT and also industry network to connect all kind of IoT devices. And second is to provide a highly secured cloud structure and which is in compliance with all the different countries, data security rules, including China, including Europe, U.S. And for example, in Southeast Asia, the customer also doesn't need to invest heavily in how to compliant with security laws -- the data security law in different regions. And if it's a different category, we never worked with our ample experiences and the thousands OEMs, we have worked in the past 8 years, within 30 days, any new IoT devices can be connected into this private cloud structure. We will, through next 6 to 8 months, we will focus on delivering our first dozens of projects for our top customers well."
}