{
    "symbol": "KRG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 09:35:22",
    "content": " Included in our guidance are a few key assumptions at the midpoint, same-property NOI growth of 2.5%, a full year bad debt assumption of 125 basis points and an additional 75 basis points of assumed disruption for Bed Bath & Beyond and Party City. And just one last one, Heath, on â\u0080\u0093 in terms of the guidance, can you give us a sense â\u0080\u0093 I think in the bridge, it looks like interest expense is just about $0.01 per share headwind relative to 2022. And also, if you think about it, Todd, weâ\u0080\u0099re sort of in this interesting spot right now where â\u0080\u0093 if you look at where you might dispose of an asset and yield on an asset versus what I could avoid in issuing new debt, call it, at 6.5% or 7%, we could actually dispose of assets in a way that de-levers you and is also neutral to your earnings. But I think the point we were trying to make is that the balance sheet is so strong that weâ\u0080\u0099re able to kind of wait and see how that works its way through, but at the same time, we are looking at opportunities, and we are always underwriting things and trying to figure out where do those â\u0080\u0093 where will that come together where it makes sense for us. So I think when weâ\u0080\u0099re dealing with both Bed Bath & Beyond, Party City, there will likely be some discussions that go the other way, where, hey, where can we work with you to get spaces back and theyâ\u0080\u0099re going to be very aggressive with us in terms of trying to stay in the location. Iâ\u0080\u0099ll give you the components, Anthony, for the same store at 2.5% at the midpoint, youâ\u0080\u0099re looking at contributions from minimum rent growth of 300 basis points, recoveries of 100 basis points, partially offset by the Bed Bath & Beyond, Party City reserve of 100 basis points, overage rent of 30 basis points and bad debt of 20 basis points. And I know you mentioned that you want to spend more on a â\u0080\u0093 spend capital on leasing and weâ\u0080\u0099re still in an uncertain economy here, but there are some great opportunities to buy back stock last year, you still had the $400 million in place."
}