{
    "symbol": "ITI",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-07 11:32:05",
    "content": " The company reported fiscal 2023 first quarter total revenue of $33.7 million, representing a 1% decrease year-over-year. The decrease is fully attributable to supply chain challenges that prevented us from shipping, and recognizing $4.9 million in first quarter revenue on Vantage sensor backlog. If not for the supply chain challenges, first quarter total revenue would have increased 13% year-over-year to $38.6 million. In the first quarter we reported record total net bookings of $42.6 million, representing an 18% increase compared to the same prior year period. Due to sustained record total net bookings, we ended the June 30 period with record total ending backlog of $109 million, representing a 36% increase year-over-year and a 9% increase on a sequential basis. Of our $33.7 million in fiscal 2023 first quarter total revenue, 49% was recorded as product revenue, and 51% was recorded as service revenue. Fiscal 2023 first quarter product revenue was $16.4 million versus $18 million in the same prior year period, representing a 9% year-over-year decline. Again, if not for supply chain constraints, product revenue would have been $4.9 million higher or $21.3 million for the quarter, representing an 18% increase relative to the product revenue in the same prior year period. Fiscal 2023 first quarter service revenue was $17.3 million versus $16.1 million in the same prior year period, representing a 7% increase year-over-year. Our first quarter annual recurring revenue was $9.4 million, representing an increase of 14% year-over-year and representing 58% of our total service revenue. In the first quarter, we recorded $22.1 million in net service bookings, of which 71% of the net service bookings will be recognized in the future as annual recurring revenue. Although supply chain constraints prevented us from shipping $4.9 million of our first quarter Vantage sensor backlog, we believe that Iteris continued to outperform our competitors in a difficult environment, and we made good progress implementing our supply chain mitigation program, which will begin to produce financial benefits in our second quarter. This prevented us from manufacturing all the circuit board assemblies necessary to fulfill about 30% of the Q1 Vantage Sensor shippable backlog, or approximately $4.9 million in product sales that slipped out of the quarter. Taking into account the $4.9 million of revenue that was not recognized because of component shortages, the product revenue growth would have been 18% quarter-over-quarter. Our service revenues increased 7% to $17.3 million compared to $16.1 million in the prior year quarter, primarily driven by stronger software sales. Adjusted EBITDA for the first quarter was a loss of $2.5 million or 7.3% of revenue, which compares to the positive EBITDA of approximately $2.5 million or 7.4% of revenue in the first quarter of last year. Based on our current record backlog and anticipated future bookings growth, we should resume our year-over-year revenue growth in our fiscal 2023 second quarter, and we continue to forecast fiscal 2023 total revenue of $147 million to $155 million, which would represent full year organic growth of 13% at the midpoint of the guidance range."
}