{
    "symbol": "ITI",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-12 20:55:02",
    "content": " For the fiscal 2023 second quarter, Iteris reported record total revenue of $39.3 million, representing an 18% increase year-over-year. In the second quarter, we reported total net bookings of $42.2 million, representing a 15% increase compared to the same prior year period. Fiscal 2023 second quarter product revenue increased 17% year-over-year to $20.8 million, even after 900,000 shipments slipped out of the quarter due to global supply chain constraints. Otherwise, products revenue would have been 900,000 higher or $21.7 million for the quarter, representing a 22% increase relative to the product revenue in the same prior year period. Fiscal 2023 second quarter total service revenue was $18.5 million versus $15.5 million in the same prior year period, representing a 19% increase year-over-year. Adjusting for the increased component costs of $7.8 million, the gross margins would have been 36.6% or up 310 basis-points compared to the same prior year quarter. Our service gross revenues increased 19% to $18.5 million compared to $15.5 million in the prior year quarter, primarily driven by stronger software and managed services revenues. Adjusted EBITDA for the second quarter was a loss of $5.2 million or 13.1% of revenue, which compares to EBITDA of approximately $2.3 million or 6.9% of revenue in the second quarter of last year. As previously mentioned, we procured $8.4 million in components from the secondary markets, so we were unable to get meaningful extended payment terms, which is a normal business practice in these market to offset the inventory carrying costs and this also negatively impacted our working capital in the quarter. Second half adjusted EBITDA to be in the range of $3.5 million to $4 million or 4.5% to 5% of revenue, with the compounding benefits of our global supply chain improvement program, enabling the company to exit the fiscal year at a run rate of approximately 10% adjusted EBITDA. Based on these second half expectations, we are raising the low end of our full year fiscal 2023 revenue guidance to a range of $150 million to $155 million and we are lowering our full year adjusted EBITDA range to negative 1% to negative 3%, a full year fiscal 2023 revenue to reflect the impact of global supply chain constraints on our fiscal 2023 first half results. It's going to come down to just the continued evolution of the supply chain and getting all the components we need, the software business, the professional services business are all pretty consistent and with the visibility we have into the backlog that was referenced, I think the only risk would just be, as we've talked about the last 4 quarters would be in the supply chain, but we think with the redesign efforts that are completed and those that are ongoing that, that risk has largely been managed to give us the confidence that we can hit a 10% EBITDA number exiting the year."
}