{
    "symbol": "ENIA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 20:41:03",
    "content": " EBITDA increased by 48% during the period, mainly due to the contribution of EGP Americas and better results in network business in Brazil, explained by higher tariffs, while net income grew by 100% compared to first quarter of 2021 due to better operational and financial results. During the first quarter of this year, our CapEx increased by 91% compared to the same period of last year, reaching $563 million. Net protection on the first quarter reached 13.1 terawatt hours, an increase of 35% compared to the same period of last year, mainly explained by the contribution of EGP Americas. EBITDA in the first quarter reached $1,166 million, 47.7% higher than the same period of last year. If we exclude the impact of 64 megawatts coming from the currency devaluation and $116 million from EGP Americas, we get to an EBITDA of $1,114 million, while which is 41% higher than the EBITDA of first quarter last year. Funds from operations in this period reached minus $43 million, while net debt increased by 26% reaching $7.4 billion. Currency devaluation plus other impacts had a negative impact of $16 million reaching a final EBITDA of $1,166 million, 48% round figures, higher than the same period of last year. EBITDA generation business increased by 55%, mainly explained by the contribution of EGP Americas, reaching $513 million, repeating of which $116 million came from EGP Americas. EBITDA in networks business increased by 39% compared to first quarter of last year, reaching $666 million. Starting from an EBITDA of $1,166 million, we see that networking capital amounted to minus $978 million, a significant increase compared to the same period of last year. Firstly, regarding the distribution business in Brazil, there has been a lot of adjustments in terms of the tariffs lately, seeing you had a sort of a $450 million EBITDA in this business in the quarter. Another important issue that I did not mention is that the hydrology – remember that we are now in a very good hydrological issue, which provides us a better working capital since we are paying – we are receiving more money in our tariff to pay the energy that we purchased since we have a good hydrology and remember that in this first quarter, we didn’t have received yet similar to the account, the hydrological accounts, which for us is $100 million more or less, and it is operating in April."
}