{
    "symbol": "OMI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 10:04:02",
    "content": " In addition, the program is expected to deliver approximately $100 million of adjusted operating income run rate by the end of 2023, and approximately $200 million of adjusted operating income run rate by 2025. Fourth quarter gross margin was $407 million or 16% of revenue, up 210 basis points from last year's fourth quarter. In addition, gross margin reflects a $92 million inventory valuation adjustment recorded to cost of goods sold in our Products and Healthcare Services segment during the fourth quarter. Year-over-year, foreign currency negatively impacted fourth quarter revenue by $10 million and adjusted operating income by $3 million. Fourth quarter 2022 adjusted EBITDA was $117 million with a margin of 4.6%, up 60 basis points versus last year's fourth quarter. Full-year 2022 adjusted EBITDA was $518 million with a margin of 5.2%, up 20 basis points versus the prior year. Net revenue in the fourth quarter was $617 million, an increase of 135% year-over-year. In the fourth quarter, on an adjusted basis for the Apria acquisition, Patient Direct grew revenue by 10.3% year-over-year with double-digit growth in most key product categories. Segment income for the quarter was $66 million, compared to last year's fourth quarter of $17 million. More impressively, in the fourth quarter, on an adjusted basis for the Apria acquisition, Patient Direct grew adjusted segment income by 50% year-over-year with a margin increase of 280 basis points to 10.7%. Once again, we expect to deliver approximately $30 million of adjusted operating income to the P&L in 2023, ending the year with a run rate benefit of approximately $100 million and approximately $200 million annualized by the end of 2025. A gross margin rate of approximately 20.5%, interest expense in the range of $175 million to $180 million and adjusted effective tax rate of 26% to 27%, diluted weighted average shares of 77.5 million, capital expenditures of $190 million to $210 million, stable to improving commodity prices, and FX rates as of 12/31/2022. And that realignment is going to deliver $30 million expected in 2023, as well as a run rate at the end of the year by $100 million, long-term north of $200 million and between $250 million and $400 million worth of working capital and we're going to do that with a high sense of urgency and aggressiveness."
}