{
    "symbol": "NTB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 13:10:03",
    "content": " At this time, I would like to welcome everyone to the Fourth Quarter and Full Year 2022 Earnings Call for The Bank of N.T. Today, we will be reviewing Butterfieldâ\u0080\u0099s fourth quarter and full year 2022 financial results. On the call, Iâ\u0080\u0099m joined by Michael Collins, Butterfieldâ\u0080\u0099s Chairman and Chief Executive Officer; Craig Bridgewater, Group Chief Financial Officer; and Michael Schrum, President and Group Chief Risk Officer. Yesterday afternoon, we issued a press release announcing our fourth quarter and full year 2022 results. Before I turn the call over to Michael Collins, I would like to remind everyone that todayâ\u0080\u0099s discussions will refer to certain non-GAAP measures, which we believe are important in evaluating the Companyâ\u0080\u0099s performance. Todayâ\u0080\u0099s call and associated materials may also contain certain forward-looking statements, which are subject to risks, uncertainties and other factors that may cause actual results to differ materially from those contemplated by these statements. Butterfieldâ\u0080\u0099s excellent results in the fourth quarter and full year 2022 benefited from strong positioning in our core banking and private trust markets in Bermuda, the Cayman Islands and the Channel Islands. In addition to these locations, we provide specialized financial and trust services in Singapore, The Bahamas and Switzerland as well as United Kingdom based mortgage lending and high-end Central London. In addition to higher net interest income, non-interest earnings were up 4% and expenses held steady, despite some inflationary cost pressures. The current cycle deposit costs differ somewhat from previous cycles, as a result of our larger banking presence in the Channel Islands, which is more corporate than retail based and therefore more competitive. Throughout 2023, weâ\u0080\u0099ll be taking over the administration and servicing of selected Private Trust client structures in Singapore, Guernsey and The Bahamas. We still expect the timing of the onboarding to occur progressively by jurisdiction with the first smaller tranche of Singapore clients coming across at the end of the first quarter, and Guernsey and The Bahamas in the second and third quarters. We did not conduct share repurchases during the fourth quarter, although as Michael mentioned, we expect to resume share buybacks as we approach our targeted TCE/TA range of 6% to 6.5% due to deposit stabilization and sustained improvement in OCI marks. I will now turn to slide 7, which provides a summary of net interest income and net interest margin. In the fourth quarter, we reported net interest income before provision for credit losses of $94.6 million, an increase of 3.7% versus the prior quarter. The increase was due mainly to continued improvement of yields on all interest earning assets, which was somewhat offset by higher deposit costs. Average cash and short-term investment balances were down $280.1 million during the quarter, driven by expected customer deposit outflows on the funding side. The average loan balance was down $83.3 million, driven by net maturities in Bermuda and Cayman. Overall, loan yields were up 74 basis points during the fourth quarter, primarily due to the impact of previously announced rate increases on floating rate loans. Non-interest income was up 10% quarter-over-quarter, primarily due to higher banking fees, which benefited from increased seasonal credit and debit card transaction activities and higher trust revenue from new business and increased activity based fees. The higher expenses are primarily the results of increased staff related costs, mostly from performance based incentive accruals and severance costs. As we see sustained improvements in the TCE to TA ratio towards our target range of 6% to 6.5%, we plan to recommence share repurchases subject to market conditions. It is important to note that the TCE to TA is not a regulatory ratio for Butterfield and the ex cash ratio also improved to 6.5% and excluding OCI on the securities book, the TCE to TA ratio remained at 8.2%  Turning now to slide 11. The stabilization and increase in deposits came from higher customer volumes as well as the impact of foreign exchange translation of non-U.S. dollar deposits, reversing some of the decline we saw in the third quarter of 2022. Butterfieldâ\u0080\u0099s low risk density of 33.9% continues to reflect the regulatory capital efficiency of the balance sheet with a low risk weighted residential mortgage loan portfolio, which now represents 70% of the total loan assets. Turning to slide 12, here we provide loan and deposit changes by volume and foreign exchange movement, as well as currency by segment. The chart shows the $530 million fourth quarter increase in deposits, which consists of $290 million of underlying deposit inflows, and $240 million due to currency translation changes from a weaker U.S. dollar. On slide 13, we show that Butterfield continues to have a strong asset quality with low credit risk in the investment portfolio, which is comprised of 96% AAA rated U.S. government guaranteed agency securities. Credit quality in the loan book also continues to remain robust with non-accrual loans holding at 1.2% of gross loans, and the loan net charge-off ratio, which is up 3 basis points from the prior quarter to 11 basis points. On slide 14, we present the average cash and securities balance sheet with a summary interest rate sensitivity analysis. Butterfieldâ\u0080\u0099s results continue to validate the strengths of our best-in-class operating jurisdictions, sustainable non-interest income, and disciplined expense management that helped drive the efficiency ratio below 60%. As we enter 2023, we believe that Butterfieldâ\u0080\u0099s return on common equity will continue to support overall growth objectives and investor returns. Our longstanding strategy remains focused on limiting credit exposure in our conservative investment portfolio, growth through targeted acquisitions, and thoughtful capital management. Our core markets and market conditions remain constructive for Butterfieldâ\u0080\u0099s continuing success, given the proven relatively low risk and high return profile of our business model across recent interest rate and economic cycles. I look forward to working alongside our great teams of people in 2023, and beyond, to help clients achieve their financial goals and enhancing shareholder value. Obviously, nice to see the reversal after a couple of quarters of outflows. Obviously, in the slide deck, you can see the FX movement, which is quite significant in terms of the underlying values that we put on the balance sheet. The underlying deposit flows, as you said, weâ\u0080\u0099ve seen sort of a post-pandemic outflow, net outflow, still a bit elevated, I would say. So, I think we still believe when we look at the retail has held very steady, corporate, particularly in Bermuda and Cayman, is a bit more volatile in terms of business flows. So, weâ\u0080\u0099re still a little bit elevated right now. But obviously, we are trying to carefully balance the rate, the cost of deposits with the flows as well. So, I think weâ\u0080\u0099ve done a decent job of that, even though cost deposits are ticking up. So, I think we are still sort of looking at 12.5%, maybe a little bit higher, maybe a little bit lower, but thereabout. And then in the same -- I guess, correlated to that, as you think about cash flows from the investment portfolio. Obviously, thatâ\u0080\u0099s helpful in terms of not having any more OCI coming into the FX book impacting TCE. So again, weâ\u0080\u0099re just kind of sitting there until we kind of start the march back, and we were pleased to see a recovery obviously of the TCE this quarter, helped by some of the OCI marks coming back a little bit. So, we are going to kind of -- short-term rates are still pretty productive. But over time, obviously, we want the fixed rate assets in investment portfolio. So, maybe a couple of quarters more and see how rates develop and then we should be re-laddering out and going back to BAU. And then you talked a little bit about the deposit pressures starting to pick up a little bit, specifically in the Channel Islands. Obviously, the exit run rates are a bit higher. If you look at the March, particularly on the term deposit side, it has really largely been due to the Channel Islands, where again we donâ\u0080\u0099t have a significant enough market share to have an impact on the pricing in those markets. And weâ\u0080\u0099re still trying to grow market share, obviously there. In terms of how we think about the betas in Bermuda and Cayman, that hasnâ\u0080\u0099t really changed very much in terms of the deposit beta. So, I think for demand, we model something like a 30% beta, and I think, weâ\u0080\u0099ve outperformed that across the cycles. And in term deposits, we sort of model a 70%. So, those on a back testing basis are pretty conservative assumptions for those two markets, really. And then the Channel Islands, weâ\u0080\u0099re obviously a little bit newer to the market, and so weâ\u0080\u0099re modeling it at a little bit more aggressive deposit betas. I think, weâ\u0080\u0099re sort of peaking in terms of deposit betas right now, in Channel Islands, but theyâ\u0080\u0099ve been pretty close to a 100% actually. I think, part of it is Alex in Channel Islands, itâ\u0080\u0099s very much a -- we are very much of a corporate bank today. We have over 200 million sterling in mortgages now, and sort of over about a 100 million in deposits. So over time, I think the Channel Islands will become -- funding will become somewhat less expensive as we grow the retail book. But today itâ\u0080\u0099s very much a corporate book, but I think that will change over time. Itâ\u0080\u0099ll start to look a little bit more like Bermuda and Cayman, but itâ\u0080\u0099ll take some time to get there. And then, as a follow-up, if thereâ\u0080\u0099s still -- I think itâ\u0080\u0099s a 2 million share authorization remaining through the end of February. I guess probably a few points just to tee it up is, kind always said that, as we structure a pathway back into our range of 66.5%, weâ\u0080\u0099ll give consideration to whether we go back into the market, and commence our share repurchases. So, at the end of December, I think, weâ\u0080\u0099re like a 5.6, and weâ\u0080\u0099re kind of seeing positive conditions around that. And then, what we did announce yesterday is a renewal -- or replacement program of 3 million shares to take us through to next February. And weâ\u0080\u0099re really happy that we just finished our Board meetings yesterday, the Board approve that and weâ\u0080\u0099re very supportive of going back into the market for share repurchases, obviously subject to market conditions. But yes, we are kind of having internal discussions and looking at recommencing share buybacks. And I think Tim -- sorry, itâ\u0080\u0099s Michael Schrum, can add to that. We just want to see conditions kind of stabilize, both deposit levels and OCI. So, the size of the one that was extended during 2022 was kind of mid-teens to the Cayman Islands government. And obviously, thatâ\u0080\u0099s kind of been also amortizing and paying down over the last couple of months as well. So, itâ\u0080\u0099s kind of somewhere around 12 to 13 at this point. That is -- obviously, we continue to kind of focus on those relationships, those significant relationships. Nothing significant in the pipeline at the moment, but as those opportunities come up, we are always kind of willing to put our hats in the ring. And then just last for me, looking at your expectation on the deposit side, the fact that we still have some lagging rates to be put into the Bermuda mortgages. Obviously, the first thing is, it depends on where market rates are. I would say, our exit run rates for the fourth quarter were -- continued to have that NIM expansion at a slower pace than what weâ\u0080\u0099ve seen in Q3 and Q4. So obviously, you saw the big uptick in Q3, and then a slightly more moderate uptick in NIM in Q4. And itâ\u0080\u0099s worth just mentioning, we still have two announced base rate increases in the Bermuda residential book, which are coming through in Q1. So, when you put it all together, the cash and short-term securities will continue to trend up, loans will trend up a little bit, but there is about 40% fixed in that. And then obviously, securities when we start to re-ladder should reinvest at much higher rate as we start to see TCE coming back. So, we kind of see a path of a longer expansion as long as the rates market remains constructive for us, which is somewhere where we are sitting at the moment, a little bit higher, a little bit lower, but thereâ\u0080\u0099s still additional expansion to come. I was actually thinking, I was thinking itâ\u0080\u0099ll be tenure when I said kind of mid-teens, so thatâ\u0080\u0099s actually tenure of it. Obviously, thereâ\u0080\u0099s some seasonal benefits there, but just curious, the pulse of your local economies from your perspective. I mean, I think all the economies in our jurisdictions are actually doing quite well. So obviously, the fourth quarter came in sort of late November, Thanksgiving through December is actually really busy. Weâ\u0080\u0099ve sort of -- have a whole new type of reinsurance company over the last 5 to 10 years, life reinsurers. Cayman is doing very well, so expanding population growth, lots of new people sort of setting up there, and the Channel Islands is doing quite well as well. Weâ\u0080\u0099ve talked in the past, we havenâ\u0080\u0099t seen any credit stress at this point, but weâ\u0080\u0099re keeping an eye on it as rates go up. And maybe to the point on credit, it was great to see the decrease in non-accruals. Obviously, weâ\u0080\u0099re not seeing anything significant. And then just curious on your mortgage clients, and how theyâ\u0080\u0099re holding up with higher rates on those floating rate mortgages and your approach to working with those borrowers that may be struggling more, and whether thereâ\u0080\u0099s just anything on the credit front that youâ\u0080\u0099re watching or maybe concerned about at this point. So, thatâ\u0080\u0099s kind of come off the books. So, that was a very positive development in regards to our credit loan book, during the quarter. And something that we necessarily wouldnâ\u0080\u0099t see -- expect to reoccur, but that will settle and that was paid down. And then just going forward, in Bermuda in particular, the credit risk management team has been working really, really hard to get a good understanding of clientsâ\u0080\u0099 experiences, the potential impacts on loan affordability or payment affordability of loans, as the interest rates have increased over 2022. And so far, we havenâ\u0080\u0099t seen anything come through, no indications of any decreases in credit quality. So, no missed payments, kind of not seen anything unusual when it comes to missed payments or days past due. And itâ\u0080\u0099s a different market in the sense that we -- as you know, we donâ\u0080\u0099t do credit scoring. So, we actually -- in both Cayman and Bermuda, we actually know each property. So when someone is getting into trouble and struggling a bit, where weâ\u0080\u0099ve got our arms around it, we actually know how to restructure it. So, itâ\u0080\u0099s such small -- there is such small places that I think we get intelligence very early when certain borrowers are struggling, but we are just not seeing at this point, irrespective of Christmas, which is very important in the islands. Just curious, it sounds like we might be getting some revenues here in the first quarter. So yes, teams are working very diligently on pushing both the consents through the systems of any client consent in order to actually do the due diligence, and thatâ\u0080\u0099s going pretty well, a little bit slower, a lot of questions from clients around, hey, whatâ\u0080\u0099s this all, and so needing to explain whatâ\u0080\u0099s happening. Once we stop the DD process, we have sort of a checklist for fiduciary and for obviously any flags that we see on the file. Thereâ\u0080\u0099s still a few moving pieces I can -- itâ\u0080\u0099s not going to be material, but it is -- itâ\u0080\u0099s obviously helpful both for the Singapore entity, and itâ\u0080\u0099s helpful for a fee income, as a whole. So, weâ\u0080\u0099ll definitely come back, at the end of the quarter when we have certainty around the closing population, and talk a bit about what the pipeline is as well. I think, overall, the dealâ\u0080\u0099s still within the stated parameters. The clients are -- some of them are fantastic trust clients, and thereâ\u0080\u0099s a lot of additional opportunity for us to look at going forward. There are some, and thatâ\u0080\u0099s been put to sort of an arbitration committee to kind of discuss, and figure out whether we reject or whether thereâ\u0080\u0099s some way that we could take them on within a conditional way. So, I think, overall, itâ\u0080\u0099s going well. There are some great clients, and Michael and I have been on early calls in Singapore talking to some of the families, talking through the process, and what they can expect to happen. So, very pleased with the quality, very pleased with the way that Credit Suisse has cooperated as well during this process. Theyâ\u0080\u0099ve obviously got a lot going on, but I think they -- very committed to getting this done with us, and so thatâ\u0080\u0099s been very helpful as well. So financials, like, itâ\u0080\u0099s a little earlier still, thereâ\u0080\u0099s still some moving pieces, but weâ\u0080\u0099re definitely keen to come and talk about the next quarter. I think, weâ\u0080\u0099re really happy about the quality of the client. So, I think what you -- what weâ\u0080\u0099re seeing is generational wealth in Asia. So the source of funds is pretty straightforward, because you can see industrial companies going down through generations. It takes a long time to move trust, itâ\u0080\u0099s laborious. I had a quick follow-up on I guess your M&A pursuits and interest, just -- I know itâ\u0080\u0099s -- you guys have been spending a lot of time doing this due diligence. So, the answer is weâ\u0080\u0099re still interested and these things have a -- tend to have a long gestation period and they tend to be a few curve balls, as you go through the negotiations. And then, itâ\u0080\u0099s another year to kind of get that team set up and integrate. So, in terms of just having conversations and making that pipeline work, and there are still some great opportunities for us out there both in Singapore, but also in our other jurisdictions, where I think coming out of COVID, some of the bigger franchise banks are looking at that business as a complex, low growing business in small places. So, we are paying up to 8 times EBITDA pre-synergies in market, maximum outlay of $50 million. Now if something big did come along, we would obviously take a look at it. So smaller acquisitions, we can get our arms around it, we can integrate it, and itâ\u0080\u0099s accretive with the high ROEs that we are posting at the moment. Obviously, the hurdle rates for the IRRs for the deals are still at 15%, but they got to be at a certain 15% in order to be accretive. And so, these things -- these are not financial acquisitions, that are kind of strategic moves for the sellers and for us. And maybe they end up going away and coming back again, who knows. And for the margin outlook, you guys talked about you expect a little bit of expansion still. It seems like in Q1, but whatâ\u0080\u0099s the trajectory over the rest of 2023, assuming we get maybe another 50 basis points of hikes or something from the Fed. So we would see it as -- the drivers of the NIM expansion really are, as you correctly said, you see a moderation in the loan, both in terms of new originations are starting to moderate at higher rates. But retail loans, on the exit run rate is still up a fair bit for us. Whatâ\u0080\u0099s going to kick in, in a more meaningful way for us is the re-laddering of the cash as we see deposit stabilization. The exit run rate on the cash is pretty low, but itâ\u0080\u0099s definitely getting there in terms of just the T-bills rolling over. And then deposit costs, we would expect them to moderate in terms of cost for now, but it just depends on what the market then does. Obviously, thatâ\u0080\u0099s where we have the -- this is the first rate cycle we have done since the ABN acquisition in sterling in the Channel Islands. And as you can see on the asset sensitivity with another 100 basis point, even 200 basis points, we are not expecting -- we are expecting moderation in the asset sensitivity but not flat lining, if that makes sense."
}