{
    "symbol": "TK",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-13 13:33:07",
    "content": "  Operator: Welcome to Teekay Corporation's First Quarter 2021 Earnings Results Conference Call. Before we begin, I'd like to direct all participants to our website, www.teekay.com, where you'll find a copy of the first quarter of 2021 earnings presentation. Teekay's President and CEO, Kenneth Hvid; and Teekay's CFO, Vince Lok will review this presentation during today's conference call. Additional information concerning factors that could cause actual results to materially differ from those in the forward-looking statements is contained in the first quarter of 2021 earnings release and earnings presentation available on our website. Good morning, everyone, and thank you for joining us today for Teekay Corporation's first quarter 2021 earnings conference call. Before I hand the call over to Kenneth, I will briefly review our financial results for the first quarter of 2021, starting with our recent highlights on slide three of the presentation. In the first quarter, we reported consolidated adjusted net income of $11 million or $0.11 per share, up from $3 million or $0.03 per share in the prior quarter. We also generated total adjusted EBITDA of $202 million, up slightly from the previous quarter. Compared to Q4, we recorded higher results in each of our entities, supported by our large portfolio of long-term contracts in our gas shipping business, higher spot tanker rates in our oil shipping business and higher revenues from our marine services business in Australia. Looking ahead, we are expecting the second quarter to be lower than the first quarter, mainly due to a heavy dry dock schedule in both our gas and tanker fleets, certain non-recurring items in the first quarter and the recent expiration of fixed rate charters in our tanker fleet that were locked in last year at higher rates. For guidance on our second quarter results, please refer to the appendix of this presentation. Since reporting earnings in February, we have made significant positive progress towards the strategic objective of winding down our FPSO segment, which we expect will result in a material reduction in our total asset retirement obligations in the second quarter. Over the last couple of quarters, we discussed our ESG strategy and we are now excited to have published our 11th consecutive Teekay Group sustainability report last month, which aligns with global frameworks such as GRI and SASB. As highlighted last quarter, we have successfully completed phase one of our decommissioning project with net costs below budget. If you look at our liquidity at March 31, of $183 million, I think that's actually slightly higher than what it was at December 31. In terms of your second question, yes, we did receive some additional or generate additional revenue from our marine services business in Australia which is a big part of that increase to $4 million this quarter. About $3.5 million of that is, I would call more nonrecurring because it was a completion payment relating to an end of a successful project."
}