{
    "symbol": "TK",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-04 15:48:03",
    "content": " Please note that due to the pending merger between Teekay LNG and Stonepeak, we are strictly limited in our ability to comment on the planned transaction and therefore, we will not be holding a Q&A session after the call today. Good morning, everyone and thank you for joining us today for Teekay Corporation’s third quarter 2021 earnings conference call. Looking ahead and viewing the Teekay consolidated entity in its current configuration, we are expecting our fourth quarter results to be better than the third quarter mainly due to improving spot tanker rates and fewer dry docking days for both our gas and tanker fleets, partially offset by higher vessel operating expenses mainly due to timing of repairs and maintenance. As announced on October 4, TGP and Stonepeak entered into a merger agreement, whereby Stonepeak will acquire all the issued and outstanding common units and general partner units for $17 per unit in cash, representing an enterprise value of $6.2 billion and common unit equity value of $1.5 billion. Teekay Parent will be selling its entire position in TGP, including our GP interest for gross proceeds of approximately $640 million. In addition, as part of the transaction, Teekay will transfer the ownership of various management services companies that currently deliver the operations for TGP and certain of its joint ventures, along with various personnel, while maintaining the required industry leading capabilities for the remaining Teekay Group. The merger can remain subject to certain other closing conditions, including approval by the holders of a majority of TGP’s outstanding common units. Turning to Slide 4, I’ll comment on TGP’s pending merger with Stonepeak and the key transaction highlights. Since TGP’s IPO 16 years ago, we have built TGP into the world’s third largest independent LNG carrier owner and operator with one of the largest and most diversified portfolios of long-term contracts with leading players in the LNG industry. In this context, and as Vince mentioned earlier, Stonepeak has agreed to pay $17 per unit or unit equivalent in cash plus the quarterly distribution of approximately $0.29 per unit, which will be paid on November 12 to unitholders on record on November 5. Including this quarterly distribution, the price paid equates to a 10.2% premium to TGP’s closing price on October 1 and 19.5% premium to the 180-day volume-weighted average price. We believe this transaction represents a unique opportunity for us and other TGP common unitholders to monetize our existing investments in TGP at an attractive valuation, which was achieved through a broad competitive process. Acting on the recommendation from TGP’s Conflicts Committee comprised solely of independent Board members, the TGP Board of Directors unanimously approved the transaction and recommend that all unitholders vote in favor of the merger, with both the TGP Conflicts Committee and the TGP Board of Directors having received fairness opinions from their respective financial advisors. The TGP Corporation Board of Directors also unanimously approved the transaction, and we have signed a voting and support agreement with Stonepeak to vote our 41% common unit precision in TGP in favor of the merger. Lastly, this transaction transforms Teekay’s balance sheet and gives us the financial flexibility in dry powder to pursue future opportunities, which I will touch on in more detail later in this presentation. Since the beginning of the year, our sum of the parts value has increased from $208 million or $2.06 per share to $464 million or $4.57 per share post-merger, which is an increase of $256 million or $2.51 per share, representing a 122% increase. The increase is mainly due to the pending TGP-Stonepeak merger, which post transaction and after giving effect to our anticipated use of merger proceeds to repay debt, will result in Teekay Parent being completely debt-free with a cash position of about $325 million. The 122% increase also reflects the elimination of our $33 million asset retirement obligation, or ARO, associated with the Banff FPSO and its field in the second quarter and TNK’s year-to-date stock appreciation. And we continue to have a positive outlook for our tanker business with attractive supply and demand fundamentals going forward with TNK’s President and CEO, Kevin Mackay, will discuss in more detail during TNK’s earnings conference call following this call. Based on the sum of the post-merger, we are currently trading 18% discount as of yesterday’s closing share price of $3.74 per share. And we also have a long history of expanding into new shipping sectors, bringing substantial value to an existing platform through Teekay’s financial strength, long-standing industry relationships and core competency of scaling and optimizing businesses. And while we believe that oil will remain an important component of the world’s energy mix for many decades, we also see that the increasing focus on greater energy diversification and lower emissions will bring our – will bring other interesting opportunities where Teekay’s unique capabilities and profile could be a meaningful competitive advantage. With an existing operational franchise, industry-leading capabilities and greater financial flexibility, following completion of the pending TGP transaction, we believe that we will be well positioned to take advantage of future opportunities to create long-term shareholder value."
}