{
    "symbol": "DUOT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 21:30:03",
    "content": " Operationally in Q4, we successfully deployed two new RIPs for Class 1 customers with at least two additional RIPs expected to come online in 2023, putting us on track to have a total of 15 RIPs installed by the end of the third quarter 2023. Before turning the call over to Andrew, I'd like to thank our current customers, which represent 50% of the Class 1 operators in North America, not only for their business, but also for their leadership in identifying the value that can be brought to bear on safety and efficiency on the rail network by the deployment of improved wayside detection technologies, which includes our railcar inspection portal. From my perspective, as we chart the course for the company financially, we now have many different potential avenues for driving new sources of revenue, including sales of complex systems, which is our traditional business model, the  announced subscription program for which we plan to make significant investments in the next several years and other opportunities which may include other lines of business. On that point, we previously introduced an additional business line focused on subscription offerings in which Duos will 100% own and operate our railcar inspection portals as strategic locations within the North American rail network. The improvement in margin was a direct result in the increased business activity that we recognized in the latter half of 2022 that was related to the manufacturing and near completion -- of installation of the two new RIPs, a number of one-time service events and significant progress made on the previously mentioned special purpose high value RIP. At the end of 2022, the company's contracts and backlog represented approximately $10.7 million in revenue, of which approximately $8.4 million is expected to be recognized in calendar year 2023. I'm pleased to report that as of the end of 2022, the company has turned the corner on all of these major issues and is now executing at a high level and capable of tackling much larger and more complex projects such as the installation of two complex RIPs capable of automated mechanical inspection of high speed passenger trains at up to 125 miles per hour on the Northeast rail Corridor between New York and Washington DC. As a reminder, our operating strategy is focused on the following: number one, managing our technical and operational delivery at the high standards, which is now being achieved; adding much more recurring revenue through our subscription model, support services and maintenance, and artificial intelligence offerings; three, continuing our primary commercial focus in the rail sector; and four, adding a second commercial line of business, primarily focused in the trucking and intermodal industry and potentially in the aviation industry."
}