{
    "symbol": "DUOT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 22:22:17",
    "content": " With respect to the results just reported, total revenue for Q2 2022 increased 458% to $3.62 million compared to $649,000 in the second quarter of 2021. Total revenue for Q2 2022 represents an aggregate of approximately $2.78 million technology systems revenue and approximately $837,000 in recurring services and consulting revenue, which is the highest amount of quarterly recurring revenue in the company's history. The increase in total revenue for Q2 2022 compared to Q2 2021 was driven by the production and startup installation of new and upgraded railcar inspection portals, which are recorded in the technology systems portion of the business. The increase in total revenue was driven by the start of production and new installations in the Technology Systems portion of the business, along with continuing increases in services and consulting revenues, which were driven by receipt of notices to proceed for new contracts earlier in the year. The length of time between contract award and revenue recognition is extending by one what has been the norm due to the fact that our installations have been impacted by the ongoing supply chain issues, which is a familiar theme for many companies, we also observing the increasing impact of inflation on components and contracted services on our cost structure, which we are taking steps to mitigate, but which may still have an impact going forward. Cost of revenues for Q2 2022 increased 154% to $2.33 million compared to $918,000 for Q2 2021. Improvement in net operating loss for Q2 2022 compared to Q2 2021 was driven by higher revenues recorded in the quarter, resulting from increases in both the company's Technology Systems and services and consulting revenues, slower growth in the cost of those revenues and flat operating expenses. As a reminder, our 2022 operating strategies focused on five key areas as follows: one improve our technical and operational delivery, which will make satisfied customers with more equipment and services; two, add more recurring revenue through our services, maintenance and artificial intelligence offerings; three, continue our primary commercial focus in the rail sector, adding more value to existing customers, adding new customers in the Class 1s passenger rail, and we'll discuss car owners themselves a little bit later in the brief. From a high level as we layer on additional services, increased maintenance work across a larger customer base, and improve the quality, complexity and applications for artificial intelligence offerings, we expect to achieve consistent profitable growth that we will see our recurring revenue stream serve as a fixed springboard for operations that accounts for an increasing percentage of our revenue."
}