{
    "symbol": "AHT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 15:06:04",
    "content": " On the call today will be Rob Hays, President and Chief Executive Officer; Deric Eubanks, Chief Financial Officer; and Chris Nixon, Executive Vice President and Head of Asset Management. At this time, let me remind you that certain statements and assumptions in this conference call contain or are based upon forward-looking information and are being made pursuant to the Safe Harbor provisions of the federal securities regulations. In addition, certain terms used in this call are non-GAAP financial measures, reconciliations of which are provided in the company's earnings release and accompanying tables or schedules, which have been filed on Form 8-K with the SEC on February 21st, 2023, and may also be accessed through the company's website at www.ahtreit.com. Also, unless otherwise stated, all reported results discussed in this call compare the fourth quarter and full year ended December 31st, 2022 with the fourth quarter and full year ended December 31st, 2021. After my introductory comments, Deric will review our fourth quarter and full year financial results and Chris will provide an operational update on our portfolio. The main themes for our call today are; first, we saw ongoing RevPAR improvement in the fourth quarter versus 2019 and expect continued strength through the first quarter of 2023. We ended the quarter with approximately $519 million of net working capital, which equates to approximately $14 per diluted share. With yesterday's closing stock price of $5.69, we believe we are trading at a meaningful discount to both our net asset value per share and our net working capital per share. Importantly, we believe this offering will provide an attractive cost of capital and allow us to accretively grow our portfolio over time, subject to future market conditions. We believe access to this growth capital is a significant competitive advantage, particularly given the fact that lodging REITs are currently trading at material discounts to their net asset values. To the extent we are successful with our non-traded preferred capital raise, our preference would be to use that capital for future growth, though we may also use some of the capital to pay down debt as needed. We are still very early in the capital raising process and to-date, we have issued approximately $4 million of gross proceeds. This RevPAR result equates to a decrease of approximately 1% compared to the fourth quarter of 2019, which is the best performing quarter versus 2019 in several years. We've already made great progress on this front with our recent refinancing of the loan secured by the Le Pavillon hotel, the extension and modification of the loan secured by the Hotel Indigo Atlanta, and the extension and modification of the JPMorgan Chase eight-hotel loan. While we feel well-prepared for the remaining upcoming extensions tests, there may be situations where we have loan balances that exceed the current market value of the underlying hotels. If those situations arise, we may give assets back to lenders or allocate additional capital with a focus to maximize value for our shareholders. Looking ahead, we believe our geographically diverse portfolio, consisting of high-quality assets with best-in-class brands and management companies is well-positioned to capitalize on the strong demand we are seeing across leisure, business, and group segments. Remington has been able to consistently manage costs and optimize revenues aggressively, enabling us to outperform the industry from an operations standpoint for many years. Additionally, capital recycling remains an important component of our strategy and we continue to pursue some opportunities to sell certain non-core assets. Turning to Investor Relations, we continue to have a robust outreach effort to get in front of investors, communicate our strategy, and explain what we believe to be an attractive investment opportunity in Ashford Trust. This plan includes continuing to grow liquidity across the company, optimizing the operating performance of our assets, improving the balance sheet over time, and looking for opportunities to invest and grow our portfolio. We ended the fourth quarter with a substantial amount of cash on our balance sheet and with the launch of our non-traded preferred stock offering, we are excited about the opportunities we see in front of us. For the fourth quarter, we reported a net loss attributable to common stockholders of $60.2 million, or $1.75 per diluted share. For the full year, we reported a net loss attributable to common stockholders of $153.2 million or $4.46 per diluted share. For the quarter, we reported AFFO per diluted share of $0.16, compared to a loss of $0.09 per diluted share in the prior year quarter, and for the full year, we reported AFFO per diluted share of $1.85 compared to a loss of $1.23 per diluted share in the prior year. Adjusted EBITDAre for the quarter was $69.1 million, which reflected a growth rate of 70% over the prior year quarter. Adjusted EBITDAre for the full year was $287.3 million, which reflected a growth rate of 153% over the prior year. At the end of the fourth quarter, we had $3.8 billion of loans with a blended average interest rate of 7.2%, taking into account in-the-money interest rate caps. Considering the current levels of LIBOR and SOFR and the corresponding interest rate caps, 100% of our debt is now effectively fixed as all of our interest rate caps are now in-the-money. In anticipation of these extensions, last year, we purchased forward starting interest rate caps as a hedge against these future purchases. If interest rates remain elevated, the value of these pre-purchased caps should help defray the costs of any new caps we need to purchase. On the capital markets front, during the quarter, we successfully refinanced a mortgage loan secured by the 226-room Le Pavillon Hotel in New Orleans, Louisiana, which had an extension test in January 2023. The new, non-recourse loan totals $37.0 million, the same loan amount as the previous loan, and has a two-year initial term with three one-year extension options, subject to the satisfaction of certain conditions. Additionally, during the quarter, we modified and extended the mortgage loan secured by the 141-room Hotel Indigo Atlanta in Atlanta, Georgia which had an extension test in December 2022. As part of this extension, we made a small paydown of the loan and the interest rate was changed from LIBOR plus 2.25% to SOFR plus 2.85%. Additionally, subsequent to the end of the quarter, we successfully modified and extended our $395 million JPMorgan Chase eight-hotel loan. As part of this extension, we made a $50 million principal paydown and reduced the 2024 debt yield extension test from 9.25% to 8.50%, giving us significantly more flexibility for the next extension. And with our significant cash balance and continued improvement in hotel operations, we believe we are well-prepared to meet any potential loan paydowns required to meet those tests. Our property-level hotel loans are all non-recourse to the company and currently 79% of our hotels are in cash traps, which is down from 85% last quarter. Importantly, during the quarter, the Marriott Gateway and KEYS Pool D Portfolio loans came out of their respective cash traps and approximately $9 million of cash that had been trapped was released to corporate after quarter end. As the remaining properties recover and meet the various debt yield or coverage thresholds, any trapped cash will be released to us and we will be able to utilize that cash freely at corporate. At the end of the fourth quarter, we had approximately $34 million in these cash traps, which is reflected in restricted cash on our balance sheet. At the end of the quarter, we also had $22 million in due from third-party hotel managers. This primarily represents cash held by one of our property managers, which is also available to fund hotel operating costs. As Rob mentioned, I think it's important to point out that this net working capital amount of $519 million equates to approximately $14 per share. This compares to our closing stock price from yesterday of $5.69, which is an approximate 60% discount to our net working capital per share. This is attractive capital for us that can be used for acquisitions, debt paydowns, or other corporate purposes, and we look forward to reporting back on our progress. Our share count currently stands at approximately 36.2 million fully diluted shares outstanding, which is comprised of 34.5 million shares of common stock and 1.7 million OP units. In the fourth quarter, our weighted average fully diluted share count used to calculate AFFO per share included approximately 1.7 million common shares associated with the exit fee on the strategic financing we completed in January 2021. Assuming yesterday's closing stock price, our equity market cap is approximately $206 million. While we are currently paying our preferred dividends quarterly, we do not anticipate reinstating a common dividend for some time. Our cash balance is solid, we have an attractive maturity schedule, our non-traded preferred security offering is effective, and we believe the company is well-positioned to benefit from the improving trends we are seeing in the lodging industry. For the quarter, our portfolio recovered 99% of its RevPAR relative to the fourth quarter of 2019. During the fourth quarter, 38% of our urban assets exceeded their 2019 RevPAR. For comparison, only 10% of our urban assets exceeded 2019 RevPAR levels during the first quarter of 2022. Our other department revenue, which includes valet, spa services, corner pantries, and more, increased19% on a per occupied room basis to 2019. Within our urban hotels, other departmental revenues per occupied room in the fourth quarter increased 24% relative to 2019. An example of this success was demonstrated at The W Atlanta, where we utilized services such as parking, spa, and in-room entertainment to propel fourth quarter other revenues 34% above comparable 2019 levels. During the fourth quarter, our portfolio exceeded group room revenue relative to the same time period in 2019 by 2%, and we continue to see acceleration from this segment. Our long-term group momentum shows encouraging signs, with group forward bookings during the fourth quarter exceeding the previous three quarters. Collectively, these 20 record-breaking hotels exceeded their previous comparable hotel EBITDA records by 17%. During the fourth quarter, we had assets in Atlanta, Philadelphia, Baltimore, Las Vegas, Washington D.C., Denver, and New York exceed historical highs in addition to various leisure markets. Moving on to capital expenditures, we've noted in previous calls how we have taken a proactive approach to renovating and repositioning our hotels. Before moving on to Q&A, I would like to reiterate how encouraged we are about the recovery of our portfolio and the industry as whole. Each quarter this year has shown improvement, with many of our hotels already outpacing their 2019 performance. During the fourth quarter, 41% of our hotels exceeded their comparable hotel EBITDA for 2019, which is an increase over the 11% achieved during the first quarter. After meeting with our various partners throughout the budgeting process, we are optimistic about our portfolio's position to capitalize on the industry revitalization. Please proceed with your question. There's been a lot of discussion so far this earnings season about your margins, cost structure. What are you seeing in terms of wages, incremental costs, and I know as we look 2023 versus 2022 is certainly pretty favorable calm earlier in the year, but on the margin performance you put up kind of Q3, Q4 compared with 2019, I mean do you think that's sustainable next year? I think when we look at that, the thing we're encouraged most about this portfolio is it still has quite a bit of runway ahead of it in terms of its recovery. From a labor standpoint, right now, we're at about 45% of pre-COVID staffing levels. And one other data point I'd say, Tyler, is we historically speaking, typically talked about EBITDA flows and always try to target kind of 50% EBITDA flows across our asset management team and our property managers that we work with. For the fourth quarter, I think our EBITDA flows were around just over 40% -- 41%, 42%, which is -- I thought, a pretty strong result given the headwinds that they're facing. And so, I think that's probably more consistent with what we're going to continue to try to achieve is can we keep it in that 40% or higher range, but we'll see. Just because it's bigger, it's little more complicated, it's got different tranches. Fortunately, for both of those loans, they will be on the back side of the first quarter. So, we'll obviously lap the weak first quarter of 2022 as most of these extension tests are TTM tests. So, getting rid of the first quarter last year is very, very helpful in sizing up any potential paydowns on those tests. And as we continue to see numbers improve, I think the -- it's likely the -- I think the Highland paydowns are probably fairly small, hopefully less substantial than what we saw with our JPMorgan 8-Pool. Thankfully, we don't have a lot of final maturities this year, so we don't need to be in the market seeking much debt financing. Hopefully, as we progress through the year and the market gets some visibility on what the Fed is going to do with interest rates, we'll start to see spreads come down to where it can be a little bit more attractive to get debt financing. And because obviously, we've got a lot of maturities that we will have to address in the outer years and we want to get in front of those. Please proceed with your question. Well, I mean, there's, I guess, a subjective aspect as you're trying to distill things down into a quantitative decision. But at the end of the day, it's still going to come down to financial decisions. I mean we -- we've been through situations in our past, whether it's through the financial crisis or the early stages of COVID, where we work with lenders, try to come up with solutions in order to try to keep assets alive and going. So, I think that's what we look at. Because we have some assets that you're right, they're willing to keep only because you see some longer term upside after an effective CapEx program or something. And I think what we try to do is do a rebuy analysis, where we just pretend like we were going to -- this capital that we're putting in is what it would cost to take down the asset and would we do that today given what we see and how we underwrite it. And you hope that those work because you're working in good faith, but sometimes the math is what it is, and the situation is what it is, and you have to give it back. So, it's a little bit more of a complicated structure, even though each pool in its own right is still treated as a separate pool. So, there's just some, I guess, complexity around that where something like that, I think, is technically possible but I would find breaking up maturity dates and change in maturity date is probably less likely as an outcome. I think it's more of -- we'll look at each of those six pools, what to see where we see value, look where the CapEx is over the next few years. So, we'll -- we've got views around what we think those are given different variations of forecasts and we'll talk to the lenders about those and see if we can't come to a situation that works for everybody. I probably -- Deric, I think you mentioned that the cash trap was released on the Pool D. And it looks like the net income yield on that is the highest, but the EBITDA yield is actually higher in the e-pools. For the cash trap, it's typically an NOI, which -- the EBITDA that we show in our earnings release is before deducting an FF&E reserve. And so, the NOI debt yield is calculated after deducting an FF&E reserve, and that's what's determinative when calculating the cash traps. Please proceed with your question. So, we've currently got about $196 million outstanding on it that's been paid down some from an asset -- proceeds from an asset sale. If we were to pay that down, we would still have access to the additional $250 million that's available, it's obviously expensive capital, and we'd rather not draw that if we don't need it, but it's there if we ultimately do need it. And look, in terms of plans for paying that down, I think we'll just have to see how the year progresses. But then also, we knew we would be facing these extension tests and there was some uncertainty and there still is some uncertainty in terms of the cash that will be needed to meet those extension tests. So, I think once we get past this round of extension tests, we'll probably have some more clarity. We also would like to see how this capital raise ramps up from our non-traded preferred, which we're still very early days on. I would just say, in my mind, it's really just dependent upon three different things. Right now, we're not seeing that, but that's always a little bit of a risk. To the extent that the debt markets can heal up a little bit, then it's -- we've also either have the ability to potentially refinance them out at a lower spread or had some alternatives around maybe another structure that's materially cheaper. If this capital continues to accelerate as we're hopeful it might be able to, then there could be also some proceeds that give us some cushion to be able to deploy cash to pay it off. So, there's just a few of these moving pieces that we'll see over the next months to come that will kind of determine I think, how quickly paid off. And we've got the cash to do it right now, but we just think it's prudent to pull a lot of that cash until we have some more clarity on these items. But on some of these where we think it's questionable whether it's value or not, then yes, they're out in the market right now. Yes, it's really difficult to quantify because there's a lot of factors that go into that pricing. A, it's a strike price or whatever the cap -- the strike of the cap needs to be, it's what's the market's forward expectation for where rates are going and then it's the duration of how long that cap needs to be in place for. And my hope is that -- well, look, I guess the real help is that those expire worthless, so we didn't need them and the rates have come down, but if rates stay high, then we would hope that those pre-purchased caps offset the value of any new cap that we would divide. So, that's really all I can say in terms of giving any sort of guidance in terms of what those costs will be going forward."
}