{
    "symbol": "WCN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 13:15:27",
    "content": " Our 50 basis points year-over-year decline in adjusted EBITDA margin in the quarter included 90 basis points combined margin impact, as expected, from $10 million of COVID-related frontline support in January and acquisitions completed since the prior year period. We are on track to meet or exceed our full year adjusted free cash flow outlook of $1.15 billion and the elevated cadence of solid waste acquisition activity has continued with approximately $175 million in annualized revenue year-to-date, confirming our expectations for another outsized year of such activity. Thank you, Mary Anne. And finally, on E&P waste activity, we reported $40.8 million of E&P waste revenue in the first quarter, up 65% year-over-year and up 19% sequentially from Q4 on a pickup in activity during the quarter from increased drilling as well as remediation jobs primarily in the Permian Basin. Organic growth was 10% in the quarter, and acquisitions completed since the year ago period contributed about $112 million of revenue or about $110 million net of divestitures. Normalizing for this unique supplemental expense and the margin dilutive impact of acquisitions, adjusted EBITDA margin would be 31.4%, up 40 basis points year-over-year. Fuel expense in Q1 was about 4.0% of revenue, up about 70 basis points year-over-year, including the benefit from hedges on about half of our fuel purchases, mitigating the impact of higher prices. Finally, we delivered adjusted free cash flow of approximately $320 million or 19.5% of revenue in Q1, up 10.6% year-over-year in spite of capital expenditures up over 55%. Thank you, Mary Anne. But also, you got to remember, looking in about 8% inflationary environment, if all the company does is recover the dollar impact of that, that's about 140 basis points dilutive to margins. And as we look ahead to Q2, the number steps up from the 80 basis points we got in Q1, it goes higher in addition to core going higher, which is the other part of the strategy, since we've used higher core recover all different cost pressures, including fuel in some markets. And so first, in the exclusive markets where we're CPI-linked you should expect that the 4% we're getting this year steps up next year, as I mentioned earlier, since it's typically a look back to the midpoint of the prior year. So whether that number 5% or north of that next year remains to be seen, but it's certainly directionally higher and provides a boost to the overall reported pricing -- the other thing that we'll keep in mind is it depends on where we exit the year, right, because the rollover impact, the price increases we do this year will impact next year."
}