{
    "symbol": "WCN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 12:27:17",
    "content": " Most notably, we overcame 50 basis points in incremental headwinds primarily from the precipitous decline in recycle commodity values in September, to beat our outlook and expand adjusted EBITDA margin both sequentially and on a year-over-year basis, excluding the dilutive impact from acquisitions completed since year ago period. Our outperformance through the third quarter and acquisitions close year-to-date enhance our visibility for expected double-digit revenue and adjusted free cash flow growth in 2023, led by pricing expected to remain at elevated levels, plus contributions from acquisitions already signed or closed year-to-date. Thank you, Mary Anne. Moving next to revenues from recycled commodities, excluding acquisitions, recycle commodity revenues were down almost 35% year-over-year, reflecting a sequential decline from Q2 of 30% or about twice the magnitude anticipated given the precipitous decline in recycled commodity values in September. And finally, looking at E&P waste activity, we reported another sequential increase in E&P waste revenue to $53 million in the third quarter, up 52% year-over-year. First, on a sequential basis, at 31.3% adjusted EBITDA margin was up 10 basis points as compared to Q2, in spite of a $20 million quarterly step down in recycled commodity revenues. These increases were offset by 150 basis points combined margin drag from lower recycled commodity values of 90 basis points and an additional 60 basis points headwind from higher fuel costs, net of the CNG tax credit catch up through Q3 of about $3 million. Adjusted EBIT margin of 18.7% was 10 basis points above our outlook and up 20 basis points year-over-year, even including the margin dilutive impact of acquisitions. Year-to-date, we've delivered adjusted free cash flow of $929 million, or 17.4% of revenue, up 12.5% year-over-year in spite of capital expenditures up $139 million, or 29% year-over-year. Adjusted EBITDA in Q4 is estimated at approximately 30% of revenue or about $553 million, which includes an expected 30 basis point margin dilutive impacts from acquisitions already completed. Thank you, Mary Anne. We continue to have visibility for double-digit revenue and adjusted free cash flow growth in 2023, led by continued elevated solid waste pricing levels, plus over 4% from acquisition signed or closed thus far this year with the potential for that amount to grow to more than 5% by early next year based on our current acquisition pipeline. Moreover, we expect above average underlying margin expansion to overcome headwinds from recent decrease in recycled commodity values and to the extent that we're seeing any improvement in recycled commodity values or easing of inflationary pressures during the year, those impacts along with additional acquisitions completed throughout the upcoming year will provide upside to these preliminary thoughts. You may now go ahead. You may now go ahead. You may now go ahead. So starting with the expected impact next year at current pricing, depending on the ultimate flow through to the bottom line from these declines, you could see that it's anywhere from, call it, 70 basis points or 80 basis points margin hit to 100 basis points. And from a seller standpoint, look, it's an interesting time to have a dialogue because the strong management teams that are at these companies when they see a decline in commodities like this, we know they're out there putting out another 200 basis points to 400 basis points of price because they're running their business, as you would hope they'd be running their business that's why we call these gold plated companies. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead."
}