{
    "symbol": "WCN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 11:08:10",
    "content": " Solid waste pricing growth of 8.8% in Q2 enabled us to overcome increased inflationary pressures during the period and deliver adjusted EBITDA margin in line with our outlook and flat year-over-year, excluding the margin dilutive impact from acquisitions completed since the prior year period. Our outperformance in the first half of 2022, expected further sequential increases within solid waste pricing growth, continuing strength in E&P waste activity, and acquisitions closed year-to-date, position us to increase our full year outlook for revenue, adjusted EBITDA and adjusted free cash flow and provide another reflection of our culture of accountability in a challenging operating environment. Thank you, Mary Anne. Moreover, we are set up for a 100 basis point sequential increase in pricing growth in Q3 to almost 10%, primarily from higher core pricing as we recognize the full quarterly impact of increases already put in place during Q2 and early Q3. Looking at Q2 revenues from recovered commodities that as recycled commodities, landfill gas and renewable energy credits, or RINs, excluding acquisitions, collectively, they were up about 14% year-over-year, due to higher values for both recycled commodities and RINs, resulting in a margin tailwind in the period of about 20 basis points. And finally, looking at E&P waste activity, we reported $50.4 million of E&P waste revenue in the second quarter, up 24% sequentially from Q1 and up 62% year-over-year, a margin tailwind of about 40 basis points in the quarter. Increases in drilling activity in multiple basins, led by the Permian, have driven a step-up in quarterly E&P waste revenue of over 40% since year-end 2021 from about $35 million of revenue to our current quarterly run rate of about $50 million in revenue. These transactions are all in solid ways and include West Coast franchises as well as new market entries and tuck-ins spread across competitive markets in the U.S. and in Canada, with another $225 million in annualized revenues in both franchise and competitive markets expected to close during the third quarter subject to customary closing conditions, our activity already exceeds last year's outsized levels and sets us up for over 3% in rollover acquisition contribution next year. Revenue for 2022 is now estimated at approximately $7.125 billion or $215 million above our initial outlook with primary drivers, including higher solid waste price-driven organic growth, plus about $100 million from acquisitions completed since our initial outlook in February. 40 basis points reflects the impact of incremental price increases to overcome higher inflationary pressures, including over 100 basis points from higher fuel and third-party logistics as compared to our original outlook and 10 basis points is from the margin dilutive impact of acquisitions completed since February. Thank you, Mary Anne. We are set up for increasing underlying solid waste margin expansion through the second half of 2022 as escalating price increases offset inflationary pressures and are already well positioned for expected double-digit revenue growth in 2023, along with margin expansion from continuing solid waste pricing strength and rollover contribution from acquisitions already signed or closed year-to-date. And that breaks down to at least 6% as we see it in our franchise markets that, along with the rollover pricing and competitive markets that's already been implemented, again, has us positioned for 5% price at a minimum next year before any other actions are taken in competitive markets. So just to be clear, we're still doing 4.5%, 5% price in, for instance, our West Coast region and next year, to Worthing's point, part of what gives us visibility on our pricing as we already know, that those increases will step up sequentially '23 over '22 because of the inflationary impacts over the prior year. But when I just think about it more broadly, second half of this year versus first half and similar year-over-year margin guidance implied in all those quarters, what's different is in the first half of the year, there was the assist from recycled commodities and RINs, and it tells you that we're getting better underlying solid waste margin expansion in the back half of the year."
}