{
    "symbol": "JNJ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-18 09:52:05",
    "content": " Excluding after-tax intangible asset amortization expense and special items for both periods, adjusted net earnings for the quarter were $6.8 billion and adjusted diluted earnings per share was $2.55, representing decreases of 2.7% and 1.9%, respectively, compared to the third quarter of 2021. Worldwide MedTech sales of $6.8 billion increased by 2.1%, with growth of 7.7% in the US and a decline of 2.9% outside of the US. In the third quarter of 2022, our adjusted income before tax for the enterprise as a percentage of sales decreased from 34.5% to 33.9%, primarily driven by unfavorable currency and commodity inflation impact on cost of products sold. As evidenced by the third quarter, operational sales growth across all three businesses, healthcare as well as our business continues to be rooted in strong fundamentals, despite various macroeconomic pressures. On sales, we are narrowing our base business operational sales range to $97.5 billion to $98 billion or a growth rate of 7% at the midpoint. However, using the euro spot rate relative to the U.S. dollar as of last week at 0.97, there is an estimated negative impact of foreign currency translation of approximately 490 basis points, resulting in an estimated reported sales growth between 1.8% to 2.3% compared to 2021 or $93 billion to $93.5 billion. Your line is now live. Your line is now live. That's what you saw in our Joints business, we were actually up 10% in our knees and our hips in the United States, but we had negative growth in the quarter, really due to the volume-based procurement wins on pricing actions that we'll come through that for next year. Your line is now live. And as we take a look through our pipeline and portfolio between now and then 14 novel therapies filed with potential to exceed $1 billion, and we've got five of which we think actually have potential to exceed $5 billion, so that's products like Novavax vaccine, which is in our partnership with Bristol-Myers Squibb; amivantamab and lazertinib combination, which I mentioned for non-small cell lung cancer that we've got good data coming through; nipocalimab, which is progressing really nicely through the various stages of clinical development. And so I think based on our existing assets and the continued growth, I mean if you take a look at DARZALEX and the results that we just posted quarter, 39% growth, consistent with what we've been seeing as well as growth in assets like TREMFYA, ERLEADA, et cetera. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}