{
    "symbol": "JNJ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 10:23:05",
    "content": " Excluding after-tax intangible asset amortization expense and special items for both periods, adjusted net earnings for the quarter were $7.1 billion and adjusted diluted earnings per share was $2.67, representing increases of 3% and 3.1%, respectively, compared to the first quarter of 2021. Base Pharmaceutical growth was driven by our broad portfolio of products paired with strong commercial execution, enabling us to deliver above-market adjusted operational sales growth, including six assets with double-digit growth in the quarter. DARZALEX continues to drive very strong operational growth with sales increases of 40.3%, driven by subcutaneous formulation penetration and meaningful share gains across all lines of therapy and in all regions. XARELTO sales declined 13.8% in the US, driven largely by a net unfavorable prior period price adjustment and increased cost for patient access, partially offset by continued demand and market growth. The Interventional Solutions franchise delivered another quarter of worldwide double-digit growth at 17.4%, with double-digit growth in both the US and OUS regions, driven primarily by success of new products in electrophysiology, commercial execution and continued market recovery. In the first quarter of 2022, our adjusted income before tax for the enterprise as a percentage of sales decreased from 37.1% to 35.1% due to product mix, commodity inflation, increased brand marketing expense, portfolio progression in R&D and comparisons to gains from prior year divestitures. But to give you a sense of the impact currency may have on potential full year reported results, utilizing the euro spot rate relative to the US dollar as of last week at 1.08, there is an incremental unfavorable currency impact of $1.1 billion on reported sales and an unfavorable $0.25 for reported adjusted earnings per share versus the calculation related to January's guidance. Your line is now live. You're going to see us continue to penetrate fast-growing segments like what we have in neurovascular, as an example, 90% our capital deployment has been to $1 billion or more, but we do intend to make sure that we are well positioned to be in the highest growth end state markets. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}