{
    "symbol": "JNJ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-19 13:27:05",
    "content": " With the positive momentum in this business and our improvement in competitiveness, MedTech has delivered 6% adjusted operational growth in the first half of 2022. We are very pleased to have delivered solid sales and earnings growth through the first half of 2022, reporting adjusted operational sales and EPS growth of 8% and 8.5% respectively. Excluding after-tax intangible asset amortization expense and special items for both periods, adjusted net earnings for the quarter were $6.9 billion and adjusted diluted earnings per share was $2.59, representing increases of 4.3% and 4.4% respectively compared to the second quarter of 2021. Drivers for growth across the MedTech business include procedure recovery, focused commercial strategies and differentiated new products driving enhanced or sustained market share positions in nearly all of our 11 priority platforms, each generating over $1 billion in annual sales. In the second quarter of 2022, our adjusted income before tax for the enterprise as a percentage of sales increased from 33.4% to 34%, primarily driven by favorable product and segment mix, partially offset by inflation and portfolio progression in R&D. In Pharmaceuticals, we continued to advance our pipeline and delivered operational sales growth of 8.6%, excluding the COVID-19 vaccine in the second quarter, notably above what we delivered in the first quarter of this year. In our Consumer Health business, similar to MedTech, Q2 of 2021 was last yearâ\u0080\u0099s strongest quarter with 10% adjusted operational sales growth. Moving to full year 2022 guidance and key considerations, the major takeaway is we are maintaining the midpoints of our guidance for adjusted operational sales growth of 7% at $97.8 billion and adjusted operational earnings per share of $10.70 or 9.2% growth for the full year. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Overall, our MedTech business delivered 6% competitive growth in the first half of 2022 and delivered just over 1% sequential operational growth Q2 versus Q1. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}