{
    "symbol": "REUN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-16 13:46:04",
    "content": "  Operator: Greetings, and welcome to Field Trip Fiscal Third Quarter 2022 Earnings Results Conference Call. Good morning, everyone and welcome to Field Trip's fiscal Third Quarter 2022 financial results conference call. Before we begin the call, I'm obligated to remind everyone that during the course of this conference call, management may be making some forward-looking statements that are based on current expectations and are subject to a number of risks and uncertainties that may cause actual results to differ materially from expectations. Please also note a safe harbor, any outlook we present is as of today, and management does not undertake any obligations to revise any forward-looking statements in the future. I will now turn the call over to Joseph to provide an update on Field Trip, in particular, the discovery business. Field Trip has continued to build its innovative drug research and development programs, as well as deliver high-quality patient services through its best-in-class clinic network. We are proud of the progress our team has made in developing Field Trip into a leading psychedelic assisted psychotherapy provider, and highly recognized brand at the forefront of the psychedelic medicine movement as we further our mission to deliver innovative treatments for patients in need. As a reminder, we commenced this review to ensure that each operating unit is best positioned, optimally resourced, and focused to provide maximum long-term value to all stakeholders. Moving onto Field Trip Discovery, our drug development business. During the quarter, Field Trip Discovery progressed on the development of our lead novel psychedelic compound FT-104. This work is advancing us closer to the development of FT-104 as a more convenient, consistent, and practical psychedelic treatment than is expected to be available through psilocybin and MDMA, should they be approved. FT-104 is a prodrug of 4-HO-DiPT, a psychedelic substance identified by Alexander Shulgin as a fast-acting, intense psychedelic, providing us objective experience similar to psilocybin. FT-104 has improved to drug absorption, more reproducible pharmacokinetic profiles, and improved bio-availability relative to 4-HO-DiPT, making it potentially a superior drug candidate. During the quarter, the company expanded consideration for the Phase 1 trial sites to include Australia, in addition to the Netherlands, to mitigate against possible delays related to regional differences and reactions to the latest COVID surge. As of January, the company finalized agreements with interested parties in Australia to pursue Phase 1 studies and site selection is nearly finalized. One additional pre -clinical study remains to be completed, and the company expects initiation of Phase 1 to commence on the timelines previously disclosed. In early January, we received a notice of allowance for our patent application for claims-related to FT-104 and formerly known as Iso Pro s and . This group has provided potential candidates which are strong 5HT2C agonist, with improved selectivity relative to the serotonin 2B anti - target. Reducing off - target serotonin 2B receptor activity reduces the risk of cardiovascular toxicity, and so allowing for potentially safer medications that would have greater flexibility of dosing, such as allowing frequent or chronic dosing, including microdosing administration. During the quarter, we also filed our first provisional patent application related to the FT-200 Group to protect new chemical compositions, potential formulations, and uses. In less than two years, we have grown Field Trip into a leading operator of psychedelic treatment centers with a well-recognized brand at the forefront of the psychedelic medicine music -- movement. Importantly, we continue to get better and more efficient as we take the learnings from the past 18 months, when we began opening clinics and apply them to all our locations. We've been focused on improving the patient experience, while driving process improvements within our clinical operations. For example, we recently launched from the innovative teen treatment model, which has increased patient capacity within the clinic. We also launched a new digital screening tool to facilitate booking, which has decreased call center costs and improved conversion rates through some of our channels. And combined with our effective marketing activities, these measures have resulted in tracking new patients and driving revenue growth. To that end, we are pleased to report that the third quarter patient services revenues were up 50% sequentially, and more than 300% over the comparative period in the prior year. In addition, we've invested in our digital platform portal to allow Field Trip Health to communicate more efficiently with patients, collect data more easily, and make our processes more efficient. and you may be aware Health Canada recently amended its special access program of the SAP, to enable access to psilocybin and MDMA through the SAP, and we're pleased to announce that we assisted one of our patients to submit one of the first applications in Canada to the SAP. The SAP provides physicians treating patients suffering serious or life-threatening conditions with the ability to request access to drugs that have not been approved for sale in Canada when conventional therapies have failed, are unsuitable, or are unavailable. As the largest provider of psychedelic assisted therapies in Canada, we are uniquely positioned to help Canadians access the SAP for psilocybin and MDMA. The clinics are an important vehicle for us in which we are able to build brand awareness, increase our market share, and continue to earn patient services revenue. To conclude, I want to reiterate that we're very focused on creating value for our shareholders, patients, and employees. And the third fiscal quarter of 2022 corresponds to the three-month period ended December 31st, 2021. During the quarter, we earned patient services revenue of Can $ 1.4 million from our clinics. By contrast, third fiscal quarter 2021 patient services revenues were generated from three clinics. This was due in part to the three additional clinics as compared to the prior quarter, as well as the steps the company has taken to further improve and drive business growth as Ronan has previously mentioned. For the nine-month period, revenue was $3.1 million, an increase of $2.7 million over the same period of the prior fiscal year. This reflects a significant increase in the number of clinics we had operating, 10 in the most recent quarter compared to three in the same period of the prior year. General and Administration expenses of $9.1 million are our largest operating expenditures, and we're up from $3 million in the same quarter of the prior year. The increase was primarily due to increased operating costs, reflecting a larger number of clinics opened in the quarter as compared to the prior year, as well as those under construction and an increase in public company related expenses. Other operating costs include patient services expenses of $2.5 million, research and development expenses of $1.4 million, and sales and marketing expenses of $1.1 million. Our R&D costs increased 44% over the prior year, primarily due to ramping up of development costs as we work to further progress our activities related to FT-104 and our FT-200 pipeline as you just heard from Joseph. Our marketing costs nearly doubled from the prior year as we increased paid social, search, and public relations expenditures to build patient interest in our brand. This had the desired results as we saw steady growth in client acquisitions and patient services and validates the steps, we've undertaken to improve the business and drive efficiency. Net loss for the quarter of Can $ 14.9 million was primarily due to total operating costs of Can $ 15.6 million, which I just discussed, as well as a foreign exchange loss of Can $ 0.5 million. The increase from the prior year primarily reflects the company's focus on growing the business and continued investment in our drug development pipeline and clinic infrastructure, as well as our digital tools. Turning next to the balance sheet, Field Trip remains well-capitalized. As of December 31st, 2021, we had unrestricted cash and cash equivalents, funds held in trust, and short term investments totaling $74.5 million. Thank you very much. Maybe discussing on the FT-104 patent, you mentioned the prior art claim. Right now, I think we like to keep that in-house. We have the next question from the line of Patrick Trucchio with HC Wainwright, please go ahead. Sure, we actually did the neurotoxin and cardiotoxic as part of our package now and I'd say everything looks satisfactory for us to go forward. In most respect I -- in all respects, the pre -clinical work that we've done so far is setting us up very well to start in our Phase 1. We will have additional non-clinical studies as we go past Phase I, as we start looking at specific indications. You can easily see that if we're going to developing TPD, we'll have to look at developmental and reproductive talks and things of that nature. Those are the kind of things we'll have to look at as we go forward, but they're not needed right now for Phase I with the single dose. Honestly, I think some of those questions are a little premature for us. We're finishing up, getting ready for the Phase 1 so really, we're focused on that 100% right now. I'd say as soon as that's up and running, we'll set back and we'll be working on those designs, and I think we could share a little bit more information with you then. And we -- if we take the data to the FDA, that may also help clarify some of that. We're looking at going to do a pre-IND as the Phase 1 is headed forward, and I think that will give us the information and will help make those selections and the N-help make those designs more efficient and tailored to what the agency is looking for\n Thank you very much. I -- was great to hear you guys mention that you've already gone and now get through the SAP program, which seems like a transformative change for the space. As you know, we currently provide psilocybin assisted psychotherapy at our clinic in the Netherlands. We have the protocols, we have well-trained therapists, we have the processes in place to be able to provide that sort of therapy, so I think we are well-positioned to help patients with these types of therapies in Canada, as well as it becomes hopefully more available. It's early stages yet, but we're in a good position to be administering these types of therapies for patients and yeah, to answer your question, we have had significant amount of inbound interest on both MDMA and Psilocybin therapy through the SAP program. So, there's jurisdiction-based differences in payers and payer mix. So just wanted to get maybe some rough understanding of your typical success rate that you see for reimbursements and if there are people being reimbursed for psychotherapy, if there's more heavily weighted in certain jurisdictions versus others, at least for the psychotherapy component of your program. In Canada, we tend to find I believe a higher percentage reimbursement in Canada than we do in the past, but in the U.S., patients also get reimbursement for the psychotherapy through out-of-network coverage if they have it, although I think it's at a lower percentage than what we see in Canada right now. Well, we do as we create a super bill for the patient that breaks out the costs into the ketamine dosing versus the psychotherapy preparation integration sessions until they can see where the cost is split. It's up -- it's around 55% or so, is the cycle therapy portion of the bill, and that's the part that you get reimbursed -- mostly get reimbursed on through their insurance providers. If you wanted to get into more detail on that, I have to -- we have to get back to you so we can have a follow-up on that. Yeah, and there might be a KPI you guys maybe report moving forward as the kind of pair mix because that does helping form the outlook for the clinics business, certainly. But that's how -- yeah, I appreciate the insight on the diversion between Canada and U.S. We have next question from the line of David Martin with Bloom Burton, please go ahead. It does not pay for the patients to get the treatment, so the patients will be paying for treatment. It is a -- SPRAVATO is an expensive product, and not everybody gets coverage from it. It's also a medical question that our medical team is looking at, whether we can create the same sort of psychedelic experiences that we strive to create for our patients. So it's one we've explored and continue to explore whether it would make sense to add it as an offering at the clinics, and today we haven't decided to, but it's -- we'll continue to look at. And if I could, just one more question. I've seen that quarter-over-quarter totally expenses were kept in check, roughly equal between second and third fiscal quarter. But some of the line items like occupancy costs, sales and marketing, and R&D actually declined. I was wondering if Donna you would be able to help us to project these numbers into the future, it's just somewhat complicated here. So while you might have seen a slight decrease in Q3 over Q2 from an R&D perspective, you can expect to see those numbers to ramp over the next several quarters as we move into our Phase I clinical trials. And in terms of the decrease in Q over Q for our sales and marketing expenses, with the hiring of Vicki Reed as our Chief Growth Officer, we've started to take a detailed look at our different acquisition channels from a marketing perspective. And so we've actually received -- most of our leads are references through our digital acquisition channel and through organic growth, as opposed to paid search channels. And I think from the occupancy cost, it's based on IFRS 16 accounting, so that number there excludes the depreciation and amortization of the right-of-use assets. But if you look at the occupancy costs on a cash basis in terms of the leases that we have, you will see an increase. So for the quarter, the weighted average share number that we used was $57.8 million on both basic and diluted basis. What would you need to do some additional work that would qualify these sites, both in Canada and in the U.S. to conduct clinical trials there? Elemer, we've been -- so I know Stefan Coty came on as our Head of Quality. And so we're fortunate that we already have the -- most of the staffing needed at each of the clinics to conduct these types of clinical trials, so we're in the process of putting together the SOPs, and back-office systems, and the insurance, and etc. setting all of that thing up, as well as in parallel to that, having discussions with potential partners who want to conduct trials at our clinics. It's probably still a little bit early to make any  statements on that, but yes, we are -- it does open up the possibility of more frequent dosing without the risk of this cardio toxicity progression to take hold. But imagine, for example, that it could be a maintenance therapy post treatment with either ketamine or FT-104, where you could actually administer it once a week or even more frequently than not, if you were in the microdosing situation or even microdosing. So it's that kind of concept, I think it could get more widespread use and more frequent use. So I'd like to see, for the revenue growth, could you give a bit more color on the proportion of the growth that was from the two most mature clinics in New York and Toronto and how much of that came from the number of other clinics that you've opened. For the quarter we experienced growth across all our clinics, not just our Toronto and New York clinics. Thank you very much. So now you can see that a clinic with a larger base of clients such as our more established clinics, also get more organic word of mouth referrals. Would you be looking at PK characteristics which would help indicate how long a PPD patient may have to give up breastfeeding and what sort of target you would have to meet to have a competitive advantage over standard of care, and that specific metric of clearance from bodily fluids. And if we look at the half-life cycle, I think we can project most of the metabolites and the primary active molecule would be gone definitely within 12, so putting some safety margin on that, that might be 24. We'll confirm that through the human study, but the, I'm going to say the PK profile and the duration of the cycle activity experienced in a rodent does look to map very well with what is reported for the listed substance for hydrocopter being in the range of that two-to-three-hour window, which is what we see with the rodent. Beyond that, we're going to have to confirm all that not just through pharmacokinetics, but through  transfer studies. Either through a specific study or as part of our Phase 2 program, we'll capture the milk and then do our analysis looking for our metabolized  then confirm all that, and then build the story. If I compare that to the standard of care, the current standard of care is either a chronic SSRIs which don't work very well, take too long to kick in. So, I pushed them aside because it's the mother that needs help immediately. So, the other standard of care, which is the only other drug approved on the market is a Russel, which already the phase of treatment itself is three days. So you're looking at minimum of two weeks, if not more, that you're going to have to deal with a washout. And then future drug from  is a 14-day treatment with an additional two weeks on the back end of it, so you're looking at nearly a month without breastfeeding. Those kinds of things are not good for the bonding between the mother and the child especially if it's necessary -- wanted by the mother, and not being able to do it sometimes, that is a failure. Thank you very much. They're still very rigorous, but the whole approval process relies highly on the investigators themselves. So from a selection standpoint, there's not a lot of difference between the two, I will say there's an additional benefit in Australia's as there's, like we have in Canada, a certain amount of financial reimbursement for using people -- for working with people in the country. Beyond that, we've had experience with the group in Australia before in previous slides and before Field Trip. And then the other factor that we were trying to weigh in was what was going on with the COVID situation and with Omicron high numbers in Europe and the site was having to shut down a couple of times, mainly because personnel who were getting sick and they didn't have enough personnel to staff the system. And so looking at the overall, it didn't change anything to move to Australia, but gave us additional security and the additional comfort. We made that switch, we signed with a group, the site selection is I'm going to say pretty much finalized. We know where we're going and we're getting ready to submit our protocols to , so we're on our pathway to Phase one without actually having changed or have -- without increasing the risks, we feel like we've reduced the risk. Just a few more on FT-104, just from the commentary in the release, which noted that as a prodrug FT-104 converts rapidly and completely after administration, and combined these properties resulted in improved drug absorption, more reproducible pharmacokinetic profile, and improved bioavailability, making it a superior drug candidate. I know -- for example, when we did pharmacokinetics in rodents, and this is in our presentation. We don't -- we see very, very little of the FT-104. Now, when we do the Phase I in humans, we'll be looking for both, obviously, we'll design the trial to look for. We've got a very good description of what's going on in terms of how FT-104 gets converted to oxidized DCPIP, gets into the system, and then all the pharmacokinetics that around the molecules, and then all the metabolisms. If that was all you were looking for, that's about as far as I can go right now. And then just as part of the Phase 1 program, I'm wondering if you would expect together additional data regarding a psychedelic experience itself. We're going to use some of the standardized questionnaires that have been used with psychedelic substances in the past and maybe a slightened -- slightly different ways, but very, very closely. Things like ASC and EQ, which has a standardized alternate space of consciousness, and the mystic will experience questionnaires which would have been related to outcomes in depression. So we'll capture not only intensity of the experience, a little bit of the flavor nature of the experience, but also the duration. Recognize it's going to be in healthy volunteers and volunteers who had some experience with psychoactive substances before, so they'll likely be able to characterize it quite well. And then, we'll use that as information to decide on our doses that we'll go into Phase 2 with, obviously the experience at a patient might be slightly different than that in healthy adults, but we feel like that's going to give us a very, very good window into the therapeutic doses that will be used in patients. Thank you very much. What percent of the patients you treat are reimbursed right now, and what percent of those who seek treatment would you say have to walk away because there is no reimbursement for them. We see that or we're starting to see that, but it's already very still, but our hope is that over the next few years we'll see greater percentage of people get coverage for these types of therapies. Will you use depression scales in the Phase I, because I know these are healthy volunteers, but everyone can potentially feel a little better. A person that came in and actually had depression probably wouldn't be considered healthy and allowed into the study, just from an exclusion standpoint. And if a person that came in as healthy, not depressed, numbers would be so low, there wouldn't be room for calculation and fiscal analysis. So no, I don't think that's appropriate based on that. Ladies and gentlemen, we have reached the end of the question-and-answer session, and I'd like to turn the call back to Ronan Levy for closing remarks. We continue to execute upon our strategic priorities like building our innovative drug research and development pipeline, as well as delivering and helping patients through our best-in-class clinic network. Thank you very much. Ladies and gentlemen, this concludes today's conference call."
}