{
    "symbol": "IBEX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-22 23:10:06",
    "content": " This cohort of new clients generated approximately $50 million of in-year revenue, up 67% from our previous high in FY â\u0080\u009921, and we expect these clients to generate well over 100 million in FY â\u0080\u009823. Therefore, in FY â\u0080\u009823 we expect revenue to be in the range of $545 million to $555 million, representing a year-over-year growth of 11.4% at the midpoint. For Q1, we expect revenue to grow to a range of $124 million to $127 million with a mid-point growth of 15.6% versus prior year quarter, and adjusted EBITDA of $16.5 million to $18.5 million, resulting in an EBITDA margin of 13.9% at the respective midpoints. The increase in adjusted EBITDA margin was primarily driven by growth in our new clients since fiscal year â\u0080\u009916, along with continued revenue growth in higher margin, nearshore and offshore regions, offset by costs associated with granting a new HealthTech client in the current quarter. Net cash generated from operations was $27.8 million for the quarter, compared to $1.8 million in the prior year quarter, primarily due to the higher collections, stronger operating results, including lower non-recurring expenses and lower cash taxes. Since our shift to the digital first marketplace in fiscal year 2016, the clients we have won since then make up more than $342 million or approximately 59% of our fiscal year â\u0080\u009922 revenues. Our annual effective tax rate on a normalized basis, excluding the effect of the warrant fair value adjustment and the one-time deferred tax benefit of $4 million was approximately 10% in fiscal year $22, which is down from 13% in fiscal year â\u0080\u009821 as a result of the ongoing tax planning efforts. On a non-GAAP basis, fiscal year â\u0080\u009822 adjusted net income was $24.6 million versus $23.6 million last year and the fiscal year â\u0080\u009922, adjusted fully diluted earnings per share was $1.32 versus $1.28 in the prior year."
}