{
    "symbol": "THC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:59:07",
    "content": " We are projecting full year 2023 adjusted EBITDA of $3.16 billion to $3.36 billion, which represents an attractive growth rate of 7.2% at the midpoint on a normalized basis. First, in our industry-leading ambulatory surgery business, we anticipate normalized adjusted EBITDA growth at USPI of 11% at the midpoint of our guidance, based upon our expectation of 4% to 6% growth in same-facility revenues, further accretion from the second SCD transaction and continued strong contributions from our M&A and de novo initiatives. The year-over-year core adjusted EBITDA growth rate for 2023 is higher than our long-term forecast of 2% to 3% annually, because of the tailwinds created by the points I've noted, and also the continued recovery of our Massachusetts market and ramp-up of our hospital in Fort Mill. Finally, Conifer is expecting adjusted EBITDA growth of 11% for 2023, on a normalized basis for changes in Tenetâ\u0080\u0099s contract terms and client hospital divestitures, driven by new sales and a continued focus on automation and offshoring activities, to realize greater efficiencies in our operations. We were very pleased with how we finished the year, with fourth quarter adjusted EBITDA excluding grand income, coming in at or above the midpoint of our guidance ranges, for all three of our businesses, driven by renewed same-store volume growth for USPI, strong same-store adjusted admissions growth in our hospital business, and lower levels of contract labor exiting the quarter, all of which gives us momentum as we begin 2023. This organic growth coupled with approximately $78 million of additional earnings related to USPI's acquisition and development activities, is anticipated to result in normalized EBITDA growth of about 11%, for USPI. Finally, our 2023 guidance assumes a $14 million reduction in EBITDA, due to our planned sale of the San Ramon facility that we announced last month and a $27 million reduction in Conifer's EBITDA this year, due to transition contract expirations related to the sale of our former Miami Hospitals and CHI's divestiture of certain Iowa facilities. First, we plan to continue allocating approximately $250 million of capital annually to grow our USPI surgery center business; second, to enhance our hospital growth opportunities, including the continued focus on higher acuity service offerings; third, evaluate further opportunities to retire and/or refinance debt; and finally, share repurchases depending on market conditions and other investment opportunities. Please proceed with your question. Please proceed with your question. Please proceed with your question. Dan said, I think 22% of EBITDA for the year in the first quarter that looks like it's up about 6% year-over-year, if I'm measuring that correctly versus 11% for the year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And just to add on just in terms of from an earnings perspective is for USPI, as we move through the year, as I pointed out, roughly 22% of the EBITDA for the year will be generated in the first quarter, which is great when you look at the first quarter last year, it's growth of close to 13%, you take into consideration there is some headwinds in the first quarter this year compared to last year related to sequestration the 340B, but still even with some of that there's still nice growth year-over-year in the first quarter."
}