{
    "symbol": "LYB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 13:03:15",
    "content": " During the first quarter, LyondellBasell generated $4 per share of earnings, $2 billion of EBITDA and $1.5 billion of cash from operating activities. 2022 marks the first time since 2015 where LyondellBasell earned $2 billion of EBITDA during the first quarter, and our income of $4 per share establishes a new first quarter earnings per share record for the company. In today's strong market and with LyondellBasell's larger asset base, we delivered $9.7 billion of EBITDA over the last 12 months, nearly 45% above the prior cycle average. In the first quarter, LyondellBasell generated $1.5 billion of cash from operating activities that contributed toward a new record of $8.6 billion in cash from operations over the last 12 months. As Ken mentioned, LyondellBasell's business portfolio delivered over $2 billion of EBITDA during the first quarter. Higher product prices and volumes offset rising cost in EAI markets, resulting in first quarter EBITDA of $188 million, $33 million higher than the fourth quarter. Robust margin expansion in most businesses resulted in record first quarter EBITDA of $546 million, $294 million above the prior quarter. Planned maintenance at our butane dial facility in 1 of our 2 propylene oxide units located at our Channelview, Texas site is expected to impact second quarter EBITDA for Intermediates and Derivatives segment by approximately $80 million. Improving volumes from automotive production and higher margins resulted in first quarter EBITDA of $125 million, $101 million higher than the fourth quarter. In the first quarter, the Maya 2-1-1 benchmark expanded significantly to $30.82 per barrel, a $7.24 increase due to higher demand for gasoline and diesel partially offset by lower byproduct value. First quarter EBITDA was $103 million, $70 million lower than the prior quarter's record level. With all of the turbulence in the global economy, LyondellBasell's first quarter results illustrate the benefits of our global business portfolio and how demand for our products is highly resilient. So all of that is going to lead to, I think, a very strong performance for I&D in the second quarter\n And Ken, what I'd also add specifically around oxyfuels, if you look at the decade kind of before the pandemic, the oxyfuels business kind of consistently delivered $400 million plus of EBITDA. That's going to continue as we go into the second quarter with higher demand, and I expect that we'll see some change some chain margin recovery in Q2."
}