{
    "symbol": "EVGO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 16:00:28",
    "content": " We can incorporate Autocharge+ into proprietary offerings like GMs Ultium Charge 360 EV ecosystem in fleet offerings in conjunction with our Optima software product, and more broadly to our retail drivers across EVgo's vast charging network. Those are very exciting and emblematic of the fleet electrification that is taking hold across the U.S.  On the partnership side, in May, we announced a commercial agreement with Cadillac to offer drivers of the new 2023 LYRIQ, the option that's two years unlimited public fast charging on the EVgo network. Supporting an entire electric federal fleet to require more than 100,000 new charging stations according to the government accountability office, EVgo is enthusiastically welcome to U. S. government's leadership and electrification and looks forward to helping agencies across the federal government meet their EV charging goals. More probably is to come because Pilot Flying J is not the only entity that has quarters and rural presence with and -- many of those rural gas station operators and those folks remain interested in participating in electrification revolution and given EVgo's track record over 10 years of operating and network really, really well, we're very well placed to have that be a part of our business going forward. And that -- we're seen as not only experienced but willing to collaborate and cooperate, the fact that many of these programs are saying we're going to do competitive solicitations based on track record is really, really -- that puts EVgo in a kind of a pole position to get our share of that business where we where we want to go. So, one of the reasons, we -- the EVgoâ\u0080\u0099s Innovation Lab, it's just so important to success, I mean, make that available not only to all the OEMs, the car companies, but also to all the charging companies. But what's innovative about this approach in California is like, well, actually, what if there were convenient fast charging and then people could just come and do 15 to 30 minutes at a shot, maybe that's even more convenient and more cost effective than going in and trying to wire up parking garages in the apartment buildings."
}