{
    "symbol": "EVGO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:33:08",
    "content": " In fact, when we overlaid specific store locations at these well-known brands with EVgoâ\u0080\u0099s own proprietary network planning tool that accounts for the numerous factors that makes charging infrastructure pencil, weâ\u0080\u0099ve added nearly 10,000 potential charging stalls that pass our internal investment as of today and could be added to EVgoâ\u0080\u0099s development pipeline. This rapidly expanding pipeline of premium station locations with strong unit economics combined with the cost sharing potential will drive income forthcoming federal hub provides EVgo with the opportunity to widely invest capital to expand our footprints to new places, which is in line after we file our third quarter 10-Q, EVgo is planning to file as a supplement where recently filed S-3 in order to facilitate aftermarket sales of up to $200 million of our common stock. EVgo increased our active engineering and construction stall development pipeline by 82% year-over-year reaching a record 4,534 stalls at quarter end, a noticeable increase in quarterly addition of the stalls from the Pilot Flying debut we announced last quarter. EVgo has been put in public charging stations in operation since 2010 and while that created an unparalleled expertise and track record, it also places ongoing demand on EVgo to ensure we meet and exceeding our customer expectations through appropriate level of investments in maintenance and network upgrades. And what really sets EVgo apart is that we have our lab where we are able to test various equipment in combination with various EVs and that already had given us quite a lead way and we will continue to do it and even import next year the importance of overall customer experience which is being helped again by a variety of things, the new hardware upgraded hardware, operational maintenance practices, its software convenience and overall customer experience convenience and its lab test and allowing for this which is to be high class. Look, our committement to technology-enabled innovation powers our customer relationships and whether itâ\u0080\u0099s Autocharge+ for drivers on our public networks, whether itâ\u0080\u0099s our APIs for Automakers or free software for commercial customers, EVgo is positioned to deliver an exceptional and reliable fast-charging experience and expand our leadership across the market."
}