{
    "symbol": "BRC",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-18 13:43:07",
    "content": " 02:08 This quarter, we grew sales by a very healthy sixteen percent and we increased earnings per share by four point seven percent. 03:24 In our Identification Solutions business, we continue to post excellent results, with sales growth of twenty five point four percent and segment profit growth of twenty one point two percent. Even with these inflationary pressures, our gross profit margin was still an enviable forty eight point two percent, which was right in line with the forty eight point two percent experienced in the fourth quarter of last year. Sales in the first quarter were three hundred and twenty one point five million dollars, which was an increase of sixteen percent when compared to the same quarter last year and GAAP pre-tax earnings increased five point eight percent to forty four point seven million dollars. 09:57 GAAP diluted EPS was zero point sixty seven dollars, which was an increase of four point seven percent over last year's first quarter. And if you exclude amortization expense, then EPS would have increased by nine point one percent to zero point seventy two dollars this quarter compared to zero point sixty six dollars in the first quarter of last year. Our sixteen percent sales increase consisted of organic sales growth of seven percent, an increase from acquisitions of eight point three percent, and an increase from foreign currency translation of zero point seven percent. And as a percent of sales, SG&A was thirty point one percent this quarter compared to thirty point zero percent in the first quarter of last year. However, if you exclude amortization expense from both the current year and the prior year, then SG&A would have declined from twenty nine point five percent of sales last year to twenty eight point nine percent of sales this year. As I mentioned, our GAAP EPS was zero point sixty seven dollars this quarter compared to zero point sixty four dollars in last year's first quarter, an increase of four point seven percent. 18:23 We also expect total sales growth to exceed twelve percent for the full year ending July thirty one, twenty twenty two which is inclusive of both organic sales growth as well as sales growth from the recently completed acquisitions. 20:39 Segment profit as a percentage of sales was nineteen point six percent, which was down from twenty point three percent last year. However, if you exclude the sizable increase in amortization that Aaron mentioned, then segment profit as a percentage of sales would have increased from twenty one percent of sales to twenty one point one percent of sales, so an increase of about ten basis points compared to the first quarter of last year. Our WPS sales were seventy two point nine million dollars this quarter, which were above the pre-pandemic sales experienced in the first quarter of fiscal twenty twenty."
}