{
    "symbol": "BRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-17 14:25:23",
    "content": " Even with tough comparables due to strong COVID related product sales in the prior year, organic sales growth increased by 5.2% in our WPS business this quarter. Our strong new product line-up, investments to drive sales and positive momentum in automation efficiencies gives us confidence that we will continue to generate strong organic sales growth with very healthy margins over the rest of this fiscal year and for years to come. Sales in the second quarter were $318.1 million, which was an increase of 19.6% when compared to the same quarter last year. And if you exclude amortization expense, then EPS would have increased by 14.8% to $0.70 this quarter compared to $0.61 in the second quarter of last year. And as a percent of sales, SG&A was 29.1% this quarter compared to 30.9% in the second quarter of last year, which illustrates how we're able to continue to squeeze leverage out of our SG&A structure. Slide 9 illustrates our after-tax income and EPS trends, as I mentioned, our GAAP EPS increased 10.2% this quarter and if you exclude the after-tax impact of amortization expense, our EPS would have increased by an even stronger 14.8%. Organic sales on IDS division were once again very strong, up 16% versus the second quarter of last year. However, if you exclude the sizable increase in amortization that Aaron mentioned, then segment profit as a percentage of sales would have been 19.5% this quarter compared to 20.7% in last year's second quarter. Regionally, organic sales in Asia were once again very strong this quarter with growth of nearly 15% compared to the second quarter of last year. So, instead of being a serialized approach where there's bottlenecks, it's a massive parallel approach of which really gives us a lot of different advantages, but as a result, the programing - the performance upgrades actually build upon themselves over time and so we're going to continue to see more and more efficiencies coming out of that certainly the next quarter and frankly we have next generation plans for that system, so we expect to drive more performance gains from that approach over the next year plus."
}