{
    "symbol": "BRC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-01 13:28:04",
    "content": " We're proud of what we've accomplished at Brady, we've had strong organic sales growth over the last several years. SG&A was 94.5 million this quarter, compared to 93.7 million in the fourth quarter of last year, as a percent of sales SG&A was 29.2% compared to 30.6% in the fourth quarter of last year. If you exclude amortization expense, and last year's acquisition related charges then SG&A would have declined from 28.6% of sales in Q4 of last year to 28.0% of sales this quarter. Overall, we're making nice progress, as we've reduced our SG&A expense from over 36% of sales just a half dozen years ago to 29% today. If you exclude these prior year charges and exclude amortization expense from both the current year and the prior year, then our non-GAAP pre-tax earnings would have increased by 19.2%, increasing from 48.4 million in Q4 of F'21 to 57.7 million this quarter. And if you exclude the after-tax impacts of last year's one-off items and amortization expense, then our EPS would have increased by 16% this quarter. We also anticipate organic sales growth in the mid to high single digit percentages for the year ending July 31, 2023 and based on foreign currency exchange rates as of July 31, we expect the strengthening of the U.S. dollar to reduce fiscal 23 sales by approximately 3.5%. IDS sales increased 9.6% to 253.2 million, organic sales in our IDS division are once again very strong up 10.8% versus the fourth quarter of last year. Segment profit as a percentage of sales was 19.8%, which was up from 18.4% last year, if you exclude amortization expense, and the non-routine charges from Q4 of '21, and segment profit as a percentage of sales would have been 21.3% this quarter, compared to 20.8% in last year's fourth quarter. Looking at our WPS business geographically, we saw continued strong organic growth in Europe, with organic sales increasing in the mid-single digit percentages, and continued strong profitability as the business shifted back into more sales of core workplace safety products and fewer COVID related products."
}