{
    "symbol": "CRM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-01 21:18:01",
    "content": " And I mean I'm grateful for what all of our Ohana have done and all of our employees have done and also our customers and the first responders and scientists and everybody to get through this because it does feel like -- and I think as evidenced by what we just went through in New York, we're kind of coming to the end of this. And we closed fiscal year '22 with really incredible cash flow, reaching a milestone of $6 billion in the year, and that's really up 25% year-over-year. I'll tell you that based on our strong fiscal year '22 results, we're excited to raise our fiscal year '23 revenue guidance to $32.1 billion, something I've been excited to talk about at the high end of the range, representing 21% growth year-over-year. Sales Cloud growth accelerated again this quarter to 17% year-over-year, and it's now a $6 billion revenue business. Companies like State Farm and U.S. Bank expanded their use of sales -- Service Cloud this quarter, helping it grow at 18% year-over-year to nearly $6.5 billion in revenue. And this is really very much to the core of who we have become in our company that we can show up with our products and services and say to a great company -- and we've told the stories this year of the AT&Ts, for example, or the Sonos’, we were talking about, on this call, so many amazing customers. As Marc said, Slack continues to exceed our expectations that I think is benefiting not only from the trend towards this new way of working that we're all figuring out right here in Salesforce Tower, it's also benefiting being a part of our Customer 360 portfolio. And I think that's led to not only our ability to compete in new accounts, which was a meaningful part of our growth this past year, but also, as Marc mentioned, as we're expanding our relationships with our customers, they know that they can trust us to really truly build a single source of truth and actually achieve the business objectives and the growth formula that you need in this new economy. As you said, our core sales and service business, I think it's appropriate coming up on our 23rd birthday that Sales Cloud 23 years later continues to grow at 17% and is over $6 billion in --\n It's kind of amazing."
}