{
    "symbol": "WIX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 13:16:03",
    "content": " And over the years, as that business evolved and it's into a very big and healthy business, we also figured out that there's a lot of people are coming to our cloud platform, but they're actually using that as what we call partners. And it was very evident for us a few years ago that this is another path of investment that will take us to kind of the next level of growth in our business, because it's another segment of our business that is probably at least as big as the one that we're serving -- we've been serving for a while and probably even much larger. Well, I think when we just started talking about partners a few years ago, I think some of the investors thought that there's going to be kind of an immediate result, where we knew that it's going to be a multiyear effort. And coming -- end of '21, coming towards '22, it was very clear to us that it's a good opportunity in terms of what we're seeing from our test results to start testing again in a more major way and go into a price increase, which we enacted in '22. With regard to the target of the 20% free cash flow and marketing expenses and so on, so look, of course, when you are done with the major build-out expenses of a business, you start to see the leverage, meaning that we are going to see every year that the growth of partner is going to be much higher than the growth in cost. So everything together we managed to reduce the operational cost quite a bit this year, meaning that despite of the headwinds that we see, if we hit the high end of the range of what we provided, we're still going to be at around 5% of free cash flow this year. And we had 2% more coming from FX, from -- and kind of like it's a bit harder to estimate what happened in terms of acquiring new businesses, but I would say that it's also about between 0.5% to 1% that came from direct effect of demand in Europe because of the war. And I think we're working and strategizing how to continue bringing like this kind of a big size deal to the table, while continuing to, by the way, also closing out of smaller deals that are less -- not get to the same level of -- I would say, don't get the same exposure as something as big as LegalZoom. I think it will be a great review in much detail of this plan we're putting in place, a much better understanding of how we think about our business in terms of those -- at least the core -- 2 core segments of the self-creators and the partners, and also the kind of the path for the 20% free cash flow margin that -- by 2025 that Lior mentioned before."
}