{
    "symbol": "MLM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 18:02:04",
    "content": " Against that backdrop, and combined with our cement teamâ\u0080\u0099s focused execution on commercial and operational excellence, we delivered record third quarter shipments of 1.1 million tons and pricing growth of 21.4% as our second $12 per ton increase this year, went into effect on July 1. The building materials business posted an all-time record this quarter, with products and services revenues of $1.61 billion, a 15.9% increase over last year, and an adjusted product gross profit record of $467 million, an increase of 10.9%. On an as reported basis, stable demand, improved pricing and acquisition contributions led to record revenues of $310 million, a 58.1% increase and record adjusted gross profit of $50 million, a 22.9% increase, however, continued liquid asphalt inflation contributed to the adjusted product gross margin decline of 470 basis points to 16.3%. Hey, good morning, everyone. And then if we're looking at Texas, which is our largest state by revenue, their 10-year unified transportation program is $85 billion worth of projects, to try to contextualize that that's a 13% increase from the â\u0080\u009822 plan. It's important to see to Stanley, I think, to your question, if we're looking at those same top 10 states in contract awards here today, they're up around 13%. Hey, good morning, everyone. What I would do is I'd take you back, and it's been a while, Jerry, this might have before you were actually following us, but if we go back to 2005, 2006 and '07, what you'll actually see if you look at history, is the industry generally, Martin Marietta specifically, was finding peak volumes back in 2005, but we're actually seeing peak profitability in that last cycle in 2006, which underscores in many respects why we speak to this volume -- this value over volume strategy because we recognize how valuable that is to our business. I think going back to the percentages that I spoke to a little while ago and infrastructure gives you a good sense of what that rhythm and cadence can look like through the balance of the year, I think part of what we're going to be seeing, and I think this is important, Phil, is in infrastructure, we're going to be seeing more capacity type projects led than we've seen in the more recent past. And then the other thing that we are seeing is we are seeing estimated start dates now on all of the large LNG or energy plants that we've been looking at in South Texas, all with 2023 start dates and we think that's important as well because when we look at those projects all by themselves and again, I'm talking about six different projects in South Texas, the cumulative yardage and tons from those are 13.7 million tons and about 1.3 million cubic yards. So as we think about the rhythm and cadence of what that's going to look like from a pricing perspective, next year is actually going to be much more attractive for that business. But you're kicking off with a 20% increase for 2023 in response to a different question, you indicated you expected the inflection in infrastructure to be midyear, which suggests, I guess, absent something changing on the capacity side that there's another price increase coming mid-year. If we're right, that the U.S. is far from overbuilt, if we're right that anything relative to housing will not be deep, it will not be long, and if we're right that the U.S. is going to have to look at higher degrees in particular manufacturing going forward, I think you could take a number of economic indicators in that vein and say that volumes should be relatively attractive on a broader base for an extended period of time."
}