{
    "symbol": "FNA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:14:31",
    "content": " Beginning with our first quarter 2022 performance, total revenue for the first quarter was $41.4 million, representing growth of 25% compared to the first quarter of 2021. First quarter US revenue was $36 million, representing growth of 24% compared to the prior year period, despite COVID-19 headwinds in January and early February. First quarter international revenue was a record $5.4 million representing growth of 35% compared to the prior year period, and an increase of 15% sequentially compared to the fourth quarter of 2021. In addition to our strong operating performance during the first quarter, Paragon 28 continues to be focused on our mission to improve foot and ankle patient outcomes, which will enable growth in our business for years to come. Moving to our foot and ankle sub segment revenue trends, during the first quarter, Paragon 28 experienced very strong growth in the two largest market sub segments of fracture fixation and hallux valgus or bunion, fracture fixation and bunion growth was driven by recent product launches and continued strong commercial execution. Paragon’s revenue for the first quarter of 2022 was $41.4 million, representing growth of $8.3 million, or 25% compared to the first quarter of 2021. US revenue for the first quarter of 2022 was $36 million, representing growth of $6.9 million, or 24%, compared to the first quarter of 2021. International revenue for the first quarter of 2022 was a record $5.4 million, representing growth of $1.4 million, or 35% above the first quarter of 2021. Research and development expense was $5.8 million, or 14% of revenue for the first quarter of 2022 compared to $3.6 million, or 10.7% of revenue in the first quarter of 2021. Compared to the fourth quarter of 2021, SG&A expense increased $2.1 million, primarily driven by more in person medical education events, increased investments in commercial team expansion, timing of trade shows, which are generally more concentrated in the first quarter of each year, and approximately $800,000 of Disior acquisition related costs. And you see it in our margins, again, for the first quarter, even without the inventory obsolescence adjustment driven, but which was really driven by the higher product growth that we've had the last two quarters, 22% and 25% growth that triggers uses of inventory, that in some cases we've previously reserved, so strong margins and no expectations or visibility that those are going to be dropping any time in the future that we have visibility too."
}