{
    "symbol": "FNA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 13:47:14",
    "content": " Total revenue for the  second quarter was $42.5 million, representing growth of 19% compared to the second quarter of 2021. Strengthening of the U.S. dollar reduced our second quarter net revenue growth by 140 basis points as compared to the prior year period. Second quarter U.S. revenue was $36.8 million, representing growth of 19% compared to the second quarter of 2021. Moving to our foot and ankle sub segment revenue trends during the second quarter Paragon 28 experienced double digit revenue growth in each of the foot and ankle sub segments including fracture, ankle, flatfoot hallux valgus, including hammer toe and Charco. Specifically during the second quarter, we did business with 1829 U.S. surgeon customers, including 582 U.S. producing surgeons, both records for P28 and an increase compared to the prior year period of 11% and 18% respectively. Paragon's revenue for the second quarter of 2022 was $42.5 million, representing 19% growth compared to the second quarter of 2021. Strengthening of the U.S. dollar reduced our second quarter net revenue growth by 140 basis points as compared to the prior year period. Opportunistic investments to drive long term durable growth were enabled by and began after our October 2021 IPO, resulting in a 45% increase in second quarter operating expenses compared to the pre-IPO prior year period. Paragon 28 exclusive focus on foot and ankle, and passion for improving patient outcomes strongly resonates with foot and ankle surgeons and sales reps. During the second quarter, the opportunistic investments we made in medical education and salesforce expansion initiatives exceeded our expectations, further validating that our strategy is working and has momentum. Research and development expense were $6 million, or 14% of revenue for the second quarter of 2022 compared to $3.6 million, or 10% of revenue in the second quarter of 2021 and $5.8 million, or 14% of revenue in the first quarter of 2022. The increase in SG&A expense as compared to the prior year was driven primarily by investments in sales and marketing including in person U.S. marketing and medical education events, commercial team expansion both in the U.S. and in our international markets, increased variable sales representative commission expense related to revenue growth, increased G&A expenses due to the cost of becoming a publicly traded company in the fourth quarter of 2021 and one time SAP implementation costs. The $800,000 increase in second quarter SG&A expense, as compared to the first quarter of 2022 was primarily due to the $1.2 million onetime costs related to our successful second quarter SAP launch. When excluding the second quarter, one time SAP expenses of $1.2 million adjusted EBITDA improved nicely as compared to the first quarter, despite continued strong investments in key growth drivers during the quarter. We expect our third and fourth quarter net revenue to be $42.5 million and $49.6 million respectively representing growth compared to the prior year periods of approximately 19% and 16%, respectively."
}