{
    "symbol": "HEES",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 15:43:13",
    "content": " Given these robust business fundamentals, total revenues in the third quarter reached $324.3 million or 17.7% better than the same quarter in 2021, while improving 10% on a sequential quarterly basis. Also adjusted EBITDA gain 24.1% on a year-over-year basis, closing the quarter at $139.4 million while posted a margin of 43% with both financial measures representing records for our company. Revenues from our equipment rental segment, which include ancillary rental revenues were up 28.6% on a year-over-year basis, and 11.4% sequentially, totaling on record of $253.6 million. The strength of this performance was due in part to a combination of healthy rental rate appreciation, a strong physical fleet utilization, which averaged 73.3% or 140 basis points ahead of the same quarter and 2021. Rental revenue in the third quarter totaled $224.1 million, a year over year increase of 26.9% and a sequential quarterly improvement of 11.4%. The segment's results were supported by another quarter of excellent pricing achievement, as demonstrated by a year-over-year rental rate increase of 10.1% and a sequential quarterly gain of 3.2%. Despite continued disruptions to global supply chain, we increase the year to-date gross capital investment of our fleet to $379.5 million, including $163.9 million in the third quarter. Third quarter revenues total $324.3 million and improvement of $48.8 million or 17.7%, compared to the third quarter of 2021. These same factors drove a 26.9% increase in rental revenue, which set another record in a quarter, totaling $224.1 million compared to $176.7 million in the third quarter of 2021. Continuing with other business segment results used equipment sales in the third quarter declined $10.8 million, or 34.7% to $20.3 million. New equipment sales improved by $4.1 million or 21.4% to $23.5 million compared to the third quarter of 2021, with the increase due primarily to higher sales of earthmoving and other equipment. Consolidated gross profits set another record in the third quarter, totaling $151.9 million, an increase of $38 million or 33.3% compared to the third quarter of 2021. A comparison of third quarter business segment margins to the year ago quarter reveals solid margin improvement with total equipment rental margins of 50.5% compared to 45.6%, and record rental margins of 55.6% compared to 50.9%. Income from operations in the third quarter increased 40.2% to $64 million, compared to $45.7 million in the third quarter of 2021. Net income into third quarter rose 55.2% to $38.4 million or $1.05 per diluted share, compared to $24.7 million or $0.68 per diluted share in the year ago quarter. SG&A expenses totaled $87.9 million in the third quarter, an increase of $13.5 or 18.1% compared to the third quarter of 2021. Turning to our capital expenditures and cash flow, gross fleet capital expenditures in the third quarter totaled $163.9 million including non cash transfers from inventory. Net cash provided by operating activities totaled $107 million in the third quarter, while free cash flow used in the quarter was $47.1, with the latter result reflecting the continuation of our fleet investment program. On September 30, 2022, the size of our rental fleet based on original equipment costs was approximately $2.1 billion, an increase of $305.4 million or 16.7%, larger than at the close on September 30, 2021. Hey, good morning, everyone. Hey, good morning, everyone."
}