{
    "symbol": "QFIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 15:54:08",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the 360 DigiTech Third Quarter 2022 Earnings Conference Call. Hello, everyone, and welcome to our third quarter 2022 earnings conference call. The industry has achieved substantial grants in preventing systematic risks protecting consumer rights and benefits, driving compliant business operations and promoting   competition. Over the past two years, the industry regulatory frame work gradually come into shape and the rectification project of the platform economy continued to progress. Currently regulator landscape had settled down in an article titled presenting and improving modern financial supervision published in the guide book of the 20th National Congress of the Communist Part of China Mr. Guo Shuqing, the Chairman of CBIRC said, financial innovation must be conducted under the premise of prudent supervision. We shall impose normalized supervision on the financial business of the internet platform companies and they promote the healthy, sustainable development of the platform economy. Since the beginning of 2022, the macro economy and whole income   have put pressure on Chinaâ\u0080\u0099s consumer and   in terms of market demand and asset quality. However, the market started to slowly improve in Q3 as we saw credit demand began to gradually recover and asset quality became relatively more stable than Q2. In Q3, total origination and facilitation volume was RMB110.7 billion, up 13% both year-on-year and Q-on-Q. Outstanding loan balance was RMB160 billion, up   year-on-year and 6% Q-on-Q. At as of the end of Q3, cumulative number of registered user exceeded 200 million for the first time. The cumulative number of users receiving credit lines and the conducted draw down on credit was approximately 43 million and 26.3 million, respectively, up by 17.6% and 12.8% year-over-year. Since the Q3 of 2021, we have proactively reduced pricing and optimized user structure in response to market and regulatory change. As our existing loans gradually reach maturity, our average price decreased slightly from Q2. Day one delinquency rate went down to 4.5% in Q3, from 4.9% in Q2, and is still improving. While updating customer base, we continue to optimize business operations on high quality users to increase their life time value based on our experience. In terms of key operating metrics, the average   per user and average ticket per draw down in Q3 were more than RMB14,000 and RMB8,000 respectively,   and 39.8% year-on-year. The average loan tenure also increased to 12 months in Q3, roughly one month longer, compared to the same period last year. On the customer front, as we upgraded our customer mix and accumulated better know-how about our high quality users, we will optimize the structure of our customer acquisition channels. The number of new user with granted credit line includes to 1.71 million, up by 19% Q-on-Q, while our marketing expense remained almost flat, compared to Q2. Meanwhile, we further expanded and diversified the customer acquisition channels by working with different types of traffic platform, including short and long   videos, social media, search engines, and food delivery etcetera. In addition, we improved our ability to identify users, especially high quality users and enhanced efficiency of user acquisition by upgrading our RTA models and the joint lease developing models with these  past ones. For instance, empowered by our upgraded RTA models, our ability to identify device improved to 90% in Q3 and our ability to identify high quality user improved by more than 20% Q-on-Q. As we continue to advance our tech-upgrading strategy, our capital-light and other cap solution business accounted for more portion in Q3. In Q3 loan originated and facilitated under the capital-light model and other tax solutions accounted for 58.4% of the total loan volume, up by 2.6 percentage points . And of the end of Q3, we cumulatively partnered with 58 financial institutions under the capital-light model. Additionally, we innovatively support a hybrid cloud model where financial health service and local deployment work side-by-side featuring set-up of retail credit infrastructure   in 20 days online and offline average and system deployment in full compliance. Thirdly, our funding structure and funding cost both improved significantly with ample liquidity in China's financial system this year. As a leading credit tax service provider, our assets are in high demand given our strength in scale, data, and risk management. As of the end of Q3, we partnered with 141 financial institutions, including more than 10 joint stock banks and a major rural and urban commercial banks with over RMB1 trillion AUM, giving us highly diversified funding source. In Q3, we facilitated the very first loan in the new credit rating system in  and received recognition from the regulator. Looking back at the past three quarters, we navigate through a constantly changing market by   planning and a prudent operating strategy, despite multiple headwinds in the macro environment. We believe based on our prudent approach to operations and risk management, our business can write-through the current business cycle and capitalize on the growing momentum whilst market recovers. Before I start my regular update, let me first introduce a new member of our capital market team, Ms. , recently joined us as a Senior Director of Capital Market. With our upcoming listing in the Hong Kong Stock Exchange, we really look forward to having   and other team members offer better services to our shareholders and broader investment community. From July to September, demand for consumer credits through our platform grew sequentially each and every month, although the velocity and the magnitude of such improvement were modest. During the quarter, we continued to push for steady improvement in overall asset quality by further engaging high quality new borrower base. Overall day one delinquency has been on a steady declining trend month-after-month so far in 2022, against a difficult macro trend early in the year. The continued improvement in day one delinquency further validate our strategy, strategic focus on high quality user segment. Revenue from credit driven service capital heavy was 2.9 billion, compared to 2.9 billion in Q2 and 2.6 billion a year ago. The year-on-year growth was mainly due to growth in on balance sheet loan volume, more than offsetting the negative impact from decline in average pricing of the loans. Capital heavy facilitation revenue take rate improved slightly versus Q2, mainly due to lower funding costs and the longer loan tenure. Revenue from platform services capital light was 1.2 billion, compared to 1.2 billion in Q2 and 2 billion a year ago. During the quarter, capital light loan facilitation, ICE and other technology solutions combined account for roughly 58% of total loan volume. Given the still changing microenvironment, we continued to increase the portion of loans processed through ICE and other technology solution to further mitigate potential risks. These solutions normally have different commercial terms, compared to the regular capital light loan facilitation. In the long run, we will continue to pursue tech driven business model, while striking a balance between various form of non-risk bearing solutions based on macro environment and operational conditions. During the quarter, average IRR prices of the loans we originated and/or facilitated declined modestly to just below 22%, well within the 24% rate cap requirement. Sales and marketing expenses increased by approximately 2%, sequentially in Q3. Please note, during the quarter, we added approximately 1.7 million new credit line use, compared to approximately 1.4 million in Q2. As such, average cost per dollar amount new credit line also declined by similar magnitude Q-on-Q. As always, we will continue to use lifecycle ROI and LTV as key metrics to determine the pace and scope of our user acquisition strategy to ensure the sustainability and the profitability of our operations. Overall, risk profile of our loan portfolio continue to improve in Q3 due to the contributions from new loans from higher quality user, but impacts from micro uncertainty and the latest outbreak of COVID case across the nation were still somewhat visible. Although we continue to take a prudent approach in booking provisions against the potential credit loss, re-evaluation of previous quarter's provision yield sizable write-backs as micro condition improved Q-on-Q. Total new provisions across four different categories for loans originated and facilitated during the quarter was approximately 1.8 billion, while approximately 300 million previous provisions were written back. With strong operating results and increased contribution from capital light model, our leverage ratio, which is defined as risk bearing loan balance divided by shareholders' equity was at historical low of 3.8x in Q3, compared to 4.3x a year ago. We generated approximately 1.6 cash from operations in Q3, compared to 1.1 billion in Q2. Total cash and cash equivalents was 10.8 billion in Q3, compared to 11.4 billion in Q2. In the last couple of quarters, we took more conservative approach to deploy our cash in day-to-day business, mainly due to micro uncertainty. Ideally, a significant portion of our cash would normally be allocated to support the security deposit with our institution partners or to fund   balance sheet lending in normal business growth. As we continue to generate healthy cash flow from operations, we believe our current cash position is sufficient to support the growth of our business to invest in key technologies to satisfy potential regulatory requirements and to return to our shareholders. In accordance with the dividend policy approved by our Board last year, we declared another quarterly dividends of US$0.16 per ADS for Q3. Although we managed to deliver a solid operating and financial results so far this year, in a very challenging macro environment. We still want to maintain a prudent approach to plan our business for the near-term, particularly given the recent resurgence of COVID cases nationwide and the subsequent restricted measures taken by local authorities. At this junction, we expect total loan volume for Q4 to be between RMB102.5 billion and RMB112.5 billion, representing year-on-year growth of 6% to 16%. In the recent years, we gradually advanced to more tax solutions starting from capital light to ICE to  models. Recently, we are   hybrid new business model that provides both our leading credit tax system and operation agent service. In this year, we are exploring different models together with various financial institutions. Going forward, as we serve more financial institution customers and transact more loan volumes under this new model. This new tech model cannot only boost our tech solution business portion and sustain our business sustainability, but also open additional markets for our long-term growth. The reason to our customer acquisition effectiveness is starting from the end of last year, we spent a lot of efforts on upgrading our IT infrastructure for online customer acquisition, which starts to bear fruit recently. Overall, we will continue to take the prudent business approach and  thatâ\u0080\u0099s kept long-term life time value of our customers in our operation. Thank you very much. So, for the Hong Kong listing time table, as you know we just released the PHIP this morning and the â\u0080\u0093 basically our intention is to follow the normal procedure of the Hong Kong Exchange to push for the final official perspectives release and then the marketing roadshow and then the listing. Because there are certain benefits to become   listing company Hong Kong, but I guess firstly, you need to finish this secondary listing and then when you meet certain criteriaâ\u0080\u0099s then you can apply for the dual primary. So, itâ\u0080\u0099s kind of a step-by-step saying, we are just right now still trying to finish the first step and somewhere down the road when the condition is ready, we are pursuing the next one. In Q3, we see the overall pricing got lower little bit compared to Q2. Thank you very much. And second question is regarding the loan  as Mr. Xu just mentioned, weâ\u0080\u0099re seeing better loan demand in the third quarter compared with the second quarter. So, thatâ\u0080\u0099s not the kind of the focus point and then also thatâ\u0080\u0099s not the kind of data we can provide in terms of which professional getting better in terms of the improvement, but just like Haisheng mentioned, if you â\u0080\u0093 you sort can imagine that, you know for those areas that have been locked down, for example in Shanghai during the March, April, and May period when the lockdown get released there certainly will be a pretty noticeable rebound in demand. Secondly, if you look at the   I want to point out, number one, the credit market is large market with multiple layers, different players make cross-over across the different layers a little bit. Number one factor, considering the macro environment since we took the prudent approach that risk management strategy will not drive up our ticket-size. Second point, as we are continuously upgrading our customer base this year, we are seeing the good customers can bring more value, create longer life time value and larger ticket-size. Then obviously if say for the second half of this quarter, since getting better then we will probably see better performance and vice versa. Thank you very much."
}