{
    "symbol": "QFIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-19 00:49:01",
    "content": " In Q2, total loan origination and the facilitation volume reached RMB98.3 billion up 11% y-o-y. Despite volatile macro-environment with the Shanghai lockdown and resurgence of COVID in multiple states, we delivered a solid performance, which once again demonstrated a reliance of our operations and risk management capabilities facing adversity. We have completed most of the rectification work according to the regulatory requirements and now in the stage of regular data reporting, regarding credit agency report by Julian , we have already submitted our execution plans to regulators and have since maintained close dialogue with them based on feedback and direction from the regulators. In July, CDIRC published a notice on strengthening the management of internet loan business of commercial banks and improving the quality and the efficiency of financial service; namely, Circular Number 14. The document is consistent with earlier guidance, including Circular Number 24 in 2021 and the Circular Number 9 in 2020 with the great period extended for one year till June 30, 2023. In addition, the document, once again, acknowledges the collaborated business model between commercial banks and related party in internet lending business. We have already implemented the specific requirements outlined in this circular, in our daily operations, In Q2, despite multiple headwinds from the macroeconomy and unexpected pandemic resurgence, we remain committed to our strategic set at the beginning of the year. In this extreme volatile market, we successfully executed our operational strategies and make great progress in funding, product risk management and customer base, as well as tech upgrading. Thanks to improved funding supply and the resumption of issuance of ABS, our founding cost for credit-driven loans decreased by 21 basis points on shore basis. Since the beginning of Q2, we have issued a total of RMB3.3 billion ABS at an average funding cost of 5%. On the customer acquisition front, we continued to upgrade our user base during the quarter by expanding the coverage of our intelligent market RTA, namely real time API model. In the online advertising channels, the number of high quality user with granted grant line increased by 51% from Q1. Looking across all customer acquisition channels, the credit approval rate of high quality user increased by roughly 20% on a sequential basis, meanwhile, we continue to enhance effectiveness of targeted customer acquisition. In Q2, we quickly adjusted our risk strategies in response to resurgence of the pandemic, including acquiring higher quality customers and gradually cutting off higher risk users. First payment, day one delinquency rate of new customers dropped to 3.01% in Q2 from 3.56% into Q1 and the first payment delinquency 30 days would that then 0.25% in Q2. In the meantime, they won delinquency rate of our current loan book gradually went down to 4.71% in June from 5.11% in March. Despite the impact of the pandemic, our overall asset quality improved in Q2, especially for new loan origination. If macro circumstances stabilize for the rest of the year, we expect our risk management strategy to bring further improvement in asset quality. In terms of tech upgrading strategy, we maintain that 55.7% of the loans originated and facilitated was under the capital-light model and other tech solutions in Q2. In addition, the China Academy of Information and Communication Technology, namely CAICT granted us among the first batch of companies under the Business Security Initiative, namely BSI, together industry joined including China Mobile and Group Baidu and . In Q2, we navigated through the extreme pandemic situation of city-wide lockdown and other multiple macro fluctuations with strong operational and financial results. We will maintain a prudent operational strategy, continue to upgrade our technology and customer base and finish our reification tasks. Despite the impact from COVID and the generally soft macroenvironment, we continue to push for steady improvement in the overall asset quality throughout the quarter and the year. With optimization of a risk model and contribution from high quality new borrowers, overall day one delinquency has been declining sequentially each and every month since beginning of this year even during the peak of the COVID lockdown in April and May. Then start to recover by July, it was already above 87%, the highest point so far this year. For new borrowers, 30-day collection rate was above 90% in Q2. These risk metrics continue to support our current user acquisition strategy, which focus on high quality segment of the market. The year-on-year growth was mainly due to growth in loan volume and the longer average tenor of the loans, more than offsetting the negative impact from declining in average prices of the loans. Capital heavy facilitation revenue take rate, actually improved modestly versus Q1, also due to longer loan tenure. Given the challenging microenvironment, we purposely increased the portion of the loans processed through and other technology solution to further mitigate potential risks so far this year. Overall in the long run, we will continue to pursue technology-driven business model and expect capital light and other technology solutions to eventually become a significant majority of our business. During the quarter, average IRR prices of the loans we originated and/or facilitated, further dropped to between 22% and 23%, well within the 24% rate cap requirement. Sales and marketing expenses increased approximately 11% sequentially in Q2, mainly because of the increase in high quality user acquisition. Specifically, if we exclude backend expenses, the increase in average cost to acquire a 360 new credit line user through third party traffic sources was roughly in line with the increase in the average size of the new credit lines. As such, the average cost per dollar amount new credit line remained relatively stable Q-on-Q. As always, we will continue to use lifecycle ROI and LTV as a key metrics to determine the pace and the scope of our user acquisition strategy to ensure the sustainability and the profitability of our operations. Although the overall risk profile of our loan portfolio continue to improve in Q2 due to the contribution from new loans from high quality new users, impacts from micro uncertainty and COVID were still apparent on old loans from existing users. With strong operation results and stable contribution from capital-light model, our leverage ratio, which is defined as risk-bearing loan balance divided by shareholder's equity was at historical low of 4.0 times in Q2 compared to 4.8 times a year ago. The sequential decline in operating cash flow was in part due to some COVID-related timing issue as Shanghai being gradually reopened in late Q2, some of the business and administrative procedures within the financial system were still not running as efficient as what normally should be, therefore causing some delays in collecting receivables from some our financial institution partners. As we continue to generate healthy cash flow from operations, we believe our current cash position is sufficient to support the growth of our business to invest in key technologies and to satisfy potential regulatory requirement and to return to our shareholders. In according to the dividends policy approved by our board last year, we declared another quarterly dividend of USD0.18 per ADS for Q2. As the participants are settling in a new regulatory environment, meanwhile, the on and off outbreak of COVID as well as associated measures to control the outbreak added additional uncertainties to an already soft macroeconomy. At this point in time, we would like to keep our full year loan volume guidance of between RMB410 billion and RMB450 billion unchanged representing year-on-year growth of 15% to 26%. We view this transitional year as an opportunity for us to further optimize our operation, strengthen our technology platform and upgrading our customer base to build an even stronger foundation for future growth. So under the current microeconomic and the pandemic certainties, so we saw most of the retail credit service providers, the financial institutions generally has encountered certain pressure, such as the increase of customer's early prepayment, the customer acquisition challenges after the pricing adjustments. Due to the impact of macroeconomy, financial institutions are under some pressures however, thanks to our number one, accumulated credibility in the market, then from our consumer loan business. Number two, financial institutions pressure from other asset costs actually in Q2, our high quality consumer loan assets is in high demand from financial institutions that is reflected by the job in funding costs that we already discussed. For your second question, as for the customer acquisition activities, due to the lockdown of pandemic of offline activities, our customer drawdown activities is to some extent massively impacted. My first question is about, our SME strategies, given the current macro backdrops, will we scale back the pace of our SME business as well as the offline sales team and, my second question is about the average ticket size. Regarding SME business; naturally, this is more signaling called than our consumer loan business that we take a more prudent approach on this business. For the second point, as for the customer acquisition channel, for external channels that we have less control we scale back the volume, and more focus on our direct sales team of customer acquisition. Number two, we focus more on the high quality customers, which bring more value to the business, two measures together that makes our ticket size rather relatively stable. One is on the SME as Haisheng mentioned, if you look at our earnings release, this quarter the credit line, the new credit line granted to SME is about RMB4.9 billion and the actual long facilitator or originated two SME is about RMB7.8 billion roughly. Compared to last quarter, that loan volume was a little bit over RMB10 billion. Secondly, regarding the ticket size, if you look at, for example average draw down we look at for Q2, is increased by roughly 5% sequentially. From funding cost, as Haisheng mentioned, sure, second quarter we're 6.8%. So, there's maybe still a little bit room to go in terms of lowering funding cost, given the current money supply is pretty available out there. There may be some -- still some room to go, but overall I would say from our modelling perspective, we are conservatively, you can model a rather stable take rate, if you want to add some to it modestly, then that's also fine. Basically my question is on the competitive environment in China at the moment given 360 DigiTech is also aiming for low risk bars, basically it's also from overlap with the targeted customer by like, and banks etcetera. After we lower our average product price, the overlap of target markets with other drawings, like you mentioned, and banks that increased a little bit. Management just mentioned that looking to the second half, we're going to see improvement in overall risk indicator. Firstly, improving the quality of nearly acquired customers with the comprehensive coverage of RTA and in duration of the model. And secondly, improving the data mining of the People's Bank of China Quality Report, we have set up a joint project team and derived 18,000 effective variables from the quality report, covering the optimization of several models, including competitive offer exploration, high quality customers identification, bad customers identification, career model, income and liability model, etcetera. Thirdly, we improved the resource allocation to high quality customers on the operation side, including pricing credit lines and promotions. We have seen that FTD 30 days, Q2 dropped by about 20% compares with first quarter and it's maintained a downward trend in July and August. As we focus more on 30-day delinquency rates, it has been the lowest in July and our future target will be within 2.5% to 3%."
}