{
    "symbol": "SYNA",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-03 18:16:04",
    "content": " In PC, our September quarter revenue was down 20% sequentially and down 26% year-over-year, below our expectations due to a significant weakening of PC end demand and, as a result, an increase in inventory held by customers. For the September quarter, our GAAP gross margin was a new company record at 57.1%, which includes $23.5 million of intangible asset amortization and $1.1 million of share-based compensation costs. September quarter non-GAAP gross margin was also a new company record at 62.6% and above the high end of our guidance range driven by a 100 basis point benefit during the quarter, which is not likely to repeat, along with strong product mix. GAAP operating expenses in the September quarter were $143.7 million, which includes share-based compensation of $31.5 million, acquisition related costs of $9.5 million consisting of intangibles amortization, and amortization of prepaid development costs of $2.5 million. September quarter non-GAAP operating expenses of $100.2 million were down from the preceding quarter and below our guidance, primarily due to lower than expected personnel related costs as we began to meter our hiring. We expect non-GAAP gross margin in the range of 60% to 62%, which at the mid-point of 61% would be approximately 150 basis points higher than the same quarter one year ago. We expect GAAP operating expenses in the December quarter to be in the range of $141 million to $146 million, which includes intangibles amortization, prepaid development cost amortization, and share-based compensation. As a result, GAAP net income per diluted share for our December quarter is expected to be in the range of $0.55 to $0.85 and non-GAAP net income per diluted share is anticipated to be in the range of $2.15 to $2.55 per share, on an estimated 40.5 million fully diluted shares. But if I look at the guidance that you're providing for the December quarter, it's off roughly $85 million sequentially and about the same amount from prior expectations."
}