{
    "symbol": "PRTK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 14:14:06",
    "content": " NUZYRA generated full year 2022 net U.S. sales of $136.8 million, which included $98.7 million from the core commercial business, a 45% increase compared to net U.S. sales of $68.2 million in the prior year and $38.1 million from the second procurement of NUZYRA under the BARDA contract. Total revenue for the fourth quarter was comprised of the following: NUZYRA net U.S. sales of $66.4 million, a 22.1% increase from $20.6 million in the prior year, which includes $28.3 million in net sales from the core commercial business, a 37% increase year-over-year compared to the same period in the prior year; and $38.1 million in revenue from the second procurement of NUZYRA under the BARDA contract. Government contract and grant revenue earned from cost reimbursement under the BARDA contract was $8.4 million, an 83% increase from $4.6 million for the same period in the prior year. Collaboration and royalty revenue was $0.8 million, which primarily represents royalty revenues earned on sales of SEYSARA in the U.S. Full year 2022 total revenue was $160.3 million compared to $130.2 million for the prior year, an increase of 23% over the prior year. Total revenue for 2022 was comprised of the following: First, NUZYRA generated net U.S. sales of $136.8 million, a 29% increase from $106.1 million in the prior year. Net U.S. sales was comprised of the following: $98.7 million from the core commercial business, which represents a 45% year-over-year increase compared to full year net U.S. sales of $68.2 million in the prior year and $38.1 million from the second procurement of NUZYRA under the BARDA contract. Second, government contract service and grant revenue earned from cost reimbursement under the BARDA contract was $21.1 million, a 33% increase from $15.9 million in the prior year. Third, collaboration and royalty revenue of $2.4 million, which primarily represents royalty revenues earned on sales of SEYSARA in the U.S. R&D expenses were $14.3 million for the fourth quarter of 2022 compared to $10.4 million for the same period in the prior year. During the fourth quarter of 2022, as a result of NUZYRA's strong sales since launch, combined with increased confidence in our projected future sales, we accrued a contingent nonrecurring compensation charge of $21.9 million payable in 2027. This includes the following: NUZYRA net U.S. sales, which are expected to be between $125 million and $135 million; BARDA government contract service and grant revenue between $15 million to $20 million; and royalty and collaboration revenue of approximately $3 million."
}