{
    "symbol": "MESA",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-09 21:56:08",
    "content": "  Operator: Thank you for standing by, and welcome to the Mesa Airlines' Q1 Fiscal Year 2023 Conference Call. Thank you, Christina and welcome everyone to Mesa's earnings conference call for its fiscal first quarter 2023 ended December 31st, 2022. On the call with me today are Jonathan Ornstein, Mesa's Chairman and Chief Executive Officer; Brad Rich, Executive Vice President and Chief Operating Officer; Michael Lotz, President; Torque Zubeck, Chief Financial Officer; and other members of the management team. There could be significant risks and uncertainties that could cause actual results to differ materially from those reflected by the forward-looking statements, including the risk factors discussed in our reports on file with the SEC. As you may know, we had a busy December quarter, negotiating and finalizing significant agreements with our airline partners and other key financial parties. Since our last call, we have been working diligently as we prepare to wind down our loss-making operation with American Airlines and transition our CRJ-900 flying to United Airlines next month. For the quarter, we had an adjusted net loss of $4.3 million on revenue of $147.2 million. While traffic remained strong and our pilot pipeline has improved significantly, capacity remains constrained as we catchup with unprecedented attrition experienced as a result of the industry-wide pilot shortage. First and foremost, we eliminated our loss-making operation at American Airlines effective April 3rd, 2023. Pursuant to that wind down, United agreed to add up to 40 CRJ-900s previously operated for American. To improve our balance sheet, we sold our remaining 8 CRJ-550s and agreed to sell down 11 CRJ-900s and 30 GE engines, reducing approximately $90 million of debt and generating approximately $70 million of cash. Additionally, United replaced our $16 million balance on our revolving credit line and provide an additional $25 million loan. Finally, we implemented new pay scales with our pilots and a new agreement with our flight attendants. Working closely with United, we intend to keep all the related crew domiciles and maintenance bases open. With our significant focus on operations, we believe the new United 900 flying will perform at levels similar to our existing E-Jet flying at United. In some good news on the pilot front, we continue to see strong levels of applications and reduced attrition. Currently, our monthly pilot attrition declined and has now stabilized approximately near pre-COVID levels. Highlights of the program include a 24-month flow to United Airlines and an industry-leading $110,000 sign-on bonus. Combined with our industry-leading pay rates, we believe this may be the best opportunity in the history of regional aviation for pilots to advance their careers. We are continuing to focus on pilot training, throughput, and have increased our resources around it. Last fall, we officially launched our Mesa Pilot Development or MPD program and recently welcomed our first graduates to the Mesa regional pilot ranks. As our -- with our significantly increased pay scale and participation in United Aviate program as well as our expanding training pipeline provided by MPD program and our new direct entry captain program, we believe Mesa provides a reliable and rapid path for pilots to join the regional industry and transition to United Airlines. We are pleased to be within the United ecosystem and are committed to training, retaining, and promoting pilots through to United. At this point, I'd like to turn to highlights from the past few months that speak to the leadership position that Mesa is building in the future of regional aviation and the greater sustainability that we hope to help enable the industry in years ahead. The two electric flight partnerships we invested in with United, Archer and Heart recently achieved significant milestones. Heart Aerospace also continued to make progress, meaning a number of milestones and garnering additional commercial aircraft orders. Meanwhile, our European joint venture, FLYHT , is on track to complete its operating certificate this spring, while initially operate regional jets, we believe FLYHT could also be a platform for us to expand new technology and eco-friendly flying in environmentally sensitive European markets. In the December quarter, we flew 50,940 block hours, 9.6% below last quarter, roughly in line with our previous forecast. Mesa, like many regional airlines, continues to contend with the challenges of the industry-wide pilot shortage on our block hour production. As Jonathan mentioned, attrition has come down materially over the past few months, and our classes are filled with a combination of new hires and captain upgrades. We remain focused on our transition to United and are continuing to work closely with their teams to prepare facilities, crews and maintenance efforts for CRJ-900 flying. As previously mentioned, United is covering the expenses to reconfigure and rebrand the CRJ-900 aircraft. For the first quarter of fiscal year 2023, revenue was $147.2 million, relatively flat compared to $147.8 million in Q1 2022. Contract revenues fell by $8.4 million year-over-year, driven primarily by lower block hours, partially offset by increased block hour revenue for our new pilot pay scale. Pass-through and other revenue increased by $7.9 million, primarily due to E-Jet maintenance, faster revenue and deferred revenue. Mesa's Q1 2023 results include, per GAAP, the recognition of $5.3 million of previously deferred revenue versus the recognition of $4.2 million in Q1 2022. On the expense side, Mesa's overall operating expenses for Q1 2023 were $144.7 million, down $7 million versus Q1 2022. This decrease was driven by lower maintenance expense, which fell $10.7 million or 18.1%versus Q1 2022 to $48.3 million. It's primarily due to fewer seat checks than in the first quarter last year as well as lower aircraft rent, which fell by $5.5 million and depreciation and amortization expense, which fell by $5.8 million. On the bottom-line, we reported a net loss of $9.1 million or $0.25 per diluted share compared to a net loss of $14.3 million or $0.40 per diluted share for Q1 2022. On an adjusted basis, Mesa reported a loss of $4.3 million or $0.12 per share compared to a net loss of $9.3 million or $0.26 per share a year ago. Cash for the quarter, excluding restricted cash, decreased by $1.6 million from the prior quarter ending September 30th, 2022, at $56.1 million, in line with the projection on our fourth quarter call. This amount excludes net proceeds from the sales that were not closed as of December period end, including our eight CRJ-550s, 11 900s, and the spared engines that Jonathan reviewed at the top of the call. Total debt at the end of the quarter was $701.3 million, up $86 million from the prior quarter. Additionally, we borrowed $25.5 million in the form of term loan from United, of which $15 million is forgivable upon the meeting of certain performance criteria. During the quarter, we also made scheduled debt payments of $17.5 million and finance lease payments of $3.5 million. As a reminder, we have $74 million of scheduled principal payments remaining in 2023 and after the repayment of debt associated with asset sales, we expect fiscal year 2023 year-end debt of approximately $535 million. This updated total from $435 million that we were expecting as of last quarter's call, primarily reflects the net impact of the reclassification of the RASPRO operating lease to a finance lease. With regard to fiscal full year 2023, given the ongoing major developments at Mesa that we will not be providing specific financial guidance at this time other than the block hours for the March quarter that was discussed by Brad earlier, and the total debt figure that I just mentioned. Based on our transition with American, we expect our deferred revenue to decrease by $11 million next quarter. Additionally, given the United's equity stake in Mesa is 10%, our current share count is approximately 40 million. In summary, our first fiscal quarter of 2023 was a critically important one for Mesa and one in which we believe we achieved a lot and made significant progress. Go ahead please, your line is open. Just as wondering, with this December quarter, you talked about losing about $5 million a month on the American contract. Yes, we recognized a fair amount of deferred revenue just given the change in the contract term with American Airlines. So, just for the -- I guess, as we think about the core United earnings power here, should we think about it as take out the revenue recognition and maybe take out the $15 million in losses that will go away, and that's your core until you start building up your block hours? Yes, we have some tail with American Airlines, expenses that are covered for the next upcoming quarter. But yes, if you defer the -- or eliminate the deferred revenue, then yes, that would be close to what we would expect moving forward. And then if I might, on the pilot side, which is kind of good news. It's really depend on, to some degree, the mix of aircraft. But I mean, I think our preference and United's preference should be to fly as many of the 175s as we can. I would suggest, depending on what you call maximum utilization, for example, if we could fly 11.5 hours, we'd probably be at the outside, call it, it could be as long as 18 months, and that would be conservative. However, in spite of the fact that we'd like to fly as much as possible, sometimes network is just not capable of getting that much time on every airplane. So, if we are around 10 hours, it could be probably 12 months, maybe a little better than that based on the current trends. But as you know, one of the problems that has been created by this legislation has been the fact that we've had this big attrition throughout the regional industry. And we're just running out of people to upgrade to captain and that is becoming an overwhelming issue where you're going to end up with trying to get people to 1,000 hours and get them to upgrade and not immediately get hired away by another carrier. Now, with the aviate program in place and with our pay structure, we think we will have addressed that to some degree. Go ahead please, your line is open. If you want to be able to judge whether we're going to have investment gain or loss, you're just going to look at the price of Archer because that's really all it amounts to is just the price of Archer. We are currently long as part of our deal, about 2.2 million shares of Archer. But that really -- and Torque, correct me, but I think that really is the entire mark-to-market is on Archer's stock. And then my other question is just, again, a clarification question as I -- and it's kind of what Savi asked, I think, just differently. So moving forward, we're obviously there's not a lot of deferred revenue to recognize that there'll be some that we'll recognize in other quarters. But moving forward, it will be -- we'll have compensation for the new pilot rates. But in this next quarter, we also -- we still have the American wind down that we aren't getting fully compensated for pilots in that just so you're aware. Similar line of questioning to the revenues, but on the cost line, when we take a look at kind of cost per block hour in the quarter, it seems like kind of reset around $1,100 per block hour getting 20% step-up from where you were kind of trending in the back half of last year. I think the $1,100 is the only thing that would change down the road from that is that we are on the maintenance side, probably a little lower than we would be on a normal run rate just because of the timing, we hit a peak last year and then we're on the lower side of that. And then offsetting that, I think, is the pilot cost because we have so many pilots in training, and we're hoping that, that -- the attrition kind of levels out and we catch up, then the pilot per block hour would start to come down, certainly not to where it used to because of the pay scale difference. But those are, I think, the two items that we need to continue to look at. I mean, it took a little time for us to come up with a LOPA that would work for everyone. Now my understanding is the conversion -- well, now the -- excuse me, I take that back, that there had been some discussion about changing the seats. We've got all that lined out and scheduled, and I don't expect any delays relative to the fleet. Yeah, I think it's fair to say, and I think understandably that obviously, both American -- excuse me, United and Mesa, we're taking a reasonably cautious approach. And again, the biggest variable, and I hate to keep saying this, but it's just -- it's not going to be equipment, it's not going to be our maintenance capability. It really boils down to pilots and attrition and our ability to continue to put out a good number of pilots through our training program, which we have worked really hard on expanding. And I think we've done a decent job, and we're starting to see some of those results. We're not going to -- that's not going to be an issue, obviously. But with that, I think the ultimate goal would be to us to operate all 80 of our E-Jets. Now that being said, there are a lot of other operators that may or may not be able to operate the 7060 aircraft that they have. So I think the idea, and I feel pretty confident and I would agree on this is we have training capability, and we've got almost 300 pilots flying the 900s. And I think for a while, I'm not saying for 10 years, but I would think that we'd be operating the airplanes in two years down the road. I don't think everyone will recover by then, and we'll still have room for those aircraft within the existing scope. I mean, you can normalize your engines, but the fact of the matter is there's probably aircraft out there that will come to an LLP event, which is up to almost $5 million event, and it just will never be done. And so if you take that expense out over the lifetime of the aircraft, that makes whatever aircraft it is going to be very inexpensive. We had been five years ago, when I look back and clearly, given where we are, I don't think anyone would argue that we haven't made mistakes. And we went out and literally started buying every engine, we could get a hold of, use knew it didn't matter. I mean, we had 51 extra engines, and we just sold 30 to United, and we'll net somewhere between $50 million and $60 million net of the debt. So, I mean, I think that it really revolves around where you are in the engine cycle. And there's no doubt that the get benefits of the cabin, on the 175 is, obviously is very attractive. And the major carriers have no problems putting 175 into very highly traveled business routes, shuttle markets, for example, that I don't think they would put a CRJ into. And on that just last point, if I could just sneak in one more about capability, as I recall, that at least the CRJ-700, the capability that they had to go into some of the ski destinations, which is obviously a very important market for United. Can the CRJ-900 go into those same ski, you know, the mountain destinations in whether it's Aspen, for example, the ones where I don't think you can fly an E175, and an Aspen fully loaded. There have been ongoing discussions regarding the 900s in terms of their capability, depending on who you ask, but I think our view here is that in all probability, the 900 would not work in places like Aspen or Telluride. I think the previously was that -- you had three aircraft, but maybe the third was a kind of a backup aircraft. We haven't been particularly pleased with the aircraft and ongoing conversations with DHL to potentially replace that aircraft, maybe with a newer 800, and we're adding this 800, which I personally feel that it really puts us in a sweet spot with DHL. That being said, it's obviously taken a long time, and we've been patient. And given the downturn recently in cargo activity, it's probably going to be a little bit slower than we'd hoped for. But we are going to add the fourth airplane, we'll look to figure out what we're going to do with 708, which is the third 737, which came into service, but that aircraft was in fact flying a full line. And Brad correct me if I'm wrong, but they do between like 100 and 120 hours a month, about 100, 120 hours a month in utilization. No, we were fortunate that like the other major carriers DHL appreciate the fact that things have been difficult and so we've made the transaction structured so that our feeling is on a run rate basis going forward. And I think that over time, particularly now that we have 800s on certificate, it could be an opportunity for us going forward to grow that business, as cargo recovers, because there's no doubt that things have slowed down right now. I know, it's been six weeks probably not a lot new there, but just curious on how that's progressing. And then we looked at place a couple of regional jets out there, and we're talking to a number of carriers about operating those aircraft. I think the feeling that we have is, I mean, it's a very long-term project in that. We think that this could be a platform, for example, for us operate electric aircraft, which we think will be really in high demand in Europe, just given the direction things are going towards sort of environmentally friendly alternatives. And, particularly in the CRJ-900, or in Europe CRJ-1000, it's just a matter of finding the right customer to make that happen. So we continue to plug along, I think that we feel that it's just going to be good to have an operating certificate. And to be frank, I mean, the backstop always was just the fact that we have a certificate is valuable for what we have invested in it, we think we can easily get, frankly, a multiple of that back, if we wanted, if we just were going to sell the certificate. But we have wonderful partners over there, guys who have a tremendous amount of experience in Europe, who really is why we made the investment, because we had so much confidence in them. And I think, over time, we'll be as well positioned to take advantage of opportunities that will develop in Europe, in particularly, given the gaps that have now occurred as a result of so many bankruptcies in the regional business over there. And how it's -- the regional business is much different there than it is here in terms of a lot of small carriers flying multiple pieces of equipment, different types of equipment. I think, it's fair to say that, we clearly had gone through a rough patch. We barely mentioned some of the things like the RASPRO agreement, the EDC agreement, obviously -- the Treasury, we made a significant modifications with Treasury, who by the way was very helpful. And now we just have to put it together operationally, we are very focused on pilot production since clearly, that makes a big, big difference. In other words, we're putting out more pilots than we're losing. So I'm hoping, and I think we believe that over time, we'll start to see the benefit of all this, and it will all come together in terms of a much more stable operating platform, and renewed profitability. And also, it would be remiss not to mention the fact that through the wind down, we've been working very closely with American and maintain really good relationship with them. And I think that since we began to wind down, I think we've canceled two flights. And certainly, United is really stepped up and helped us and it's a good thing to know so many people that we have over there, the support that we've gotten from United has been fantastic. And I have to tell you, we've been really appreciative of what they were able to do to help us work through this difficult period. We continue to work hard, get the company turned around, and we look forward to talking to you next quarter."
}