{
    "symbol": "HQY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-06 22:04:07",
    "content": " HSA members reached $7.4 million, up 26% year-over-year, including 12% organically and HealthEquity HSA members grew their assets to a record $20.3 billion at quarter's end, up an even larger 35% from a year ago. As Ted's going to detail, Team Purple started fiscal '23 with very strong sales results, including a fiscal first quarter record of 159,000 new HSA's, up 38% from 115,000 new HSA's opened in Q1 of last year. Custodial revenue grew 26% to $59.4 million in the first quarter, compared to $47 million in the prior year first quarter as 28% growth in average HSA cash and 47% growth in average HSA investments more than offset a 10 basis point decline in the annualized yield on HSA cash. Your line is now open. Your line is now open. Your line is now open. I think, you know, probably the biggest thing that I would note is -- it's a little bit of a continuation from last year and then I'll ask Steve and Ted if they have commentary, but which was last year we had with regard to new logos and the like, which I think is where your question is. And so, people who are in -- if they had an HAS, there's a lot of movement across companies, thereâ\u0080\u0099s a lot of people in the benefits universe, who still think about like the only way to use in HSA and a qualified plan or -- qualified plan just like kind of a lower cost health plan as opposed to, you can create, it's very flexible instruments, you can create a very rich benefit and of course it's a little bit come to me -- it reminds me of what happened in the early years of 401(k) where the benefits world was like, well, people like pensions better than 401(k)s except that as people got comfortable how to use a 401(k). Your line is now open. Your line is now open. Your line is now open. So, first point is from this perspective, I think the first quarter was in some ways, really good news for us our largest product is of course HSA and it's not only our largest, but our -- it's our growth engine. The only things I'm going to add is it -- through our health plan distribution, the cost of the services that we provide is a relatively modest component of the total cost of the decisions being made in choosing health care provider and not only that choosing a high-deductible health plan or finding ways to have more of your teammates choose that health plan is actually a cost savings opportunity, regardless of what the HSA fees are to Jon's point. Your line is now open. So I would expect that some version of what you're describing ends up being true and that as a result, for example, maybe the case that we won't see on net as healthy average cash balance growth as we did last year, but maybe we'll see a little healthier spend and of course we would over the long-term rather have the balanced growth, but I think there's I guess again -- without having seen it in the data yet. Your line is now open. But that's sort of held pretty well and you do make one point that I think is very important and that is that while one might reasonably take the view that banks and alike have a factored what their own estimate of when, where the Fed ends up and where it stops into the rates they're willing to pay on cash quantitative tightening that is to say, the reduction in the size of the Fed's balance sheet is still a little bit -- is still somewhat out there in terms of its impacts. Your line is now open. Your line is now open. I think, well, let me say, I think, I want to be clear, what we're saying is, with regard to the Enhanced Rates piece that piece will grow from $1.3 billion at the start of last year -- at start of this year to something around double that, and then that $1 billion that's in variable cash -- I would expect that number will be a similar next year in percentage terms, it's again, it depends on the time of year and so forth, but it's between 5% and 10% of our total cash and so to the extent, the total cash grows, it will grow too. Your line is now open."
}