{
    "symbol": "CDK",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-02 22:43:23",
    "content": "  Operator: Thank you for standing by, and welcome to the Q1 2022 CDK Global, Inc. Earnings Conference Call. As a reminder, today's conference call is being recorded. Joining me on today's call are CEO, Brian Krzanich; Chief Operating Officer, Joe Tautges; and our CFO, Eric Guerin. Our earnings press release was issued after the close of the market today and is posted on our Investor Relations website at investor.cdkglobal.com, where this call is being simultaneously webcast. In addition, our website includes an updated Excel schedule of supplemental financial information and a copy of our results presentation that we will be referencing during our prepared remarks. Throughout today's call, we will be discussing our continuing operations only, which do not include the international business results, which are presented as discontinued operations. Please also note that our growth percentages refer to the year-over-year change for that period, unless otherwise specified. These statements involve risks and uncertainties as further detailed in our filings with the SEC, which could cause actual results to differ materially from those mentioned in the forward-looking statements. With that, it's my pleasure to turn the call over to Brian. CDK is off to a strong start to fiscal 2022 with revenue growth of 6%, EBITDA of $170 million and EPS of $0.77 per share, and I'm pleased with these results, which met our expectations despite a modest slowdown in the transactions business, driven by inventory shortages in the auto market. We've been focused on making investments that strengthen our core business, including significant improvements to our customer service and technology. And we're connecting the industry end-to-end and creating a digital, modern-retailing process that rivals with anyone else can bring to the market. And we're seeing the benefits of those investments, with strong Net Promoter Scores up 30 points since 2019 and 11 straight quarters of DMS site growth. Last month, we hosted CDK Connect, a customer-focused industry event that highlighted our recent technology wins. We are pleased to have the opportunity to bring together dealers, OEMs and software developers and share the latest technical advancements we've made at CDK. At the event, we demonstrated exciting new advancements in a variety of workflows, including service and back office functions. And Joe will go into more detail, but I especially want to highlight that we've completed our 100-day plan to integrate Roadster into our core systems, including Elead CRM. The modern API architecture, Fortellis, accelerates interconnection within the industry ecosystem at a pace that isn't possible on legacy platforms. Without the new capabilities we've built, the Roadster integration would have taken 2x to 3x longer to complete. And as I mentioned, we are bringing all the technology together to allow dealers to deliver a frictionless process for consumers in purchasing their vehicles, whether they want to complete the transaction from their living room or start research at home and then visit the dealership, truly delivering a seamless omnichannel experience. Our dealers deliver millions of new and used vehicles each year, and every one of those vehicles needs insurance. And Salty leverages data and innovated technology to integrate insurance offerings into a dealer's existing process, opening an entirely new TAM of approximately $1 billion for both dealers and CDK. The dealers are excited by the opportunity, and I'm pleased to welcome Salty's team to the CDK family. While we're excited about our work for the dealer body, we continue to believe CDK is well positioned to serve as a bridge between the dealers and OEM. CDK's position of an intersection of data flow across the industry, allows us to develop solutions that benefit the broader ecosystem. In the last quarter, we worked with a select group of OEMs to ramp-up real-time inventory reporting. We also signed a data sharing agreement with one major OEM, come and build data; and continue to grow access to connected vehicle data with a number of OEMs via Fortellis. To summarize, CDK has pivoted its business dramatically in recent years. And through our technology, we unite dealership employees, dealer locations, software developers and OEMs, improving their business efficiency while enhancing consumer experience. Now before I pass things over to Joe, I'd like to thank our employees, our customers and our partners for helping get our fiscal year off to such a great start. As Brian said, we are excited about CDK's outlook for 2022 and the strong start we have had versus the plan we set for the year. But first, as we have for the last several quarters, we've included a few charts with data we are seeing in the automotive industry. We also provided a few slides that cover market trends, how we are positioned to lead the creation of a unified digital buying experience for dealerships and the platform architecture we have built in support of this vision. has mentioned, we saw associated headwinds in our transactions business driven by these inventory challenges, and believe the trend could continue throughout the remainder of the fiscal year. CDK has been a net beneficiary of this consolidation, which we expect to continue in coming quarters we believe that some of this consolidation is happening as a response to the challenges from the rapidly changing retail sales environment where automotive customers are seeking a smooth digital buying experience they found in other consumer retail models. The combination of consolidation, strong sales efforts driving competitive wins and continued healthy retention have resulted in notable site growth in Q1. Auto sites were up 1.6% and reached the highest level since 2017, while adjacency sites grew 4% and hit another all-time high. Auto revenue per site grew 7%, with 2 points of growth contributed by the Roadster acquisition. Revenue from 3-plus site dealers was up double digits, with 2 points growth attributable to Roadster, while revenue from 1 to 2 site dealers fell slightly. Adjacencies revenue per site was strong, growing 7%. We had notable sales wins across our strategic applications with particular adoption of Elead, CDK Service, Doc Cloud and Cloud Connect. Earlier, Brian mentioned our CDK Connect event last month, where we were able to layout our vision and share key initiatives to our customers and partners. Our software is used in some fashion across more than 12,000 dealerships. At this event, we highlighted the Roadster integrations that now allow for the total digitization of the sales process. This provides a modern, flexible buying experience that meets the needs of a wide variety of consumers. We have also merged our Roadster Elead engineering teams, which will enable us to build a continuous purchasing workflow, which will allow our customers to target transaction times below 1 hour. Predictive service, leveraging the Neuron platform, can drive increased service revenue opportunities by helping technicians efficiently analyze the vehicles' service needs. By rethinking the consumer journey altogether, we can help consumers accomplish more through dealers, significantly deepening the relationship and increasing customer lifetime value. Insurance is one of the most obvious parts of the car buying process that is ripe for disruption, and we're helping dealers become the disruptor for change. As Brian mentioned, Salty opens a large new total addressable market for both dealers and CDK. Salty combines data, technology and process integration to streamline the insurance quote process that fits seamlessly into the vehicle sales process. Commissions on insurance originations and renewals will over time, while a strong recurring revenue stream for both CDK and dealers. To conclude, I'm proud of the progress we've made over my years at CDK and how we are positioned for 2022. As Brian and Joe mentioned, we had a nice start in 2022 that puts us on track for the year. I'd like to remind everyone that results are for continuing operations only and do not include the International business, which is presented as discontinued operations. First quarter revenue was $440 million, up 6% versus last year. Core revenue growth, excluding the impact of the acquisitions, was 4%. Subscription revenue was $345 million, up 7% from 2021. This reflects growth in core DMS and applications and the impact of acquisitions, partially offset by the impact of ASC 842 lease accounting, which shifts a portion of revenues from certain products out of subscription revenue to other revenue. Transaction revenue was $43 million, down 3% versus 2021, driven by lower vehicle registrations revenue as vehicle sales were impacted by supply chain disruptions. Other revenue was $52 million, up 14%, reflecting higher hardware sales and revenue timing under ASC 842 lease accounting standards. Higher EBITDA was driven by income on higher revenue, partially offset by higher employee costs for investment-related headcount increases and the impact of annual merit compensation increases, which took effect in the quarter. Earnings per share for the quarter rose 22% to $0.77, primarily reflecting reduced interest expense driven by debt reduction and the lower tax rate in the quarter. Free cash flow was $44 million, down from $72 million last year. We paid dividends of $18 million in the quarter and we also repurchased $88 million of our common stock, bringing us to $100 million of repurchases since we restarted the program late last year. Our balance sheet remains strong with net debt to adjusted EBITDA at 2.3x, still slightly below our target of 2.5 to 3x. As Brian and Joe mentioned, we do see headwinds in the transaction business based on lower dealer inventories, but we expect to offset the impact with solid performance in the remainder of the business, including ongoing contributions from Roadster. With respect to quarterly growth cadence, similar to last year, we expect revenue to be flat to slightly lower sequentially in Q2 compared to Q1, with the normal seasonal slowdown in the transaction revenue before we see revenue acceleration in the second half. Similar to Q1, year-over-year EBITDA growth will remain muted in Q2 as cost savings initiatives in 2021 create more difficult comparisons for the first half of 2022 before an expected second half acceleration. In summary, we had a solid start to the year and are on track to meet our financial targets while continuing to invest to support our customers and drive innovation. First, you should just remember like roughly 10-ish percent, maybe even a little bit less of our business is transaction oriented mostly around things like registration and credit checks. And so whether you're selling a new or a used car, you still have many of those types of transactions. So we saw like 2% to 3% decrease in transactions, whereas I think if you looked at sales of new cars and all, it's down quite a bit more than that beyond 10%, 10% to 15%. And if you listen to the OEM calls that have happened so far, they're not seeing it either. The only thing I would add is we've spent a lot of time, Matt, around data collection. And if you look at Slide 17 in our posted earnings presentation, it actually shows you the month-by-month trend the month of September got quite a bit worse for the automotive market, large. So if you say over 50% of people sales go through our software in our system, selecting that data, looking at it, September was as low as what you saw during COVID shutdown. And so like Brian said, our business model is very resilient and performing quite well. With all that said, and dealers are managing it well, but certainly continues to be a headwind. So the offset to that, then obviously, it seems like the subscription side of your business has maybe been performing a bit ahead of your expectations. I mean I think in general, again, if you look at our revenue per site, it's continued to increase now. And a lot of that there's elite service, both of those two are really the big drivers, the bigger drivers of that revenue per site and our overall growth. That and, we just continue -- there's 2 other factors that have gone probably a little bit better than what we had anticipated originally, which is just new DMS sales continues to go well and then our retention. So our retention is at the highest level I can remember at, it's between 96% and 97%. So the whole work we've done on NPS scores, customer satisfaction, improving our products, all of that's paying off in phenomenal retention. And so we probably forecasted a little bit lower, but it's continued to do well as well. At 5 to 10-point locations dealerships, you had 3 competitive wins. Overall, we saw a very good order continuing the trend of what we've seen, which is progress in winning competitive sales is across the spectrum, but especially in those larger, more complex multi-dealer sites. And as Brian just talked about in the comment to Matt, we are just excited about the subscription growth acceleration. When you look at site growth, we're at 1.6% growth this quarter, and we just continue to see really good momentum there. And as you look at revenue per site and applications, and you could see the wins and the installs. Our installs were up over 50% for the DMS year-over-year, Q1 over Q1. And then the revenue per site was up 7% and then revenue and 3-point plus sites was double digits, up double digits. And then just with Fortellis, you had a 600% increase in transactions, and you have 30 applications that are now integrated into Fortellis. So Fortellis is an API layer that allows, as we create APIs off our own DMS or off Elead or off Roadster or other applications, allows data to move in and out and oftentimes have some form of algorithm or calculation process against it. You want to be able to move data in and out of a dealership, you can do that. So it doesn't necessarily allow you, if you're a dealer and you want to download or you want to install our service application. What it does do, though, is that it enhances the value of our service application because there will be APIs that you can access at a low or no cost that allows you to look at your parts inventory, the amount of work that went through each day, things like that, that they use them to understand their business better. There are some like our service API that Xtime uses and Cox, for example, if they -- if somebody uses Xtime in a our DMS, there is quite a bit of calculation and management that we do on our end of the data that flows in and out of the DMS, and we charge for those types of APIs. And then the thing that I really want you to understand is, Joe mentioned in his statement that he -- we met all of our 100-day integrations of Roadster. And if you look at Salty, we've already integrated much of the Salty application into our software and our ability to really enhance what Salty can do. We have several others in the works where those APIs in the whole Fortellis platform allows us to do that quite quickly, quite efficiently and then allows us to make money that way. And if you look at what we're doing versus what others are doing, others are taking a very -- the new competitors come into the space, take a very OEM-centric view of the world and create this walled-garden approach, which has consequences for dealers who want flexibility. And so the part that's so important for Fortellis, as Brian was saying, is just our open and agnostic approach is resonating with dealers to encompass into an experience that puts the consumer at the heart of it rather than have to have them pick or, if you will, be part of sort of the more siloed-technology approach. I would tell you it's at or a bit better than, I think, what we see the market performing at. Certainly, when you look year-over-year, you see it down a bit. And then secondly, when you look at it sequentially, the business has largely flattened. And I think in general, we're comfortable at this level of investment right now. And I've always -- little cautious I tell you, and it will never go up. But with everything we see right now with all of our plans that we have in place right now, we're very comfortable. For the most part, we're translating those efficiencies into just moving faster on more products. And I just think once you do it, you're doing it for life. I can tell you, again, make sure you understand that there's multiple ways. Part of the reason, our retention rates and part of the reason, we're getting wins in DMS, and we're getting some of the small dealer wins, and we've stabilized the small dealers is through Fortellis and making data available more easily. And then we make -- I'd argue a ton of money through partnerships and integrations of acquisitions at a much, much faster rate and a much deeper integration that was not possible before Fortellis. And so that's the comment that Joe made is that because we're open and because we're agnostic, dealers are more satisfied, dealers are more happy with our retention and acquisition wins are up. We are making money through transactions, but we make even multiples of that through those integrations and being able to acquire and partner with companies much faster and much lower cost and much simpler and we're at a much deeper level. So if you took a look at Salty, and you didn't have Fortellis. You took a look at Roadster, and you didn't have Fortellis. You'd be talking months, if not quarters, in order to integrate those things and get the same results. So on Salty, we're really excited. And when you look at it, it really resonates with dealers. It's an opportunity when we work with our dealers, they just want to create a better end consumer buying experience. And with Salty provides so much value is the tech integration Brian's described with Fortellis, just creates this seamless experience for consumers to really benchmark. And if they want to bind insurance at the moment of purchase, they can do it within minutes, right at the dealership and with very, very strong insurance carriers. Yes, we've talked about Progressus, we've talked about travelers, and we have a very full lineup of insurance carriers. We are connecting that in to really provide an opportunity for insurance carriers to connect with the consumer, and that provides a brokerage commission as part of binding the insurance. When you say about how we're pivoting the company, it is really about transforming how a car has bought, including all the elements of it, insurance being the case in this situation. This is a -- so again, the integration of Salty into our DMS, that automates the process flow. So it's seamless, both to the consumer and to the dealer and the dealer is incentivized because they're getting a percentage of this as well. And that's a very interesting business model that we think the more of those that we can find, those will be the ones that really can propel us into the future. And then, yes, sure, if markets become less competitive and insurance rates went up, ours is based on a percentage, so our percentage would go up. But we're really focused right now on providing a value to the consumer, but then incentivizes them to be interested and hence, our business grows at a faster rate. So for other question, you added another 45 auto DMS sites quarter-on-quarter. Yes, I think there's a lot of positivity across the board. The technology team, the marketing team, the sales team, the implementation team, the customer care teams that when you look at how we're performing right now, I think we're hitting on all cylinders, quite frankly. When you look at the market dynamics, you really are seeing an acceleration of consolidation in the automotive dealership marketplace. And I would just tell you, we've experienced substantial growth, both year-over-year as well as we're starting to see that growth really accelerate sequentially around these consolidations. If you recall, we over-indexed to the larger dealers. And so yes, I think you're right for calling out the 45-site sequential growth. Clearly, there's some quarters that ebb and flow here and there. But nonetheless, we're seeing record retention. Seeing our customers who are bigger buying, consolidating, and we are the strategic partner connector, if you will, between OEM, the dealer and all the consolidation and our business is benefiting from that. We're, as we said, really excited about our business. I think this quarter really represents the start of 2022 with right on our target and our forecast, as Eric mentioned. And so I'd just like to leave with thanking all of the CDK employees, right, who continue to do a great job. Even as COVID has continued to play a factor, the team has continued to accelerate our improvements and our growth."
}