{
    "symbol": "SEAT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 20:56:32",
    "content": " During the third quarter of 2022, the live event demand environment remained healthy, and we are proud that Vivid Seats continued to set new records for third quarter marketplace GOV and revenues and once again achieved our highest quarterly total marketplace orders ever. We're also looking at, I think as you look through the new partners that we launched, we've talked about the New York Post today, we certainly also in the quarter, launched collaborations with brands like Doritos, Snapchat, and we're in early stages on collegiate NIL deals do. So when you look across that spectrum of I think the programs that we offer with consumers, combined with capabilities that we're investing in on the retention and brand marketing side, we continue to be really enthusiastic about the results that we're seeing. Yes, I think a lot of what we learned and as you look at some of the creative that we've launched, in particular, I think we're really proud of what we're doing around the 11th ticket is that fans with high intent and high kind of category awareness, really the rewards program resonates strongly with them. And I think as you look at the offerings that we've built there, where as we've mentioned in today's remarks, we continue to enhance the number of categories and games, I think we see the ability there to engage consumers and keep them within our ecosystem where we can then utilize our marketing capabilities as really a strong demonstration of our investment in kind of our product suite, but also our product differentiation. When you take a step back, a lot has changed across the industry and for vibes as well over the last couple of years, I guess, with the kind of economic headwinds that seem to be appearing as we enter 2023, why is Vivid in a better position than ever to weather the storm and potentially excel in an uncertain environment... And when you look at us on every line of the P&L, contribution margin positive, free cash flow positive, EBITDA positive. And then when you then look at, I think, the product and service differentiation that we've talked about, whether that is VividPIX in a unique way to engage a rewards program that nobody else has, industry-winning customer service. I think we remain really bullish that across the board with our financial trials, our capabilities on the product side and our service differentiation that truly we are best positioned in the competitive set to continue to win customers, but maybe to more directly answer your question, whether whatever foreseeable storm is ahead of us."
}