{
    "symbol": "SEAT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 13:57:08",
    "content": " Your line is open. Your line is open. We've talked about having our user base there on that platform just grow 300% on a year-over-year basis where we can then use those two ecosystems to drive engagements where â\u0080\u0093 where we're looking at that with, now I think on average close to 15 entries per month on that. Your line is open. Look, I think it starts from just fundamentally a belief that, I think we have strongly that promoting competition is a good thing, and when fair competition exists we see platforms like Vivid Seats continue to innovate on behalf of fans with, as we talk a lot about here, best-in-class customer service, a loyalty program that continues to drive differentiated value, Vivid Picks; that all exists when there's a fair competition. Your line is open. Your line is open. Your line is open. So our perspective has always been, we are in this for the long haul and as we've prioritized, I think, making sure that we are diligent and smart about how we invest to both remain profitable, drive growth, and continue to grow our cash balance for potential offensive inorganic activities, I think, what you see is continued investment in the sustainable cohorts of customers that we continue to reap benefit from both now and we think even more so in the long term. And where we've seen again, the various increase in repeat rates across categories for us at the highest levels it's ever been, I think, that's certainly something we continue to drive down and every time that happens is an incremental order since they are all increased repeat rates with a higher mix into that, we think that's actually a very strong accelerant into, call it the sustainability of our competitors. Your line is open. Your line is open. Your line is open. I think when you look at, I think, what we've invested in and what we've built and the decisions that we've made, I think, what we've really have is a long term sustainable model with really great unit economics, investments that, I think, we believe will get a lot of leverage on in the long term, whether that's our repeat rates in our loyalty program, whether that's engagement in Vivid Pix, or even more recently, I would say, truly long-term economically, sustainable brand channels, right?"
}