{
    "symbol": "MDWD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 12:04:10",
    "content": " The study was a multicenter prospective randomized placebo-controlled adaptive design study, evaluating the safety and efficacy of EscharEx in debridement of VLUs compared to Gel Vehicle as a placebo control and compared to the nonsurgical standard of care of either enzymatic or autolytic debridement. Secondary and exploratory endpoints assessed time to achieve complete debridement, reduction of pain, reduction of wound area, granulation tissue, and quality of life, enabling evaluation of clinical benefits compared to both gel vehicle and a standard of care. 63 of the patients treated with EscharEx achieved complete debridement compared to only 13% of patients treated with standard of care, four patients out of 30 patients within the 14 days assessment period and the time to achieve complete debridement was significantly shorter. The above efficacy results achieved our key goals in this study; one, to demonstrate that EscharEx efficacy in debridement chronic wounds; two, to establish a clear improvement over the current standard of care; and three, to give us a clear guidance for future pivotal studies in the indication of our interest. With that, we achieved additional goals for this Phase 2 study, which was to assess the EscharEx safety and tolerability and show that it's well tolerated treatment for debridement of chronic wound. Let me now turn the call over to Professor Rosenberg, our Chief Medical Officer, to provide us with some color regarding the unmet need, the role of debridement in wound management, the robust clinical evidence generated to date, and how a product like EscharEx would fit the current treatment paradigm. EscharEx demonstrated significant higher incidents of complete debridement within up to eight applications, and that's compared for both Gel Vehicles and nonsurgical standard of care. Lastly, data from our ongoing Phase 2 pharmacology study, EscharEx demonstrated safe and effective debridement of lower leg ulcer, both diabetic food ulcer and venous leg ulcer with few daily applications. Let me turn the call over to Dr. Cyaandi Dove, who treated more than 10 patients with EscharEx as a principal investigator in both Phase 2 studies, to share her clinical experience with EscharEx and how a product like EscharEx would fit within the current wound management practice. And maybe building on that, I mean, based on the Phase 2 data, and I guess this is for the company or Dr. Dove, do you envision an evolution of standard of care potentially where EscharEx replaces the nonsurgical debridement, but where most patients continue to get surgical debridement and thus the nonsurgical essentially an adjunctive process or do you anticipate earned vision essentially a reduction in the volume of sharp debridement and the more standalone nonsurgical only debridement technique? And given the feedback we get just in the last conference in the U.S. SAWC, we believe that given this efficacy of EscharEx providing an effective and prompt debridement, clear debridement, preparing the wound bed for the next stage of healing, we believe EscharEx can be positioned as a first-line therapy, taking not only -- not only replacing the current enzymatic standard of care, but rather take also chance from the autolytic as well as on the sharp debridement."
}