{
    "symbol": "MDWD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 14:30:04",
    "content": " Total revenues for the full year were $26.5 million, compared to $23.8 million for the year ended December 31, 2021, an increase of 12% year-over-year. Revenues from products were $5.3 million, a decrease of 44%, compared to the $9.6 million in 2021 due to BARDAâ\u0080\u0099s procurement completion for emergency stockpile. Total revenue for the fourth quarter of 2022 were $11.6 million, compared to $5.5 million in the parallel period, primarily driven by the BLA approval milestone of $7.5 million from Vericel. Revenues from products were $1.2 million, compared to $1.9 million in the fourth quarter of 2021 due to $1 million decrease in emergency stockpiles procurement by BARDA, partially offset by our European and international sales increase. Gross profit for the year was $13.2 million or 50% of net revenues, compared to a gross profit of $8.8 million or 37% of net revenues for the same period in 2021. Gross profit for the quarter was $8.2 million or 70% of net revenues, compared to a gross profit of $1.5 million or 28% of net revenues for the fourth quarter of 2021. Both for the full year and the quarter, gross margin improvements were driven by the $7.5 million milestone payment from Vericel upon the BLA approval. Operating loss for the full year was $8.3 million, compared to an operating loss of $11.2 million for the year ended December 31, 2021. Operating profit for the quarter was $2.1 million, compared to a loss of $3.5 million in the fourth quarter of 2021. Net loss for the full year was $19.6 million or $3.93 per share, compared to a net loss of $13.6 million or $3.50 per share for the year ended December 31, 2021. Net loss for the quarter was $7.5 million or $1.18 per share, compared to a net loss of $4.2 million or $1.07 per share for the fourth quarter of 2021. Adjusted EBITDA for the full year was a loss of $4.4 million, compared to a loss of $8.3 million for the year ended December 31, 2021. Adjusted EBITDA for the fourth quarter was a profit of $3.4 million, compared to a loss of $2.9 million for the fourth quarter of 2021. As of December 31, 2022, MediWound had $34.1 million in cash and short-term investments, compared with $11 million as of December 31, 2021. In February 2023, the company received a $7.5 million milestone payment from its partner Vericel for U.S. FDA approval of NexoBrid in December 2022. Our positive momentum continues and we expect 2023 to be driven by several significant categories; strong growth and meaningful revenue for NexoBrid fueled by commercial launches in key markets such as the United States, India and Japan; scaling up our manufacturing facility to ensure we can meet the growing global demand for our products; initiating a Phase 3 pivotal trial for EscharEx targeting $1 billion market opportunity; and finally, we look forward to sharing more about our MW005 development plans for BCC. So Japanese market definitely is one of the biggest healthcare markets in the world, probably, if we want to look at the numbers, so we see that, probably, around $1.5 million that we see in the first year."
}