{
    "symbol": "DNUT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 12:20:03",
    "content": " The continued progress on our long-term strategy was well apparent in the first quarter with organic revenue of 15%, driven by strong performance across all 3 segments. Our strong revenue growth in the quarter led to an increase in adjusted EBITDA over the prior year to $48.9 million, with consolidated margins in excess of 13% as we expanded margins in the U.S. and Canada and Market Development segments and excluding a onetime benefit in the previous year, our International segment as well. The increase in our points of access and strong growth in revenue per DFD door allowed us to expand adjusted EBITDA margins by 90 basis points in the first quarter to 13.3%, even in this inflationary environment. Organic growth for the quarter was 36%, with sales per hub up nearly 50% from a year ago with the same number of hubs, showcasing our ability to increase revenue in a very capital-efficient manner. In the first quarter, our Krispy Kremers have once again shown that our beloved brand and our omnichannel approach is not only resilient in this turbulent macro environment but continues to thrive, with net revenue growing 15.8% year-over-year to $373 million, organic revenue growing 15.0% and adjusted EBITDA increasing 5.4% to $48.9 million or a margin of 13.1%. Total company adjusted EBITDA margin was 130 basis points lower than the same quarter last year due to the impact of public company costs, and we also lapped the receipt of a business interruption insurance payment in the U.K. 1 year ago of $3.5 million. In the U.S. and Canada business segment, total revenue increased 13.8% in the first quarter to $253 million and organic growth was 9.7%. Adjusted EBITDA for the total U.S. and Canada segment in the first quarter increased 22% to $34 million, with margins expanding 90 basis points to 13.3%. Adjusted EBITDA in the first quarter for Market Development increased 3.6% to $11.3 million, with margins expanding 190 basis points to 35%. After spending $29.5 million on CapEx in the first quarter for the full year, we still expect to spend between $115 million and $120 million or less than 8% of revenue, including investing in approximately 15 production hubs and more than 30 Insomnia Cookie shops."
}