{
    "symbol": "DNUT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 11:55:27",
    "content": " We made terrific progress on our long-term strategy to drive our omnichannel model in the third quarter, demonstrated by 17% in points of access from a year ago and this led to global organic revenue growth of roughly 12% over the prior year. We've led to significant declines in general retail and supermarket traffic in the U.K. Additionally, the strength of the U.S. dollar continues to impact our results, including reducing our net revenue growth by  and reducing our adjusted EBITDA in the quarter by approximately $3.1 million. Despite Strong global organic revenue growth, adjusted EBITDA in the quarter declined modestly to $38.5 million, due to FX challenges and the U.K. operating environment. In the U.S. and Canada business segment, total revenue increased 12% in the third quarter to $253 million and organic growth was 9%, an acceleration on our second quarter performance. Hubs with Spokes in the U.S., which increased by two to a 129 during the quarter, averaged $4.5 million sales per Hub on a trailing 12-month basis in the third quarter, which is up 18%, compared to a year ago, due to the success of our omnichannel model and pricing actions. The 22% increase in international points of access from a year ago allowed us to leverage our 37 international hubs to grow international sales per hub to $10.0 million on a trailing 12-month basis, up 16% from a year ago even with the FX headwinds. This morning, we reiterated our 2022 full-year guidance, which included 10% to 12% organic revenue growth, $189 million to $195 million in adjusted EBITDA and $0.29 to $0.32 adjusted EPS with capital expenditures of $105 million to $110 million. I'm not sure if that had to do with the timing to make your point about in the U.S. retailers don't want to reset in the fourth quarter, maybe that's earlier in the international markets, whether a number of exits in the U.K. as a result, due to what's happening in the points of access growth in the international, particularly in the DFD business? Volume, a big part of it coming from the points of access expansion and leveraging those Hubs and Spokes in the U.S. And I'm just trying to understand what the -- what's the impact of -- you haven't been able to take the pricing that you maybe hope in that elasticity or consumers are reacting to the price points, and so it's having lower volumes."
}