{
    "symbol": "SBSI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 15:19:07",
    "content": " Highlights for the quarter included earnings per share of $0.79, a return on average tangible common equity of 18.62%, annualized linked quarter loan growth of 18.3% net of PPP, a linked quarter 8 basis point increase in the net interest margin, an efficiency ratio of 47.7% and continued strong asset quality metrics. We're pleased to report second quarter net income of $25.4 million, an increase of $409,000 on a linked-quarter basis; and diluted earnings per common share of $0.79 for the second quarter, the $0.02 increase linked quarter. Linked quarter, net of a $10.9 million decrease in PPP loans, our loan portfolio increased $173 million to $3.96 billion driven primarily by strong growth within our real estate loan portfolio. As of June 30, our PPP loans included in the commercial loan category totaled $3 million, down from $13.9 million last quarter. We continue to experience strong asset quality metrics with nonperforming assets of $11.8 million or 0.16% of total assets at June 30, consistent with the first quarter. For the three months ended June 30, our allowance for loan loss decreased slightly due to the reversal of provision for credit losses on loans of $112,000 recorded in the second quarter, partially offset by net recoveries of $37,000. Our mix of loans and securities at June 30 shifted closer to 58% and 42%, respectively, from 60% and 40% on a linked-quarter basis due to the purchases in the securities portfolio more than offsetting the growth in the loan portfolio. Together, this resulted in a $2.1 million or 4.4% increase in net interest income for the three months ended June 30 when compared to the linked quarter. We recorded approximately $268,000 in net fees related to PPP loans included in interest income this quarter compared to $569,000 last quarter. For the three months ended June 30, 2022, noninterest income, excluding net loss on the sale of AFS securities, decreased $994,000 or 8.1% for the linked quarter. For the second quarter, noninterest expense was $32.1 million, an increase of $911,000 or 2.9% on a linked-quarter basis due primarily to increases in salaries and employee benefits, professional fees and software expense."
}