{
    "symbol": "SBSI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 16:41:05",
    "content": " Highlights for the quarter included earnings per share of $0.77, a return on average tangible common equity of 15.2%, annualized linked quarter loan growth, net of PPP of 19%. Linked quarter, our net interest margin decreased one basis point due to $780,000 decrease in PPP loan accretion, which resulted in a 9 basis point decrease in the average yield on loans, partially offset by a 2 basis point increase due to the increase in interest rates. In addition, during March and subsequent quarter-end on April 1, 2022 we transferred longer duration securities with the fair value of $662 million from AFS to HTM, with the flattening of the yield curve reduced fed purchasing and higher current coupons, agency mortgage-backed securities are once again beginning to look attractive from a risk reward perspective. Net income decreased $3.7 million from the fourth quarter of 2021, driven by the provision of credit losses of $294,000 compared to the $3.4 million reversal of provision last quarter, in a net loss on the sale of AFS securities of $1.5 million compared to a net gain of $463,000. Our CRE loans increased $124.4 million, construction loans increased $42.3 million, and we also experienced an increase in municipal loans of $12.1 million on a linked quarter basis. Linked quarter, our allowance for loan loss increased $251,000 or 0.7% due to the provision for credit losses on loans of $294,000 recorded in the first quarter. Our net interest margin decreased slightly on a linked quarter basis to 3.22% and net interest spread remained consistent at 3.09%, approximately 3 basis points of the net interest margin related to fees earned on PPP loans compared to 8 basis points last quarter. For the three months ended March 31 net interest income decreased $495,000 or 1%, when compared to the linked quarter. We recorded approximately $569,000 in net fees related to the PPP loans, included in interest income this quarter compared to $1.4 million last quarter. For the three months ended March 31, '22, non-interest income excluding net loss on the sale of AFS securities increased $720,000 or 6.2% for the linked quarter, which was driven by net gain recorded on other investments of $837,000."
}