{
    "symbol": "SBSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 16:31:13",
    "content": " Highlights for the quarter include, earnings per share of $0.84, a return on average tangible common equity of 19.94%, annualized linked quarter loan growth of 10.1% net of PPP, a linked quarter increase of 6 basis points in our net interest margin and efficiency ratio of 47.42% and continued solid asset quality metrics. We are pleased to report third quarter net income of $27 million, an increase of $1.5 million on a linked quarter basis and diluted earnings per common share of $0.84, a $0.05 increase linked quarter. Our loan portfolio increased $103.1 million to $4.06 billion linked quarter, net of $2.7 million decrease in PPP loans. Our CRE loans increased $67.2 million, construction loans increased $33.9 million and we also experienced an increase in commercial loans of $7.2 million, net of PPP on a linked quarter basis. For the three months ended September 30, our allowance for loan loss increased due to the provision for credit losses on loans of $1.3 million recorded in the third quarter, partially offset by net charge-offs of $237,000. Our allowance for off-balance sheet credit exposures increased to $2.1 million on a linked quarter basis, due to a provision of $200,000 compared to a reversal of provision expense of $521,000 in the last quarter. During the third quarter, we transferred additional available for sale securities with fair values of $70.2 million to healthy maturity and subsequent to September 30, we transferred additional AFS securities to HTM with fair values of $175.8 million. Together, this resulted in a $4.4 million or 8.7% increase in net interest income for the three months ended September 30 when compared to the linked quarter. For the three months ended September 30, 2022, non-interest income excluding net loss on the sale of AFS securities decreased $906,000 or 8% for the linked quarter. For the third quarter, noninterest expense was $33.5 million, an increase of $1.4 million or 4.2% on a linked quarter basis, due primarily to increases in salaries and employee benefits and professional fees."
}