{
    "symbol": "SBSI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 16:28:01",
    "content": " Highlights for the quarter included earnings per share of $0.87, a return on average assets of 1.47%, a return on average tangible common equity of 21.35%, annualized linked quarter loan growth of 8.2%, a linked quarter, four basis point increase in our net interest margin, an efficiency ratio of 30 -- excuse me, 46.38%, and continued strong asset quality metrics. During 2022 of loans, net of PPP loans, increased 14.8% or $533.5 million. During the fourth quarter, this $743 million of fair value swaps began producing net interest income as the overnight suffer rate we received increased above the average fixed rate we pay. For the fourth quarter, we reported net income of $27.7 million, an increase of $717,000 on a linked-quarter basis and diluted earnings per common share of $0.87, a $0.03 increase linked quarter. For 2022, we reported organic -- record organic loan growth of $533.5 million, excluding PPP loans, a 14.8%increase from 2021. We continue to experience strong asset quality metrics with non-performing assets of $10.9 million or 0.14% of total assets at December 31st, a decrease of $855,000 linked quarter. Our allowance for off-balance sheet credit exposures increased to $3.7 million on a linked-quarter basis due to a provision of $1.6 million compared to $200,000 in the last quarter. As of December 31st, our loans with oil and gas industry exposure were $111.3 million or 2.7% of total assets -- of total loans, excuse me. At December 31st, we had a net unrealized loss in the AFS securities portfolio of $88.9 million compared to $168.3 million last quarter, a decrease of $79.5 million. Our tax equivalent net interest margin increased on a linked-quarter basis to 3.40% from 3.36%, driven by the increase in the average yield on loans of 54 basis points and 21 basis points on the securities portfolio, partially offset by an increase in the average yield on interest-bearing liabilities of 56 basis points. For the three months ended December 31st, net interest income increased $1.3 million or 2.4% compared to the linked quarter. For the three months ended December 31st, 2022, non-interest income, excluding net loss on the sale of AFS securities increased $398,000 or 3.8% for the linked quarter. On loans, we do -- we have a fair amount of floating rate loans, I think, 46%, something like that of our loans float the new fixed rate loans that we are putting on or for the most part, I'd say in the $6 million is somewhere probably closer to $6.5 million."
}