{
    "symbol": "NDLS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 22:11:03",
    "content": " And good afternoon, everyone. As we move to our on-going strategy, I would like to remind you of our accelerated growth objectives, which include first, $1.5 million AUV by 2024, Second 20%, restaurant level margin again by 2024, and finally at least 10% unit growth commencing in 2023. With stronger EVs and restaurant level margin, we are well positioned to take advantage of our third accelerated growth objective, which is to achieve at least 10% unit growth by 2023 taking advantage of the tremendous wide space potential for the brand. And good afternoon, everyone. Underlying our revenue growth, our average unit volumes were 1.42 million for the quarter, a 5.3% increase from last year and an 18.3% increase versus pre-COVID levels in 2019. Restaurant margin did decrease 340 basis points compared to our Q2 of 2021, with the vast majority of that decrease found in our cost of goods sold, which improved 20 basis points relative to the first quarter but at 27.8% with nearly 300 basis points above both the second quarter of 2021 and our historical norm. Our labor margins continue to benefit from the full annualized impact of our kitchen of the future initiative, which has allowed us to offset continued wage inflation, which grew nearly 13% during the quarter While wage inflation is moderating somewhat, we anticipate elevated levels will continue to the third quarter with our label margins expected to be largely in line with the second quarter levels. Additionally, we remain confident in our accelerated growth objectives as our 2023 unit pipeline strengthens AUV quickly approach the million and a half target and we see a clear pathway and progress to a 20% restaurant level margin by 2024. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And you mentioned that your pricing in the second quarter was about 10%, you think you think it's going to be about 10% in the third quarter, you're wondering just what when new pricing is come on, when it's when it's rolled off, just in terms of the impact of that $1 surcharge, that's now no longer going to be an impacted just, if you can help us understand when you've taken price too, so we can kind of also have some visibility into the fourth quarter."
}