{
    "symbol": "DINO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 11:40:21",
    "content": " Today, we reported second quarter net income attributable to HF Sinclair shareholders of $1.221 billion or $5.43 per diluted share. Excluding these items, adjusted net income for the second quarter was $1.259 billion or $5.59 per diluted share as compared to adjusted net income of $144 million or $0.87 per diluted share for the same period in '21. We remain fully committed to our capital allocation strategy of returning $1 billion to shareholders no later than the first quarter of 2023, while maintaining our solid balance sheet and investment-grade rating. Pretax earnings were negatively impacted by a lower cost of market inventory valuation adjustment of $35 million, acquisition integration costs of $13 million and decommissioning charges of $0.5 million related to the Cheyenne refinery conversion to renewable diesel production. Net cash provided by operations totaled $1.5 billion, which included $25 million of turnaround spending and $33 million of cash sourced from working capital. As of June 30, 2022, HF Sinclair's total liquidity stood at approximately $3.3 billion, comprised of a standalone cash balance of $1.7 billion, along with our undrawn $1.65 billion unsecured credit facility. HF Sinclair owns 59.6 million HEP Limited Partner units, which following the acquisition of Sinclair Transportation represents 47% of HEP's outstanding LP units, a market value of $1 billion as of last Friday's close. For the second quarter of 2022, we expect to run between $630 million and 650,000 barrels per day of crude oil in our Refining segment. Second quarter net income attributable to HEP was $56.8 million compared to $55.7 million in the second quarter of 2021, which included a $5.3 million gain related to our refined product pipeline sale. HEP's second quarter 2022 adjusted EBITDA was $104.2 million, compared to $88.3 million in the same period last year. HEP generated distributable cash flow of $78.5 million and we announced a second quarter distribution of $0.35 per LP unit, resulting in a distribution coverage ratio of 1.8x. During the second quarter, HEPâ\u0080\u0099s total capital expenditures were approximately $15 million, including $7 million in turnaround expenses related to our Woods Cross refinery processing units, $5 million of maintenance CapEx, $2 million of reimbursable CapEx and $1 million in expansion capital. Manav, this is Tim. Manav, this is Tim. On my end, Rich, that at the time when you said the capital return of $1 billion, comparing to today, certainly second quarter and third quarter looked like it was much stronger than you expected."
}