{
    "symbol": "DINO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 14:20:04",
    "content": " As previously mentioned, the first quarter included a few unusual items, pre-tax earnings were negatively impacted by acquisition integration costs of $25 million and decommissioning charges of $1 million related to the Cheyenne or Refinery conversion to renewable diesel production, which were partially offset by a lower of cost or market valuation gain of $8.6 million. As of March 31, HF Sinclair’s total liquidity stood at approximately $1.9 billion comprised of a standalone cash balance of $592 million along with our undrawn $1.35 billion unsecured credit facility. HF Sinclair owns $59.6 million HEP limited partner units, which following the acquisition of Sinclair Transportation represents 47% of HEP’s outstanding LP units at a market value of approximately $1.1 billion as of last Friday’s close. Your line is open. And sometimes what happens is if the business is not growing in a firm, it kind of becomes a little bit of a divesture – can they – and the reason I’m asking is, like, if you think about it $100 million a quarter business in the past, you have said 10 multiple, even with some tax leakage, like you could get a 33% of your market cap in cash flow – in pure cash, if you do decide to divest this business. Your line is open. At the – our last quarter’s earnings, I quoted about an expectation of $150 million to $200 million of working capital recovery through the year. So we’ve got probably another $50 million to $100 million to go here, and that would include our expectation of reducing inventory of the legacy Sinclair assets. Your line is open. Again, I’d reiterate the $1 billion over 12 months, but the run rate where we’re at, that’s going to be about $350 million of dividends with the balance and share repo. Roger, I’m going to add to that and just say that, that $1 billion was poured in more of a mid-cycle environment, when we announced the combination with Sinclair, we’re well ahead of that today, but we are going to walk before we run and we’re going to start executing to this plan before we raise the bar. Your line is open. Your line is open. Your line is open. Your line is open. It’s more than just the market impacts though, I just want to kind of point out if you look back at our lubes and specialty business, we had a record year last year in terms of EBITDA, and of course this first quarter was a record as well. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}