{
    "symbol": "EYPT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:17:10",
    "content": " In the first quarter, EyePoint presented additional validating clinical results of our ongoing Phase 1 trial for our lead pipeline program, EYP-1901, while simultaneously advancing two strategic corporate initiatives; refinancing our debt, and our just announced, enhanced agreement with Betta Pharmaceuticals. We believe based on our interim Phase 1 DAVIO clinical trial results that a majority of patients can potentially be maintained with EYP-1901 for up to six months, with no supplemental therapy after an initial induction period with traditional anti-VEGF drug. A new mechanism of action using vorolanib, an anti-VEGF tyrosine kinase inhibitor, zero-order kinetics delivery that provides consistent stable release of vorolanib and the potential ability to sustain a majority of patients up to six months, while potentially significantly reducing the treatment burden for patients with wet AMD. As Nancy stated earlier, we are quite pleased with the results of our Phase 1 DAVIO clinical trial for our lead pipeline program EYP-1901, an investigational sustained-release delivery treatment for wet age-related macular degeneration, being studied as a maintenance therapy following induction therapy with an anti-VEGF, a therapeutic approach, which we refer to as treat-to-maintain. Our goal is to sustain the majority of wet AMD patients' treatment interval up to six months or longer after a single injection of EYP-1901, allowing patients and practitioners the flexibility to safely reduce the number of visits to their retina specialist through controlled and sustained intravitreal delivery of an anti-VEGF drug. Operating expenses for the first quarter ended March 31st, 2022 totaled $27.6 million versus $18.3 million in the prior year period, primarily driven by an increase in R&D spending, including clinical trial costs for EYP-1901 and investment in personnel across the organization, including non-cash stock-based comp. That's why we're doing a Phase 2 trial to see in a in a broader population of wet AMD patients than what we enrolled in DAVIO, how -- what percentage is going to benefit and we're optimistic that that benefit will be a majority of patients."
}