{
    "symbol": "EVER",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 22:22:02",
    "content": "  During the call, we will make statements related to our business that may be considered forward-looking statements under federal securities laws including statements concerning our financial guidance for the first quarter and full year 2023, our growth strategy, and our plans to execute on our growth strategy, key initiatives including our direct-to-consumer agency, our investments in the business, the growth drivers we expect to drive our business, our ability to maintain existing and acquire new customers, our expectations regarding recovery of the auto insurance industry, and other statements regarding our plans and prospects. 2022 proved to be a formidable year as our teams resolve and our business model's resilience were tested by the difficult auto insurance market, which caused carriers to dramatically pull back customer acquisition spend while they work to increase rates. The decline in revenue in Q4 was attributable to a 21% decrease in consumer monetization year-over-year, reflecting the impact of lower carrier demand as a result of the industry-wide auto insurance downturn and a further pullback in reaction to Hurricane Ian losses, partially offset by a 9% increase in consumer volume. Within health DTCA, revenue exceeded our internal forecast due to higher sales conversion and efficiency and improved consumer targeting, but declined from the prior year as expected due to a lower number of agents as part of our planned moderation and agent growth and emphasis on optimizing unit economics and cash usage. Operating cash flow was a use of cash of $4.9 million for the fourth quarter, reflecting the offset of positive cash flow from our referral marketplace against the higher seasonal revenue contribution of our DTC agency with its associated multiyear collection of policy sales commission revenue. With demand improvement, we expect to return to revenue growth over the course of 2023 with improved VMM and adjusted EBITDA and positive operating cash flow for the full year. In summary, during the fourth quarter and full year 2022, diversity and distribution, disciplined execution in consumer acquisition and management of operating costs allowed us to mitigate the impact of the auto insurance pullback and continue to deliver positive adjusted EBITDA. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}