{
    "symbol": "MYTE",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-25 11:58:02",
    "content": " In the second quarter of fiscal year 2023, our top customer base grew by plus 25.3% compared to Q2 of fiscal year 2022, while the total number of customers grew by plus 8.8%. It is noteworthy to mention that the average spend per top customer grew by plus 1.8% in the second quarter of fiscal year 2023, and the average spend for all customers grew by plus 1.9%. In the second quarter of fiscal year 2023, we experienced slower growth in Europe with plus 3.7% compared to Q2 of fiscal year 2022 and saw a contraction in Mainland China by minus 32.3% in GMV compared to Q2 of fiscal year 2022, both clearly driven by macro factors. In the United States, which continues to be one of our key growth markets, we achieved again in an above-average GMV growth was plus 12.7% compared to Q2 of fiscal year 2022. Our average LTM order value increased by plus 4.3% in the second quarter of fiscal year 2023 compared to fiscal year 2022, underlining the focus on a true luxury assortment. A key indicator for this is customer satisfaction, which reached a very high level as measured internally with a Net Promoter Score of 79.5% in the second quarter of fiscal year 2023. As Michael already indicated, given the difficult macroeconomic headwinds and tough comparisons to last year's Q2, we are pleased with our plus 7.8% top line growth in the quarter and plus 13.7% in H1 of fiscal year '23. In the second quarter of our fiscal year 2023 ended December 31, 2022, GMV was added â\u0082¬215.9 million, growing at 7.8% compared to the prior year quarter at $20.2 million. In H1 of fiscal year '23, we grew our top customers by 26.2% and GMV per top customer by 1.2%. In Q2 of fiscal year '23, our total active customer base grew by 8.8%, with a GMV increase for all customers of 1.9%. In H1 of fiscal year '23, our total active customer base grew by 9.6% with a GMV increase for all customers of 4.3%. In addition, given the lower comps of the quarterly growth rates during the last fiscal year of plus 13% in Q3 and plus 18% in Q4, we are confident in our ability to achieve our GMV guidance at the lower end of the given range for the full fiscal year. One driver of our stable marketing cost ratio, despite strong new customer growth is also our excellent existing customer performance with increasing GMV per total customer, plus 4.3% in H1 of fiscal year '23. In Q2 of this fiscal year, Mytheresa reported an adjusted operating income of adjusted EBIT of $14.9 million at a 7.9% margin and an adjusted net income of $11 million at a 5.8% adjusted net income margin. We are pleased with our good performance in Q2 of fiscal year '23 despite macroeconomic challenges, especially to achieve an adjusted EBITDA margin in the quarter above 9% is excellent in the current macro situation."
}