{
    "symbol": "MYTE",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-12 15:31:05",
    "content": " In the first quarter of fiscal year 2023, our top customer base grew by plus 22.7% compared to Q1 of fiscal year 2022. In the United States, which is one of our key growth markets, we achieved again an above-average GMV growth with plus 28.5% compared to Q1 of fiscal year 2022. Despite the ongoing covid-related challenges for customers, our Mainland China GMV grew by plus 22.5% in the first quarter of 2023 compared to the first quarter of fiscal year 2022. In terms of business model, Diversity, we not only grew our life category on the basis of a drop ship model but also continue to expand our Qurate platform model, CPM, to now seven brands in the first quarter of fiscal year 2023. And finally, we achieved our growth with a very healthy gross profit margin, which was 90 basis points higher in the first quarter of fiscal year 2023 compared to fiscal year 2022. A key indicator for this is customer satisfaction, which reached an outstanding level as measured internally with a Net Promoter Score of 81.0% in the first quarter of fiscal year 2023. Some of the highlighted achievements in this report for fiscal year 2022 include a 34% decrease of CO2 emissions per order shipped, achievement of carbon neutrality for the company, 90% usage of renewable electricity in the company, 57% women in leadership positions and more than EUR2 million worth of products resold by our customers by our partnership with VitaColegtive. Despite the current macro challenges, Mytheresa reported an adjusted operating income of EUR9 million at a 5.1% margin and an adjusted net income of EUR6.1 million at a 3.5% margin in the first quarter of fiscal '23. Gross profit at EUR410 million to EUR435 million, growing in line with GMV, also representing 16% to 22% growth and adjusted EBITDA in the range of EUR68 million to EUR76 million and an adjusted EBITDA margin between 9% and 9.5%. So Michael, maybe as we think about customer growth, top customer growth, up 23% in the first quarter, that's on top of more than 40% growth a year ago. This is a faster growth than net sales of 11.4%, but a bit slower than GMV growth, also driven by the share of CPM in the prior year quarter, which we just had on CPM brand and now have 7 and then have compensating effects throughout the P&L as shown in the last quarters. And we don't give quarterly guidance, but we confirm our guidance for the full fiscal year with gross profit growing in line with GMV between 16% to 22%. But as we guide towards the 16% to 22%, we target and we maintain our target to achieve a 16% to 22% gross profit growth for the full fiscal year. So we have an increasing gross profit margin in relation to net sales, driven by the curate platform model and giving us the ability to have a very high gross profit margin level, one of the highest in the industry and leading to a bottom line with an EBITDA margin, which we guide for the full fiscal year 9.5% to 9.6%, which is also one of the highest in the industry and one of the highest compared to our competitors. And so it should come in more surprise with having delivered the first quarter already with a 21% or 20.8% GMV growth that we feel very comfortable with the 16% to 22% guidance, which I have to expect is, of course, way above many, many other digital platforms in terms of what they guide to in terms of growth, which comes back to the customer focus."
}