{
    "symbol": "MDNA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-22 14:38:02",
    "content": " This is being driven by the progress we have made with the initiation and advancement of the Phase 1/2 ABILITY study in patients with advanced solid tumors, which is the first clinical study of our differentiated beta only long-acting IL-2 super-agonist, MDNA11 and the promising signs of clinical activity we are reporting in the early stage of our dose escalation portion of the trial. As a result, we are well underway in our dose escalation portion of the ABILITY study and continue to enroll patients at multiple clinical sites in diverse geographic regions to establish the recommended Phase 2 dose for the dose expansion phase of the study, both as a single agent and in combination with a checkpoint inhibitor. In the Phase 1/2 ABILITY clinical study of MDNA11, in patients with advanced and metastatic solid tumors by primary objectives are to investigate safety and tolerability and determine the recommended Phase 2 dose, while the secondary objectives are to evaluate pharmacokinetics, pharmacodynamics, immunogenicity and preliminary anti-tumor activity in both the monotherapy and the combination arms of the study. Since dosing the first patient in the ABILITY study this past September, we have observed very encouraging data in the first three dose escalation cohorts, consistent with MDNA11's anticipated differentiation from competing IL-2programs. MDNA11 is demonstrating an acceptable safety and tolerability profile, as well as promising early signs of clinical activity in the first eight patients, while dose escalation continues to enroll in cohort 4. In the second half of 2022, we expect more fulsome data for MDNA11 as well as early data from the single-agent dose expansion cohorts in a restricted number of tumor types such as metastatic melanoma and advanced renal cell carcinoma. With encouraging PK/PD and safety data and early signs of tumor control in three out of eight patients in cohorts 1 to (ph) 3, we expect more meaningful signals of efficacy at higher doses as we continue with the dose escalation portion of the ABILITY study. Since our last earnings call in February, we reported pharmacodynamic data from the ABILITY study's third dose escalation cohorts and are currently enrolling patients in cohort 4 with clinical trial sites open in the United States, Canada and Australia. Before moving on to discuss the ABILITY study recent data and what we believe it means to the program, I'd first like to provide some context by briefly mentioning the recently reported results of the randomized Phase 3 trials evaluating a different IL-2 variant in patients with previously untreated advanced melanoma and metastatic renal cell carcinoma. So it's a mixed patient population and as we plan to proceed with the dose expansion phase of the study, we will be focusing very much on metastatic melanoma and renal cell carcinoma with potentially another group of patients that we may -- as we see these patients beginning to see benefit during the dose escalation will include that cohort of patients as well. I think you've described it well as with a lot of these first-in-human studies in the lower ranges of a dose range, we do tend to throw the neck cell wide in terms of tumor types and/or to expedite that early stages of study where we're not really expecting to be able to look all that definitively at clinical efficacy with safety being dose limiting consideration. Please proceed with your questions. Please proceed with your questions. And despite that, what we're seeing in these patients who are heavily pretreated have large tumor burdens to see tumor control is for us, I think, at the moment, looks really exciting, particularly as we climb ahead with the higher doses that we are expecting to see and enroll patients that have a much more reasonable baseline lymphocyte counts in the clinical trial. Please proceed with your questions. Please proceed with your questions. So as we put out in our press release, what we've done, and of course, in the call today, also mentioned that we have, as you know, earlier this year, completed a very comprehensive analysis that would be supportive of the commercial potential for MDNA55 with respect to conducting a thorough primary market research and adoption of MDNA55 at different hospitals across both Europe and U.S. following interviews with about 40 different KOLs, 20 in Europe, and 20 in the U.S. And of course, also from a market opportunity, whether it's us, ourselves, but nevertheless, for partner purposes, for collaboration, we needed to make sure what the pricing might be for MDNA55, which was something that we were able to complete as well as getting feedback from payers and insurance and reimbursement agencies to find out what kind of expectation there might be. Please proceed with your questions. Please proceed with your questions."
}