{
    "symbol": "AMGN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 21:12:06",
    "content": " Excluding the impact of the $400 million upfront payment, third quarter total non-GAAP operating expenses increased 4% year-over-year, reflecting investments to advance our research capabilities and pipeline while also supporting product launches. Excluding the $400 million upfront payment, non-GAAP R&D spend in the third quarter increased 10% year-over-year primarily due to higher late-stage program support and research and early pipeline spend, partially offset by lower marketed product support. In the third quarter, we executed on the following: first, our recent acquisition at ChemoCentryx is a clear example of investing in the best innovation, in this case, external for patients; second, investing in our business through capital expenditures, including advancing construction on our new environmentally friendly facilities in Ohio and North Carolina; third, returning capital to shareholders through growing dividends, including $1.94 per share in the quarter, representing a 10% increase from Q3 2021; and fourth, opportunistic share repurchases. EVENITY, which complements Prolia in our bone portfolio, had record sales of $201 million for the quarter driven by 45% volume growth in the U.S. and 30% volume growth outside of the U.S. Repatha sales increased 14% year-over-year driven by 52% volume growth, which was partially offset by lower net selling price. We also presented data from the global Phase III CodeBreaK 200 confirmatory trial, where LUMAKRAS treatment led to increased progression-free survival and a significantly higher objective response rate in patients with KRAS G12C mutated non-small cell lung cancer compared with docetaxel. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}