{
    "symbol": "AMGN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 23:39:05",
    "content": " OTEZLA delivered 7% volume growth in both the fourth quarter and the full year, benefiting from a label expansion that gives us the opportunity to reach millions of new patients in the U.S. with mild to moderate psoriasis. Starting with our general medicine business which includes Prolia, EVENITY, Repatha and Aimovig, overall revenue for these 4 products grew 21% year-over-year for the fourth quarter and 18% for the full year, driven by 19% and 21% volume growth, respectively. Repatha sales increased 22% year-over-year for the fourth quarter with volume growth of 31%, partially offset by lower net selling price. Outside the U.S., fourth quarter sales of Repatha grew 36% year-over-year, driven by 31% volume growth. ENBREL sales decreased 1% year-over-year for the fourth quarter, driven by declines in volume and net selling price, partially offset by higher year-end inventory levels. Quarter-over-quarter sales declined 5% with 12% volume growth, more than offset by a lower net selling price driven by a $12 million unfavorable price adjustment resulting from a reimbursement approval decision in France and unfavorable changes to estimated sales deductions. Non-GAAP R&D spend in the fourth quarter decreased 2% year-over-year, primarily due to higher business development activity in 2021, including our upfront payments in connection with our Genera Biomedicines and Iraqis Therapeutics collaborations, along with lower marketed product support. Q4 non-GAAP SG&A expenses increased 2% year-over-year, driven by higher marketed product support, including investments in our priority products, TEZSPIRE, EVENITY and Repatha. So even with increasing 2023 sales volumes, declining net selling prices and inflationary pressures on costs, we still project full year non-GAAP operating expenses to be flat versus 2022 as we continue our focus on driving productivity and cost efficiencies across the enterprise. At a portfolio level, we expect product sales to be unchanged from Q1 2022 and other revenues to be lower on a year-over-year basis due to the reasons set out above, including about $225 million related to COVID antibody sales in the first quarter of 2022. Although, as I have highlighted both last year and this year, we have a small carryover effect of about $125 million that's currently capitalized in cost of goods sold that will be released that -- excuse me, currently capitalized in inventory that will be released in the cost of goods sold, primarily during the first quarter without a corresponding tax benefit. Otezla, as we've mentioned, is seeing some pressure from new free drug programs, both for our topicals as well as new entrant oral And then we also have just picked up TAVNEOS which we're really excited about, a product that treats a severe autoimmune disease, ANCA-associated vasculitis, very young product, very early in its life cycle and I think a lot of growth there to be had."
}