{
    "symbol": "AMGN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 21:05:04",
    "content": " Excluding the impact of the Five Prime in-process R&D, $1.5 billion charge in Q2, '21, second quarter total non-GAAP operating expenses declined five percent year-over-year, reflecting continuous improvement driven by digitalization, process simplification and automation, which more than offset investments to advance our pipeline and support product launches on a non-GAAP basis cost of sales as a percent of product sales decreased 2.2 percentage points on a year-over-year basis to 14.7%, primarily due to lower COVID-19 antibody shipments and direct manufacturing costs, partially offset by evolving product mix. Unfortunately, while 85% of patients in the U.S. are tested for their KRAS G12C status, only 50% of the time do oncologists have these test results available to support second-line treatment decisions and our teams are removing barriers to ensure that the oncologist is able to review KRAS G12C status when the patient progresses beyond first-line therapy and we've seen that when the KRAS G12C status is known in the second line setting, 85% of patients receive LUMAKRAS. Your line is now open. We expect our teams and implant inflammation and nephrology will be excited to have this product added inside Amgen and in terms of synergies, obviously, it's a very good fit, but we're focused on investing and growing this opportunity, we think we see some opportunities to help the team at ChemoCentryx reach even more patients and they have so far. Your line is now open. Your line is now open. Your line is now open. Your line is now open. As I mentioned and as you picked up on in the PD-L1 negative population, we're moving forward with a Lumakras plus chemotherapy Phase 3 trial and then we will disclose the results of the checkpoint inhibitor data in Vienna and outline our plans for further development in this space, I think that's probably all I can say right now, but I would really think about this as different groups of patients where the therapy will be tailored to their particular tumor based on PD-L1 expression. Your line is now open. Your line is now open. Your line is now open. That's what we think we can do to continue to drive some revenue growth in the U.S. and outside the U.S., what we're seeing is really again a tale of two types of markets in markets like Germany, Switzerland and France where biomarker testing is very well developed and their clinical information systems are also very well developed, so that test is available and retrievable upon progression in second line. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}