{
    "symbol": "MUFG",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-16 10:28:01",
    "content": " Other nonrecurring gains and losses in line 13 are due to the same accounting treatment as credit costs, mainly due to JPY 331.8 billion, valuation loss of securities and other investments held by Union Bank, resulting in a deterioration of JPY 361.8 billion. Finally, the extraordinary income declined JPY 127.2 billion due to the absence of gain in equity associated with the Morgan Stanley's acquisition of Eaton Vance last year and the absence of gain on sale of the equity interest in Bank of Ayudhya. The other business units steadily increased profits, including increases in deposits and loan revenues and foreign exchange-related revenues resulting in substantial JPY 218.4 billion increase in total customer segment profits. Global Markets also pursued gain on the cancellation of the Ayudhya funds while, recording a loss on the sale of foreign bonds reorganized its portfolio while reducing the financial impact and posted an increase of JPY 64.1 billion by capturing profit earning opportunities in market fluctuations. In addition, we revised our net operating profits target upward by JPY 200 billion in light of the strong progress made in the first half and also revised our credit costs and ordinary profit targets due to the accounting treatment in connection with the sale of Union Bank. In considering the amount of the share buyback, we judged that it is desirable to hold capital buffer for the time being, given the increasingly uncertain outlook for the business environment, including global inflation trends, rising volatility in financial markets and heightened geopolitical risks, and therefore, set it at JPY 150 billion. And foreign bond position, including hedge positions, increased by over JPY 150 billion from March to September due to foreign exchange fluctuations. Therefore, we have decided on JPY 150 billion share buyback for the current fiscal year, considering the current level of 9.9%, which will be slightly above 10.5% at the end of March, 6 months from now. Therefore, excluding the impact of the sale of MUB, the net operating profit target was revised upward by JPY 200 billion and ordinary profit target up by JPY 150 billion. So in summary, JPY 150 billion is down to JPY 120 billion due to stock price and foreign exchange impact, 60 billion was recorded last year, and the remaining JPY 60 billion will be recorded for the next 5 years starting next fiscal year."
}