{
    "symbol": "CLF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 13:48:15",
    "content": " With almost $2.5 billion of liquidity, a much cleaner balance sheet with meaningfully reduced pension and OPEB obligations, lower operating costs going forward, less CapEx next year, minimal cash taxes for the remainder of this year, cash coming in from working capital and no major bond maturities until 2026, we are in great shape to navigate any potential recessionary environment. Together with our union partners, we have integrated for a standalone company in a span of just two years, where we can overcame a difficult pandemic, completed the construction of a state-of-the-art direct reduction plant, invested to keep our muse at an automotive level standard, pay down a significant amount of debt and drastically reduced our patient and OPEB liabilities, which we assumed two years ago, in order to make the entire transformation possible. All in, based on our inventory status and current outlook for input costs, we expect our reported unit cost in Q4 to fall at least $80 per ton, compared to Q3, with further reductions into the first half of 2023, even after factoring, the increased wages in the USW double labor agreements that were recently ratified. Good morning, Lourenco and Celso. And as we increase our volumes, this year, we've been kind of at that 3.6 million ton level every quarter, and we're really pushing to get up to 3.8 million, 4 million tons again, and that's going to further dilute our fixed costs going forward as well. Please proceed with your question. Please proceed with your question. Like I said, not only the kind of inflationary pressures that we're seeing on input costs, but also repairs and maintenance, as I stated, are expected to be lower by $400 million next year. Please proceed with your question. Good morning, Lourenco and Celso. Please proceed with your question. With the cost coming down, CapEx in the $700 million to $800 million range next year, even contemplating lower steel prices, it seems that your free cash flow generation is going to be quite interesting, quite good. Please proceed with your question."
}