{
    "symbol": "DHT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 11:57:10",
    "content": " I would now like to hand the conference over to your speakers today, Laila Halvorsen, CFO. I'm joined by DHT's President and CEO, Svein Moxnes Harfjeld. Before we get started with today's call, I would like to make the following remarks. In addition, our earnings press release will be available on our website and on the SEC EDGAR system as an exhibit to our Form 6-K. As a reminder, on this conference call, we will discuss matters that are forward-looking in nature. We urge you to read our periodic reports available on our website and on the SEC EDGAR system, including the risk factors in these reports for more information regarding risks that we face. In addition at quarter end, the company's availability under both revolving credit facility was $235 million, putting total liquidity at $301 million as of September 30th. Financial leverage is about 22.6% based on market values for the ship and net debt for vessel was $15.4 million at quarter end, which is significantly below current scrap values. In the third quarter, the company achieved an average TCE of $24,400 per day, with the vessels on time charter earning $35,300 per day and the vessels in the spot market making 22,000 per day. On the next slide, we present the cash bridge for the quarter. Ordinary debt repayment and cash interest amounted to $7 million, while $15.3 million was allocated to shareholders through dividend payments and share buyback. $2.3 million was used for maintenance CapEx, while change in working capital amounted to $24.1 million mainly related to the change in accounts receivable and accrued revenues due to increased freight rates. Net proceeds from sale of vessels were $24.8 million, while $50 million was used to prepay long-term debt and the quarter ended with $65.7 million of cash. In August, we sold the 2008 built DHT Edelweiss for $37 million and the sale generated a gain of $6.8 million. In September, we prepaid $50 million under the Nordea credit facility. Also, in September we entered into a five year time charter contract for DHT Puma or substitute at $38,000. Charters have the option to extend two additional years at $41,000 and $45,000 per day respectively. In September, the company announced a new dividend policy with 100% of net income being returned to shareholders in the form of quarterly dividend. During the quarter, the company purchased 1.5 million of its own shares for an aggregate consideration of $8.8 million at an average price of $5.87. So for the quarter the company is therefore returning $15.3 million to shareholders, $6.5 million in dividends and $8.8 million in share buybacks. On this page, we are showing a new table with the purpose to provide better guidance with respect to the quarter succeeding the one that we are reporting on. So for the fourth quarter of this year, we have a time charter book at an average rate of $34,800 per day covering some 510 days, roughly a quarter of the period as a whole. As of today, we have booked 69% of our 1,540 available spot days at $61,800 per day. Further, we are providing the estimated spot P&L breakeven for the period allowing you to model the TC income based on your own assumptions for the unfixed spot days . We can tell you this much, as of today, the rates we are seeing for the balance of the quarter are substantially higher than what has been secured on average so far. As announced earlier this year, we have embarked on a project to retrofit eight eco ships with exhaust gas cleaning systems taking our fleet with these installations to 100%. Following this, we will retrofit the DHT Colt and the DHT Stallion during the first quarter of 2023. For the balance of the project, we are adopting a pragmatic and dynamic schedule based on the vesselsâ\u0080\u0099 whereabouts and their commercial opportunities. We have a robust oil price, we have healthier refining margins, and we have a strong freight markets. These trade disruptions resulting an increased transportation distances, which reduces the productivity of the tanker fleet pushing rates beyond what already in supporting dynamics would evolve. As you will see from this slide, transportation distances for European imports could be upwards to 7 to 11 times that of imports from the Baltic region. And for Russian exports to Asia one can see distances, of course, the same multiple of 7 to 11 times when compared to Northwest Europe. As ships that enter these market rates are unlikely to return to the compliant markets, we want to look at this development as in due course being the new scrapping. As we have suggested before, there's an increasing probability of the tanker fleet to decrease at the time and order books are low and shipyard is essentially full for the coming couple or three years. We are well structured for cyclical markets, amongst others supported by a strong balance sheet and healthy liquidity. Based on our new dividend policy with 100% of net income to be distributed as quarterly dividends, we have every intention on showing you the moment. At that time, our leverage level was almost sort of in the 50%, 55% , and it has been brought significantly down since then. So as a reflection, the balance sheets and the cost structure, and also that we have no CapEx program for new ships going forward, we felt it right, timely to introduce this new dividend policy. So, I think all these things will have to be looked at depending on the capital structure and where you are, but our intention is certainly that this policy should be sustainable and not just the -- something happy will change with short intervals. So, we would like to think it's well thought through and then that we will have the capacity to continue with this for a prolonged time. I guess, we see some activity that we are not part of, an observer involving so -- the only sort of high-level view list but we do you see some intentions to bring oil out of the Baltic in particular, out to areas where it can be shipped on to larger ships and then to be sent to the Far East. So not only are there longer distances, but this sort of mode of transportation is a bit inefficient and time consuming. So it is a bit early days, and I think people are probably planning a lot in their offices without really showing the cards just yet. So I think towards the end of this month, we will see some real activity, I think already get going. So the two first contracts, one was extended basically at the same rate that we have, it was an optional year, that's what they are this year. And -- similarly, the other one is also a business continuation if you like. So these rates are of course below the current market, but these are time charters that we of course enjoyed greatly last year and the first half of this year. Right now we're taking a big step back and they want to see rate appreciate and also, hopefully with a much or a bit commencements much further out. So we would expect the three year rates today to be closing in at around the $50,000 mark. And I think with the current freight market, that's basically $90,000 to $100,000 a day, I think you will see more of these opportunities in the longer run. But on the right opportunity with the right clients and the right ship and all that, it's sort of significant knowledge we have, we will entertain that. I just wanted to make sure I understood, you said the Colt and Stallion natural drydocks dates, so there's no operational off-hire time. And of course, as you know, these voyages that you fixed in the stock market, they are easily 45 to 50 days, if not longer. So, if the opportunities are reflective of the current spot rates, of course, it's important for us to try to put that in the books and then wait for a little while longer, so. And at the same time, we have no investment program, and that's the point, its a reflection of where asset values are. We think they are too high to buy ships to date, they require rates for those investments to be attractive over sort of a 20-year horizon we think maybe good. We are not sort of momentum investors that will buy a ship with a expectations of having a feel-good factor in next 12 months, because the asset price might be slightly higher, we want to invest and operate the ships over a longer period of time. We bought two secondhand ships last year, we were set to buy some more but prices, moved up too quickly. So, what we did instead of course, as you know, we bought back about 6% of the company stock and the cash spent on that was equal to ships. But we bought our own ships essentially then at a discount, so sort of happy with that investment as well. It doesn't -- this new dividend policy does not prevent us from making investments when the right opportunity arise, so. The 100% earnings payout policy, just wanted to be clear, it looks like you've paid out the full earnings for the third quarter of $0.04, which includes gains and other items. So in the past, we've let the shareholders have the benefit of cash gains, extraordinary cash gains in the P&L and also in a way benefit of not including noncash losses, right. So we think about net income as clearly stated, without any caveats. You got 22,000 but then you also got 27,000 on relative discharge -- sorry on discharge with discharge. Now what we need to do according to IFRS 15, the new revenue -- it's not new anymore, but the revenue policy is that from discharge from the last voyage and until the vessel has loaded, there is no revenue that is included in our books. So it is of course, the same revenue for the total voyage but it's reflected on a much less period of time. So you'll of course, have exactly the same revenue but it's reported on a different period, so from load to discharge. And clearly then it's more volatile and in market with increasing freight rates, you will then have to postpone in a way the revenue and you will gain that again in the next quarter. In this regard in a way when making calls on what to do with the ships, what the accounting treatment is, the money is made just in different areas. Now, for the five year charter with the Puma, I know it's your second one I believe, you get the Osprey from last quarter. So for now, we will take a step back and we will in due course try to develop additional fixed income but we want the rates to be higher than where they were earlier this year. So as I mentioned earlier, on the call, we believe that the three year rates are sort of in the plus minus $50,000 territory depending on the type of ship and the position and so forth. So, thinking a bit academically about it, it is possible in due course, to sort of fix a meaningful portion of the fleet a very rewarding rate. Of course, if you can create the visibility on earnings and also in relation to our dividend policy that might have some merit. Of course, it's definitely within context of your dividend policy, just trying to give some sort of stability towards it. So, these ships are eco ships and they have no issues whatsoever with EXI on the CII for many years to come. So, we have of course done the calculations for the entire DHT fleet and I have a sort of very clear view on how it will develop. And a little bit by chance, if you like the demographics of DHTâ\u0080\u0099s fleet, it's so that when 2026 comes about, which is sort of the next leg up in the restrictions or in the regulations, that is sort of the time and our oldest ships are closing in on retirement. But of course, the customer that is considering taking a ship on time charter, they will need to view for their own sort of book if you like, on what sort of initial levels they want to have in securing transportation services. There are, of course, some macroeconomic gloves out there and then inflation and also the efforts that central banks are doing to stall that and how that will impact general economic growth. So, of course, if we do certainly get the world economy into recession and a hard one, that will of course impact oil consumption. But if you look sort of down to the industry more insulated, I think there's -- long time ago since you've seen so many positive elements in structuring the market that we are entering into now. So all-in-all, I think that looks very good, barring sort of and the macroeconomic events that would pose a big negative correction. On the mathematics where you paid off $12.2 million in debt for a net of $24.8 million and $6.8 million profit, is that basically because you're carrying equity cost on the thing with $18 million. There are no further questions at this time, so I'll hand the conference back to you."
}