{
    "symbol": "FLUX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-12 21:47:03",
    "content": " In the third quarter, we received $20.5 million in new customer purchase orders from existing Fortune 500 customers and new customers. For the third quarter, our customer order backlog increased to a record $38.6 million as of March 31, 2022, reflecting the growing demand for our products from new and existing customers and our continued expansion into new verticals. As we put our third quarter results in perspective, the March 31 ending quarter reflected the ongoing impact of the global supply chain disruption, increased shipping delays of key parts throughout the quarter, triggered delays in production amid increasing purchase orders from growing customer demand. As we turn to review our financial results in the quarter ending March 31, revenue grew 89% to $13.2 million in the fiscal third quarter of 2022. In the third quarter of 2022 alone, we booked $20.5 million in new customer orders, as mentioned. Although gross profit was higher in the fiscal third quarter at $1.9 million compared to the same quarter a year ago of $1.7 million, gross profit margin decreased to 14.6% in the fiscal third quarter of 2022 as compared to a gross profit margin of 24.1% in the same year ago quarter. Our strategic initiatives have been deployed, positioning us to work towards mitigating ongoing global supply chain disruptions and executing on our record $38.6 million customer order backlog; and finally, generating cash receipts to accelerate our trajectory to cash flow breakeven and profitability. We call it an X80 and it's -- there's a lot of these larger forklifts that they're seeing now that lithium has really become economically attractive just in terms of cost savings, they could take some of these larger forklifts that are even outdoor forklifts and migrate from diesel or propane to lithium and gain the advantage of the better environmental impact because really, honestly, all our customers -- there's somebody there that has an environmental incentive."
}