{
    "symbol": "NYMT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 16:59:12",
    "content": " Given the high rate of redemption activity of the 1.5 year maturity loan, we increased our portfolio by $645 million in the quarter, nearly doubling last quarter's portfolio growth. On a net basis, investments increased by approximately $645 million during the quarter, with prepayments and redemptions fueled by repayments received on our short duration loan book. Our continued investment in residential loans, particularly higher-yielding business purpose loans, contributed to the $6.8 million increase in single-family interest income, partially offset by a $0.5 million decrease in multifamily interest income due to redemptions of our mezzanine lending investments accounted for as loans. Interest expense in our portfolio increased by $5.2 million primarily due to increased utilization of our financing arrangements, which would include securitization and non-mark-to-market repurchase agreements. Total net interest income, which includes interest expense related to our corporate debt and mortgages payable on real estate, decreased to $29.9 million as compared to the previous quarter. The increase in nonportfolio-related interest expenses can be attributed to the increase in interest expense related to our mortgages payable on real estate by $5.1 million from the previous quarter as a result of the full quarter impact of the multifamily JV investments consolidated in the previous quarter, as well as additional multifamily JV investments entered into and consolidated in the current quarter. We had noninterest-related losses totaling $46.8 million, mostly from net unrealized losses of $83.7 million as a result of increases in rates and credit spread widening in the first quarter. This loss was partially offset by a $3.8 million of net realized gains from residential loan prepayment activity and non-agency RMBS sales, a $5.7 million of preferred return generated by our mezzanine lending investments accounted for as equity, and $1.8 million of other income primarily comprised of redemption premiums recognized from early repayment of mezzanine lending investments during the quarter. I discussed the $150 million-ish of payoffs that we get on our portfolio to reinvest that cash, which we'll be doing, and financing it in the form of those 2 securitizations as well as non-mark-to-market, nonrecourse repo structures as well, which we completed and closed in the quarter."
}