{
    "symbol": "WWW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 12:13:05",
    "content": " I would also like to remind you that statements describing the Company's expectations, plans, predictions and projections, such as those regarding the company's outlook for fiscal year 2023 growth opportunities and trends expected to affect the Company's future performance made during today's conference call are forward-looking statements under U.S. securities laws. Our guidance reflects the expected performance of our ongoing business, which excludes the full year projections for Keds and Wolverine Leathers and adjust for the licensing transition for Hush Puppies expected on July 1, for reference, these businesses had revenue of $150 million and diluted EPS contribution of $0.04 in fiscal 2022. To offset these incremental transitory costs, our Profit Improvement Office has secured product and logistics cost savings of approximately $20 million that will benefit gross margin more heavily in the second half of the year. We expect Q1 gross margin of approximately 40% and operating margin of approximately 4%, including $17 million of transitory inventory costs from 2022 and $8 million of incremental holding and liquidation costs related to elevated inventory. Finally, we have a strong line of sight to $150 million of annual cost savings for 2024 giving us future capacity to invest strategically in our growth brands while expanding our operating margin to our target of 12%. But I think it was -- a lot of what I just said to the previous question was the first half is burdened with all of these high costs from last year that we paid for, but didn't recognize in the P&L when containers were over $20,000, and we were airfreighting everything in and et cetera, et cetera, and the storage costs we're dealing with now. Previously, they have been servicing it from the U.K. And while we had some hiccups in the fourth quarter, we think that's going to, in 2023, allow them to be much more agile in terms of servicing the U.S. wholesale market, which we also believe will give them exposure to drive more U.S. e-commerce business while we contemplate what a store rollout looks like there."
}