{
    "symbol": "AGRO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 16:26:09",
    "content": " During the second quarter, our crushing volume amounted to 3.3 million tons of sugarcane only 5% lower than last year. On a year-to-date basis, crushing volume reach 3.6 million tons 35.7% lower compared to the same period of last year. As we are expecting, sugarcane yields during the quarter were 24.5% lower compared to the same period of last year, reaching 60 tons per hectare while TRS content presented on 11.8% reduction to 119 kilograms per time. As you can see on the left chart, ethanol reported as 16.6% increase in selling volumes to 258,000 cubic meters, mostly driven by and hydrous sales, which increased by 37.5% or over average selling prices were up 45.4% year-over-year to 4.90 per pound. On the other hand, sugar sales were 20.2 million marking a year-over-year reduction of 71.7% whereas energy sales amounted to 9.5 million, 15.6% lower versus prior year. Out of this amount ethanol sales were 186 million, 71.7% higher compared to the previous year partially offsetting the 71.1% reduction in sugar sales. These solid results were mainly driven by the aforementioned increase in sales, a 10 million year-over-year gain in the mark-to-market of our unharvested cane led by higher expected sales and prices coupled with an increase in Consecana prices, which resulted in again in the mark-to-market of our harvested cane. Adjusted EBITDA in the Farming & Land Transformation Businesses amounted for 20 million for the second quarter, 38.4% below the same period of last year. In our crop businesses, adjusted the BBITDA amounted to six million in the second quarter, marking a 63.4% reduction compared to the same period of last year. Nevertheless, results were partially offset by a 66.9% increase in gross sales coupled with a year-over-year gain of five million in the mark-to-market of our biological assets on higher harvested area and better prices. It was mostly explained by higher cost in U.S. dollar terms driven by global inflation are mixed performance in terms of yields with peanut and corn second crop presenting our 4% and 11% reduction respectively, coupled with our 12 million loss in the mark-to-market of our forward contracts. Adjusted EBITDA in our rise business was five million during the quarter and 13 million in the first semester, marking up 49.4% and 65.4% year-over-year reduction respectively. Moving on to the dairy business, adjusted EBITDA amounted to seven million during the second quarter, flattish compared to the previous year whereas during the first half it amounted to 14 million marking a year-over-year increase of 17.6%. On a year-to-date basis gross sales expanded 27.7% year-over-year to 588 million, where as adjusted EBITDA amounted to 205 million marking at 2.7% decline compared to the same period of last year. This was mainly driven by the impact of adverse weather conditions in Brazil resulting in a year-over-year reduction of 3.5 million tons in our crushing volume and negatively impacting our last 12-month results coupled with higher working capital up, mostly on account of higher input costs."
}