{
    "symbol": "AGRO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 14:35:31",
    "content": " The lower use of time led to our sugarcane crushing volume of 3.8 million tons during the quarter, 9% lower compared to same periods of last year. Sugarcane yields during the quarter were 9.4% higher compared to the same period of last year, reaching 65 tons per hectare while DRS content presented at 6.4% improvement amounting to 141 kilograms per ton. And average selling volumes were down 27.2% year-over-year, driven by lower average selling prices coupled with a decrease in selling volume as a consequence of lower crushing and of our commercial decision to use our bagasse to dehydrate ethanol. As previously mentioned, during the third quarter of 2022, hydrous ethanol sales prices in Brazil experienced downward pressure and hydrous ethanol in the domestic market also experienced a decrease in prices are seen on the graph, although demand remains stronger due to the 27% mandatory blend with gasoline. On a year-to-date basis, anhydrous ethanol sales were 74.2% higher compared to the same period of last year on higher volume sold abroad at more attractive setting prices rather than in the domestic market. Net sales amounted to $163 million during the third quarter of 2022, 9.5% higher year-over-year. Adjusted EBITDA amounted to $17 million in the third quarter and $73 million year-to-date, 31.1% and 35.9% below the same period of last year respectively. Moving on to the dairy business, adjusted EBITDA amounted to $9 million during the third quarter and $24 million year-to-date, marking a 29.6% and 22.1% year-over-year increase respectively. On a year-to-date basis gross sales expanded 24.8% year-over-year to $970 million, where as adjusted EBITDA to $327 million marking 11% decline compared to the same period of last year. So this campaign, we are seeing costs in line with what we had the previous campaign. So this campaign, we are seeing costs in line with what we had the previous campaign. Christian, regarding the second part of your question, I couldnâ\u0080\u0099t understand exactly, but you were asking about the dilution of the costs and regarding that as Renato explaining at the beginning in the sugar, ethanol business, there is a dilution of cost because the increase in volumes we are expecting to increase for next year, almost 20% in terms of volume that the main impact on the dilution of costs and for the rest of the crops as we are expecting yields better than last year, because last year weâ\u0080\u0099re particularly below theâ\u0080¦\n And apologies, ladies and gentlemen, it appears we have lost our speaker line."
}