{
    "symbol": "HIBB",
    "quarter": 2,
    "year": 2022,
    "date": "2021-08-27 14:25:05",
    "content": " Depreciation and amortization increased approximately $900,000 from last year’s second quarter, reflecting increased capital expenditures on store development initiatives plus additional growth opportunities and infrastructure projects. On a GAAP basis, we generated $61.5 million of operating profit in the quarter or 14.7% of net sales, which compares to last year’s second quarter operating profit of $56.3 million. Excluding all non-GAAP adjustments during last year’s second quarter, our $61.5 million of operating income this year compared to adjusted operating income of $69.7 million in the second quarter of fiscal 2021. GAAP diluted earnings per share were $2.86 for this year’s second quarter, and we had no adjusting items in the current period. In last year’s second quarter, GAAP diluted earnings were -- per share were $2.38, and adjusted diluted earnings per share were $2.95. On a GAAP basis, we produced $171.6 million of year-to-date operating profit compared to last year’s operating profit of $34.2 million. Net inventory at quarter-end was $216.8 million, an 18.9% increase from the beginning of the quarter and a 19.1% increase from last year’s second quarter. We continue to expect to deliver SG&A leverage on a full year basis compared to both, GAAP and adjusted SG&A reported in fiscal 2021, and we believe SG&A as a percent of sales will increase in the second half of the year in comparison to the first half of fiscal ‘22 due to wage and related benefit impacts, performance-based incentives and equity costs, and increased costs in categories such as repairs and maintenance, travel and insurance. And so, as you would think about it now, we’re going to annualize those numbers, at least against Stage, but as you continue to think about the future and how those sales opportunities layer in, we still got upside against all of those publicly reported changes in distribution, they really don’t all come into effect until the end of this calendar year. But do you think the second half gross margin will be above last year’s second half, which was around 37.6%?"
}