{
    "symbol": "AXLA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 11:54:12",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to Axcellaâ\u0080\u0099s third quarter 2022 conference call. We would like to advise that certain remarks we will make on todayâ\u0080\u0099s conference call, such as those relating to our cash runway and our ongoing clinical trials of AXA1125, include forward-looking statements that are subject to various risks and uncertainties. All forward-looking statements represent our views as of today, November 1, 2022, and should not be relied upon as representing our views as of any subsequent date. Through the third quarter, we made important progress in our clinical development of AXA1125, and strengthened our balance sheet with a new financing. Now, on August 2, we announced positive topline results from our Phase 2a study of AXA1125 in long COVID. Long COVID is a persistent and growing challenge of the pandemic, affecting an estimated 100 million patients worldwide, with fatigue as the most common symptom reported. The fatigue that is experienced by long COVID patients, just both mental and physical, is often so severe that they are unable to work, exercise, or engage in normal activities of daily life. And until our study, no previous pharmaceutical agent had demonstrated the ability to improve outcomes for patients with long COVID in a randomized controlled trial. So, we set out to develop AXA1125 to offer treatment options to seriously ill long COVID patients who previously had none. Now, we found that subjects who received AXA1125 had improvements in measures of mental and physical fatigue that were both highly statistically significant and clinically relevant compared to those who received placebo. The mean changes in total physical and mental scores in the CFQ-11 versus placebo, were a minus 4.30 with a P value of 0.0039, minus 2.94 with a P value of 0.00 or 0.0097, and minus 1.32 with a P value of 0.0097, respectively. Now, finally, there was a statistically significant correlation between improvement in fatigue score and increase in distance achieved in the six-minute walk time with a P value of 0.0027. And on September 29, we reported results of a pre-planned interim analysis of data from our Phase 2b trial of AXA1125 in the treatment of Non-Alcoholic Steatohepatitis or NASH. At 24 weeks, there was statistically significant improvements in the liver stiffness measurement, or LSM, compared to placebo for the subjects in the high-dose arm. Absolute changes in LSM were 0.13 minus 2.01 for P value of 0.0992, compared to placebo, and minus 4.07 kilo pascals or KPA for a P value of 0.0096 compared to placebo in the placebo low and high-dose arms. These results were supported by statistically significant improvements in other non-invasive measures of liver fibrosis, ELF, and FIB four. And all subjects experienced significantly greater changes from baseline in MRI-PDFF at 12 weeks compared to the baseline from - or change from baseline in placebo, and a placebo adjusted difference of minus 18.98% for a P value of 0.0082, and minus 21.24% for a P value of 0.0014 for the low and high-dose arms, respectively. In some, these findings indicate that administration of AXA1124 - excuse me, 25, over 24 weeks, leads to statistically significant improvements compared to placebo and biomarkers for metabolism, inflammation, and fibrosis. And consistent with prior clinical trials, Type 2 diabetics showed results comparable to non-diabetics. Now, in addition, and consistent with all previous results, AXA1125 was found to be extremely safe and well tolerated. Given the COVID trial results, 1125 has become the first therapeutic to improve patient fatigue in a randomized trial. Collectively, the trial results provide further support of our view that AXA1125 has extremely effective and safe, multi-targeted impact on pathways that are dysregulated in complex conditions such as long COVID and NASH. Our extensive research and incurring gene trial results, along with our EMM platform, give us an attractive and differentiated profile, and position us as the leading company in treating complex multifactorial conditions. As the company advances towards late-stage clinical trials, we are pleased to have the additions of Mr. Rosiello, and Mr. Straight Nissen, to our board. We finished the quarter ending September 30, 2022, with approximately $25.4 million in cash and marketable securities, which compares to $55 million as of December 31, 2021. On October 13, 2022, we announced a registered direct financing of approximately $34.2 million. The financing occurred at a market price of $1.64, and the company sold 20,847,888 shares of common stock to a combination of current investors, new investors, company directors, and management. Turning to the income statement, our research and development expenses were $13.3 million and $43.7 million for the quarter and nine months ended September 30, 2022. This compares to $10.1 and $30.7 million for the comparable periods of 2021, with the year-to-year increase primarily related to the initiation of our long COVID and EMMPACT clinical trials. General and administrative expenses were $3.9 million and $12.3 million for the quarter and nine months ended September 30, 2022. Axcellaâ\u0080\u0099s net loss for the quarter and nine months ended September 30, 2022, was $17.8 million, or $0.34 per basic and diluted share, and $58.2 million or $1.19 per share, respectively. Our net loss for the third quarter and nine months ended September 30, 2021 was $15.6 million or $0.41 per share, and $46.7 million or $1.23 per share. We've already had initial engagement with the MHRA, and we are in a position to communicate and receive appropriate feedback this year, and we look forward to being in a position to advance the clinical program in the near-term, next year. So, we're very well positioned and continue to have excellent interactions with the government, as they understand how important an issue long COVID is. Enrollment is continuing well, and we are obviously encouraged by the results that we saw across liver stiffness, inflammation, and metabolism, and continuing to show first line safety profile, as are the investigators. So, we are - as you know, we've recently raised in the register direct, $34.2 million. Going forward, I can assure you that what we'll be doing is what's in the best interest of the company and stakeholders as we go forward, although I can't offer any specifics at this time. And unfortunately, because of the size and need, very rapidly to achieve that as we're leading in this field and really have the opportunity to be the only product in the market for long COVID fatigue for some time. In terms of the approach, we're well positioned to execute the next trial in terms of our capabilities and our ongoing support. And we're in active engagements, both with potential collaborators, as well as governments, as to the best way to bring this program forward to reach beyond the US and the UK, where we obviously already have work ongoing, and as you know, we have a global Phase 2b in NASH. Perhaps last question from us, switching to NASH, we saw the interim data was quite encouraging, but did not see better results in Type 2 diabetes patients as we did in the 16-week study. It's an important question because Type 2 diabetics are roughly 40% or more of NASH patients, and are historically difficult to treat. And actually, what we did see is that the results in Type 2 diabetics were consistent with the overall results so far on the trial, and that's encouraging for us already. And as you know, this is an interim analysis, with 30% of the patient subjects reaching 30 - or 12 weeks. So, we're actually encouraged and we have, as you know, two previous studies where we demonstrated impact in Type 2 diabetics, and weâ\u0080\u0099ll continue to evaluate if this is an important differentiator, like we believe our overall profile sets us up for first line position because of the multi-targeted, the safety and well tolerated the oral dosing. Weâ\u0080\u0099re looking forward to our upcoming milestones and progress that we'll make across the programs, and we expect to help drive value for our shareholders."
}