{
    "symbol": "NOA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 15:31:10",
    "content": " I am not going to go through this list individually, but I would simply summarize that, we resolved our first half issues, executed well on our winter works programs, safely and efficiently closed out the year and are focused on carrying our momentum forward into 2023 and looking to take advantage of the opportunities presented in this continuing strong demand market. Lastly on this slide, I would just like to point out that, other than the obvious pandemic impacts in 2020, our diversification efforts over the last several years have delivered into expectation and demonstrated higher Q2 and Q3 fleet utilization, as we have moved to smaller underutilized portions of our heavy equipment fleet out of oil sands and into other geographies and commodities where they have achieved more operating hours. For the year and given the fairly straightforward nature of the year from a cash perspective, the use of our $70 million of free cash flow that was generated can be easily broken down into its three categories; $44 million related to shareholder activity, primarily share purchases and dividends; $13 million on growth acquisitions being ML Northern; and $13 million on net debt reduction. Itâ\u0080\u0099s -- thereâ\u0080\u0099s still 100-ton, 150-ton trucks in oil sands that stay very busy during the winter that have not in the past half a dozen years had high utilization during summer civil construction. If I compare your Q4 slide deck with the Q3 one, it looks like that large oil sands bid got pushed out a couple of quarters, am I right in interpreting that correctly and how shouldâ\u0080¦\n It -- when I would -- it was actually -- itâ\u0080\u0099s supposed to be put on the commencement dot and we put it on the tender dot in the previous one. The difference being that, obviously, right now, our backlog reflects one year left of it and this would be five years of -- so we are going to peak in every cycle of five years in backlog with those oil sands awards and then they are going to work their way down over the five years and then get awarded again. This is going to be something that is a long time, we will be talking about it 10 years from now, because itâ\u0080\u0099s not going to get easier and we definitely want to be on the leading edge of this, because itâ\u0080\u0099s -- as you have seen, it drives utilization and utilization is key to our business. And our next -- will probably be towards the end of this year, beginning in next year, where we do kind of the full-on, full-blown forecast of the whole job for the first time after everything has commenced and that will be our first real test of how did the project sit versus how itâ\u0080\u0099s being executed, and hopefully, we have some positive impacts with our -- what we see in our earthwork side over the summer and we are able to beat our targets in the big ramp up the year this year."
}