{
    "symbol": "NOA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-29 08:44:05",
    "content": " And welcome to the North American Construction Group Earnings Call for the Third Quarter Ended in September 30, 2022. The company wishes to confirm that todayâ\u0080\u0099s comments contain forward-looking information and that actual results could differ materially from a conclusion, forecast or projection contained in that forward-looking information. Additional information about those material factors is contained in the companyâ\u0080\u0099s most recent managementâ\u0080\u0099s discussion and analysis, which is available on SEDAR and EDGAR as well as on the companyâ\u0080\u0099s website at nacg.ca. And then I will conclude with the operational priorities, bid pipeline outlook for 2022 and our first look at 2023 before taking your questions. On Slide 3, our Q3 trailing 12-month total recordable rate of 0.67 is the same as it was after Q2, but remains above our industry leading target frequency of 0.5. And we will be focusing our efforts on further advancing our green hand new hire training programs, prevention of high potential injury events and our wet winter hazard awareness programs as we enter our busy winter season and continue to add to our workforce. On Slide 4, we highlight some of the major achievements of Q3. Moving on to Slide 5, we've added a new slide showing how we have moved away from vendor supported maintenance and continue to develop, attract and retain our skilled maintenance trades people to improve fleet utilization. We had some slight setbacks in our programs earlier in the year, as we tried to resist unusual and high skilled trades, wage increases, but we're back on track and expect to continue the hiring trend. As this slide clearly shows, we know how to grow our maintenance workforce. And even when under average demand, the industry cannot supply enough skilled trades people. We have also long know that wage increases often don't increase supply, and that successful companies will develop and train their own. We would prefer if this was not the case, because if others in the industry will likewise grow their own, we will all benefit from a more suitable supply of skilled maintenance trades before. Lastly, on this slide, I would just like to point out that other than the obvious pandemic impacts our diversification efforts over the last several years had delivered into expectations and demonstrated higher Q2 and Q3 fleet utilization and we have moved the smaller underutilized portions of our heavy equipment fleet out of oil sands and into other geographies and commodities, where they have achieved more operating hours. In addition to welcoming ML Northern team to the NACG family, I want to acknowledge the strength of skills and abilities this team brings to us. After several years of being an ML Northern customer, we realize they share our safe low cost culture, and we also realize they're experts at caring for an operating a service fleet. The initial emigrate integration of ML Northern has been seamless, and we expect to have the full NACG service fleet under ML Northern management over the next few months. On Slide 8 my final slide before handing over to Jason, I just wanted to highlight the open and honest discussions with our oil sands customers regarding cost escalation. These client relationships are a cornerstone to our business in all commodity and geographic areas we work but we're developed, tested and proven strong many times over a half a century working right here in Alberta Oil Sands. On the lower half of the slide, I also wanted to highlight that our Fargo-Moorhead Flood Diversion project which just broke down this past quarter is on track with original color schedule and margins. The project is less than 5% complete, we're excited to be ramping up and heading to our first full operating year. With that, I'll hand it over to Jason for the Q3 financials. Combined revenue of $270 million represented the highest level of revenue this company has ever had in a quarter, and as a noticeable increase from last the last three quarters revenue which were each around $235 million. From a gross margin perspective, we realized 14.7% based on the improved context that Joe touched on, and as much discussed throughout this quarters materials. Getting started with Slide 11 on a total combined basis, revenue was 30% ahead of Q3 2021, which is a recurring variance percentage throughout our financial metrics. Revenue generated by our core heavy equipment fleet was up 18% quarter-over-quarter, with the driver of this increase being equitable contributions from higher equipment and unit rates, as well as improved equipment utilization. Equipment operating hours and the associated operational headcount were both up 10% in the quarter, and yield and utilization of 62% which was significantly higher than Q3 2021 utilization of 52%. Vacancy rates related to the Heavy Equipment Technician roles have lowered with net new hires of approximately 50 in the past three months, which was the primary factor in the overall equipment utilization achieved. The other wholly owned business lines primarily being DGI Trading, and the external sale of rebuilt haul trucks, each posted strong revenue in the quarter consistent with Q3 2021. Our share of revenue generated by joint ventures was $78 million, compared to $43 million in Q3 2021. Nuna Group of Companies had its best financial quarter on record, driven by the activity at the gold mine in northern Ontario, as well as the core businesses operating at better than historic levels. Combined gross project, combined gross profit margin of 14.7% was much improved from the 9.6% we posted last quarter, Q2 2022 and reflected strong operational performance in the quarter as our primary operations in Fort McMurray, Northern Canada and Northern Ontario experienced predictable and productive weather conditions for the majority of the quarter. Our joint ventures continued their strong their trend of strong consistent operating margins, and the updated equipment and unit rates were drivers for the Fort McMurray operations, returning to historical margin performance. Before closing this slide out, I would like to take the opportunity to point stakeholders to page M seven of our MD&A in which we provide a functional breakdown of our cost of sales. Included an EBITDA is general and administrative expenses, which were $6.6 million in the quarter equivalent of 3.4% of the strong revenue quarter. Going from EBITDA to EBIT, we expense depreciation equivalent to 10.6% of combined revenue, which reflects the depreciation rate of our entire business. When looking at just the wholly owned entities, the depreciation percentage for the quarter was 13.8% of revenue, and reflected an extremely effective use of our fleet this quarter. We expect debt levels to decrease in Q4, based on our projected free cash flow generation. Moving to Slide 13, I'll summarize our cash flow net cash provided by operations of $40 million was produced by the business with the difference between this figure and the $60 million of EBITDA being cash interest paid in the quarter of $6.9 million and the timing of joint venture cash distributions in relation to the quarterly EBITDA they generate. On a trailing 12-month basis, our senior leverage ratio as calculated by our credit facility remained fairly steady at 1.7 times, but which we expect will be the high watermark for the year. Looking at Slide 16, this slide summarizes our priorities for 2023. I have previously discussed our commitments to increase our skilled trades shown in item four, but wanted to highlight the other three areas that will be particularly important to progress in 2023. Although we have an extensive health and safety management system, and multiple initiatives for improvements, far too extensive doing the depth here today, we feel our growing workforce requiring increased new hires and an industry supply lower inexperience will be best served with an increased focus on further developing our frontline supervision, expanding our green hand training programs. We will prioritize new technologies such as our telematics system, which is now installed on half of the fleet with the remaining fleet installed scheduled for 2023. And continuing the in-house and vertically integrate our maintenance services and supply, such as a previously mentioned ML Northern acquisition and our component remanufacturing business with the newly expanded facility and added large hydraulic cylinder rebuild capabilities. Last but not least, item three describes our prioritizing of winning bids and achieving our target of greater than 2 billion in backlog by end of next year, which is a great transition to our next slide 17. In Q3 we also received RFPs bid and were awarded several winter projects in oil sands, totaling around $100 million, which never showed up on this list, and essentially have us fully booked through winter. We continue to expect to win our fair share of the large red dot regional oil sands tender, but believe this scope award is delayed or possibly scheduled for re tender next year, although we have not heard so formally. Lastly, we believe we will see another meaningful blue dot went outside of oil sands over this winter, which will continue our diversification success and potentially offer some upside to our forecast and smaller fleet 2023 utilization. On Slide 18, our backlog sits at 1.5 billion. What I continue to believe as a key takeaway on this slide is that our backlog is roughly proportionate to our diversification target, demonstrating both competence and sustainability of our diversification efforts. But with the assume deferral the regional oil sands tender award, which was the driver of that expected increase, we have locked likewise deferred our expectations to next year. With our strong Q3 results, progress on priorities, Q3 tender wins and focus on safe and efficient close to the year, we have been able to increase the midpoints for almost all of our key financial metrics. A bit of free cash flow was deferred into the New Year predominantly due to work expanded and extended at our Northern Ontario Goldmine, JV with Nuna. We made what we believe were high value investments in growth through the acquisition of ML Northern and ensure old friendly buybacks, which we see is complete for the year and will direct the remaining expected free cash flow to deleverage. On Slide 20, we have provided our initial outlook for 2023. As stated in my letter to shareholders, we expect some pressure on earnings and free cash flow due to increased interest rates, but are pleased to show continued annual EBITDA growth coming out of a record expected combined revenue of over $1 billion. Free cash flow of between $85 million and $105 million continues to show the strength of our business, and we are eager to continue the trend execute the 2023 work safely and effectively and continue to properly grow and diversify our business. Regarding 2023 capital allocation, we continue to assess our options in light of market and other macro conditions. In closing, I'd just like to thank our fantastic NACG employees, partners and clients for all your efforts and support in helping us achieve these record third quarter financial results in a challenging economic environment characterized by high cost inflation and increasing interest rates. I know, Joe, you just said you'd speak to it on the next call, but now at a high level in terms of where your head's at, on capital allocation next year, I mean, you've already blown through the NCIB pretty quickly, leverage ratios are pretty good. I agree that our dividends are probably less meaningful in this high interest rate environment, and what we think should be an increasing share price environment. We have two board meetings between now and our next call, actually. When it comes to M&A or growth, we're always just looking at what that accretion of return is, versus other opportunities, our share price relative to our value assessment is going to drive whether we look at NCIB's or SIB's or, or otherwise. And, and then looking at those dividends as far as whether we think it's meaningful and what we need to do to adjust them itself. I tell you that when we have these discussions with our board, we try and be very tangible about how we measure it, and not be emotional and compare what opportunities are there at the time, or that we see coming, be an M&A growth, or looking at dividend or other shareholder friendly activities. And this, this quarter is a big one for us. Because this is, this is where we get our cash flow. That's, that's our focus over the next couple of months here. I think the inflationary pressures we're seeing now and what we would expect to see over the next six months or a year, I think will be captured in our escalation clauses in our normal indices. And if we see something unusual, like we saw in wage escalations in Fort McMurray, we now have a precedent and a template to address it be it escalation or de-escalation. I think, just having clear, open honest communications with clients where no one's trying to hide things or trying to benefit off of something, then I'd feel very comfortable going forward, regardless of whether, future inflation is covered under indices or not. I know, you covered the Fargo-Moorhead margin expectations in your prepared remarks. Yes, typical for us would be, we have to be kind of in that 10% to 20%, complete range before we even start looking at re-analyzing or going into real depth of re forecasting. Just because, you don't have right right now we're less than 5%. So I, I doubt we'll see any updates until likely this time next year. Without getting into details of it, it's -- there is going back to when we submitted things, we had adjustments, but we had accrued some of that. So, it affected the whole quarter regardless of how they met in the workshop, technically. Yes, so we're right around 6% of cost of capital assumption for next year all in. So that should be, with our debt coming down in this quarter, and then similarly, the next year that Q4 would be the quarter to pay down debt, and no cash taxes next year yet. We're projecting 2024 for cash taxes at this point, and continue to manage that. Yes, that's right, which includes the convertible debentures and Capital Leasing and the credit facility. Yes, otherwise, good quarter, and I'll get back in the queue. It's, the sooner it freezes, the better way off, usually. So typically, by the end of the first week or so, November, you start freezing day and night. So the weather plays a lot to do with it, because our dance card is full, it's just a matter of whether we get started earlier, or run later kind of thing. The earliest that actually freezes and stays frozen, and we don't have freestyle events, the better off we are. So that's really what drives a lot of it more than anything else, Tim. A lot of it is our equipment utilization and mechanical availability, if we're looking at. And the opportunity side of it, we also have fleet coming out of our Ontario coal mine joint venture with Nuna. We just assumed a pretty modest amount of hours on that fleet and remobilization There's some upside in that, especially with one of those big blue dots would fit that really well. So the upper end of the range, everything is driven by utilization. No, itâ\u0080\u0099s kind of a more of a, that those assets return to lower utilization of oil sands use if we get one of the bigger blue dots, and we'd actually improve on that. It's more driven by the fleet utilization and mechanical availability, that we see extremely strong demand. It's a good segway into my next question, which is just around slide 17, you got a big blue dot active tender phase, which looks like it could commence before year end. And we expect to know in the next few months, with a kind of April May kind of start in 2023. And I know you've addressed that it's sort of impacted the full quarter, but there was no catch up dynamic, I guess. Right, like so the margin that we're seeing, it's not like you didn't benefit from the previous two quarters, sort of low rates that materialize in Q3. Yes, actually, we we've done this at this time, for the last few years, Max. So I don't think it's unusual for us to provider, our initial outlook, we are we do actually, this is our budgeting season, our next board meeting will be to review that budget, and these numbers reflect that work that we've done. And once we get our kind of 2023 budget in the range, we believe it's accurate, we put it out with our Q3 results. No, I guess I mean, it is a, perhaps a bit more of a fluid environment, maybe relative to what we would have seen in the past. Yes, we have a lot more kind of, in the books kind of work than we used to have years ago. And then, last quick question, just in terms of the labor costs, I mean, should we assume that we're seeing some moderation in terms of wages as you ramp up hiring. Yes, we really haven't seen any unusual wage increases outside of what we saw for maintenance personnel in Fort McMurray. I think we're still in those typical, 2% to kind of 4% years, maybe inflation will push a push us to the higher end of that. Our operator wages and our normal wages are really never an issue in our, because our escalation clauses tied directly to our union contracts, where we had issues where and maintenance wages, because they're actually covered off and equipment costs, not in your normal operating wages. So and we believe that's pretty much, come to a head and we got a pretty good idea where that's going. So, I don't think we see anything unusual. As far as wage escalations going forward, more just looking at availability of people and focusing on the fact that in our training side, and the fact that we're probably going to have more, more less experienced people than we've had in the past, so that we need to really focus on our training and development of that frontline supervision and those new hires. We're getting quite a bit of outside where we, we've got a pretty innovative process, especially when it comes to maintenance personnel. We've attracted a premises at all levels from entry level, to guys that were like vehicle or medium duty kind of mechanics, and getting them back to get their heavy duty certifications. And so, I'm extremely pleased and proud of our HR efforts in bringing in mechanics and bringing in apprentices bringing in what we call direct service providers, which are kind of individual contractors that we hire into the business, it's a mechanic and a truck. We, even our vendors, we've added a significant amount to our vendors, weâ\u0080\u0099re historically our, our OEM dealers haven't been able to, to adjust much. We've brought in 30 odd people from outside vendors, talking about my shareholder letter, from as far away as Australia. So both building our own, attracting others, looking in new new places, weâ\u0080\u0099ll continue doing all that, and I believe we'll be successful. Really, what held us back was we didn't, we didn't feel a need to wait, raise wages back in the earlier part of the year, because we know it doesn't increase people by just ways of raising wages. And but unfortunately, at some point, you start losing people to those higher wages, and you need to adjust. And we don't try and pay over market, we pay market rates and we try and attract based on the quality of our programs and what we can do for our employees. I, we've completed today, I think we have one more truck that we're doing for MNALP our joint venture. So, it's a real balance to make sure we get all of our own gear running before we start fixing or building somebody else's. I would like to turn the conference over to you again Mr. Joe Lambert, President and CEO for closing remarks."
}