{
    "symbol": "ABCM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-12 13:15:03",
    "content": "  Operator: Ladies and gentlemen, welcome to the Abcam Interim Results Webcast for the period ending June 30, 2022. Today's call is hosted by Alan Hirzel, our CEO; and Michael Baldock, our CFO. Before I hand over the call to Alan and Michael, let me briefly cover our safe harbor statements on Slide 2. Some of our comments made during this call may be considered forward-looking statements, leading beliefs and expectations about the company's future performance. Actual results are subject to future events and uncertainties, which can materially impact the company's actual performance. During the call, non-IFRS adjusted financial measures may be used to provide information pertinent to our ongoing business performance. Finally, if you haven't already received them, you can download a copy of the slides used in today's presentation at the company's website www.corporate.abcam.com/investors/reports/presentations. Good morning and good afternoon, everyone. Welcome to our interim results conference call for the period ended 30th of June, 2022. In my prepared remarks today, I will provide a brief overview of the company, review our strategy and talk about our implementation over the past 2.5 years. Once I've done that, I'll hand over to Michael. Our mission is to enable researchers to achieve their mission faster, and, ultimately, for their work to improve health and sustainability measures for us all. We are motivated each day to make an impact on discovery researchers who are working in the life science industry trying to understand how biology works, how that might inform our view on disease or some important aspect of health care systems or life science systems. We focus on delighting our customers with highly sensitive, highly specific products of the highest quality. Customers believe in Abcam's mission, too, as you'll see from the quote from this well-known global biopharma customer, who is excited to be using one of our products in their biomarker research to stratify patients with neurodegenerative disease. As we think about our purpose, and we think about how we can influence research decisions worldwide, and our speed and effectiveness within the addressable market, our products and services are helping Abcam gain market share in an $8 billion market across a wide range of needs depending on the stage of life science activity. There are roughly 800,000 researchers around the world, all of whom who know Abcam's brand. Most will have purchased our products in the last year, and we continue to support their discovery needs. The foundation works with us to be sure that their research tools are of a high quality, generate reproducible results and can scale for broader clinical applications. As our business has evolved, we have expanded to serve customers further downstream beyond discovery. Here, customers are looking to take their early discovery projects and create relevant products for improving human health. Their needs have encouraged Abcam to build capabilities such as recombinant antibodies, larger production volumes and quality management systems to help customers pursue going further downstream into clinical applications. At present, there are more than 100 instances where customers are using Abcam products and technology to determine the best course of action for patient care. Turning to Slide 6, you can see that the evolution of Abcam. With our foundation as a reseller of primary antibodies into the research end market, we have expanded from that historic core. As we learned from our customers, we focused on growth through expansion into product adjacencies or extensions of our served markets, enabling us to earn a greater share of wallet and drive steady revenue growth. At our November 2019 Capital Markets Day, I described high-growth adjacencies we would pursue over the coming 5 years, including conjugation, protein labeling, ELISA kits, recombinant antibodies and engineered cell lines, which are just a few examples where our customers are leading us to growth. Investments we have made in these capabilities are making it possible for Abcam to serve and expand our addressable market, whilst gaining market share. As shown on Slide 7, Abcam's current products and capabilities allows the business to serve customers further downstream in the life science value chain. One of the pain points for customers working on drug discovery is the significant time they spend optimizing and changing reagents as they make the transition from early discovery target identification to assay development, screening up to lead optimization and other applications. We are building a portfolio of capabilities, products and services that make these transitions faster and less costly for the biotech and pharmaceutical industries. While the core of our business and most of our revenue growth is still in primary antibodies, we substantially expanded our portfolio, as I described. Focused strategic investments in assays, proteins, sample preparation and cell engineering are contributing to our growth and market share gain. The biggest strategic change in the company has been, and continues to be our evolution from a supplier of third-party products to a focused product innovator that derives the majority of our revenues and growth from in-house products. Geographically, we broadened beyond our founding market in the United Kingdom into the United States, china and Southeast Asia. That's added considerable growth and breadth to the company, and we believe the mix fairly represents global life science activity. Finally, our investments in innovation and quality have led us to diversify our customer mix. But as you see here, the mix now includes significant sales to higher-growth biopharma segment customers. At the end of our 2019 Capital Markets Day, we presented our investment plan to remove constraints in the business and double revenues to nearly GBP 500 million. On Slide 9, you see the broad goals that described what we had to do to make it possible for us to achieve that ambitious target. We were determined to increase our innovation capabilities and new product development capacity, improve our proposition to biopharma, enhance the customer experience with better IT and e-commerce platforms, expand our operational footprint and, where we could, acquire to accelerate progress on our strategy. Looking back over the last 2.5 years, we have completed most of the planned investments and achieved milestones as expected. We've increased our new product development by over 50% in the past 3 years, resulting in ongoing revenue growth with global manufacturing capacity and footprint beyond the U.K. and China to the U.S. We have strategically increased our investment in research and development, we have prudently deployed capital for strategic M&A, thereby increasing our product portfolio and new product development capabilities. Our in-house, in other words, made by Abcam recombinant antibody portfolio is now over 29,000 products. We control the full supply chain and can deliver higher quality and service levels important to our customers, thereby improving our brand reputation. Assays, protein and cell engineered lines have been key drivers of growth, with an annualized compound annual growth rate of over 50% since 2019. To continue this level of growth, we've expanded our operational footprint to remove that as a constraint mentioned earlier. Whilst there's no single customer or product that contributes materially to Abcam's financial success, we want to share an example of one of the hundreds of thousands of customer stories that are making us successful. Slide 12 shares one example, where Abcam is supporting the transition of basic research into clinical success. The customer is Volition, a multinational epigenetics company, primarily focused on human diagnosis and monitoring through their novel approach to detecting nucleosomes in cancer and netosis, which is the body's natural inflammatory response to an underlying condition. With Volition's further diagnostic validation work, we are both hopeful of achieving clinical success together as Volition moves its products through regulatory pathways, IVDR in Europe and FDA in the United States. Most of the transition from legacy systems has now taken place, and we have just recently updated our sales and distribution systems. On Slide 14, I'm proud of the business that we've built and continue to improve upon at Abcam. Nowhere was this more true than with our China team during the recent lockdowns in Shanghai, and I pay special tribute to everyone who worked together as one team throughout those difficult months during the COVID lockdown in China. We continue to focus on making Abcam an inclusive employer, and we are making progress on our diversity and inclusion agenda. For example, we've launched 7 employee resource groups across key employee areas of interest, and we've hired our first Head of Diversity and Inclusion. Finally, we're pleased that our ESG, environmental, social and governance efforts highlighted by our first impact report released earlier this year. Before handing it over to Michael, I want to conclude on Slide 15 with a brief review of where Abcam stands today. Finally, in recent weeks, we've spoken to many of our top shareholders about delisting from the AIM market in the U.K., leaving us with only our listing on NASDAQ. Good morning and good afternoon, everyone. I'll take you through the key components of our income statement, including in-house revenues and operating expenses; and finally, guidance. On Slide 17, I want to highlight five key financial metrics that are indicators of the successful implementation of our strategy. All of my commentary today will compare first half results for the period ended 30th June, 2022, to its comparable period, the 6 months ended 30th of June, 2021. Total revenues in the first 6 months were GBP 185.2 million, up approximately 20% on a constant exchange rate basis, and up approximately 23% on a reported basis, with favorable foreign exchange tailwinds accounting for approximately 3% of reported growth, largely as a result of the pound weakening against the U.S. dollar and Chinese renminbi. Overall, In-house revenues were the key driver of our results with 37% revenue growth on a constant exchange rate basis. In-house sales defined as Abcam produced catalog products, including BioVision, plus custom products and licensing, CP&L, now represents 67% of reported total sales. Recall, BioVision was a third-party supplier before the acquisition and previous sales of BioVision products were accounted for as third-party revenues, but are now included in in-house sales in this half. We estimate that BioVision sales incrementally benefited reported revenues by mid-single-digits, thereby resulting in approximately mid-teens organic sales growth in our core business. Margins benefited from in-house product mix, the inclusion of BioVision and ongoing commercial activities. Looking at foreign exchange, we experienced a modest favorable impact of approximately 20 basis points, driven by our considerable U.K. operating costs as compared to the U.S. and China currencies mentioned earlier. Adjusted earnings per share was 14p per share, up 97% from last year despite a higher effective tax rate of approximately 21%. Finally, as our margins improved, so has our return on capital employed to 8.8%. This estimate is calculated on a rolling 12-month basis, and I'd like to note that BioVision's investment is fully included in the base, but returns are for the 8 months, reducing the measured return on capital employed for the period. The Americas, representing approximately 43% of catalog sales, grew 31% at constant exchange rates. Revenues in EMEA, which represents 26% of catalog sales, grew 13% at constant exchange rates. China, which represents 17% of sales, reported growth of 11% on a constant exchange rate basis. In the period, we reclassed sales from Hong Kong into China. Excluding the Hong Kong reclass, China sales growth would have been high single digits impacted by COVID lockdowns. From a product perspective, overall antibody sales represent nearly 2/3 of our catalog revenue and continue to benefit from a broad customer base with increasing demand by biopharma customers for carrier-free formulations and a growing product portfolio. Assay sales, representing approximately 25% of catalog sales, were driven by strong demand for our in-house assay technology largely from biopharma customers. Customers evaluate suppliers based on ease of use, quick, consistent results and easy scale-up for their workflows. Here, our products are focused on cytokines, small proteins secreted to simulate and communicate between cells and growth factors used to grow and maintain cells and culture. On Slide 19, you can see that in-house catalog revenues were GBP 109.5 million, up 40% on a constant exchange rate basis. Recombinant antibodies continue to benefit from demand across all customer segments, enabled by our fast consistency, validation data and coverage across thousands of relevant targets. We win by serving our customers with our extensive and growing portfolio of in-house products, offering high quality, ease of use and consistent supply. Life science research, in particular, biopharma's investment into cell and gene therapies, have been a key driver of our protein cytokine use from the bench to the clinic, especially in cell-based therapies. As our rate of investment has slowed, our cost growth in our base business has moderated as compared to the second half of 2021's comparable growth as seen on Slide 20. In addition, we had higher IT costs, completing our digital road map and experienced higher travel costs as compared to the low level travel we experienced during COVID. Looking at 2023, we currently anticipate higher than typical personnel costs, but expect ongoing leverage as we look to deliver on our 5-year commitment by 2024. The situation is dynamic and recent headlines have gotten worse, but we continue to be positive about the outcome for the full year 2022. Looking at the impact from foreign exchange rate, pound versus U.S. dollar and Chinese renminbi, we expect revenue tailwinds, a nominal negative impact on gross margins, but modest adjusted operating profit tailwinds consistent with the first half of 2022. On China, you noted the conditions were forming in line, but the incremental headwind seems to be coming out a little bit stronger with the news coming out in the region. As they have the zero tolerance policy in place, our expectation is that any province or any city could go into lockdown at any time because that's just the nature of how the policy will meet the realities, and that's what we've seen so far. For us, the most important thing that we had going for us throughout the first half was our logistics manufacturing operations were in Hangzhou and Hangzhou was able to operate throughout. And then longer term, I think as we've talked about in the past, reagents are relatively more stable and resistant to changes in funding than perhaps other elements of the life science environment. And reason for that as long as people are employed and doing work in labs, there's a certain kind of base level of consumption that they'll do with regions. So I think we have to wait and see what happens for '23, '24 funding. In fact, to date, funding looks very strong worldwide, and we see pretty healthy demand in the academic sector. Maybe just moving on from academia and looking at the other two main categories that you highlight in your chart, research institutes and biopharma. And my follow-up, if I can, was just highlighting one of the numbers that you pointed to, which is that third-party sales were down 5%. On the funding support for biopharma research institutes, again, the underlying demand and activity there is pretty strong. Some companies have obviously struggled to get the funding they want, they burnt out. But because we have so little customer concentration in any one of those companies and that, that, on the margin, is a pretty small impact on Abcam. A lot of their funding will be coming from NIH or from major kind of translational clinics and here, too, not seeing any conservative demand looks good. On the third party, the simple answer is just a little bit of math here going as we move BioVision out of third party into in-house and the mechanics of how that work I'll leave to Michael. Yes, Charles, we saw low single-digit growth in third-party products if you actually take into account the switch of BioVision from a third-party to in-house. Puneet, well, as I think I said at the end of the full year last year, we're getting to levels now, certainly at 75.6%, where, if you remember that most of our cost of goods sold is labor that -- I'd encourage you to not get too much more aggressive than that. And I think we've picked up most of the benefit that we've gotten out of the switch from BioVision and the BioVision product and probably picking up a little more of the period, but that has been a strong driver of our operating margin, continues to be, and we continue to do things to hope to drive that forward, but I wouldn't get too much more aggressive on it. So -- and then can you talk a little bit, I mean, assay sales were obviously strong. How much of that is sort of locked in, recurring, versus trials that could turn on and off. Obviously, given the sort of the macroeconomic climate right now, I also wanted to get your thoughts on the early-stage companies, biotech companies and small biotechs. So sort of two questions, one on sort of durability of assays and exposure to small biotechs and therapeutics companies. On the assays, both immunoassays, activity assays, enzymatic assays, we've got a pretty broad portfolio now with BioVision and everything we've been doing in ELISA and care development. We're certainly seeing, as we've talked about many times before, the demand from the platform companies that are doing immunoassays on, as they push towards proteomics. And then if I could just squeeze in last one on -- for Michael, maybe on just M&A and sort of capital deployment. And now with BioVision integrating well, just wondering your updated thoughts on sort of M&A. And I think that even though you've seen share prices come down in the public market, they're still relatively high if you think about what they're trading on from a multiple perspective. So I'd say we're looking at a lot of companies, but we're continuing to exercise a fair amount of discipline. On the capital structure side, as you know, we've got a fair amount of leeway on our balance sheet between our access to equity capital markets and our access to debt markets and our relatively unlevered balance sheet to be pretty flexible. If you look at the last two deals we did, both BioVision and Expedeon, they were complicated transactions, but fit really well with our current ambitions on the product line side, and in particular, being large providers to us gave us a leg up, I think, in getting them done. You called out, I think, one area sort of additional investment here on the e-commerce side, some additional upgrades. Well, if you again look at our long-term guidance, what we've said is that we're very comfortable at the top end of our revenue range. And I think if you go back to what we again said at the end of the year, if you look at our current increases, now with a 23% adjusted operating margin for the first half, that we continue to see a continuing trajectory, leading up to that 30% plus adjusted operating margin at the top end of our revenue guidance range. So I think you can -- you draw straight lines, plus or minus, you'll be there. And then you commented earlier this year, I think, some internal surveys, you had maybe 85% of academic labs back to normal by January. We actually stopped doing the survey just because it's back to normal, with the exception of pockets where there's shutdowns in China, there's no longer any data that gives us concern about levels of academic or other non-activity. First, I kind of want to follow up on the last point maybe and then -- but just tweak it a little bit. I mean, you're still guiding to mid-teens organic and 20% CRR for the year, and that's despite the lockdowns in China and some of the things going on in Europe. I mean you saw a really strong growth in the U.S., and that certainly helped to offset them. We think the U.S. is going to continue to be a strong grower, and we're hopeful that China recovers and doesn't continue to lock down, but it's hard to be any more precise than that, Mike. And then you talked about in the past, but I just want to make sure we have all the details right. I mean I think if you look at the footnotes, our adjusted -- the adjustments we made to operating profit, there're some one-off costs in there for the process this year, and there will probably be some slight one-off costs next year. But on the flip side, we'll also be alleviating some of our filing and registration and compliance burdens by, right now, having to comply with requirements on two exchanges. But just kind of conceptually, we will be having an extraordinarily -- an extraordinary general meeting in, I think, early November. It's a pretty easy process and will require shareholders to just make an opt-in having their shares in exchange for ADS's, but the details will all be laid out in the offering circular that will be mailed out later in this quarter. And that -- assuming that is approved by shareholders, that we would begin the delisting process early December and finish it by year-end. Thank you, and thanks, everyone, for joining us today and for the questions. Lisa brings unique combination of experience in life sciences, pharmaceuticals, digital, e-commerce and it's just fantastic to have her joining the Board. And later this week, we're going to be at the Morgan Stanley Healthcare Conference in New York, and we'll be meeting with many of our shareholders and potential shareholders and analysts there. So it's an exciting week and an exciting time to be at Abcam, and I appreciate you all taking the time today to be with us."
}