{
    "symbol": "MMM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 11:23:06",
    "content": " Our Healthcare business enables better, smarter and safer care and we'll be well positioned to support customer needs and make the most of attractive opportunities, including a growing focus on infection prevention to help providers reduce related rehospitalizations, hospitals increasing investments and improvements in clinical and operational workflows to drive efficiencies and improve patient experiences, more frequent use of biologics as a first-line choice of treatment. Second quarter total sales were $8.7 billion, which increased 1% on an organic basis versus last year's 21% comparison. First, as forecasted, we experienced a year-on-year decline in disposable respirator sales of approximately $150 million; and second, the Greater China region's COVID-related lockdowns resulted in a sales decline of approximately $140 million year-on-year. This FX impact, combined with the China COVID-related lockdown, negatively impacted second quarter operating margins by nearly one percentage point and earnings by $0.24 per share versus our expectation of $0.30 as discussed during a conference in early June. And finally, as discussed during last year's second quarter earnings call, we realized a benefit to both operating margins and earnings in Q2 last year from a Brazilian Supreme Court social tax ruling, which led to a 100 basis point margin and $0.12 per share headwind to this year's second quarter. I will start with our Safety and Industrial business, which posted sales of $2.9 billion or up 0.7% organically compared to last year's second quarter. This result included headwinds from the decline in disposable respirator sales of approximately $150 million year-on-year, which negatively impacted Safety and Industrial's organic growth by 5.7 percentage points, along with the COVID-related lockdowns in the Greater China region. Safety and Industrial's second quarter adjusted operating income was $630 million, down 12% versus last year. Looking at our Healthcare business, which delivered strong quarter sales of $2.2 billion, with organic growth of 4.4%. Healthcare second quarter operating income was $494 million, down 10% year-on-year. Lastly, our consumer business posted second quarter sales of $1.3 billion or down 2.5% year-on-year on an organic basis versus last year's 18% comparison. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. And also on healthcare, is the plan that -- it's levered at 3, 3.5 times, is the plan you'd get that sort of step one the big dividend back to the RemainCo at that point when it spins out and then step to a year late, so you can start to monetize that just under 20% stake. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}