{
    "symbol": "MMM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 10:41:03",
    "content": " Fourth quarter total sales were $8.1 billion or down 6.2% year-on-year, which included headwinds from foreign currency translation of minus 5% or $400 million, which is better than the minus 7% we had expected. On an adjusted basis, fourth quarter operating income was $1.5 billion, with operating margins of 19.1%. Fourth quarter adjusted free cash flow was $1.7 billion, up 3% year-on-year, with conversion of 131%, up 18 percentage points versus last year's Q4. Capital expenditures were $506 million in the quarter and $1.75 billion for the year, or up 9% year-on-year as we continue to invest in growth, productivity and sustainability. Looking at our Healthcare business, Q4 sales were $2 billion, with organic growth of 1.9% versus last year. Health Care's fourth quarter operating income was $421 million, down 18% year-on-year. Consumers fourth quarter operating income was $224 million, down 24% compared to last year, with operating margins of 17.9%, down 3.3 percentage points year-on-year. Based on this outlook, we expect organic growth of minus 3% to flat, along with adjusted EPS of $8.50 to $9, and adjusted free cash flow conversion of 90% to 100%. While there are a number of headwinds to earnings in 2023, ultimately, our full year performance will be driven by organic sales volumes, sustained progress in global supply chains and raw material availability, and our ability to drive improvements and reduce costs in our manufacturing and supply chain operations. This range includes the continued healing of global supply chain, expected improvements in working capital performance, particularly inventory reductions and full year capital expenditures of $1.5 billion to $1.8 billion, which includes approximately $200 million of investment in water stewardship related to our exit of PFAS manufacturing. Therefore, taking all of these items into consideration, we estimate Q1 total adjusted sales in the range of $7.2 billion to $7.6 billion versus $8.5 billion adjusted for the exit of PFAS manufacturing or down 10% to 15% year-on-year. This range is impacted by the continued slowing of organic sales volumes, a pre-tax restructuring charge of $75 million to $100 million or $0.10 to $0.15 per share, a tax rate of approximately 19%, along with normal Q1 items. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}