{
    "symbol": "MMM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 14:38:05",
    "content": " Our team posted organic growth of 2% or more than 3%, excluding the impact of the decline in disposable respirator sales, along with adjusted margins of 21.5%, adjusted EPS of $2.69 and $1.4 billion of adjusted free cash flow. Third quarter total sales were $8.6 billion or down 3.6% year-on-year, which included headwinds of 5.1% of $450 million from foreign currency translation and 50 basis points of $50 million from the divestiture of Food Safety, along with the deconsolidation of Aearo Technologies. On an adjusted basis, third quarter operating income was $1.9 billion, with operating margins of 21.5%, which were up 40 basis points year-on-year and 50 basis points sequentially. We continue to focus on serving our customers and drive additional actions, including recovering our sales backlog in China from the April and May COVID-related lockdowns, implementing appropriate selling price actions to address ongoing inflation, maintaining strong spending discipline, implementing targeted productivity actions to adjust businesses to end market demand trends while driving simplification and continuing to invest in growth, productivity and sustainability to ensure we are all well positioned for long-term success. These actions helped to more than offset a number of headwinds in the quarter, including the decline in disposable respirator sales, which negatively impacted Q3 operating margins by 30 basis points and earnings by $0.07 a share; incremental end market softness particularly in consumer electronics, along with oral care and consumer retail in the U.S. as persistent inflationary pressures are slowing consumer spending; ongoing global supply chain challenges and raw material constraints; and finally, geopolitical impacts, particularly Russia, which was a year-on-year headwind of $50 million to revenue and $0.03 to earnings per share. Third quarter adjusted free cash flow was $1.4 billion, with conversion of 88%, an improvement from first half performance as we drive working capital intensity, including improved inventory levels, while also increasing CapEx for growth and sustainability investments. Capital expenditures were $435 million in the quarter and $1.2 billion year-to-date are up 19% year-on-year as we continue to invest in growth, productivity and sustainability. I will start with our Safety and Industrial business, which posted sales of $2.9 billion or up 1.7% organically compared to last yearâ\u0080\u0099s third quarter. Operationally, the Safety and Industrial team drove strong execution during the third quarter, delivering adjusted operating income of $673 million, up 8% versus last year and up 7% sequentially versus Q2. Third quarter operating income increased 9% to $474 million, with operating margins of 21.2%, up 2.5 percentage points year-on-year. Looking at our Healthcare business, which delivered Q3 sales of $2.1 billion, with organic growth of 1.7% versus last yearâ\u0080\u0099s strong 8% comparison. Lastly, our Consumer business posted third quarter sales of $1.4 billion or up 1.5% year-on-year on an organic basis versus last yearâ\u0080\u0099s 8% comparison. Consumerâ\u0080\u0099s third quarter operating income was $299 million, down 3% compared to last year with operating margins of 21.3%, down slightly year-on-year. Our updated 2020 to full year outlook includes; organic growth in the range of 1.5% to 2% versus a prior range of 1.5% to 3.5%; adjusted earnings in the range of $10.10 to $10.35 versus a prior range of $10.30 to $10.80, which includes an additional headwind of $0.15 per share from foreign currency exchange compared to just three months ago; and adjusted free cash flow conversion to be in the range of 85% to 95% versus our prior range of 90% to 100%. This includes organic growth in the range of 1% to 3%, which includes a 2% headwind or $150 million to $200 million from the continued decline in disposable respirator demand, and the exit of Russia, which will create a year-on-year headwind of approximately 80 basis points or approximately $70 million. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}