{
    "symbol": "VTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 14:29:02",
    "content": " Normalized FFO per share was $0.76, right in line with our forecast with 13% SHOP growth led by an outstanding 9% increase in year-over-year revenue, and nearly 5% total company year-over-year same-store cash NOI growth. With year-over-year SHOP growth of 9% in the second quarter, 13% this quarter and 15% to 21% projected in the fourth quarter, this is what we have been waiting for. Looking ahead to the fourth quarter, in addition to SHOP growth, our normalized FFO guidance of $0.71 at the midpoint represents 4.5% growth versus Q4 2021 excluding material unusual items overcoming the macro, interest rate and FX headwinds that we and virtually all other real estate companies are experiencing. NOI grew 13% year-over-year, which is above the midpoint of our SHOP guidance range led by the U.S. at 17.4%, while Canada demonstrated positive growth again with 5.9%. Same-store SHOP revenue in the third quarter grew ahead of expectations, increasing nearly 9% year-over-year due to continued acceleration in RevPOR  growth and positive trends in occupancy. At 5.4% year-over-year growth, RevPOR is the strongest weâ\u0080\u0099ve seen in the last 10 years, primarily driven by in-house rent and care increases and re-leasing spreads that have improved to positive 1.4% in Q3 from negative double digits during the low point in the first quarter of 2021. Year-over-year same-store operating expenses grew 7.6%, driven primarily by occupancy growth and continued macro inflationary impacts throughout the quarter on labor, utilities, repair and maintenance and food costs. Starting with office, same-store cash NOI grew 3% year-over-year, which represents a beat to our third quarter guidance. For R&I, year-to-date, same-store cash NOI performance is a strong 4.8%, while we posted same-store growth of 1.5% for the third quarter. Q4 2022 normalized FFO is expected to range from $0.68 to $0.74 per share, which represents nearly 4.5% growth at the midpoint when compared to the fourth quarter of 2021, adjusted for unusual items in the prior year. Total company same-store NOI growth year-over-year of 6% to 9% is expected with accelerating SHOP same-store NOI midpoint growth of 18%, leading the way. So weâ\u0080\u0099ve had â\u0080\u0093 our conversion rates have been relatively â\u0080\u0093 they move around a little bit, but relatively consistent around 9% and moving activity as I mentioned, actually it was higher in the third quarter than it was in the second on an absolute basis. Youâ\u0080\u0099ll notice if you look on the trending that weâ\u0080\u0099ve been â\u0080\u0093 Iâ\u0080\u0099m going all the way back to the first quarter of 2021, 94%, 91%, 91%, 96%, 97%, 92% and now 98%. So the fourth quarter expectation, it has around â\u0080\u0093 we mentioned the year-over-year growth range of 100 basis points to 150 basis points. Weâ\u0080\u0099ve got occupancy growing 100 basis points to 150 basis points revenue growing 8% , implied in that is something like 6%  revenue, i.e., RevPOR growth."
}