{
    "symbol": "VTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 13:23:01",
    "content": " As we look forward in the third quarter of 2022, we are again projecting that our earnings will benefit from outstanding year-over-year growth in our SHOP segment, which is expected to increase NOI 12% at the midpoint, higher than second quarter's 9% year-over-year SHOP NOI growth rate. And we have had positive net move-ins for 16 of the past 17 months, and NOI has been solid as our year-over-year same-store SHOP portfolio grew 14.2% in the first quarter and 8.7% in the second. At 5% year-over-year growth, RevPOR is the strongest we've seen in the last 10 years, primarily driven by in-house rent increases, which are running approximately 8% in the U.S. and 4% in Canada, care rate increases at 10% and re-leasing spreads that have improved from negative 14.7% since the low point in the first quarter of 2021 to nearly flat in June. NOI grew 8.7% year-over-year, near the high end of our SHOP guidance range led by the U.S. at 14%, while Canada demonstrated positive growth again with 1%. The bridge from Q2 FFO per share of $0.72 to $0.76 at our Q3 midpoint is as follows: a net increase of $0.03 from $0.05 of HHS grants received in July, less $0.02 from higher interest rates on our floating rate debt and a stronger U.S. dollar; plus $0.01 of property growth led by the opening of the Drexel R&I development Debbie described earlier. We expect SHOP cash NOI to grow in the range of 9% to 15% year-over-year or 12% at the midpoint, which represents an acceleration from the 9% year-over-year NOI growth posted in the second quarter. And then meanwhile, the U.S. is really the growth engine, where our cash NOI is expected to grow between 13% and 21% in the third quarter, revenue 9% year-over-year and 320 basis points of occupancy. So we have really good occupancy, 93% in our same-store pool for R&I, But COVID -- we also have -- we have some tenants that are pure office tenants and innovation space, and we disclosed this last quarter that we had a couple of move-outs in that area where people have just reconsidered the space they need and the type of space they need."
}