{
    "symbol": "LH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 15:56:08",
    "content": " These forward-looking statements include but are not limited to, statements with respect to the estimated 2023 guidance and the related assumptions, the proposed spinoff of the clinical development business, the impact of various factors on the company's businesses, operating and financial results, cash flows and/or financial condition, including the COVID-19 pandemic and general economic and market conditions, future business strategies, expected savings and synergies, including from the LaunchPad initiatives, acquisitions and other transactions and opportunities for future growth. On a constant currency basis, excluding COVID testing revenue, enterprise base business revenue grew 6% in the fourth quarter versus prior year. Looking forward, our Diagnostic business will accelerate with 10.5% to 12.5% base business growth, benefiting by around 5 percentage points with a full year of our Ascension partnership. For Drug Development, fourth quarter base business revenue in constant currency declined 1% versus prior year. Revenue for the quarter was $3.7 billion, a decrease of 9.4% compared to last year, due to lower COVID testing and the negative impact from foreign currency. COVID testing revenue was down 79% compared to COVID testing last year, while the base business grew 4.8% compared to the base business last year. Excluding these items, adjusted operating income in the quarter was $510 million or 13.9% of revenue compared to $902 million or 22.2% last year. Revenue for the quarter was $2.3 billion, a decrease of 12.8% compared to last year, primarily due to organic revenue being down 14.3% which was due to COVID testing, partially offset by acquisitions of 1.7%. Relative to the fourth quarter of 2019, the compound annual growth rate for base business revenue was 6.9%. Base business volume grew 3% compared to base business last year, including the benefit from acquisitions of 2.4% but was constrained by unfavorable impact from weather and fewer revenue days of approximately 1.2%. Price/mix decreased 1% versus last year due to lower COVID testing of 6.4%, currency of 0.3% and acquisitions of 0.2%, partially offset by base business growth of 5.9%. Base business price/mix was up 7.6% compared to base business last year, benefiting from the Ascension lab management agreement of approximately 7%. The decrease in adjusted operating income and margin was due to a reduction in COVID testing as the COVID margin was approximately 50% for the quarter, down from approximately 70% last year. Revenue for the quarter was $1.4 billion, a decrease of 4.1% compared to last year, primarily due to foreign currency of 3.1%. Organic base business revenues declined 1.4% compared to last year, due to the negative impact from lower COVID-related work and the Ukraine-Russia crisis. At the midpoint of our base business guidance, the compound annual growth rate compared to 2019 is 6.4%, including the benefit from Ascension of approximately 2%. If you compare that to the fourth quarter CAGR of 2019, it was about 5% but both of those were offset by a 9% decline in the central laboratory business versus prior year. Also, Patrick, when you think about the growth rate for '23, the 5% to 7% growth within Drug Development, that $80 million to $100 million or obviously the midpoint gets you to around 1.5 points of headwind."
}