{
    "symbol": "SWBI",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-08 19:34:02",
    "content": " Encouragingly, even with this lower retail activity, unit inventory of Smith & Wesson products within our distribution and strategic retailer accounts dropped significantly throughout the quarter, and we believe are now largely within target ranges for this time of year. And so despite the firearms market in fiscal 2023, expected to be down versus last year and well below the fiscal 2021 peak, we still expect to deliver strong top line performance with profitability ratios and cash flow comfortably within our long-term targets, a testament to the efficacy of that flexible manufacturing model and the power of the Smith & Wesson brand. Net sales for our first quarter of $84.4 million was $190.2 million or 69.3% below the prior year comparable quarter and $11 million lower than the first quarter of fiscal 2020, the last pre-pandemic comparable first quarter. As we noted in last quarter's earnings call, we expected our Q1 sales to be the lowest quarter of the year at roughly 10% to 20% of the full year total and we came in towards the lower end of that estimate. The decrease in margin from last year's high was due primarily to a combination of reduced sales volumes across nearly all product lines; unfavorable fixed cost absorption due to lower production volume and employee-related costs associated with the relocation, partially offset by decreased compensation costs due to vacancies and favorable inventory valuation adjustments. Operating expenses of $27.6 million for our first quarter were $2.5 million lower than the prior year comparable quarter, primarily due to lower sales-related expenses, such as co-op advertising and freight as well as decreased compensation-related costs driven by temporarily unsold positions, we believe as a result of the relocation. However, when compared to the first quarter of fiscal 2020, in spite of $11 million on lower sales, net income was $1.1 million higher this quarter due to lower operating expenses and interest offset by lower gross profit dollars."
}