{
    "symbol": "SWBI",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-09 18:59:06",
    "content": " As a powerful illustration of the impact of our model, revenue of $129 million in our fiscal third quarter increased 1% from the comparable period in fiscal 2020, while EBITDA increased by nearly 60%, aided by a 440-basis-point improvement in gross margin, reflecting higher ASPs and lower operating costs. Net sales for our third quarter of $129 million was $48.7 million or 27.4% below the prior year comparable quarter, but $1.6 million above the third quarter of fiscal 2020, the last pre-pandemic comparable third quarter. Operating expenses of $27.7 million for our third quarter were $3 million lower than the prior year comparable quarter, primarily due to a $1.4 million reduction in relocation costs, lower profit sharing, lower sales related expenses, such as co-op advertising and freight, and decreased compensation related costs driven by temporarily unfilled positions, we believe as a result of the relocation. When compared to fiscal 2020, on a normalized basis, our third quarter fiscal 2023 operating expenses were $2.3 million lower, as the inherent benefits of our ASP strategy and reduced headcount more than offset a $6.2 million increase in profit sharing expense. Net income of $11.1 million in the third quarter, compared to $30.5 million in the prior year comparable quarter, reflecting lower net sales and gross margin, slightly offset by reduced operating expenses. However, when compared to the third quarter of fiscal 2020, net income was $6.9 million higher this quarter due to higher ASPs and lower interest expense. And finally, as compared to our third quarter, operating expenses are expected to be slightly higher due to relocation costs and travel associated with customer shows, which will more than offset a decline in marketing costs associated with the SHOT Show, which took place in January. We expect cash generated from operations to be positive in the fourth quarter due to a reduction in inventory and expect total capital spending for the fiscal year in the range of $115 million to $120 million, driven by the relocation of Tennessee."
}