{
    "symbol": "NPO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 14:57:06",
    "content": " Also note that during this call, we will be providing full year 2023 guidance, which excludes unforeseen impacts from these risks and uncertainties, as well as changes in the number of shares outstanding, impacts from future acquisitions, dispositions and related transaction costs, restructuring costs, incremental impacts of inflation, geopolitical variable and trade tensions on market demand and costs subsequent to the end of the fourth quarter, the impact of the foreign exchange rate changes subsequent to the end of the fourth quarter and interest rate increases differing from assumptions outlined in guidance. Our Advanced Surface Technologies segment ended the year with an adjusted segment EBITDA margin of around 30%, despite weakening in demand in the semiconductor market seen late in the fourth quarter, and while continuing to invest in long-term growth opportunities. EnPro's fourth quarter capped off a strong year for our company, as reported sales at $271.9 million in the quarter increased 27.8% year-over-year. Volume growth, strategic pricing actions, operational efficiencies, and the sustained benefits of our portfolio optimization, were partially offset by higher incentive compensation costs driven by strong share price performance during the period, inflationary raw material and wage expenses and late quarter weakness in the semiconductor capital equipment market that affected volume and mix. Corporate expenses of $15.6 million in the fourth quarter of 2022, were down from $27.8 million a year ago, driven primarily by the absence of acquisition-related expenses experienced last year, partially offset by $2.4 million of increased incentive compensation expense that resulted mostly from the rise in our share price during the quarter. Adjusted diluted earnings per share of $1.47, increased more than 48% compared to the prior year period, with growth in operating income more than offsetting higher interest expense resulting from higher debt balances, higher interest rates, and a reduced benefit from net investment hedges compared to the fourth quarter of 2021. Turning now to Advanced Surface Technologies, fourth quarter sales of $115.4 million, increased 67% over the prior year, driven by the acquisition of NxEdge, and more broadly, increased demand in the semiconductor market, even in the midst of softness late in the quarter. For the fourth quarter, adjusted segment EBITDA increased approximately 38% versus the prior year period, driven primarily by the acquisition of NxEdge, and strong organic sales growth, offset by the impact of the late quarter softness in semi markets that adversely affected volume, product mix, and absorption of variable and fixed cost in parts of our semiconductor business."
}