{
    "symbol": "OCSL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-04 13:32:10",
    "content": " Adjusted net investment income per share was $0.17 for the quarter, down slightly from the $0.18 for the prior quarter and on par with our fiscal first quarter demonstrating the strength of our earnings profile. While we are highly selective and focused on new deals with favorable prices and structures, we expect to continue identifying interesting investment opportunities across private and public markets given the breadth of the Oaktree platform and our team's focus on finding the best relative value in all market conditions. Markets had widely anticipated rate increases, but the pace at which the Fed has moved and the pace it signaled it will continue to move exceeded prior expectations and spurred volatility across equity markets in the second calendar quarter, while spreads widened across public credit asset classes. We remain focused on lending to larger, more diversified businesses that we believe carry lower risk  Median portfolio company EBITDA as of June 30 was approximately $128 million, up from $118 million in the prior quarter. Moving on to investment activity, our $132 million of new investment commitments were spread across 12 new and 16 existing portfolio companies in the third quarter. For the third quarter, we reported adjusted net investment income of $31.4 million or $0.17 per share, down slightly from $32.3 million or $0.18 per share in the second quarter. If base rates as of June 30 were in effect for the entire quarter, we estimate that our adjusted net investment income per share, would have been about a $0.01 higher resulting in adjusted NII of about $0.18 per share. At quarter end, the Kemper JV had $365 million of assets invested in senior secured loans to 56 companies, down from $390 million last quarter driven by spread widening across the portfolio. It is â\u0080\u0093 we don't really have a plan to generally speaking, be operating in the upper end of that range, but we do want to maintain the flexibility around expectations with our shareholders and with the rating agencies that if there is a market event or an economic event that creates the opportunity for us to realize or for us to originate well structured and well priced loans, especially something like a rescue lending opportunity so that we â\u0080\u0093 we may see over the next 12 or 18 months."
}