{
    "symbol": "PBA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 14:02:15",
    "content": " While we typically see a sequential lower contribution in the second quarter from Pembina's NGL marketing business, our results benefited from continued growth in volumes across many of Pembina's systems, higher NGL margins and a strong contribution from the crude oil marketing business. Our agreement with Tourmaline, together with the previously announced service agreements with Conoco Phillips Canada and another unnamed customer provides 3 leading Montney producers with certainty of transportation egress from this key area for their future development and access to the remainder of Pembina's integrated value chain, including fractionation and marketing services. Relative to the same period last year, second quarter results benefited from stronger marketing results due to higher margins on crude oil and NGL sales, a combination of higher volumes on the Peace Pipeline system and higher tolls largely due to inflation as well as higher contributions from Aux Sable and Alliance. These positive factors were partially offset by a lower contribution from Ruby, due to Ruby Pipeline filing for bankruptcy protection on March 31, 2022, higher realized losses on commodity-related derivatives, lower contracted volumes on the Nipisi and Mitsue pipeline systems due to the expiration of contracts, and higher general and administrative costs, primarily due to higher long-term incentive costs driven by Pembina's relative share price performance. Relative to the previous guidance, the revised outlook for 2022 primarily reflects stronger marketing, results higher contribution from the Alliance and Cochin pipelines as well as certain assets in the Gas Services business and the anticipated closing of the NewCo transaction later this month. Year-to-date, Pembina has generated cash flow from operating activities of nearly $1.3 billion, which has been used to fund dividend payments and the capital program with the excess used to repurchase common shares and reduce debt, thereby strengthening the company's leverage metrics. Pembina continues to observe steady volume growth on key systems and a positive outlook for additional future growth is being informed by a number of factors, including the sound financial position of Pembina's customers, price strength across all commodities in Pembina's value chain, the quality of the WCSB formations, such as the Montney and the Duvernay, the development of LNG facilities on Western Canada's West Coast, the expansion of the Trans Mountain pipeline and potential growth and diversification within Alberta's petrochemical sector. We're excited about increasing volumes of propane as more volumes build on the pipeline systems and then the mention of us looking at additional fractionation capacity, we think there's opportunity to export additional volumes."
}