{
    "symbol": "LEVI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 19:34:03",
    "content": " On a constant currency basis, Q4 net revenues were flat with the prior year's record Q4 revenue and we grew the business 6% above 2019â\u0080\u0099s pre-pandemic level. In 2022, the Levi's brand grew 11% and grew global market share more than any other denim brand for the second year in a row, led by share gains in both men's and women's. Total company women's revenue grew 13% surpassing $2 billion and our tops business grew 12%, exceeding $1.2 billion for the year. This quarter's performance reflects the benefits of the diversification of our business as our success internationally in Asia and Latin America was sustained incredible momentum in Q4, demonstrating the power of the Levi's brand around the world and helping offset declines in U.S. wholesale and Europe largely driven by Russia. Second, the steps we have taken to emerge stronger from the pandemic have substantially improved the structural economies of our business, enabling us to deliver gross margin for the year 380 basis points ahead of 2019 and adjusted EBIT margin, excluding foreign exchange of 12%. This reflects the continuing strength of the Levi's brand generating strong results across the globe, led by continued strength in brick and mortar, including in the U.S. And despite operating in a largely promotional marketplace, during the November, December period, gross margin remained robust almost 200 basis points ahead of 2019. For fiscal 2023, we expect net revenues between 6.3 billion and 6.4 billion reflecting reported revenue growth of 1.5% to 3% year-over-year, inclusive of 200 basis points of headwind split evenly from foreign exchange and the suspension of our business operations in Russia. The biggest challenge has been the wholesale dynamic here in the U.S. As we look forward into fiscal or into calendar 2023, the outlook from Euromonitor is for a continuation of, kind of low-single-digit category growth and we're confident, it's kind of in the range of where we've got our revenue outlook, kind of in-line with our full-year guidance."
}