{
    "symbol": "LEVI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-07 21:29:06",
    "content": " Revenue in the second quarter grew 20% on a constant currency basis and 15% on a reported basis to $1.5 billion, reflecting strong consumer demand across our business and around the world. We also increased profitability, expanding adjusted EBIT margin 90 basis points to a record 9.9% for the second quarter, which drove adjusted EBIT growth of 27% and adjusted diluted earnings per share growth of 26%. Following 11 consecutive quarters of pre-pandemic double-digit revenue growth, our total women's business grew 23%, the fifth consecutive quarter of double-digit growth since exiting the most challenging parts with the pandemic. While women's saw broad-based growth across geographic segments, growth was especially strong in the Americans, where the Levi's women's business was up 30%. Total net revenue grew 20% to $1.5 billion, driven by 21% revenue growth in the US and strong performance across our diverse global portfolio. Second quarter net revenue growth of 20% was primarily driven by higher volume as well as an increase in AURs, demonstrating again the strength of our brand and our leadership in the denim category as we price to offset inflation. As Chip referenced, with consumer shopping behavior shifting from online to in-person shopping, our e-commerce business was down 2% in quarter two, yet remains over 60% higher versus 2019 with its operating margin on a fully allocated basis in the mid-single-digit. And growth through all digital channels was up 8% year-over-year, remaining elevated versus 2019 levels and comprising approximately 20% of total second quarter net revenue. Adjusted gross margin was maintained in reported dollars as a second quarter record of 58.2%, primarily due to improved  element, including mix shifts to higher gross margin DTC, international, women's as well as a sustainable improvement within wholesale. Adjusted SG&A expenses in the quarter was $711 million or 48.3% of net revenue, leveraging 90 basis points despite A&P being higher by 10 basis points. Our gross margin coupled with our disciplined SG&A management and operating leverage generated an adjusted EBIT margin expansion of 90 basis points to 9.9%, while adjusted EBIT dollars were up 37% in constant currency, even as we continue to strategically invest in our long-term growth initiative. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}