{
    "symbol": "LEVI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-07 00:00:06",
    "content": " We grew first-quarter revenue by 22% to $1.6 billion with broad-based growth across markets, channels, category and gender, fueled by strong consumer demand across our portfolio of brands. Levi's Tops business, which returned to growth versus pre-pandemic levels in Q4 increased 12% driven by broad-based strength in Men's, in addition Wo Women's, which saw continued traction in wovens and dresses. And our Levi's Brands U.S. wholesale business grew 23%, achieving its highest first-quarter revenues in over a decade. Record adjusted growth margin continued to strengthen expanding 170 basis points to 59.4% due to a higher mix of sales from DTC as well as price increases, lower promotions and higher share of full-price sales, partially offset by higher product costs. The approximate $130 million increase relative to last year was primarily due to higher selling expenses and increased distribution expenses associated with higher volumes and labor costs, higher spending in A&P as we invest evenly across the year, and higher incentive compensation given the outperformance versus expectations, partially offset by currency benefit due to the stronger U.S. dollar. Building on the positive momentum from the past two quarters, Europe delivered another robust quarter up 13% reported and 21% constant, demonstrating the resilience of the consumer and strength of Levi's brand despite the only Omicron variant. On balance, despite these incremental headwinds, given the strong momentum in our business, we are reaffirming our full-year guidance and continue to expect double-digit revenue growth for the full year of 11% to 13% or $6.4 to $6.5 billion and adjusted EPS of $1.50 to $1.56. Your line is open. Levi's engine is strong, our core business is really strong, is evidenced in the U.S. and the good news for us is all our brands, Dockers, Beyond Yoga, Signature, Denizen, beside Levi's are showing momentum and accretive to growth. Your line is open. Your line is open. So the business is very, very healthy, and we feel good about the consumer and we do believe that there is still opportunity for more pricing down the road in the second half of the year, which we think we're going to need based on where costs are going and we've been extremely surgical with how we've done our price increases and I think that's a big part of the reason why it's been sticking. Your line is open. But as you know, China is less than 3% of our total global business and still an opportunity for us, for sure, but it's not going to have really a consequential impact on our results in the coming quarter or for the year. Your line is open. Your line is open."
}