{
    "symbol": "FTRP",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-16 11:25:59",
    "content": " Good morning, everyone, and welcome to fiscal 2023 first quarter earnings conference call for Reunion Neuroscience Inc., formerly known as Field Trip Health Ltd. As the company has completed its reorganization, today's discussion will focus on Reunion; Field Trip & Wellness will hold a separate call later this month. Presenting today will be Ronan Levy, who has stepped into the role as Chairman and CEO of Field Trip Health & Wellness, additionally, he will continue to serve as a member of the Board of Directors of Reunion; Joseph Del Moral, Chairman and CEO of Reunion; and Donna Wong, CFO of both Reunion and Field Trip Health & Wellness will be presenting. The TSX Venture Exchange has now granted final listing approval for Field Trip Health & Wellness, and we expect that Reunion and Field Trip Health & Wellness will begin to trade independently, on August 17. Reunion will continue to focus on the research and development of novel psychedelic molecules such as RE104, formerly known as FT-104, while Field Trip Health & Wellness will continues its focus on developing and delivering innovative psychedelic-assisted therapies. In connection with the closing of the arrangement, Field Trip Health & Wellness completed a series of private placement financings for gross proceeds of $19.9 million, led by Oasis Management Company and Reunion. Upon closing of the spinout transaction and after its $9.8 million investment in Field Trip Health & Wellness, on August 11, Reunion had approximately $40 million in opening cash which we believe is sufficient to support our ongoing drug discovery work. Field Trip Health & Wellness reported a net loss during the quarter of $8.2 million, compared with a $9.1 million loss in the same period of the prior fiscal year. With respect to Field Trip Health & Wellness, we had approximately $12 million in operating expenses for the quarter, of which $3.4 million were nonrecurring, $2.4 million related primarily to the spinout transaction, $1 million related to an impairment of fixed assets which are disclosed in our financial notes, and it reflects the impairment on our construction in progress as a result of our decision, which we previously announced, to defer the opening of our six clinics. Goes without saying, we are excited about the future for both Reunion and Field Trip Health & Wellness with Reunion well-placed to progress novel psychedelic developments and Field Trip Health & Wellness well-positioned to continue leading in the delivery of psychedelic-assisted therapies."
}