{
    "symbol": "AVID",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-04 02:16:06",
    "content": " Subscription ARR was $141.3 million at the end of 2022, an increase of 37.1% year-over-year, and total ARR was $244.9 million, an increase of 10.2% year-over-year. Subscription revenue during the fourth quarter was $42.5 million, an increase of 24.6% year-over-year. Excluding the one-time accounting adjustment in the quarter that I spoke about earlier, subscription revenue increased 34.3% year-over-year and 39.2% year-over-year at constant currency. For the full year in 2022, subscription revenue was $151.3 million, an increase of 37.1% year-over-year. Excluding the one-time adjustment in the fourth quarter, total revenue would have increased over 6% year-over-year on a constant-currency basis. Annual recurring revenue based on the annualization of subscription and maintenance bookings was $245 million in the fourth quarter, an increase of $23 million or 10% year-over-year and 13% year-over-year at constant currency. The consistent growth in the number of paid subscriptions drove continued growth in our subscription revenue during the fourth quarter, which reached $42.5 million, an increase of 25% year-over-year and 30% on a constant-currency basis. Excluding the onetime non-cash revenue adjustment of $3.3 million in the quarter, subscription revenue would have increased 34.3% year-over-year and 39.2% year-over-year at constant currency. During the fourth quarter, maintenance revenue was $26.5 million, down 16% year-over-year. Excluding the onetime non-cash revenue adjustment in the quarter, subscription and maintenance revenue would have increased 10.3% year-over-year and 14.3% year-over-year at constant currency. In the fourth quarter, integrated solution revenue was $40.8 million, a decrease of 4% year-over-year but 55% higher than during the previous quarter as we continued to resolve supply chain issues through finding alternative sources of supply, selective redesigns and other means. Total revenue in the fourth quarter was $116.1 million, down 2.5% year-over-year and up 2% at constant currency. Excluding the onetime non-cash revenue adjustment in the quarter, total revenue would have increased 0.3% year-over-year and 4.4% year-over-year at constant currency. Excluding the one-time non-cash revenue adjustment in the quarter and the adjustments to the bonus, adjusted EBITDA would have been $2.4 million higher than the reported results at $27.2 million in the quarter, and on a constant-currency basis, adjusted EBITDA would have been $29.2 million in the quarter. For the full year, subscription revenue was $151.3 million, up 40% year-over-year and 45% on a constant-currency basis. Excluding the one-time non-cash revenue adjustment in the fourth quarter, subscription revenue increased 43% year-over-year and 48% year-over-year at constant currency. Excluding the one-time non-cash revenue adjustment in the fourth quarter, FY2022 subscription and maintenance revenue would have increased 14.6% year-over-year and 17.8% year-over-year at constant currency. Perpetual license revenue was $11.1 million for the full year 2022, a decrease of 53% year-over-year as we continued to deemphasize perpetual licenses and focus on strategic subscription revenue. Integrated solutions revenue was $123.3 million in full year 2022, down 6% or $7.8 million year-over-year due to the supply chain headwinds related to certain parts of our audio business. Total revenue for the full year 2022 was $417.4 million, up 2% year-over-year and 5% at constant currency. Excluding the one-time non-cash revenue adjustment in the fourth quarter, total revenue would have increased 2.6% year-over-year and 6.1% year-over-year at constant currency. When adjusting for the FX impact to both revenue and costs, adjusted EBITDA was negatively impacted by $7.4 million in the year and would have resulted in a 17.9% growth at constant currency. Excluding the one-time non-cash revenue adjustment and the associated bonus adjustment in the fourth quarter, adjusted EBITDA would have been $84 million, an increase of 11.3% year-over-year. Excluding the one-time non-cash revenue adjustment and bonus adjustment in the fourth quarter, non-GAAP earnings per share would have been $1.47, an increase of 18% year-over-year, and at constant currency, $1.62, an increase of 30% year-over-year. Our guidance for 2023 ARR at the end of the period is $270 million to $280 million, a range which represents year-over-year revenue growth of 12.3% at the midpoint. Our guidance for 2023 total revenue is $447 million to $472 million, a range which represents year-over-year revenue growth of 10.1% at the midpoint. Our guidance for 2023 subscription and maintenance revenue is $292 million to $302 million, a range which represents year-over-year growth of 13.7% at the midpoint."
}