{
    "symbol": "AVID",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 21:42:06",
    "content": " First, we're very pleased at the strong growth of our software subscription revenue in the quarter driven by very robust enterprise subscription results, and the reacceleration of our creative tools, including terrific performance from Pro Tools, all resulting in record subscription that adds this quarter. We continue the trend of successfully converting a substantial number of enterprise customers to our subscription offerings in Q3, helping to deliver stronger than expected subscription revenue growth in the quarter, especially when comparing on a constant currency basis. During the third quarter, healthy demand for our customers and strong commercial activity continued across our business, resulting in 6% year-over-year revenue growth in constant currency. The growth in total subscription revenue continued to drive double digit subscription and maintenance revenue growth and resulted in on a constant currency basis, over 13% year-over-year growth in ARR and approximately 37% year-over-year growth in subscription arr. The revenue growth combined with year-over-year improvement in gross margin and sequentially stable operating expenses enabled us to deliver an adjusted EBITDA margin over 20% for the quarter, and we delivered non-GAAP EPS growth of 40% year-over-year. Moving to our enterprise business, MediaCentral subscriptions grew to approximately 35,600, an increase of about 12,500 during the third quarter, representing year-over-year growth of 290%. Now moving to the composition of our revenues, the consistent growth and the number of paid subscriptions drove continued growth and subscription revenue during the third quarter, which reached $41.8 million, an increase of 49% year-over-year, and 56% on a constant currency basis. Total subscription and maintenance revenue increased year-over-year by 18% in the third quarter, and 22% on a constant currency basis. Total combined integrated solutions perpetual and professional services revenue was $33.9 million in the third quarter, driven by lower integrated solutions and the continued transition away from perpetual software licenses. Integrated solutions revenue was $26.3 million in the third quarter, a decrease of 16% year-over-year. Perpetual license revenue was $1.8 million, a decrease of 69% year-over-year, as we continue to de-emphasize perpetual licenses and focus on strategic subscription revenue. Even with the declining Perpetual Revenue, total software revenue from subscription and perpetual licenses increased year-over-year by 29% in the quarter, as subscription revenue growth significantly exceeded the perpetual revenue decline. Annual recurring revenue based on the annualization of subscription and maintenance bookings was $237.2 million in the third quarter, an increase of $21.5 million or 10% year-over-year, and 13% year-over-year at constant currency. Subscription revenue growth year-over-year outpaced subscription ARR growth due to primarily two strong third quarter 2022 enterprise subscription in revenue, which has different revenue recognition characters is under ASC 606. Total Revenue the third quarter was $103 million, up 1% year-over-year, and up 6% at constant currency. Adjusted EBITDA was $21 million in the third quarter up 23.5% or $4 million year-over-year, driven by the improvement in both revenue and non-GAAP gross margin. However, the strengthening U.S. dollar continues to create a headwind of year-over-year comparison against our plan for the full year, we expect headwinds from effects on our total revenues this year will be $12.8 million for the full year, with $6.9 million in the fourth quarter. As we look at bridging our prior guidance that we had, with a midpoint of $440 million in total revenue for 2022, the change is an incremental $9 million in foreign exchange headwinds, which we cannot recover from, with the remainder of the gap from lower product sales in our audio hardware business related to the macro supply chain issues. We expect the headwinds from foreign exchange on subscription and maintenance revenue this year will be $6 million for the full year, with $3 million of the headwind expected in the fourth quarter. Our guidance for 2022 subscription and maintenance revenue is now $260 million to $268 million, a range which represents year-over-year growth of 14% at the midpoint, and 17%, excluding the FX impact at the midpoint."
}