{
    "symbol": "AVID",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 22:46:04",
    "content": " While we continue to see strong customer demand and business activity across our portfolio, we have seen a tightening of supply for several components for our audio integrated solutions at the end of the first quarter that impacted our ability to meet that demand resulting in first quarter revenue at the lower end of guidance. But the total subscription plus maintenance revenue grew at a healthy 12% year-over-year in the quarter, which contributed to the year-over-year growth in ACV. During the first quarter, we continued our profitable growth, driven by robust performance in our subscription business and our growing recurring revenue. The consistent growth in the number of paid subscriptions drove continued growth in subscription revenue during the first quarter, which reached $33 million an increase of 32.5% year-over-year. Maintenance continues to be a solid part of the business and during the first quarter, maintenance revenue was $28.3 million, down 5% year-over-year. We expect subscription and maintenance revenue to grow 19% year-over-year in the second quarter using the midpoint of our guidance range, which equates to 16% growth for the first half of the year in line with our 2022 financial model and strategic plan. Even with the decline in perpetual revenue, total software revenue from subscription and perpetual licenses increased year-over-year by 19.5% in the first quarter as the subscription revenue growth significantly exceeded the decline in perpetual revenue. Our Integrated Solutions business remained healthy with Integrated Solutions revenue of $28.2 million in the first quarter, an increase of 7.6% year-over-year. Professional services revenue continued to be steady at $6 million in the first quarter, a decrease of 6% year-over-year. Total combined integrated solutions, perpetual and professional services revenue was $39.4 million in the first quarter basically flat year-over-year. Non-GAAP operating expenses were $49.7 million in the first quarter, a $3.4 million increase year-over-year, due mainly to investments to support product innovation to drive our long-term model as well as $600,000 increase in travel associated with our commercial efforts and a $500,000 one-time expense for an IT asset write-off. Adjusted EBITDA was $19.3 million in the first quarter up 9% or $1.6 million year-over-year, driven by the improvement in both revenue and non-GAAP gross margin. Free cash flow was $4.7 million in the quarter down $6 million year-over-year primarily due to the $9 million use of cash for working capital, compared to the first quarter of 2021, relating mainly to a reduction in accounts payable and deferred revenue and to an increase in prepaid expenses related to our digital transformation efforts. We expect continued growth in subscription revenue from expected strong performance in enterprise subscription business, solid performance from our creative tools and contributions from new subscription product introductions, including the new tiers for Pro Tools Artist that Jeff mentioned previously. Our guidance for second quarter of 2022 subscription and maintenance revenue is $60 million to $64 million, representing at the midpoint 19% year-over-year growth in the second quarter and 16% growth for the first half of 2022. Our guidance for 2022 subscription and maintenance revenue remains $266 million to $274 million, a range which represents year-over-year growth of 17% at the midpoint."
}