{
    "symbol": "AVID",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 00:13:03",
    "content": " During the second quarter, healthy demand from our customers and strong commercial activity continued across our businesses, resulting in year-over-year revenue growth in the quarter. Our subscription and maintenance revenue grew 19% year-over-year in the quarter to 62 million, based on strong subscription growth across our businesses. However, there's a significant growth in our total subscription revenue continued to drive double-digit subscription and maintenance revenue growth and also resulted in strong 14% year-over-year growth in ARR and 46% year-over-year growth in subscription ARR. Now moving to the composition of our revenues, the consistent growth in the number of paid subscriptions drove continued growth in subscription revenue during the second quarter, which we reached 34.1 million, an increase of 59% year-over-year. During the second quarter maintenance revenue was 27.8 million down 9% year-over-year as we continue to successfully convert our enterprise customers to subscription offerings at a healthy uplift in excess of 140%, we are seeing a reduction in the related software maintenance revenue from those customers. Total subscription and maintenance revenue increased year-over-year by 19% in the second quarter, subscription and maintenance saw 15% growth for the first half of the year in line with our 2022 financial model and long-term plan. Integrated solutions revenue was 28 million in the second quarter, a decrease of 11% year-over-year, as was the case in the first quarter despite continued robust market demand several integrated solutions products were impacted by the global supply chain challenges, limiting our production capacity and our ability to meet customer demand at the end of the quarter. Even with the declining perpetual revenue, total software revenue from subscription and perpetual licenses increased year-over-year by 35% in the second quarter, as the subscription revenue growth significantly exceeded the perpetual revenue decline. The annual recurring revenue based on the analyzation of subscription and maintenance bookings was 231 million in the second quarter, an increase of 28.4 million or 14.1% year-over-year. We saw continued robust market demand, but total revenue was constrained during the quarter as we ended the quarter with unfilled contractually committed orders for integrated solutions that were approximately 20 million more than normal. For the third quarter of 2022, our total revenue guidance is 100 million to 112 million, a similar size range as was provided for our second quarter of 2022 solely related to the supply chain risks to integrated solutions revenue we discussed earlier. Our guidance for third quarter of 2022 subscription and maintenance revenue is 67 million to 70 million, representing at the midpoint to 16.7% year-over-year growth in the third quarter. While we are also seeing healthy demand, healthy market conditions and strong demand for our integrated solutions, the impact from the global supply chain challenges on our integrated solutions business and the expected timing of the recovery from these challenges are adding variability to our full year 2022 business plans. Our guidance for 2022 subscription and maintenance revenue remains 266 million to 274 million, a range which represents year-over-year growth of 17% at the midpoint."
}