{
    "symbol": "GXO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 12:23:03",
    "content": " So, in closing, while we recognize the more dynamic macro environment, when we look at our customer base, our strategic relationships, the projects we're implementing in the coming quarters and the high degree of visibility our contractual business model affords us, we're continuing to be confident about our growth and performance in 2023. One of the things we were really attracted to about Clipper was that it's a great company, great amount of customers, but actually when it comes to tech enablement, automation, so when you visit a typical GXO site you're going to see lots of collaborative robots, good to person robots, robotic arms. Please proceed with your question. Going into the third quarter, we had customers who are looking to expand their business from Europe and some from U.S. into U.S. into Europe and they wanted to pause and just take a look and make sure that strategy was the right strategy in today's environment. So those are the changes we're seeing is cost out, focused on technology and looking at ways where they can be flexible in the market till they really understand what's going on in 2023. That's a good thing, but on top of the core activity we've obviously as Barry just mentioned early in the year, quarter one, quarter two, we really had an outsized amount of new business going in. So all of those forces bring an element of counter cyclicality to our growth, if you break down the new wins, we've got roughly we won in the quarter around $158 million in Q3, that's going to fall broadly, $20 million in 2022 and another $120 million into 2023. Please proceed with your question. We are cautious and we're calling out the fact that maybe we'll have a little bit more softer on our core activity, but more than compensated by the sheer growth of business that is already signed, it's already in process of being planned for implementation, leases assigned with buildings, contracts in place with automation providers. Please proceed with your question. Please proceed with your question. So I'm curious to hear you're talking about the strong pipeline customers coming to you and asking for more services, obviously we're seeing some challenges in the marketplace from a macro standpoint where maybe your service gets valued maybe a little bit more at a premium. Please proceed with your question. Now, we've got our Investor Day coming up in January, and we're really looking forward to that because that's a window for us to share a lot about the business, about where we think our verticals will drive in the future, the different geographies, our strategies in terms of the best use of our capital."
}