{
    "symbol": "GXO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 12:00:03",
    "content": " Please proceed with your questions. Please proceed with your questions. But really, what's happening in this $2.5 billion pipeline, which, by the way, is up 20% year-over-year, we're winning some great contracts, and those contracts have tilted to our strengths, which obviously are margin and return enhancing. That now goes, in essence, you can think about it as being existing customer wins of 4% to 5%, so that gives you a sense of what's going on in the underlying business, which, as you say, is highly skewed in our business towards e-comm. That basically is 10.5%, plus 2.5%, which means we've got a gross win rate already banked for this year of 12.9% in the bag, plus anything that we could potentially win in the April that's just passed and the May that we're currently sitting in. So that's what really drives our confidence in terms of existing customers, gross wins, and when you combine that with the fact that, as Malcolm said, this mid to high-90s revenue retention rate, that's very strong for a business services company such as us, as I'm sure you're aware. Please proceed with your questions. I just want to think about, we talk a lot about margins for this business, but at the end of the day, it's a very growth-centric business and even if you don't expand margins, as long as you're not declining margins, your EBITDA is still growing. Please proceed with your questions. Please proceed with your questions. Very broadly, I think this year, we're budgeting for around $400 million of revenue in that business and clearly, there's a lot of validation in the market by what you're seeing with some of the M&A in the space. So we're very excited with what's going on within our base business in the U.S. And then as we acquire, obviously, Clipper will provide a growth avenue within the European portion, which will act to a certain degree as a GXO Direct Europe, so to speak. Please proceed with your questions. Please proceed with your questions."
}