{
    "symbol": "GXO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 12:36:05",
    "content": " For the full year, we delivered revenue of $9 billion, organic growth of 15.4% and adjusted EBITDA of $728 million at the top end of the range we provided at our Investor Day. Given the business we've already closed through the fourth quarter of 2022, combined with our strong sales pipeline, we're starting the year with a high idea of visibility to our growth. Our adjusted diluted earnings per share for the full year 2022 is $2.85, up 36% from $2.09 in the prior years, driven by our EBITDA growth and aided by the addition of Clipper, which was EPS accretive in 2022 and will be more so in 2023. We are also reiterating our adjusted EBITDA guidance of $700 million to $730 million, and that's including an assumption of approximately $70 million of headwind coming from foreign exchange and reduced pension income, exactly as we mentioned on our Investor Day 4 weeks ago. And then equally, you need to add on something, as Malcolm said, in terms of being able to achieve new wins in both Q1 and Q2 of this year, and that will allow you to essentially take those numbers and get within touching distance of the 6% to 8% already even before you've considered the base existing operations growth. Basically, you're forecasting more than doubling of EBITDA from 23% to 27% , which is like over 20% compounded annual growth number, just given that there's not a lot of operating leverage in the business, I would assume that that's kind of the revenue trajectory that you're also forecasting. And Brian, to Bill's point, we've got the pedigree on GXO Direct, as he says, I mean, we did very well on that last year did about $300 million or so of revenue, that was up 32% year-over-year, and the margins on that business are very strong, roughly at 10.8%. And of a typical customer, you can see that, that is a multibillion-dollar opportunity within a $500 billion TAM don't get lost in those numbers, $500 billion TAM in the context of a business that's just done $9 billion of revenue if there is going to be a gravitation towards scale in this industry as we think, that is clearly a long road ahead in terms of growth for this business."
}