{
    "symbol": "GXO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 13:34:10",
    "content": " As Malcolm mentioned, this quarter, we delivered an all-time record of 20% organic revenue growth, reflecting expansion in our existing business as well as new wins. From a profitability perspective, adjusted EBITDA grew to $176 million, up from $161 million on a pro forma basis a year ago, reflecting the execution of our new startups as well as a continued inflation pass-through in our business. Please proceed with your question. If you look at our new customer wins, what we have is we roughly got another $69 million that we won in the second quarter of the year that takes you to roughly $1.1 billion of extra revenue in the hopper for this year, thatâ\u0080\u0099s 14% gross revenue growth signed in new wins for 2022. And when you look into the components of this phenomenal organic revenue growth, the first half is coming from net new business wins and driven by start-ups we discussed last quarter and the second half comes from our increase in our organic operations, our existing operations, similar to like-for-like growth in our core business. Please proceed with your question. Please proceed with your question. And just as Bill mentioned, a good deal of that, just under $0.5 billion of new contract wins going to be implemented not really in this year because there is a lead time of preparing the warehouse and getting all the automation in place. Please proceed with your question. So the revenue disclosures around new business wins for next year, I mean, obviously, there is at least $500 million of incremental revenue, probably $700 million to $800 million of new business, if you incorporate the back half of this year, there is $400 million of additional Clipper revenue next year as that cycles through. Please proceed with your question. For next year, roughly, if you are taking this average rates â\u0080\u0093 FX rates for this year, roughly 104 to 105 euro-dollar and 124 pound-dollar, which we do have as much pound business as well as euro business, the impact year-over-year will be roughly $30 million, and thatâ\u0080\u0099s going to be â\u0080\u0093 that is going to be balanced with the net new business wins, continuous improvement opportunities as well as Clipper EBITDA and Clipper cost synergies. Please proceed with your question. Please proceed with your question. Thatâ\u0080\u0099s including record organic growth, a record amount of new business wins as well as consecutively increasing our EBITDA and cash flow every quarter year-over-year."
}