{
    "symbol": "OWL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-13 12:17:05",
    "content": " Not only have we had strong fundraising trends, but our redemptions from products that offer quarterly tenders have remained de minimis with just $186 million of tenders received on the $13.4 billion of fee-paying AUM managed by those funds or less than 1.5%. In direct lending, we had gross originations of $22 billion for the year, just slightly off our pace from the prior year, despite a 20% decline in U.S. leverage loan volumes and a 42% decline in announced U.S. M&A transactions. In GP Capital Solutions, we deployed about $4 billion of capital completing transactions with world class managers such as Dragonair, KPS, Veritas and PAI and bringing us to 70% committed for Fund V. During the fourth quarter, we held a final close for Fund V at nearly $13 billion over 40% higher than our $9 billion target during a period that many across the industry have described as a difficult fundraising environment. Our latest open-end product, Net Lease Trust, has reached $1 billion of capital raised primarily through just one large warehouse platform and we look forward to continuing to expand the syndicate over the coming quarters. Through the third quarter of 2022, funds greater than $1 billion received roughly three quarters of the total capital raise across the industry, up from two-thirds in prior years. We achieved our goal of $1.3 billion of revenue, we achieved our goal of a 60% FRE margin and we track nicely in very tough and volatile markets against our goal of raising $50 billion of fee-paying AUM by the end of 2023, by completing the year 2022 with $25 billion raised pathway towards our goal. GP Capital Solutions management fees are up $1.3 million or 1% from last quarter and up 53% year-over-year, excluding catch up fees. AUM grew $6.1 billion to $138.2 billion, a 5% increase from last quarter and a 46% increase from the fourth quarter a year ago. Permanent capital grew $4.7 billion to $110.7 billion, a 4% increase from last quarter and a 40% increase from the fourth quarter a year ago. So as it relates to the $7.4 billion of AUM not yet paying fees in direct lending, it would take us about two quarters to fully deploy this based on our average net funded deployment pace over the last 12 months although our current deployment pace is a little slower than that. When we think about our P&L, we have previously stated our goal for 2023 was to generate $1.8 billion of revenue, double our 2021 revenues and would represent a 35% growth from 2022. And most importantly, we have previously stated in our goal for 2023 was to generate $1 billion of distributable earnings, which would be an increase of approximately 35% from 2022. We feel it's prudent from a capital allocation policy perspective to fix our dividend at $0.56 for 2023 or $0.14 per quarter to allow flexibility for capital allocation uses such as our share buyback program, funding GP commits and potential strategic acquisitions. Your line is open. I just want to -- I think you know this, but just remind everybody look, we raised $25 billion last year and what I would describe as a really challenging and choppy market. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And on the flip side, if retail really comes through, maybe starting in 2Q, but in the back half of the year, in particular, we could see a little more in placement costs a little lower in FRE margin, but that also sets us up to certainly meet, if not exceed the $50 billion of fee-paying AUM raise. Your line is open. Your line is open."
}