{
    "symbol": "WBA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-13 13:56:03",
    "content": " As youâ\u0080\u0099ll remember from last October, we introduced four strategic priorities: First, transform and align the core business; second, build our next growth engine, U.S. Healthcare; third, focus on portfolio and optimize capital allocation; and fourth, build a high-performance culture and a winning team. U.S. digital sales grew 37% for the year on top of 74% growth in 2021. myWalgreens membership surge passed a big milestone, reaching 102 million customers. We are seeing meaningful contributions from alternative profit streams at $125 million in income for the year, including Walgreenâ\u0080\u0099s advertising group with 35% growth. And if the initial acquisition of a 55% stake had closed in line with our original timeframe, we wouldâ\u0080\u0099ve achieved our $3 billion to $3.2 billion sales goal in fiscal year â\u0080\u009822. Fiscal year â\u0080\u009823 will include further investments in our pharmacy team of $265 million, as we made good progress in returning stores to normal operating hours. John has more than 25 years of expertise, including as President of Castlight Health, a healthcare tech company; Group President for New Markets at Medco, a $70 billion PBM that spun out of Merck; and Founder and Chair of Surescripts ePrescribing Network, the first cross-industry collaborative with competing retail, PBM and health plans. Solid gross profit performance in U.S. Retail and the continued rebound in International were offset by the lapping of peak COVID-19 vaccinations in the year-ago quarter, and planned growth investments in U.S. Healthcare. However, if you exclude the 5.5 percentage-point negative impact from AllianceRx and positive contributions from U.S. Healthcare M&A activity, core sales growth was a healthy 6%. On a full-year basis, comp retail sales were up a strong 6%, the highest in nearly two decades with positive contributions from personal care, beauty and cough/cold, flu, as well as COVID-19 OTC tests, which contributed about 3 percentage points of growth. Before moving on, I want to reiterate that our full year EPS grew 3%, ahead of our original guidance of flat, and we made substantial progress against our goals as we build out our U.S. Healthcare business. Based on execution to date and improved visibility, we are increasing our 2025 sales target for U.S. Healthcare by over 20%, and we are now projecting sales of $11 billion to $12 billion by 2025. We expect sales of around $5 billion, including a full year of contribution from prior acquisitions and pro forma sales growth of 45% to 55%. The U.S. Healthcare segment is scaling to $5 billion in sales, and pro forma sales growth of 45% to 55% reflects strong growth across all of our health care businesses. VillageMD sales are projected at $2.8 billion to $3 billion, growing 50% to 60% with the performance driven by growth in value-based patients at existing clinics and continued expansion of their clinic footprint. We anticipate pro forma growth of 20% to 30% at CareCentrix, reaching sales of over $1.4 billion in fiscal â\u0080\u009823. We expect U.S. Healthcare to contribute over half of the annual adjusted EPS growth over the long term, while we continue to assume moderate growth from the core business and increased returns from capital deployment as we exit â\u0080\u009823 with improved credit metrics. With our solid execution to date and greater visibility ahead, we are increasing our fiscal â\u0080\u009825 sales goal from $9 billion to $10 billion previously to $11 billion to $12 billion, and representing a compound annual growth rate of approximately 50% on a pro forma basis. We see a clear path for U.S. healthcare to achieve profitability starting in fiscal year â\u0080\u009824, and weâ\u0080\u0099re already raising long-term sales targets. And I think as you look out over the coming years, I think we will -- we have Shields which is immediately profitable, and weâ\u0080\u0099re not breaking out by unit, but itâ\u0080\u0099s at least $100 million profit in the fiscal â\u0080\u009822. And the track record of the U.S. front of store business in â\u0080\u009822 was we grew overall volume at -- sorry, comp revenue at 6%, of which about 3 points came from OTC test but still a strong 3% across the business for the year, and we increased margins at the same time. So, we -- this is -- I think what we said last October, weâ\u0080\u0099re facing into a period of 24 months of investment to build out the U.S. Healthcare business, and the returns will be outsized and the working capital will -- sorry, the free cash flow will come back up to -- in the $3 billion to $4 billion type range in â\u0080\u009824, â\u0080\u009825, that kind of range."
}