{
    "symbol": "WBA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-30 11:33:01",
    "content": " Sales increased low single digits on a core basis in constant currency, excluding the negative impact of AllianceRx Walgreens and the 65% pro forma sales growth at Walgreens Health. The International business more than doubled its adjusted operating income with its retail sales recovery, and the U.S. segment achieved solid retail comp growth against challenging multiyear comparisons with positive traffic trends as consumers continue to depend on Walgreens for their essential needs. VillageMD and Shields continue to realize tremendous top line growth, and we've added a third strategic partner for our Walgreens Health organic venture, bringing the number of lives covered above the 2022 year-end target of 2 million. Together, VillageMD and Shields drove pro forma sales growth of 65% for Walgreens Health in the quarter. Third quarter sales declined 2.8% on a constant currency basis, strong growth from Walgreens and the International segment. If you exclude the negative impact from AllianceRx and the positive benefit from Walgreens Health M&A, constant currency sales growth was approximately 3%. Adjusted operating income declined 34% on a constant currency basis, driven by a decline in U.S. pharmacy as it lapped the peak COVID-19 vaccinations in the year-ago quarter and planned growth investments in Walgreens Health. Adjusted operating income increased 13.7% on a constant currency basis, reflecting adjusted gross profit growth across both pharmacy and retail in the U.S. and a continued rebound in international sales and profitability. GAAP EPS increased by $3.60 to $5.49, reflecting a $2.5 billion after-tax gain in the first quarter related to the valuation of our prior investments in VillageMD and Shields as well as lapping a $1.2 billion charge net of tax from the company's equity earnings in AmerisourceBergen in the year-ago period. Adjusted operating income decreased 34%, mainly reflecting lower pharmacy performance, including a challenging comparison against peak COVID-19 vaccinations in the year-ago quarter. Adjusted operating income was $174 million in the quarter, more than doubling versus prior year, led by sales growth and tight cost control. Comparable NHS volumes showed modest growth, while pharmacy services advanced 22% in the quarter, with stronger demand for new online health care services. As we move forward, we will continue to be laser-focused on: one, making further improvements in our core business; two, evolving our portfolio to ensure we are dedicated to the areas which provide the best returns; three, building out our Walgreens Health business, which is expected to be a significant percentage of our earnings growth over the long term; fourth, managing and preserving our capital across our many assets; and five, recruiting and retaining a world-class team of top talent."
}