{
    "symbol": "WBA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-31 13:03:07",
    "content": " Our U.S. retail sales comp of 14.7% was the highest in over 20 years, above even last quarter's record, and we are seeing significant recovery in our international markets. We are making rapid progress towards building out Walgreens Health with a clear path to a run rate of more than $4 billion exiting fiscal year 2022, well on our way to our goal of $9 billion to $10 billion in sales by fiscal 2025. Adjusted operating income increased 35.9% on a constant currency basis, driven by strong gross profit performance in both pharmacy and retail in the U.S. and a continued rebound in international sales and profitability. GAAP EPS decreased 4.1% to $1.02, reflecting a charge to the company's equity investments related to the impairment of minority investments as well as lapping a $191 million gain from the partial sale of our investment in Option Care Health in the year-ago quarter. Adjusted operating income increased 42% on a constant currency basis, reflecting strong adjusted gross profit growth across pharmacy and retail in the U.S. and the continued rebound in international segment sales and profitability. GAAP EPS increased by $4.54 to $5.15, reflecting a $2.5 billion after-tax gain in the first quarter related to the valuation of our prior investments in VillageMD and Shields as well as lapping a $1.2 billion charge, net of tax, from the company's equity earnings in AmerisourceBergen in the year-ago period. Sales increased 1.2% in the quarter, with a strong performance from Walgreens more than offsetting a 680 basis points headwind from a 43% sales decline in the AllianceRx specialty business. Adjusted operating income was $226 million in the quarter, up 60% versus prior year, led by sales growth and tight cost control. Stronger demand for services contributed to the increase with sales up almost 75% year-on-year, benefiting from COVID-19 testing and vaccinations as well as new online health care services. Strong growth in operating income was offset by the working capital impact of a decline in the AllianceRx Walgreens business, the year-over-year impact of COVID-19-related government support and increased capital expenditures behind key growth initiatives, including the rollout of new automated micro fulfillment centers, the VillageMD footprint expansion and continued omnichannel and digital investments. And I think it shouldn't really come as a surprise to most of you on the phone, if you've done the math on vaccinations and the contribution last year, what we're facing in the second half of the year is we're lapping vaccinations, and our best estimate of that is around the 20% headwind in the second half. Just look at the pro forma sales growth that we're seeing on the 2 businesses, VillageMD growing 145% and Shields which is actually among mature business even and VillageMD growing at 63%."
}