{
    "symbol": "WBA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-06 13:53:07",
    "content": "  Operator: Good morning and welcome to the Walgreens Boots Alliance, Inc. First Quarter 2022 Earnings Conference Call. After the speakers’ remarks, there will be a question-and-answer session. I’m Tiffany Kanaga, Vice President of Global Investor Relations. Joining me on today’s call are Roz Brewer, our Chief Executive Officer; and James Kehoe, our Chief Financial Officer. And adjusted EPS grew 53%, well ahead of our expectation. I am very proud of the continued success of our core businesses, with strong growth in U.S. retail and robust recovery in our international markets. As a reminder, building a high performance culture and winning team is one of our four key strategic priorities and is foundational to the other three: first, transform and align the core; second, build our next growth engine with consumer-centric healthcare solutions; and third, focus for portfolio and optimize capital allocation. Absent these incremental investments, our revised adjusted EPS guidance for fiscal ‘22 would have been 3% to 5% growth. You may recall that our original guidance already included a 4 percentage-point headwind from investments to build out our healthcare growth engine, investments that we strongly believe will position the Company for attractive low-teens earnings growth over the long-term. I want to take a moment to discuss our role in the fight against the pandemic, which demonstrates Walgreens’ leadership in promoting the health of the consumers who live in our community. In the U.S., we administered 15.6 million COVID-19 vaccinations within the quarter. We recognize their dedication to supporting our patients, our customers, and our community as we continue to help lead the nation’s efforts in combating the pandemic. Nearly one year after we began our vaccination program with one COVID shot at a long-term care facility in Columbus, Ohio, we reached an important milestone for Walgreens at the end of the first quarter, 50 million COVID vaccinations administered to members of our communities. As of November, we started administering COVID vaccinations to children, ages 5 to 11, in thousands of stores across the U.S., just in time as many families prepare to travel and gather for the holidays and variants continue to emerge. Our testing and diagnostics business has also accelerated, with over 22.9 million COVID tests completed to-date. Our execution in vaccines and testing, our outperformance in first quarter and our healthcare investments are clear steps towards fulfilling our vision to be the leading partner in re-imagining local healthcare and wellbeing for all. First, we are transforming and aligning the core business and building a pharmacy of the future that will enable and support our healthcare strategy. Digital sales were up 88% in the U.S., driven by 3.6 million same day pickup orders. And importantly, average order value is about $30 online versus $20 in stores, expanding our overall basket size as the digital channel continues to mature. We’ve enrolled over 92 million MyWalgreens members, up 7.2 million since the fourth quarter. Second, we’re building a platform of consumer-centric healthcare solutions, which we expect to fuel our next phase of growth. We’re forging ahead in healthcare with Dr. Sashi Moodley, as our Chief Clinical Officer; and Ramita Tandon as our Chief Clinical Trials Officer drawing on their experiences in care delivery and clinical solution while at Anthem, Icon and CareMore. With that, I’ll hand it over to James to provide more color on our results and our outlook. Adjusted EPS was $1.68, well ahead of expectations and up 53% versus prior year on a constant currency basis. We executed strongly in COVID vaccinations and testing, U.S. retail accounts for the highest in 20 years, and the international markets continued to recover nicely. First quarter sales advanced 7.6% on a constant currency basis, reflecting strong comp growth in Walgreens and the international segment. Adjusted operating income increased 48.5% on a constant currency basis, driven by strong gross profit performance in both pharmacy and retail in the U.S. and the continued rebound in international sales and profitability. Adjusted EPS was $1.68 in the quarter, a constant currency increase of 53%, driven almost entirely by adjusted operating income. GAAP EPS increased by $4.58 to $4.13, reflecting a $2.5 billion after tax gain in the current quarter related to the valuation of our prior investments in VillageMD and Shields, as well as a $1.2 billion charge net of tax from the company’s equity earnings in AmerisourceBergen in the year ago quarter. Now, let’s move to the U.S. segment. Adjusted SG&A spend increased 4.2% in the quarter to 17.2% of sales, 20 basis points higher than last year. The year-on-year increase was primarily due to investments relating to vaccinations and labor, partly offset by savings from the transformational cost management program, and some phasing benefits. Now, let’s look in more detail at U.S. pharmacy. Pharmacy sales grew 1.1%, including the negative impact from AllianceRx Walgreens Prime. Comparable pharmacy sales were up 6.8%, while comp scripts increased 6.2% with vaccinations accounting for 535 basis points of the script growth. We saw broad growth across all categories, led by 24.7% growth in health and wellness, driven by at-home COVID-19 tests and cough, cold, flu. Turning next to the international segment, and as always, I’ll talk to constant currency numbers. Sales increased 34.2% in the quarter, including the 25.6 percentage points up lift from the formation of our wholesale joint venture in Germany. We are lapping the formation of the Germany JV on November 1, 2020 with the prior quarter including only one month of sales. Excluding this impact, sales were up 8.6% reflecting the ongoing recovery and strong execution across most international markets, particularly in the UK where sales advanced 13.4%. Adjusted operating income was $164 million in the quarter, up 89% versus prior year, led by higher sales and tight cost control. Stronger demand for services contributed to the increase with sales up more than 200% year-on-year, benefiting from COVID-19 testing. Flu vaccinations were also up, and we recorded our largest ever season with 2 million vaccinations during the first quarter, up 150% compared to last year. Comparable retail sales increased c%, reflecting a recovery in footfall and strong commercial execution. Despite these strong results, footfall in the quarter remains around 20% below pre-COVID levels with particular challenges in travel locations. We do however see continued strength in basket size, which was up around 12% in the first quarter, compared to pre-COVID levels. Reflecting six days of ownership, VillageMD had sales of $26 million and an adjusted operating loss of $3 million. As we scale our access to lives and partnerships, we will continue to build out our Walgreens Health Corners with a goal of more than 100 by the end of 2022, with 47 already up and running. We continue to expand the VillageMD footprint, and we’ll be in expansion mode for the foreseeable future. On a pro forma basis, they delivered strong sales growth in their most recent quarter with VillageMD advancing 182% and Shields growing 62%. We generated $645 million of free cash flow in the first quarter, $118 million below prior year. Strong growth in operating income was more than offset by the phasing of working capital, prior year one time benefits associated with the passing of the CARES Act and increased capital expenditures behind the key growth initiatives. We now expect higher growth from our base business, reflecting a strong first quarter and higher levels of vaccinations and testing. We expect 30 million vaccinations this year, 5 million higher than our previous guidance. Our Walgreens Health segment is tracking well against its key milestones with both, the Shields and VillageMD transactions closing in the first quarter and the Walgreens Health organic business continuing to invest in future growth. Within this guidance, we’ve reflected our decision to increase investments in our team members by an incremental $120 million. As highlighted earlier by Roz, without this investment, our full year adjusted EPS growth would have been 3% to 5%. As mentioned, we’re planning for higher vaccinations in the fiscal year. Additionally, our U.S. retail comps were very strong in the first quarter, and we have seen this momentum continue into the second quarter. In summary, we are raising our adjusted EPS guidance to low-single-digit growth, driven largely by our U.S. segment. Sales in the U.S. are now expected to be around 2 percentage points higher than previous guidance, driven by strength in both, pharmacy and front of store. Sales projections for international have also improved to 9% to 11% growth, mainly due to improved market growth for our German wholesale business. Finally, we expect an adjusted tax rate of around 16%, consistent with prior guidance. To summarize, we are executing with a very strong start to the year and an increased fiscal 2022 outlook. WBA’s transformation is underway, and I am pleased with our rapid progress along our strategic priorities. Now, I’d like to open the line for questions. Thanks very much, and good morning. And if you don’t mind, I might have a follow-up. Let me start out first by asking James to give a little bit of color on your second question, and then we’ll go into the AllianceRx after that. So, we’ve taken the stake from 55% to 100%. As you plot out to adjusted operating income, there’ll be no change because we already consolidate a 100%, and then you have the below the line adjustment for the minority interest of 45%. So, you will recall that when we gave guidance at the beginning of the year, it was a material driver within the U.S. business. And honestly, we see -- we’re formulating the new specialty strategy in the business. We see -- now that we have the Shields assets combined with our specialty pharmacies combined with the AllianceRx Walgreens Prime business, we do believe we can formulate an integrated specialty business. Looking at our guidance, it has a slight negative impact because if we were declining a $100 million in income year-on-year, we will now be declining 100% of that income on a net income basis, as opposed to 55%. But honestly, this is a couple of cents on the full-year, so I wouldn’t even worry about it in the context of guidance. But I do want to reiterate, I think you’ll see us maybe in the next six months come out with a more energized specialty strategy, which will be more integrated in how we surround potential partners with a series of integrated services. So, we’re pretty excited by this. We’re still significant partners of theirs in retail, and we will continue to offer specialty services to them on an ongoing basis as they require. We do $20 billion-plus of specialty, and we’re excited to bring these assets fully back into the portfolio, as James described. Thanks very much, and good morning. Just I want to understand, in the guidance when you talked about higher vaccinations, this quarter was higher than we had anticipated. Obviously, we now have boosters for even 12 plus in the U.S. Can you talk about your expectation for vaccination as well as testing in the updated guidance? Do you think that longer term, you can do some kind of whether it’s shared savings program or other types of programs, because getting an incremental script is great, but we’re where - the opportunity is, right, is to lower the overall cost and potentially sharing those savings. So, we’ve increased the estimate from 25 million to 30 million, and especially as a result of high levels of activity in the first quarter. And two, but specifically on that we increased 5 million that’s worth about $0.09. And then testing, we had a fairly large opportunity as well, because actually the biggest driver in the first quarter is actually probably testing as opposed to vaccines. And that’s probably in the range of 12 to 15 kind of cents, just on the full year. So, $0.09 on vaccines and testing is call it $0.12 to $0.15, so quite a sizeable contribution to the full year. So, I can’t be much more specific than that from memory, but it’s kind of our base assumptions. So, Lisa, let me talk a little bit about how we’re thinking about our growth in Walgreens Health and how that really leverages our core business, and Walgreens managed by John Standley. So, here’s a way to think about this. So, the way to think about this is the number of VillageMD units that we plan to bring together, when we think about this investment of $5.2 billion, we’ll be opening at least 600 of those village medical clinics within our entity and then adding the Health Corners. I think about a customer coming into VillageMD and actually understanding more about their healthcare needs, it will help them understand the spending. And then, I think about the work that can happen between optimizing for that patient, between understanding what the pharmacist is applying to that customer or patient’s healthcare needs, and to get that repeatability and also giving the customer or patient the opportunity to come into one of our units and utilize the Health Corner. And so just managing their care over time, for instance, looking at their A1C levels and things like that over a period of time will hopefully bring their cost of care down and keep them out of the healthcare system and returning to emergency rooms and hospital settings. And so, we’ve not really articulated a clear view on profitability going forward. And if there’s something beyond testing that’s really strong, can you comment on that as well on the U.S. front end sales? If you take the growth on front of store, which was -- the 10.6% was the highest in 20 years. I think it’s a little over $200 million of revenue in the quarter, and I think it’s around $0.06. So, it’s not a massively profitable sector. I think, I’ll just comment, James. We saw really strong performance in OTC, beauty, personal care, all very strong categories, good success with our mass personalization efforts and a little bit of halo from the vaccine and testing. First, I’d like to welcome Tiffany aboard. I mean, I think the -- I would just say on Rx, I think we saw script count growth above and beyond what we saw in vaccinations, but we think there’s more opportunity for us there just looking broadly at the marketplace. We are, as James and Roz talked about making significant investments in the business, both from a staffing perspective as well as with project nucleus and other capabilities we’re putting into to really drive that pharmacy experience in store. So, I think we still see a ton of upside and growth opportunity just in the base pharmacy business, just to grow our market share and to push that forward. That being said, there is a fairly strong connectivity between the scripts and the amount of vaccinations and testing done in the quarter, because the pharmacists are doing both jobs and there is been high level investments. So, I think what has happened a little bit is because of staffing shortages, we’ve had to reduce operating hours in some locations. I just wanted to follow-up maybe on A.J.’s question, when you were talking about at-home testing contribution of the quarter that was super helpful. So, I think it’s a couple of months away. So, I think what we’ve superbly executed against is supply chain fulfillment and partnerships with suppliers. Right now, we’re a little spotty in places on availability. We’re at about 70%, but we clearly sold the majority of the at-home test in the channel. So, it’s been a huge success. So, the 200 million didn’t come just magically. So, we’ve I would say executed on this one and that’s why we have such a big contribution in the first quarter. So, we’re feeling in a pretty good place in the next three months. I was wondering if you had any sort of data from the quarter, sort of co-located location in terms of increase in sales in the Walgreens, either finance or pharmacy or any other data you could point to us from that perspective. We’ve got, I think 81 clinics open. I think as you look forward on village -- sorry, if you look forward on our segment, one thing I’d ask you to have in mind is, the revenue is pretty small in the quarter, because we’re just closing the acquisitions. A good way to think about these acquisitions is both -- if CareCentrix closes at the beginning of the third quarter, we essentially will be doing a little over a $1 billion a quarter in terms of revenue in the segment. So, if you think about Q4 and you do a simplistic run rate, by the time we finish Q4, we’ll have a run rate of about $4 billion, probably north of $4 billion in terms of call it 12 months run rate on the segment. That’s the only kind of new insight we would give, because a little bit -- analysts' models are a little bit all over the place in terms of expectations. So, I don’t think you’re going to see stability on revenue as we get into Q3. But once that’s closed, you’re looking at $1 billion a quarter for the remainder of the year. I apologize, I keep coming back to this, but I just want to make sure I understand a lot of the moving pieces on guidance, in particular how it factors into the multi-year growth that you outlined at the Investor Day back in October. It seems to me, James, that if I’m looking at the pluses and minuses that you outlined, which are quite helpful, especially with some of the dynamics around the testing benefit that you’re seeing, that the pluses more than offset the minuses relative to the magnitude of the EPS guidance, maybe I would have expected a bit more. I’m not sure we want to start getting into next year, but I would say that -- let’s talk about shrink for a minute because you could actually argue that shrink is somewhat correlated with COVID in terms of it is something that has started to tick up post COVID. So, what are -- I’m not trying to get a direct correlation with it, but I’ll give you a number. So, we don’t anticipate that that will continue longer terms. So there -- as you said, there’s many puts and takes in both directions. And honestly, I think Congress needs to step up a little bit here because the magnitude of the problem is -- it’s enormous. We’ve had, I don’t know, 10 years where shrink is at -- and I’m not going to -- it sounds precise. It’s a little over 2% of shrink, 2.25%. We estimate that shrink is about 40% to 50% higher on a percentage basis than it was prior to -- sorry, prior to ’19 -- sorry, prior to ‘20. So, this is over the last two years, we’re absorbing a 52% increase in shrink and it’s organized crime. And it’s a real issue for -- as with all of our peers, it’s a real issue. We have some -- we’ll have minor ups and downs quarter-to-quarter, but generally we’re offsetting inflation, might be $0.03 negative on the full year. So, we’re not talking about big numbers. And maybe I’ll ask John to step -- come in a bit, because we have an intention to build a diagnostics business longer term, and that will provide partial offset as we get into next year. I mean, I think, where we’ve gone with diagnostic testing now, just with COVID testing in over 7,000 stores, we’ve got some good green shoots in A1C testing that are underway right now. It’s very early stages, but I think that’s a big opportunity for us. So, I think that’s one example of some of the changes to our business, so come out of COVID as we move forward that are big opportunities for us. And as we are all involved in this uncertain labor market, we’re not quite sure how much more investment we’ll need to apply there. But what we’ve done so far, applying it very directly against regaining our script business, which could turn the numbers around in that area. And also as the potential for a fourth dose to come online, we’re managing through that. So, we’re working with our partners that are in the online business pretty heavy to make sure that we can monitor this situation. So, it’s that level of certainty and the enormity of some of these issues that is there more to be had here. But, it’s the uncertainty piece that we’re managing, Mike, if that’s helpful. So, just a quick question on the quarterly cadence of earnings in the remainder of fiscal ’22. The adjusted operating profit for the company has always been up sequentially in fiscal 2Q versus fiscal 1Q in each fiscal year, historically. I’m not sure on the sequential side, I honestly don’t have it in front of me. Obviously, there’s a lot up in the air in terms of how much of the vaccinations were shifted from Q2 into Q1. We had a very strong -- strangely, we had a very strong flu season in the UK, which was up 150%. I think the exact number is why we were -- I think it was an 80 basis-point headwind on vaccinations, something like that. When you look at the script numbers, the first quarter was 80 basis points negative due to a weaker flu season. And if there’s any other numbers, James will close out the question. And obviously, Shields gives us a whole another approach here as well, as you look at the 340B space, but it’s also an important part of our specialty business, and again, just making sure that we can get patients access to the medications that they should have. So, I think as far as what we can see in exposure so far, that’s reflected in the guidance that we’ve given. I would just summarize, it’s not material year-on-year. And then year-on-year, I’d call it kind of neutral. I guess, we’re all trained that 20 years of thinking that the CDM has just locked up the specialty market. So, I think what’s important about us is access. So, between what we have in community pharmacy today, what we have in hospital pharmacies, what we dispense in our retail pharmacies and what we have today through our central, so we bring I think a great network of access to the marketplace with really strong clinical capabilities. They’re important partners to us, as well as direct contracting. So, I think there’s a space force in this market. So, we’re working with industry groups in various states to really try and make sure that any kind of performance really, the fees are fair and equitable, which many DIR fees today just aren’t, the way they’re designed. And so that’s really, I think the key component of it, from a regulatory perspective. I think the impact of it -- we would just have to see, one, specifically what the regulation is. But clearly, some of these fees just don’t make any sense. It’s still early days, but it’s clear that we are creating sustainable values for our shareholders, and we’re off to a strong start for the fiscal year. Raising our full year adjusted EPS guidance is important for us, as you continue to track us and, see the road that we’re on, to really try and achieve these attractive low-teens earnings growth over the long term."
}