{
    "symbol": "DOCN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 20:57:06",
    "content": " As we mentioned in May, in Q1 we exceeded our plan nicely, and we're pleased to see that trend continue in the second quarter with average ARPU and Q2 deals just below $20,000, which is up approximately 50% year-over-year. Using Q1 2022 non-GAAP sales and marketing expense of $15.7 million and net new ARR in Q2 of $20.5 million combined with improving gross margins to 65% of revenue, we are paying back our customer acquisition costs in less than six months. I mean, this is a very uncertain outlook in terms of Blockchain, which in Q2 represented about 5% of revenue that vertical is under extreme pressure as you know and so you got this dynamic where you have tailwinds of net new customer attracted to the platform working well, new product with serverless working well, pricing working well, and being offset by weakness in the macro principally in Europe and in Asia, a lot of that is Blockchain. That's exactly what we did in Q2 and hit those expectations, and at the same time what we can control is what money we spend, and we are managing that very aggressively to prioritize incremental spend if there is any on the highest and best uses that will drive sustainable growth or drive efficiency on the platform so that we can deliver against margins and free cash flow. Yes, I think that we have â\u0080\u0093 as I mentioned, we have incredibly efficient payback on our customers pay from the build â\u0080\u0093 as we just referenced in how we acquire those learners, the vast majority of our logos, and also the leverage we see from our sales motions, principally our inside sales motion, our partner motions, where we're able to sign up a customer and a substantially higher orders of magnitude, higher ARPU 20,000 last quarter versus the average for the company. One, I think we see more blockchain in Europe and Asia, two I do think and I made a point of making this in the remarks, we charge U.S. dollars and but obviously our â\u0080\u0093 for all of our customers and obviously with the strengthening of the dollar, even though we can't tie directly to some of the macro headwinds we're seeing in terms of our revenue impact we have to believe that the 20-ish percent increase in the value of the dollar relative to other currencies over the first half of the year have to have some impact on our customers' businesses. And I put pricing in quotes, because our $50 and up customers, which are now 85% of our total revenue that's up meaningfully from just a couple years ago."
}