{
    "symbol": "DOCN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 11:34:04",
    "content": " As a result of the strong revenue growth, improving margins and leverage on capital, free cash flow increased 217% year-over-year to $78 million or 13% margins, a 700 basis point improvement from 2021 and a major step towards our longer term margin target. Since our 2021 IPO, we shared targets of delivering $1 billion in revenue and 20% plus free cash flow margins in 2024. While growth was 30% or better, we were comfortable ramping to a 20% or better free cash flow margin target over a number of years. Importantly, revenue from $50 per month customers grew 39% last year despite the overall economic weakness. As a result, there are 321% more builders today, generating 320% more revenue and 423% more scalers today, generating 472% more revenue despite our learner pool, having only 140% of the customers and 181% of the revenue it had 5 years ago. Free cash flow in 2022 was $78 million, which was 13% of revenue, a 217% increase from the prior year. In light of this growth profile, we are taking immediate actions that will both boost our margins in 2023 and position us to generate annual free cash flow margins of 30% plus in the coming years. In 2023, free cash flow will increase as a result of our improved profit margin and lower capital expenditures, driving 21% to 22% free cash flow margin for the full year excluding the onetime costs associated with our workforce reduction and transaction costs. Your line is open. And frankly, if you look at how we looked at the view of growing north of 30% through 2024 to get to that first $1 billion and ramping the free cash flow margin versus our current outlook with the acceleration of margins, weâ\u0080\u0099re actually going to generate more free cash flow in the next couple of years that we would have under a higher growth scenario. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. If you think about â\u0080\u0093 if we take a step back, what does it mean for Matt to say we will exit this year at 30% free cash flow margins, just â\u0080\u0093 it was just 3 years ago, we had negative 25% free cash flow margin. Your line is open."
}