{
    "symbol": "SIEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:55:05",
    "content": " As a matter of fact, second quarter '22 revenues were approximately 92% higher than Q2 of 2019 prior to the pandemic, with our advanced technology, industry-leading safety profile and innovative partnership programs with our plastic surgery customers, we have been able to dramatically outperform the market and continue to grow our market share. Year-to-date 2022 non-GAAP operating expense of $47.1 million compares to $35 million for 2021 and again, is attributed to current year investment and commercial activities to support new product launches and the shift in accounting treatment of our information systems expense. Going forward, we expect to see continued strong performance in the low 60s as we get into 2023 with the launch of fat grafting, we expect fat grafting, especially performing in the recon space to perform at 70% plus gross margins similar to our tissue expander, BIO-C, et cetera. And as we said before, our magic number to get the cash flow neutral, cash flow breakeven plus is $135 million revenues, and how we're going to get there, it's not just going to be our current product offering. And we will continue to add new products, as we've talked to in terms of product launches this year and other products we can bring in, similar to a BIOCORNEUM product that's performing between $5 million and $10 million in terms of annual revenue at 70% gross margins, which is actually a distribution product. As Andy stated, next year with fat grafting, and that's where we upgraded and expanded our sales and marketing team this year, and it was in preparation not just for the launch of our Low Plus Profile Plus one more tissue expander and Dermaspan, six-tab is really also getting ready for next year. We have an incredible opportunity for Sientra for the next six to 12 months from leveraging our higher margin, higher opportunity for reconstruction to the launch of products next year on two critical products that will really take Sientra in a different area from expanding use within the OR with fat grafting and obviously, with AlloX2 Pro really improving patient care and patient outcomes next year."
}