{
    "symbol": "SIEN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 20:08:14",
    "content": " Good afternoon, and welcome to this Sientra third quarter 2022 earnings conference call. On our call today, we have Ron Menezes, Sientra's President and Chief Executive Officer; Andy Schmidt, Sientra's Chief Financial Officer; Lisa Rosas, Sientra's Senior Vice President of Sales and Marketing, and Denise Dajles, Senior Vice President of R&D and regulatory. Has reported earlier today Sientra had Q3 revenues of $22.6 million, which is not only a record quarter, representing 15% year-over-year growth, but also equals one of the highest quarterly revenue performances for the company ever. We are extremely proud of this achievement, as it comes not only in the seasonally the lowest quarter of the year, but also at a time when our competitors have reported declines in the United States breast fat businesses. Not only did we report record revenues for the third quarter of 2022, but we also reported a record low free cash outflow of $3.6 million for the quarter. I have to remind everyone that in our remarks today, we will be including forward-looking statements, both in our prepared remarks and response to any questions you may ask. For more detailed discussion of the company's risks and uncertainties, I would refer you to our SEC filings, including our form 10-K and form 10-Q available on the company's website. With that reminder, I would now like to ask Ron to provide you with his comments on the quarter and where he sees the company heading into 2023 and beyond. Oliver sets the stage perfectly even in the slowest quarter, in-spite of micro economic headwinds, we're reporting on the best quarters ever. I'll strategy is focused on drives the top and bottom line, we see ample market opportunities in both augmentation and reconstruction. In augmentation, will continue to outperform the market. The average of our top tier surges of Sientra's revenue grew by 7% this quarter versus Q3, 2021. In addition, we added 130 new accounts during the same time period. Now looking at reconstruction, we have seen accelerated market penetration. Now top-tier hospital accounts grew by above 10% this quarter, compared to third quarter 2021. I'll ask Lisa to take a few minutes to highlight how we continue to grow and take market share away from our competitors, both augmentation and reconstruction\n As we continue to grow the Sientra brands, we've increased our penetration in both augmentation and reconstruction, knowing we have considerable upside in both segments. The reconstruction segment remains strong and stable, which has enabled us to continue the strategies that are in place earlier this year. And we recently validated that by serving a group of potential patients learning that demand remains strong, with 90% of them, planning to continue forward with surgery in the next 12 months. And we also received approval from Health Canada for our newest implant, a low-tech profile. From the beginning, Sientra has been selective in bringing innovative technologies with meaningful advantages, backed by long term proven safety data, which is crucial for patients, physician and regulatory bodies. Sientra's long-term, solid clinical data, as well as differentiated portfolio has kept us in a position of strength, increasing our market share, as well as expediting global approvals. Our entire team is driven by a shared dedication to make the surgical journey better for women and all our patients can believe that providing products with an unrivaled safety profile and putting them in the best hands, which is that of the board-certified plastic surgeon, we are truly doing something unique in our space. I'm very confident that we will continue the high growth trend while realizing efficiencies, but we recognizing the commercial team success is linked to the overarching corporate goals of both growth and profitability. Dr. Denise Dajles will now share how we are preparing to commercialize our game changing fat transfer technology, which will be unveiled next month at the Beauty True Science Conference in New York City. With the launch of our novel that fat transplant system, we will become a much more diversified company that provides a full line of products for breast surgery and other body aid, enabling us to be the leader in total body transformation. This will expand our time by at least 25% and offer surgeons unique benefits to address unmet needs in the space and obtain safe, natural, predictable and reliable outcomes. I am very happy to share that this year, we've made significant progress in the fat transfer clinical study was over 10 sites actively enrolling patients. As patients reach the six month follow up mark, surgeons are impressed with the consistently high retention they are obtaining with our enhanced viability fat transplant system. We have also been performing cases in other areas beyond the breast, with surgeons using our system for facial fat transfer and even for treating burns. Highlighting our financial successes this quarter, I'll reiterate our record revenue performance of 22.6 months demonstrating strong performance from all sectors reconstruction, augmentation and international. Our Q3,'22, free cash flow of a $3.6 million use of cash is a record low cash burn for the company. Diving into our revenue numbers, the current trades by $2.6 million compared to $19.6 million in Q2'21, an increase of 15%. The gross margin for Q3, '22 was 56.6%, which compares favorably to 54% for the same period last year. Q3'22 gross margins benefited from the continued expansion of the reconstruction businesses, which was balanced by the lower margin augmentation and international sectors. Total GAAP operating expense for Q3,'22 was $25.3 million which prepares to $22.3 million in Q3;'21. Non-GAAP or cash based operating expenses for Q3'22 was $21.7 million compared to $19.2 million for Q3, '21. Our current trade non-GAAP operating expense of $21.7 continues or favorable expense trends this year, comparing to $22.3 million in Q2 '22 and $24.8 million in Q1 '22. Looking forward to 2023, we expect to see continued improvement in non-GAAP operating expense performance as we realize efficiencies but leverage infrastructure, year-to-date '22 GAAP operating expense of $82 million compares to $64.6 million in '21. Total GAAP loss from continuing operations for Q3, '22 was $14.9 million, as compared to a profit of $28.5 million for previous year period. The previous year period includes several significant adjustments, including the fair value of derivative liability adjustment of positive $35.6 million. One, extending the maturity date of our debt to 2026 and beyond; two, reducing our overall interest expense and three, lowering our total debt to $73 million. We also completed secondary equity offering, which resulted in approximately $14 million of additional cash for the company. We believe this provided us with sufficient balance sheet strength and flexibility to continue executing on our growth plans, including the commercial launch of our fat transport technology early next year. Our record Q3 financial results, imminent launch of our novel fat transfer products and our strong balance sheet are inflection points, that sets the stage for a great Q4 22 That will slow sharp into 2023. I was hoping to start actually in the financials there, just to your last point, Andy, around this year and then slingshot in the next year. Yeah, we're not changing our guidance that we had previously, we are confident in that guidance. Again, from continued very good cost performance to this year, we expect good continued cost performance into Q4. And certainly into 2023, we're looking at lower annual numbers we don't have guidance out yet. In terms of market and whatnot, and what we expect to see in 2023. Obviously financially from my perspective, fat grafting is going to be a very big contributor, and Lisa's prepared remarks, she had mentioned that we're going to have the reveal, and essentially now a number of weeks. And then in terms of other market activities, have better experts here and on the phone to answer those questions. But from a modeling perspective, recon is going to continue to build we keep adding accounts. Okay, that's extremely helpful. And then maybe a multi-part here, just what is your take on the FDA AdCom around tissue expanders. With regards to the tissue expanders after the final now it's a period of public consultation, FDA still has to make a decision and give a ruling regards class two or class three classification we at this moment do not foresee an impact on products currently marketed. Even if a class three classification is selected, current products on the market would have the opportunity to submit a PMA which of course, we will be ready to do. And with regards to Pro, it's still under active review with the FDA. With regards to the fat transfer clinical study, during the BTS Conference in December, we will have some of the investigators from our study give their perspective. And then just on aug, you mentioned on the Q2 call that Aug was down about 70% in the quarter. So in terms of the augmentation market, there has been a slowdown, but we have shown that we consistently outgrow the market. And so the Q3 aug revenue for future grew double digits, in fact, 16% versus last year, which is significantly better than the market, which is still below traditional levels. But no matter what the market does, we have and we continue to grow. So what we've seen is over the last three years about a tripling in our market share, we know that this is a durable market that ebbs and flows, but being an important part of our business. We do measure account performance and our top group of performed -- a group of doctors which Ron mentioned earlier, continue to be busy and perform at a very high level. What we would anticipate looking at progress through Q3 and through the end of the year, is augmentation to continue growing, ending the year in the mid-teens with reconstruction in the high-teens. We're a little over 3,000 accounts, dollar account. So does that mean, I know I think that was the same approximately the same amount you had at the end of last quarter. We know some accounts leave, some accounts don't order for a quarter. So we're looking at what has been ordered the left this past quarter, some accounts because of the opposite impact of the market or have less for the great things by adding new accounts, we really much minimize that impact if someone has been a slow quarter and account is a slow quarter. Understood, that's, that's helpful, also. And then just to jump to the I know, you mentioned about the fat study. As you know, the team had mentioned, it's novel. So we're planning a disciplined approach to launch, building momentum and adoption And with this approach among both our core customer base and with new customers. So we're very excited about it, the early feedback from the clinical users has been very positive. So just a last quick -- \n I would just going to comment that the expectation amongst the plastic surgeons based on what they've heard from their peers who are part of the study, it's really, really high. And there are a number of benefits with this technology underneath the Sientra umbrella and that is one of them, that it gives us the opportunity to expand the total product portfolio. Obviously, there's a high level of strategic fit within our organization, subject matter expertise in the breast area, the opportunity to continue growing within our existing customer base and new customers. As we have commented, before, we expect to start the year with fat grafting fat transfer representing at least 5% of revenue and exiting the year at 10% revenue. Our tissue expanders up to 25% of revenue, the fat transfer, looking at the same customer base. We've already got the embedded customers, it can perform the same way it's going to be how fast we ramp. Other great news, we are having a reveal here and the number of weeks, we're already manufacturing. And since we're manufacturing ourselves, we are in complete control of the cost of goods sold, it's going to be north of 70% margin product. But I think the GM for 56 and change on the quarter and sort of a step back from that more normalized 60 and change in 1H, and it seems like gross margins are really going to be a key determinant and eventually turning the corner on cash flow right. So can you help us with gross margins, why to step back and three to '22. And maybe more importantly, how that trajectory looks like going forward. Sure, so again, we'd like to use right now the way we're wired about 60% a good benchmark. And it's going to change quarter-over-quarter and our current quarter, we had actually some very good performance out of international, international, it's more of a distributor model, which is fantastic on cash and contribution margin. Other factor that came into play is we have some fantastic loyalty programs that are very targeted, very pulse programs that come into play in Q3, possibly part of Q4. And if you're tight, what that does is it allows us to actually gain market share that we're pretty darn proud of. We don't see price compression, but we do choose to use, again very targeted marketing programs that are loyalty based, depending on which period we're in. So maybe if you could just parse out the overall growth you're seeing just as you continue to gain share, and that business continues to see acceleration. It's a very stable market, where we've been able to make inroads due to our strong product advantages, that are really designed to help the woman's journey and make it easier. So for us, we did also grow double digits, we continue to see that trend moving forward, as well as market share gains. We've seen over the past two years about a doubling in our market share, we anticipate that moving forward. And as I mentioned earlier, ending in the high-teens, the end of '22, and then moving into the 20s in 2023. And then maybe if I could just ask one for you Andy on operating expense, expectations. So again, it's been a great trend this year in terms of getting our op expense to where we want it, it's based on efficiencies, not cutting into muscle by any means. We are 21.6-21.7 that we saw this quarter is probably the low part will be a little higher than that and Q4 just because of the launch, in terms of the fat grafting launch. And then as we go into '23, however, we have a lot of different efficiencies that are going to come into play to where we expect that to continue to drop. When we do give out guidance, we will get our cash based op expense expectations here in the future. A little bit of a, you know, procedure, we're going to come in lower than that next year. But we really do expect to see some great leverage in 2023 with rising revenues, lower cost, and very good cash performance. Ladies and gentlemen, this concludes today's conference."
}