{
    "symbol": "ENS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-12 15:50:51",
    "content": " Let's start with our largest segment, Energy Systems, which saw modest improvement from the prior quarter, growing revenue by more than $22 million and generating a nearly $4 million gain in operating income versus Q4. On a line of businesses basis, our first quarter net sales in Energy Systems were up 5% to $371 million. On a sequential basis, our first quarter operating earnings dollars declined $3 million from $78 million, while the OE margin dropped 40 basis points to 9.2%, primarily due to Energy Systems’ results, which Dave has addressed. Excluding those charges, our motive power business generated operating earnings of 15.1% or 470 basis points higher than the 10.4% in the first quarter of last year due to easing of pandemic related restrictions and demand coupled with ongoing OpEx restraint. On a sequential basis, Motive Power's first quarter OE decreased 50 basis points from the 15.6% margin posted in the fourth quarter due to higher lead and other input costs. As previously reflected on Slide 13, our first quarter adjusted consolidated operating earnings of $75 million was an increase of $14 million or 23% from the prior year. And just for example, the drag we've had on resins that we've really just kind of gotten behind to be able to unleash the TPPL capacity up to $300 million per quarter run rate and get our Springfield plant too, and its high speed line up to full operational speed, we’ll have great benefits, which we haven't really enjoyed to date. And the other program that we mentioned that we're really excited about and is probably the most immediate of all of them is the California Public Utility Commission's backup for that, which for us is just starting out as $50 million opportunity. And we've already said that there's probably $10 million to $20 million that we leave on the table any quarter from missed revenue, because of these shortages we've been describing."
}