{
    "symbol": "ANGI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 12:14:07",
    "content": " There was also a big impact in that business in the pandemic where we had a significant demand, but and if you're selling ads and leads meaning you're offering to help home â\u0080\u0093 you're offering to help service professionals find new customers in a time when there's a reduction in service professionals because some stop doing business through the pandemic and you have a growth in homeowners looking for work to get done. All these metrics are ones where we've been trying to move them for years and years on the ads and leads business, and when we deliver the right experience and services we know we can't deliver them in aggregate. And we can make real money on that and continue to and have a great customer experience where a homeowner comes to our platform, looks for a service professional who can deliver in those complex services and we help find them a service professional who can deliver in those more complex services, and we're paid on that on a, either on a lead basis or on a fixed annual contract basis from the service professional. So, what that means is, for example, where advertising doesn't work because there's a supply demand imbalance, you can't go to the service professional and say, well, come on our platform and we'll give you all the leads for   or even better we'll pay you to take the leads to make sure the customers get a better experience. Again, 2023 is going to be choppy because we're removing some empty calories and changing a bunch of things in the business, but kind of after 2023, I think double-digit revenue growth is absolutely achievable with expanding margins and there's a lot of leverage to expand margin. Midpoint, as we said, would be flat year-over-year, I think it's fair to assume similar trends for the rest of the year with services on a net basis, but that's with growth in ads and leads and then some declines in aggregate services revenue as we lap having closed down a number of the complex money losing services as the year went on. So, what that results in is, we do expect gross profit to grow mid-single-digits across the overall Angi business this year, really due to â\u0080\u0093 even if total revenue is flat, favorable mix between ads and leads and services. Part of that is driven by cost savings and marketing efficiencies and really the fixed cost leverage that exists in ads and leads, which is such a high gross margin business, but also when you reference this, you can see in the segment reporting that â\u0080\u0093 our new segment reporting, the magnitude of the EBITDA losses in both Services and Roofing in 2022 for different reasons that we've documented well throughout last year. You can imagine us showing that much earlier in the process, not pushing the customers for whom it's relevant through the service request and sending them directly into a services experience and exposing that in the categories where we can deliver those less complex services, the lower average order value services, we can expose that actually more often and get more people to see that product and use that product. If we got it done faster, it was probably too optimistic we could have driven our playbook and activities faster, but bigger share was just getting hit hard by the ad market, but as we grow revenue and particularly as we scale e-commerce and a lot of the high margin e-commerce integrations, which we're seeing being proven out, by Neil and team, all of those combined with revenues will be highly accretive to profitability and we feel as good about the long-term margins there as we have it anymore."
}