{
    "symbol": "ANGI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 14:37:24",
    "content": " Again, Q2, with the focus is, as Joey said, on profitability coming to the forefront, we made some tradeoffs within that business, that for the most part have been very, very positive, where the profitability in that business has -- sorry, the profitability in that businesses led to overall increases in profitability for Angi overall, when you put down and you look at some of the underlying things, we've definitely had some challenges, particularly in Roofing. If we remove Roofing from the services number, we get to a 34% growth rate for the underlying organic growth rate of services, that would obviously tell you that Roofing shrank in July, taking this down growth rate, just to put some more numbers around that we did $15 million, or $14 million, sorry, average in Q2 revenue for Roofing, that's down to about $9 million in July. One of the things that we were cheered by was 10% overall gross profit growth across the Angi portfolio, some of that is due to growth at the higher margin ads and leads business, but it's also a function of the take rate and margin improvements. In terms of looking at the shareholder letter, I think the thing that stuck out was first, on the macro side, your bifurcation of the market between enterprise and consumer trends, maybe flesh that out a little bit in terms of what you're seeing and how you're preparing some of your consumer businesses for what your assumption is about how the consumer spending habits might change in the back part of this year and into â\u0080\u009823. So in terms of the ads and leads business, were obviously a bunch of stuff going on in terms of lapping the rebrand, we've got the Angi brand continuing to be -- continuing to grow pretty aggressively, outperforming I think the expectations that we had, so the consumer demand coming in that brand continues to be strong. Yes, I think with respect to Print, we have always positioned it as we'd like the EBITDA, adjusted EBITDA from Print cover our corporate expense, give or take in any quarter and year with the profitability trends that we're seeing and the strong performance in Print on an adjusted EBITDA basis. And we continue to see positive trends as we've discussed in services where we are past peak profitably -- our past peak investment, we expect profitability to improve in the ads and leads business as we get it, as we get back towards high single digit for mid-single digit growth, as we talked about before, that pretty much drops, that drops rapidly to the bottom line."
}