{
    "symbol": "ATGE",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-06 06:30:02",
    "content": " For the fiscal first quarter, we delivered revenue of $355 million and adjusted earnings per share of $0.88, with adjusted EBITDA margins of 23%, reflecting a 560-basis point improvement over the prior year. Although, enrollments, particularly in post-licensure nursing, were negatively affected by headwinds related to the pandemic, we do expect to see some improvement in year-over-year enrollment trends in the second half of our fiscal year, with the opportunity to grow revenue in a more efficient model and with improved operating leverage. Revenue in the first quarter increased 23% compared with the prior year to $354.6 million, driven by the acquisition of Walden. Consolidated adjusted operating income for the quarter was $65.1 million and adjusted EBITDA was $82.1 million, an increase of 79% and 63% respectively, compared with the prior year due to the addition of Walden and operating efficiencies. Adjusted net income for the quarter was $41 million and adjusted earnings per share, was $0.88 or 151% higher than the prior year. The Chamberlain segment reported first quarter revenue relatively flat, at $135.4 million, when compared with the prior year and adjusted EBITDA of $33.8 million, up 25% from $27 million in the prior year. Total student enrollment during the quarter decreased 4% compared with the prior year, which is primarily attributable to headwinds from the pandemic, particularly in our post-licensure nursing programs leading to fewer new starts. Turning to Walden, revenue in the first quarter was $130.9 million, compared with $68.6 million in the prior year. Total student enrollment decreased 9.2% compared with the prior year, due to pandemic-related headwinds in our post-licensure nursing programs and declines in the management and technology programs which was partially offset by year-over-year improvement in overall student persistence. Revenue in the first quarter increased 4.1% compared with the prior year to $88.3 million, while adjusted EBITDA was $21.9 million or 9% higher than the prior year, primarily driven by the increase in revenue."
}