{
    "symbol": "NWSA",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-04 19:42:04",
    "content": " Despite the successive lock-downs, our Australian business is faring well, showing significant improvement in profitability thanks to cost initiatives and rising digital advertising revenues, and used milestones subscription, which improved to 850,000, up 24% year-over-year. Fiscal 2022, first quarter total revenues, were over $2.5 billion up 18% marked by higher revenue growth across all our key segments, notably at Digital Real Estate Services. Moving on to the results for the individual reporting segments, starting with Digital Real Estate Services, segment revenues were $426 million, an increase of 47% compared to the prior year, on an adjusted basis, revenues increased 29%. Move 's revenues were $180 million, a 30% increase year-over-year, with real estate revenues rising 39% and accounting for 87% of total revenues. Turning to the Subscription Video Services segment, revenues for the quarter were $510 million up 3% versus the prior year benefiting from higher streaming revenues and the modest benefit from positive currency fluctuations, partially offset by lower broadcast and commercial subscription revenues. Moving onto Dow Jones, Dow Jones delivered revenue of $444 million up 15% compared to the prior year with digital revenues accounting for 75% of total revenues this quarter, up 2% points from the prior year. Advertising revenues, which accounted for 20% of revenues this quarter, grew 29% to $90 million, the highest First Quarter growth rate since acquisition. Digital Advertising trends remained robust, up 38% on top of 14% growth in the First Quarter of the prior year an accounted for 61% of total advertising revenues. Dow Jones segment, EBITDA for the quarter rose 32% to $95 million with EBITDA margins improving by almost 3% points to 21%, despite an 11% increase in total cost, which included IBD and higher employee costs. Turning to News Media, revenues for the quarter were $576 million up 18% versus the prior year, benefiting from the continued recovery in the advertising market, strong growth in circulation and subscription revenues, and a $25 million or 5% positive impact from foreign currency fluctuations. Circulation and subscription revenues rose 16%, which included a $30 million or 5% benefit from currency fluctuations, strong digital subscriber growth, incremental revenues from our platform agreements, and cover price increases. Segment EBITDA of $34 million increased $56 million compared to the prior year, reflecting higher revenues, cost savings at News U.K. and News Corp Australia, and a modest positive contribution from the New York Post."
}