{
    "symbol": "NWSA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-08 21:06:04",
    "content": " And as noted earlier, for the year, segment EBITDA was $433 million, up 30%, while revenues rose to over $2 billion, an 18% increase. At Digital Real Estate Services, revenues for the full year surged 25% to more than $1.7 billion, while segment EBITDA grew 12% to $574 million as we continue to build brands and products for future success. In fiscal 2022, revenues were up 10%, and the segment delivered $217 million of segment EBITDA, expanding 317% year-over-year. News Corp Australia under Michael Miller and his team increased its profit contribution by $109 million, its highest since separation, as digital subscribers to News Corp Australia properties rose by 12% to $964,000, and advertising revenues remain robust. Total segment EBITDA was $315 million, up 50% versus the prior year, primarily due to higher overall revenues and lower costs in the Other segment, partially offset by higher costs from recent acquisitions and the negative impact from foreign currency fluctuations. Segment revenues were $443 million, an increase of 7%, compared to 74% revenue growth in the prior year. The results include a negative impact of $22 million from a valuation adjustment of future trail commissions at REA's financial services business and a negative impact of $20 million or 5% from foreign currency fluctuations, partially offset by the $21 million contribution from Mortgage Choice and the benefit from the extra week, which added $14 million to Move's revenues. Move's revenues were $193 million, up 4% following 68% growth in the prior year. REA had another strong quarter, with revenues rising 10% year-on-year on a reported basis to $250 million as growth in residential depth revenues and the contribution from the Mortgage Choice acquisition more than offset the negative impacts from currency fluctuations and the revaluation of trail commissions. Revenues for the quarter were $524 million, sequentially higher than the third quarter and down approximately 3% compared to the prior year on a reported basis due to foreign currency headwinds. Dow Jones continued its strong performance in the fourth quarter with revenues of $565 million, up 26% compared to the prior year, with digital revenues accounting for 76% of total revenues this quarter, up 4 percentage points from last year. Professional information business revenues rose 47% and accounted for 32% of segment revenues, driven by recent acquisitions and growth across all product lines, partly due to $14 million of additional revenues from the extra week. Revenues were $629 million, up 6% versus the prior year and included $53 million or 9% of negative impact due to currency headwinds, but more than offset the additional $36 million from the extra week. Circulation and subscription revenues rose 3%, including double-digit digital subscriber growth across News Australia and the Times and Sunday Times Currency headwinds had a $26 million or 9% negative impact, which more than offset the $19 million benefit from the extra week. Advertising revenues increased 8% compared to the prior year, with strength in digital across all our key mastheads, most notably at The Sun, where digital exceeded print advertising for the third consecutive quarter, benefiting from significantly higher yields and its successful launch in the U.S. Currency negatively impacted advertising revenues by $21 million or 9%, partially offset by the additional $15 million from the extra week."
}