{
    "symbol": "NWSA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-03 19:53:10",
    "content": " Revenues for the quarter exceeded $2.7 billion, a 13% increase year-over-year, while profitability rose 18% to $586 million and net income reached $262 million. In the first half of this fiscal year, News Corp amassed nearly $1 billion of total segment EBITDA, a 30% surge while reported net income was $529 million compared to $308 million in the previous year. Fiscal 2022 second quarter total revenues were over $2.7 billion, up 13%, reflecting strong revenue growth across the company with our three-core pillars, Digital Real Estate Services, Dow Jones and Book Publishing growing 19%. Move's revenues were $169 million or up 9% year-over-year off the back of 28% revenue growth in the prior year, primarily driven by the historically high lead volumes, which rose over 30% last year. REA had another outstanding quarter with revenues rising 56% year-on-year on a reported basis to $287 million, which includes the $41 million contribution from the Mortgage Choice acquisition and $10 million from REA India. Revenues for the quarter were $498 million, down approximately 3% on both a reported and adjusted basis and relatively stable from the prior quarter, as the declines in Foxtel residential broadcast revenue and continued COVID impacts on commercial venues were partially offset by strong growth in streaming revenues, which now account for 19% of circulation and subscription revenues. Total closing paid subscribers across the Foxtel Group reached over 3.9 million at quarter end, up 19% year-over-year, improving from the prior quarter rate by 2 percentage points. Dow Jones continued its strong performance in the quarter with revenues of $508 million, up 14% compared to the prior year, with digital revenues accounting for 72% of total revenues this quarter, up 2 percentage points from last year. Advertising revenues, which accounted for 28% of revenues this quarter grew 23% to $141 million, the highest quarterly advertising revenue in the last five years. Digital advertising revenues remained robust, up 18% on top of 29% growth in the second quarter of the prior year and accounted for 56% of total advertising revenues. Dow Jones segment EBITDA for the quarter rose 32% to $144 million despite the 43% growth last year, with EBITDA margins expanding by almost four percentage points to over 28%. The momentum in this segment continued during the quarter, revenues were $638 million, up 11% versus the prior year. Segment EBITDA of $111 million increased $45 million or 68% compared to the prior year, reflecting the higher revenues. Jess, we will take our next question, please. Jess, we will take our next question, please. Jess, we will take our next question, please. Jess, we will take our next question, please. Jess, we will take our next question, please."
}