{
    "symbol": "UCBI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-18 13:58:07",
    "content": " Specifically, we set aside a $19.8 million provision and took the allowance for credit losses to 1.18% of loans from 1.12% last quarter, and from 97 basis points a year ago. With that, I would expect because we're a little higher than usual this quarter, instead of being a million dollars higher next quarter, maybe it's $800,000 higher next quarter. The bigger question you're asking probably is the run rate of expenses, and again off a slightly lower base, than Q4, I think it's a 4%, 4.5% growth rate, given the inflation rates that we're seeing, again the last fee cost savings coming from Progress. If Moody's expectation of the scenario is accurate, then I think absent changes in loan growth and asset mix and charge-offs that, it would feel like, I would expect the scenarios to be stable, but this quarter, they were catching up a little bit. So would you be able to just kind of because, I think their expense run rate was somewhere around $13.5 million a quarter, I just want to see if you could, if you could verify that, and then kind of what would be kind of a core number without that, that base just to kind of begin to forecast off of again, I know, it's hard, because there's a lot of moving pieces and systems conversions coming up in the second quarter, et cetera. We have been running in the low 80s for very long time, pre-COVID, where we felt comfortable, we feel comfortable moving that higher into the mid-80s, you're going to see some movement at the loan-to-deposit ratio next quarter, Progress coming in, takes you to 79 on its own, so wouldn't see -- I wouldn't be surprised to see a tick a little higher from there. So what we're seeing is that the higher interest rates, and the stress testing is just requiring on the front end, certainly requiring stronger capital, I don't think we've done a deal in the last 90 days that didn't start with 50% or 45% equity number in it and 50% to 55% loan to cost."
}