{
    "symbol": "NATI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 22:40:19",
    "content": "  Our discussion today will include forward-looking statements, including without limitation, those regarding revenue, earnings, gross margins, operating expenses, capital allocation, targets and future business outlook and guidance, including expected demand for our products, supply chain constraints, backlog, impact of the war in Europe, COVID-19 and related shutdowns in our software licensing model transition, successful integration of the acquisitions and future results of acquired companies, execution on our strategy and achievement of our financial targets. Karen will then discuss overall financial performance in the first quarter as well as provide guidance for Q2, and I’ll come back to provide an update to our long-term model that focuses on revenue growth outpacing the test and measurement market and a commitment to a steady and sustained increase in operating margins. A shortfall in delivery of specific components from one of our key suppliers limited our ability to offset these headwinds, despite the unplanned top line challenges, we delivered record revenue for our first quarter with 15% growth year-over-year and 28% growth in non-GAAP earnings per share. The strong demand, double-digit revenue growth and strong earnings growth in Q1 was a continuation of our strengthening performance over the past 5 quarters, so I’d like to spend a moment to explain why we believe our business is strong and resilient and why we believe the momentum will continue. Semiconductor and electronics had record revenue for Q1 at $103 million, up 4% year-over-year, with orders up 38% year-over-year. Transportation had record revenue for Q1, both organically and all in, at $63 million, up 32% year-over-year. And our portfolio business, which represents the majority of our broad-based customers, achieved record revenue for a first quarter of $127 million, up 13% year-over-year, with orders up 16% year-over-year. Q1 GAAP revenue was a Q1 record at $385 million, up 15% year-over-year and better than historic seasonality. In Q1, we generated $31 million of GAAP operating income and $66 million of non-GAAP operating income, a record for our first quarter, translating into non-GAAP operating margin of 17% for the quarter, the highest operating margin for our first quarter in more than 10 years. While we expect our software transition to subscription-based licenses to increase our recurring revenue and cash flow over time, we do expect approximately $30 million of negative impact to our sales and operating profits during 2022, and we’ve built that into our guidance. We reported record Q1 non-GAAP net income of $54 million and record diluted non-GAAP earnings per share of $0.41, an increase of 28% year-over-year. Now shifting to guidance for Q2, our demand outlook remains strong for the second quarter, with over 20% order growth to date here in the second quarter, but we expect the Q1 revenue headwind to continue into Q2 as our ability to procure all necessary components remains constrained. At the midpoint, this represents 12% revenue growth year-over-year and includes approximately $4 million to $6 million for the Kratzer acquisition. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And then just thinking about the full range of the revenue outlook, that 12% to 18%, we kind of just – if we strip out the acquisitions from your growth, looking at organic growth, are you expecting more of that growth to be driven by your pricing or maybe your unit volume, or any color there would be appreciated. And as Eric mentioned, if we go out of the year at the low end of the revenue, lower at the 12% or so, we would be potentially looking at about $100 million to $150 million more sitting in backlog that move into 2023 as revenue for that year."
}