{
    "symbol": "NATI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 19:33:10",
    "content": "  Our discussion today will include forward-looking statements, including, without limitation, those regarding the company's expectations of meeting or exceeding financial targets, its capital allocation, financing and investment plans, the payment of its quarterly dividend and its future business outlook and guidance, including demand for its products, ability to realize revenue from backlog, future results of acquired companies and execution of growth strategy. Our focus on areas where we exhibit competitive strength is exceeding our expectations, and we continue to drive strong momentum in customer demand, delivering record Q2 orders, revenue and non-GAAP earnings per share. Despite these potential macro headwinds, we believe that our intentional focus on higher-growth markets, very strong bookings growth over the last six quarters, record backlog position, growing recurring revenue, and the steps we've taken to manage our expenses give us the ability to achieve significant revenue and earnings growth even in a potential down cycle. Semiconductor & Electronics reported all-time record Q2 revenue up of $116 million, up 17% year-over-year, with orders up 10% year-over-year. Transportation reported record Q2 revenue of $66 million, up 35% year-over-year with orders up 62% year-over-year. Aerospace, defense and government delivered outstanding results with record revenue for Q2 of $100 million, up 15% year-over-year, with orders up 25% year-over-year. On our portfolio business, which serves the majority of our broad-based customers, achieved revenue in Q2 of $113 million, up 2% year-over-year with orders up 6% year-over-year. In fact, even though we are currently planning for a weaker macro entering 2023, we expect to deliver revenue growth on the order of 2022's growth rate, an operating margin well above our previous expectation with approximately a 300 basis point increase over 2022. In Q2, our GAAP revenue was $396 million, up 14% year-over-year and ahead of the midpoint of our guidance. We reported record Q2 non-GAAP net income of $48 million and record diluted non-GAAP earnings per share of $0.36, an increase of 3% year-over-year. Your line is open. I'm just wondering for -- just want to make sure I understand the tailwind impact over the next few years, should I assume that there's that much of a revenue recognition on the software that is pushed out like at $30 million a quarter. Your line is open. Your line is open. Your line is open. Your line is open."
}