{
    "symbol": "TPC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 21:06:11",
    "content": " We bought $997 million of new awards in the first-quarter of 2022, slightly larger than the first-quarter last year. Our new awards so far this year mostly come in the civil and building segments and the most significant first-quarter awards included the $260 million Eagle Mountain Wood fire gas pipeline in British Columbia, Canada, and a $121 of additional work for our mass-transit, California high-speed rail project. Collectively, the 2 factors mentioned negatively impacted the silver segment by $43 million and as a result of Civil segment had a loss from construction operations of $1 million for the first quarter of 2022 compared to income from construction operations of $50 million for the comparable quarter last year. Building segment income from construction operations was $9 million compared to $11 million for the first quarter of 2021, with the reduction primarily due to the segment's lower revenue volume in the current quarter. The Specialty Contractors segment had a loss from construction operations of $4 million in the first quarter of 2022, compared to income from construction operations of $1 million in the same quarter last year. Other income for the first quarter of 2022 was $4 million, compared to nearly zero for the first quarter of '22, excuse me, compared to the first quarter of 2021 with the increase primarily driven by interest earned on federal income tax receivable balances. Income tax benefit for the first quarter of 2022 was $4 million compared to income tax expense, of $7 million for the prior year the first quarter. The lower effective income tax rate for the first quarter of 2022 was primarily due to non-controlling interest making up a higher percentage of earnings for 2022 based on annual projections, as well as share-based compensation adjustments in the current year period. Due to the seasonality of our business, namely weather challenges and some of the markets we serve, our first-quarter operating cash is nearly always a negative as Ron had indicated earlier, last year's first quarter operating cash usage of $47 million was right at the average for the operating cash performance that we typically see in the first quarter. As Ron noted, we generated a first-quarter record operating cash of nearly $121 million this year. Our disappointing EPS was primarily the result of the loss generated by a bad decision that we spoke of previously and it contributed to the biggest part of our loss as well as the difficulty of settling over a $100 million of sub-contractor changes at lower margins that -- where we had to take a large loss in the quarter, what was really a gain in profitability that will return over the next three years of performance."
}