{
    "symbol": "TPC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 20:34:02",
    "content": " On a positive side we continue to generate strong operating cash of $73 million for the quarter, which combined with the record cash we generated during the first six months of the year totals $251 million of positive cash for the first nine months of 2022. Also on the positive side, our backlog remain healthy at $8.4 billion compared to the backlog we had at the end of the third quarter of last year, and does not yet include either the Raritan Bridge or the Maryland Highway, which should add more than $4.5 billion when they are finally awarded. Although disappointed with the various negative impacts to earnings for the quarter and year-to-date, we continue to make significant progress in resolving the various unapproved change orders and claims which have had and will continue to have a positive impact on cash flow this year and next. In addition, there are two other awards pending gaming projects in California, where we have preconstruction agreements collectively valued at $500 million, which we believe will be awarded by the second quarter next year. As Ron mentioned, we generated $73 million of operating cash during the quarter compared to usage of $21 million for the same quarter last year. And over the past 13 years, since the merger prior to this year, our third quarter operating cash flow has averaged approximately $26 million, so a $73 million result, so this year's third quarter was excellent. More importantly, our year-to-date operating cash flow through the first nine months of 2022 was $251 million, nearly double the best operating cash result we have had for the first nine months of any year, and 45% greater than the highest full year operating cash we have generated. We continue to anticipate operating cash generation for the fourth quarter of 2022 as well as strong cash flow next year as a result of projected cash collections both from projects execution activities, and the resolution of various other outstanding disputes. The decrease in operating income compared to the third quarter last year was primarily due to reduced project execution activities at Newark, which impacted all three segments, as well as an unfavorable adjustment of $14.3 million on a completed Civil segment highway project in the Northeast, due to an unexpected reversal on appeal of a previously favorable lower court ruling. We had a small income tax expense of about $0.5 million for the third quarter of 2022, compared to $8.7 million of expense for the prior year third quarter, and the corresponding effective tax rate was 2.4% for the third quarter this year, compared to 24.9% for the comparable quarter of last year. Due to the various factors I mentioned, net loss attributable to Tutor Perini for the third quarter of 2022 was $32 million, or a loss of $0.63 per share, compared to net income attributable to Tutor Perini, a $15 million or $0.30 of earnings per share for the same quarter of last year."
}