{
    "symbol": "LADR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 20:13:05",
    "content": " We are pleased to report that Ladder generated distributable earnings of $38.9 million or $0.31 per share, reflecting an after-tax return on equity of 10.2% for the fourth quarter of 2022. For the full year 2022, Ladder generated distributable earnings of $148.4 million or $1.16 per share, representing a 9.7% after-tax return on equity. 86% of our balance sheet loans are lightly transitional as evidenced by our modest future funding commitments, which are limited to $322 million in total with approximately half of this commitment being contingent upon accretive good news leasing. If you exclude our two largest office loans, both of which Brian will address when he discusses our office investments in more detail shortly, that percentage drops to just 18% with a $25 million average loan size, consistent with the rest of our portfolio. We've seen similar liquidity for our office loans with full and partial loan repayments, including over $200 million in 2022 and an additional $28 million thus far in Q1of 2023. In the fourth quarter, Ladder realized $3.8 million of gains on sale of real estate, including the sale of our largest office asset for gross proceeds of $118 million as securities portfolio ended the year with a balance of $588 million. Additionally, as Pamela mentioned, subsequent to year-end, we received $28 million of proceeds from two office loans that paid off at par. During the fourth quarter, we sold one office complex, one net lease property and one residential holding, which together generated a $39 million GAAP gain to shareholders and produced $3.8 million of gains for distributable earnings. Since we ended 2022 with $609 million in cash and undrawn $324 million revolver and an adjusted debt-to-equity ratio below 2x, we have plenty of earnings power as we make new investments in the quarters ahead in market conditions exhibiting the highest mortgage interest rates in many years. As we started the fourth quarter, our top five office investments by size across our loan and equity portfolios had a combined carrying value of approximately $640 million."
}