{
    "symbol": "VSAT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-25 23:02:05",
    "content": " Your line is open. When we acquired RigNet, the real price here is -- isn't really large growth in oil and gas side, it's really being able to substitute bandwidth, which we really do need the ViaSat-3 satellites for how they were doing business and grow the types of offerings we can make in their market segments. Yes, I think we -- it's kind of like -- it's not really --- what you don't want to do in these markets is go in and replace what they're currently doing with something that's cheaper. Your line is open. There's 30,000 commercial aircraft going to 40,000, we think the commercial air mobility markets is still really, really exciting one going into the general aviation markets right now, kind of the largest jets being able to move down to the mid-tier and even lower jet, that's a really exciting market. The one that's we're just getting into and we're part of some of our investments are going are in land mobile as well and land mobile is -- we can see a lot of similarities to the air mobility markets, a lot of them are driven by people and passengers. I think it's one of the things that we see is really important is serving a broad range of those markets, driving bandwidth consumption, and getting the revenue from that enables us to keep moving down the learning curve on the bandwidth productivity, that's what made this possible so far. Your line is open. I mean, one of the things I think it's really important to keep in mind, we talked about last quarter that we saw these pressures coming Q4 and into the early year and I think that's exactly what we're seeing. Your line is open. I think that one of the things that’s -- here's the kind of, I think the way that I would put it, what's gone on in the airline industry in the last couple of years is, for a while there was a focus on connecting individuals names, let's take an individual plane, fly it on a route, show me what you can do on that plane. Your line is open. So, I think just to build on Rick's point, which is an important one is a lot of times when people buy antennas as a product, one of the things to look at is what is the worst case performance of that under particular combination of look angles or satellite you're using, don't look at sort of what's the worst case performance because if they go off and buy service from a third-party, they're not quite sure what the attributes of the satellite that deliver that service will be. So, for the geosynchronous satellites, what we've got is really -- we think, really, really low cost bandwidth and the ability to deliver a lot of bandwidth in these very congested places, like airline hubs as one example, ports would be another example. Your line is open. We do I mean, we see each of those, I think that it's kind of like a T-Mobile version of mid-band, it's probably going to be more representative of fixed -- it's a fixed wireless that arrives on mobile service, that's probably going to be more impactful than dedicated fixed wireless. I think one of the things that that's really going to -- that we see repeatedly is people coming and going, especially when they're economically -- in economically stressful times, people just go into a mobile plan and not having a fixed plan at all. I think we definitely hear -- we're not -- it's not like we're abandoning or its going away in the residential market, but we think the real growth is in the mobility markets and a lot of growth internationally, where some of those factors that are in hinging on the U.S. are happening and are unlikely to happen. I've had to make a couple points before we just finished one is that, like we did in Q4 and this year, we constantly balanced investments and EBITDA to try to make sure we're hitting the targets that was out there and make sure that we can borrow the money, we're trying to borrow finish the ViaSat-3 constellation, get it up until we have a little bit more room being put the accelerator on some of the things we think are valuable and to the extent that we don't, we kind of constrain that."
}