{
    "symbol": "SASI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 19:31:06",
    "content": "  Operator: Good day, and welcome to the Sigma Additive Solutions Fourth Quarter and Final Year 2022 Financial Results Conference Call and Webcast. Before we begin the formal presentation, I'd like to remind everyone that statements made on the call and webcast, including those regarding future financial results and industry prospects are forward looking and may be subject to a number of risks and uncertainties that could cause actual results to differ materially from those described in the call. At this time, I would like to turn the call over to Sigma Additive's Chief Executive Officer, Jacob Brunsberg. As we close out Q4 2022, this marks the third quarter of our transformation as a business. I'm excited to share the progress our team has made, transitioning the business to a scalable software solution and connected quality standard for the additive industry. First, we are executing the transition of our business to a software-only suite that is focused on being the center of digital quality and 3D printing. And third, we have partners and customers that are validating our road map and the need for this quality solution. So today, I will provide a brief overview of our financial results for the fourth quarter and full year 2022. As we have discussed on previous earnings calls and disclosed in our various SEC filings, in 2022, we moved away from selling expensive one-off perpetual licenses for PrintRite3D to a subscription-based pricing model, whereby revenue is recognized over time. As a result of the deemphasis in perpetual sales of the current version of PrintRite3D as well as the change in the manner in which revenue is recognized, we experienced a decline in our revenue for both the year and fourth quarter of 2022. Specifically, revenue for fiscal 2022 totaled $630,000 as compared to $1.7 million for fiscal 2021. Revenue for the fourth quarter of 2022 totaled $154,000, as compared to $350,000 for the fourth quarter of 2021. Our order backlog, as of today, defined as firm orders received but not yet shipped, totaled $125,000 of both perpetual and subscription sales. Additional revenue to be recognized from transactions closed in previous quarters totals $370,000, yielding a combined total of $495,000 of revenues to be recognized in future periods. Gross profit for the full year of 2022 was $280,000 as compared to 2021's gross profit of $1.1 million. Gross profit in the fourth quarter of 2022 was $117,000 as compared to $200,000 for the fourth quarter of 2021. This decrease of 22% was a result of an increase in the price of certain PrintRite3D hardware components as a result of configuration changes, an increase in travel costs related to system installations and discounted sales to universities and research institutions as members of our act of industrial network. And while this shift has manifested itself in lower revenue for the year, it has also had a significant impact on our operating expenses and our cash burn rate going forward. In addition, we have been able to reduce our engineering headcount without sacrificing the delivery of our new software-only products, currently targeted for the end of the second quarter of this year. Our total employee headcount at December 31, 2022, was 25 and as compared to 33 at December 31, 2021, and our peak of 35 employees in April of 2022. Total operating expenses for 2022 were $9 million, of which $2.1 million were incurred in the fourth quarter. This compares to total operating expenses for 2021 of $9.6 million, of which $2.6 million was incurred in the fourth quarter. Salaries and benefits increased by $454,000 over 2021 as the aforementioned headcount reductions did not take place until the second half of 2022. Stock-based compensation decreased by $273,000 from 2021 as a result of fewer stock options granted during the year. Operations and R&D expenses decreased by $237,000, largely as a result of lower spend for parts and materials due to fewer perpetual sales for our PrintRite3D solution as well as lower obsolescence charges in 2022. Investor relations, advertising and marketing expenses decreased by $81,000 as a result of a reduction in Investor Relations resources, partially offset by an increase in trade shows due to the relaxing of COVID-related restrictions. Office expenses increased by $180,000, mostly due to increased travel costs, again, because of the easing of COVID travel restrictions. Our organization costs decreased by $414,000, largely driven by fewer stock option grants to nonemployee directors and one less shareholder meeting in 2022. Cash totaled $2.8 million at December 31, 2022, as compared to $11.4 million at December 31, 2021. Our working capital at December 31, 2022, was $3.6 million as compared to $11.7 million at December 31, 2021. In 2022, we used $8.2 million in cash for operating activities and an additional $389,000 for purchases of fixed assets and investment in our patent portfolio. In total, this equates to an average monthly cash usage or burn rate of approximately $717,000 per month. In the fourth quarter, however, we reduced our burn rate to $650,000 per month as a result of our headcount reductions and other expense cuts. And in the first 2 months of 2023, with the additional headcount decreases I mentioned, our burn rate has been reduced to under $600,000 per month. And finally, as we look to extend our cash runway to a strategic investment or sale of the company, we are seeking additional ways to raise capital and conserve our cash. As I mentioned earlier, I'm going to focus on 3 areas: execution of our business plan to set up our digital quality suite, the market timing and fit, and lastly, our partners and customers aligning around our future road map. On execution of the business plan, we are living our mission to accelerate the adoption of additive manufacturing by setting the standard for quality, and we are on the path to deliver the first holistic digital quality experience for the additive industry. As a reminder, at the heart of this is simplifying the quality experience from up to 12 disparate software licenses and multiple manual spreadsheets to a single user experience integrated into their production workflow. We maintain a targeted launch of our software-only product suite for Q2 2023, that covers machine, process and part health. This will be an important step in simplifying the in-process quality space, providing a central hub for in-process data and open connectivity to solutions up and downstream. We sincerely look forward to launching this module as part of the software-only PrintRite3D suite, which also includes our process health product for camera-based machine learning image data and our Part Health product, which is the software-only version of our core melt-pool technology. As Frank mentioned, we have been able to significantly reduce operating expenses to align with a quicker path to profitability, including our largest cost, salary expense, by 40% from the high in April 2022, while retaining key employees for our growth. As companies align towards profitability, Sigma has made demonstrable progress in 2022, connecting to other products in the AM digital quality stream. On our partners and customers, to pave the way for our pending software products, the commercial team is ahead of schedule on strategic partnerships and integrations that provide a path to scale our software solutions and grow our total addressable markets. This allows us to provide our Print right 3D product as a software-only suite for existing OEM machines and monitoring equipment, including EOS and SOM. As we launch our software-only suite, our addressable market through these APIs grows for Sigma's support and scale. For the first time, Sigma expanded and in the polymer space, I might add, outside of the 3D printer and into the post processing quality with our relationship with Dimension. Additionally, we recently expanded our relationship with Materialise by integrating the PrintRite3D quality assurance solution into the new software solution materialized process control on their co-AM platform. In addition, we've added our first automotive customer and have been informed of a planned multisite expansion at a key aerospace customer, of which connects us to another OEM and potential software-only implementation. As we continue to execute our plan, lean our burn rate and focus on getting to profitability, Frank provided context to our cash runway. We continue to evaluate options to fortify our balance sheet and are happy to have retain Lake Street Capital Markets as Sigma's financial adviser in connection with the company's consideration of a range of strategic alternatives designed to enhance shareholder value, including a possible strategic investment, which we've mentioned on prior earnings calls, acquisition, merger, business combination or similar transaction. We have expanded our addressable market as we are ahead of plan on our partner integrations with 8 OEM and hardware companies, Novanta Additive Industries, DMG, Economy AMAC, EOS, Dimension and SLM Solutions and 4 ISV companies materialize AMFG, Sentient Science and Dendrite, with more pending. SpaceX had 61 launches in 2022, nearly double the 31 launches that conducted in 2021, and we are starting to see the airline industry approach recovery to pre-pandemic numbers, with expanded 3D-printed parts and new platforms. Along these lines, GE announced investments in manufacturing, including $16 million targeted for 3D printing. Finally, the Biden administration recently lifted the $50 million cap on money that could be spent by the Department of Defense without congressional approval, specifically regarding critical supply chain for electronics, kinetic capabilities, castings and forgings, minerals and materials and power and energy storage. Looking ahead, we continue to move with great urgency in our business transition to put ourselves in a position to be at the home for connected digital quality to support qualification and production across thousands of machines at hundreds of customer sites. I think, honestly, COVID even before that, I think had a probably bigger impact on starting the trajectory in the sense that people really are focusing on profitability and core business. It may be a little counterintuitive, but what we've seen is an acceleration of some of the work, with OEMs opening some of their platforms, as well as other software companies looking to generate more revenue by connecting solutions in the marketplace. So as we look at that transition in 2022, outside of maybe some maintenance contracts that were lower dollar value, the majority of our sales are all our new sales. So we're seeing more and more of our revenue transition into that subscription landscape, which is why you see us actually carrying a backlog in the future quarters, which is something that was outside of things that were bought, but not yet installed prior was about the only thing meeting that criteria. So that tracks with our subscription plan and our software launch, which we hope will help level out that revenue over time and kind of continue the growth keeping that consistency month-to-month from a revenue perspective. I think from the end user perspective, for the people who are doing production now, you're starting to see a lot of people who are collecting a lot of data and now figuring out how to make their operations more profitable. So I think that's a big driver of why you've started to see in some of the trade shows and the talk sessions and things like that, the topics and themes having a lot more quality and cost undertone to them here. And so as we are presenting a path to a lower-cost quality solution and one that's more scalable, I think we're feeling a lot of resonance from the end user base. Before Sigma is retrofitting on the machines, the ability now to connect and have partners there is a whole additional total addressable market that really just wasn't there in Sigma staff. And I think we'll have plenty of opportunity as well to take some of the things that we built and apply them to either earlier items in the process or later, really to focus again is connecting more of the digital quality stream and keeping it in one user experience versus having to have multiple different things you're jumping around from."
}