{
    "symbol": "IBM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 19:08:05",
    "content": " For 2023, we see revenue growth in line with our mid-single-digit model range and about $10.5 billion of free cash flow. In terms of cash uses for the year, we invested $2.3 billion to acquire eight companies across software and consulting, mitigated by over $1 billion in proceeds from divested businesses, and we returned nearly $6 billion to shareholders in the form of dividends. As a proof point, OpenShift, our industry-leading hybrid cloud platform now has $1 billion in annual recurring revenue, and we modernize and optimize our software capabilities, including through cloud packs across automation, data and AI and security for that platform. Your line is open. So, we are entirely focused on how we execute this company on a sustainable revenue growth profile and generating that $10.5 billion of free cash flow. Your line is open. Your line is open. But let me first comment on your statement of, we have a double mandate of revenue growth and free cash flow growth, but I want to also be clear, revenue growth has -- which manifests itself in client satisfaction, higher NPS from our clients, better consumption of both software and consulting from our clients, which allows them to consume more and more over time is what we are focused on. So, we see nice green shoots that lead to our guidance in 2023 at the high end of our high single-digit model in consulting on revenue coming off of a very strong 15% growth in 2022 and guiding another one point plus in operating margins going forward. Your line is open. Your line is open. Your line is open. Your line is open. That will be driven based on the fundamental improvements of our underlying revenue growth and operating leverage and cash PTI, but there will also be, yes, a working capital efficiency contribution to our cash generation next year, really just the volume dynamics of what played out in the fourth quarter. Your line is open."
}