{
    "symbol": "BXMT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 11:40:10",
    "content": " In most of our office portfolio, we see stable occupancy, ongoing sponsor commitment and particularly notable in today's environment, continued repayments with $349 million in office loans repaying over the last three months, including a vacant New York City office slated for renovation, which just occurred post quarter end. We also had credit upgrades this quarter as assets ramped up and stabilized with higher rates and less overall transaction activity in the market, assets that have completed their business plans are staying in our portfolio longer as patient sponsors opt to hold rather than sell into the current conditions. Our current dividend yield is 620 basis points above the 10-year, well wide of our pre-COVID average, despite our company now having growing earnings, significantly stronger dividend coverage, a high integrity balance sheet with more than double the liquidity, and a performing portfolio that has been reoriented to stand up to today's inflationary pressures. This quarter's results show case positive impact of rising rates on BXMT's floating rate loan portfolio with another consecutive quarter of meaningful earnings growth, supported by the stability in our book value, portfolio metrics, and capitalization. So we downgraded four loans to four this quarter, just 3% of the portfolio and determine the downgrades were warranted, I think given the unique headwinds each of the asset faces, in some cases, locations in more challenged markets or submarkets like DC or Chicago, as well as looking at the specific circumstances. I think it's going to start from our overall perspective on the market today, which, as I mentioned, is definitely a high bar and thinking a lot about underwriting debt service type range near, medium, long-term and uses for our capital in more interesting ways, i.e., legacy loan acquisitions, helping the banks reduce some of their exposures those types of unique opportunities that we think can generate really outsized risk return profiles. And so looking at cap rates in the context of growing NOI, obviously, values will be impacted more so about cap rates going up than if we just had NOI growth, but there's a balance between NOI growth and cap rates, and that's what we really use when we look at the long-term values of our assets, think about the risk in the portfolio, think about new originations."
}