{
    "symbol": "BXMT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 13:17:10",
    "content": " The insulation provided by our loan basis should not be overlooked, it would take lasting declines of 30% to 40% in real estate values for us to experience a loss at our position in the capital structure and because the vast majority of our sponsors remained committed to their assets and have contributed more equity along the way, our business has been further de-risked over time, enhancing the embedded credit protection in our portfolio. The primary difference between our GAAP net loss and DE is the $189 million increase in our CECL reserve this quarter, primarily related to four loans with specific CECL reserves, as well as an incremental general reserve to reflect the broader market uncertainty and potential risk to our portfolio. Our aggregate asset specific CECL reserve outstands at $190 million or 20% of our five-rated loans and our general CECL reserve of $153 million represent about 55 basis points of our total portfolio, which is up from 35 basis points last quarter. And I think as a whole, the combination of continued positive, albeit to your point, probably, somewhat less quick or decelerating growth, but continued positive growth, combined with the fact that thereâ\u0080\u0099s a lot of capital markets interest and support for this asset class makes us as a lender feel very good about where our loans are relative to the NOIs and the value of these assets. And so I think when we look at, think about, our fundings going into new build office buildings, which are also just because of the way we make construction loans tend to be lower leverage on average than the rest of our portfolio, and again by definition, the best quality assets coming into the market. I think thatâ\u0080\u0099s a process thatâ\u0080\u0099s going to take some time, because we really want to be deliberate about it and make the right decision and these are a very small part of our portfolio that supported by the tremendous earnings power we have throughout the rest of the portfolio and so our goal is to preserve the most value we count on these assets over time using an ownership mentality. But thereâ\u0080\u0099s certainly a number of assets in the market and a few in our portfolio that were just built and targeted at a part of the market that has had lasting change and I donâ\u0080\u0099t think rates are -- thereâ\u0080\u0099s certainly a contributing factor, but I am not sure that lower rates are really going to change for some of those assets."
}