{
    "symbol": "SASR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 19:00:06",
    "content": " Today we reported net income of $34 million or $0.76 per diluted common share for the quarter ended December of 31, 2022, compared to net income of $45.4 million or $0.99 per diluted common share for the fourth quarter of 2021 and $33.6 million or $0.75 per diluted common share for the third quarter of 2022. Core earnings were $35.3 million or $0.79 per diluted common share compared to $46.6 million or $1.2 per diluted common share for the quarter ended December 31, 2021 and then $35.7 million or $0.80 per diluted common share for the quarter ended September 30, 2022. Looking at our earnings through another lens, pre-tax, pre-provision income was $56.6 million compared to $64.1 million in the linked quarter and $61.7 million in the prior year quarter. The provision for credit losses was a charge of $10.8 million compared to a charge of $1.6 million in the fourth quarter of 2021, and a charge of $18.9 million for the third quarter of 2022. Shifting to the balance sheet, total assets grew 10% to $13.8 billion compared to $12.6 billion in the prior year quarter. Total loans, excluding PPP, increased 16% to $11.4 billion at December 31, 2022, compared to $9.8 billion at December 31 of last year. At the end of the quarter, our commercial pipeline was at $944 million compared to $1.3 billion for the linked quarter, representing 32% reduction. DDA balances are also experiencing pressure due to lower title company deposits, which totaled $437 million in the fourth quarter of 2021, but fell to $227 million at the end of 2022. Excluding the impact of the amortization of the fair value marks derived from acquisitions and interest in fees from PPP loans, the net interest margin would have been 3.26%, compared to the net interest margin of 3.31% for the fourth quarter of 2021 and 3.5% for the linked quarter. Income from mortgage banking activities decreased $2.8 million compared to the prior year quarter and $800,000 compared to the linked quarter. Due to ongoing market volatility, wealth management income decreased $390,000 compared to the linked quarter and $1.1 million compared to the prior year quarter. Non-interest expense for the current quarter decreased $1.8 million or 3% compared to the prior year quarter, driven primarily by the decreases of $2.1 million in compensation and benefits expense, $1 million in occupancy expense and $0.5 million in other non-interest expense. Loans placed on non-accrual amounted to $5.5 million compared to $500,000 for the prior year quarter and $4.2 million for the third quarter of 2022. Compared to the end of 2021, the allowance for credit losses was $109.1 million or 1.1% of outstanding loans and coverage of 224% of non-performing loans. The tangible common equity ratio decreased to 8.18% of tangible assets at December 31 compared to 9.21% at December 31 of 2021, a decrease as a result of the $25 million repurchase of common shares during the previous 12 months and the $123 million increase in the accumulated other comprehensive loss in the investment portfolio that resulted from the rising rate environment and the increase in tangible assets during the past year."
}