{
    "symbol": "SASR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 20:13:06",
    "content": " Today we reported net income of $54.8 million, or $1.21 per diluted common share for the quarter ended June 30, 2022 compared to net income of $57.3 million or $1.19 per diluted common share for the second quarter of 2021 and $43.9 million or $0.96 per diluted common share for the first quarter of 2022. Compared to the prior year quarter, assets increased 3% from $12.9 billion. In the second quarter, funded commercial loan production increased 60% to $805 million, compared to $503 million for the same quarter of the prior year. The growth in the commercial portfolio excluding PPP loans occurred in all commercial portfolios led by the $1.1 billion growth or 28% growth in the investor owned commercial portfolio, and $230 million or 21% in the C&I portfolio. Looking at PPP as of the end of the quarter, we had outstanding loans of only $23.5 million, compared to $897 million in the prior year quarter. As a result, income from mortgage banking activities decreased $4.3 million compared to the prior year quarter, and $850,000 compared to the linked quarter. We also continued to successfully execute on our strategy to hold a larger percentage of mortgage production on the balance sheet to regrowth this asset class, so compared to the linked quarter mortgage loans held in portfolio grew by 15%. Excluding the impact of the amortization of fair value marks derived from acquisitions and interest in fees from PPP loans, the net interest margin would have been 3.45% compared to the net interest margin of 3.49% for the second quarter of 2021 and 3.41% for the linked quarter. Noninterest expense for the quarter increased $2 million or 3% compared to the prior year quarter, which included $1.1 million in transaction costs associated with the sale of the insurance business. Loans placed on non-accrual during the current quarter amounted to $900,000 compared to $1.5 million for the prior year quarter and another $1.5 for the first quarter of 2022. The biggest thing is done and I think we touched upon this last quarter, as we talked about expenses, the biggest thing that will only be two things that will drive any difference in the expense levels, and we've been continuing to forecast this and plan is for us to have greater success in attracting new employees into the company, we're running at a fairly high vacancy rate for our normal experience here."
}