{
    "symbol": "CDAY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 20:27:03",
    "content": " In the North American EMEA and APJ mid markets as detailed in our shareholder letter, we are seeing tremendous momentum in full suite sales, now more than 36% of customers buying the Dayforce suite, momentum in selling back to our base now more than 30% of our sales are back to our current customer base and real speed to value realized by our own implementation organization and that of our now more than 30 SI partners worldwide. The second piece is, as we've mentioned, as we extend the platform and we saw the add-on modules and 36% of clients today have a suite of modules they're using, we get additional revenue, but we don't really change the cost of hosting or the cost of support so that drives off the profitability of it as well. So if you can eliminate integration points or alternative providers or duplicative teams internal to your business, that's a win, which is why anything that we do that complements our full suite and allows us to be one single provider to our customer is part of the reason that we're winning full suite deals, payroll deals in a down market, I would argue more than people who don't offer what we offer. Hi guys, thanks for taking the question. And both of those, 11,000 and 40,000 employees, would have been unheard of a couple of years ago that they would have bought more than pay in time from us, but now they're buying a larger footprint and they are a really good example of what Noemie just said, which is, we expect the customers there are in the 100,000, 350,000, 700,000 range will buy more from us over time if we land with pay and time and service them well. Hi guys, thanks for taking the question. I guess my general answer would be our goal is to sell full suite to the mid-market to go back and make sure that every single one of those customers owns the complete 24 SKUs that we have to offer to then plant seeds in the large enterprise, which is what we're doing and expand just as we will have in the mid-market there over time."
}