{
    "symbol": "EQH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 17:57:03",
    "content": " Our first quarter results highlight the resiliency of our broad range of retirement, asset management and advice businesses against the backdrop of turbulent financial markets, inflationary pressures and rising interest rates, EQT continues to post positive net inflows and strong free cash flow generation. Equitable Holdings generated $548 million in non-GAAP operating earnings or $1.36 per share, up 1% year-over-year, reflecting a 4% increase in assets under management. Adjusting for onetime items in the quarter, principally excess death claims relating to the ongoing pandemic, non-GAAP operating earnings were $1.53 per share, up 13% year-over-year on a comparable per share basis. In February, we gave guidance that at 2021 year-end market levels, the adjustment to book value would be within our $2 billion AOCI balance with no impact to our cash flows. AB's 200-plus private wealth managers with a focus on high net worth clients, delivered $2 billion in net inflows in the quarter end and is responsible for $117 billion or 16% of AB's total AUM. Strong net flows and favorable markets over the last year have continued to drive AUA growth, closing the quarter at $79 billion, up 13% year-over-year as we continue to see our affiliated distribution becoming a more significant component of the Equitable Holdings story. Importantly, we expect to generate this cash flow, absent the earnings from the legacy block we reinsured Venerable last year, which monetized $1.2 billion of value, leading to an additional $500 million of capital return last year with the remainder to be returned over time. Adjusting for notable items in the period, non-GAAP operating earnings were $615 million this quarter or $1.53 per share, up 13% year-over-year on a per share basis. AUM increased to $856 billion over prior year quarter, supported by favorable equity markets and continued positive net flows reflecting the strength of our retirement and asset management businesses. As a reminder, the Venerable transaction closed in June of last year, unlocking $1.2 billion in value while reducing over 2/3 of our legacy VA risk resulting in an adjustment of $180 million to operating earnings per annum. In the quarter, we also maintained our #1 position in the protected equity RILA market reporting $2 billion in structured capital strategy sales, up 10% from prior year and record sales in the month of March. We reported operating earnings less notable items of $149 million, up 7% versus the prior year quarter, driven by lower expenses and higher fee revenues. Operating earnings were $136 million, up 12% year-over-year, primarily driven by an increase in base fees on higher average AUM and performance fees in the quarter. The private wealth channel, which represents approximately 1/3 of AB's fee-based revenues, reported gross sales of $6 billion, up 12% year-over-year with $2 billion of net inflows and 7% annualized organic growth year-over-year. Total assets under management at the end of the quarter were $735 billion, up 5% from the prior year quarter, attributable to positive net inflows for the last 12 months, including $11 billion this quarter and favorable markets. Gross written premiums were $1 billion in the quarter, up 36% over prior year quarter as we continue to make strides shifting towards less interest-sensitive accumulation VUL products with first year premiums up 65% year-over-year. And as mentioned earlier, shareholders continue to benefit from our diverse businesses who have retirement, asset management and affiliated distribution, which resulted in our expected $1.6 billion of annual cash flow generation, up from $1.2 billion at our IPO. The legacy VA transaction or reducing the risk-oriented business gives us confidence in the cash flow generation of $1.6 billion, up 30% from IPO, as you mentioned, and will continue to drive cash flows. In your prepared remarks, you mentioned that your free cash flow yield is 12%, but given where your market cap is today, that would imply $1.3 billion of free cash flow, but you actually read your guide to $1.6 billion from your prior $1.5 billion."
}