{
    "symbol": "EQH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 15:14:05",
    "content": " We returned $1 billion to date this year, including $275 million in the third quarter, in line with our payout guidance of 50% to 60% of non-GAAP operating earnings. Equitable's third quarter retirement net inflows of $1.2 billion demonstrates our product innovation, strong distribution, and alignment with client needs. Since our IPO, organic growth and equity market performance have increased cash flows by $500 million with the biggest contribution coming from Equitable's Individual and Group Retirement segments. Equitable continues to support the growth of AB's private markets platform, deploying nearly 60% of our $10 billion seed capital commitment, which has helped support a 7% year-over-year fee rate improvement. AB's institutional pipeline remains strong, doubling in the quarter to $25 billion, with over 80% of the pipeline fee-based attributable to private alternatives, highlighting the benefit again of our acquisition of CarVal. While markets weighed on assets under advice, closing the quarter at $69 billion, down 3% compared to prior quarter we have benefited from net inflows as demand for advice continues. We reported non-GAAP operating earnings of $498 million or $1.28 per share, sequentially lower on a per share basis, primarily due to the impact from lower equity markets in the quarter which is partially offset by our favorable assumption update. Adjusting for the $13 million of notable items in the quarter, non-GAAP operating earnings were $511 million or $1.32 per share, down 15% on a comparable year-over-year per share basis. The net effect of market and our hedging is that our fee-based earnings and cash flows will adjust in line with the sensitivity we've given to markets of plus or minus 10%, having $150 million post-tax impact. The alternatives growth is another strong example of our synergies, supported by Equitable's $10 billion commitment, AB has delivered nine straight quarters of net inflows in alternatives and multi-asset solutions. We believe our $2 billion of cash at the Holdco, supported by our $930 million insurance dividend in July, our strong RBC ratio is a testament of both our hedging program and high-quality investment portfolio with 96% of fixed maturities being investment grade. We've also returned $1 billion to shareholders year-to-date, and as a result, we're on the higher end of our 50% to 60% payout ratio despite the volatility in markets, the S&P 500 declining over 25% and interest rate increasing quite a bit."
}