{
    "symbol": "BLNK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 18:34:07",
    "content": " We delivered a strong start to 2022, highlighted by record revenue of $9.8 million, an increase of 339% over the first quarter of 2021, driven by exponential growth in both product sales and service revenues. Our record first quarter results are reflective of the solid platform and reputation that we've built in the EV charging industry, as partners and customers recognize Blink as a leading provider of charging technology and services. As I mentioned last quarter, we unveiled seven new next-generation charging products at CES in January, including our Vision IQ 200 charger targeting the 1 million-plus retail locations across the United States. First quarter 2022 service revenues, which consists of charging service revenues, network fees and ridesharing revenues were $1.5 million, an increase of 346% compared to the first quarter of 2021. What you're seeing in Q1, and we've noted this on previous -- in previous quarters, we had the -- in 2021, starting around May, there was a performance -- special performance equity option award that significantly about $13 million that we've got expensed in 2021. On the charging service segment, I just wanted to see if there was any incremental color with respect to a couple of quarter-over-quarter trends versus Q4 2021 that we're seeing with respect to charging service revenue and gross margins, especially kind of getting a growing absolute charger base or if it's just kind of due to some sort of one-off. What we're seeing is there were actually -- and it starts to matter and when you just look at it there was actually, I think, 92 or 93 days in Q4 and only 90. with that -- and there was -- let's say, we also -- we did experience a little bit of probably some weather plays a factor in charging in the winter seasonality and a little bit of pullback probably from the Omnicon bit reset that reflected in the first quarter."
}