{
    "symbol": "KARO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-19 11:16:03",
    "content": " 06:17 We believe in South Africa, we can grow relatively fast for maybe another forty six years, but I think in Southeast Asia and Europe, we’ve really got a long runway for growth. 09:25 In terms of profitability, our operating profit for the quarter was 205 million, compared to the previous quarter of 178 million and that's primarily because in Q4, Q1 we invested substantially in sales and marketing and with COVID, we saw that we had to become a little bit more prudent with our capital allocation, so we cut back a little bit on the sales and marketing costs, and we've seen the increase in operating profit. There is a bit of noise because of currency, but it is also because we've increased our sales and marketing and we haven't actually derived at the necessary value at this point in time, given the  COVID, but nevertheless still being healthy and our Cartrack’s operating profit margin for the  was 31%. So, if you look at Q2 and Q3, we cut back on the sales and marketing  , we are still getting the growth, but if we want to still say it, as a 30% or 40%, we are going to have to increase that, but we've got to do it when the market again was – once we're able to travel, we’re able to deploy the people, we’re able to execute. It’s going to software to help our customers in terms of last mile delivery in terms of consignment centers with different customers  and then we can distribute it for them using third party  or using outsourced drivers, we are driving all of that interventions into the stores of a large retailers into the  in terms of the management of fleets that’s on the ground in terms of the administration where we had lots of customers seeing things on various systems or mainly on excel. So, we want to get investing – because I think that the real opportunity, the biggest opportunity for us with the longest runway is clearly Asia and Europe, South Africa, we’ve already got 11% of the vehicles on the road of 10%. 32:02 It's something that we can start looking at that probably in South Africa in about 2 years’ time, 3 years’ time to increase revenue and ARPU, once we believe we've got a lion’s share of the customer potential market."
}