{
    "symbol": "LUCD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 14:18:15",
    "content": " Weâ\u0080\u0099re making good progress collecting clinical utility data, which is a key driver of future in-network commercial payer contracting, and as weâ\u0080\u0099ll describe in more detail, we secured financing of just under $25 million, which extends our cash runway well into 2024. We launched another horizon, another location and opportunity and model for patients to get -- to bring to the testing directly to adverse patients in high-volume events that weâ\u0080\u0099re referring to as CheckYourFoodTube Precancer Detection Events. And the CheckYourFoodTube with the San Antonia Firefighters was sort of a spontaneous stress test for our system and the team passed with blind colors, they were able to perform 100 EsoCheck procedures in a day with 50 per day by the nurse practitioners and the laboratory received on one day 200 samples that was able to process that on one day with the current -- with our current infrastructure. Your line is open. And we think our current team can continue to drive test volume growth as we start getting more predictable payment and improve on our contracting, and we think these initiatives, such as the high-volume testing events, as well as Direct Contracting with ASO type entities, weâ\u0080\u0099ll be -- weâ\u0080\u0099ll play an important role in that growth over time. And I think Iâ\u0080\u0099ve mentioned this before, but Iâ\u0080\u0099ll reiterate it, one of the things that we really like about the satellite model is by having a day where the Lucid nurse practitioner is going to come to the practice on a particular day does bring the whole issue of esophageal precancer testing front and center and as they know that the fees is going to be there next week or in a couple of weeks, itâ\u0080\u0099s much more front and center than previously, where we had to just have multiple contact points by our reps to keep it front and center. Your line is open. Your line is open. But the good news is and the reason weâ\u0080\u0099re focused on the commercial side is that, the demographics of the patients being ordered for testing remain -- to remain strongly tilted towards commercial payers with 10%, 12% of the patients being Medicare. Your line is open. I mean, I really feel like we now have enough that we can feel confident about our -- that the price between Medicare as a floor and our $2,500 list price based on out-of-network payments, based on payments from, as Dennis mentioned, larger plans that are out-of-network, that respect that price is really, like, weâ\u0080\u0099re developing increasing confidence that our pricing is going to hold. Your line is open."
}