{
    "symbol": "LUCD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 21:50:06",
    "content": " as well as its physician practices, but the important thing to note and then the important trend from the last quarter on this slide is that 22% of the tests performed in the fourth quarter were in that satellite LTC model where our nurse practitioners are collocating with adequate physician practice to perform tests on patients I referred from that practice and we expect this to continue to -- it's clearly making an impact now, and we expect it to be a growth driver moving forward. The key factor and we continue to have ongoing discussions with private pairs with medical directors and so forth remains as with the Medicare side with collecting clinical utility data and I'll talk a little bit more about that later, but our plan to do so we've been vetting that through both retired and existing medical directors of multiple plans and we believe we have it -- we're in a position to start collecting that data in a way that we should start being able to start securing do more the plan further down on this chart here and it's security networks for that. So we don't really have enough data yet to know what percentage of the claims submitted will get paid and we need another couple of quarters to get a better picture of that, but we look forward to tracking that closely over the next couple of quarters to give you a better sense as to how we'll do from out of network payments as we are waiting going in network and securing the network contracts. So collection device to a high volume manufacturer at coastline but manufacture the device that began there in October of this year just last month of this kind of a company that headquartered in San Diego with plants in T1 and Mexico, will have a median by moving to the high volume provider of decreasing our per unit manufacturing cost of EsoCheck by about 60% and also the capacity with just the initial line will go to about 20,000 units a year, but what's really important with regard to this transfer is that, we have fully scalable capacity at this facility by and we can just add additional lines as demand dictates upward of million devices a year. There are, so I see, we haven't actually broken that down and I'd be a little bit careful to sort of confirm your extravagant extrapolation there and I'll ask Dennis to chime in if you'd like, but you didn't know one thing, which is that we had test centers in Arizona that have been in place for over a year that are quite a bit busier than we have some that are that would that have just been getting off the ground as we've accelerated growth in over the last couple of months. So, yeah, but I think we really need a little bit of time to see how that holds in terms of the price -- in terms of the number of payers that are paying out of network and frankly, ultimately for the near term, a useful metric that we're really looking forward to getting our -- to get our head around, which is the percentage of the total plan submitted that eventually they get paid out a network that'll be an important number for us in the near term as we're trying to walk down a long-term contract. We're getting good quarter-on-quarter mid throttle growth, but translating that into sort of predictable revenue projections, it was going to take us several more quarters, so we can get a sense as to what are out of network, what portion of the claim submitted will get paid out of network and how we're progressing with regard to using our clinical utility data to secure in network contracts. So inflationary pressures, no, inflation is out there, I think, we've generally had both whether sales reps or the bulk of our team are to be a well-paid professionals, but in terms of certainly in terms of our budgeting and our targeted expenses for personnel or for even for supplies, we've had supply chain issues which we've described before where we've had to work around challenges with regard to supply chain, but in terms of the -- from a cost point of view, they are there but it hasn't had a significant impact on our business with moving forward."
}