{
    "symbol": "BOKF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 17:11:07",
    "content": " Our period-end core loan balances grew $711 million or 3.5% linked quarter, but even more impressive with growth in unfunded loan commitments. Period-end loans in our core loan portfolio were up -- were $21.2 billion, up 3.5% linked quarter. Loans in the energy space continued their recent linked quarter growth trend, period-end balances grew $195 million and have increased $386 million since December 31. Health care balances increased $255 million or 7.4% linked quarter, primarily driven by our senior housing sector. Excluding energy and health care, core middle market C&I realized positive growth again this quarter, with linked quarter growth of $245 million or 3.9%. Commitments grew $460 million or 7.5% linked quarter, with year-to-date commitment up $855 million. Excluding PPP loans, the combined allowance for credit losses was $283 million or 1.33% of outstanding loans at quarter end. Institutional trading fees increased $66 million linked quarter as we move past last quarter's volatility, returning us to more sustainable trading levels and revenues. Driven by increased activity from our energy customers, our commodity and hedging activities had a record quarter with fees of $13 million, a $2.2 million increase from the record set last quarter. Commercial syndication fees recorded their second best quarter ever with fees of $6.4 million, an increase of $3.3 million linked quarter. Fiduciary and asset management fees increased $3.4 million linked quarter, primarily due to seasonal tax preparation fees and growth in mutual fund fees and revenues, largely driven by increases in short-term interest rates. Compared to second quarter last year, total service charges have grown $2.6 million or 10%. Mortgage banking revenue decreased $5.3 million or 32% linked quarter, with production revenues down $5.6 million due to lower production volumes combined with narrowing margins. Mortgaging servicing fees increased $277,000 this quarter and or 6% higher than the second quarter last year. Interest and fees on loans increased $25.8 million linked quarter, largely due to a 35 basis point increase in loan yields. Interest income on the available for sale and investment portfolios increased $2 million linked quarter, primarily due to a 7 basis point increase in the average yield on the available for sale portfolio due to higher reinvestment rates. Total interest expense increased $5.5 million during the second quarter, primarily due to a 10 basis point increase in the average rate of interest-bearing liabilities, while those related average balances fell $2.5 billion. Excluding the $120 million linked quarter decline in PPP loans, average loan balances increased $714 million. Average total deposits declined $1.8 billion, with noninterest-bearing deposits increasing $140 million and interest-bearing balances decreasing $1.9 billion this quarter, which was consistent with our expectations given the movement in short-term interest rates. Net interest margin was 2.76%, a 32 basis point increase from the previous quarter, with the increase of combination of the $4.4 billion linked quarter decline in earning assets and the 35 basis point increase in loan yields. Our loan-to-deposit ratio increased to 55% this quarter from 52% at March 31, due to the combined impact of an $807 million decrease in total deposits and a $617 million increase in loan balances this quarter. Total operating expense should be approximately $280 million to $285 million per quarter for the remainder of 2022, bringing total expenses for the year 5% below 2021 and our efficiency ratio below our corporate goal of 60% by the end of the year. So now that we reset that position for that portfolio within the dynamics of improvement in loan spreads and yields, our continued control in deposit costs and overall asset sensitivity, we're going to grow net interest income, $15 million to $20 million for the next couple of quarters."
}