{
    "symbol": "BOKF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 15:28:01",
    "content": " As short-term interest rates continued to rise during the quarter, the combination of our asset-sensitive balance sheet and growth in earning assets drove a $36 million increase in net interest revenue and a 30 basis point linked-quarter increase in the net interest margin. Period-end core loan balances increased $773 million or 3.5% linked quarter, with growth spread across C&I and commercial real estate. Period-end loans in our core loan portfolio were $22.5 billion, up 3.5% linked quarter. Total C&I loans increased $591 million or 4.3% linked quarter and have increased $1.7 billion or 13.5% for the year, with growth across all sectors. Health care balances increased slightly this quarter, up $18 million or 0.5% but have increased $430 million or 12.6% for the year, primarily driven by our senior housing sector. Unfunded commitments increased 9.6% linked quarter, resulting in an average utilization rate of approximately 49%, creating more capacity for continued balance sheet growth. General business loans recorded a strong quarter, with balances increasing $368 million or 11.8% linked quarter. Loans in our services sector also increased, with balances up $151 million or 4.6% linked quarter. In consideration of strong growth in outstanding loan balances and unfunded commitments this quarter, we added $15 million to our provision for expected credit losses. Our commodity and hedging activities declined $4.7 million from last quarter's record high, with linked quarter declines in both energy and interest rate derivatives. Commercial loan syndication fees increased $2.3 million linked quarter, offset by a $4.7 million decrease in other investment banking fees, primarily fees from our municipal investment banking segment. The combination of our investment banking and customer hedging activities from our wealth and commercial segments generated $91 million in fee income for the year, an increase of $36 million or 67% compared to 2021. For the year, these fees increased $18 million or 10%, primarily due to reduced fund fee waivers driven by the increase in short-term interest rates as well as market-driven increases to our oil and gas fees. Our assets under management or administration finished the year at $99.7 billion, an increase of $4.3 billion or 4.5% linked quarter, with growth across all categories. Turning to Slide 12, fourth quarter net interest revenue was $353 million, a $36 million increase linked quarter. The rapid increase in interest rates, combined with our strong loan growth and our asset-sensitive position, resulted in linked quarter net interest margin expansion from 3.24% to 3.54%. Total deposits decreased $1.9 billion and loan balances increased $767 million this quarter, although increasing our current loan-to-deposit ratio remains well below the pre-pandemic level of 78.7% at year-end 2019, providing sufficient on-balance sheet liquidity to meet future customer loan demand."
}