{
    "symbol": "BOKF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 13:24:04",
    "content": " Pre-provision net revenue increased $42 million linked quarter as we grew core loans, experienced significant margin expansion and benefited from our diverse fee income base. Turning to Slide 5, period end core loan balances increased $522 million or 2.5% linked quarter with commercial real estate, the primary driver. While average deposits continued to remain high compared to pre-pandemic levels, we saw a decrease of $1.5 billion or 4% this quarter with virtually all of that in interest bearing balances. Assets under management or administration were relatively flat linked quarter at $95.4 billion and are down 3.5% compared to last year, driven by market impact on equities, which comprise approximately a third of the total. Period end loans in our core loan portfolio were $21.8 billion, up 2.5% linked quarter. Healthcare balances increased to $130 million or 3.5% linked quarter, primarily driven by our senior housing and hospital acute care sectors. Energy balances decline $21 million this quarter, but have increased $558 million or 20% year over year. Unfunded commitments increased just over 3% linked quarter, resulting in an average utilization rate of approximately 50%, creating more capacity for continued balance sheet growth. Services and general business loans did decline 1.2% linked quarter, but have increased $396 million or 6.6% compared to September 30, 2021. Non-accrual loans increased $17 million in the third quarter, primarily due to two loans, one in healthcare and another in services. We took a $15 million provision for expected credit losses this quarter, considering continued strong loan growth and changes in our reasonable and supportable economic forecasts, which were primarily related to a more challenging economic outlook from the Federal Reserve's continued actions to control inflation. Interest income on securities increased $7 million linked order as average yields increased $29 basis points, primarily due to higher yields on the trading portfolio and higher reinvestment rates on our available for sale portfolio. Total interest expense increased $27 million linked quarter, primarily due to a 45 basis point increase in the average rate of interest bearing liabilities. Using our standard modeling, assuming a parallel shift up 200 basis points gradually over 12 months relative to rates as of the end of third quarter, net interest revenue would increase 1.65% or approximately $24 million. Our loan to deposit ratio increased to 59.8% this quarter from 55.1% at June 30th, due to the combined impact of a $2.2 billion decrease in total deposits and a $499 million increase in loan balances this quarter."
}