{
    "symbol": "INCR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-04 18:56:07",
    "content": " In 2022, our revenue exceeded $150 million with adjusted EBITDA of $32 million, a significant achievement considering pharmaceutical-grade recognition was only introduced less than five years ago and our first GMP prescribed product was dispensed in the pharmacy only in late 2019. Although Israeli is well known for its medical cannabis research, it's also developed and implemented the most advanced medical cannabis regulation to become to date the biggest and most advanced pharmaceutical grand market globally with about 45 tons dispensed yearly. Of the latest INCB U.S. guidance, the Israeli Ministry of Health is expecting major growth of the market in 2023 to 85 tons up from 49 tons in 2022, marking expected growth of over 70%, assuming this reform implemented. While favorable regulatory cannabis reforms are on the horizon in Israel, Germany and many other markets, we expect our growth journey to continue as we remain focused and committed to expand our leading platform, building shareholder value and improving quality of life for patient, communities across the world. During 2022 we continued to expand our vertically integrated platform, we scaled up our cultivation production facilities, expanded our logistical capacity and added eight new locations to our leading medical cannabis dedicated pharmacy chain, exiting the year with an industry leading platform of 28 locations, out of which 20 are actively dispensing medical cannabis and for the first time, two international locations. We also reported another record fourth quarter revenue of $41 million or NIS106 million, an impressive growth over 30% greater than the fourth quarter of 2021 revenue of $31 million or NIS80 million and up by 6% sequentially compared to the third quarter of 2022. We expect 2023 CapEx will be at least 50% lower than 2022 and we mainly focus on our global expansion as we expect launching our branded product in Germany, UK and other territories and continue development of our leading medical cannabis dedicated pharmacy chain to about 35 locations. And yes, we believe that once medical cannabis products in high quality will be offered in the UK market in decent prices, of course, comparing to the local market conditions, we will obtain a good market share and eventually, the market will grow because of the same trends that we've seen in Israel in the early days."
}