{
    "symbol": "GFL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 13:15:02",
    "content": " To mitigate our current fuel and other cost recovery gap, we can pursue incremental open market pricing and realize 7.3% price in the quarter, a 90 basis point sequential increase over Q1 and approximately 175 basis points better than our original plan. As Patrick mentioned, the unexpected severity and duration of rising fuel prices, coupled with additional costs associated with labor shortages and supply chain disruptions more than offset our pricing strategies and yielded margins 50 to 75 basis points lower than our original plan of low 27s or 130 basis points lower than the prior year. Partially offsetting this decrease was just over $20 million from fuel surcharges and just over $10 million from the combined impact of higher selling prices for our used motor oil and the benefit of financial fuel hedges, resulting in a net margin impact of 100 â\u0080\u0093 approximately 100 basis points from direct fuel alone. So while weâ\u0080\u0099re going to need the second half of the year to play out before we can actually articulate what 2023 will look like exactly, I think there is a real path that by that point when weâ\u0080\u0099re talking about 2023, we have all that covered and then some, and therefore have the opportunity for returning to our margin expansion path from price in excess of cost. Maybe just a second one from me, just wondering the way you look at M&A change at all just given the current environment, whether itâ\u0080\u0099s the impact of inflation on the businesses youâ\u0080\u0099re buying, how they have been pricing, maybe thatâ\u0080\u0099s been a little bit more challenged in terms of their ability to cover costs and you got to go out and get it. But at the end of the day, if you look for the year as a whole, the new guidance we are putting out, direct fuel costs alone are suggesting our solid waste business like a 100 basis point margin drag. So, on the first question, the outperformance in environmental services, here about $8 million to $9 million you are picking up in incremental used motor oil pricing, which we have factored into our broader fuel cost impact because we think of that as a natural sort of hedge to the rising fuel prices."
}