{
    "symbol": "GFL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 00:50:05",
    "content": " Adjusted free cash flow for the year was $691 million, more than the high end of our updated guidance range and more than 8% above our original guidance despite the significant headwind from fuel prices and interest rates that have rose subsequent to the beginning of the year. At the segment level, Solid Waste margins are expected to sequentially improve over 100 basis points versus Q4, and ES margins -- Environmental Services margins are expected to be in the high-teens with corporate costs at sort of 3% to 5% of revenue. And in the upside potential for additional contribution for our demonstrated ability to do highly-accretive densifying tuck-in M&A, bringing our RNG projects online in 2024 and 2025 and the impact of these asset divestitures I just described, we think there is a clear path to achieving our best-in-class EBITDA margins and driving materially higher free cash flow and generate free cash flow of over $1.1 billion by 2025. And I think from our perspective, driving the organic growth layering in these pricing initiatives into the sort of base business, letting the business of time to sort of just seize them a little bit, get our procurement programs, making sure they're all rationalized and spending the year to do that is going to lead to outsized organic growth. So -- and I think all of that put together will position this business like Luke said, to grow at more than 20% plus free cash flow growth over the next sort of three to four years on an annual basis by putting in place all those pieces of the puzzle. Michael, please go ahead. If you were going to come in that light than maybe you would have been a little bit more aggressive and been able to make that $640 million something a little bit better in 2022, but you're thinking about that exactly right, Michael. As we said, we are anticipating incremental investment, primarily around IT-related costs in the corporate segment, and that's going to see an incremental sort of $30 million, $45 million spend in the year as we sort of bolster our sort of transition to the cloud and all the sort of securities associated with that. So you're going to see expecting that corporate cost bucket in that sort of 325 basis points, 330 basis points of revenue, which is somewhat offsetting that very strong organic EBITDA margin expansion in both solid and liquid M&A, I mean the rollover in fact, 3.5% to 4% top line. We think that business, if you look at the comps, like rolled and others and what it's worth sort of private equity and the value creation opportunity from an M&A perspective, we think those businesses conservatively trade for somewhere between 11 times and 12 times which would roughly put that at around $3.5 billion of enterprise value. So there was a lot of pent-up demand as well -- but when I think you look at that business and you look at the scale we now have in Canada, the facilities we now own in Canada and what that's able to do in the service offerings, we're able to offer our customers and being able to sort of leverage that and leverage that fixed cost base of facilities, push price, et cetera. Michael, please go ahead. But I think Patrick articulated in the prepared remarks, when we're going out to 2025, we don't see a path that is less than sort of $1.1 billion of free cash flow at approaching mid-40s free cash flow conversion and continue to have opportunity to go up from there. But I think where we sort of sit today, it will be a very similar margin business to our Solid Waste business, and it's going to be as good or better with the free cash flow contributor."
}