{
    "symbol": "GOGO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 15:23:07",
    "content": " In the first quarter, Gogo delivered record top line revenue of nearly $93 million, up 26% year-over-year, fueled by strong service and equipment revenue. We've also seen these trends play out in rate plans as more than twice as many customers upgraded plans, has downgraded plans in the quarter, driving an 8% year-over-year increase in Gogo's first quarter ARPU. On the earnings front, despite this being an investment year, we showed nice growth in Q1, delivering adjusted EBITDA of $42.8 million, an increase of 26% over Q1 2021, driven by an increase in service revenue and gross profit. At this point, we're not raising our adjusted EBITDA guidance range of $150 million to $160 million, but we now expect to be at the high end of that range, and I would note that our new guidance includes an estimated $5 million of legal fees in Q3 related to our patent litigation with SmartSky networks. We achieved record service revenue of $70.7 million, driven by an increase in ATG units online of 11% year-over-year and 2% sequentially. Gogo delivered $22.1 million in equipment revenue, a remarkable 52% increase year-over-year with high demand for our AVANCE L3 and L5 products. To reiterate our expectations for Gogo 5G operating expenses in 2022, we have budgeted an increase of approximately $13 million versus 2021, which includes external development and deployment costs, as well as additional 5G-related investments in marketing, production operations and network costs. Gogo's adjusted EBITDA increased 26% year-over-year to $42.8 million, primarily driven by a 19% increase in service revenue. Our first quarter free cash flow declined from the prior year period, due to a change in the timing of our interest payments, following our refinancing last year, as well as higher CapEx and the use of net working capital, driven by a change in accounts receivable and increased inventory purchases due to increased demand. We also expect to achieve full year adjusted EBITDA at the high-end of our previously announced $150 million to $160 million range, reflecting the planned increase in our 5G investment this year and also factoring in $5 million for estimated legal expenses related to the SmartSky patent litigation. In addition to raising our guidance for both revenue and adjusted EBITDA, we raised the low-end of our previously guided range for free cash flow in 2022 by $10 million and now expect it to be in the range of $35 million to $45 million. And as we said for a number of quarters now, we're -- we think about this in the sequential priorities of getting 5G Jen, getting the leverage where it needs to be investing in ways that's going to enhance the value of the business like with Gogo broadband and then returning capital to shareholders. So if I think about the free cash flow guidance in the long-term targets, which you have at 125 in 2023, getting to over $200 million by 2025, Essentially, that's all coming from underlying base business EBITDA growth, essentially CapEx is relatively flattish once you get past 5G."
}