{
    "symbol": "GOGO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 12:46:04",
    "content": " Combining these capabilities with the fact that we're able to still generate strong cash flow even in network upgrade cycles, like 5G, and combine that with Gogo's huge market opportunity, 30,000 out of the roughly 40,000 business aircraft around the globe today still have no connectivity. In my remarks today, I'll start by walking through Gogo's second quarter financial performance, then I'll provide an update on our capital allocation priorities, and finally, I'll finish up with some additional context around our updated 2022 financial guidance and long-term targets, which now reflect our expectations for our global broadband initiatives. As a reminder, ATG ARPU in the second quarter of 2021, benefited from the recognition of $1.8 million in deferred revenue related to a customer contract; excluding the impact of this deferred revenue, our second quarter 2022 ARPU increased 4% year-over-year, demonstrating the increased utilization of our services by our customers. Now turning to equipment revenue, Gogo delivered $24.8 million in equipment revenue in the second quarter, a 41% increase year-over-year as we shipped a record 310 advanced units. We delivered strong service margins of 78.4% in the second quarter, a two percentage point increase year-over-year driven by higher margin ATG service revenue and 1% decrease sequentially due to an expected increase in network costs. Moving now to operating expenses, second quarter combined engineering design and development sales and marketing and general administrative expenses increased 27% year-over-year to $29.4 million. Moving on to profitability; Gogo's adjusted EBITDA increased 12% year-over-year to $41.2 million, primarily driven by a 13% increase in service revenue. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Just on the Global broadband and the 17% revenue guide, can you just share what specific unit sales expectations you have for the '25 and '26 that are driving the 17% and Hughes yesterday, I think indicated $170 million revenue that are payments that you've agreed to with them covered about 2,000 of the antenna units. But what I would say is that the market share projections that we have underlying the revenue, we believe are very conservative, when we look at the overall size of the market and our ability to penetrate that, we have disclosed $170 million in commitments that we've made to use, we have not disclosed the units associated with that, but again, we're comfortable with that level of commitment, it's over a long period of time."
}