{
    "symbol": "GOGO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 15:45:28",
    "content": " We delivered record third quarter revenue of over $105 million, up nearly 21% over prior year, fueled by outstanding service and equipment revenue growth. And the bottom line, Gogo delivered record third quarter adjusted EBITDA of $43.7 million, up 7% year-over-year, driven predominantly by growth in service and equipment revenue. Consistent usage increases are driving customers to upgrade to Gogo's higher rate plans at a ratio of about two upgrades for every downgrade, which drove ARPU to $3,376 per month, up $112 or 3.4% from prior year. The market remains very excited about our 5G product as it will deliver roughly â\u0080\u0093 speeds roughly five to 10 times faster than Gogo's current ATG network, with peak speeds up to 30 times faster, enabling multiple streaming sessions and video conferencing applications to be opened at the same time on the same aircraft and all at a lower cost than competing LEO or GEO satellite solutions. To wrap up our key strategic initiatives driving AVANCE penetration, launching Gogo 5G and developing global broadband are in service of our long-term strategy, deepening and expanding Gogo's hard earned competitive advantages to support our long-term growth. Gogo delivered a record $30.1 million in equipment revenue in the third quarter, a 43% increase year-over-year as we shipped a record 388 AVANCE units. Gogo delivered service margins of 77% in the third quarter, a 3% decrease year-over-year, primarily due to the $2 million catch up credit for Federal Universal Service Fund regulatory surcharges reported in Q3 2021. Gogoâ\u0080\u0099s third quarter adjusted EBITDA increased 7% year-over-year to $43.7 million, primarily driven by our record equipment sales. In the third quarter, we generated $8.5 million in free cash flow down 65% year-over-year driven by the expected increase in CapEx for Gogo 5G. This increase reflects a $5 million reduction in operating expenses associated with delay in the commercial launch of Gogo 5G, but it also includes a combined $6 million in expenses related to the SmartSky litigation and Global Broadband, which were not included in our original 2022 guidance. We are raising our 2022 free cash flow guidance to range of $50 million to $60 million versus prior guidance of $35 million to $45 million, due primarily to a $10 million reduction in 5G spending. Looking further into the future, our 2024 free cash flow will reflect ramp spending for our Gogo, GBB project of approximately $35 million in that year as I mentioned. We continue to expect to generate free cash flow of over $200 million beginning in 2025 as we get on the other side of our investments in Gogo 5G, and GBB with our long term growth rate elevated by our GBB product offering. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Yes, just to clarify the point about the $13 million increase, that's an annual cash interest expense that is between now â\u0080\u0093 that is the 2026, so it goes from the $37 million today to $50 million based on the forward curve as of October."
}