{
    "symbol": "XNCR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 23:36:10",
    "content": " So the rest of today's comments will be presenting the top line data from the Phase 1 study for XmAb564, our reduced potency cytokine targeting regulatory T-cells, with the goal of treating autoimmune disease. It's a single ascending dose study in healthy volunteers that showed subcutaneous XmAb564 is well-tolerated and selectively expanded regulatory T-cells starting at lower doses and reaching the highest reported levels we're aware of at the high dose, particularly notable was the exceptional durability we observed with the highest levels of T- regs after 3 weeks that were aware of being reported. Last year, we reported data from the Phase 1 study of XmAb306, our reduced potency ILD-fusion in oncology, where we also saw expansion of target cells, in that case, NK cells and notably significant accumulation of NK cells upon repeat dosing across a range of dose levels. Then most notably on this plot, you see -- starting with Cohort 3 in the dash green line and at higher doses, a very robust expansion of this Treg population, with a strikingly high level of expansion for Cohort 6 in magenta, peaking at about 150 cells per microliter. To sum up, the Phase 1a study of XmAb564 shows that a single dose was tolerable and gave a large and selective increases in T cell populations, which max or exceed previously recorded engineered IL-2 programs with particularly notable durability of these increases in our high dose groups. We've already started our Phase 1b multiple ascending dose study in atopic dermatitis and psoriasis, having recently dosed the first patient, and we'll use it to explore multi-dose safety and also assess the potential for multiweek dosing intervals by assessing T cell populations as well as looking at disease modifying activity. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question. I think there's the ample data from the historic use of low-dose IL-2 that I believe increased Treg counts bulk Treg, total Tregs, on the order of about two-fold, maybe a touch higher. Then the other bucket we have is the data we referred to from a competitor data of a Pegylated IL-2 presented in September at the EADV conference in both psoriasis and atopic dermatitis -- where multi-dose study, relatively short, I believe, 12-week treatment showed that when you increase the CD25 bright around to about 40 to 50 -- I think more like 40 cells per microliter absolute and no Baseline, you're talking 0 to 3 or 4 cells, right. One moment for our next question. One moment for our next question. One moment for our next question. Now going back to the variability question, we have a lot of confidence in the data, even though it's relatively small numbers, six patients on study drug for the -- in the SAD study because of the consistency across multiple measures, in particular, looking at Treg/Tcon ratios that don't involve that baseline variability when you look at fold measurements as well as the consistency, I'm just looking at absolute Treg counts, right, the real data, not the full data. One moment for our next question. One moment for our next question. And even with the full changes -- and I think in particular, you should consider -- as John said earlier in the call, dose response curve we saw in vitro -- now that we're seeing concentrations that are starting to climb up that curve at the top two doses, you're seeing that uplift pretty much mirrored. One moment for our next question."
}