{
    "symbol": "TRTN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 12:25:12",
    "content": " And so we don't, we're not trying to give the impression that we're going to toggle very quickly back to where sale gains had been in 2019, for example, but we do think that we will continue to see some decrease in sale prices following the decrease as we've seen in new building prices and following just the kind of the easing of the extreme container shortage that we saw 2021 even though containers still remain pretty tight. We've been trying to communicate the structural improvements that we've made to our business through our lease portfolio and refinancing activity, the shift that's occurred over the last, really five or seven years that has boosted our relative strength through a merger and really created significant capability and cost gaps between us and our competitors, as well as just the structural things that have improved in the industry around credit, and the real focus on leasing for most of our customers. And so, I mean, 60% is a lot like it can't promise it's going to go up too much further from there, just given the mix of containers in our fleet, in terms of the ages, but we do think it's something that's become a feature of the business, and certainly a feature of how we work with our customers, that we think that number is going to stay pretty high. So I mean right now, the market rate for new containers and for used lease containers that we're leasing out currently are significantly higher than the average rates in our portfolio, and also higher than the rates on leases that are expiring over the next four or five years. And we're always doing it's actually quite easy on these lifecycle leases to sort of understand the tradeoff of rate and duration because it's the last lease and so if we can get the customer to keep it until you're 16 or in some cases even you're 17 or longer, that actually has a lot of value, perhaps more value than raising rates on a contract that might expire when it's 13 or 14. But we're still going to be -- we think, at levels of profitability that are really quite exceptional with very high profitability relative for history, very high returns on equity, and getting maybe back to Michael's question early on to a very low multiples, relative to our share price."
}