{
    "symbol": "MAXN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 23:00:29",
    "content": " Secondly, we started volume shipments of our bifacial Performance Line panels into the U.S. from our Mexicali Modco, with the contracted backlog of over 3-gigawatt for deliveries extending out through 2024, we are solidly booked out in our U. S. utility scale business and are looking at opportunities for locking in longer-term supply contracts for 2025 and beyond. And since the end of the quarter, we strengthened our balance sheet with a $207 million convertible bond that will allow Maxeon to pursue deployment of Maxeon 7 and Fab 4 in our Ensenada Modco as well as make further investments into other products and offerings such as Performance Line and Beyond the Panel. In 2023, our first full year with full Maxeon 6 production, we project that our DG business will contribute gross margins of more than 20% by year's end. The sequential improvement is driven by a higher mix of Maxeon6, further ASP increases in DG markets to offset historical unfavorable supply chain cost development and improved output from the initial U.S. utility scale lines. Around this expansion effort that you guys target in the U.S., if you could give any clarity as far as the timing that you might expect as well as the credits that you would think that you're eligible for, I know that there's a lot to unpack between some PTCs as well as possible as possible ITCs for some of these solar panel or manufacturing for some of these solar panel or manufacturing clarify on that timing as well as the credit availability. And then as we are going into 2023, we see further tailwinds there on the U.S. power plant side as we shipping the higher price later bookings for capacity as well as starting to fully utilize that capacity overtime in 2023 and on the DG side of the business, we would expect more shippings also from HSPV P-Series into the various DG markets, which are really, really strong markets right now in the foreseeable future as you know. Your line is open. I would say, when it comes to third-party verification, I think one of the things that certainly sets us apart is that when we talk about efficiencies that we're achieving, it is on cells that are going into hundreds of thousands of cells per day type volumes, it's not something that we're doing in the laboratory, I think we've established credibility over the decades in us being able to when we talk about our efficiencies and performance, we're achieving that it really is something that will be at the at the production level. Your line is open. In terms of the amount of volume that we could forecast, that's not something that we're going to be talking about publicly about the kind of volume we could free up, what I will say is that we are looking at doing a variety of things to I would say kind of re-partitioner or redistribute supply that we have from maybe other markets that are less margin attractive, and to funnel them into the U.S. Your line is open. Your line is open. And while you're ramping factories, you've even seen it with our own the factories that we've ramped up for the Performance Series product for the U.S. And let's say, as that business scales, it's getting more and more cost competitive because it's getting more economies of scale. Your line is open."
}