{
    "symbol": "MAXN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-27 00:22:09",
    "content": " Adjusted EBITDA for the first quarter was negative $33.6 million, down slightly sequentially and at the low end of our guidance range, mainly due to charges for ancillary polysilicon sales which were elevated as a result of the previously mentioned opportunistic and cash accretive sales of all excess polysilicon remaining under this contract. This will be the first quarter that includes revenue from our U.S. Utility-Scale business, a new market for Maxeon where we expect to achieve price premiums for the foreseeable future attributable to our technology, customer focus, and who we are as a company. We project shipments in the range of 460 megawatts to 490 megawatts, a largely flat volume quarter as we see the first containers of U.S. Utility-Scale panels offsetting a slight sequential decline in IBC DG due in part to the end of life transition of Maxeon 5 to Maxeon 6. Out-of-market polysilicon charges are projected to be $3 million to $4 million in the second quarter, a significantly lower level as spot prices are now closer to the legacy contract terms and we see no further ancillary sales until the contract expires in the end of this year. Your line is open. Your line is open. And certainly the ramp of the Performance Series U.S. product is a great example where the financial output from that in this quarter and in Q2 is pretty rough, just as you're ramping up that factory, but this is what's going to pay dividends for us as we get into the back half of '22 and then into '23 and beyond. Again, as a company that doesn't walk away from contracts, this is really a big for us, because it allows us to keep those great customer relationships, but allows us also to help hedge better what goes on with the pricing on the Utility-Scale market for the U.S., along with what we've already done with some of the key input costs. Your line is open. Your line is open. Your line is open. Your line is open."
}