{
    "symbol": "PG",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-19 10:13:05",
    "content": " Yes, as you stated in your question, we seeing global value share and value share in the US holding, which is a great signal to our strategies working of providing value to consumers via innovation, as we price contribution of 9% on the quarter, with volume being down 3%, but the majority of that volume, so more than two points actually driven by Russia. In terms of volume elasticity in my earlier remarks, as I said, we feel very encouraged by the fact that we were able to realize 9% of pricing in organic sales growth and effectively only see about a point of reduction in volume, which speaks to favorable elasticities speaks to our strategy working and providing consumers value with innovation even as we take pricing. When you look at the consumer side and the market side, obviously, we see high pressure on the European consumer, with high inflation and certainly, as the energy costs will hit the consumer over the winter period, depending on how much support from the European governments provided and when we need to be extra careful in terms of ensuring that consumers have appropriate access to our portfolio, making sure that we give the right value to them via superiority, strong innovation, the right price letter the right value tier offerings. Maybe just comment now, again, building on Nik's question, is 3% to 4% still what's underpinning your outlook and maybe you can share for key regions, US enterprise markets, et cetera, what you observed for category growth rates in the first quarter as we think about the balance of the year. On the enterprise market side, same dynamic as in the rest of the world, we continue to see strong contribution from pricing, obviously, and the combination of us taking pricing, but driving innovation and priority at the same time, allows us to drive strong organic sales growth. 7% organic sales growth against the context of Russia, Ukraine, what's happened in China where the market is down mid-singles, that is truly a fantastic work; communicating the value of our offerings, improving the value of our offerings as we take necessary pricing, maintaining topline momentum of the business, great work."
}