{
    "symbol": "FDX",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-23 06:29:05",
    "content": " 11:54 In the first quarter of fiscal year twenty two, FedEx total U.S. domestic residential package volume mix was fifty seven percent versus sixty two percent a year ago. An additional one hundred and thirty five million dollars in a healthcare costs  lower utilization a year ago, eighty five million dollars related to investments in the Ground network, which represents the cost of bringing online sixteen new automated facilities and expansions at a hundred facilities which are critical to improving service and adding capacity to meet growth for peak and beyond. Our capital forecast for fiscal twenty two remains at seven point two billion dollars and less than eight percent of anticipated revenue and includes following key elements: First, more than fifty percent increase in capital spending at Ground year over year for capacity expansion and new facilities to capture opportunities from growing e-commerce business. Your line is open. Your line is open. Your line is open. Your line is open. 37:25 Ravi, you broke up some there, but I there was a reference to some of these items being non-operational in the second half, I guess maybe I'd turn it around the other way and say if we were fully…\n Sorry if I can try again, if I stop , I was wondering if you could get us a little bit more detail into why you think second half is going to be materially better than the first half because some of the items you quantified, the yield contribution, the variable comp etcetera, those seem kind of non-operational almost one-time  nature kind of, so again, do you really feel like the top line could accelerate, the volumes are going to accelerate and the reason I’m asking this question is because you basically cut your full year guidance by approximately the magnitude of the first quarter miss, which does not seem to imply that you are expecting the labor cost  (ph) to continue for the rest of the year? Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}