{
    "symbol": "MRTX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 23:29:03",
    "content": " Securing a U.S. approval and executing a commercial launch of adagrasib in the second-line non-small cell lung cancer setting is a key priority for the company, but it is also just the beginning of the full potential of where we believe this investigational product can help patients. In first-line non-small cell lung cancer, we continue to explore adagrasib monotherapy in certain underserved subpopulations, including patients harboring KRAS G12C and STK11 COMI patients as well as KRAS G12C mutated patients with TPS scores of less than 1%. Also in first-line non-small cell lung cancer patients, we are aggressively exploring adagrasib in combination trials with a focus on the combination with pembrolizumab. This adagrasib plus pembrolizumab combination, which is using 400-milligram BID dose of adagrasib with full dose pembrolizumab, in the Phase 2K Cristal VII study is enrolling well with strong interest from both patients and physicians. Based on the results from Cristal VII, we plan to initiate a Phase 3 trial evaluating the combination of adagrasib and pembrolizumab in first-line non-small cell lung cancer patients later this year. As David mentioned, we recently completed enrollment in the Phase 3 SAPPHIRE trial, which is being conducted in patients with second- or third-line non-small cell lung cancer who have derived prior clinical benefit following treatment with a checkpoint inhibitor. So yes, we're going to have - in the second half of the year, we were planning to present the data fully for those patients with an emphasis on the 400 milligrams because that's our - as we've indicated, that's our go-forward dose. I mean regarding the adagrasib , I think you are familiar with what we've shown in pancreatic cancers and then also other GI solid tumors, and we've seen what I would call as response rates that were compelling with early signs of the type of durability that would be associated with that tumor-agnostic approval. And the read-through from adagrasib is that we have been able to see activity, particularly in combination with cetuximab in patients with third line plus heavily pretreated colon cancer and the response rates and durability hold up with response rates over 40%."
}