{
    "symbol": "MRTX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 22:27:03",
    "content": " Additionally, the data we presented at ASCO demonstrated that adagrasib has significant activity in patients with central nervous system metastasis, including those with active and untreated CNS metastases, which is estimated to occur in approximately 40% of KRAS G12C patients. Let's begin with ESMO, where we shared positive results from KRYSTAL-1, evaluating adagrasib as a monotherapy and in combination with cetuximab in people with previously treated KRAS G12C mutated metastatic colorectal cancer or CRC in the third or later lines of therapy. We also have a Phase III registrational study on-going in second-line colorectal cancer patients called KRYSTAL-10, which is comparing the efficacy of adagrasib in combination with cetuximab versus standard of care chemotherapy. I'll now discuss KRYSTAL-12, our randomized Phase III confirmatory study in previously treated non-small cell lung cancer patients with a KRAS G12C mutation, which is enrolling well worldwide. As a reminder, adagrasib's Phase II registrational study, Cohort A, was conducted in a heavily pre-treated patient population with 98% of patients having received both prior chemotherapy and checkpoint inhibitor therapy. Based on the clinical data we've shared to date and our expectation for KRYSTAL-12, we believe adagrasib will have a strongly differentiated profile in lung cancer, with best-in-class objective response rates, overall survival and penetration of the central nervous system, or CNS. First, we entered into a clinical collaboration with Aadi Bioscience to evaluate the combination of adagrasib with nab-sirolimus in people with advanced non-small cell lung cancer and other solid tumors harboring a KRAS G12C mutation. We really look forward to having that conversation in four weeks at ESMO IO because it's all -- that's certainly part of our multipronged approach to investigating in the frontline setting, where we see a tremendous opportunity potential for adagrasib."
}