{
    "symbol": "TPB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:35:12",
    "content": " On that presentation if you turn to slide two, our disclaimers, during this call, we will discuss our consolidated and segment operating results and provide a perspective on our progress against our strategic plan. As is customary, I'd direct your attention to the discussion of forward-looking and cautionary statements in today's press release and the risk factors in our filings with the SEC. Meanwhile, NewGen navigated an expected decline in sales resulting from the PACT Act as the regulatory environment. While this is all in the first step of a long journey, I'm encouraged by the fact that we did all of that that needed to be done while still delivering a strong quarter. With regard to our product portfolio, we aim to file new application for a number of non-tobacco nicotine offerings including our free nicotine pouch products and we are evaluating spending up to $10 million on PMTA applications throughout the year with a heavy focus on modern oral. On capital allocation, we continue to buy back shares during the quarter after receiving increased authorization from our Board. Practically, all remaining cash flow will be directed toward buybacks so long as the shares remain priced attractively. However, to reiterate from the previous call, our intent is to be patient and do deals that leverage our brand and distribution expertise, and we will – and will be value-accretive to shareholders. Any large-scale transaction we pursue will be synergistic and thus leverage an existing assets, including our distribution network to drive shareholder value. We may also pursue smaller tuck-in acquisitions that deliver capability to service our existing business that, we prefer to acquire rather than build organically. We recently announced the hiring of a new CMO Summer Frein, who brings extensive consumer products industry experience and we're excited about what she and our marketing team can do to further build our brands. In addition, we have also brought on a Chief Information Officer to oversee our technology systems, including our ERP implementation and a Chief People Officer to support our organizational infrastructure. Starting with our consolidated results on slide 4, Q1 sales were down 6.3% to $100.9 million with strong Zig-Zag and Stoker's growth, offset by double digit decline in NewGen, which is impacted by the regulatory environment including the PACT Act. Adjusted gross margin increased 180 basis points driven by improvement in Stoker's gross margin along with the mixed benefits from increase in sales in our higher margin Zig-Zag and Stoker's segments and decline in lower margin in NewGen sales. Adjusted EBITDA was down $2.7 million year-over-year, with the decrease coming from the expected decline in our vape distribution business. Sales grew 11.4% year-over-year to $45.7 million, with 7.1% from volume and 4.3% on price mix. Warps revenue was down 3% year-over-year, due to an industry decline in HDL wraps category offset by growth and natural leaf and hemp wrap. We believe that, trade was building up inventory in the first half of last year in HDL wrap and is now working its inventory for more normalized levels. Partially, offsetting business was a ramped up the Zig-Zag natural leaf and hemp wraps during the quarter, which collectively accounted for double digit percentage for wraps sales during the quarter. As a reminder, in our second quarter, we will have a tough comparable as last year's second quarter benefited from $2 million of pull forward of sales into the quarter. Our US Papers and e-commerce business was up 41% year-over-year driven by growth in e-commerce and paper cone sales, as well as the planned $2 million inventory build during customers. E-commerce was up 2.6 times and now represent 21% of the sub segments, with strong growth expected the rest of the year. Sales of cones products, was up 78% including over 4.4 times in our E-commerce channel and is now 25% of the sub segment. Zig-Zag remains the number one premium and overall paper brand in the MSAi measured market with 33.3% share, which was up 30 basis points year-over-year. Cones continues to remains large opportunity with only one-third of the world receiving paper products, also receiving cones during the quarter in the measured market. Overall, the paper category saw decline in MSAi down 3.5% during the quarter. Canada was down 13% during the quarter, this expected decline was primarily due to the timing of orders from our third-party distributor last year, when we delivered our half of our sales for the full year in Q1 creating a sub comp. TPB Canada, which is the old recreation marketing business continue to perform well and grew double-digits organically. The cigars and other subcategories grew 17% with growth in our cigars business and the addition of $22 million of wild hemp sales, previously recognized NewGen. Following the launch of Zig-Zag Studio late last year, we recently launched a partnership with luxury fashion line AMIRI for Spring 2022 collection which is now available for purchase in stores like Zags and Bergdorf Goodman. The fundamental long-term drivers for this segment remains intact, as cannabis continues to gain mainstream acceptance and new states come on board and legal recreational sales including New Jersey last week. Net sales for the MST portfolio grew at 11% and represented 65% of Stoker's revenue this quarter, up from 63% a year earlier. Category volume was down 5.6%, while we were up 0.9% as our share grew 40 basis points to 5.7% during the quarter according to MSAi. Our shares in store selling was up 30 basis points to 9.0% with Stoker's now in stores representing 63% of industry volume, which still provides a long runway for our growth. Despite the softening in the industry demand within the tobacco industry in general during the quarter, Stoker's performed as well as its value proposition products resonated well with consumers, especially in the current inflationary environment. Segment growth margin is expanded by 150 basis points to 55.8% during the quarter, driven by price and incremental margin from our higher MSP volume. Operating margin increased 70 basis points with the higher gross margin from Stoker's sales partially offset, but the higher sales and marketing costs increased and increased shipping costs. NewGen result this quarter are now a cleaner representation of our vape business which remain profitable, despite the challenging environment. Ultimately, we still believe that all the short-term challenges present an opportunity for us in the long term given our size and our ability to navigate the regulatory environment. As mentioned in the press release, we are maintaining our previous guidance as communicated in the Q4 earnings call. In addition as Yavor mentioned, we are also projecting up to $10 million of PMTA expense which includes filing for additional products including our free nicotine patch. We are evaluating spending up to $20 million for the entire year, excluding the ERP project, with the increase as attributable to $9 million from a manufacturing automation project that we started last year and $8 million from a potential warehouse consolidation in automation projects that we are evaluating. I was just wondering, if you could just expand a bit more on the inflation cost that you guys are seeing, I see that, you called out some higher freight costs. But just if you could give us a sense of what you're seeing from an inflation perspective and your ability to pass that on, that'd be great. I mean, shipping is one of our larger variable costs, especially in our NewGen segment. So our shipping costs, the percentage within that segment was up over 300 basis points year-over-year, in, what I would call, our Zig-Zag as products traditional channel, our shipping costs were up a little bit, but not to the extent that we saw in our in our NewGen segment. Yes, we're not immune obviously to the labor pressure and that everyone else is feelings, but we are kind of seeing that. And so, we're seeing it like everyone else is. I mean, the way I kind of see it, sort of, adding this penetration into the alternative channel and a bit of a revenue synergies the other way around as well. Yes, I mean, we mentioned that CLIPPER in the US-Canada is about -- lighter margin is about $500 million from a manufacturer revenue standpoint. There's going to be a transition period, as there are distributors that we are transitioning from, so we're a little bit cautious in terms of how we're protecting it, but long term it is a large opportunity for us, given the size of the market and given CLIPPER success in other markets where they've gained number one share \n Okay, great. Look, one area where we’re different from most of CPG companies is, our consumer shows up immediately after visiting the gas pump and there was a significant price shock on the consumer, which was so late in the quarter, late in Q1 and we've seen reverberate a bit into April. But the net result is, you have a consumer who is now spending a lot more at the gas pump, which, by definition means, there's a lot left to spend when they hit convenient store. And what we've seen from a behavior perspective, as people are shifting one toward the cheaper price points, which benefits us. Obviously, we are the value brand and you saw that we're gaining share, we have continued to gain share throughout the quarter. At the same time the consumer has less money to spend, so you're seeing some trading away from pops and more towards cans because the can is obviously a lower price point even though it's more expensive and on a weight basis. Not sure, if that's helpful, but the pressure -- we're not at this point, it's too early to tell. And I think Vivien, I mean, I do a category is generally inelastic, but it's not immune to short term temporary shock. Yeah, which dovetails perfectly into the follow-up which if our math is correct you guys realized a very healthy 8.1 point benefit from price-mix realization in the Stoker's segment in the quarter obviously pricing where you guys are not the price leader, but pricing from a category perspective has been incredibly healthy. So, all else equal not talking about future price increases, but really maybe just remind us for the price increases that have already been implemented in the marketplace, like how does that flow through the next three quarters of the year. On top of that, we are continuing to introduce new products into the market so cigars, is a big opportunity for us. It's a very, consolidated market so it would not be easy but we started with the introduction of our rough cut natural leaf cigar product Q1 which we are excited about. And on top of that, there's other new product launches, natural leaf continues to ramp up hemp wrap continues to ramp up we're going to launch other products like palm leaf sometime later this year into next year. And I guess just to follow up on the Zig-Zag, I feel like is probably one of the most recognized smoking-related brands in the U.S. and you just said that partnership with Amuri , thoughts on, maybe licensing out the brand image or even expanding your apparel and collectable collections going forward? You should expect to continue to see that and we'll know a lot of it, because it's highly effective with of course the size of our competitors complementing it as long as it speaks for itself. So I think what they're doing in terms of, kind of, product development and partnership in general marketing has been beneficial for our brand. We have a lot on our plate, and as I mentioned both on the previous call and on this call, we view M&A as opportunistic and it's going to take time to actually find the right deal. Whether that's our distribution, which is obviously the most obvious thing or with some other asset that is unique to us that we bring to the table, the deal is going to be synergistic. And second is on this $10 million PMTA cost, which I don't recall were specified earlier and it is a decent amount of money. The parts where we spent the lion's share of the $10 million is our own proprietary products, which are going to be strictly modern oral. One of them is free obviously, and we have another product, which we have not discussed, I'd like to hold off on discussing it. We think it's very different, we like a lot we'll see how it works. And that's what the PMTA is meant to cover in terms of when we discuss it, now you are correct, we did not discuss it on the previous earnings call. In terms of overall spend, I can tell you that we had about $9 million in the budget, it went to $10 million as a result of the acceleration, but we've been working on the PMTA for quite some time and this is not something you can do in the rush, which is why it would be interesting to see what people file because we've been working on our PMTA for months and months. Sort of consistent with our philosophy the last year and a half or so, we've taken a very measured approach to approaching the marketplace with the products in terms of store identification and salesforce allocation of time. So, we thought that's encouraging and just to be clear I think our product is the only one that allows full step down from a higher level to a lower level. Obviously we had a very, very good quarter."
}