{
    "symbol": "CAMT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 12:06:02",
    "content": " I would like to welcome all of you to Camtek's Results, Zoom Webinar. If not, please view it on the company's website. With me today on the call, we have Mr. Rafi Amit, Camtek's CEO, Mr. Moshe Eisenberg, Camtek's CFO, and Mr. Ramy Langer, Camtek's COO. Following that, Rafi, Moshe, and Ramy will be able to take your questions. Before we begin, I would like to remind everyone that certain information provided on this call are internal company estimates unless otherwise specified. And with that, I'd now like to hand the call over to Rafi. Rafi, please go ahead. As we announced a few weeks a go, we started 2022 with strong  and with impressive flow of orders. Furthermore, despite the ongoing negative global geo -political environment, the company has received order of more than $150 million since the beginning of the year. And will be used for various application such as advanced interconnect packaging, including , compound semi, front-end CIS. The side effect of the COVID-19 continues to interrupt our business, as delivery times for material and parts, are still long. Border of some countries in Asia are still practically closed, and our field engineers cannot visit customers as often as they used to do in the past, or travel for advanced training in Israel. Most of the semiconductor industry in China is in the Shanghai area, thus lock down in Shanghai affect the whole industry. Parts are operating, but they do so at lower capacity than usual. All in all, the entire semiconductor manufacturing chain is disrupted due to look down in Shanghai, including ports and airports in this area. We are taking into consideration that there might be delays in installing machines at certain Chinese sites, but there will be catch-up. Our backlog is high and when taking into account our pipeline, we are at a better position than at the same time in 2021. Based on our current estimate, our guidance for Q2 is for continued growth in revenue to between $77 to $80 million. The highlight of Q1, advanced interconnect packaging continues to be our largest segment with heterogeneous integration becoming a significant portion. Specifically, we are cementing our position in the front-end and compound semi segment and shipping machines to existing and new customers. We shipped several systems for DRAM applications, and we predict additional system in the second quarter and second half of the year. We completed the development of new, important modules and feature that will open additional segments for us. This quarter, the U.S. and Europe accounted for 21% of our sales, versus 18% in the last quarter and 12% in Q1 of last year. I would like to hand over to Moshe for a more detailed discussion of the financial results, Moshe. In my financial summary ahead, I will provide the results on a non-GAAP basis, that reconciliation between GAAP results and the non-GAAP results appearing the tables at the end of the press release issued earlier today. An increase of 35% compared with the first quarter of 2021, a 4% compared with the previous quarter. Revenue was mainly driven by advanced packaging, which accounted for about 50% of sales and approximately a 20% contributions of compound semi. The geographic revenue split for the quarter was as follows: Asia, 79%, and U.S. and Europe together, 21%. As we mentioned on our last call, gross margin for the first quarter was relatively high, with 52%, the rest was 50.7% in the first quarter of last year, and 50.9% last quarter. Operating profit in the quarter was $22.2 million, or 28.8% margin, compared to the $15.6 million, or 27.2% reported in the first quarter of last year. Net income for the first quarter of 2022, was $21 million or $0.44 per diluted share. We used $0.4 million in cash from operation in the quarter due to timing of collection, which relates to the Chinese New Year. Also, increasing inventory levels and the tax payment, including for the settlement we have discussed last quarter. Total cash and cash equivalents and deposits as of March 31st, 2022 is $428.3 million, similar to the level we have reported at the end of 2021. As Rafi stated before, the business looks healthy. We received approximately $150 million of orders since the beginning of the year, and we feel good about meeting our plan for 2022 of mid-to-high teens growth year-over-year. And with that, Rafi, Ramy, and myself will be open to take your questions. If you have a question, please raise your hand on the platform. Maybe to start with, based on your disclosures, it looks like bookings this quarter in 2Q is tracking maybe around $40 million - ish, similar pace, I think to last quarter. With respect to the book-to-bill, obviously the first booking until today are higher than the revenue. So, our book-to-bill is greater than one, but I'm not sure that this implies that our revenue is in line with the bookings that we had until today. So basically, we don't expect -- we're expecting of some decline or some stabilization in booking in the coming quarters that will meet our annual revenue of mid-to-high teen growth. With respect to the profitability, we expect pretty much the same level of profitability in terms of gross margin in the coming quarters. And maybe just calibrating growth for the year, again, you're talking about mid-to-upper-teens overall revenue growth. Definitely there are disruptions, but I think, we have been able to learn how to manage and work in this environment. Moshe mentioned it, that we increased our inventories in order to be sure that we have enough inventory, even if we get a slightly different mix of orders. So, from that point of view, we feel comfortable that we will be able to supply all the requirements from the market. So definitely, we're running today, and we're going to see at the booking. And when we see at the mix of the products, we are about 50% of our business continues to be in the advanced packaging. It is healthy, and we mentioned that we got the orders for the DRAM segment. More specifically, the application is the high band with memory. So, it is in line with the area of growth that we see in the industry. So, from that point of view, we're definitely -- we feel very comfortable with the current forecast and the influx of the orders and the customers response. Now, compound semi is definitely strong, and I think we just saw in the previous, we were about 19% of our revenues for the quarter was for compound semi. It's a little high, CMOS image sensor came at 10%. But as we look at the focus, definitely it's going to be a healthy segment in this year. So overall from the mix point of view, we do not see any major changes. The areas that we're strong continue to be healthy and and so from that point of view, will feel very comfortable. Hey, guys, thanks for taking my question. Just the first one on gross margins, obviously in the supply environment, it seems like you guys are doing a good job of one, keeping inventory and two, being able to at least pass on some of these costs. And then you made a comment just on the first question there, that margin should stay at this level. Do you mean at the 52 level or do you mean within the range that you previously guided, which was 50.5 to 51.5? So, first of all, I think it's a good question about gross margin. I wanted to correct myself when I said we will maintain gross margin, I meant we will maintain the current range of 50.5% to 52%. Specifically, for the next couple of quarters, I would say gross margin will vary between 51% to 52%. With respect to actions that we're taking, we're definitely looking for more suppliers to make sure that we're not going to be dependent on one supplier. I think, Tom, what we were able to do is to find some sources in certain areas that actually reduced our cost. And in specific area of the machine bill of material, we were able to bring in significant cost that somewhat offsetted the rest of the -- obviously, there is an increase in the prices of the material we buy, but during to these changes, we were able to offset some of it. On the demand area, we are able to maintain ASP. But overall, we are maintaining a healthy leverage of prices to our customers. So, from that point of view, we are confident that we will be able to maintain the current level . The last couple of quarters you gave advanced packaging, compound semi, front-end, and then others. And then this quarter, you gave CIS separately. Advanced packaging, 48%, compound semi, 19%, front-end, around 13%. And then other, which is CIS, around 10%. I know you mentioned front-end was a little lower, but I just want to pro forma the disclosure there from the prior quarter. I think, in general, the numbers you mentioned are correct. As I said, it was a little lower than usual, but we do expect it to rise to more or less the same levels that we experienced last year. From that point of view, we don't see any weakness in this market segment, but your numbers are more or less accurate. You guys have talked about for the entire year, just being under $70 million or so in terms of OpEx. Tom, the current level of OpEx, which close to $70 million for the year, stayed the same. We're not changing anything, and we feel comfortable that this will be able to support the current level of business. Charles, you may go ahead and off your questions. Charles, you're on mute. Yes, we can hear you, Charles. Yes, we can hear you, Charles. So, thank you for the question, Charles. So, first of all, based on our current estimates and we went in very details when we made these estimates. So yes, we understand the issue with size, date, we looked at it and we are comfortable that our current guidance takes into consideration the current issues we're seeing in China. So, Charles, it's -- it's hard for me to just supply. But definitely, there is a significant number that goes to our dealings. But definitely, significant portion goes to IDMs. But when you look at the influx of the orders, it matches. And when I look forward, I take all the orders that we got, they're very evenly spread along the different applications that we have. And I think what we're seeing here, there are a number of things. First of all, there is a technological shift for these order takes. We see it in the orders we forecast for the second quarter and for the second half, for the third, for the rest of the year. So, the overall demand people making this strategic plan, we see it in the orders. But the overall business, as we see it, is very healthy. I think, your annual guidance implies, second half being flat or maybe slightly up relative to the first half. I'll tell you what's the good side, Charles, of what we are seeing. And I think if we, in our previous discussions, we were very hesitant from backlog and pipeline, looking at the second half. So, the good news that the backlog and the pipeline for the second half of the year is filling up, and overall, it looks good. I can tell you, that we're starting also to get orders for Q1 of '23. So, you can see a lot of confidence from our customers about the forecast. I think, at this stage, with all the volatility in the market, it's very hard to really say more, than we expect this year to be a growth year in the mid to high teens. I think, this is as much as we can say at this stage, but definitely, we're encouraged by the level of the backlog in the pipeline for the second half in the first quarter of '23. First of all, let's  the general  that yes, we hear about the weakness. We are aware off the weakness in the cell phone market, in the PC market, even in a multi-market is below its usual number. So definitely, we hear it and we understand it. On one side, you've seen I think I mentioned it may be your missed it. This is definitely an area that we dominate, and we're enjoying now. Although, the entire of the  market, maybe not increasing at this stage, but the technical -- technology change is bringing us business on one side. On the other side, the long-term plans of our customers, not just in China, across the world, the long-term are to invest. And definitely the area of the drums packaging is very strong, and this is not specifically - it's across the all the regions. It's not just specific to one area, definitely not only in China. So, the heterogeneous integration as Rafi mentioned in discreet is taking, and this is again, high-performance computing, that's definitely becoming a very significant part of advanced packaging. So, from that respect, we do not a feel a t this stage, the weakness the people are talking about, the end markets. Because China, the strategy of the government is to be more independent, so this depends on import component to China and expand their capacity and their ability to produce things in China. And if they really want to produce more made in China, they need to continue building more capacity in other area. So, I think this is also very important element. And how much, or if any of your tools are manufactured in the U.S. and shipped to China? And so, from that point of view, I think we feel very comfortable from the supply chain, the availability of parts that we will be able to ship all the machines that are forecasted. And I can tell you that the customers that are ordering the machine, in most cases, are actually very upset if we are delayed. To tell you what the actual utilization is, obviously, no one gives you these numbers. But we are very confident that those machines are not going just to fill a room in certain area of the world, they're going for reproduction, and people are using them. And -- no, it's for real. If there are any additional questions, please raise your hand on the platform. So, before I hand over to Rafi, I want to point out that in the coming hours, we will upload recording of this call to the Camtek Investor Relations website. Beyond that, the link for the live call will also automatically turn to recording in the coming hour. So, I would like to thank everybody for joining this call and I like to hand back to Rafi for your closing statements. Rafi, please go ahead. Again, I would like to thank all our employees and my management team for their tremendous performance."
}