{
    "symbol": "CAMT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 14:54:03",
    "content": " With me today on the call, we have Mr. Rafi Amit, Camtek's CEO; Mr. Moshe Eisenberg, Camtek's CFO; and Mr. Ramy Langer, Camtek's COO. Following that, Rafi, Moshe, and Ramy will be available to take your questions. Before we begin, I would like to remind everyone that certain information provided on this call are internal company estimates, unless otherwise specified. Statements on this call are made as of today and the company undertakes no obligation to update any of those forward-looking statements contains whether as a result of new information, future events changes and expectations or otherwise. Investors are reminded that these forward-looking statements are subject that these forward-looking statements are subject to risks and uncertainties that may cause actual events or results to differ materially from those projected, including as a result of the effects of general economic conditions. Risks related to the concentration of a significant portion of Camtekâ\u0080\u0099s expected business in certain countries, particularly China from which Camtek expects to generate a significant portion of its revenues for the foreseeable future. But also Taiwan and Korea, including the risks of deviations from our expectations regarding timing and size of orders from customers in these countries. Changing industry and market trends, reduced demand for services and products, the timely developments of new services and products, and their adoption by the market, increased competition in the industry and price reductions, as well as due to other risks and uncertainties identified in the company's filings with the SEC. In addition, during this call, certain non-GAAP financial measures will be discussed. These are used by management to make strategic decisions, forecast future events and results, and evaluate the company's current performance. And with that, I'd now like to hand the call over to Rafi Amit, Camtek CEO. Rafi, please go ahead. Fourth quarter revenues were a record of $82 billion, a 11% increased year-over-year. The total revenues for 2022 was a record of $321 million, 19% gross year-over-year. In the last two years, we more than doubled our revenues and tripled our operating profit. In 2022, we continued to expand our customer base. We now have over 250 active customers and we have added more than 50 new customers, so we expect them to contribute significantly to future revenues. We have managed to increase our business in the Heterogenous Integration segment which serve the high performance computing and in addition, it has partly been qualified for the next generation DRAM products. Last win, as reported a few weeks ago, was a Tier 1 manufacturer for an order totaling of $18 million for multiple machines to be installed in 2023 and 2024. In 2022, we have developed several new products and technologies which we plan to introduce in 2023. Looking at 2023, global economy growth is projected to slow down, thus affecting wafer fab equipment in general and specifically the memory segment. Also, regarding the new US restrictions on China semiconductor industry from a few months ago, we have yet to see how it influences the industry. After three years in which the entire production supply chain was disrupted, 2023 is expected to be a challenging year with customers being more cautious and hesitant in increasing production capacity before receiving orders from their end user. However, we are also receiving positive signal from several customers regarding expected improvement in the second half of 2023. We believe that our leading position in the specific segments, broad and diversified customer base and long-term strategic relationships with customers will enable us to again outperform the wafer fabrication equipment, which is predicted to decline by 20% to 30% in 2023. Regarding the first quarter, we estimate the sales to be approximately $71 million to $74 million, which represents a decline of 6% year-over-year and 12% sequentially at the midpoint. After doubling sales in the last two years, while focusing on supplying systems on time and providing a good response to customers, we now focus on a company's efficiency. Also, we are carefully monitoring certain balance sheet items such as inventory levels and account receivable. In my financial summary ahead, I will provide the results on a non-GAAP basis. Fourth quarter revenues came at a record $82.2 million, an increase of 11% compared with the fourth quarter of 2021 and slightly more than the previous quarter. Revenues for the whole year were a record of $321 million, 19% increase year-over-year. In line with our previous guidance range, we continue to experience inflationary pressure on raw material and labor which I cannot fully pass on to customers. However, we are taking steps to mitigate this impact by improving our efficiencies and cost as a result, improve our gross margin over the mid to long term. Operating profit in the quarter was $22.8 million, compared to $23.2 million in Q3 and $20.9 million reported in the fourth quarter of last year. Operating margin was 28%, similar to the previous quarter and to the fourth quarter of last year. Financial income for the quarter was $3.8 million, compared with $2 million in Q3 and $200,000 last year. Net income for the fourth quarter of 2022 was $24 million, or $0.50 per diluted share. This is compared to a net income of $19.7 million, or $0.40 per share, in the fourth quarter of last year. So total cash, including cash equivalent, short and long term deposits as of December 31, 2022 was $479 million. During the fourth quarter, we had a strong positive cash flow and we generated $19.9 million in cash from operations. Accounts receivable increased to $80 million in the quarter, primarily due to the timing of revenue and collection within the quarter Days outstanding for Q4r were 90 days. Since the beginning of the year, we experienced strong collection and we expect the account receivable balance to come down by the end of Q1. In the last few years, we increased the inventory in order to support the growth, especially in light of the supply chain issues. Moving to the guidance, in Q1, we expect revenue in the range of $71 million to $74 million. Our gross margin is affected by the business volume and the increase in the bill of material resulting from the supply chain issues, inflation and labor cost. We, therefore expect gross margin to be around 48% in Q1. In order to improve the gross margin this year, we plan to focus on cost reduction through engineering and design optimizations and supply chain initiatives. However, we are adjusting all other operating expenses to the current revenue level in order to move us closer to our target operating model when growth returns to our markets. With that, Rafi, Ramy and myself will be happy to take your questions. Hey, this is Tom O'Malley, not sure what happened with the queue in there, but I just wanted to understand, in the December quarter, you normally give a breakout by end market from a percentage perspective of what contributed to the revenue. I know you said greater than 60, but any more granular, it would be great. Compound semi, front-end, CMOS image sensing, and then other just any granularity there would be really helpful. So this quarter, itâ\u0080\u0099s Tom. So if we look at the fourth quarter, our advanced packaging came to close to 67%. This is the mix of the overall if we look at the yearly basis, it's about 60%. Our compound and front-end business, they were together just above 20%. And overall, this year was around 6%. The CMOS Image Sensors, as we anticipated, was nowhere than usual. Youâ\u0080\u0099re saying you think you'll do better than broad based WFE, but you're also saying, hey, the second half is going to be stronger than the first half. So first of all, we didn't say that June is going to be anything about June. So the segments are going to be similar next year, I'm expecting and I look at our backlog and the pipeline. Coming from the Heterogeneous Integration, a lot of the move from DRAM to high bandwidth memories. So from the segmentation point of view, we don't see anything different. But looking at Q2 and beyond, the entire year of 2023, we have a solid backlog and a solid pipeline. So therefore, it is too early to give a forecast for Q2 or even talk about the rest of the year. But as we said in our prepared remarks, we expect to outperform our market segment. My question is, I think historically it's not just the volume and also cost input that influences your margin. Because you have good backlog, I think you have some visibility into the mix. So I would say yes, you are right, product mix has a lot to do with the gross margin as well. We see some increase in the bill of material both from components, labor cost and altogether we see some pressure. And as I said, it may take time, but we expect to see some impact already in the second half of the year and also from the product mix that might be more favorable than we currently think. Maybe the second question, I really want to go back to the question asked by Tom earlier on the full year. What you think about the segment mix is going to be, I think you said it's quite similar, but I also heard you say the best packaging, which includes memory DRAM, seems to be doing well this year. You said that they're okay, but I don't hear that they are going to be, I donâ\u0080\u0099t hear like, the conviction from you that they're going to be as great as the advanced packaging segments for you. We waited, I talked about out the segmentation earlier, I didn't talk about the forecast. That was the second part where I said we're not in a position today to do any forecast be above, let's say, beyond the first quarter that we have already stated. Regarding the mix, whether the advanced packaging will be a little bit more than 60%, it's still too early to say. But it's definitely we see in the backlog and the pipeline that this is going to play a major part of our business, continue to be a major part of our business. And it will be, I would say, at least 60% whether it will be significantly more as the fourth quarter, I still don't know. No, I don't think there is going at this stage, at least, what we see on the current numbers and our plans. The main issue, and I think we spoke about it also in the last call. And the reason for that, they are waiting to see that their end customers are giving their business. And as a result, we've seen our lead times go down from about, I would say four to six months, coming down to something like three to four months. And so definitely and this is the reason that from our point of view, it's very hard today to forecast beyond the first quarter. In general, I will be very careful about it because some of this information is obviously very confidential. In parallel, we are working with our customers on their roadmaps and this requires development on our side to meet those roadmaps. This is very important for us to maintain our market position, increase the business with our existing customers. Is it just any sort of â\u0080\u0093\n So it will be in the advanced packaging, it will be in the front-end, it will be for silicon carbide and I would say even certain applications, even in the CMOS Image Sensors. I appreciate the color on the lead times, and but still if you place an order now, maybe you get a delivery May, June. Well, Brian, I talked about it before, itâ\u0080\u0099s the current status even when we look at our backlog and pipeline that they are solid, still we are very hesitant in giving you more color on the second quarter because things are changing. But still, it's very hard at this stage to put a very clear number. Because if you just run Q1 revenues flat across the year, and you're obviously a little bit more optimistic about second half, but that would that would obviously get you maybe down 10 for the year or something a lot better than maybe what the kind of the benchmark might be in terms of industry spend this year. I know you with China, I know you don't aggregate China exposure as a whole, and so not asking you to do that, but can you provide some sense of how you think holistically your revenue in China could trend this year relative to last year. So, first of all, we did not go and as you said, we don't give any segmentation in Asia. But all-in- all, China is coming out of the Coronavirus. But when we look in China, we are, the business there is stable. The industry is growing there, the new customers there. However, there are some, I would say some things that we will need to wait and see how the whole thing in China is playing out. There are a lot of unknowns, but I think from our point of view, we do not see a major change there. And Rafi, maybe you want to comment further. I say that if during the Q1, the proportion between China, Asia and other territory are about the same as last year. So definitely it can make, this action could definitely improve the business in China. But as I said, it's too early to say. Silicon carbide has come up, you mentioned a few times on the call, within maybe that 20% of revenue, which Q4 and maybe similar to last year. But what's the significance exiting year of your silicon Carbide or its power device revenue and kind of with new products, existing products. And kind of geographically, where are you stronger and where are you targeting, if you think just not by customer, but Europe, US, Japan, maybe China. So, first of all, the silicon carbide, the compound semi in general, it's a global business, and it's in all territories. I don't want to disclose any names of customers, but we are serving, I would say, most of the major players in this area. And that's definitely from a number, it's a significant number. We are doing additional steps at this customer, this specific customer that there is even more potentially that specific opportunity. And like this customer, there are several other customers that can order machines. We have a good position in all, I would say, on most of the major Tier 1 customers that are out there. We are going to grow both as the business grows, but we are also finding more and more steps within the process that we are going to address. This is one of the segments that is the CAGR is over, I think 20%. I wanted to follow up on the industry outperformance issue, and I totally understand that the nature of things makes it hard to really provide concrete color around the businesses dynamics beyond the current quarter. So I think that the advanced packaging segment will be, I would say, solid this year. This is a segment that will maintain, I would say, a good performance. And when I talk about this segment, I'm including the DRAM to high bandwidth memory, potentially, there is the DDR5. So definitely 60% of our business, I think at least, I can say, in good shape. Then the rest, I think silicon carbide is an area that should also perform well. As Rafi said, this is going to electric cars, and this is a segment that is going to continue to grow because there is a transition from the electric cars. We see it everywhere, and there comes, I would say the rest. Now, one thing that definitely I think is a plus is our exposure and strength in China. Definitely, as Rafi said, they are coming. There are some unknowns, but definitely this is an area that's going to continue and expand the industry. So it sounds like spending there is at least stable, but potentially up. And as a matter of fact, we will see some increase in R&D over the year. Basically, we will be doing like any company that is looking to improve profitability. Not that we have not done it in the past, but obviously, when you are in a more challenging business situation, we will do it even more. So, net-net, we will see some reduction in operating expenses from the Q4 numbers. Not by much, but we will see some reduction. So if we ended Q4 with 17.4, we would see some reduction in Q1 in the level of operating expenses. And then, Rafi, I'll ask you a question. And the 250, 25% addition last year is pretty remarkable. First of all, regarding customer base, even from time to time we are surprised discover new customer, many of them by the way, in China as a new customer that you don't know about them, nobody knows and all of a sudden you get more and more customers. So definitely China is one of the major territories that we can see new customers and when we talk about new customers, sometime it is the same customer but different segment in this specific customer. For example, if we penetrated to a Tier 1 customer to a specific application and then he found that we can give him better solution in other application in another department. So we see that there are enough room for us to develop our ability to many other segments and especially when we talk about OQC, front-end application, there are more and more play that from time to time we see that we have the tool, we have the ability in order to go there. And we definitely continue doing all our efforts to continue expanding the customer, the installed base of customers. So, very significant increase in interest income in the quarter. And how much duration should we expect with these increases in average interest rates across your different cash and investment instruments, as we look at â\u0080\u009823. So, as you can, we all know, interest rates are pretty high these days, and we are trying to take full advantage of the high interest rates. And, yes, we expect this number to continue to grow to five-ish million dollars on a quarterly basis in 2023. And again, this is all assuming that the interest rates remain at the current level. So today there are more and more applications, and this is tied up to the high performance computing and the heterogeneous integration. And obviously, our machines are here used to inspect the bumps on the wafers. And that's an area, it's not huge, but it is big enough to mention it. And what we see, we see major expansion from across all customers from on to wharf to Infineon. So if you can speak more about that, that would be helpful. So, Shahar, I cannot speak about customers names, but I think as we said before, this is definitely a market. So yes, we are a dominant player in certain applications, not in all of the application, but it's an area that we are gradually developing capability and expanding our presence to other applications, other steps, process steps within the silicon carbide. It has been growing over the last few years, and I think from a single digit number to double digit numbers this year. Is there a gallium nitrate â\u0080\u0093\n Yes, gallium nitrate is also has some advantages in other applications. I think the market there still at this stage is smaller, but definitely it's a market that we play in, in gallium nitride, gallium arsenide. I think it's a little bit more complex to try answer all of this in a few minutes, but you can give me a call and we can speak about it more. Before I hand over back to Rafi, I'd like to let you all know, in the coming hours, we will upload the recording of this conference call to the investor relations section of Camtekâ\u0080\u0099website@camtek.com. Rafi, please go ahead."
}