{
    "symbol": "RGF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 14:35:12",
    "content": " All statements made on this call today, other than statements of historical fact, are forward-looking statements, and include statements regarding our projected financial results including net sales, gross profit, gross margin, adjusted gross profit, adjusted gross margin and adjusted EBITDA, as well as our ability to increase our net sales from existing customers and acquire new customers, introduced new products, compete successfully in our industry, implement our growth strategy and effectively expand our manufacturing and production capacity. Starting with our financial highlights for the second quarter, net sales increased 65% to $30.8 million compared to $18.7 million in the second quarter last year. Sales in a retail or measure channel increased 97% compared to the prior year period, driven by strong velocity gains of our core products and to a lesser extent new products and new customers. Starting with household penetration, according to numerator data as of July 24, 2022, the Real Good Foods brand household penetration is 8.3%, up from 7.4% in March and 4.8% in June of last year, our household penetration continues ranked second amongst all health and wellness frozen brands behind only Amy's which as you're probably aware is over a $500 million brand at retail. The strong brand health indicators underpin our competence and achieving over $500 million in sales long term and what gave us confidence to make the investment to increase production capacity with our new facility in Bolingbrook, Illinois, which Jerry will touch on shortly. Turning to our financial results, net sales in the second quarter were $30.8 million, an increase of 65% compared to the second quarter last year. In the unmeasured channel, growth remained strong in the second quarter with sales growing 30% compared to the second quarter of last year, driven by distribution gains. Our second quarter gross profit was $2.4 million reflecting a gross margin of 7.6% of net sales, compared to gross profit of $2.7 million or a gross margin of 14.2% of net sales in the second quarter last year. Adjusted gross profit during the quarter was $6.8 million, reflecting adjusted gross margin of 22% of net sales, compared to $3.9 million or 20.9% of net sales in the second quarter last year. Long term, we continue to expect net sales of $500 million, adjusted gross margins of 35% and adjusted EBITDA margin of 15%."
}