{
    "symbol": "RGF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-27 14:59:10",
    "content": " All statements made on this call today other than the statements of historical fact are forward-looking statements and include statements regarding our projected financial results, including net sales, gross profit, gross margin, adjusted gross profit, adjusted gross margin and adjusted EBITDA as well as our ability to increase our net sales from existing customers and acquire new customers, introduce new products, compete successfully in our industry, implement our growth strategy and effectively expand our manufacturing and production capacity. Starting with our financial highlights for the fourth quarter, net sales increased 39% to $35.7 million as compared to $25.6 million in the fourth quarter last year. Sales in the retail or measured channel increased 107% on a 2-year basis, which is an acceleration compared to approximately 15%, 2-year growth on average over the preceding 3 quarters. The aforementioned new distribution gains, combined with strong base business velocities and another solid slate of new product innovation, gives us confidence that we will grow sales in 2023 to at least $200 million, representing growth of approximately 30%. Adjusted gross margins, which account for the capacity utilization impact, were 27.7%, a 13-point improvement sequentially compared to 15.8% in the third quarter of '22 and the second best quarterly adjusted margin in the company's history. Although this move cost us 300 basis points or $1 million in incremental costs in the fourth quarter, it's the right strategic move as it structurally lowers our costs and creates further flexibility in our manufacturing network. Turning to our financial results, net sales in the fourth quarter were $35.7 million, an increase of 39% as compared to the fourth quarter of last year. As for 2023, we expect another stronger growth in this channel driven by expansion of our breaded poultry items starting in the first quarter of 2023, significant new distribution wins already secured as well as commitments to certain planned promotional events. Our fourth quarter gross profit was $4.9 million, reflecting a gross margin of 13.7% of net sales as compared to a gross profit of $1.3 million or a gross margin of 5% of net sales in the fourth quarter of last year. Adjusted gross profit during the quarter was $9.9 million, reflecting an adjusted gross margin of 27.7% of net sales as compared to $4.5 million or 17.5% of net sales in the fourth quarter of last year. In 2023, we expect net sales of at least $200 million, adjusted gross margins of at least 24%, adjusted EBITDA in the mid-to-high single-digit range and positive cash flow from operations. Long-term, we continue to expect net sales of approximately $500 million, adjusted gross margin of 35% and adjusted EBITDA margin of 15%."
}