{
    "symbol": "RGF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 12:23:03",
    "content": " All statements made on this call today, other than statements of historical fact, are forward-looking statements and include statements regarding our projected financial results including net sales, gross profit, gross margin, adjusted gross profit, adjusted gross margin and adjusted EBITDA, as well as our ability to increase our net sales from existing customers and acquire new customers, introduce new products, compete successfully in our industry, implement our growth strategy and effectively expand our manufacturing and production capacity. Starting with our financial highlights for the third quarter, net sales increased 63% to 37.6 million as compared to 23 million in the third quarter of last year. Third quarter sales grew 200% on a two-year stack basis, which is an acceleration compared to 190% growth in the first half of 2022 and 116% growth in full year 2021, on the same basis. As a result, we expect unmeasured channel sales growth to accelerate further in the fourth quarter, in addition to the continued strong velocity growth and expanded distribution expectations for our current items in the unmeasured channel for the fourth quarter 2022 and beyond. Owing to the slower than expected distribution gains in the third quarter, we now expect sales for 2022 to be towards the low-end of our guided revenue range of 155 million to 160 million. The aforementioned new distribution gains combined with strong base business philosophies and another solid slate of new product innovation gives us confidence that we will grow sales in 2023 to at least 200 million, representing growth of approximately 30%. Turning to our financial results, net sales in the third quarter were 37.6 million an increase of 63% as compared to the third quarter of last year. In the unmeasured channel growth accelerated in the third quarter to approximately 76% as compared to 31% growth in the second quarter, the sequential and year-over-year acceleration was driven by distribution gains and to a lesser extent velocity increases. As for 2023, we expect another strong year of growth in this channel, driven by expansion of our breaded poultry items starting in the first quarter of '23, significant new distribution wins already secured, as well as commitments to certain planned promotional events. Our third quarter gross profit was 1.8 million, reflecting a gross margin of 4.7% of net sales, as compared to a gross profit of 2.4 million, or a gross margin of 10.2% of net sales in the third quarter of last year. Adjusted gross profit during the quarter was 5.9 million, reflecting an adjusted gross margin of 15.8% of net sales, as compared to 3.9 million or 17.1% of net sales in the third quarter of last year. We expect our adjusted gross margins to improve sequentially in the fourth quarter driven primarily by lower direct material costs, and to a less extent lower labor costs driven in part by Bolingbrook efficiency gains. For 2023, we expect net sales of at least 200 million, adjusted gross margins of at least 24%, adjusted EBITDA and the mid-to-high single digit million range and positive cash flow from operations."
}