{
    "symbol": "CYH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 23:23:11",
    "content": " Contract labor totaled approximately $80 million in Q4, compared to $140 million in the prior year and $100 million last quarter. While lower acuity of inpatient admissions and payer mix changes pressured our top line, the improvements we made in length of stay and contract labor and our management of non-labor expenses below inflation contributed thus having our best EBITDA quarter of the year, excluding pandemic relief funds. This was the net result of an 8.2% increase in adjusted admissions and an 8.7% decrease in net revenue per adjusted admission, which as I mentioned, was pressured by lower acuity inpatient admissions and changes in payer mix, primarily attributable to the Delta wave of COVID experienced during the fourth quarter of 2021, during which we saw a proportionately higher percentage of commercially insured COVID patients during that surge. During the fourth quarter, we recorded $2 million of pandemic relief funds, compared to $46 million recognized in the prior year period. With regard to expenses, on the labor expense side, combined salaries, wages and benefits and contract labor expense improved on a year-over-year basis by approximately $40 million and improved approximately $13 million sequentially. During the fourth quarter of 2022, contract labor was approximately $80 million, compared to $140 million in the prior year quarter. On a sequential basis, in 2022, our contract labor was $190 million in the first quarter, $150 million in the second quarter, $100 million in the third quarter, and $80 million in the fourth quarter. Overall, we experienced a moderate increase of approximately 3% over the prior year, despite a $30 million increase in medical specialist fees, a $40 million increase in malpractice insurance, and $8 million related to Hurricane Ian. Although we use more of our cash in order to repurchase debt and we experienced lower free cash flows than we anticipated, we retained $118 million of cash on the balance sheet at the end of the fourth quarter and we still have the availability of substantially all of our ABL with $852 million of borrowing base capacity. If you think about fourth quarter â\u0080\u0093 in first quarter historically has been higher quarters for utilization and contract labor, particularly around our markets in Florida, where we have more seasonality, but I would expect this ultimately when things level out to be somewhere in the $50 million to $60 million per quarter on average range for contract labor. I think contract labor, based on full-year of 2022, we had about $520 million of contract labor in our current run rate, even if we stayed flat in 2023, we would see a $200 million reduction in contract labor."
}