{
    "symbol": "ESE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-17 21:30:12",
    "content": " On the call today, we have Vic Richey, Chairman and CEO; Chris Tucker, Senior Vice President and CFO; and Bryan Sayler, President, Utility Solutions Group. And now I would like to turn the conference over to your first speaker today, Kate Lowrey, Vice President of Investor Relations. Statements made during this call, which are not strictly historical, are forward-looking statements within the meaning of the safe harbor provisions of the federal securities laws. These statements are based on current expectations and assumptions, and actual results may differ materially from those projected in the forward-looking statements due to risks and uncertainties that exist in the companyâ\u0080\u0099s operations and business environment, including, but not limited to, the risk factors referenced in the companyâ\u0080\u0099s press release issued today, which will be included as an exhibit to the companyâ\u0080\u0099s Form 8-K to be filed. In addition, during this call, the company may discuss some non-GAAP financial measures in describing the companyâ\u0080\u0099s operating results. I really feel good about our transition plan, and we thought this call would be a good chance for Bryan few words and to start to engage in a quarterly earnings process. The company is in a very strong position, and Iâ\u0080\u0099m looking forward to engaging with the teams around the company as we work to continue our momentum and drive the growth of our business forward. For the full year, we achieved many records sales of $858 million, adjusted EPS of $3.21 a share, operating cash flow of $135 million and a year end backlog of $695 million, all record amounts. Our portfolio of businesses all have strong market positions, which is very evident from the numbers we put up this year. Across the company, weâ\u0080\u0099ve seen favorable end market dynamics, and we feel really good about the long-term outlook for all three business platforms. Chris will get into some of the financial details in a few minutes, but I did want to offer some top-level commentary about each of the business segments. Starting with A&D, where we had a great quarter, sales increased 30% and adjusted EBIT dollars were up over 60%. 2022 represented a nice year of recovery for A&D, but we think the recovery still has room to run. The commercial aerospace markets have led to recovery with PTI, Crissair and Mayday significant order increases. We also have sizable Navy, Space and Defense Aerospace businesses in A&D and those markets are also strong. This business is nicely diversified across different aerospace and defense markets, and we see good momentum as we move into 2023. Nexus Utility Group, where we also had a strong quarter, this business was a little uneven in 2021 coming out of the pandemic. But over the last three quarters of fiscal 2022, we have really seen the business stabilize and strengthen. Additionally, the renewable space continues to be a bright spot for us, and NRG has now delivered 2 years in a row of sales growth in excess of 20%. Lastly, letâ\u0080\u0099s touch on the Test business, where we had a nice quarter of sales growth and EBIT margin expansion. Q4 sales were up 8% for Test, a good number given the significant growth weâ\u0080\u0099ve posted over the last several quarters. This business also has diversity in end markets, and we have seen strength across several different markets with health care, telecom, automotive and data center customers all having a high level of activity in 2022. To summarize a bit, it really was a good year for ESCO on a number of fronts. At the beginning of the year, we gave earnings per share guidance of $3.10 to $3.20 a share. When that guidance was delivered, there was not an expectation that supply chain and labor challenges will be with us all year. Itâ\u0080\u0099s a big testament to our employees across the company, and always, Iâ\u0080\u0099m very thankful for the tremendous effort to deliver this record year. As we have done in the last few quarters, weâ\u0080\u0099re going to use a chart presentation to walk through the financial results. As Vic mentioned, we had a great quarter, and this chart illustrates that very well. Adjusted EBIT was up over 50% and adjusted EPS was up over 42%, a great growth quarter for ESCO. The acquired backlog came through as orders last year, so it makes for a pretty tough comparison. Overall, the order trends have remained robust and our record year-end backlog of $695 million demonstrates the strength of the business. Next, on Chart 4, weâ\u0080\u0099ll get into segment results, starting with A&D. Beyond that, we still saw explosive growth from other parts of the business with Defense Aerospace, Navy and Space, all up more than 20%. On the next chart, we have the Utility Solutions Group, where we also had very strong sales performance. EBIT margins were down 0.6 point as we did see some unfavorable mix here, but EBIT dollars were up 33%. Going forward, these businesses will be folded into the base company, but we are very excited about the progress made with both acquisitions during the first year as part of ESCO. The last segment to talk about is test, a good finish to the year for this group, with sales up 8% and EBIT margins up 1.7 points, really nice margin expansion here as we saw solid leverage on the volume increase, and we also saw good impacts from pricing actions. Last year in Q4, we saw significant orders in the Power filter product line, so that is the main driver of the decrease. As you saw in the press release, it was a record year for ESCO on many fronts. Adjusted EBIT margins expanded 0.8 points and adjusted EPS was up 24% as we saw favorable impacts from volume leverage, price and cost reductions, which more than offset the inflationary impacts of material and labor. Orders were up over 20%, resulting in $695 million year in backlog with good growth from all three segments. Operating cash flow increased to $135 million, a great result as we had lagged on cash flow through the first three quarters. Capital spending was up just over $5 million and acquisition spending dropped significantly with 2021, including ATM, Altanova, and Phoenix, while 2022 included only the NEco acquisition. We did restart a share repurchase program in 2022, and weâ\u0080\u0099re able to buy back $20 million worth of stock during the year. Obviously, for us, this is a really good-looking chart with lots of arrows pointing in the up direction, double-digit increases of sales and EBIT for all THREE business segments. And then for Test, we really had continued growth after good performance throughout the pandemic period. In the press release, we detailed the growth expectations by segment. We expect A&D to lead the sales growth with low double-digit growth, followed by USG with mid-single-digit growth and Test expecting low single-digit growth. From an EPS perspective, we are planning for growth in the range of 8% to 12%, slightly lower than the EBIT growth as we expect increases in interest expense given the current interest rate environment. Overall, youâ\u0080\u0099re looking at another year of nice growth after the great year we had in 2022. You saw the numbers from Chris, but obviously, a great year for ESCO with, and Iâ\u0080\u0099ll say this for the last time, record financials on a number of fronts. Itâ\u0080\u0099s been a real honor for me to be the CEO at ESCO for the last 20 years, and Iâ\u0080\u0099ve really enjoyed my interactions with the investor community over that time. It was worth about $25 million, Jon, of backlog that came in last year in Q4. So we can do that math real quick, but thatâ\u0080\u0099s â\u0080\u0093 that was the impact in the prior year numbers. I would say that, that power filter business was really seeing explosive growth a year ago. I think as that whole again, supply chain works to kind of get the data center build-outs done, itâ\u0080\u0099s just taking a little longer. And thatâ\u0080\u0099s why if you look in the guidance, we kind of had a lower growth expectation in for them relative to the other two segments. So fundamentally, just kind of as they have gotten this much bigger, this much faster, we expect the growth to be a little bit more moderate going forward. No, I think itâ\u0080\u0099s all good. I mean as anybody has done a type of construction over the past year knows itâ\u0080\u0099s hard to get concrete, itâ\u0080\u0099s hard to get steel. But look, I think the business, as you know, thatâ\u0080\u0099s the one business was not impacted during COVID and so they continue to grow. And then outside processing in a couple of businesses, the A&D business has still been a bit of a challenge because most of those outside processors are very small businesses. And I think some of them as particularly the commercial aerospace business has picked back up, a lot of them have had a hard time keeping up with that growth. So, as that hardware goes out, thatâ\u0080\u0099s a little bit lower margin. I would say, a fair bit lower margin. So, itâ\u0080\u0099s still kind of mid-30s, but well below the overall average there. The good news with that business, though, is you usually get the cash up front. So, one of the reasons our cash was as good as it was this year was largely driven by payments on those contracts. I think I would say pretty consistent framework that we are looking at as we head into â\u0080\u009823, Jon. Again, I wouldnâ\u0080\u0099t characterize it as a totally stuff pipeline or anything, but we do have a little bit of activity there. So, on average, for â\u0080\u009822, we had about 2% interest rate, and we are looking at something more in the 6% plus range for next year. But overall, as we get through the year, we are expecting it to be 6% plus. Well, I think we would say we feel like itâ\u0080\u0099s â\u0080\u0093 we had a couple of pretty tough years, and this was a nice kind of recovery, but we still have some legs to go there. And I think even with some of our businesses like Crissair and Mayday if you compare them back to the â\u0080\u009819 levels, they are just â\u0080\u0093 they have still got a fair bit to go to get there. Now, their order books have been pretty good, but itâ\u0080\u0099s been a little bit slower to materialize through the sales line. And so the double-aisle stuff is, again, I think still out in front of us from a sales perspective, and that we expect to kind of carry on for thatâ\u0080\u0099s â\u0080\u0093 you are talking in years there, I think before you get back to kind of prior peaks. As far as the overall single aisle, the only thing I would say about that is, if you hear kind of a lot of the commentary from the big OEMs out there, I think they are generally not quite to the build rates we are trying to get to. So, if you look at those forecasts, again, those still show pretty nice growth out over the next coming years. So, I think if you go back and look at pre-pandemic, I mean I think when it gets back to full recovery will be above that in addition to just that kind of that normal growth, I mean we have won some additional projects, particularly on the space side and on the Navy side with Westlandâ\u0080\u0099s really recovered nicely. So, I think that longer term, and I am not talking 5 years from now. I am talking about a couple â\u0080\u0093 over the next couple of years, I think we will get back above the levels that we had going into the pandemic. So, I think we will see some growth there over the next couple of years. And then as I have mentioned in my prepared comments, we have had some new product developments, which I think will add a little upside as well. I would say by the fourth quarter, we kind of got ahead of that a little bit. Even in the utility side, I think we have done a good job on the price there to stay in front, but we talked about some of the mix issues there earlier that caused the margins to hold back a little bit. So, we would say, in general, that we feel like we have priced pretty well, and we are kind of favorable on that equation right now, John. If you look at the year-over-year growth, so because of the backlog, we are coming in with. But from a margin and EBIT perspective, itâ\u0080\u0099s a little more back-end loaded. But fundamentally, we think the sales growth will be pretty even, a little lower Q1 and a little higher Q2, Q3 and then maybe a little lower Q4 or something like that. We honestly â\u0080\u0093 what you see in the September financials there, we had some â\u0080\u0093 we had a really strong cash flow really late in the year, so we ended up with pretty high cash and a little higher debt. And yes, we are definitely going to be managing the debt pretty aggressively given the interest rate environment as we move forward. I would like to turn the call back over to Vic Richey, Chairman and CEO, for closing remarks."
}