{
    "symbol": "WEBR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-16 13:58:03",
    "content": " For the second quarter, net sales were $607 million, which was down 7% versus the prior year period and down 4% excluding a negative 3% impact of foreign exchange rates. This sales performance is still markedly above 2020 levels with Q2 sales from 2020 to 2022, up 46% on a 2-year stack basis, or $180 million. To this end, second quarter fiscal 2022 net sales decreased 7% or $47 million to $607 million from $654 million last year. On a 2-year stack basis, sales increased 46% above 2020 or $180 million from $427 million to $607 million. For the Americas, net sales decreased 18% or $67 million to $306 million from $373 million last year. Excluding the impacts of $18 million of negative foreign exchange headwinds, net sales grew 16% And on a 2-year stack basis, net sales increased 47% compared to Q2 of 2020. For the quarter, gross profit decreased $77 million or 27% to $209 million from $286 million last year and gross margins decreased 932 basis points to 34.3% from 43.7% last year. For the quarter, we made significant progress against our recovery plan, as we improve gross margins by nearly 12 percentage points from 22.6% recorded in the first quarter to 34.3% in the second quarter, With the exception of the net sales miss, and continued FX headwinds in the quarter, our gross margin assumptions were in line with our expectations during our Q1 call. Selling, general and administrative costs for the second quarter decreased by $18 million, or 10% to $166 million from $184 million last year, and decreased 77 basis points to 27.3% from 28.1% of sales last year. As I mentioned in the last question, taking pricing action when we did drove gross margin improvement sequentially as you called out almost a full 12 percentage points just -- versus last year, pricing drove 770 basis points of improvement. So -- and as Chris mentioned, we kind of modeled this conservatively because we wanted to -- as we were reading early season traffic and POS, so the range is as we go to the low end of the range, we just factor that in, and then if we take what happened in early May and you could project that out, I think Chris mentioned we did see some slight improvement in traffic patterns in most of our channels here in the U.S. that would then lead us towards the higher end of the scenario, both on the pricing impact because obviously, as volume drive, you get a further pricing benefit, but it would also improve our volume impact year-on-year. Honestly, the last 2 weeks of Genesis production, because if you go back to Q2, I'll emphasize that, of that $50 million shift, $35 million to $40 million of it was in the U.S., driven entirely almost by component parts and supply availability to make the Genesis launch -- the launch of our new Genesis."
}