{
    "symbol": "CCU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 23:06:13",
    "content": " Hence, the need to strengthen our revenue management initiatives in the coming quarters, resulting in net income will totalized a loss of 10,455 million Chilean pesos versus a gain of 18,968 million Chilean pesos last year, caused by the lower degree mentioned above and a higher loss in non-operating results, the latter mostly driven by higher net financial costs owing to a larger debt. The higher price in Chilean pesos were mainly explained by a positive impact on export revenues from depreciation of a 1 trillion pesos versus the US dollar, revenue and mismanagement initiatives in Chile and Argentina domestic markets, which permitted us to partially compensate higher costs in packaging material and inflationary pressures. And this is particularly challenging for us because for many years, Fernando with inflation being 2% in Chile,2% to 3% weâ\u0080\u0099re able not to increase nominal prices of beer and gaining momentum and improving our profitability by two elements. But again, when we compare the volumes of April 2022 with Q2 2019, which was the year previous pandemic, we have grown our consolidated volumes by 11.4% and double digits in  double digits in non-alcoholic in Chile, and consolidated base 11.4%, and accumulated â\u0080\u009822 first half of the year compared with accumulated 2019. Thank you very much. Number one, I have mentioned it many times and I will repeat, we never reduce marketing expenses to improve our profitability because brand equity scheme in our business, to protect our market shares and to protect our business scales, and to protect our ability to increase prices, because without brand equity, you cannot sell volumes, nor prices in the market. So you make a lot of money, but it's the kind of brackets artificial money and then they catch up with the exchange rate producing a huge evaluation and your results in US dollars deteriorates a lot, and then you catch up while inflation can send - you could adjust prices as then there have been our life in Argentina for many years, and it's a roller coaster of Argentinian descent and this in 2023 they evaluate more than inflation probably we're going to suffer in our results. Thank you very much. Thank you very much. Thank you very much. Thank you very much."
}