{
    "symbol": "DSX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 14:48:04",
    "content": " The third quarter of 2022 has been another very profitable quarter for our company, but also has been a very busy and productive one with the acquisition of the nine vessel Ultramax fleet in August. While market conditions have become less robust, especially towards the end of the third quarter, our disciplined chartering strategy has allowed us to continue generating attractive free cash flows. This time around we do have changes since last quarter and we find ourselves owning an operating an expanded fleet of 40 vessels in the water, with a carrying capacity of approximately 4.7 million deadweight tons. As already announced, we expect our fleet to increase to 43 vessels by the end of the year as we take delivery of the remaining three Ultramaxes within December. More specifically, in July of this year, we declared a dividend of $0.275 per common share, or approximately $23.7 million in aggregate for the second quarter of 2022. Also in July, we made a prepayment of $4.8 million for the release of the mortgage on the motor vessel, Baltimore, a vessel that we have agreed to sell earlier in the year. In August, we were particularly pleased to have agreed to acquire nine modern Ultramax dry bulk vessels built between 2015 and 2018 with an average vessel age of approximately 5.4 years from Sea Trade Holdings Inc. The aggregate purchase price of the fleet is $330 million of which $220 million will be paid in cash and $110 million is to be paid in the form of 18,487,395 in aggregate newly issued common shares of the company at the price of $5.95 per share. Also in August in anticipation of the motor vessel New Orleans and Santa Barbara sale and leaseback transactions, we made a prepayment of $13.8 million on relevant debt facilities and successfully released the vessels mortgages. In September, we proceeded with the sale of the two vessels to unaffiliated Japanese third-parties for an aggregate amount of $66.4 and bareboat chartered in the vessels for a period of eight years. Also in September, we signed an up to $200 million credit facility for the partial financing of the nine Ultramax vessels. The cash dividend is $0.175 per common share, or $17.3 million in aggregate. With a payment of this quarter's dividend, the total amount of cash dividends paid since we reinitiated our dividends in last November is $1. In addition, this quarter we also declare the stock dividends of all OceanPal Series D convertible preferred shares that our company has received as partial consideration for the disposal of motor vessel Baltimore on a pro rata basis to all our shareholders. Lastly, as of November 14th, we have secured approximately $35 million of contracted revenues for the remainder of the year with 80% contract coverage and $123.7 million of contracted revenues for 2023 with 36% contract coverage. We find ourselves as of September 30th, 2022, with a cash and cash equivalents position of $129.7 million including restricted cash as against $126.8 million as of December 31st, 2021. Lastly, our earnings per share for the third quarter of 2022 came in at $0.37 versus $0.16 per share for the same period in 2021. Consistent with our discipline chartering strategy, we have continued chartering our vessels in a staggered manner and have secured profitable time charters for seven vessels of our fleet since our last quarterly earnings presentation. More specifically, we have charted one Kamsarmax, one Panamax, one post-Panamax, and four Ultramax vessels at a weighted average daily rate of $14,862 and for a remaining average period of 374 days per vessel. The time charter equivalent rate for this quarter was $23,289 compared to $17,143 at the same quarter the previous year. Looking at the average time charter equivalent, it was at -- this quarter it was $23,363 approximately $10,000 more than the previous year. Again, for the nine months, the same picture, $1.15 per share basic and $1.10 diluted compared to only $0.15 and $0.14 respectively last year. As always, our balance sheet has been on pristine condition with -- I'm choosing only one number from the balance, the net debt being at approximately $349 million. And in -- as of December 31st last year, it was $305 million. As of September 2022, our free cash flow breakeven was $13,153 per day. In this first slide that I'd like to point out at class and summarize recent developments by reminding us that after the strongest year for the sector in 13 years, that was 2021 bulk markets have softened in 2022. To put things in perspective, at its peak in October 2021 the Baltic Cape index reached 10,485 yesterday's closed at $1,333. The BSI reached $3,624 in October of last year and closed yesterday at $1,180. Panamax export earnings average $16,691 a day in the third quarter of this year. Supramax/Ultramax earnings have come down about 40% from last year, but more than double their pre-COVID 10-year average. It has been going up for four straight months according to Commodore Research, with the latest increase being the September year-on-year increase of 2.5%. Lending by Chinese banks has steadily increased this year and China remains according to Commodore Research, only one of three nations that has actually cut rates this year, with the central and regional governments continuing to work on stimulating the economy. Turning to iron ore, as Commodore Research points out Brazil's iron ore exports have contracted on a year-on-year basis this year by 14.5 million tons or 5%. According to Clarksons, iron ore seaborne trade will contract slightly by 0.2% in 2023, on the back of weaker demand and steel production trends in China and economic pressures elsewhere. Although global trade is projected to rise by 0.8% year-on-year potentially supported by improving economic trends in Europe, and other key regions. Steam coal now, according to Clarksons Global seaborne thermal coal trade is forecast to grow 2% in 2023, to 985 million tons, mainly driven by increase in demand which is likely to be met by increased Indonesian and Australian exports. Further ahead, 2024 is initially projected to Seaborne Thermal Coal Trade shrink by 0.3% to 981 million tons as European energy mixes potentially start to shift once again away from coal. In 2023, Clarkson predict inputs to increase by 2% to 268 million tons with Australian exports likely to improve as some new mining projects come online. On grain cargoes now, according to Clarksons, the grain trade is expected to increase by about 4% in the 2022-2023 grain season, and reach 537 million pounds on the back of recovering Ukrainian grain exports and expanding US and Brazilian soybean production. According to Clarksons, the new building order book for capes stood at the beginning of October of 22.1 million deadweight -- which was 5.8% of the current fleet. Handymaxes on order totaled 17.2 million deadweight, the equivalent of 7.6% of the existing fleet. The alternative fuel cater below the book, standard 1,079 ships of all types of 76.9 million gross tons which represents 44% of the total order book. So far this year 13% of tankers in deadweight terms delivered have been alternative fuel capable, while only 3% of bulkers in deadweight terms have the same flexibility. In the meantime, deprived spread between very low sulfur fuel and the 3.5% high sulfur fuel has been hovering around $260 over the last few weeks. Overall in 2023, supply/demand fundamentals could see some improvements at 2.2% tons miles demand growth is initially projected versus just 0.6% fleet growth. If this materializes, it can certainly help boost demand for Panamax and Nutramax where China is forecast according to verse broker to import 80 million tons of coal in the 2022-2023 grain season which began this October. Firstly, we remain focused on taking advantage of favorable market conditions for securing positive free cash flows that allow us to continue rewarding our shareholders with attractive dividends. We believe that the payout of $1 of cash dividends since last November, in addition to the stock dividends relating to OceanPal Inc., firmly exemplifies our efforts to reward shareholders."
}