{
    "symbol": "DSX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 16:44:09",
    "content": " Market conditions remained positive during the second quarter and, in tandem with our chartering strategy, allowed us to continue generating attractive free cash flows. Not much has changed since our last quarter, and we find ourselves owning and operating 35 vessels in the water with a carrying capacity of approximately 4.5 million deadweight tons. More specifically, in May of this year, we declared a dividend of $0.25 per common share, or approximately $21.6 million in aggregate for the first quarter of 2022. In anticipation of the merchant vessel Baltimore's delivery, earlier this month, we made a prepayment of $4.8 million on the relevant debt facility and successfully released the vessel's mortgage. As previously highlighted, the robust current market conditions have allowed us to be able to declare an even higher dividend for the second quarter of $0.275 per common share or $23.7 million in aggregate. Lastly, our disciplined chartering strategy has allowed us to secure approximately $114.1 million of contracted revenues for the remainder of the year with 84% contract coverage and $93 million of contracted revenues for 2023, with 30% contract coverage. We find ourselves as of June 30th, 2022, with a cash and cash equivalents position of $130.3 million, including restricted cash, as against $126.8 million as of December 31st, 2021. Our debt, net of deferred financing costs, stood at the $451.7 million at the end of the second quarter of 2022 as against $423.7 million at the end of 2021. Lastly, our earnings per share for the second quarter of 2022 came in at $0.42 versus $0.02 per share for the same period of 2021. Consistent with our disciplined chartering strategy, we have continued to take advantage of the favorable chartering market and have secured attractive time charters for 5 vessels of our fleet during the second quarter. More specifically, we chartered 3 Panamax/ Post-Panamax vessels at a weighted average daily rate of $19,881, and for a remaining average period of 188 days per vessel. We have also chartered 2 Capesize vessels at a weighted average rate of $21,922 per day for a remaining average period of 288 days. As you can see on Slide #1, our revenues from the charters were $74.5 million with an average number of vessels of 35. Compared to the previous year, the same quarter, was only $47 million and with more vessels in the water, i.e., 37. Of course, you can see the time charter equivalent rate for the quarters was on average $24,630-something, compared to $13,477 in the previous year for the same quarter. On Slide #10, the same picture is described and applies for the 6-month numbers where the revenues stood at $140.5 million compared to $88.1 million for the previous year 6-month period. The average time charter rate was $23,400 for the 6-month period compared to $12,439 per day. In this slide and the next one, what is worth mentioning is the earnings per common shares diluted, which for the quarter was $0.42 per share, which we feel that it is substantial and sustainable also for the near future. Slide 13, as regards our balance sheet, we have kept our cash position clearly at very healthy levels of $130 million, and our total debt  $451.7 million. Based on our average daily time charter rate for our fixed revenues of 2022, which is $24,100 almost and for 2023 it's $24,953. What is worth mentioning here is the fact that we have secured $114 million plus for the remaining days of 2022, starting from 19 of July onwards. As a highlight of our presentation, this Slide 15 shows the potential of cash generation for the remaining of the year 2022 and for 2023 based on recent FFAs. As you can see, $50 million plus can be generated for the remaining of the year based on various assumptions. And for the year 2023, $62 million plus. More specifically, longer haul European Union coal imports, some Atlantic exports from Russia for Far Eastern receivers and disruption to grain trade patterns are projected together to drive up the average distance of the dry bulk seaborne voyage this year by about 1%. The Capesize average of the 5TC routes last year was $33,333 per day. So far this year, the 5TC route average rate has been only $18,382 per day. So far this year, these vessels have earned on average about $24,200 a day. In the United States, the equivalent figures are 3.7% for this year and 2.3% in 2023. In the Euro area, GDP is expected to grow by 2.8% this year and just 2.3% in 2023. Still on Slide 19, we talk about speed according to Commodore Research, last May marked the third straight month where global crude steel production fell on a year-on-year basis. According to Commodore Research, in China, the end of June stockpiles of flat and construction steel were 1.2 million tonnes higher than at this time last year, or about 7% lower. Turning to iron ore. On a worldwide basis, the seaborne iron ore transportation is expected by Clarksons to remain steady this year at around 1.5 billion to 1 billion metric tons. Next year, an increase of about 1% is anticipated, which will take the total to 1.53 billion tonnes. Overall, according to Clarksons, Chinese seaborne iron ore imports are now projected to decline by 2% this year to just over 1 billion metric tons. As reported recently by Tradewinds, South Africa's Richards Bay Coal Terminal have witnessed a 40% increase in coal shipments destined for European ports in the first 5 months of the year. For this year, Clarksons estimate that their shipments of coking coal will increase by 1% and reach 269 million metric tons while for 2023 they expect a further 2% increase with exports reaching 276 million metric tons. According to Clarksons, the seaborne thermal coal exports are expected to drop by 1% this year to 958 million tons and increase by 1% again in 2023. Meanwhile, Chinese coal-derived electricity generation contracted last month by about 5% on a year-on-year basis. Currently, according to Commodore Research, Chinese northern coal port stockpiles were higher by 7 million tonnes compared to last year, which is an increase of about 39%. According to Clarksons, given the loss of Ukrainian exports, global seaborne grain trade is now projected to decline by 4% this year. Coarse grain exports are expected to decline by 8% and wheat exports are expected to total 205.5 million tonnes, which would be 3% more than what is expected to come in for the 2021-'22 grain season. Before moving on to pure bulk carrier newbuilding statistics, it's worth noting that according to Clarksons, in the general concept of fueling transition, by the end of June, there were 950 alternative-fuel-capable vessels on order, with carrying capacity of 70 million deadweight. The order book in the dry bulk sector now stands at just 7.2% of fleet capacity, with 14% of the total fleet order book of 65.7 million tonnes being alternative fuel capable vessels, mainly LNG. In the Capesize sector, about 23 million deadweight are on order, representing about 6% of the trading fleet as of 1st June. There are 22 million deadweight tonnes on Panamaxes on order, equivalent to 9.1% of the trading fleet. As for Handymax vessels, the total tonnage on order is 17.4 million deadweight, representing 7.8% of the trading fleet. According to Clarksons, the total bulk carrier fleet is expected to grow by a net 2.4% this year and a mere 0.7% in 2023. Same figures for the Panamax fleet, anticipated to grow by 3% this year and 1.6% one year from now. At the same time, ordering of bulkers and tankers, which together account for 75% of world fleet deadweight capacity has been limited, so much so that the containership sector order book is now larger than both the tanker and bulker order books combined in deadweight terms, which is the first time this has happened. Chinese newbuilding Capes are now priced at around $64.5 million, which is about 9.3% higher than they were at this time last year. As regards Kamsarmaxes, the latest price is around $37.5 million, equivalent to 15.4% more than last year's price. According to Clarksons, only 17 bulk carriers or 1.8 million deadweight reported sold for demolition so far this year compared to 5.2 million deadweight scrapped for the whole of last year. We agree with Clarksons that even though iron ore shipments are vulnerable to a world recession, grain and coal shipments will continue supporting the dry bulk market for as long as the west tries to become independent of Russian commodities. China's growth will resume through the measures that the Chinese government is taking in order to avoid a sharp slowdown, such as the creation of a $75 billion infrastructure fund, which will help revive China's economy from this quarter onwards."
}