{
    "symbol": "SNES",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 13:28:05",
    "content": "  Operator: Good day, and welcome to the SenesTech Incorporated Reports Third Quarter of 2022 Financial Results Conference Call. Thank you very much, Betsy, and thank you all for joining us today to discuss SenesTech's Third Quarter 2022 Financial Results for the period ended September 30, 2022. With us on the call today are Ken Siegel, Chief Executive Officer; Joel Fruendt, the company's incoming Chief Executive Officer; and Tom Chesterman, the company's Chief Financial Officer. At the conclusion of today's prepared remarks, we will open the call for a question-and-answer session. Statements made by the management team of SenesTech during the course of this conference call, may contain forward-looking statements, within the meaning of Section 27A of the Securities Act of 1933 as amended and Section 21E of the Securities Exchange Act of 1934 as amended and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements describe future expectations, plans, results, or strategies and are generally preceded by words such as may, future, plan or planned, will or should, expected, anticipates, draft, eventually or projected. Listeners are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances events or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors and other risks identified in our filings with the Securities and Exchange Commission. All forward-looking statements contained during this conference call speak, only as of the date, in which they were made, and are based on management's assumptions and estimates as of such date. The company does not undertake any obligation to publicly update any forward-looking statements, whether as the result of the receipt of new information, the occurrence of future events or otherwise. I'm pleased we got a chance to talk with you today, as we report another quarter of strong revenue growth, but also my retirement from the company at the end of the year, and the appointment of Joel Fruendt, as our new Chief Executive Officer. Over the past three and half years, it's been my objective as CEO to lay the groundwork for the successful commercialization of ContraPest and I think we've achieved that goal. Prior to my taking over, as the company embarked on its initial commercialization efforts, it found itself constantly pivoting from a distributor-led model to a PMP-led model, to a replacement for rodenticides model, to a green model, to an animal-friendly model, with many iterations in between. And that last point is one when I will come back to in a moment, because it leads us to Joel's appointment. We also didn't have the data to show how ContraPest worked in real-world situations, or to demonstrate both its long-term efficacy and cost effectiveness. We have since completed the necessary long-term studies and field work required by high-value customers, particularly within agricultural and urban setting. As I mentioned a moment ago, we didn't truly have a commercialization strategy, and we certainly didn't have an e-commerce platform. Since then, we have launched a highly effective e-commerce platform that allows us to sell directly to customers. This has the dual effect at providing better service to customers, and also providing some price discipline in the market. So, today about 50% of our sales are derived from the e-commerce platform. As my conversations with customers in the early days were occurring, it was obvious that we needed to create a delivery system that allowed for aboveground deployment of ContraPest for use in the agricultural segment and for the control of roof rats. Over the past few years, we've streamlined our sales and marketing efforts to address key market verticals in which we have the greatest opportunity for success including zoos and sanctuaries, municipalities and agriculture. But coming back to the beginning, perhaps one of the most important things we needed to accomplish, was to repair our relationship with the pest management industry. From a positioning standpoint, we recognized that attempting to position ContraPest as an exclusive solution to pest control, was alienating our potential PMP customers and other major players in the industry because sustainable control requires the use of multiple pest management tools. And because ContraPest is a contraceptive and not a sterilant, PMPs can improve their business models by providing a long-term solution that enables them to substantially reduce their servicing cost. In just the past, year we have started working more closely with PMPs such as Rentokil and Terminix, Massey Services and Agricom, who are now offering ContraPest as part of integrated pest management as well as continuing our joint development efforts with Lethatech . With our e-commerce platform showing strength and growth, Tom will hit on all the numbers in a moment, but we did have a 173% increase year-over-year from our e-commerce platform. I'll let him expand a bit on his background, but I think as a company we have tremendous opportunity to now take ContraPest to the next level, given the groundwork that has been laid over the past few years. I truly believe ContraPest is an industry-changing product and set against a world backdrop of sustainability, it has the potential to reduce the tremendous infrastructure cost caused by rats. The destruction of the global food supply that is lost every year to infestations, the diseases that are spread through rats, which pose a dangerous risk to public health and safety and the reduction of poisons from the environment, which impacts wildlife and humans alike. I thank all of you for the opportunity to be Chief Executive Officer, these last 3.5 years and look forward to the tremendous future, I believe is ahead for the company. As Ken mentioned, ContraPest is an effective sustainable and earth-friendly tool that has the ability to revolutionize the way pest management is conducted. There simply is no other product in the world like ContraPest, and that is where I think the true opportunity lies. My background is anchored with 15 years of executive leadership, in the vector and pest management industries where I was the Vice President and General Manager of Clarke Environmental, a leading vector and pest management products and services company. From Clarke, I bring extensive expertise in the development and manufacturing of EPA registered chemical control products, commercialization and sale of those products and leading large sales and service organizations. In conclusion, I have always had a passion and commitment to sustainable effective solutions to vector and pest control challenges. Revenue during Q3 was approximately $250,000 compared to approximately $183,000 in Q3 of 2021, an increase of 36%. So, excluding grant revenue, product sales increased 57% compared to last year. The e-commerce growth is being driven by the marketing initiatives including the award-winning Operation Rat Race campaign, which is driving consistent increases in traffic as well as increased website functionality. As mentioned in the press release, sales were impacted during the quarter by the outbreak of avian influenza or bird flu, which has impacted the poultry operators across the US and thus delayed expected deployments with certain customers during the quarter. While the bird flu has impacted poultry farms, we did have success in other agribusiness areas where we recently deployed ContraPest such as in our first pork protein production facility. Gross profit during the quarter was approximately $122,000 or 52% of total revenue compared to approximately $77,000 or 48% of total revenue in Q3. Adjusted EBITDA loss, which is a non-GAAP measure of operating performance, for Q3 was $2.5 million compared to $2.0 million in Q3 2021. In connection with that on October 12, we held a special meeting of stockholders whereby our stockholders approved a reverse stock split of the outstanding shares of our common stock by a ratio of not less than one for five and not more than one for 20 shares, with the exact ratio to be set at a whole number within this range by our Board of Directors in its sole discretion. I likewise believe we have made tremendous progress over the past three years, which has resulted in a 13-fold increase in revenue compared to the quarter when Ken assumed the role as CEO. But more importantly, I believe we have a tremendous foundation in place to build a truly great company going forward. We were modeling for sequential growth obviously, because of this probably didn't come  sales this quarter. The bird flu, as I'm sure many have read in the paper, was hitting the avian industry across the nation starting on the East and moving towards the West. We did have a slowdown in that our existing customers could continue to order from us, but we're not allowed onto the property of any of the bird farms if you will. And so we really were not able to do any sort of marketing sales activity out to new customers, until they were able to open up the farm gates and let people in. So one of the bigger issues is, we learned in talking to the pest management professionals that service that industry is essentially with the flu, as Tom points out, the farms essentially locked down and sole focus was really on dealing with the outbreak. So pest control, which was largely off the list for the past several months should become a critical consideration for them going forward. As I mentioned, we are entering a new phase of SenesTech's growth, and I am excited to be part of it, and to be sharing it with you all today."
}