{
    "symbol": "SNES",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 22:32:04",
    "content": "  Operator: Good afternoon, and welcome to the SenesTech Reports First Quarter Fiscal Year 2022 Financial Results. As Cole mentioned, to discuss SenesTech’s first quarter 2022 financial results for the period ended March 31, 2022. With us on the call today, Mr. Ken Siegel, the company's Chief Executive Officer; Mr. Tom Chesterman, the company's Chief Financial Officer. At the conclusion of today's prepared remarks, we will open the call for a question-and-answer session. Statements made by the management team of SenesTech during the course of this conference call may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 as amended and Section 21E of the Securities Exchange Act of 1934 as amended, and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements describe future expectations, plans, results or strategies and are generally preceded by words such as may, future, plan or planned, will or should, expected, anticipates, draft, eventually or projected. Listeners are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors and other risks identified in our filings with the Securities and Exchange Commission. The company does not undertake any obligation to publicly update any forward-looking statements whether as the result of the receipt of new information, the occurrence of future events or otherwise. As you saw in the press release, we started 2022 where we left off in 2021 with another quarter of record product sales, which more than doubled from the same quarter last year. We have now had nine consecutive quarters of annual quarterly revenue growth, eight of those at 2x or greater since I took over as CEO. Importantly, the monthly sequential trends in the first quarter show continued acceleration of growth in our e-commerce business with sales in the month of March, up more than 80% compared to February. But needless to say, we think it bodes well for a continuation of the recent sales growth trends. The other key development this month is the launch of our novel Elevate Bait System with ContraPest or what we're generally calling Elevate, which will begin shipping next week. I believe the introduction of Elevate will be a defining moment where innovation enables us to accelerate our penetration into a number of key markets, particularly agriculture. So with those general highlights of strong sales acceleration and new product introductions, let's dive into a few more specifics. As I mentioned, sales for the quarter were up 122% compared to the year ago first quarter and up sequentially by 15%. We continue to significantly ramp up our customer acquisition efforts led by our Operation Rat Race campaign, which has helped to drive a 438% increase in active customers during Q1 2022, compared to Q1 2021 and up 46% sequentially compared to the year end numbers. As we stated in the past, we are taking a very analytical approach to our marketing efforts to ensure we are driving down our customer acquisition costs and increasing the lifetime value of our customers. We're also making continued improvements in our overall sales and marketing approach, including the pickup of some significant press coverage that has driven customers to our website. The article in the Vanguard daily news titled rat birth control could combat annoying rodent infestations, highlighted the benefits of ContraPest. Ours remain flat, and that's a strong sign that we have a broader customer base than we may have originally anticipated but also clearly indicated that our product is relevant to a wide segment of the pest control market and is not just attractive in areas that have restricted rod genocide use like California. And now with the launch of Elevate, we're adding industry-specific targeting to our digital footprint through trade publications, through associations and through targeted search. Further in March, we went live with our Instagram shopping experience, customers can now learn and shop inside the social platform, keeping them captive at a time of interest versus relying on them to search for us on the web. Also, we recently added a popup on our contrapeststore.com to buy now, which is assisted in generating additional sales. To further enhance the customer experience, we'll be launching a new e-commerce site later this month, so called contrapeststore.com, but with a new look and feel to better match our successful campaign aesthetics. As we continue to hit new monthly goals for a number of customers, as well as number of subscriptions. From a market vertical standpoint, we continue to see strong adoption by zoos and sanctuaries, which accounted for about 18% of our first quarter sales. One very influential customer in this space, The Miami Zoo has credited the use of ContraPest enable them to finally gain control of their rat population around their aviary, resulting in the recent birth of chicks to birds that hadn't reproduced in over three years. To build off this momentum, on April 1, we launched a new contract program specifically designed to target the zoos and sanctuaries vertical and designed to help with the initial cost of a ContraPest deployment. As I touched on a moment ago, we're also starting to see PMP growth begin to accelerate. Our awareness campaigns are generating pull through demand from end user customers, as well as interest from PMPs who have challenging accounts and are looking for ContraPest as a solution. We have new customers taking our product to zoos, grain facilities, correctional facilities, animal rescue facilities and residential areas just to name a few. As pressure on the use of second-generation anticoagulants continues to grow, we're also seeing interest from PMPs looking for new solutions as their normal go-to products are being challenged. Elevate has also generated inquiries from PMPs battling roof rats, who are eager for a new tool in the fight. As I mentioned in March, we're now seeing growing interest for major PMPs, including some of the largest players that were previously committed to their old solutions. I touched on this a bit during the March call, but since they were first quarter events, I believe it bears repeating that on the government front, we've announced a number of key deployments in various locations. Clearly more and more cities, counties and government customers are recognizing the growing success of ContraPest through various media reports and our sales and marketing efforts. For instance, following the recent successful deployments in Newton, Massachusetts and Hartford, Connecticut, we now have a growing number of governmental entities and communities in New England reaching out for additional information. The same is occurring around Columbus, Ohio, San Francisco, and elsewhere, where we're continuing to work hard to convert these inquiries into paying customers. Also during the first quarter where California-based sales were approximately 23% of our overall product sales, Los Angeles County specify the use of fertility control and one other request for proposal. Given California's move away from second-generation anticoagulants pursuant to the Ecosystem's Protection Act, we expect this trend will continue in future RFPs. And as I've stated in the past as the only EPA registered product available for fertility control in male and female rats, this puts ContraPest in an excellent position for further penetration of the government market. Before I turn the call over to Tom to review the financials in a bit more detail, let me just explain – let me just expand upon the Elevate system and how we're approaching the commercialization efforts for this new product. While our experience with agricultural applications demonstrates the efficacy and economic value of ContraPest, our customers have been requesting an additional baiting option to target rats where they often live specifically in rafters and other above ground locations. The novel suspended bait station we created is easily accessible by rats, but out of the way of people, pets, livestock, food stores, et cetera. And the design of the system is such that it permits easy drop in and replacement of new 8 ounce bottles of ContraPest, reducing both servicing time and cost. As I stated on last quarter's call following the EPA’s approval, we needed individual state registrations. Elevate is now available in 48 states and the district of Columbia with the remaining states, Oregon and California requiring a little bit of additional time to review submissions. At the end of the day, we believe Elevate is the critical tool that allows for ContraPest’s potentially explosive growth in the agricultural segment. We will be shipping the product next week, and I look forward to providing updates on the progress for this product on our next call. So to summarize with growing market awareness and adoption for ContraPest, which is highlighted by record quarterly sales, coupled with the introduction of the Elevate system, we're off to a strong start in 2022. I believe ContraPest is the right product for pest control with significant growth potential based on its efficacy, environmental and regulatory requirements, as well as social trends. And while we look forward to continuation of the recent trends in the quarters to come, excuse me, we have in place the necessary elements to accelerate growth even more. Revenue for the first quarter was approximately $195,000 compared to approximately $88,000 in the first quarter of 2020, an increase of 122%. Gross profit for the first quarter was approximately $90,000 or 46% of total revenue compared to approximately $38,000 or 43% of total revenue in the first quarter of 2020. Adjusted EBITDA loss, which is a non-GAAP measure of operating performance for the first quarter was $2 million compared to $1.6 million in the first quarter of last year. We are continuing to invest in revenue generation, although we carefully monitor the specific programs for efficacy and cost effectiveness and main strict control over other aspects of the business. That said, as mentioned previously, we have filed an S-3 for renewal of our shelf capacity, which expired earlier last year. First, if you are success – congratulations on the progress you've made both on the sales front and more important on Elevate because I like you, I'm excited about that. The other things that are necessary to meet demand, we have pretty carefully structured the supply chain so that we can meet a surge in demand, whether it be for the traditional ContraPest tank or for the Elevate Bait System. And are you – as you understand, we're in a much different market, which is much less forgiving of companies who are funding growth, while they remain unprofitable. That said, you're right, we do need to be very vigilant and very careful about opportunistically accessing the capital markets. Again, good quarter for us, as you've seen, we continue to – at the revenue ramp that we've been talking about for a couple of quarters, as Tom and I both said, we think there's hopefully more to that to come in the near future."
}