{
    "symbol": "IART",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 15:19:04",
    "content": " Third quarter total revenues were $385 million, approximately flat on a reported basis, inclusive of a TWC divestiture impact of $3 million and a $12 million impact due to unfavorable foreign exchange compared to last year, representing an approximate 300 basis point negative impact to reported growth. As Jan mentioned, excluding CereLink organic growth across the remainder of the portfolio was just over 5% which speaks to the diversity of our portfolio and continues to give us confidence in our long term growth expectations as we move past the current macro challenges, and target to bring CereLink back to market in the first half of next year. Adjusted EBITDA margin for the quarter was up 30 basis points versus the prior year, and adjusted earnings per share was flat at $0.86, much higher than our guidance expectation, reflecting strong operating expense management and a lower CereLink impact. The lower gross margin was due in part to unfavorable regional mix driven by higher international sales and by 30 basis points impact from accruals booked in the quarter for the CereLink recall, including the returns provision I talked about earlier, and an $800,000 rework accrual. For the fourth quarter we expect reported revenues in the range of $391 million to $403 million, representing reported growth of approximately minus 0.5% to minus 0.6% and organic growth of approximately 1.3% to 4.3%. The line is open, now please go ahead. The line is open now, please go ahead. Your line is open now, please go ahead. I donâ\u0080\u0099t -- that last slide that we added in, I hope, is helpful because I think with thereâ\u0080\u0099s so much noise around the FX and our divestiture and obviously, the CereLink recall, we wanted to help you provide some additional perspective of that when you unpack all of that, our EPS performance has actually been quite strong this year and flowing through that third quarter performance to the full year. The line is open now, please go ahead. Your line is open now, please go ahead. The line is open now, please go ahead. And I donâ\u0080\u0099t expect you guys to provide guidance at this point, but I did want to see -- if you look at where the Street is with the Street is theyâ\u0080\u0099re expecting above 5% organic growth, I think, over 100 basis points of operating margin improvement. The line is open, now please go ahead. The line is open, now please go ahead."
}