{
    "symbol": "IART",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 15:32:04",
    "content": " Please go ahead, sir. The sale of our Traditional Wound Care business is one of the series of steps we have taken over the past two years to optimize our product portfolio, which has enabled us to focus on Integra's core market leading products in neurosurgery surgical instrumentation and regenerative tissue and move us closer to achieving our long-term organic growth and profitability targets. We're tightening our full year organic growth guidance at the bottom end, which reflects our solid first half performance, but also recognizes a mix of opportunities and challenges ahead of us in the second half. For the full year 2022, we expect private label organic growth to moderate to mid-single digit range, in line with our long-term growth expectation for this business, as our partners manage their inventories more closely in the second half. First, in our international business, we delivered above 6% organic growth in the first half of the year, reflecting deeper penetration in our international markets, particularly China and Japan. Please go ahead, sir. Your line is open. Your line is open. Your line is open. And you know, in terms of our full year guidance, again, I think we have a lot to be reasons to be optimistic on our markets and capabilities to capture growth, and that's why we left the top end of our full year guidance at the 5.2% organic growth. Your line is open. Your line is open. Your line is open. Please go ahead, sir. Your line is open. Your line is open. And what that translates to for the total international business, I have to say this with all these challenges, international organically grew 8% in the second quarter and we did over 6% for the first half of the year, its been a really challenging environment. Your line is open. So, I think what we've seen is the benefit in the first half with some timing of orders and as we think about the second half, our expectation is that our partners will more closely manage that inventory, and that's why we would expect it to moderate to mid-single digits for the full year. So, as we think about the updated guidance for the third quarter for the balance of the year, we've assumed that for the full year that private label growth moderates to mid-single digits for the whole year, which implies negative growth for private label in the second half and that is embedded in our guidance range. Your line is open. And so we would expect the second half to see higher capital spending levels compared to the first half and spending likely to be in that $65 million, $70 million type of range for the full year. Your line is open."
}