{
    "symbol": "AOUT",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-01 21:52:11",
    "content": " In the second quarter, we achieved net sales growth of 14% above our pre-pandemic levels of fiscal 2020 and we introduced several new innovative products, while strengthening our balance sheet and marking a number of achievements that support our strategic priorities and reflect our dedication to leveraging our culture of innovation to deliver solutions for consumers in the moments that matter. While we do so we will continue to invest in our infrastructure and our robust new product pipeline, seeking out opportunities to lower costs where we can and ensuring we remain well positioned to achieve our long-term plan, which is to reach $400 million and beyond in net sales and EBITDAS margins in the mid to high teens. Net sales for Q2 were $54.4 million, a decrease of 23.1% compared to the prior year, and an increase of 14% over the pre pandemic second quarter of fiscal 2020. E-commerce channels accounted for roughly 42% of our sales in the quarter at $22.7 million, representing a decrease of 17.5% from Q2 of last year, but a significant increase of over 171% over the pre pandemic second quarter of fiscal â\u0080\u009820. Net sales in our traditional channels, which consists of brick-and-mortar retailers decreased 26.6% in the second quarter, compared to last year, which we believe is due to lower foot traffic at most retailers locations during the period, combined with their continued efforts to reduce their overall inventories. We still anticipate spending a total of $1.7 million in onetime OpEx for implementation cost as well as $500,000 in duplicative costs to operate both our current and new ERP systems in parallel through February, both amounts will be treated as non-recurring implementation costs when calculating non-GAAP operating expense and adjusted EBITDAS. And we're going to continue to drive those in -- that inventory balance down to convert cash in the second half of the year, we've talked in the past about the $100 million plus is probably too high of an inventory balance."
}