{
    "symbol": "CX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-13 16:30:21",
    "content": "  Operator: Good morning, and welcome to the CEMEX Fourth Quarter 2022 Conference Call and Webcast. We hope this call finds you in good health, and let us take this opportunity to give you our best wishes for 2023. 2022 was a year of unexpected challenges for many businesses, as inflation spiked to 40-year highs. In fact, the U.S. reported record fourth quarter results. Importantly, after several quarters in which we have been able to offset inflation in dollar terms, I'm seeing growing evidence that actual margin recovery is underway. We continue to roll out our growth investment strategy with the recent announcement of the acquisition of Atlantic Minerals, which will increase our U.S. aggregate reserves by approximately 20%. During the quarter, Standard & Poor's upgraded our rating to BB+, one notch away from investment-grade. In Climate Action, we led the industry in validating our new 2030 targets and 2050 net zero goals with the SBTi under the newly announced 1.5 degree scenario. Since we introduced our future in Action program in 2020, we have reduced emissions by 9% to date. During the quarter, we launched our new business, Regenera, which is devoted to waste management and circular solutions and the latest addition to our Urbanization Solutions segment. For the full year, net sales rose double-digit due to strong pricing momentum. With the sudden spike in inflation in second quarter attributable to energy and distribution costs and exacerbated by supply chain disruptions stemming from the Ukraine war, margin declined by 2.5 percentage points. Largely due to our effective pricing strategy, we were able to contain the impact on EBITDA to a 3% drop. Inflationary headwinds particularly in energy were significant, but our year-long effort to offset rapid rising cost is paying off with stable year-over-year EBITDA. While EBITDA margin declined, the contraction was the lowest of the year and sequential margins stabilized in the quarter where we historically see a significant decline due to seasonality. As is typical for fourth quarter, we experienced strong free cash flow conversion, generating close to $60 million more than the prior year. The decline in fourth quarter consolidated cement volumes results from difficult weather conditions in the U.S., weak back-cement demand in Mexico and SCAC and slowing growth in Europe. We continue to see strong growth from the formal sector in Mexico and SCAC, but not sufficient to completely offset the informal sector decline. Pricing, however, is not the only lever, and we remain focused on managing costs with our energy diversification, supply chain and climate action strategies. In fourth quarter, the net contribution of pricing over cost was the highest in the year. Cement, due to its energy intensity has been the product most impacted by inflation and the biggest headwind to margins. Since second quarter, we have successfully offset input cost inflation in cement in dollar terms. By the fourth quarter, we began to see actual margin recovery. In 2023, with easing cost pressures and pricing momentum, I expect to see further margin improvement, particularly in the second half. Progress, however, will not be linear due to seasonality and timing differences on maintenance and pricing increases. CEMEX was among the first companies in our industry to receive validation from the Science-Based Target initiative of our 2030 and net zero CO2 goals under the 1.5 degree scenario, the most aggressive pathway for our industry, covering Scope 1, 2 and 3 emissions. In the two years since we first rolled out our sustainability program, Future in Action, we have achieved a record reduction in carbon emissions driven largely by an expansion in alternative fuel usage and a lower clinker factor. During this period, our CO2 emissions declined by more than 9%, a reduction that in the past, took more than a decade to achieve. In 2022, alternative fuels hit a record 35% of total fuels usage. Clinker factor declined 1.5 percentage points, opening up capacity in highly constrained cement markets. And in three short years, our Vertua family of sustainable products and solutions has gained widespread acceptance across all regions. Over the last three years, our Urbanization Solutions business has been focused on the products and services to serve the needs of growing sustainable cities of the future. It includes four verticals and one of these verticals, circularity, received a big push in fourth quarter with the launch of our new business, Regenera. Regenera will focus on recovering, managing, recycling and co-processing three waste streams: first, municipal and industrial; second, construction, demolition and excavation waste; and finally, third, byproducts of industrial processes. For example, in Mexico, we are processing around 25% of Mexico City's municipal waste. And now back to you, Lucy. Our business experienced significant cost pressures, mainly in the form of higher fuel and distribution costs, coupled with a post-pandemic rebalancing of bagged cement volumes. While pricing increases were some of the highest on record, it was still not sufficient to recoup margins. In fourth quarter, with continued inflation pressuring retail demand, bagged cement volumes moderated while bulk cement grew high-single digits. As our pricing strategy continued to make inroads in catching up to inflation, year-over-year EBITDA rose for the first-time in five quarters. While margins declined due to higher energy, raw materials, freight and wages as well as product mix, the decline moderated versus full year performance. As part of our cost containment and decarbonization efforts, we have moved aggressively in Mexico to substitute fossil fuels with alternative fuels for our accounts. In the quarter, alternative fuels exceeded 40%, a record, representing a 12 percentage point year-over-year increase. For 2023, we expect cement volumes to remain flat while ready-mix and aggregates grow at mid and high-single digits, respectively. The industrial and commercial sector, driven by near shoring and tourism should remain the driving force behind 2023 volumes, while government social programs should help offset continued weakness in household demand. In the U.S., despite significant weather challenges impacting much of our markets, EBITDA grew mid-teen percentage points to a record fourth quarter result. Year-over-year EBITDA margin expanded for the first-time since early 2021, while sequential margins also improved for the second straight quarter, benefiting from higher prices, lower maintenance and lower imports. We announced a price increase effective January 1, and to-date, we are seeing good traction. In January, we signed an agreement to purchase Atlantic Minerals Limited in a transaction that will expand our U.S. aggregate reserves by 20%. For 2023, we expect low-single digit volume decline across all products, driven by the residential sector. We remain optimistic on growth in industrial and commercial and infrastructure sectors, underpinned by near shoring trends along with funding available under the CHIPS Act, the Inflation Reduction Act and the Infrastructure Investment in Jobs Act. As of December, trailing 12-month contract awards in our key states for highways and street and industrial and commercial were up 16% and 29%, respectively. In fourth quarter, while sales continued to show strong growth driven by pricing, EBITDA growth slowed due primarily to energy costs, declining volumes and higher maintenance. Pricing remained strong with sequential increases in cement and ready-mix, reflecting fourth quarter price increases in several markets. In Europe, EBITDA growth of 9% in fourth quarter largely reflected our pricing efforts while volumes declined as a result of recessionary fears. During the year, our European operations continued to lead the way on climate action, achieving a 41% reduction in carbon emissions since 1990. For 2023, we expect cement volumes in Europe to decline mid to high-single digit, with ready-mix volumes falling low to mid-single digits and aggregates volumes relatively flattish to down. Over the medium term, volumes should be supported by public and private projects worth more than EUR2 trillion related to transportation, climate adoption and energy reconfiguration as well as onshoring investment opportunities. In the Philippines, cement volumes declined as the country transitions to a new government and macro challenges impact demand. For this year, we expect volumes to perform between flat and a low-single digit decline. For Israel, while demand remains robust, we expect ready-mix and aggregate volumes to decline low-single digit, reflecting our capacity constraints. Net sales in our South, Central America and the Caribbean region slowed in fourth quarter. Bulk cement, ready-mix and aggregate volumes continue to grow, supported by formal sector demand, mainly in the industrial and residential sectors. The decline in EBITDA and EBITDA margin reflects energy, freight and raw materials cost headwinds. In Colombia, cement volumes rose slightly in the quarter, driven by social housing. For 2023, we expect cement volumes in Colombia to be flat while ready-mix volumes to increase high-single digit. Construction activity should continue to be supported by social housing and infrastructure projects, particularly in the Bogota area. In the Dominican Republic, cement volumes declined in the quarter due to a drop in retail cement demand that was partially offset by higher bulk cement related to tourism projects. For the year, we expect cement volumes in the Dominican Republic to remain flat to slightly down. In Panama, we continue operating as an export hub, sending record cement volumes to nearby markets within the region, reducing dependency from third-party suppliers. I invite you to review CLH's quarterly results, which were also published today. As we all saw, financial markets experienced unprecedented volatility, with inflation reaching levels not seen in decades and central banks implementing monetary tightening measures globally. In our industry, this volatility played out largely in the form of rising energy and transportation costs as well as continued supply chain disruptions. Of course, this is an ongoing effort, and you should expect continued execution of our pricing strategy in 2023 to regain our 2021 margins. Additionally, we remain focused on several initiatives to improve efficiency and lowering the cost of managing our business. The stable year-over-year EBITDA in the quarter, the first in three quarters, speaks to the success of our pricing strategy. The improving EBITDA trend, coupled with a higher turnaround in working capital and lower maintenance CapEx, delivered approximately $60 million more in free cash flow after maintenance CapEx than last year's fourth quarter. On a full year basis, free cash flow after maintenance CapEx was $553 million, down from the prior year due to a higher investment in working capital and maintenance CapEx. The investment in working capital reflects strong revenue growth and the inflationary impact on inventory, as well as the need to run higher inventories to address persistent supply chain issues. The increase in maintenance CapEx for the year relates primarily to some catch-up maintenance as well as the delayed delivery of mobile equipment and spare parts in 2021, which pushed our maintenance calendar into 2022. The decline in quarterly net income results from the non-cash impairment of goodwill for $365 million, primarily in the U.S. and Spain. Adjusting for this impairment, net income for the quarter would have been $266 million, 36% higher than last year's fourth quarter. Last year, we took advantage of market volatility to conduct several accretive transactions. Overall, we reduced total debt by $409 million during the year. Also, we maintained robust risk management strategies that in 2022 partially shielded us from the impacts of rising interest rates, a stronger dollar and higher energy costs. During the year, we linked our new EUR500 million loan and migrated our accounts receivable securitization program to our sustainable finance framework. With the inclusion of these programs, we now have approximately 42% of our debt linked to sustainability KPIs, and we remain on track to reach our goal of 50% by 2025 and 80% by 2030. We expect low-single digit growth in EBITDA in 2023, as we assume continued pressure on volumes due to global recessionary concerns. While we acknowledge moderate risk to volumes, we believe that markets will remain supportive of pricing. We do expect continued headwinds on cost, particularly in electricity, but the impact should be less than what we experienced in 2022. Energy cost per ton of cement produced is expected to ease, estimating a 10% increase for this year. We continue to expect an investment in working capital in 2023, reflecting the higher sales but overall days working capital should improve. Finally, our cash cost of debt, including the coupons of our subordinated notes is expected to increase around $70 million, reflecting the repricing of our limited floating rate debt exposure. And now back to you, Lucy. Before we go into our Q&A session, I would like to remind you that any forward-looking statements we make today are based on our current knowledge of the markets in which we operate and could change in the future due to a variety of factors beyond our control. In addition, unless the context indicates otherwise, all references to pricing initiatives, price increases or decreases refer to prices for our products. In terms of fuel and electricity last year, about $1.7 billion or 12% of our COGS were represented by that. And as you know, we have a guidance of 10% growth for the year in that. In fact, 90% of that is due to electricity. Now just to put it into perspective, diesel compared to the $1.7 billion was around $340 million or 2% of COGS. Now in the case of diesel, we currently have about 75% hedged for 2023. And so, we may get a little bit of a higher cost because of the hedging activity that we did towards the second half of last year. On the first part on CO2 reduction, maintaining or accelerating the ratio that we managed to reduce close to 5% in '22 and also in '21. But on the conventional part, the 5% for a couple of years, I think the -- we took opportunities that were there and speeded up the process in order to make them a reality. If we refer to the public targets we have, just to use one example, on CO2 reduction, we have a target of in '25 of 520 kilos per CO2. So when comparing to the 2022 reported data, that's a reduction of 9%, which implies a reduction of 3% per year, meaning we are expecting that these 5 percentage points of reduction will start little by little, declining and they will remain for the whole period from now or from '23 up to 2030 in the range of 3% to 3.5%. Now another clarification that I would like to make is that the conventional ways to reduce CO2, it happens that there are -- there is innovation in those conventional ways, improving or increasing the impact that they historically had, for instance. The use of certain amounts of hydrogen in the plants using high levels of RDF waste as a few, it's been working very well. So as reported in the last quarter of last year and for the first time in history, we had as much use of alternative fuels when compared with what has been our principal source of fuels, which is pet coke. And considering just the month of December, that proportion for alternative fuels is even higher. So I think in '22, '23, we are witnessing the milestone of alternative fuels becoming the principal source of fuel in our plants with all the advantages, advantages in cost, they got less than half of our primary fuels, benefits in terms of contribution to participating in the use of and recovering waste. As we have commented before, we are taking care of 25% of waste of Mexico City, and we use most of that in our plants as fuel. In the case of Europe, which last year, we -- even though we had a large proportion of alternative fuels, we increased it for another 8 percentage points. '22, we increased our use of alternative fuels in 6 percentage points. So I think the reduction will start -- we will see start seeing a reduction moving from the 4.5%, 5% to the range of the 3% to 3.5% until we are ready to commit with reductions because of CO2 capture. I think what excites me or what excites us is not necessarily one particular event, and I will mention one or two, but I think what excites us is to see how CEMEX Ventures is allowing us to attract and to invest and to integrate a number of different technologies that nowadays have to be integrated into our cement plants. I'm referring to the possibility of electrifying more the changes in process like electrifying the process itself, so in order to use more electricity and less fuels, other processes, completely different processes to produce cement or the process that we announced through our partnership with Synhelion, meaning to produce clinker now that it is feasible to concentrate solar energy into very high temperatures, the ones needed to produce clinker. My one question would be on the pricing traction, what you're seeing and how you think about pricing initiatives for 2023, particularly in key markets like the U.S. and Mexico. We're coming in from a very healthy pricing environment, albeit and you saw the results, the pricing contribution to our EBITDA for the year and certainly for the quarter has been in excess of inflation. However, we continue with our pricing strategy because the inflation acceleration has been much higher than our ability to raise prices. So there's definitely -- the job is not done, completed yet on the pricing strategy. Now having said that, we've seen very good evolution of pricing increases in all of the markets. So just to give you an idea, for instance, Mexico, we have a pricing increase, double-digit 15% to 20%. We have double-digit increases, mid to high-teens in several of our European markets, Spain, Poland, Czech Republic, Croatia. Double-digit increases in Colombia, in the high-teens, 20% range. I mean essentially, more than 80% of our volume is being repriced in the early part of the year and we think that there is very good traction. In Europe, a very important part of the pricing pressure on everybody is the continued pressure on the price of carbon, and so that's a very important part of inflation there. I mean, we think that this momentum should continue despite a little bit of a backdrop of slower demand in some of the markets that we're operating in. Thank you very much. Regarding deleveraging, last year, you reduced $300 million in net debt, and the implied free cash flow for this year looks around $300 million to $400 million. So again, I think it's very important to clarify to you and to everybody else on this call why is investment grade is so important for us. It's what it implies, which is the strength of our capital structure, lower volatility, our ability to generate more free cash flow per dollar of EBITDA, be able to eventually, as a consequence of that, but consider returning capital to shareholders. I think what you have observed is pretty well aligned to the adjustments that we announced early 2020, adjustments to our strategy. Just to remind them a little bit is to strengthen our portfolio in the U.S. and Europe, to include what we are calling Urbanization Solutions as a fourth leg in our portfolio and strategy, to continue reducing our leverage ratio and making some divestments in emerging markets. So if you review what has happened in the last couple of years, that it's precisely that. The investments that we have announced recently in the U.S., the aggregate business in Canada to serve markets in Florida and in general, the East Coast of the U.S., some ready-mix businesses in Texas, another aggregate business in Europe, those investments are also aligned with that strategy. We are also taking the opportunity to invest and increase our EBITDA in one of the issues that have proven very useful and profitable, which is alternative fuels. Last year, we finished and putting in operation for investments, one in Russeldorf (ph) and another one in Rugby (ph), one in Tepeaca and  in Mexico. And those, even though they were not fully operational for the 12 months, they were very helpful for our increase of 6 percentage points in alternative fuels and very profitable. But nowadays, with the current cost of primary fuels, they are -- they have extremely good paybacks. And what do you -- what is not doable or what we think we have to be flexible is that given that this involves investments and divestments and there is uncertainty in the events, we -- in short terms, in quarters or even in a year, we don't have the, let's say, the proportion that we would like to have between debt reduction and the growth investments. So if you take a couple of years, you will see that the proceeds we use for debt reduction and for growth investments are very similar, are almost half and half. But we want to keep this pace of strengthening our position in the U.S. and Europe, divesting in some emerging markets, increasing and growing our Urbanization Solutions sector and doing more and more portfolio management. The rest of investments are the both on the type of investments that we started making mid-2020, with the characteristics of having high returns, short paybacks and related to our current business base. So as we commented last year, those investments already contributed with 100 -- more than $100 million of EBITDA and this year will be higher. And also, any potential color on some of the maintenance work that you've done in the U.S. and to what degree that's going to be continued into '23. Thank you very much. There were some plants in the U.S. that, for many years, were not highly demanded. And now that we are at full speed, that there were and still are some investments needed to bring those plants to its highest capacity and higher possible reliability. When you engage in these type of projects, and that was the case during last year, sometimes you need to make investments and you need to shut down your plant more than 15 days, which is more or less the average of our regular annual shutdown, impacting production. Well, there was -- if you could provide a bit of a sense, so you're saying the import is going to be coming down a bit. So the answer to your question is that, yes, the 10% increase in energy cost per ton that we have announced does incorporate the impact of those contracts not being there anymore. And roughly 90% of that is electricity, and Mexico is roughly about a quarter of that. So I'll ask another question, Fernando, which is the -- what's the -- how are you feeling generally in the U.S. on the sort of take-up and the speed of the infrastructure plan related projects? Are you seeing -- I mean, I think when you spoke to sort of industry sources, people thought for the -- that by the fourth quarter of this year, you will have sort of perceptible traction on that. Of course, it is -- another way to put it is that it is clear that order books for the next three to six months are still not capturing that type of volume, but things are moving forward. So we do expect that for the, let's say, late this year, that will start showing up. Certainly, in contract awards for our footprint, we're seeing double-digit increases both on the infrastructure side as well as the industrial and commercial, which I think is very important to note. We have seen residential slowing a little bit in some of our markets, particularly in Northern California is the one that we've been citing the most. But weather had a very large impact in our results, which were still very good in the U.S. And I think that's important to note. Gordon, I just wanted to stress one thing is that our performance in the U.S. has been, despite the fact that we've seen slower-than-expected spending on the infrastructure side, and it's good and bad, right? But on the positive side is that, that should bode well for the U.S. business for the next couple of years because there is a very material pent-up fiscal stimulus in many ways, both because of the infrastructure bill, because of the CHIPS and innovation bill. And so for the next couple of years, the outlook should be quite positive for volumes. And if we take a look at what's happening in industrial and commercial, which has been the sector that has been the best performer for us, it's growing, in the fourth quarter, almost 9%. So you're right, in 2022, the contribution of infrastructure in terms of growth was not necessarily there. And I guess just, it's still fair to say that in your footprint in the U.S., sort of the sum of your non-residential segments is still around 70% of volumes, right? I mean, if residential was 35% in '22 and industrial and commercial is about 15% and then infrastructure is about half -- is the remainder is half. Thank you very much. So I wanted to ask you, I think what your future expectations are for some of your new bolt-on investments. And as part of that, you just made an announcement recently about a fully electric vehicle joint venture with Volvo, and what your timing is for the rollout of that. As somebody asked before on CEMEX Ventures and are we excited because of what's going on, Volvo is one of those partnerships agreements, collaboration agreements for us to integrate a number of technologies that traditionally has not been part of the cement or ready-mix technologies, meaning we think we know how to make cement and ready-mix and aggregates, but for sure, we needed to learn about how to use and to design and to use electric heavyweight vehicles, the same way we needed to learn about solar energy, the same way we needed to learn on hydrogen to be used in combination with RDF. I mean, on the growth side -- yes, on the growth side, as you saw in '22, the growth component contributed a little bit over $100 million in incremental EBITDA, and that's a variety of projects that we've announced during the course of the year. For this year, for '23, we're expecting a little bit more than that. And on the bolt-on side, in addition to a number of projects, which I can give you some examples of, we do have some completion of some legacy projects in terms of cement production that is probably in excess of 4 million tons of additional capacity. Most of our investments are going to continue to be focused on the U.S., Europe and, to a lesser extent, in Mexico. And sustainability, really the big part is the substitution of alternative fuels and the ability to improve the fuel efficiency in our kilns. These are going to be tending to be fairly smaller projects, although the transaction that we did recently, the aggregates transaction that you saw in the U.S., it's not that big but it's quite material. And we're quite confident because of the diversification of those investments and because of the fact that they're in very known markets, complementing known footprint and existing business positions. We're fairly confident about the IRRs that we are expecting to get, which are -- which continue to be well above 20%. These are -- these tend to be much shorter, much higher paybacks, especially in light of the escalation in fuel costs that we have seen."
}