{
    "symbol": "YMM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 12:58:49",
    "content": " Turning to our online transaction service, the segment maintains sustainable growth in the fourth quarter amid the volatile macro environment, showing a 67.4% increase year-over-year to RMB447.8 million. The 2022 our net revenue from freight matching services including service fees from freight brokerage models, membership fees from listing models and commissions from online transaction services or RMB5.7 billion, up 43.3% from 2021 and RMB1.6 billion for the fourth quarter up 31.4% year-over-year, primarily due to the rapid growth in transaction commissions as well as an increase in revenues from our freight brokerage service. Net revenue increased by 24% to RMB943.6 million in the fourth quarter, primarily driven by continued growth in transaction volume as a result of improved user penetration. Revenues from freight listing service were RMB852.4 million for the full year up 13.2% year-over-year and rose 11.2% year-over-year in the fourth quarter to reach RMB223.1 million, primarily due to an increase in total paying members. On a quarterly basis the net revenue amounted to RMB447.8 million in the fourth quarter, representing a 67.4% increase year-over-year, primarily driven by a extended take rate as well as improved commission penetration. For the fourth quarter, net revenues increased to RMB308.1 million, representing a 53.7% increase year-over-year, mainly attributable to an increase in revenue from credit solutions and other value-added services. Looking at our business outlook for the first quarter of 2023, we expect our total net revenues to be between RMB 1.56 billion and RMB 1.64 billion, representing a year-over-year growth rate of approximately 16.9% to 23%. Additionally, as part of our strategy to increase user growth, we remain focused on prioritizing user experience in the fourth quarter, for example we committed to improve the fulfillment rate of new non-member users, first three orders on a platform and increased our telemarketing coverage."
}