{
    "symbol": "YMM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-23 09:29:04",
    "content": " Our third quarter average fulfilment rate reached approximately 25%, an increase of four percentage points on a sequential basis, despite the weak demand in the third quarter and a particularly hot summer, which diminished trucker's willingness to take freight orders. Meanwhile, driven by increasing dependence on our platform, user's transaction frequency and activity level also improved, as evidenced by average quarterly fulfilment per monthly active shipper and monthly active trucker fulfilling orders strengthening quarter-over-quarter. In the country, the 12-month retention rate of paying shippers and the next month's retention rate of truckers who responded to shipping orders on our platform, both remain high at around 85% in the third quarter, following the trend of previous quarters. Our total net revenues in the third quarter were RMB1.8 million, representing an increase of 45.7% year-over-year, primarily attributable to an increase in revenues from freight matching services. Revenues from freight matching services, including service fees freight brokerage models, membership fees from listing models, and commissions from online transaction services were RMB1.5 billion in the third quarter, representing an increase of 39.5% year-over-year, primarily attributable to an increase in revenue from our freight brokerage services as well as rapid growth in transaction commissions. Revenues from freight brokerage service in the third quarter were RMB904.1 million representing an increase of 31.2% year-over-year, primarily driven by continued growth in transaction volume as a result of improved user penetration. Despite rapid growth in shipper MAU in the third quarter, overall, other postings remain flat year-over-year, partially because our newly registered monthly active shippers are low and medium frequency shippers and their contribution to other volumes remain relatively small when they were first onboarded."
}