{
    "symbol": "UTHR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:23:06",
    "content": " Having said that, and based on the stats that I just provided, weâ\u0080\u0099re well positioned as it relates to our goal of around 6,000 patients â\u0080\u0093 6,000 Tyvaso patients by the end of the year, and weâ\u0080\u0099re continuing to build really good momentum heading into next year. Your line is open. In terms of the DPI â\u0080\u0093 in terms of the patients coming on, I will say that the DPI uptake, the uptakes have been faster on de novo than transitions, and I think thatâ\u0080\u0099s just a function of as weâ\u0080\u0099re out talking with physicians theyâ\u0080\u0099re not proactively calling their existing Tyvaso patients and to transition them to DPI. Your line is open. One is, one, just I think the â\u0080\u0093 just the United Therapeutics support services, the fact that weâ\u0080\u0099ve been in the market for 25 years, Physicians know us, they know that weâ\u0080\u0099re committed to the patients. Your line is open. So itâ\u0080\u0099s still really, I think, too early to tell whether thereâ\u0080\u0099s a distinct difference between PAH patients and ILD patients, because I think, again, weâ\u0080\u0099re still sort of I think, kind of ramping up these ILD treaters on whenâ\u0080\u0099s the right time to put these patients on Tyvaso. Your line is open. But from the standpoint of United Therapeutics, itâ\u0080\u0099s actually a lot better, because while there are, Iâ\u0080\u0099ve actually lost track of how many drugs are approved for PAH 12, as a reasonable guess, 14, almost none of them can be used in ILD because of the very real problem of V/Q mismatch, which I was talking with a physician the other day and they were telling me directly that one time for a patient who they were trying to transplant and gave them a little bit of  to try to help bring down their pressures before transplant saw horrible V/Q mismatch right away, when to inhaled prostacyclin and were able to successfully bridge the patient over to transplant. Your line is open. And youâ\u0080\u0099ve seen these posters, no doubt that ERS and other conferences that physicians have shown that if they aggressively dose Remodulin over a short period of time, bring pulmonary artery pressures down below 35 millimeters of mercury, and then fast switch their patients to a high dose of oral equivalent prostacyclin that they are reporting pretty much like Kaplan-Meier survival level close to a 100% at 10 years and even 15 years out. Your line is open."
}