{
    "symbol": "UTHR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 15:19:13",
    "content": " The convenience and efficacy of our DPI device, coupled with Tyvaso's known tolerability profile has us well positioned to expand our reach in PH-ILD and to move the use of treprostinil therapies like Tyvaso DPI and PAH even earlier than IP receptor agonist like selexipag. Patient utilization of our program -- of our PAP program for Tyvaso DPI which is covered under Medicare Part D and has high patient co-pays, has been higher than anticipated, including by many PH-ILD patients who were on the nebulizer and nPAP last year and has since transitioned to DPI. And then second, just following up on Michael's comments in prepared remarks, I was hoping if you could elaborate a little bit more on that comment about the utilization of the PAP program for DPI being higher than anticipated among PH-ILD patients who transitioned to DPI. So I think, Jess, your first question around the assumption, the underlying assumptions for our confidence in the growth of Tyvaso in both PAH and PH-ILD is, in some ways, it's a little bit of a math -- kind of a math exercise, but also just I think -- I think just the excitement and enthusiasm we're seeing around DPI. Jess, one just additional shade of color I could add on top of Mike's remarks with regard to your question as to what kind of parameters can I provide to provide greater assurance about the doubling of revenues by the end of '25 is the uptake of Tyvaso DPI has been dramatic. And so the -- it's just you have to like first have not just one year and not just like there wasn't like a waiting bolus of patients in Group III just waiting for a launch, you have to like develop this market and really kind of till the soil for a number of years. Fortunately, none of them have been touched by pulmonary hypertension treatment that we can rapidly grow our numbers of patients at the same rate that we've been growing them for the past year with this doubling of the number of patients on Tyvaso and thereby reach a number of total treprostinil patients, something that would be in the 20,000 that would correlate when you multiply that times the reimbursement per patient to the $4 billion per year. So everything I just said, then you've got this other huge pool that Dr. Peterson opened up with her New England Journal article, WHO Group III, 30,000 patients, that's 3-0 thousand, of which the only approved treatment right now is our Tyvaso drug."
}