{
    "symbol": "UTHR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 12:06:05",
    "content": " To wrap up, we’re pleased with the continued momentum in the Orenitram modular business and progress with Tyvaso and PH-ILD, expected second quarter events such as CMS coverage and PH-ILD, the Tyvaso DPI launch approval, not to mention the increased buzz around PH-ILD we’re seeing at HCP conferences, particularly now that these are in person again, have us well positioned to achieve our 6,000-patient goal by the end of the year. I think as this plays out, as we expand the use of Tyvaso into Group 1 and Group 3, over time, my estimate is that we’ll probably see somewhere around 60% of the patients on Tyvaso DPI and about 40% on the nebulizer. I think Group 3 may be a little bit more 50-50 just because of the disease we’re talking about and the severity and some patients for whatever reason, they decide that the nebulizer is a better option for them than the DPI. And so that just gives you a little bit more color on what Mike was saying that when patients have this type of condition, if the nebulizer is – I don’t want to say keeping them alive because I don’t think that’s in the label. I think in hindsight, looking at Omicron and the impact, I think it had an impact more than maybe we realized at the time just in terms of us being able to get in and talk to physicians and physicians willing to really take the time to understand PH-ILD, think about Tyvaso, think about their patients and move them to Tyvaso. And I think what we've seen really in the last, I would say, 6 to 8 weeks is, as I said, with the cases coming down, hospitalization is coming down, there's just -- I think the physicians have a lot more time to really dig into this, and so we're starting -- I think that's contributing to the increase in the referral and the starts that we've seen in the last 2 months. And then you layer on top of the factors that I mentioned in my opening remarks, particularly this coverage, which everybody I talked to that that's really important and that is going to increase through use of Tyvaso along with the DPI, as I said, I think, have us really well positioned to hit our goal by the end of the year."
}