{
    "symbol": "LE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 14:22:05",
    "content": "  Operator: Good day, and welcome to Lands' End's Fourth Quarter and Full-Year Fiscal 2022 Results Call. Good morning, and thank you for joining the Lands' End earnings call for a discussion of our fourth quarter and full-year fiscal 2022 results, which we released this morning and can be found on our website, Landsâ\u0080\u0099 End.com. Factors that could contribute to such differences include, but are not limited to, those items noted and included in the Company's SEC filings including our annual report on Form 10-K and quarterly reports on Form 10-Q. The forward-looking information that is provided by the Company on this call, represents the Company's outlook as of today, and we do not undertake any obligation to update forward-looking statements made by us. On today's call, we'll discuss Landsâ\u0080\u0099 End's fourth quarter and full-year 2022 results. Landsâ\u0080\u0099 End has a fantastic 60-year history, and thanks to the hard work of our talented and dedicated team with a strong platform for continued growth and profitability. We'll speak to our performance in the fourth quarter in a moment, but as this is my first earnings call addressing you as CEO, I want to provide my perspective on the business and how we plan to build on all the progress made by Jerome Griffith and the entire Landsâ\u0080\u0099 End team over the past several years. At our core, Landsâ\u0080\u0099 End is in the business of providing products that solve lifeâ\u0080\u0099s issues. Whether for individuals, families, schools, or businesses, we provide the high quality products they're looking for, when they're looking for them. To continue to meet consumersâ\u0080\u0099 needs, we need to innovate our product strategy and put greater focus towards the categories that they're looking for most from us. Moving forward, we plan to sharpen our focus on the categories that drive outside value creation and bring customers back time and time again, including Swim and Outerwear, some of our top performers. We're confident this product focus will help us better serve the consumer by providing Landsâ\u0080\u0099 End branded merchandise to consumers wherever they're looking for it, including on our website and third-party websites, in our catalogs, and in our stores. It's worth noting that while we seek to meet customers where they are, over 90% of our revenue comes from a click. At Landsâ\u0080\u0099 End, we're customer obsessed. The key to executing this product strategy is making sure we reach our customers in the right cadence with the right products at the right time, helping them to build their basket across categories. In essence, we're going to take a page from our history and focus on engaging directly with our customers, while encouraging them to shop across the preferred channel. Landsâ\u0080\u0099 End already has a robust buyer file, nearly 7 million strong, and we are going to double down on our approach to understanding our customers, both current and potential, and seek to grow our share of our addressable market by leveraging our proprietary data. This will involve qualitative and quantitative assessments that are just kicking off, which will provide us with an even better understanding of our customers, including how they view our brand, what other products and product adjacencies they may be looking for, and how we can best engage with them. We'll also use our proprietary data to better understand our own operations, providing our product teams the tools they need to make better design, sourcing and buying decisions. We'll work to better connect our merchants, planners, and data teams, to facilitate knowledge-sharing and ensure we're always delivering what consumers want, when they want it. The theme I hope you're hearing is that we are going to be innovative in every aspect of our business, with decisions driven by our robust data and consumer demands. From how we engage with and deliver for our consumers, to the way we operate on a daily basis, innovation will come to the forefront, and we're confident that this will help drive both top and bottom line growth over the long-term. We'll share updates on our progress along the way, but let me just say that I am fully confident in our team's ability to execute. We'll strive to give our people the tools and structures to succeed, our customers the products they want, and our shareholders the growth and value they expect. In the fourth quarter, our sales came in at the high end of our guidance range, with $530 million in revenue, down 5% year-over-year. While we're pleased with the sales number, it's worth noting that, like many other retailers, we introduced promotions earlier and ran them longer during the quarter. And while strong consumer demand without promotions is always preferred, I'm proud of the way the team responded to ensure we were serving our customersâ\u0080\u0099 needs throughout the all-important holiday season. Regarding inventory, sales through the quarter, particularly in some of our high value categories, have helped us move closer to historical inventory levels. Consistent with our strategy, we're working to better manage inventory in a way that's consistent with the products our customers are looking for, when they're looking for them. We're confident that through our enhanced use of data and analytics, our teams will be better able to predict and manage appropriate inventory levels, reducing that expense, without impacting the customer experience. Looking at the products our customers were shopping for, we saw greater demand for women's swim and outerwear, with less demand for heavy outerwear as a result of the warmer than usual winter in the US and Europe. We continue to see challenges across a few categories, including kids and home, though promotions through the quarter helped us to reduce the inventory in these and other areas. As we discussed last quarter, we believe the trends in casualization and demand for hybrid life are here to stay, and we're well positioned in those areas. In line with the product strategy I discussed earlier, we're going to leverage data to refine our assortment and make sure we're making better product decisions based on what consumers are looking for. As it relates to our distribution channels, we saw strong engagement and performance from landsend.com, and continue to be pleased with our third-party online partnerships, including Kohl's, and Target, Walmart, and Amazon. We're in the process of launching with Macy's, and expect that will fully launch by the end of Q2. On marketing, we focused our efforts on engaging with our existing customer base, driven by our robust customer file, and we will continue to leverage a multi-platform approach for that engagement. For the fourth quarter, as Andrew mentioned, total revenue was at the high end of our guidance range at $530 million, a decrease of 5% compared to last year. Our global eCommerce sales decreased 6% from 2021, with our US eCommerce business decreasing 2% from 2021, and our international business decreasing 31% in the quarter. In our outfitters business, sales decreased 2%, mostly from timing differences due to last year's supply chain disruption. In our business uniforms, we were favorable to last year for both the quarter and the full-year. Revenue for our third-party business continues to be strong, increasing 8% as compared to the fourth quarter last year. This increase was largely driven by sales growth in the Kohl's marketplace, particularly within fleece and outerwear, as well as growth in our other online marketplaces. Moving to our retail business, during the quarter, we delivered revenue of $15 million, with US same-store sales decreasing approximately 4% from the fourth quarter of 2021. The margin pressure was driven by increased industry-wide promotional activity, and a focused effort to move through less productive units, slightly offset by lower inbound transportation costs. As a percentage of sales, SG&A was 28%, a decrease of approximately 260 basis points from 2021, driven by continued expense controls across the entire business, and lower digital marketing spend. Our performance led to a net loss for the quarter of $3.3 million or $0.10 per share, compared to net income of $7.1 million or $0.21 per share in 2021. For the quarter, we delivered adjusted EBITDA of $24.2 million, which was at the higher end of our expectations. Looking at the balance sheet, inventories at the end of the quarter were $426 million, compared to $384 million a year ago. The 11% increase in inventory was primarily driven by early receipts of swim product for the spring and summer selling seasons, as well as carryover full price swim product, driven by late receipts last year due to the supply chain challenges, and excess inventory in our kids' category. With reduced lead times, we've taken appropriate actions to execute more efficiently, which we expect will enable us to normalize our inventory level by the end of the first quarter. Regarding our debt, at the end of the fourth quarter, our term loan balance was $244 million, and our $275 million ABL, had $100 million of borrowings outstanding. During the fourth quarter, we repurchased $3.2 million worth of shares under the board's previously announced $50 million share repurchase authorization, bringing the balance of the remaining authorization to $41.5 million as of the end of the fiscal year. Turning to our guidance for the first quarter, we expect net revenue to be between $295 million and $310 million. Landsâ\u0080\u0099 End is an iconic 60-year old classic American lifestyle brand, and with the foundation that Jerome and the team put in place, we are well positioned to drive strong growth and profitability. We are taking aggressive, achievable actions, to simplify and refocus our efforts to ensure we're providing the high quality products our customers demand in the categories that they look for from us most, and that we're engaging with them in whatever channel or venue they want. He oversees our eCommerce, Outfitters, B2B, third-party, retail, and international businesses, and will have responsibility for the company's license businesses and marketplace development. Angie Rieger is now our Chief Transformation Officer, where she'll oversee the company's brand management and inventory-planning functions. In the meantime, my mantra is execute, execute, execute, and we'll continue working to do that so we can deliver for our customers, employees, and shareholders. As we look at it, and I think for those of you, and I know you do watch the site, we saw that by starting to win early, we were able to build momentum with the customer in January, and really use that as a springboard into the first quarter, and we'll do that through the year as we make that business into a year-round event. I think I'd also say on this as we look at the three pockets of margin out there, obviously we're going after the cost of the goods, and we're working with our vendors on that. Bernie mentioned that the transportation costs have fallen, and then just having better merchandise is going to let us reduce the markdown levels that we're experiencing. So, I think if you put all that together, there's a good margin tailwind here that we can get behind for this year and start to look to get ourselves back to more historical levels (indiscernible). Okay, that's really helpful. It's not something that we've necessarily done in the business before, but we felt like it's a year-round business, our data, and we have immeasurable troves of data here, I said that at ICR, I still continued to be astonished by, was telling us about the customer - certain customer cohorts were leaning in heavily to swim, and we followed that through. So, we're selling from slides, slides on her feet to the hat on her head, and that's working strongly for us. Having that inventory, which arrived late last year and was not saleable at the time we got it available to go, has really helped to fuel us with that early start, and we're going to build into it. So, we're already getting into a situation where we're having to chase some swim because we're working through the inventory so quickly. We're not going to walk away from kids, should be the takeaway in this, but we will look for ways to improve it, make sure it's appropriately resourced and find its place in the family variety of Landsâ\u0080\u0099 End. Okay, that's really helpful. So, Andrew, you mentioned throughout the call the focus on data, and it seems like that's one of the key elements that you are bringing to the Landsâ\u0080\u0099 End brands. It's one of a list of things that we are evaluating, Dana, and it's - I would say this, as we continue to refine and look at the ROI of retail, we think there is other priorities that are going to be ahead of it. You may see some experiments from us, but we're not going to lean into that specifically. So, whereas we have had cohorts for the customer tend to just shop one item, outer wear, that might be the shop that they are, swim, that might be the shop that they are, we will look for ways to connect them across our categories. And I do want to call that out because I look at a business like swim dresses, which is a nice business for us, but the opportunity to store into it as we see this patent and how the customer shops and how we push to them, has become really important to us, and it actually helps in how we manage those promotions. And within that system, we're able to look at these customer cohorts and look at the behaviors that they exhibit, and market more specifically against them. And that's a big effort for us as we sort of bring that into the business in general from how we approach search in the future, to how we think about alternate digital channels. So, I come back to the comments I made, that over 90% of what we do is done with a click, and we focus greatly on making sure that business is optimized and that's - they'll lean in for us. We see a new customer coming in, and we're picking up low teens crossover - we're picking up new customers from those orders to the tune of low teens. So, I think there's an opportunity to continue to grow that and refine that with the data we're bringing to bear. And then when you talked about the promotional environment, each month in the fourth quarter, we got sequentially better, and we've seen that progress into the first quarter this year, an improvement, but it is still a promotional environment at this time."
}