{
    "symbol": "LE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-02 11:01:01",
    "content": "  Operator: Good day, and welcome to the Land's End First Quarter 2022 Earnings Conference Call. Good morning, and thank you for joining the Land's End earnings call for a discussion of our first quarter fiscal 2022 results, which we released this morning, and can be found on our website, LandsEnd.com. Factors that could contribute to such differences include, but are not limited to, those items noted and included in the Company's SEC filings, including our annual report on Form 10-K and quarterly reports on Form 10-Q. The forward-looking information that is provided by the Company on this call, represents the Company's outlook as of today, and we do not undertake any obligation to update forward-looking statements made by us. Good morning, and thank you for joining us today for a discussion of our first quarter results. By actively managing our cost structure during this challenging period, we achieve adjusted EBITDA results within our expected range in the first quarter. Revenue for the quarter was down 6% versus 2021, but up 16% compared to 2019. However, we continue to see growth, with strong performance across our Outfitters business, and in our third-party distribution channels. With our proven digitally-led business model, combined with our strategic pillars of growth and proven success in executing our strategic initiatives, we remain confident in the long-term growth potential of our business, despite the challenging period. Touching on the quarter, a number of factors impacted our topline results, including ongoing supply chain delays that continue to impact the flow of new styles and colors. Given our highly loyal customer base with an average tenure of 18 years, we are confident that as inventory flow normalizes and the macro headwinds subside, these customers will return and we will be ready to meet their needs. In both men's and women's, we're seeing demand for products that complement an evolving lifestyle, with made to move fabrics that can be dressed up or down. With the trend in hybrid workplaces, we're seeing comfort-based products resonate well, particularly in our men's business. We remain pleased with the continued strength and swimwear during the quarter, as we lean into the versatility that makes our swimwear offerings cross over from performance to casual. We mentioned last quarter that we engaged Gary Vaynerchuk’s VaynerMedia agency to accelerate our new customer acquisition, and that a brand campaign exploration was underway. As we head into fall, this top-of-funnel brand marketing campaign will allow us to showcase our product with a more aspirational out in the world approach across all channels, including catalog, social media, and our own website. We remain pleased with our Kohl's partnership, specifically within the swim category, where we expect to increase our swim offering to over 100 incremental doors this summer, and are excited by the long-term growth opportunity with Kohl's. As mentioned last quarter, we're now present in 300 doors and offer our full assortment on Kohls.com. As mentioned last quarter, we expect to launch one to two new partnerships in 2022, and we look forward to providing an update on future earnings calls. Turning to our Outfitters business, we saw improved performance, with growth across all business lines during the quarter. We expect demand for leisure travel, in-person company events, and in-person schooling, to continue to drive growth in our Outfitters business. Turning to infrastructure, we continue to reinvest in our business to improve our operational efficiency and leverage advancements in technology to enhance our customer experience. We're in the process of our multi-year warehouse management system implementation, which will also encompass transportation management at a time where so much industry focus has been given to the movement of product. Overall, despite the challenges we faced in the first quarter, we were able to deliver adjusted EBITDA in line with expectations, demonstrating the agility of our business model. At the same time, the team did not miss a beat in executing across product marketing and our strategic initiatives, while also driving growth in our third party and Outfitters businesses. We're pleased to have achieved adjusted EBITDA in line with our expectations, despite challenging macro headwinds that impacted our topline and created incremental cost pressures. While we expect these challenges to continue in the near-term, we remain confident in our strategic growth pillars, as well as the long-term health of our business. For the first quarter, as compared to last year, total revenue decreased 6% to $304 million. As expected, we continued to experience transportation delays through the quarter, which negatively impacted our in-stock position in certain key items, resulting in lost sales. Revenue for our third-party business continues to be very strong, increasing to $22 million, a $10 million improvement or 83% compared to last year. This increase was largely driven by strong performance at Kohl's and Amazon, particularly within the women's apparel and swim categories at Kohl's. In our Outfitter business, sales increased 33%, driven by strength across all three business lines. We're very pleased to have seen our small to medium-sized businesses also show strength during the quarter, as the return to in-person events increased the need for customized apparel. During the quarter, we delivered revenue of $9 million, with the performance of our US same store sales increasing approximately 4% from the first quarter of 2021. Gross margin in the first quarter decreased to 42.5%, approximately a 350-basis point decline from 2021. Our performance led to a net loss for the quarter of $2.4 million or $0.07 per share, compared to net income of $2.6 million or $0.08 per share in 2021. For the quarter, adjusted EBITDA was $13.8 million, compared to $22.5 million in 2021. Looking at the balance sheet, inventories at the end of the quarter were $437 million, compared to $394 million a year ago, entirely driven by higher in transit shipments, and increased transportation costs due to the global supply chain challenges. We expect our inventory to remain elevated for the next couple of quarters, as we have extended our seasonal product calendars to account for the longer lead times, and trying to avoid potential delays. Regarding our debt levels, at the end of the first quarter, our term loan balance was $254 million and our $275 million ABL at $125 million of borrowings outstanding. With that context in mind, for the second quarter, we expect net revenue to be between $335 million and $350 million. We expect a net loss of $6 million to $3 million, and diluted loss per share to be between $0.18 and $0.09. We expect a net income of $20 million to 29 million, and diluted earnings per share to be between $0.60 and $0.88. We will leverage our digitally-led business model to advance our four strategic pillars of growth, which include product, digital, unit channel distribution, and infrastructure, across all of our businesses. First, the debt profile and how you're thinking about that over the next few months, what the options could be, and what that could look like. And what we're seeing is that our best sellers on our own website seem to be the best sellers everywhere, whether it's in somebody else's store or on a third-party marketplace website. Swim was an outstanding category, though swim is an outstanding category for us overall over the first quarter of this year. And what we see going down the road is expansion into stores, which, what we're seeing as we go into more Kohl’s stores, is that our online business also picks up. QVC was a great launch for us, well exceeded everybody's expectations this past month, and what we're expecting is to expand that offering going into the back part of this year, and then the next. From a gross margin standpoint, what we're seeing is, on the product margin, we've been performing relatively well. We gave you the numbers, the incremental freight for the first and the second quarter, and that's the majority of what we're anticipating seeing for the full year. So, when we get into the back half of the third quarter and into the fourth quarter, we're going to be up against comparables of a much higher freight rate. It certainly seems from what we read and hear from others is that, people are kind of shifting there, spending more into services and experiences and that probably makes sense, given what you're seeing with the strength in swim. There's no one category I would say, Alex, that they've been focusing on, but really all of apparel. I mean, those two commodities are definitely being driven up in price, and I think that's hurt us, particularly being up against a couple of really great quarters a year ago, and there was a lot of stimulus money out there and people were still looking for - working from home and looking for comfortable clothing to work at home. I mean, it sounds like the biggest variable here is supply chain costs and you guys have done a really good job over the past couple of years, managing prices and markdowns, but this is probably the first time we've seen a really kind of sudden drop in demand across the board here. Actually, we feel pretty good about our overall quality of inventory, even though we're showing a higher inventory, that's more about going forward than it is about excess inventory coming out of the season."
}