{
    "symbol": "CMC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-13 14:00:06",
    "content": " I would like to remind all participants that during the course of this conference call, the company will make statements that provide information other than historical information and will include expectations regarding economic conditions, the effects of legislation, U.S. steel import levels, U.S. construction activity, demand for finished steel products, the expected capabilities and benefits of new facilities, the companyâ\u0080\u0099s future operations, the timeline for execution of companyâ\u0080\u0099s growth plan, the companyâ\u0080\u0099s future results of operations, financial measures and capital spending. I will start today's call with a few highlights on CMC's historic performance in fiscal 2022, then discuss our fourth quarter results before providing an update on the current market environment. Overall, our fiscal 2022 results clearly demonstrate the impact of the thoughtful and decisive strategic actions we've taken over the last several years, as well as our team's ability to execute within the strong market conditions present throughout 2022, not to mention the flexibility in our operating model to respond to unforeseen changes and macro events. Thank you, Barbara, and good morning to everyone on the call today As Barbara noted, we reported fiscal fourth quarter 2022 net earnings of $288.6 million or $2.40 per diluted share compared to prior year levels of $152.3 million and $1.24 respectively. Results this quarter include a net after tax charge of $6.3 million, the majority of which relates to CMC's acquisition of Tensar. Core EBITDA was $419 million for the fourth quarter of 2022, representing a sharp increase from the $255.9 million generated during the prior year period. Reviewing our results by segment for the fourth quarter of fiscal 2022, CMC's North American segment generated adjusted EBITDA of $370.5 million for the quarter equal to $327 per ton of finished steel shipped. Our Europe segment generated adjusted EBITDA of $64.1 million for the fourth quarter of 2022, compared to adjusted EBITDA of $67.7 million in the prior year quarter. Of the $16.7 million in EBITDA, excluding purchase accounting adjustments, $13.8 million was included within CMC's North American segment, while the remaining $2.9 million was reported within the Europe segment. During the quarter, we generated $458.6 million of cash from operating activities, which included approximately a $90 million release of working capital, principally driven from the lower scrap costs. Lastly, CMC purchased roughly 3 million shares during the fiscal fourth quarter at an average price of $35.48 per share."
}