{
    "symbol": "CMC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-17 15:26:08",
    "content": " 00:30 I would like to remind all participants that during the course of this conference call, the Company will make statements that provide information other than historical information and will include expectations regarding economic conditions, the impact of the Russian invasion on Ukraine, effects of legislation, US steel import levels, US construction activity, demands for finished steel products, the expected capabilities and benefits of new facilities, the Company’s future operations, the time line for execution of Company’s growth plan, the Company’s future results of operations, financial measures and capital spending. Excluding the impact of non-operational items that Paul will discuss, adjusted earnings from continuing operations were $187.6 million or $1.53 per diluted share, the second best in our company's history, trailing only the prior quarter. 05:04 CMC generated core EBITDA of $323.1 million, an increase of 89% from the year ago period and virtually unchanged from the historically seasonally stronger first quarter results. Excluding the gain realized on the California land sale CMC's North American segment generated adjusted EBITDA of $262.1 million for the first -- for the quarter, just $6 million below the record level achieved in the first quarter. The average selling price of downstream products increased by $240 per ton from the prior year, reaching a new record of $1,169, this increase was more than double the rate of change in underlying scrap costs, leading to a significant expansion in profitability on volumes processed and shipped through CMC's entire vertically value chain. 38:39 If we look at our overall outlook for costs going forward to us it's really how do we position ourselves in comparison to other industrial activity even outside the steel industry and we believe we are very, very well positioned, as you look at the innovation that we have brought with the micro mill as an example, that is the lowest energy consumption form of producing steel in the world today and as a result of the impact that we have seen from rising energy costs, yes we’re not immune to it, but it is lower than what has been incurred by others. 46:44 Curt, with respect to the value above scrap costs for the downstream business, yes, there is no doubt that there is a tremendous amount of activity that is going on in the US marketplace, which consistent with supply-demand balances is providing an opportunity to exceed those current -- there was historical levels of margin over and above of scrap in the downstream business, we've seen that margin expansion in the mills, the fab business just has the lag effect before it's fully captured -- fully catches up. I think we're pretty confident in the 1.5 million there are others, I know that it forecast a number that's a bit higher than that and the other thing I would say is that we anticipate seeing the benefit of that start to occur in 2023 and that's just the normal time period that, that you typically see when, you know, a -- in infrastructure plan like this has put in place, it takes time for the projects to come to market. However, with the further increase of substantial increase close to $100 a ton that we've seen in scrap costs, we will continue to see investment into the third quarter as a rough magnitude, it will probably be close to $100 million that we would looked if these prices continue at that higher level to invest in the coming quarters."
}