{
    "symbol": "CMC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-16 14:04:04",
    "content": " I would like to remind all participants that during the course of this conference call, the Company will make statements that provide information other than historical information and will include expectations regarding economic conditions, the effects of legislation, U.S steel import levels, U.S construction activity, demand for finished steel products, the expected capabilities and benefits of new facilities, the Company’s future operations, the timeline for execution of Company’s growth plan, the Company’s future results of operations, financial measures and capital spending. Excluding the impact of nonoperational items that Paul will discuss, adjusted earnings were $320.2 million, or $2.61 per diluted share, the best in our company's history. CMC generated core EBITDA of $483.9 million, an increase of 110% from a year ago and nearly 50% above the previous record, which was achieved in the first quarter of fiscal 2022. With this quarter's exceptional performance, CMC's 12-month -- trailing 12-month core EBITDA totaled roughly $1.4 billion and our trailing 12-month return on invested capital was in excess of 24%. As Barbara noted, we reported fiscal third quarter 2022 net earnings of $312.4 million or $2.54 per diluted share compared to prior year levels of $130.4 million or $1.07, respectively. Results this quarter include net after-tax charges of $7.8 million, the majority of which relates to CMC's acquisition of Tensar. During our fourth quarter earnings call in October, I indicated that CMC's downstream backlog was expected to reprice higher throughout fiscal 2022 as new higher price work replaces older lower price work. Turning to Slide 13 of the supplemental deck, our Europe segment generated an impressive adjusted EBITDA of $121 million for the third quarter of 2022 compared to adjusted EBITDA of $50 million in the prior year quarter. Of the $7.1 million in EBITDA, excluding purchase accounting adjustments, $5.4 million was included in -- within CMC's North American segment, while the remaining $1.7 million was reported within the Europe segment. Turning to CMC's fiscal 2022 capital spending outlook, we expect to invest between $475 million to $500 million in total this year, roughly half of which can be attributable to Arizona 2. Lastly, CMC purchased roughly 1 million shares during the fiscal third quarter at an average price of $38.34 per share."
}