{
    "symbol": "VUZI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 18:08:19",
    "content": "  Operator: Greetings, and welcome to the Vuzix Second Quarter ending June 30, 2022 Financial Results and Business Update Conference Call. Good afternoon, everyone, and welcome to the Vuzix' second quarter of 2022 ending June 30 financial results and business update conference call. Before I turn the call over to Paul, I'd like to remind you that on this call, management's prepared remarks may contain forward-looking statements, which are subject to risks and uncertainties and management may make additional forward-looking statements during the question-and-answer session. Actual results could differ materially from those contemplated by any forward-looking statements, as a result of certain factors, including but not limited to, general economic and business conditions, competitive factors, changes in business strategy or development plans, the ability to attract and retain qualified personnel, as well as changes in legal and regulatory requirements. In addition, any projections as to the company's future performance represent management's estimates as of today, August 9, 2022. When required, reconciliation to the most direct comparable financial measure calculated and presented in according with GAAP can be found in the company's Form 10-Q filing at sec.gov, which is also available at www.vuzix.com. I will now turn the call over to Vuzix' CEO, Paul Travers, who will give an overview of the company's operating results and business outlook. Paul will then turn the call over to Grant Russell, Vuzix' CFO, who will provide an overview of the company's second quarter financial results. Hello, everyone, and welcome to the Vuzix Q2 2022 conference call. The overall business environment in the second quarter of 2022 remain challenging for most companies, due to macroeconomic headwinds causing delayed decision-making and the resurgence of COVID, particularly in parts of Asia. Despite these issues, our Q2 revenue of $3 million, which exceeded the consensus expectation, represented a 20% increase versus Q1 2022, and a 3% gain year-over-year. From a customer engagement perspective, the second quarter was very encouraging across our core smart glasses business. Most notably, we expanded our international sales channel with the addition of westbase.io to support our business in Northern Europe, a firm with a 30-year pedigree and one of the most experienced connected worker device distributors in Europe with solutions from cellular to XR Technology, and connecting tens of thousands of frontline workers and businesses. Also in Europe, we will be opening a Vuzix sales office in Germany later this quarter, which will provide a new central operational and support hub for our European business. As always, we continue to work closely with our key independent software vendors to support the needs of our collective customers as they roll out their solutions and work through any further optimizations ahead of expected enterprise-wide rollouts. On the OEM side of the business, upon which I will expand shortly, there is a growing momentum with both existing and new customers, and we expect our OEM business activities and revenue to accelerate in the back half of 2022. We continue to invest in our core technologies, including waveguides and display engines along with our significant investment and commitments in Q2 regarding our MicroLED and backplane announcement with Atomistic Additionally, we are also investing in the expansion of our high-volume, cost-effective waveguide manufacturing capacity. Our smart glasses core customer base continues to expand, and our customers' commitments to scaling up is also increasing. After a period of starts, pauses and stops primarily due to COVID and other headwinds we discussed earlier, we're now starting to see volume multiyear rollouts for smart glasses being actively planned by some of the largest companies in the world. As per their own social media, Vuzix smart glasses have been deployed across various Amazon warehouses, and we expect this project to roll out should continue to expand over the second half of 2022 and beyond. At other large customers in this space, our smart glasses are being deployed within their distribution centers and the integrated software solution in some instances is still being fine-tuned in preparation for wider rollouts and which we anticipate should begin during the second half of 2022. In late July, Pixee Medical received FDA 510(k) clearance for its FX SPS, a total shoulder arthroplasty online 3D planning software, which will create even more sales opportunity in North America for their smart glasses based surgical solutions for both knee and now shoulder replacements. Rods & Cones business also continued to expand and they're now active in more than 600 hospitals and have supported well over 25,000 surgeries in 75 countries worldwide, that's a current run rate of as many as 60 surgeries a day. Overall, our core Smart Glasses outlook and expected sales pipeline for the remainder of 2022 remains healthy. However, one of our biggest challenges in our forecasting continues to be managing and understanding customers' needs and expectations around the timing of deployments from these key accounts, which can have a material impact on our quarterly sales. Regardless, we expect our core Smart Glasses revenue over the second half of 2022 to grow compared to the second half of 2021. As announced in mid-May, Vuzix signed a series of agreements with Atomistic, a France-based technologies firm with a novel material science approach related to the development of next-generation micro light-emitting diodes or micro-LEDs. The combination of Atomistic Display and Vuzix see through waveguides will deliver full color high-resolution HD solutions, a level of form and functionality that represents what we believe to be the Holy Grail for the broader AR wearable markets, markets expected to ultimately become as large as the current smartphone market itself. And if you would like to learn more about Vuzix's micro-LED efforts and this transaction, please review the conference call that Vuzix hosted on May 18 of this year. Elsewhere on the M&A front, Vuzix continues to engage in due-diligence and hold discussions with multiple vertical market solution companies that could broaden our SaaS-based service offerings across key market segments. As promising as the smart glasses market opportunity looks to us going forward, we are equally excited about what we are seeing on the OEM side of our business. This new platform will offer customers one-stop shopping for their advanced and customized waveguide and display engine solution needs from design to high-volume, cost-effective production capabilities, a mix that is currently almost impossible to find with the competition. Since this announcement of our expanded OEM initiatives, we have been fielding many RFIs, Request For Inputs and formal RFQs, Request For Quotes for our waveguide-based solutions and in most cases, display engines to go with them. We are well on our way to expanding our waveguide production facilities to support high-volume, low-cost offerings. We have also made significant waveguide technology strides that include 80% reduced Eye Glow, a tripling of waveguide efficiency for higher brightness and more efficient battery usage and the use of higher index substrates and polymers, supporting single-layer color designs and much larger fields of view to name a few of our advances. To deliver against expected OEM needs in Vuzix's own future demand, we are preparing for an expansion of our waveguide fabrication equipment to address the millions of units of waveguides associated with the potential business we see coming long-term. We feel the OEM revenue opportunities for Vuzix are very significant as the waveguides and engines will be an integral part of the computing platform of the future from defense, all the way to literally replacing the smartphone. On the defense side, where our non-compete agreement expired in June, allowing us to directly engage with any US and allied defense organizations around the world, we are well positioned as the only US-based manufacturer of waveguides. Our goal is qualification and selection of our OEM components into volume programs where production runs can span five years or more and result in four, five and even six figure unit volumes. On the consumer side, we are well positioned to be a flexible, high-volume cost competitive provider of waveguides and related solutions. Most notably, many leading consumer products companies have publicized their intention to offer smart AR glasses for the masses, but are discovering just how challenging it is to build a pair of highly functional cost-effective and fashionable consumer AR smart glasses in volume. On the enterprise side, customers and varied industry verticals are driving a variety of use cases that represent greenfield applications and/or upgrades to older solutions that are already being deployed. Most notably, we recently announced an agreement with L3Harris Technologies, a leading defense contractor to develop a new customized waveguide-based head-mounted display engine for use within existing L3Harris programs and new ones in the works. On the consumer side, we announced an equally significant development last month when we received a purchase order for custom design waveguides from a Fortune 50 software and hardware technology company. The work for this customer, which is consistent with the consumer-related marks I made previously, is well underway and the waveguides are being built by Vuzix to specifically match this customer's needs and specifications. We are also engaged with other firms of equal caliber, and anticipate that additional programs will be announced as we continue to receive growing customer interest for cost-effective and fashion forward due to waveguide designs to support the broader markets. Overall, we expect our OEM-related revenue growth to accelerate in the second half of this year as more development projects reach the contract stage. We are nearing completion of a new waveguide-based successor to our Blade Smart Glasses that will feature our latest advanced waveguide optics, a new microprocessor and Android 11 out of the box. We believe this new product will answer the call from many of our enterprise customers that love the Blades form factor, but required an upgraded Android OS and broader WiFi capabilities to support their applications architecture, among other things. The Vuzix M400C, our second-generation USB-C-based Windows PC and phone compatible smart glasses, takes full advantage of the robust design and camera afforded by the Vuzix M400C, including IP67. Finally, the Vuzix Shield, our next-generation smart glasses is far advanced compared to the competition and its form and functionality have garnered significant early interest from enterprise customers that require a more traditional eyeglass form factor and the capabilities afforded to them by the shield to solve operational challenge. Our second quarter total revenues for the three months ended June 30, 2022, was $3 million as compared to $2.9 million for the prior 2021 period. And while we did see a year-over-year double-digit gain in Smart Glass unit sales in the second quarter of 2022, this was offset by negative foreign exchange impacts and a large volume discount given on a customer order in the quarter. And I would like to point out â\u0080\u0093 we currently have near $0.7 million in remaining engineering services obligations, which should be completed and recognized in the second half of 2022. There was an overall gross profit of $0.4 million, or 14% for the three months ended June 30, 2022, as compared to a gross profit of $0.6 million or 20% for the same period in 2021. The decrease in gross profitability in the quarter was largely attributable to a rise in product direct cost to 62% of sales versus 47% in the same period of 2021, primarily driven by a higher level of sales discounts on large volume unit order, and the negative impact of foreign exchange in the 2022 period on non-US dollar denominated sales and higher allocations of applied manufacturing overhead costs included directly in product cost of sales. R&D expense was $3 million for the three months ended June 30, 2022, compared to $2.7 million for the comparable 2021 period, an increase of approximately 10%. Selling and marketing expenses for the three months ended June 30, 2022 was $1.9 million as compared to $1.3 million in the 2021 period, a 37% increase, largely due to a $0.3 million increase in headcount and salary and benefits related expenses and, to a lesser extent increases in travel sales commissions and tradeshow expenses. General and admin expenses for the three months ended June 30, 2022 was $5 million, a decrease of 3% versus $5.2 million in the prior year period. The net loss for the three months ended June 30, 2022, was $10 million, or $0.16 per share versus a net loss of $9.2 million, or $0.15 per share for the same period in 2021. Our balance sheet remains strong with cash and cash equivalent positions of $100.6 million as of June 30, 2022, and a net working capital position of $109.1 million. Cash used in operations after adding back non-cash operating expenses, which are mainly stock compensation, but excluding changes in our working capital, totaled $5.5 million for the second quarter of 2022 as compared to $4.6 million in the 2021 comparable period. The increase reflects $4.5 million of payments made towards our $15 million technology license fee commitment related to our Atomistic agreements and $3.5 million for investments in manufacturing equipment, product mold tooling and backplane design and tooling fees. Vuzix has been preparing for this for years, and we have developed the IP and manufacturing capabilities to supply to it and to deliver to this growing opportunity, Vuzix has the balance sheet to get it done. Curious how a number of those discussions have been progressing just the last several weeks or a month or two as inflation goes up and there's concerns around whether it's the consumer world or just the broader macro, limiting potential total business activity and maybe even enter a technical recession here. And since we've done that, the amount of business that's coming over the transom just keeps growing. And it has not slowed down a bit actually, as it relates to the economic wins, at least from what we can tell, it seems it's less expensive to get good outside help than it is to try to hire a whole bunch of people to do this inside and come up to speed because what we do is play unique, which just opens up doors. I mean, smart glasses are going to change the way work gets done. And at $3 million a quarter, it's pretty modest revenues, frankly, compared to where this business is going to be. So I guess, first question, maybe just a follow-up on the OEM front, and it's great to hear that those things are tracking, very well still. But the unit cost for a defense smart glass engine, which would be a display and an optic and maybe a pair of them. I mean I will say, if you get into some of the programs that are part of the bigger side of the US defense markets, they can be tens to 100,000 piece quantities with those kinds of numbers. So the margins are easier to maintain at a much higher level, but the volume is smaller, but it's still a significant business when you add it up. And if your technology is in those smartphones and they ship billions a year, it's just a significant business, Tyler. And on the boat load side of the business, I would suggest it's 2023 going into 2024-ish kind of thing for volume programs. On the defense side of the business, like I said, there's one in particular that we've already got preproduction programs we're shipping to. So 2023, you'll definitely see early production -- real production programs on that side of the business. And then second, pivoting maybe to the strategic partnership you announced in the quarter, I think, was very interesting and positive. And you'll see, I think, knock on wood, should they come together, some stuff that's on that side of the house. So I'm sorry, I can't offer more than that, Tyler, but â\u0080\u0093 so there's two legs to it as you know, the technology side, like I mentioned, in the SaaS base side of it. Paul, I was hoping you could characterize the pace of the rollouts that you're expecting in the logistics business and not necessarily numbers, but well, numbers would be great. And the other thing that happens, Jim, is once these guys start to roll, they often what we've seen in the past and how these companies operate is with success comes let's have faster success. But the kinds of volumes that we're talking though, you've got a reasonable number of products in the distribution center, and there's 200 distribution centers, it all adds up fairly quickly. From what we're seeing, once the decision is made, it's the product of choice. And so many of these retailers â\u0080\u0093 if you look in the health care sector, all of the business that's really happening around smart glasses in health care, in operating rooms, you don't see much competition there. It's â\u0080\u0093 and once it's decided on the systems are built around it, and the software is released, it's almost like you're kind of cemented in the program. It doesn't mean, we don't have competition, with these guys because often, there's this front end where they're trying to make decisions and they got to comp this one against that one. And then of course, there's always the negotiation that maybe we'll use them instead of you kind of saying that happens. But once you're there, Jim, we're not up against multi-unit of this and this and this company's deployments. So if you need, for instance, 100 to 400 per site, which is -- in some cases, we have partners or the deployments that would have those kinds of numbers. In other cases, there's like 10 to 50 per site kind of a thing. In those cases, we always recommend if it's a smaller number, a few spares. If it's a bigger number, more spares, and we have programs in place with these guys to allow them to return product fast if they need to. It's more work upfront, which is part of the reason why it's taken longer to deploy than we'd like to see it. It's a really fun time to be at Vuzix, I have to say."
}