{
    "symbol": "VUZI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 20:41:04",
    "content": "  Operator: Greetings, and welcome to the Vuzix Third Quarter Ending September 30, 2022 Financial Results and Business Update Conference Call. It's now my pleasure to turn the call over to Ed McGregor, Director of Investor Relations of Vuzix. Good afternoon, everyone, and welcome to the Vuzix third quarter 2022 ending September 30th, financial results and business update conference call. Before I turn the call over to Paul, I would like to remind you that on this call management's prepared remarks may contain forward-looking statements, which are subject to risks and uncertainties and management may make additional forward-looking statements during the question-and-answer session. Actual results could differ materially from those contemplated by any forward-looking statements as a result of certain factors including, but not limited to general economic and business conditions, competitive factors, changes in business strategy or development plans. In addition, any projections as to the company's future performance represent management's estimates as of today November 9, 2022. Today's call may include certain non-GAAP financial measures, when required reconciliation to the most directly comparable financial measures calculated and presented in accordance with GAAP can be found in the company's Form 10-Q filing at sec.gov, which is also available at www.vuzix.com. I'll now turn the call over to Vuzix CEO, Paul Travers who will give an overview of the company's operating results and business outlook. Paul will then turn the call over to Grant Russell, Vuzix CFO who will provide an overview of the company's third quarter financial results. On this call, we're going to review our operating results and recent developments and then give you some perspective on where we see things headed. On the OEM side of our business, we are now engaged with many new potential defense, consumer electronics, and enterprise customers that are interested in our waveguide and display engine solutions. At the same time, larger deployment opportunities for our smart glasses among key enterprise customers continue to expand both in number and visibility within warehousing and logistics, automotive, pharma and healthcare verticals. From a customer engagement perspective, the third quarter continued to be very encouraging across our core Smart Glasses business despite numerous headwinds. Most notably at the end of Q3, we expanded our international sales channel with the addition of Hongke Tech to support our business development in China. As always, we continue to work closely with our key independent software vendors to support the needs of our collective customers as they work through their optimizations in support of a growing number of enterprise wide rollouts. On the OEM side of the business, there is growing momentum with both existing and new customers, sales of waveguides and display engines as well as engineering services were both at record levels in our third quarter and we expect our OEM business activities will continue to grow. The separate plant will support the advanced capabilities we need for our latest waveguide technology, including the use of higher index materials, advanced glass substrates and unique formulation technologies designed to further address Vuzix and our OEM customers needs. As part of this expansion, we teamed up with leaders from the Empire State Development to receive up to $1 million to support related job creation through the Excelsior Job Tax Credit program. Second, we completed the acquisition of Moviynt a revenue generating SaaS solution provider that support SAP, which broadens our go-to-market strategy for customers and ISPs within the warehousing and logistics market verticals using SAP, along with making our products stickier for the end customer. It's great to see that our Smart Glasses core customer base continues to expand both vertically and geographically, and customers continue to move forward with their scaling initiatives. That being said during the third quarter, several customers did push their purchasing decisions out, also impacting growth a bit in the quarter with some higher volume discounts and to a lesser degree negative exchange rate with a strong U.S. dollar. One Fortune 100 customer that we've referenced in the July press release has already placed multiple orders for initial rollouts, and is expected to continue to expand their use of our Smart Glasses in their organization. The Smart Glasses project that this retailer, as it currently is slated will represent one of the largest deployments of Smart Glasses in the world to date. Visibility in Amazon, another large warehouse and logistics customer remains positive, as we expect their smart glasses users to expand further beginning as early as Q4 2022. As a reminder, Amazon has their own custom M400 Smart Glasses SKU from Vuzix. Outside of these customers Vuzix Smart Glasses have been deployed within the distribution centers of several other large retail customers, and we expect to finally start to see further expansion into additional DCs also beginning as early as this quarter. Again, healthcare related trials and use cases of Vuzix Smart Glasses continued to steadily expand around the world, such as those recently announced with AVR Japan and others for ambulance emergency medical care, Toppan for Order Picking of Homebound Seniors and Xpertinc for the Deaf and Hearing Impaired. Vuzix Smart Glasses have made their way into an impressively long and still growing list of blue chip firms around the world as either they're preferred, or in most cases sold Smart Glasses solution. To expand on my earlier comment, Vuzix recently closed the acquisition of Moviynt a SaaS based SAP solution provider that has now become a Vuzix company. The Moviynt solution is currently supporting handheld scanners and mobile phones, which represent a logical transition to Vuzix Smart Glasses. In terms of Moviynt's revenue generation, we expect a low six-figure contribution in Q4 of 2022, and seven-figure contribution in 2023 with a minimal impact on our net operating costs. As announced in mid-May, Vuzix signed a series of agreements with atomistic, a France based technologies firm with a novel material science approach related to the development of next generation, micro light emitting diodes or MicroLEDs. The combination of atomistic displays and Vuzix see through waveguides will deliver full color, high resolution HD solutions, a level of form and functionality that represents what we believe to be a critical piece for the broader AR wearable markets. And if you would like to learn more about Vuzix micro led efforts and this transaction, please review the conference call that Vuzix hosted on May 18 of this year, you can find it on our website. It is clear that waveguides and display engines will be an integral part of the wearable computing platform of the future, from defense all the way to literally replacing the smartphone to help make consumer AR glasses ubiquitous. As the only U.S. based manufacturer of waveguides, we are well positioned to directly grow our defense and military business. Our end goal is qualification and selection of our OEM component offerings into volume programs where production runs can span five years or more, and result in four, five and even six figure unit volumes. For a clearly visible example we announced in July and agreement with L3Harris Technologies, a leading defense contractor to develop a new customized waveguide based head mounted display engine for use within their existing L3Harris programs and new ones in the works. L3Harris is one of the almost dozen defense firms coming to Vuzix at this point, and things are just getting started. On the consumer electronics side, we are well positioned to be a high volume cost competitive provider of waveguides, display engines and related reference designs. And at the same time, most of them are dealing with the realities of just how hard it is to design and build a pair of highly functional, cost effective consumer AR Smart Glasses. Since announcing our OEM platform, we have had significant inbound request to respond to RFQs from leading consumer electronic firms and their interest in working with Vuzix as a solution provider to their programs. The work for this customer, which is consistent with the consumer related remarks I made previously is well underway, and the waveguides developed and built by Vuzix are being delivered specifically to match this customer's needs and specifications. Led by both consumer OEM customers, and U.S. and Allied Defense and Homeland Security customers, we expect our OEM revenue in Q4 to show continued growth. Slide 8 highlights the new products we have introduced over the past four years, and I think it's safe to say that no other firm in the world has a more comprehensive smart glasses product lineup, and the core technologies behind them than Vuzix. Towards the end of the third quarter, we announced the general availability of Blade 2, our third generation blade product featuring our latest advanced waveguide optics, a new microprocessor and the ability to run Android 11 Out of the box. We have a number of significant opportunities associated with this product as it answers the call from many of our estimize customers that love the Blade's form factor, but required an upgraded Android OS, the latest security support, broader WiFi capabilities and updated MDM compatibility to support their applications deployments. The Vuzix M400-C, our second generation USB-C based Windows PC and phone compatible smart glasses, that takes full advantage of the robust M400 platform design including IP67 is now shipping and is being actively marketed through select Vuzix channels. Finally, the Shield, our first binocular and fashion forward smart glasses is starting to ship to key customers, system integrators and development partners and is on track for broader availability before the end of the year. Sales of waveguides and display engines for the quarter rose to approximately $0.25 million, a new quarterly record for us. Offsetting some of these revenue gains were decreases in sales, class revenues, which as mentioned by Paul was due to higher sales discounts for larger volume orders, and by a smaller extent negative foreign exchange impacts and lower unit sales. The improvement in gross profit percentage in the quarter was largely attributable to increased amount of engineering services revenues, which typically earn us a higher gross margin. R&D expense was $3.4 million for the three months ended September 30 2022, an increase of only 1% against the comparable period in 2021. Selling and marketing expense for the three months ended September 30 2022 was $2 million as compared to $1.7 million in the 2021 period, an increase of 20% largely due to increases in staff compensation due to headcount increases. General and administrative expense for the three months ended September 30 2022 was $4.9 million, a decrease of 11% versus $5.5 million in the prior year's period. The net loss for the three months ended September 30 2022 was $9.5 million or $0.15 per share, versus a net loss of $10.5 million or $0.17 per share for the same period in 2021. Net cash used in operations was $4.9 million after adding back non-cash operating expenses, mainly stock compensation, depreciation and amortization and net changes in our working capital for the third quarter of 2022 as compared to $5.8 million in 2021. As you can see, it is incredibly busy at Vuzix these days, and in the New Year, Vuzix will be attending the Consumer Electronics Show in Las Vegas as we excite the world with our newest fleet of industry leading smart glasses. I guess first, just curious on how you're thinking about the distribution and warehousing channel in light of some of the macro headwinds and some of the struggles we're seeing across kind of e-commerce and retail more holistically. This is a really cool bit about what Vuzix does in that space, when you're in a distribution channel, and you can make it more efficient and deal with high turnover rates, because it's so easy to use our products, they pay for themselves so fast, and it helps deal with the fact that, it's hard to even get good employees to do those jobs. And then on the aerospace and defense side, obviously a bunch of engineering services opportunities, but maybe within that mix, and even beyond the consumer electronics side, how should we think about the mix of the OEM business, maybe over the next call four or five years or something that more longer-term versus smart glasses sales and kind of what you're thinking about the ultimate revenue mix between those two might be? Well, some of these accounts that we're working with are, they're selling devices for like 60 grand a pop, to Vuzix, it could be $5,000 to $7,000 a pop, and it could be as many as 60,000 pieces over a program. And it could represent well, first of all, it is great margin for Vuzix 1 and number two, it should represent some significant top line. These are companies that are expecting to shelf millions of these things, and it's part of the reasons why we've done this upgrade to our facility. I mean there's hundreds of 1000s of headsets that can be sold, maybe millions, even in enterprise, no doubt about it, and it's a higher number. Because sometimes you've got two or three guys in the queue maybe more that you're developing for and delivering against, but there's so many of them, Tyler, that look like they're coming to us, like I said, there's upwards of a dozen defense companies now. So it should start to get more consistent next year, but it still will be lumpy as we deliver and programs come in and out until they're going into production. On the defense side for production next year, there should be at least one, and maybe a couple of them that we're producing in production oriented quantities. But it should be a reasonably good quarter, the fourth quarter in the next year, these numbers should be significant jumps over what they're doing in this year. It's not three to five, it's in fact, we'll see some revenue from a product perspective, I believe in 2023. Some of the broader market guys we're talking to, they want products by the end of next year. A smaller number of them, of course, because this is something that's only been six or seven months that we've really hung our shingle out. So you're going to see in 2023, a reasonably large number of new programs and that baseline of engineering services fees to get these things developed in the multiple millions of dollars."
}