{
    "symbol": "AMYT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 12:17:06",
    "content": " Our Q4 MYCAPSSA revenues were $5 million, and you will recall from my comments last quarter, but I noted that the Q4 number was higher than expected due to a year-end stocking order from our distributors of approximately $1 million. I also noticed that the net of stocking order quarterly revenues of $4 million would have been $16 million annualized, and this was a better reflection of the underlying performance of the business in Q4. I also noticed that the net of stocking order quarterly revenues of $4 million would have been $16 million annualized, and this was a better reflection of the underlying performance of the business in Q4. Finally, before moving off revenues, I would just note that we set our revenue guidance of $260 million to $270 million for the year, and we have achieved 22.7% of the lower end of the range in just the first quarter, which is impressive given the ongoing growth in the business. Also included is the amortization of the fair value step-up of acquired MYCAPSSA inventory of $1.6 million, which, as you know, is an accounting requirement following an acquisition whereby we are required to fair value or uplift inventory acquired on the acquisition date up to something approaching the future selling price of that inventory and then amortize that non-cash accounting adjustment of the related inventory is sold. The increase in spend from approximately $18 million per quarter, as was the case in Q1 and Q2 to $25.2 million in Q3 is not reflective of the true impact of Chiasma, given we did not own the business for a full quarter in quarter three. In this regard, I will draw your attention to Slide 15, where we adjust our Q1 operating loss for non-cash items and debt to adjusted EBITDA of $6.8 million or $7.2 million before Chiasma restructuring and acquisition costs of $400,000 for the quarter. Regarding the CVRs, we don't anticipate that the FDA CVR will get paid out, which is originally $35 million given the FDA would need to change their mind and approve FILSUVEZ for the U.S. market before the end of June this year."
}