{
    "symbol": "CLX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-03 21:03:05",
    "content": " Your line is open. I think our pricing will continue to perform well now, I think it's worth noting, we have assumed in our most recent price increase, we took in July, we've assumed elasticities revert back to what we saw historically, which means more negative than we've seen over the previous two price increases, and we just think that's a prudent assumption to make given the pressure consumers have been under and we expect it'll continue to be under going forward. Your line is open. But the other item I point out is while we expect to improve gross margins, we're talking about 200 basis points this year, I think you'll see that build as we move through the year. We're gonna be most challenged in Q1 given the decline in the top line, and that has an operating de-leveraging impact on margins and to expect our gross margins to be about 35% in the first quarter, but they not expect to build as we move through the year with the expectation we're going to be approaching about 40 basis points by the time we get to the end of the year. This should be a quick one, but the health and wellness declines you're expecting, can you just offer a quick comment on the professional business clearly, quite challenged this year, are you expecting that to continue or as we've normalized, the sales base you expect that business to get back to growth next year. Your line is open. Your line is open. Your line is open. Obviously you've implemented some pricing this summer that hasn't been realized through the P&L yet, so that's to come, but as you look going forward, are there plans for any incremental pricing, just given the gross margin aggression over a three year period, even with the rebound expected in the upcoming fiscal year. Your line is open. Given the dynamics I just covered, I think that's clear that there's some other things going on there, but we are seeing some trade down within our own portfolio, for example, and we would've anticipated and expected this, and we're working this as part of our sales plan. Your line is open. Your line is open. Your line is open."
}