{
    "symbol": "CLX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-03 20:09:03",
    "content": " We're on track to have another very good year from a cost savings perspective, and you'll see both benefits to cost of goods, but we also drive admin productivity, and you'll see us continue to do that going forward. I think over time, if you assume demand for goods moderates over time, you're going to see us be able to move away from those spot carriers back to our primary carriers, and that should significantly reduce our transportation costs. And as I said, I do think it's going to take longer than what we've historically been able to do in terms of timing to recover margins at 12 to 18 months, just because of the sheer magnitude of the inflation we're dealing with. I wanted to just talk a little bit about working through inventory because last quarter, I think we had talked about the cash flow was weak in the inventory and finished goods in particular, was up, and that's kind of how we came to this, all of us, the realization around the external supply and estimating what was going to happen in terms of consumer demand. But I just want to talk about how you're thinking about working through inventory if there's particular categories where the overcapacity is more or less severe because, to Linda's point, there are businesses that are growing year-over-year in volume. So I think seeing that level of inflation that we're continuing to deal with, that just means we've got more work to do on pricing, cost savings, and we'll have to see how long that takes. During this entire time, we've been investing in those brands through advertising and sales promotion and a really terrific innovation program that's -- we're continuing to see the benefits of all of the innovations we've launched are off to a strong start, and we launched new innovations this quarter with more coming in the back half. And so as I said, north of 200 bps in the fourth quarter would not be the full value because you won't have the full Q4 impact from some of those pricing actions, which would suggest, as we get into fiscal year '23, you'll see that continue to build."
}