{
    "symbol": "WTTR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 15:41:06",
    "content": " Whether that is through full lifecycle water and waste management solutions, developing creative technologies to support the energy transition are more broadly advancing into other industrial sectors, we believe Select is uniquely positioned to capitalize on new growth opportunities using and building upon our existing expertise. Quality assets like these have a higher value potential within our portfolio than they do on a stand-alone basis, given our ability to fund further development with minimal leverage and importantly, our ability to tie them into a growing infrastructure network strategically suited to balanced water needs across many different customers. This cash flow was applied towards $35 million in total acquisition-related cash consideration and costs, plus the elimination of $13 million of Breakwater bank debt in conjunction with the closing of that acquisition, which, along with $11 million of net CapEx and $6 million of dividend payments, still resulted in a very modest net debt position of $9 million. We expect Water Infrastructure will take the biggest step forward in Q1, as we benefit from a full quarter of our infrastructure-related acquisitions combined with the recent investments weâ\u0080\u0099ve been making to deliver 20% to 25% revenue growth, with gross margins before D&A in the high 20s  to 30% range. I think as you look out into the rest of the year, that pace of growth that you saw in the Water Infrastructure Group from second to third quarter and then moving into first quarter from what we described today, I think you have some solid tailwinds behind that, given that the majority of that CapEx total for this year will be focused on connecting that infrastructure, on adding recycling projects around it and doing so, in many cases, on a contracted long-term basis. So I think we've laid out Q1, as I mentioned, with the bulk of growth investment going towards Water Infrastructure, and most of that is going to be around existing assets building those out, enhancing them oftentimes with contracted revenue with production-levered revenue, that's really going to be the large focus of our growth CapEx piece here."
}