{
    "symbol": "CAL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-24 21:53:09",
    "content": " Following the strong rebound in the second half of 2021, the Brand Portfolio turned in an exceptional performance, eclipsing the first quarter of 2021, surpassing its first quarter 2019 results and setting the stage for a significantly improved earnings contribution in 2022. In addition, gross profit margin reached 38% or a 53 basis point improvement over the first quarter of 2021 due to favorable sales mix and a less promotional retail environment. In total, the Brand Portfolio achieved $41 million in earnings, a $44 million increase over 2021 and approximately $28 million increase over the first quarter of 2019. Naturalizer sales increased significantly over the first quarter of 2021 with a solid increase over 2019 as well, as the brand started the year in good inventory position and as we strategically used airfreight to ensure the availability of highly demanded products, particularly opened up occasion-based styles. Our consolidated gross margin was 44.5%, up 144 basis points from the first quarter of 2021, reflecting another quarter of strong margin performance at Famous and improving margins at the Brand Portfolio. The Brand Portfolio recorded first quarter gross margin of 38.1%, a 53 basis point improvement over the first quarter of 2021 due to favorable sales mix and a much less promotional retail environment. First quarter SG&A expense was $260.8 million during the period or 35.5% of net sales, a $17.3 million increase from the same period a year ago due to higher variable costs on our increased sales, additional investments in marketing and higher wages and labor costs. Finally, given the strong start to the year, and inclusive of the company's current expectations for its underlying business, along with what we know now about anticipated macro challenges that include geopolitical concerns, inflationary pressures and ongoing supply chain disruptions, Caleres now expects annual consolidated sales to be up between 2% and 5% when compared to 2021 and earnings per share to be between $4.20 and $4.40 per share."
}