{
    "symbol": "STT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-20 16:09:04",
    "content": " Even in a year marked by economic and political disruptions, total revenue for the fourth quarter was the highest on record, increasing 3% year-over-year as lower total fee revenue was offset by very strong NII result which increased 63% relative to the year ago, primarily driven by higher global interest rates plus our balance sheet positioning and effective execution of our deposit management strategy. Recognizing the importance of capital return to our shareholders and having already announced a 10% per share increase to our common stock dividend earlier in 2022, we resumed share repurchases in the fourth quarter, buying back a total of 1.5 billion of State Street's common stock. Total revenue for the quarter increased 3% year-over-year or 5% year-over-year, excluding notable items, as lower fee revenue was more than offset by robust NII growth of 63%, which I'll spend more time discussing later in today's presentation. Year-on-year the decrease in AUC/A was largely driven by continued lower period end market levels across both equity and fixed income markets globally, a previously disclosed client transition, and the negative impact of currency translation, partially offset by net new business installations. Turning to Slide 8, on the left side of the page, you'll see fourth quarter total servicing fees down 13% year-on-year, largely driven by lower average market levels, lower client activity adjustments and flows, normal pricing headwinds, and the negative impact of currency translation, partially offset by net new business. Turning to Slide 9, fourth quarter management fees were 457 million down 14% year-on-year, primarily reflecting lower average market levels and the negative impact of currency translation, which represented about two percentage point headwind. Fourth quarter software and processing fees were up 16% year-on-year and 17% sequentially, primarily driven by higher front office software and data revenues associated with CRD, which were up 28% year-on-year and 25% sequentially. Moving to Slide 11, on the left panel you'll see fourth quarter front office software and data revenue increased 28% year-on-year, primarily driven by multiple on-premise renewals and continued growth in software enabled revenue associated with new client implementations and client conversions to our cloud based SaaS platform environment. Turning the Slide 13, fourth quarter expenses excluding notable items were once again proactively managed in light of a tough fee revenue environment and flat year-on-year or up approximately 3% adjusted for currency translation. Regarding the first quarter of 2023, we currently expect fee revenue to be down 1% to 2% ex-notable items on a sequential quarter basis, given some normalization of foreign exchange market volatility that impacts our trading business with servicing fees expected to be up 1% to 2% and management fees expect to be down 1% to 2%. You can also see on the walk that for a full year 2023, we expect growth saves of approximately 3%, which will help offset inflationary pressures and variable costs and ongoing investments in areas like private markets and alpha and further automation. So I think for the -- as we look into the next few quarters, we think the U.S. client deposit betas ex any new money that we bring in on an initiative basis is going to be in that 65% to 70% and the international betas, we think will continue in the 20% to 50% range when you look at Euros, Pound Sterling, Canadian Dollars, Aussie Dollars and some of the other currencies. I think as we've -- we have been relatively consistent here and I think the guidance will hold a 10% average change in let's call it, an increase in equity markets, right, will typically lead to about a 3% increase in servicing fees, if you have both of those on average."
}