{
    "symbol": "GBTG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 14:04:08",
    "content": " We are the clear leader in a $1.2 trillion industry, with a significant runway for growth and we continue to gain share with $3.5 billion of total new wins value in 2022, again, based on the current recovery levels, and of course, supported by strong customer retention of 95%. Our revenue recovery was 75% of 2019 pro forma, which is 3 points above where the third quarter was and it is 3 points above the transaction recovery in the fourth quarter, which was 72%. 86% of travel suppliers are expecting higher spending from corporate customers in 2023 and thatâ\u0080\u0099s an improvement versus 80% in the survey in October, finance, insurance, professional services, consulting other sectors where weâ\u0080\u0099re seeing the strongest growth trends for the year ahead. Importantly, as growth continues beyond 2023, when we look at the financial and commercial drivers of the business, we remain on track to deliver pre-COVID adjusted EBITDA of approximately $500 million at the 86% revenue recovery level or achievement of $2.4 billion in revenue. So on page 17, in 2023, we expect to deliver double-digit revenue growth and margin expansion and we project to turn free cash flow positive during the year and actually come within our target net leverage of 2 times to 3 times adjusted EBITDA. So starting with the components of our expected 17% to 20% revenue growth, 12 points of that growth really results from carrying forward the fourth quarter run rate and another 5 points to 8 points of additional growth is expected to come from a combination of share gains and organic growth. We expect our revenue recovery to be six weeks ahead of volume recovery in the first quarter, which is above what we project on a full year basis and this is really driven by a quarterly phasing of revenue in the 2019 baseline, which is different from what we expected to be in 2023. We are positioned for strong revenue and adjusted EBITDA growth in 2023 and we remain on track to deliver an adjusted EBITDA of approximately $500 million, with a revenue recovery of 86%, which equates to approximately $2.4 billion in revenue."
}