{
    "symbol": "MMP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 17:18:05",
    "content": " During 2022, we delivered over $1.3 billion of value to our investors via opportunistic equity repurchases and Magellan's attractive cash distribution, marking 21 years of continuous annual distribution growth. Operating expenses for the refined segment increased about $6 million versus the prior year period, primarily due to less favorable product overages, which reduced operating expense as well as higher power costs, primarily as a result of the increase in long haul movements just mentioned. Between the margins we have already hedged and last week's forward curve for the unhedged volume, we currently forecast an average blending margin of about $0.60 per gallon for the year, which compares favorably to our 2022 results of $0.50 per gallon and our five year average margin, which is closer to $0.45 per gallon. As discussed last quarter, we recently added a new third party commitment to Longhorn, resulting in approximately 80% of the pipe's 275,000 barrel per day capacity being committed at this point with an average remaining life of six years. At this point, BridgeTex has commitments for nearly 65% of the pipeline's 440,000 barrels per day of capacity with an average remaining life of three years with a few small commitments expiring last month. Concerning maintenance capital, we expect to spend around $90 million during 2023, which is 10% above last year's actuals but not out of the normal range for our company. As an aside, we also mentioned in today's earnings release that our guidance assumes an average crude oil price of $80 per barrel for the year, which is consistent with recent futures pricing. Coupled with our currently planned 1% annual distribution growth, we expect distribution coverage of 1.38 times, resulting in more than $215 million of free cash flow after distributions that can be used to reinvest in the business, buyback equity or otherwise create additional value for our investors. And if you think about it in terms of we're always talking to our customers, we have a good feel for what's going on in the markets, but we do very much a market by market buildup of what we think is a rate increase that wouldn't result in market share loss, frankly."
}