{
    "symbol": "ILPT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 16:21:03",
    "content": " As we are not a distressed seller, we have made the decision to move -- to remove the 30 Monmouth properties totaling 4.9 million square feet from the market and plan to reengage in marketing efforts when debt and capital markets normalize. As of June 30, 2022, ILPT's consolidated portfolio included 412 warehouse and distribution properties in 39 states, totaling approximately 60 million square feet with occupancy of nearly 99%. During the second quarter, ILPT continued to benefit from favorable operating trends, which included record leasing activity of 3.9 million square feet at weighted average rental rates that were 61.3% higher than prior rental rates for the same space. As discussions progress with the RMR Group's property and asset management teams, a strategic opportunity emerged with Home Depot committing to a larger retail footprint of nearly 300,000 square feet as well as a 2.2 million square foot parcel, which will serve as a warehouse and distribution hub. Given all we have accomplished over the last year, with nearly 100 leases signed, totaling 7.1 million square feet, only 2.2% of total annualized revenue is set to expire during the second half of 2022. The components of the debt included the following: a $1.4 billion bridge loan facility at a floating interest rate of 4.2% that matures in February of 2023, $1.4 billion of JV CMBS loans at a floating interest rate of 4%, and approximately $1.7 billion of fixed rate loans with a blended interest rate of 4.2%. And so I think the problem today was that we had gone down the path and had awarded 27 of the 30 properties, but as -- and we have come to a price which reflects the $100 million impairment that Rick talked about. So we haven't identified anything yet, but we do have 203 properties, both on the Mainland and in Hawaii that have $1.7 billion of fixed rate debt in place at an interest rate of approximately 4.2%. I think really, I mean, I think our demand has been throughout -- I mean, throughout the pandemic and even this inflationary market and rising interest rates, I think, if anything, I think there's a lack of supply and the demand continues to be there. And then I think we -- again, with Monmouth, we didn't have too many empty buildings when -- I think we had 1 vacant building that we acquired, and we have a couple that we think we're going to get back, and we've been -- I mean, I think we'll have -- we've executed 1 since we've -- subsequent to Q2, but we've been able to get 10% to 15%, in some cases, 20% roll-ups in rents in those Mainland properties."
}