{
    "symbol": "FISI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 11:15:02",
    "content": " Adjusting for revenue related to PPP loans restructuring charges and impact of the third quarter 2022 surrender and redeployment of company-owned life insurance pre-tax pre-provision income for the quarter was $20.8 million $261,000 higher than the linked quarter and $865,000 higher than the prior year period. During the fourth quarter, we did have a $1.2 million charge-off of a credit with a previously established specific reserve, which was related to a small commercial loan associated with office space. The consumer indirect loan portfolio was $1 billion at year-end, up 2.6% or $26 million from the linked quarter due to continued strong demand. During the fourth and third quarters of 2022, $1.6 million and $6 million of PPP loans were forgiven, respectively, with a related fee accretion of $78,000 in the fourth quarter as compared to $312,000 in the third quarter. NIM, on a fully taxable equivalent basis, was 323 basis points in the fourth quarter of 2022, down 5 basis points from the linked quarter due to repricing and the seasonality of our public deposit portfolio, coupled with a shift in mix from lower cost transaction deposit accounts to higher-cost time deposits. As I stated in the earnings press release, for 2023 we have modeled cash flows of approximately $1 billion from the investment and loan portfolios for reinvestment and new loan originations at market rates, benefiting NIM. Our cost of funds was 109 basis points in the current quarter, up from 58 basis points in the linked quarter due to the impact of higher rates on public and reciprocal deposits and wholesale borrowings, combined with a shift in overall mix from lower cost transaction deposit accounts to higher-cost time deposits. During the second quarter, we took advantage of the opportunity to sell a $31 million portfolio of indirect loans and recognize a gain of $586,000 demonstrating our ability to capture gains within this portfolio by leveraging capital market relationships to remix loan exposures. Alex, your line is now open. Alex, your line is now open."
}