{
    "symbol": "APEN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 23:06:02",
    "content": " We've repositioned the company to go after larger market opportunities, and we're building a much stronger organization that's poised to capitalize on those opportunities as we focus on energizing the business and then over the course of this year, moving into an acceleration mode and eventually building leadership positions in the markets we serve. So turning to slide 12, just a quick reminder for those who are new to Apollo, we've got our three different product lines, our X-Tack product, OverStitch and the ORBERA intragastric balloon and that's really focused across two different therapeutic areas: our advanced GI focus as well as endobariatric or endoscopic weight loss. That involves training new users as well as expanding the different applications that users -- that our customers use OverStitch and making sure that they're familiar with and really apply the product in such a wide range of opportunities, which we know it can in fact positively impact patient care. That's true also in the -- outside the U.S. where the core GI has been a lower percentage of our overall business for OverStitch, and we've got plans in place that we're executing to build that part of the business outside the U.S. We then add in X-Tack, which as you can see on the chart, is a really nice complement OverStitch. Again, we want to continue to maintain the momentum with ORBERA and really ensure that it's sustainable because it's been a tremendous turnaround for a product and a category that frankly struggled for a number of years, but we've seen very nice growth with ORBERA. And by the way, when I mentioned the prelaunch planning around ESG and Apollo REVISE, many of the elements that we're working on in the US have broad applicability outside the US as well, because we are able to really -- for example, the reimbursement efforts that we focus on here in other markets, we will focus on as well. And then on the new hires in the U.S. at late 2022 and -- a late 2021 and during the first quarter, I was wondering if they're focused on preparing for either the X-Tack U.S. launches or the ESG revised releases and approvals or if they're really focused on selling the full bag of the three products?"
}