{
    "symbol": "PETV",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-09 20:25:03",
    "content": "  John Dolan: Greetings, and welcome to the PetVivo Holdings Third Quarter of Fiscal Year 2023 Financial Results Conference Call. My name is John Dolan, the Chief Business Development Officer and General Counsel at PetVivo. Before we begin, I would like to remind everyone that comments made during this conference call by PetVivo's executives may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, and are subject to risks and uncertainties. Any statement that refers to expectations, projections or other characterizations of future events, including financial projections or future market conditions, is a forward-looking statement. PetVivo's actual future results could differ materially from those expressed in such forward-looking statements for any reason, including those listed in its SEC filings. PetVivo filed its earnings release and Form 10-Q with the SEC today, which provide a detailed discussion of our financial results. I would like to now turn the call over to John Lai, the CEO and President of PetVivo. I will conclude by sharing some additional thoughts on our business strategy, key focus areas for fiscal 2023 before we open the line up for questions. Our key highlights for the third quarter of fiscal 2023 were we reported revenues of $510,000 as compared to $51,000 in the third quarter of fiscal 2022. Revenues for the third quarter included net revenues of $457,000 from shipments of Spryng to MWI Animal Health subsidiary of AmerisourceBergen. We continue to expand our national presence highlighted by our attendance at the American Association of Equine Practitioners' annual conference in November of 2022, which Dr. Manning, our senior technical veterinarian, did a theater presentation, actually two theater presentations, where we did get very good response, and we opened accounts in over 47 states. I would like to now turn the call over to Bob Folkes, our Chief Financial Officer, who will discuss our financial results. Thank you, John, and good afternoon, everyone. For the three months ended December 31, 2022, we reported revenues of $510,000 as compared to $51,000 in the prior year. And as John noted, this increase was driven by revenues of $457,000 related to shipments of Spryng to MWI. For the nine months ended December 31, 2022, we reported revenues of $792,000 as compared to $60,000 in the prior year period. This increase was driven by revenues of $575,000 related to shipments of Spryng to MWI. At December 31, 2022, the company had $375,000 in cash and working capital of $171,000. In January 2023, we raised approximately $1.4 million after dejecting transaction expenses from the sale of just over 610,000 shares of our common stock in a registered direct offering at a price of $2.32 per share. And just to conclude here, we continue to invest our resources to expand our sales and marketing efforts clinical studies and manufacturing capacity to gain vet acceptance and support increased revenues from the sale of Spryng. And for fiscal 2023, we expect quite a few of these to - become public through publications as well as presentations. We're also focused on hiring at least two additional territorial sales managers, business development managers, to focus our relationship with MWI expanding that relationship. What we're seeing, because we had talked about focusing on getting more podium presentations, even though we didn't officially do a podium presentation at this event. So our booth got inundated with a bunch of veterinary doctors as well vet techs, substantially big numbers. As well as at the AAEP, when Dr. Manning did his theater presentations, both days, the theater was full of capacity which, in that place, is probably about 100 vets. So we continue to invest in those presentations at the various trade shows and coming up in mid-March is our first small animal presentation by Ethos to one of the major organizations, the Veterinary Orthopedic Surgical Association. I would like to now turn the call over to John Dolan who will provide an update on our clinical studies, clinical data derived from these studies about the efficacy of Spryng and will be helpful to gain more acceptance from the veterinary doctors. PetVivo has a total of seven clinical trials in progress at this time: five small animal clinical trials, i.e., canine and feline; and two equine clinical studies. We are fortunately working with a number of world-renowned research organizations such as Colorado State University, Ethos Veterinary Health and Inotiv Inc. We anticipate public disclosure of these clinical study results to begin in March 2023 and continue intermittently throughout the remainder of our next fiscal year. Operator, will you please explain to the callers or people that are online what they need to do to ask a question. Hi John, , John, that was great - I think it was a great start in the relationship with MWI. I was fortunate enough to visit you over at the World Equestrian Village and got a chance to talk to some of the MWI guys, and they tell me it's doing great. Could you basically just talk about the size of the markets in terms number of animals in each of the markets, I guess, between the two small animals and also the horses, and the differentiation between the size of show horse market versus the pet market. So the MWI relationship is working out extremely well for both parties, and we're both very happy because what happens before every one of these shows. So the size of the market in terms of dogs in the United States, there's about 64 million dogs, 53 million cats and the numbers for horses range anywhere from 8 million to 14 million. It's just depending on the source because there are quite a bit of wild horses out there, too. Currently, I would say that the product mix or the revenues or majority of it are coming from the equine space just because the vets, they tend to see the horses a lot more often than if a small animal vet does the injection. They don't see them for a while and also the small animal side will pick up probably second half of 2023 on a calendar basis because, once those studies start coming out, the MWI reps now will have data to be able get to the smaller animal vets. Our product is targeted at the root cause of osteoarthritis and other lameness issues while competitive products are focused at more treating the symptoms, while we're focused at actual disruption of friction between bone-on-bone contact. So I feel we're unique in that sense, and that's what becomes part of the educational process because when a veterinary doctor leaves vet school, they learn that it's a lifetime management of osteoarthritis. It's multimodal approach, you're using NSAIDs, then you move on nonorganic asset, then you go on to steroids and then and then eventually stem cells joint replacement. We're actually disrupting and changing that equation because we feel once the Spryng particles are injected into the joint, you're going to lead to a tremendous reduction in the need of NSAIDs or any the other materials or complete elimination of it, which helps reduce the side effects onto the horse. All these other items have long-term negative effects and side effects while ours is purely neutral, and that's how we got the veterinary device designation. Years ago, there was a company that that got involved with very early turned out to be a major  where they injected the hyaluronic acid into the actual cartilage that was already leaking. The problem with that is, obviously, it's like putting air into a leaking balloon, air seeps out. I mean it could be fair to say that this is like a cartilage-type material and actually acts differently than the hyaluronic, which is actually a well-known use for equine as well as humans essential. So once our particle goes in, that our matrix particles start forming a staffing, which actually, in essence, over probably the next month or two, the joint actually improves while if you're using other products that are focused on symptoms. And each time you're using an HA product, you're probably diminishing the efficacy as well as the soft tissue, okay. Actually, you're exactly right. When you were talking about medical devices, there are a few products in the market that have been classified as medical device, polyglycan, for example, is one and the HA products, high risk and those type of products out there that you've already mentioned are also considered that. For example, lubrication of the joint, if you put HA into a joint, you're looking to lubricate that joint. The issue is, is you're exactly right also, within probably 48 hours, that HA is out of the joint. With our product, what we're doing is we're injecting a solid into the joint, a particulate that's sponge like, that fills in all the gaps in the cartilage. So when I say it's a particle, the nice thing about that is that it is large enough where it can't get by the synovial membrane. So in other words, as John had mentioned before, you're treating the affliction or you're addressing the affliction by recreating that cushion between the bones. Just had a question along the lines of from past investor presentations, you have a robust manufacturing facility with about 0.5 million unit capacity, $100 million in revenue estimated from that current production facility. So the expansion, actually, if you look at it, has multiple clean room and potential for what we call current manufacturing practice, current good manufacturing practice certifications. Also, that clearly identifies future potential product pipelines to run through there. Because, if you're just using our current facility, you would have to shut down the manufacturing of Spryng for the next product pipeline and then rotate back forth. So we're just really positioning for future growth, potential future rapid growth. The next year, we could have a couple of other products that we're ready - they're ready to roll out any time, we just have to have studies to support it. Well, I shouldn't say, you could have a major disaster where a lot of stuff gets taken out. But otherwise, we're doing the right thing to make sure we don't interrupt Spryng with the momentum we have going right now. Because we're seeing a lot of veterinary doctors now actually putting up videos of success stories of dogs and horses, some veterinary doctors are actually started to inject some cats and seen really good results. So I started using those, product back in October on a family friend race horse, this horse in the past, very expensive horse, so itâ\u0080\u0099s a very, very well that ended up with a bad ankle. So one injection, and he performed incredibly just a week later and then ended up winning quite a few races within the last past four months or five months. So we are five months out from injection now, and we were thinking that it would be time for another one, start wearing off. So but my father, as some of you know, is a very high-level veterinarian in the racing world, and he's just so impressed. Cortisone, over time, as most of you know, degrades the joint which from what we understand about this is just not going to be the case, which is huge for longevity. And we're comfortable saying a year because when we did the human studies on the human side, we track the humans for a year and we're able to identify the particle still in the body. So we have seen situations where in birth defect puppies, where they came of age, where everything is pretty grown in, we have done injections of defective hips where the particles have so far lasted eight years, which was really surprising. So and I talked about the improvement after the matrix is going into the joint, once that scaffolding starts to formulate, it tends to keep the joint functioning even better. So when you first did the injection in the horse, I kind of said you wanted to wait 10 days, but I guess the trainer and your dad said it was okay to let the horse run after a few days, which kind of surprised me, but the horse did extremely well. May I'd wanted to wait, but the trainer they, that's their livelihood. And what was it, gosh, a month or two ago, he went as fast as he ever had in the last two years in a five-degree weather just won the race for fun. Well, that's great to hear. So we stated probably back in August of 2020, when we went on NASDAQ, if you look at the PowerPoint from back then, the milestones would get these studies out, because studies allow our regional sales reps to work with the MWI sales reps to point to specific data to the vets. So we feel there's, multiple milestones from that standpoint. The burn rate, I think it's probably around $2 million per quarter. Bob, you can comment on that, if I'm not too far off, but I kind of recall looking at it, that was the type of number. No we completed the Ethos one which was on to cruise ships and dogs because we're focusing each study on a different joint so that one was completed at the end of October, the first cohort. And the clinician had requested to get it present at the Veterinary Orthopedic Surgical Annual Conference, which is mid-March, so that's coming right up. And once that gets presented, we'll have an abstract for the salespeople to use. They're owned by NVA, National Veterinary Association. So you usually see a vet order one to three syringes on their first turn, then 45 days later or a little longer, they get reports back from the owners of dog and the horses as much quicker, then the next turn, we see a larger order and then eventually, it gets up into 40, 50 units a month. Well, while we're waiting for them, I'll just expand a little bit more on the milestones. Right now, we're at a point, it's just basically providing clinical evidence for the salespeople to convert more and more of the veterinary doctors into the channel purchasing our product. And in the small animal side, it's all data-driven. Sir, you are unmuted on our side, you'd like to ask a question. Well, if there are no more questions, we probably should - hold it, I got one coming being typed in."
}