{
    "symbol": "PETV",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-12 06:26:06",
    "content": " Before we begin, I would like to remind everyone that comments made during this conference call by PetVivoâ\u0080\u0099s executives may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and are subject to risks and uncertainties. I would like to now turn the conference over to John Lai, the CEO and President of PetVivo. I would like to begin with discussing some highlights from last quarter, and then Bob Folkes will discuss the financial results and conditions in greater detail. Our key highlights for the second quarter for fiscal 2023 were reported revenues of $223,280 as compared to $4,977 in the second quarter of fiscal year 2022. Revenues for the second quarter included net revenues of $118,264 per shipments of Spryng to MWI, a subsidiary of AmerisourceBergen â\u0080\u0093 who is our lead distributor of animal health products pursuant to the distribution and sales agreement with MWI dated June 17, 2022; expanded our national presence and have open accounts with veterinary clinics in 14 Southern states now. We will be attending the American Association of Equine Practitioners Annual Conference in November of 2022, and weâ\u0080\u0099ll be coordinating sales efforts with MWI at this important meeting. I would like to now turn the call over to Robert Folkes, our Chief Financial Officer, who will discuss our financial condition. As John mentioned, the most significant event for the quarter was a total revenue of approximately $223,000, highlighted by the net revenue of $118,000 to MWI. During the quarter, we increased our inventory to $305,000 in order to support our expected revenue growth for this current fiscal year. Also within our Spryng Health website, we have a whole series of supporting videos to show various injections or the most common injections as an educational. So, weâ\u0080\u0099re building this whole system of education to support MWI, and this will be very crucial as we move forward into getting the product out into the market. Now, I would like to turn the call over to John Dolan to provide an update of our clinical trials, which will be helpful in supporting our relationship with MWI. In addition, we expect that having more clinical data about the efficacy of Spryng will help us gain more acceptance from the veterinary doctors. We have entered into a clinical trial services agreement with Colorado State University on November 5, 2020, in which we are evaluating the injection of Spryng on elbow-associated osteoarthritis in dogs. We expect this study to be fully enrolled by the end of December 2022 and the data available in the fourth quarter of fiscal year ended March 31, 2024. Also in October 2022, we completed enrollment in a canine tolerance study in which we are evaluating the intra-articular injection of Spryng in dogs for product safety. We expect to have this data available in the fourth quarter of fiscal year ended March 31, 2023. And finally, in October 2023, we initiated a feline tolerance study in which we are evaluating intra-articular injection of Spryng in cats for product safety. Well, John, if weâ\u0080\u0099re not seeing any questions, Iâ\u0080\u0099ll just make a closing comment and then we can end this call. So the AAEP thatâ\u0080\u0099s coming up, which is the American Association of Equine Practitioners, last year was a very big event for us, gave us a whole series of vets that were trying our product, and we were able to get some good repeat orders from these veterinary doctors. Itâ\u0080\u0099s a much bigger event, having it held in San Antonio as well as having â\u0080\u0093 if you saw the news release last Friday, I believe, or sometime this week, we talked about Dr. Joe Manning will be presenting some of the applications and successes that we have been seeing using the product in the equine space for multiple applications. And then also at our Spryng Health website, Dr. Turner gives a whole series of videos that shows how to use the product and what applications. And given that it takes a while to get it published, so weâ\u0080\u0099re looking at getting it published February, March of 2023, which is in time for the new season of the major trade shows and events that we can present a lot of this data at."
}