{
    "symbol": "ENIC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 22:02:10",
    "content": " The full year 2022, the EBITDA is adjusted by the impairment made to the full stock of the period, which amounted to $59 million and $61 million related to the rest of adjustments commented the generation development process, as geothermal, hydropower plants and thermal facility. On the last quarter of 2022, we have also adjusted our EBITDA, but the already mentioned record booked in the period by $61 million. All these 2021 adjustment and to the impairment related to Bocamina to book in the Q4 2021 resulted in an adjusted net income of $74 million and $42 million in the full year and the fourth quarter of 2021, respectively. The variation was mainly related to the agreement with Shell signed and executed in December 2022, totaling $520 million an increase in our PPA sales of $169 million in Q4 2022, primarily explained by the higher devaluation of Chilean pesos  dollar. $81 million due to better products in the period, renewable growth related to the new capacity connected adding $4 million in the EBITDA of the period and the gas estimation activities that generate is $40 million of margin as a consequence of a solid natural gas policy defined for 2022. All the effect that I've just mentioned in the duration side were offset by a negative $64 million related to the variable costs, mainly due to the higher thermal generation volumes and costs related to the commodity price and higher regasification costs due to higher volume. accounted a positive impact of $11 million, mainly related to tax indexation in both distribution and transmission business, partially offset by the provision of regulatory signs in network business due to no compliance on quality services KPI from previous years. Let's move on to Slide 15, where we have the summary of full year adjusted EBITDA breakdown accounted for $1,268 million,  higher versus last year's figures. Partially offset by higher  generation and the aging commodity coverage instruments in the period, a negative $280 million due to higher spot price in the system in the full year 2022. The remaining variation of our EBITDA comes from $43 million due to great remuneration and demand, mainly explained by $49 million on tax indexation in both network business, $11 million coming from distribution and the remaining from transmission business that is consolidated in our book up to November 2022. To conclude, let's review the final two effects in the period and negative hedging instrument effects associated with the bond debt and higher OpEx, mainly interaction business, by $35 million because of the inflation level of 2022 versus 2021. Net electricity generation increased by 17% to 22.2%  during 2022, mainly resulting from a greater higher production due to the improvement in fall and a higher dispatch of our CCT team coupled with the higher generation from other renewable sources, especially solar production, mostly related to the additional capacity of new projects. Our full year 2022 adjusted net income amounted to $1,470 million, representing an increase versus last year's figures of 8.8 tonnes. In Q4 2022 adjusted net income reached 1,300 and $5 million, representing an increase of around 15x in the quarter, mainly explained by effect as just mentioned. The full year 2022 FFO amounted a positive $672 million in the period, mainly explained by the full year 2022 EBITDA, which amounted  million based to $744 million of 2021 due to the reasons previously explained. Well, 2022 was significant was quite a very past situation and of course, as we already mentioned, this activity almost totaled like some of $150 million last year, and it was related to 3 cargoes plus some additional optimization updates that we carried out."
}