{
    "symbol": "LOCL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:04:12",
    "content": " This is visible in our buy versus build approach with Pete's, which brought what will be three facilities into our production network, cemented our presence in the west coast market with its two California locations, and we'll add improved bi-coastal service to customers via the pending Georgia facility. I'll cover our first-quarter 2022 results briefly, which represents Local Bounti on a standalone basis prior to the transaction and reflects the performance of our Montana facilities, which was temporarily geared towards innovation and R&D activities, while we were closing the Pete's transaction. Local Bounti has been driving positive gross margin on our low revenue base and Pete's 2021 adjustment gross margin was 45%, which is in the range of our expectations and should provide a great base to expand from as we implement our margin enhancing Stack & Flow Technology. The end of the quarter with cash, cash equivalents, and restricted cash of $76.4 million, as previously disclosed, in April we utilized a combination of $92.5 million in depth through our cargo facility and $30 million of equity to finance the acquisition of Pete's. Additionally, we continue to expect to achieve initial run rate revenue from the three Pete's facilities of at least $30 million at full production, excluding the expected future positive impact from implementing our Stack and Flow Technology across these facilities. Please, proceed with your question. And so specifically, Pete's living butter lettuce, really, where we're focused, one of the things we're focused on in the first quarter is, applying our Stack and Flow Technology and innovating around that technology to pull the crop cycle down and increase the turns that we could get out of our facility on a per annum basis. Please, proceed with your question. I guess I just -- to start, I appreciate all the color around the progress on the Georgia facility update, but I was just hoping you could comment on the integration of Stack and Flow and to the other Pete's facilities out in California. So a lot of the integration and R&D efforts that we did in Montana this year were really centered around specifically reducing the crop cycle at the existing Pete's facilities in California and in Georgia, and the result that I highlighted as it relates to head lettuce which is one of their core products will be directly applicable to the California facility. But my first question is around the expected revenue contributions here, because with the $20 million revenue guidance on the year and $6 million of Pete's revenue in the first quarter, it would seem to be that not much is expected to be contributed from the Georgia facility when Phase 1-A is complete this summer."
}