{
    "symbol": "PAY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:24:14",
    "content": "  Operator: Good day, and welcome to Paymentus' Third Quarter 2022 Earnings Call. Good afternoon, and welcome to Paymentus' third quarter 2022 earnings call. Forward-looking statements use words such as will, believe, expect, anticipate and similar phrases that denote future expectation or intent regarding our financial results and guidance. The impact of and our ability to address continued economic uncertainty on inflation, our market opportunities, business strategies, implementation timing, product enhancements, impact from acquisitions and other matters. Special note regarding forward looking statements, and risk factors in our annual report on form 10-K for the year ended December 31 2021, which we filed with the SEC on March 3rd, 2022. Our quarterly report on Form 10-Q for the quarter ended September 30, 2022, which we expect to file with the SEC shortly and elsewhere in our other filings with the SEC. In addition, during today's call, we will discuss certain non GAAP financial measures, specifically contribution profit, adjusted gross profit, adjusted EBITDA and adjusted EBITDA margin or non GAAP financial measures. These non GAAP financial measures, which we believe are useful in measuring our performance and liquidity should be considered in addition to and not as a substitute for foreign isolation from GAAP results. Were encouraged you to review additional disclosures regarding these non GAAP measures, including reconciliations with the most directly comparable GAAP measures in our earnings press release issued today and supplemental slides for the webcast, each available on the investor relations page or website. In the quarter we booked over $30 million of new annualized recurring revenue, and expect total new bookings for the year to exceed $100 million, which is about 30% higher than the previous year. As a reminder, our contract terms generally average four to five years, and assuming the continuation of our historically high retention rates, we expect this revenue to grow organically for a long time. Our adjusted EBITDA margin grew over five percentage points from 10.3% in Q2 to 15.7% in Q3, notwithstanding our continued investments in the emerging areas of our business, namely IPN and other related products, which includes our bank bill payment, base bill payment as well. During the quarter, we completed the implementations of several significant clients, including a large municipal utility, a timeshare vacation club, and a real estate company, which continue to show the breadth of our platform functionality and vertical reach and an expanding addressable market. This implementation was completed within a couple of quarters, which shows that our large client enterprise wide deployments can be completed and implemented relatively quickly with a strong client engagement. Additionally, in the quarter, we expanded the payment acceptance capability of a large utility that joined over IPN for expanded coverage of newer payment methods and channels. We are seeing more and more demand for these newer payment methods and channels enabled by IPN, which is bringing additional consumer adoption and accompanying transactions. I'm happy to report that our IPN has crossed over 1 million payees, including SMB businesses, which we believe that's the great foundation for Paymentus to continue to offer innovative services to these payees who are receiving payments, but not fully utilizing our platform yet. During the quarter, we completed the implementation of a credit union with $3 billion in assets on our new flagship product Bill Center, which we believe is attracting interest from other companies and generating larger opportunities. As a result, our IPN Bill Center bank bookings are up significantly over last year, and we expect that trend to continue into 2023. Just over two years ago, for context, in 2020, we were a $300 million revenue run rate company prior to us going public. In spite of COVID economic downturn, higher interest rates, and the inflationary challenges we have faced during last two years since 2020, we have added about $200 million of revenue, and we have now crossed a run rate of $500 million of revenue. And as I said earlier, we expect to close out 2022 with over $100 million in new sales, which was fully implemented as anticipated, is expected to bring our revenue run rate to over $600 million, are doubling our business in a relatively short period of time. As a reminder, today's discussion includes non-GAAP financial measures. In the third quarter we processed 92.3 million transactions, a 30.6% increase over the same period last year. Revenue was a $128.2 million, an increase of 26.0% in the quarter. Contribution profit increased 25.8% over Q3 of last year to $51.1 million, which was a little stronger than we anticipated. Contribution profit per transaction was $0.55, which was consistent with the past three quarters in our expectations. We continue to experience inflation on our average purchase announced, but are starting to see some of the benefits of the pricing actions and other expense management measures we've implemented in the quarter. Adjusted EBITDA was $8.0 million for the third quarter, which represented a 15.7% adjusted EBITDA margin. Due to our focus on the longer term growth, we continue to invest in IPN and related initiatives, which puts pressure on current margins. Overall, the increase in operating expenses from last year was driven by investments in staffing as well as additional operating expenses associated with our 2021 acquisitions. Sales and marketing increased $7.7 million driven by the Payveris acquisition, continued expansion in the sales team, adding partnerships to capture our sizable market opportunity, and an increase in stock based compensation. Non GAAP net income was $1.8 million, and non GAAP EPS was a $0.01 for the quarter. As of September 30, 2020, with $148.3 million in cash and cash equivalents on our balance sheet. Cash decreased primarily due to the timing of certain customer payments, as well as increased operating expenses due to the acquisitions. At quarter end, we had approximately 123 million shares of common stock outstanding. Our contribution profit guidance has maintained between $200 million and $204 million for the year, which is approximately 26$ to 29% growth. Our adjusted EBITDA outlook continues to be in the range of $25 million to $28.5 million, with an adjusted EBITDA margin of 13% to 14%. Finally, as we said last quarter, we would anticipate our full year effective tax rate to be around 30%. To close, we're very excited about the continued acceleration of demand for our product and services exemplified by our expectation of over $100 million of bookings in 2022, and accelerating growth in IPN. And also the fact that our set of IPN related investments, our EBITDA is already materially higher. This quarter, you kind of called out expense control and really focusing on profitability. I think look, our focus remains that and first of all, the reason we wanted to highlight the fact that our core business is already more profitable than or in some ways the EBITDA subdued because of the investments we are making in to IPN and other products. So we feel very confident that as our investments start to deliver more results, financial results, we will be able to get back to the type of margins we have talked about. Additionally, we are making -- we're very focused on the expense control and making sure that we are -- in this tough market we are very -- being very judicious about all our investments, all new expenses we're making. So, we plan to get there I think over a period of time and we'll talk more about that in our next quarter as well. I think -- look our range for the fourth quarter is still that broad, as you can see, and primary reasons are, we got the three factors; implementation, the pricing adjustment based on inflation and inflation itself. So, I wouldn't consider that guide to be a conservative guide, I think that's the range we are pursuing based on these factors. And it is IPN and some of the related products I mean, have a headwind towards our EBITDA margin as you've talked about, that also start to -- as I said earlier, I think we will be able to overcome that as the investment start to pay off even more so than they are already doing right now. And I guess my first question, I guess it's a little like John's in terms of like gross revenue guidance. Well, I mean, there are, first of all, there are different factors, I think Q4 on its own, it has, believe it or not a lot of bills are still paid during the working hours, and the weekdays and Q4 tends to have a lot more holidays than some of the other quarters of the year, that plays a role in this. But the other factors are based on how the implementations are going, and how we will be able to, how many of them are able to produce for us during the quarter. And then, one nice trend, I mean, your contribution profit all through the year has grown at least as fast as your gross revenue, even with the inflation kind of in the market. I mean, look, IPN has a pretty interesting factor, which is neither it is affected by, because there's no interchange associated with. And IPN I think, we will talk, Paul and I, as I mentioned over prepared remarks, we'll talk more about that in 2023. Because we want to talk a little bit about give you the color behind how we see IPN growing, not just the way the dimension it is understood to be in, but if you reflect back on what I said earlier that we now have access to a million payees, and a lot of them are SMB businesses. So for us, we think of IPN truly a network effect, where we can pick these base, we are sending payments due to now start offering them products and services, we otherwise wouldn't be able to. But to specifically address your point you're talking about is that, absolutely, if IPN becomes -- as IPN becomes bigger part of our business, interchange does get less of a factor."
}