{
    "symbol": "PECO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 19:00:28",
    "content": " Our grocery-anchored and necessity-based neighbor mix, our right-sized format and well-positioned locations in growing markets, our record high occupancy with continued strong neighbor demand, our talented and cycle-tested team, our strong credit neighbors and diversified mix, our lack of big box exposure and the lack of distressed retailers in our portfolio. According to Placer our suburban markets offer retailers several advantages in today's environment including: one, comparable if not superior visit per location trends when compared to larger markets; two, less competition; three, greater diversification of customer base; four, easier access to labor as an employer of choice within a market; and five, less expensive build-out costs. Our third quarter core FFO increased 15.4% to $76.6 million, driven by increased revenue at our properties from higher occupancy levels and strong leasing spreads, as well as lower interest expense. I would guess that we're -- you really can't go across the country and say, because the markets are very different regionally and there's certainly expansion of cap rates. But that's certainly one of the things that we look at pretty closely to make sure that we aren't seeing the certain segments and being able to adjust accordingly, but it's -- the truth is we're not seeing it. We know that this is really early days to be able to say because what propco looks like, what the transaction looks like it's just -- there are an awful lot of different variable ways that it could move including not closing and including closing with maybe 300 or 400 stores in propco. And when you take those three things and you look at sort of why we are market leading in those three areas, it's because the retailers are making the decisions to be in our centers and they're being in at a cost where they obviously think they can make money. Our third quarter results continue to highlight the strength of PECO's focused and differentiated strategy of owning and operating, small format, neighborhood centers anchored by the number one or number two grocer in the market."
}