{
    "symbol": "PECO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 16:21:24",
    "content": " Our first quarter FFO increased 14.2% to $72.6 million driven by increased revenue at our properties from our higher occupancy levels and strong leasing spreads, our expanded portfolio as well as lower interest expense from our lower leverage level versus a year ago. Your line is open. And therefore, we’re able to get the kind of the leasing spreads we saw in the quarter, which on our renewals, where in the mid teens, which is again a very high level and compares very favorably to what that level has been historically, which has been circa of 8% to 10%. Your line is open. And then maybe follow up on the balance sheet side, John, I know you mentioned that you don’t need to issue equity to meet your acquisition targets, but with debt to EBITDA now at 5.7 times, could you comment just what range do you want to stay within is lower necessarily better or are you equally as comfortable at some higher number? Your line is open. Your line is open. But it – we’ve seen probably, I mean, and this is one of the reasons we’ve had the results we have, we’ve seen less pushback on bigger rent spreads upfront than we have on getting the CAGRs up to 3%, 4%, 5% to match kind of where people are seeing inflation. And as long as that pace continues and that those tailwinds continue where – more people are working from home and more people are seeing the convenience of a shopping center, three miles from their house that we’re going to continue to make that bad and think that we’re going to be able to get better returns than even we underwrite because of the strong operating environment we’re in. Your line is open. We – as we sort of think about the quarter, some of our highlights are that – we do think we're going to generate almost $90 million of free cash flow this year from the company, which is again great growth engine for us."
}