{
    "symbol": "AVAH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 14:42:05",
    "content": " As a result of the lower revenue as well as the efficiencies gained through Homecare Homebase, the operating team has identified about $6.5 million of costs that we took out in late Q3, with the full benefit being realized in Q4. These estimates include the benefit of a hospice rate increase effective October 1, the ongoing benefit of the 2022 rate improvements and improved volumes in PDS partially offset by continued reserve pressure in home health during the quarter as well as the impact that we experienced during the Hurricane Ian across our private duty and Home Health segments. As Tony previewed, while we're excited to be fully converted to the Homecare Homebase operating system, we've experienced some business disruptions that significantly impacted Q3's Home Health and Hospice results. During the quarter, we made the strategic decision to direct 100% of our Home Health and Hospice teams focus towards Homecare Homebase and the process improvements driven by the system. Although I expect some revenue adjustments to bleed through to Q4, our Home Health and Hospice revenue should rebound back into the $54 million to $56 million range with our Home Health and Hospice collections significantly improving and our revenue reserve getting back down below 5%, our Q4 gross margin should normalize in the 45% to 47% range. And finally, although disappointed with our Q3 Home Health and Hospice results, we firmly believe in the fundamentals of both businesses and our Home Health and Hospice leadership team's ability to generate sustained growth, positive clinical outcomes, improved profitability and cash collections moving forward. Obviously, we've talked about our large states being California, Florida, Texas, Colorado, Pennsylvania, and we'll be paying a lot of attention to all of those states during the legislative process to make sure that people understand what's going on within private duty and as well as the negative impact that's having on their overall Medicaid budget because these patients are sitting in hospitals in higher cost settings waiting to come home."
}