{
    "symbol": "AVAH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 16:03:04",
    "content": "  Operator: Good morning, and welcome to Aveanna's Healthcare Holdings Fourth Quarter and Full Year 2022 Earnings Conference Call. At this time, I'd like to turn the call over to Shannon Drake, Aveanna's, Chief Legal Officer and Corporate Secretary. Good morning, and welcome to Aveanna's fourth quarter 2022 call. My name is Shannon Drake, the company's Chief Legal Officer and Corporate Secretary. Additionally, during today's call, we will discuss certain non-GAAP measures, which we believe can be useful in evaluating our performance. A reconciliation of these measures can be found in this morning's press release, which is posted on our website, aveanna.com, and in our most recent annual report on Form 10-K. With that, I will turn the call over to Aveanna's Chief Executive Officer, Jeff Shaner. My initial comments will briefly highlight our fourth quarter results, along with the steps we are taking to address the labor markets, and our ongoing efforts with government and commercial payers to create additional capacity. I will then provide some thoughts regarding our outlook for 2023, prior to turning the call over to Dave to provide further details into the quarter and our outlook. Revenue was approximately $451 million, representing a 9% increase over the prior period. Gross margin was $128.8 million or 28.5%, a 3.5% increase over prior year period. And finally, adjusted EBITDA was $29.7 million, representing a 35% decrease when compared to the prior year, primarily due to the costs associated with the current labor environment. As we have previously discussed, the labor environment represents the primary challenge that we need to address in 2023, to see Aveanna begin to resume the growth trajectory that we believe our company can achieve. While we have several initiatives underway to improve the rate we are paid by government and managed care payers for the services we provide, there are three primary areas of focus. First, we need to execute on our private duty legislative strategy to increase rates by double-digit percentages in three of our larger states, California, Texas and Oklahoma. These three states represent approximately 25% of our total PDS revenue, and we have active legislative, media and lobbying efforts in place to demonstrate the importance of these rate increases and how they support an overall lower health care costs, improve patient satisfaction and quality outcomes. While we continually focus on legislative activities in all of our states, if we can directly impact these three states in 2023, we can accelerate our growth by increasing caregiver capacity and bringing more patients to the comfort of their own home. By passing meaningful wages through to our caregivers, we become a solution for overcrowded children's hospitals and distraught parents who want their children to be cared for in the comfort of their home. We began this journey in 2022 with strong success in our Texas and Pennsylvania markets and have ongoing discussions to further expand these relationships in 2023, based on positive results generated for these payers to date. Our PDS preferred payers represent approximately 10% of our PDS volumes to date, and we see this expansion accelerating towards 20% by year-end 2023. Our dedicated payer relations team has a robust managed care payer pipeline, and I expect us to add additional preferred pay agreements in the first half of 2023. Finally, we will continue to shift our current labor capacity to those payers that value our services and appropriately reimburse us for the care provided. The value proposition is straightforward, preferred payers reimburse us a fair rate, and we pay market competitive nursing wage rates while also earning value-based payments for achieving positive clinical outcomes and improved staff dollars. We are encouraged by our early 2023 recruiting results and believe our business can rebound quickly if we can achieve our rate goals previously discussed, home and community-based care will continue to grow, and Aveanna is a comprehensive platform with a diverse payer base, providing cost-effective, high-quality alternative to higher cost care settings. And most importantly, we provide this care in the most desirable setting, the comfort of the patient's home. As we start this next chapter, we believe it's important to set expectations that acknowledge the environment we are operating in and the time it will take to transform our company and return to sustainable growth. Accordingly, we currently expect full year 2023 revenue to be greater than $1.84 billion and adjusted EBITDA of at least $130 million. We believe our outlook provides a prudent view considering the challenges we face with the current inflationary labor environment, and hopefully, it proves to be conservative as we execute throughout the year. By partnering with preferred payers, we can and will move the rate and wage metrics in meaningful ways that support our growth. First, I'll talk about our fourth quarter financial results and liquidity before providing detail on our outlook for 2023, starting with the top line. We saw revenue growth across all three of our operating segments with private duty services, home health and hospice, and Medical Solutions growing by 9.3%, 12.4% and 0.7%, respectively. Consolidated adjusted EBITDA was $29.7 million, a 35% decrease as compared to the prior year. Starting with private-duty services, revenue for the quarter was approximately $361 million, a 9.3% increase and was driven by approximately 9.6 million hours of care, a volume increase of 6.1% over the prior year. And while volumes improved over the prior year, we continue to be constrained in our top line growth due to the shortage of available caregivers. Q4 revenue per hour of 3,766 was up $0.82 sequentially from Q3 or 2.2%, and we were pleased with the rate improvement we experienced throughout 2022. Turning to our cost of labor and gross margin metrics, we achieved $91.9 million of gross margin or 25.4%, a 0.8% decrease from the prior year quarter. Our Q4 spread per hour was $958, we experienced improvement in our preferred payer volumes with select payers year-to-date organic growth rates reaching the low double digits. Revenue for the quarter was approximately $54.7 million, a 12.4% increase over the prior year and a sequential improvement of $4.9 million over the previous quarter. As we discussed in the third quarter, we're excited to be fully converted to the Homecare Homebase operating system. In Q4, we averaged approximately 850 home health admissions per week with an episodic rate of 63%, we believe we will return to more than 900 home health admissions per week in the first quarter of '23, while maintaining our episodic mix. Our fourth quarter revenue was driven by 11,000 total admissions with approximately 63% being episodic and 11,000 total episodes of care. Although 2022 is a difficult year for our AAA segment, we firmly believe in this business and its long-term value proposition. During the quarter, we produced revenue of $35.2 million, a 0.7% increase over the prior year. However, revenue per UPS was $39.90 lower than Q3, which resulted in margins declining to 39.7%. As a result, our gross margins were $13.9 million, a $1.4 million decline over the prior year quarter. Continue to evaluate ways to be more efficient and effective in our medical solutions back office to leverage our overhead as we continue to grow, while other enteral providers decided to exit the market in '22, we see this as an opportunity to expand our national Inderal presence into further our payer partnerships. And as Jeff stated, our primary challenge is reimbursement rates as we continue to make progress in 2023 with the rate environment, we'll pass through those wage improvements and other benefits to our caregivers in the ongoing effort to better improve volumes. At the end of the fourth quarter, we had liquidity in excess of $230 million, representing cash on hand of approximately $19.2 million, $35 million of availability under our securitization facility, and $180 million of availability on our revolver, which was undrawn as of December 31. As we look at the timing of earnings for 2023 and the related cash flows, while we may draw on the revolver for short-term timing-related items throughout the year, our goals are for the revolver to be undrawn as of year-end and more importantly to drive positive operating cash flows in the second half of the year as we begin to realize all the benefits of the efforts Jeff and I have talked about today. As a reminder, regarding revolver availability, the leverage covenants under our revolver become applicable if more than 30% of the total revolver facility availability under the credit facility has been utilized, subject to a $15 million carve-out for letters of credit, should the leverage covenant become applicable, maximum allowable first lien leverage would be 7.6. On the debt service front, we had approximately $1.46 billion of variable rate debt at the end of Q4. Of this amount, $520 million is hedged with fixed rate swaps and $880 million is subject to an interest rate cap, which limits further exposure to increases in LIBOR above 3%. Looking at cash flow, 2022 cash used in operating activities was $48.4 million. Bear in mind, though, that 2022 cash flows were impacted by certain CARES Act items, including the final $25 million repayment of deferred payroll taxes to the IRS in December, and the repayment of $3.5 million of CMS advances over the course of 2022. And looking forward to '23, we expect to make progress on improving our cash flow by focusing on improving reimbursement rates and growing our volumes, reducing costs and optimizing our collections. As Jeff outlined, we currently expect full year 2023 revenue to be greater than $1.84 billion and adjusted EBITDA of at least $130 million. As we think about seasonality, we expect our revenue to grow as rate increases are implemented throughout the year and our volumes grow. Accordingly, we expect approximately 18% to 19% of our full year adjusted EBITDA guidance to be recognized in the first quarter and approximately 43% of our full year guided adjusted EBITDA to be recognized in the first half of '23. As most of our annual rate increases typically become effective in the second half of the year, we expect our adjusted EBITDA to ramp as we use the increases to attract and retain more caregivers and drive volumes. Please proceed with your question. I think -- I'm going to go back to our prepared remarks for a minute and just say as we think of our guidance, we recognize our guidance is likely conservative yet as we sit at this point, very, very prudent. I think as Dave and I have thought about the year, we felt like it was important to kind of reset expectations and then show our commitment to beating those expectations. As you think of the year, Taji you think of our - especially our three states we talked about California, Texas, Oklahoma, most of those or all of those rate increases would be effective in Q3 and the being of Q4. So if you listen to Dave's comments, our guidance would suggest that second half of the year is significantly greater than first half of the year, I think Dave talked about 43% of the guidance in the first half of the year and implies 57% of the guide in the second half of the year. But also one of our key initiatives this year was to identify and reduce costs where appropriate, both in corporate and field. And yes, they are baked into our at least $130 million, but I think we also recognize that it's prudent for us to be conservative at this point. Like many of our peers, we experienced positive recruitment applications and hiring trends right out of the New Year. And our preferred payer strategy, as we laid out, as we talked about today, we're seeing caregiver hires pushing three times greater than our non-preferred payers. They believe in our value proposition paying us an appropriate wage - sorry, appropriate rate that allows us to pay at least a market level wage, if not slightly above the market level wage. And because of that, we're seeing in that 10% of our PDS volumes, really the ability to be hiring out in front of the market. What we're staffing is we talked about 15% to 20% greater staffing rates with our preferred payers, we're bringing children home at a pace of almost five or six times greater than a non-preferred payer. So I think we highlight that to say even though the trends out of the first of the year were positive, our strategy is not to expect the wage market to settle or nurses just to come back and drove, our strategy is to drive rate and reinvest rate into wage and outpace the market specifically in our PDS business. I would say, in our home health and hospice business, we're certainly competing with our peer group in that space. And so we're focused just on retaining, engaging and maintaining the core caregiving staff we have in the home health and hospice side. Please proceed with your question. So I guess - can I use this as a follow-up to the prior question, which I didn't feel like I got the answer here in terms of the preferred payer strategy and the increasing I guess, growth from that. I think as we said in my prepared remarks, we're highly focused on these three states in this year because we feel like these three states are not currently competitive with the market wages for nurses in those states. And we think we think it's highly, highly important for California, Texas and Oklahoma to move those rates so that we can attract nurses and help solve the value proposition, which is getting patients home, and yes, we did bake the idea of overall rates into our guidance. Now in our prepared remarks, we talked about we are asking in all of those states for double-digit rate increases. But if you think of California, the last rate increase they gave us, it was July of 2018, and that rate is no longer market. And we fully expect California to give us a sizable rate increase, not because of any other reason, then the value proposition says, if you pay a nurse of fair wage in California, we can staff the cases and we can bring these children's home. We've got research in California that shows us that we save around $6,000 a day. So bringing a child home one day faster in the state of California saves California Medicaid systems $6,000 a day, that value proposition is landing very well in the legislature as well as the Governor's office and Medical itself, they understand investing in our services truly saves total health care costs for states like California. And although $6,000 sounds like a lot in California, it's not materially different than any other state we operate in. So I hope that addresses the guidance question, but we have a strong level of conviction on continuing to move both legislative rates and, at the same time, moving our managed care and commercial payers from being a payer to a preferred partner. Yes, thanks for the additional color, because I guess it's an important part to understand what you include in the guidance now for the rates, I guess, is a little bit lower than maybe what you're asking for, which is prudent. So yes, there's a legal matter that we've been defending that originally rose back in 2019, and in connection with those with legal matters we accrued additional legal settlement costs in the end of Q4. As we go, you're right, that was an additional approximate $12 million in the current quarter. A year ago quarter, what you saw was just that we had we did not have the $12 million of incremental COVID-related costs from a year ago. And if I may sneak in on the home health segment, so you said that you're seeing some improvement there, I guess, both in cost reduction  Q3 and you're still excited about that business. First, let us go on record with the entire home health and hospice industry by saying we do not think that, that putting the behavioral adjustment in 2024 is the right thing to do. We stand firm with the entire National Association for Home Care, all of our peers by saying that is a devastating temporary rate impact to the business, it's unnecessary certainly inflation in the last three years of inflation have outpaced the basically flat to slightly negative rate in home health. With that said, we are expecting rate to be continue to be a headwind or choppy for the next few years in home health. And because of that, we're focused on now, as Dave mentioned, we're fully operational, fully implemented Homecare Homebase. We're focused on operating the business, doing the things that we can do to provide the best care with the best outcomes and also provide an appropriate gross margin and margin profile. And in our comments, we commented that we're 63% episodic business. And I think we're ahead of the industry in that, that we stay committed to being an episodic reimbursed primary reimbursed focus. And because of that, I think that we can stay and achieve and stay in that 45% to 46%, maybe 47% gross margin range here in 2023 and truly continue to grow the home health and hospice segment, but also maintain profitability at the gross margin and contribution line. Please proceed with your question. I think - and Dave put it in some of his prepared remarks, AMS, we fully expect to stay in that 42% to 43% range. As you look at Q4, you'll see we had a little bit of reserve adjustment in the quarter that brought it down just below 40%, but strong expectations for Medical Solutions this year, we'll be right in that 42% to 43%, maybe 43.5% gross margin range. And then if you normalize PDS for that legal reserve that we took, we're still in that 28.5%, just shy of 29% gross margin. I think, we would tell you that's probably where we'll land in 2023, even though we're shifting volume away from lower-paying payers towards more appropriate paying payers with our preferred payer strategy. So, I think you'll see us stay in that, Dave, I would say 28% to 29%, maybe slightly above 29% from a gross margin in PDS. So 100% of our revenue was collected in cash in '22, which is a phenomenal outcome in this business. So that we can manage our business and invest in the business so as I talk today, I just want to say, I'm as a new guy, as a new CEO, I am very confident in our overall liquidity position, and just that we've got a great team with a lot of tenure managing the important parts like collections, like cash management. So I think we're in a great position as we start the year, and we've got opportunity to invest in our company as needed. And just to add on with regarding the question on CapEx, we're judicious with the CapEx dollars this year. In terms of operating cash flow, our goal is to turn operating cash positive in the second half of the year. And we think we'll make significant improvements from where we landed last year, both on operating cash and free cash flow. The one thing I will call out is as we look at our cash flows as we go across 2023 is based on how we account for our derivatives since we don't use hedge accounting, the benefits of our interest rate caps will come through operating cash flows. Please proceed with your question. Great question and Ben, I think as you think about our organization, I made the comment about our - the experience and maturity we've got at our cash collections, RCM, as I look out in the business and actually all three of our business divisions, our division presidents or our region presidents, they average between a low of 20 years of experience in the high of 30 to 35 years of experience, most of those years have been with us or with companies that we've run in the past, whether it be Gentiva, Health Field, PSA. And so, as we think down in the business, both at the payer relations, government affairs, sales, clinical oversight, operating side of the business, all the way down through the business down to the actual branch locations, we've got a tremendous amount of tenure, both on the Medicaid side, the private duty side, on the home health and hospice side as well as our medical solutions team. We're having - we're bringing some new blood in, some younger blood ends, even the younger folks in, so we can continue to replenish the talent as many of our leaders are in their second and third decade of leading post-acute health care companies. I will say, and you've heard us say this before, in the last two years, we took one FTE in payer relations and government affairs to now approaching 20 bodies. And that's part of why we talked about cost reductions, and we've invested significant dollars in these core areas, at the same time, we're going to go back through the business and just find areas where we can be more efficient and more effective so that we can truly get our profitability back up towards that 10% goal, we've had all along. I mean, obviously, we'd all like it to be lower, as we drive our operating cash and drive our free cash, the ultimate goal of that is to ultimately build cash on the balance sheet and lower our net debt and leverage. So, I'd just say that we're very focused on operating the business and driving all the benefits that Jeff and I have talked about. And like we said, getting to positive free cash - I'm sorry, positive operating cash in the second half and just driving on all fronts there. Please proceed with your question. And yes, I think I'll state the obvious, and that is the value proposition is the same conversation in every 1 of our 33 states. And it's - the research shows that our medically fragile patient population is spending anywhere between a minimum of 30, a maximum of 90 extra days in children's hospitals that is unnecessary for their care because there's not enough home nursing services. At the end of the day, I would tell you I believe firmly that California, Texas and Oklahoma will all pass through PDS rate increases. And I think I think they - the legislatures that we have talked to in the States, we've spoken with the Governor's offices in all three states, they understand the issue. And if you take California as an example, sometimes there's just macro stuff going on in the state that has nothing to do with nursing, children, home services that just takes the attention of a governor or a legislature away from an important issue like ours. And so, end of the day, as Tony and I talked about in the last couple of calls, these states are going to pass through rate increases. It's just a matter of when and how much, I'm confident that we're going to come out of this summer with a very good outcome in all three of these states. I mean, we're asking for 20%, 25%, 30%, 35%, 40% rate increases in these states because that's what it takes to ultimately materially move the needle in the home nursing. So we're heads down for the next 90 days, driving this agenda, not only in these 3 states, but every single 1 of our 33 states, and I think we feel very confident we're going to have a great year related to government affairs rate in PDS. Please proceed with your question. I think as the federal government has leaned into home and community-based services, which is now a defined term in CMS and the federal government that's good for us. And I think as we think of the long-term macro 10-year outlook, I think PDS has got great tailwinds from a long-term demand standpoint, it truly will come down to the supply of caregivers, both family caregivers in the home and skilled acute nurses that are coming to the home. To us, the long-term demand metrics for PDS still make a ton of sense, and it continues to be a supply issue for as far as we can see in the next three to five years, it truly continues to be the ability to attract and retain both skilled and lesser skilled caregivers. And maybe just a follow-up on a different topic, I know you've talked a lot about the rate side of the business. And I gather that on the rate side, a lot of the problem is organizational attention and initiative, whether you're talking about a state agency or managed care commercial payer. As I think of MCO payer partners, it's a similar conversation. It's just that the MCO partners figured it out faster, that they see, hey, I can say, $5,000 a day. Even if they start giving us what's called single case agreements, which mean that they approve one family at a time at a new rate, we see the MCO partners moving in a matter of hours and days versus months and years from our state partners. I will say, over the first - we're about 18 months into this strategy. And so we've seen MCO payers go from not interested now, not now to, \"Oh my God, what do I have to do to get what the other pay in this market has gotten from Aveanna which to us shows the power of the partnership, and I think, again, I'll go back to the legislative comment."
}