{
    "symbol": "AVAH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 17:55:05",
    "content": " Thank you very much, sir. But with that said, I think this most of the softness that we've talked about in the first half of the year is really more attributable to Private Duty and it's primarily driven by the constraint -- the labor constraints with the caregivers as well as the impact of Omicron. But in my remarks, as well as in Jeff remarks, one of the things that we're seeing and Jeff made a comment about the seven rate increases that we've seen so far and the ongoing discussions with different MCOs and payers and then legislative sessions that are contemplating rate increases that we continue to see a very positive rate environment for the foreseeable future and while we can't -- while we can talk about the timing of what rate comes in when, with the remainder of 2022, I believe will be a positive rate environment with rate changes happening each and every quarter. And when we invest those dollars into wages, one of the thing -- we then know that volume will improve, as a matter of fact, what I'm about to say is all public information, the State of Pennsylvania put through a rate increase for these services that was effective in January of 2022 and there was a meaningful rate increase, I think if you go and read their press releases 10% or 11% rate increases and as we see that flow through, we actually saw volumes hold their own during the quarter, even when the rest of the world was going down with Omicron. So I think as we think of that, all things rates are certainly being supported and driven by the federal support of the Medicaid programs and I think as Tony said it well and whether it's a -- whether it's a permanent rate in Pennsylvania or it's a temporary rate in North Carolina or it's a one-time pass-through amount in one of our states, all of which is intended to support the realignment of caregivers to wages and I think that's -- that's what you saw in Q1 and I think we'll continue to see that in Q2 and beyond. We should use that Q1 rate as a starting focus in the shale is like okay, I guess we have to exclude that $3 million, but it sounds like there is going to be additional funding coming through the following quarters anyway, so I guess is that the way to think about it that $36.40 something in the quarter as our kind of starting point and grow from there. We're really focused on the states where we think the rate has -- the reimbursement rate has kind of fallen behind the current market for nurses in the Private Duty Services segment and I think as we talk in August, we'll be reporting very positive news on additional rate increases in those states that were necessary to really reengage nurses at the level that we expect. As I said in my prepared remarks, wage is the absolute number one driving decision, it's culture is great, engagement is great, but wage is the decision and so for us to be able to get the wage rate at the necessary level to engage caregivers, we've got to continue to engage the legislatures and payers, and I think as Tony mentioned, we have found that audience to be continually receptive to this conversation. No, Pito, I think -- let me step back and just say in our Home Health and Hospice business segment, where we are employing full-time benefited caregivers, we whether the Omicron storm much better, our turnover rates and our retention rates are right in line with what we expect, our reliance on contract labor and over time has subsided appropriately. As it relates to our PDS segment and week-to-week fighting in this business, to Tony and my comments, we are held based on the rate that we're able to negotiate with our -- with our state legislatures and our payers, and again I think I would tell you and we've been talking sequentially the last three or four quarters, we continue to have a very, very positive rate discussions with our payers and with our legislatures. I just want to make sure if I'm understanding this right, last quarter you talked about they’re potentially being up to $30 million of COVID impact in 1Q and it sounds like today, you're talking more about $14 million to $15 million and then last quarter you talked about the rate increases coming into play in 1Q and 2Q and it sounded like today, it's more 2Q. I think in your prepared remarks, you said your deal pipeline remained robust, are mom-and-pop regional providers, are they dealing with the labor challenges that you're describing in pretty much the same way, is there any reason to think you're doing better and therefore, they might be looking to partner, have you seen any one drop out of the market, because they just can't get the staff at a reasonable rate to continue to serve patients. I wouldn't think about they're just closing the door and when I said that maybe I'll clarify that, it's just getting harder and harder to get nurses and to be able to run this business in an effective way and size and scale really does matter and especially density and when you have -- when you're trying to staff 10 patients in a market and the 10 patients are 20 miles apart versus staffing 100 patients in a market, where there are 4 and 5 miles apart, that makes it easier on the Private Duty side. What I mean by that is, let's say, you're going to pay $100 on average for all your state, do you think a 5% rate increase is in the card, so it goes to $105, you said you have seven updates, I'm just trying to think about your pricing, kind of how to baseline your pricing expectations, as we sit today realizing we don't have all the details. So in those two states, we have meaningful, talking a north 15% to 20% movement in the reimbursement rate on the table in the legislative process and with the full intention that we would move wage rates in the $5 or $6 an hour type range in those markets, so that's the kind of movement we're talking about negotiating. Thank you very much, sir."
}