{
    "symbol": "CMRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 11:04:03",
    "content": " During the third quarter, revenues reached approximately $290 million and adjusted net income reached $107 million compared to $216 million and $82 million for the same period last year. As of quarter end, cash balances and short term investments stood at around $745 million and total liquidity, including interim credit lines, was about $890 million. Focusing on increasing visibility into our contracted cash flow base, we have recently chartered with a leading liner company a total of 11 containerships with existing charters recently expanding into 2023 and 2025. Seven of those vessels were chartered for a period ranging from four to five years starting from 2025 onwards, and the remaining ships were chartered for a period ranging from two to three years with  starts in 2023 and 2024. On the dry bulk market, rates for our vessel sizes remain profitable, especially for owners who entered the market the year before. On the back of our increased liquidity and container charter coverage, we are focused on new investment opportunities in the shipping sector that have the potential to provide enhanced returns at acceptable risk levels. For the quarter, net income was $180 million or $0.89 per share. Slide 4, as already mentioned, during the quarter we forward fixed 11 containerships for an incremental average period of 4.6 years, that adds approximately $420 million in contracted revenues. We do continue to charter all our dry bulk vessels in the spot market,  24 ships since our last earnings release. Finally, in October we concluded the sale of three containerships for a combined capital gain of around $106 million expected to be realized in Q4 of this year. The dry bulk market has also weakened but remains at healthy levels, especially for smaller size vessels which we operate. Moving to the next slide, Slide 8, you can see our containership fleet has a current backlog of $3.4 billion with a duration of 4.4 years. The adjusted figures take into the consideration the following items: accrued charter revenues, accounting gains and losses from asset disposals, and other non-recurring or non-cash items. Moving to Slide 10, over the past few months there have been a limited number of fixtures, and the ones that have been  were for shorter periods at lower rates, however, charter rates remain firm in historical context. Moving to the last slide, Slide 11, you can see the recent dry bulk market trends where rates have been volatile but do remain at profitable levels, especially for owners like us who entered the market last year. Guys, maybe we could just start with the bulk market and try to get a better understanding of what the rate environment looks like specifically there. You donâ\u0080\u0099t have a lot of replacement grain, you have more storage on the ships so that would theoretically be putting pressure downwards on the TCE rates that you guys are able to get, so it looks like that remained a little stronger than we thought. Recently, the last couple of days, we have seen a shortening in the market and itâ\u0080\u0099s been volatile for the bulkers now. In the future this might change, I donâ\u0080\u0099t know, depending on the view we take, but considering our low cash breakeven levels and the fact that we are generally positive on the fundamentals of the dry bulk market, for the time being weâ\u0080\u0099ll follow this strategy. Now, I cannot forecast, and we never provide forecasts where we think the market will be heading the next quarter  Q2 or Q1 of next year, but I can tell you that considering the low order book and being internally bullish on the dry bulk sector, this is the view we have today. In the past, I have to tell you that there were some--part of the upside in the Handys had to do with the elevated levels of no and little availability in the containers, and congestion was a determining factor there. However, at the same time, as I already mentioned, we have a very low order book and we do feel that in that sector compared to the containers, for instance, the supply and demand dynamics are overall more positive. At the same time, if there is some stimulus package or some growth, for instance in the construction industry in China, this is going to be a huge boost for the dry bulk vessels, and this could also be the case, so itâ\u0080\u0099s a lot of factors. You guys were obviously very aggressive last year expanding into dry bulk, it looked like it was well timed. For the containers, youâ\u0080\u0099re right - we have seen the market softening in terms of charter rates and also in terms of box rates. However, we donâ\u0080\u0099t feel asset values have come to a level, either new buildings or second-hand vessels, where an investment today would make sense. Probably in the future in the containers, there will be opportunities, but this is not something we see today, and it make some time until box rates and charter rates find their way to asset values. Now for the dry bulk vessels, yes, last year I think the timing of our acquisition with the benefit of hindsight, I think it was good. Those acquisitions do make sense and those ships were acquired with low leverage and at low cash breakeven levels, so today they are profitable and they have been profitable since buying them. Now also for the dry bulk vessels, we have not seen asset values at levels close to those of the summer of last year, when we made our acquisitions, so based on that, I think the proper thing to do is to sit and wait. Like in the past, whatever acquisition we do, itâ\u0080\u0099s going to be on the merits and not for the sake of growing, so asset values in the dry bulk sector, we still consider them to be relatively high, or we havenâ\u0080\u0099t seen something that does make sense. The same applies for the containers for the new buildings - we didnâ\u0080\u0099t put any new buildings over the last couple of years, as you mentioned. The main reason was that new building prices were extremely high and we would be ordering at the peak of the market, which is something we try to avoid. So we have those vessels now, containers and dry bulk vessels, they are all profitable. We fix forward as many containers as we can, and we receive the yield on the dry bulk vessels, the acquisition of which I think, considering where the market is, was well timed. Well, for the time being, what weâ\u0080\u0099ve seen, the prices are high and there are still new building orders being put, especially by liners, so in this environment--of course, there could also be some exceptions and opportunities like we havenâ\u0080\u0099t seen, so in this environment if you look at it from a historical perspective, still it is a very high asset value environment, which in that we donâ\u0080\u0099t want to put any orders. Look, for the time being, there are no immediate plans to have a spinoff or have a separate company, where we would have a dry bulk platform and also a containership platform. The containers, they provide us today with the contracted cash flows, which are close to $3.5 billion. The dry bulk vessels, at the same time they are more opportunistic, but we started from a low cost base, so we donâ\u0080\u0099t see any reason today to have a spinoff. Of course, in the future circumstances might change and it might make sense, but today there is no--there are no immediate plans to have the dry bulk vessels spun off under a different entity. Our first one, we just kind of wanted to get some color on how youâ\u0080\u0099re thinking about maintenance capex for vessels moving forward. We wouldnâ\u0080\u0099t have a problem to scrap a vessel if you can use this equity in order to renew the fleet, or the funds released from the scrapping, they could be used in some accretive investments, but today there are no plans for scrapping based on our fleet portfolio, both for the containers and obviously for the bulkers as well. We have a buyback program for the preferreds of $850 million, which we have not utilized. We have utilized part of our buyback program for common shares, and some of the preferreds, they are callable as well because five years have elapsed since they were offered, so itâ\u0080\u0099s a matter of where we think weâ\u0080\u0099re going to be allocating our excess liquidity, whether itâ\u0080\u0099s going to be buying back stock, as we did with common stock, like we did in the past, or some preferreds, also some other types of investments. There are discussions, we know the preferreds, we know the buyback of the stock , we think itâ\u0080\u0099s trading at below NAV, so weâ\u0080\u0099ll see. Looking at share repurchases alongside Q2 results, you disclosed you had repurchased $60 million worth of shares, but no additional buybacks have been pursued since then. We have a program of $150 million for the common, so itâ\u0080\u0099s $90 million more available under this program, and we also have a program for the preferreds. Of course, we have the option to buy back more shares, especially considering where the stock is trading today or where the stock has been trading over the last weeks. At the same time, we have the option for the preferreds as well, so this is something that we are considering, but Iâ\u0080\u0099m afraid I cannot tell you that we have decided to buy back so much common stock or so much preferred at this price, under those conditions within the next quarter or so."
}