{
    "symbol": "CRNC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-09 11:03:14",
    "content": " Before we begin, I would like to remind you that this call may involve certain forward-looking statements. These statements are subject to the risks and uncertainties as described in our SEC filings including the Form 8-K with the press release preceding todayâ\u0080\u0099s call, our Form 10-Q filed on May 10, 2022, and our Form 10-K filed on November 23, 2021. In addition, the company may refer to certain non-GAAP measures, key performance indicators and pro forma financial information during this call. The conferences include the Raymond James 2022 Diversified Industrials Conference on August 23rd in New York, the Evercore 2nd Annual TMT Conference on September 7th in New York, the RBC Capital Global Industrials Conference on September 13th in Las Vegas, and the Goldman Sachs 2022 Communacopia and Technology Conference on September 14th in San Francisco. Working with our customers, we delivered 43 SOPs in the quarter. Additionally, we gathered with nearly 150 researchers and developers at our first Cerence Technology Conference truly out the roadmap for our next groundbreaking offerings. Overall, our core business performed well, including a record quarter for professional services. However, despite the positive momentum, there are a handful of items that adversely affected our Q3 revenue performance. Revenue at $89 million came in slightly below the bottom of our guidance range, yet adjusted EBITDA and non-GAAP EPS were in line given our continued focus on efficiencies. Working against us, as the quarter progressed, were slower than expected revenue from certain new products and markets. Continued FX headwinds and pressure on car production, which was down 6% from last quarter according to HIS. As with many companies and peers, we expect some of these trends to continue, which affects how we look at Q4 and importantly our long-term planning and goals of sustainable growth. We will come back to these in a moment, but first let me share a few more details on the quarter. These vehicles from customers such as Toyota, Stellantis, Hyundai, Ford and Mercedes are now hitting the road and are expected to contribute to revenue over the next several years. We officially launched our new Cerence Cloud services that significantly enhance the user experience and set new performance benchmarks for accuracy, latency and access to more innovation. We have initially provided these new cloud services for NIO, BYD and GV. Each of these efforts and milestones are additional important layers to the foundation of our business, product and delivery excellence, great customer relationships, a compelling innovation roadmap, a strong pipeline of opportunities and healthy backlog. As you know, however, our industry and many others around the world faced a number of headwinds, from lingering ship shortages and supply chain issues to currency inflation and recession fears. We continually assess the situations through multiple inputs into in discussions with our customers, IHS data and closely monitoring production levels. With market conditions outside of our influence, we are intently focused on what we can control with the emphasis on innovation, delivering on customer commitments and tightly managing costs. We believe that as the industry returns to growth, the focus on these areas will serve us well over the long-term. In the meantime, we must manage through these challenges and ensure we are positioned for the future. In recent months, the leadership team and I have evaluated all aspects of the business as we built our long-term plan, which weâ\u0080\u0099ll present and discuss with you later this year. But as we discussed last quarter, we have been assessing the right balance of fixed contracts for the business as part of our long-term planning process. Because of these factors and listening to your feedback, Tom and I decided now is the time to take a decisive step to improve the visibility into the strengths of the core business. In order to enhance productibility into our future revenue, we have decided to sign zero fixed contracts in Q4 and starting in fiscal 2023, we will keep the annual contribution of fixed contracts within the historical range of approximately $40 million per year. One, this shift will provide enhanced clarity into our revenue stream. Two, it will provide predictable consistent results that are comparable from period to period and create a visibility into our underlying business. While there will be a transitional period as this change is implemented, we believe longer term it will enhance our earnings growth potential and provide greater visibility and clarity into our strong underlying business. Until then and as we complete our fiscal year and look ahead to fiscal 2023, we are focused on three key areas. First, deliver strong fiscal year bookings; second, deliver excellence in all our product and customer facing programs; third, ensure efficient performance oriented operations and cost structures. And with that, I will now turn the call over to Tom to review the financial results of the quarter and talk more about guidance. Iâ\u0080\u0099ll come back to guidance and fixed contracts in a moment, but first I want to share more on our Q3 results. Q3 revenue came in at $89 million, slightly below the low end of our guidance due to a combination of the absence of expected one-time specialty deals and the strength of the U.S. dollar compared to other currencies. Non-GAAP gross margin was 73.7%, non-GAAP operating margin was 29%, adjusted EBITDA was $28.5 million or 32% margin and non-GAAP earnings per share were $0.43 coming in right at the midpoint of our guidance. During the quarter, cash flow from operations was approximately negative $3.9 million. To provide more detail on our revenue, the core business came in largely as expected. Pro forma royalties were down 3%, while consumption of fixed licenses increased 73% during the same period. This decline was the result of several previously disclosed factors, such as the declining revenue associated with the legacy contract and expiring contracts for older technology. As previously discussed, these expiring contracts create about a $5 million headwind to connected services growth for the full fiscal year. Finally, our professional services revenue was up 36% year-over-year and 9% quarter-over-quarter. On our Q2 conference call, I spoke about how we would be assessing our long-term strategy relative to fixed contracts. Following that analysis and hearing from investors and analyst concerns about the higher level of fixed contracts, as Stefan noted, we made the strategic decision to not do any fixed contract deals in Q4 and strictly limit the amount we will do on an annual basis moving forward. As this will enhance visibility into our core business and revenue, will demonstrate more consistent underlying results and more effectively protect our economics related to these type deals. While there will be a transitional period associated with this strategic shift, this decision will enhance the predictability of our earnings in the long run and be more representative of our strong underlying business. Before reviewing guidance, I want to provide some additional details on our license revenue to help you understand the strength of the underlying business and one led us to our decision regarding fixed contracts. The amount of consumption from fixed contracts and the net license or variable revenue, which is the number we report in our quarterly revenue. Importantly, pro forma royaltyâ\u0080\u0099s revenue remains solid aligning to our strength and customer penetration even with the impact of macroeconomic factors over the last few quarters. You can see the impact from the elevated levels of fixed contracts and the resulting growth in consumption of prior fixed contracts, which supported our decision. As fixed contracts are managed back to more historical levels, we believe that an FYâ\u0080\u009925 new fixed contracts will be approximately equal to the level of consumption. We are confident that we can work with our customers that use this mechanism to reduce their cost and agree to a solution that supports them while at the same time, protecting the long-term growth and margin of the company. Importantly, we do not expect that this shift in contracts will meaningfully impact our customer relationships as demand for our solutions remain strong and this move mainly shifts the timing of revenue recognition. The guidance for Q4 assumes no fixed contracts, slower than expected revenue contribution from adjacent markets, no specialty deals and ongoing currency volatility. Over this transitional period in Q4 and fiscal 2023, our management team will focus on capitalizing on the solid demand for our solutions and generating strong, consistent pro forma royalty license revenue. We are aware of the short term impact of this decision, but firmly believe that this will return the business to more predictable, long-term growth. At our Analyst Day later this year, we will share with you the multi-year plan that will show the positive impact this decision is expected to have on our long-term growth and profitability, along with our plans for the rest of the business. Your line is open. Hey Luke we donâ\u0080\u0099t know exactly whether the $40 million, depending on the discussions and negotiations with the customers, whether they will be minimum commitment deals or, whether they will be pre-paids. Weâ\u0080\u0099ll provide through the reporting that weâ\u0080\u0099ve been doing how that plays out in each year, but the cap will be for the total of both of them. In other words, how much pressure is there going to be to variable license growth near term from the elevated level of fixed contracts that were booked say in fiscal 2023 if we can handicap the mechanical headwind based on what youâ\u0080\u0099ve booked the last few years and what youâ\u0080\u0099ve shown in terms of that headwind in the current year as well. With respect to the consumption of fixed contracts, we do provide the breakout of the fixed contracts that weâ\u0080\u0099ve done to date between pre-paids and minimum commitments. And then weâ\u0080\u0099ve also provided some information around the dynamics of each of those, as we said, the pre-paids are normally six quarters, they have a higher discount rate, they have cash up front. The minimum commitment deals are longer more like four to five years with a much smaller discount and of course, cash as the consumption is used up each quarter. I think the other important thing that I try to put in the commentary was we do believe as we kind of model this out, and it is slightly dependent upon how customers consume those prepaids or minimum commitments that is variable. But we expect that by fiscal 2025, the $40 million of fixed contracts will approximate the consumption of previous fixed contract deals up until that time. So, we go all the way back to fiscal 2020, this company, and I realized there was a different management team, but you spoke about lowering the fixed or managing it to that $40 million. It only went higher, and the answer was always, it was way more difficult to get customers to change. And even last quarter, Stefan, I mean, you said in your prepared remarks, customers prefer these contracts for cost savings. If you really do take this hard line stance, because based on what you said prior, it would seem like this is not exactly what your customers want. So let me go first, and then I will also ask Tom for his view, he knows the business now for many years also from the early days at Nuance. I think based on the headwinds we are seeing, right, also with currency weakness here, especially when looking at Asia-Pacificâ\u0080\u0099s, right. Our partners and customers, they have really high requests for discounts here. And personally, I was involved with two of them right, already at the end of Q3 or beginning of Q3 and also now. We still have a great relationship with those customers, but I think we need to make this decision now, right. And I mean, thatâ\u0080\u0099s the right step for Cerence and especially also for our long term planning. Driving new products, showing them delivery excellence and product excellence, right and this is a key focus of our team or Cerence now. And so Stefan and I based on his personal experience with some of these customers, we also spent some time with Head of Sales who drives these and heâ\u0080\u0099s been with us for many years, and understands the customize dynamics. And just to point out, as weâ\u0080\u0099ve always said, this is a certain group of customers. We all came to a consensus that the approximately $40 million level, we would be able to balance both the customer relationships, the customer satisfaction, the deal economics on a go forward basis. May maybe to follow up on that, it sounds like, maybe a little bit more color on how you got comfortable with this $40 million level, whether thatâ\u0080\u0099s customer directed or  I mean, my understanding and correct me if Iâ\u0080\u0099m wrong is, but if, youâ\u0080\u0099ve said in the past you get about call it $4 a vehicle. Well again, it depends on the customer and the mix thatâ\u0080\u0099s associated with either a prepay or a minimum commitment. But yes, I mean, weâ\u0080\u0099re still would be getting about $40 million a year. But again, that number we spent a lot of time trying to understand that right level on a go forward basis. And as I said by FY 2025, theyâ\u0080\u0099ll kind of balance out the amount of fixed contracts and the consumption level against those contracts. We needed to provide our sales team and our customers with some flexibility to continue contracting this way, which as I said is, weâ\u0080\u0099ve been doing this since I joined Nuance in 2008. And again, some of this was impacted by the macroeconomic factors in the last couple of years in the auto industry, and people and customers just getting more of â\u0080\u0093 more into trying to drive their cost structure down as they had volume issues in production, which as you know, a lot of these customers as very strong procurement teams, but weâ\u0080\u0099re really confident that we can manage it to that level. And weâ\u0080\u0099ve managed to this level historically when the business was part of Nuance, and we did see the zip uptick during these macroeconomic times, then we think kind of going what we looked at this quarter and then going into 2023, we believe we can manage to that level. Your line is open. Because you have the historical contracts that weâ\u0080\u0099ve done, fixed contracts that weâ\u0080\u0099ve done. Now, Stefan was talking specifically about fixed price contracts and remember these are associated with our technology, thatâ\u0080\u0099s already in production with our customers. And so these ideals that are in process and what they do is then they come back to us and say, Hey, we have cost pressures that we need to deal with. And so weâ\u0080\u0099d like to prepay or do a minimum commitment to get a slightly larger discount against, what weâ\u0080\u0099re paying on a running royalty basis. And what we saw particularly in Q3 was a lot of these contracts are in USD, and with the strength of the U.S. dollar those customers are trying to assess what the currency impact is on them. And so therefore they come back and they say, well, I need a higher discount to protect the uncertainty around the currency. I mean, we run ROIs on all of these deals, because youâ\u0080\u0099re pulling the revenue in, but it also has cash flow implications because on the prepaid, you get the cash much earlier. So, I think indeed also in Q3, we had a strong quarter, we got in various nomination letters across the globe. We one also marquee North American OEM for our EBD solution, right. We see a continuous section here for trucks, EV makers here; we signed another one also for RV â\u0080\u0093 in the RV space. So we are doing pretty, pretty well in the core business here, right. And I think all the customers, the OEMs, they really acknowledge our superiority in terms of accuracy, latency also bring in new innovation use cases much, much faster in the past, right. When looking at connected services right, so I mean, thereâ\u0080\u0099s always a topic of renewal here, but also here we signed a big contract in terms of statement of work for professional services for upgrading cloud for an expansion with one of the big OEMs. Your line is open. Just going through the guidance for Q4 revenue, this quarter was $89 million. So if I donâ\u0080\u0099t do any fixed contracts  $66 million, production supposed to actually recover sequentially. And of course thereâ\u0080\u0099s an FX impact that has got a bigger impact slightly towards the end of last quarter, but certainly in Q4. And then as I said, we havenâ\u0080\u0099t included any one-time deals in the guidance for Q4. No, but thereâ\u0080\u0099s a drag effect of all the fixed contracts that youâ\u0080\u0099ve done previously. As weâ\u0080\u0099re thinking about going into 2023, youâ\u0080\u0099ve done I think $69 million a fixed year-to-date. I mean, how should we think about the drag into next year because Iâ\u0080\u0099m kind of trying to figure out this consumption of additional drag. Not specifically, as I said with the additional disclosure that we did this quarter, you should be able to make some assumptions and model out the pro forma royalties. The consumption utilizing the fixed contracts and the disclosure around pre-paids and minimum commitment deals, and then as I said, this kind of guidepost that says by 2025 theyâ\u0080\u0099re about â\u0080\u0093 theyâ\u0080\u0099re about equal. And just lastly, if I go to Slide 10, if I look at pro former royalties that you provided, I mean, year-to-date, youâ\u0080\u0099re down like 13%, light vehicle production down 5%, and I thought you were gaining market share. So quarter-on-quarter itâ\u0080\u0099s â\u0080\u0093 it can vary slightly, but I think if you look at kind of our pro forma royalties against IHS production you see that itâ\u0080\u0099s a pretty consistent and in some cases a growing number. And also in my discussions with some of the OEMs, itâ\u0080\u0099s clear that theyâ\u0080\u0099re also producing and delivering cars. Your line is open. Well, first of all, we havenâ\u0080\u0099t, I mean, no, may look at our earnings call today, but this is a internal company policy. And as Stefan alluded to, weâ\u0080\u0099re in a position where weâ\u0080\u0099re not going to do any in Q4, again, because of some of the currency and other factors that are â\u0080\u0093 do any in Q4 again, because of some of the currency and other factors that are causing customers to ask for discounts and concessions that we just canâ\u0080\u0099t accept. And as Stefan pointed out we have very, very strong relationships that go back many years with these customers and they understand business economics and business conditions. And as weâ\u0080\u0099ve always said, these are a discussion and a negotiation between the customers and severance. I just didnâ\u0080\u0099t know if there was kind ofâ\u0080¦\n So with this one customer â\u0080\u0093 so with one specific customer we had already various discussion about this topic, right, and then finally they accepted our view. So there are a couple of aspects to consider, right, so first of all right, we have now a razor sharp focus on our core business, yes. And at CES in January we have showed for the first time our new so-called one-assistant with one-cloud and underlying one-sec, yes. It was shown to the senior management up to Board Members and the CEO, and theyâ\u0080\u0099re really excited about this performance, and yes, couple of days ago we got them the official nomination letter. Your line is open. Switching gears a little bit on Slide 9, you mentioned that connected services declined in the quarter, given declining legacy contract renewals, revenue and expiring contracts. As weâ\u0080\u0099ve said, weâ\u0080\u0099re one of the biggest drivers is the Toyota legacy deal and weâ\u0080\u0099ve shown you thatâ\u0080\u0099s very â\u0080\u0093 itâ\u0080\u0099s just an amortization schedule. And weâ\u0080\u0099ve talked about these older contracts based on older technologies, that are kind of winding down. Clearly the other thing thatâ\u0080\u0099s happened is during the pandemic and with slower production units, weâ\u0080\u0099ve lost a bit of the, the size of the, of the curve of the amortization schedule of connected services. So, on a go forward basis, we see strengths in our connected revenues. As I also mentioned during last earnings call, I say 40% of our backlog is for connected services. And as Tom already alluded to right, most of the deals we have signed recently have this hybrid component, meaning edge plus connected services. Also here, I mean, already did this recently we started with an exercise here also internally we call it convergence, right. As said, itâ\u0080\u0099s so called one assistant, one cloud and one core technologies. And that will also increase productivity and also reduce cost in general, especially when it comes to the one cloud solution. We are driving two projects here in Q4, one we kind of code names, eye-to-eye innovation to implementation. And thatâ\u0080\u0099s looking at our R&D resources, our professional services resources, and product management playing upon what Stefan just said around some of the technology convergence that we have. Itâ\u0080\u0099s also aligned to a strategy exercise we did, which was just completed. And we will have an implementation plan for FY 2023 going forward, and they will certainly advise our operating plans, our budgets and our multi-year plan going forward. Your line is open. So on the quarter, weâ\u0080\u0099re looking like $43.5 million give or take below consensus for Q3. We donâ\u0080\u0099t specifically guide by line of revenue, but as we talked about itâ\u0080\u0099s the zero fixed contracts. Weâ\u0080\u0099ve got a lot of wins, but weâ\u0080\u0099re seeing a slower bookings to revenue conversion for some of our adjacent markets in a couple of areas. So, I think we see a lot of traction, for example, for EVD, emergency vehicle detection, right. I mean, we just mentioned also in the openings that the first three customers of our new terms cloud services solution are Chinese OEMs, right. And also a very tight innovation roadmap, right. We brought in house in our new cloud safety aspects, for example, tracking the driver behavior, right. These are new things we have added to the new cloud, and we have also signed a contract in this area last quarter. One last, if I could, the other, license revenue slash, I donâ\u0080\u0099t know, specialty deals I think you had a big one in the September quarter, in December quarter. And then if I recall, I thought in the March quarter on the reset of guidance, you de-risked it and said, these are too unpredictable, and weâ\u0080\u0099re taking them out just to be clear. Yes, that was below a few million dollars, I think of some deals that, we thought we had an opportunity."
}