{
    "symbol": "OKTA",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-02 20:07:06",
    "content": " And so ultimately, that's why you see that a little bit of a dip in free cash flow margin in FY -- in Q2, just like we've seen in prior years, prior to COVID. I think there's no real finish line when it comes to integrations, but I think we're really focused on addressing this massive customer identity access management market in a way that, frankly, no other vendor can in terms of independence and neutrality, we have the only 2 modern public cloud solutions and certainly no in-house IT can. They're really longer-term plays, and they're very important in the longer term because we're building this primary cloud for identity and what the market wants, what the buyers want, what the customers want is they want one integrated access management platform that will do access management across all the resources, apps, on-premise apps, cloud apps, servers, privileged accounts and also do the governance reporting an attestation that access -- on those -- on that access management. And the conversations after some initial communication and feedback became very strategic along the lines of we're counting on you to be the backbone of our entire technological infrastructure, things like this, with very senior people, both on the -- traditionally where we've been really strong, having conversations on the IT side and on the security side, we've got into new areas like executive management, Board-level conversations risk and compliance and areas that traditionally we haven't talked to as much. And like I said, we're going to continue to push more towards current RPO, like I said earlier in the call, we're definitely going to get off of billings in FY '24 and really just focus on current RPO because ultimately, we feel it is a better metric for all of us to discuss because of the higher correlation and just a better metric to understand how the health of our business is going. It's going to help establish this concept and this idea that identity is one of these primary cost in enterprises and we're going to talk to every CIO and every CEO and every Board of Directors in a few years, once we are successful and they're going to agree that identity is a critical investment area and Okta has the #1 leading identity platform across all these dimensions. And so I would say that a majority of the market doesn't have a solution and what it's going to take to get that -- to get those customers to be buyers is to build a great product, and that's what we're focused on. First of all, we've talked about for a while that part of our big strategic plan, there's a few of them that we're focused on right now for this year and going into next year on customer identity management, around international, we're already in a lot of the places we need to be. And I think the world has -- more and more of the world is understanding how important identity is and how critical it is to all the things we talked about from technology adoption, security, customer management and customer success, and it's really accelerating or it's benefiting from all these accelerated trends. We think our strategy to be the neutral player and to connect everything into have the best solutions across all of the identity use cases, whether it's workforce, governance, privileged access, customer identity access management, whether you're developer-centric, whether you're IT-centric, we have the best platform, and that's what we're focused on building. I mean we're, again, very happy with revenue growth at 65% year-over-year to a $415 million quarter and the incremental fiscal year guidance to $1.8 billion plus for the year, but these are massive markets that are going to have durable growth for the next 3, 5, 10 years."
}