{
    "symbol": "OKTA",
    "quarter": 2,
    "year": 2023,
    "date": "2022-08-31 18:45:04",
    "content": " First, after 13 plus intense years building Okta together, my Co-Founder and partner, Freddie Kerrest, is going to be taking a much deserved 12-month operating sabbatical, beginning November 1st to spend time with his family, recharge his batteries and think about what's next for Okta. So that's the high level of motivation for doing the acquisition and if you take it back to the tactics, combining the sales teams together reaching those buyers, we're super bullish and confident on the long-term strategic implication of providing this unified identity platform for all of these buyers in all of these use cases. It's -- think about it like it's -- you're giving access to partners or maybe a mix of partners or customers to your instance of e-mail or to your instance of salesforce to your SaaS app off the shelf, that's really where Okta SIEM was and it wasn't -- there wasn't a bright line in that spectrum where on the left side, it was all Okta SIEM and on the right side, it's all Auth0 they were kind of blended along those that spectrum. But it's really a clarification in terms of -- there's no -- a bunch of sales reps aren't going to spend time interpreting where in the middle of the spectrum there, we've taken that metal, we've clarified it and said, this is SIEM, this is Workforce, hundreds and hundreds of reps go get to market. If you think about what we're trying to do here with the Customer Identity Cloud and the Workforce Identity Cloud, it's about simplification. We've talked about some of them on this earnings call, Fifth Third Bancorp, Eventbrite, DICK'S Sporting Goods, News Corp, plenty of organizations that see the value of Okta Workforce and want to also Auth0 and then finally, we have a very good example just this quarter of Vialto Partners, which is a big spin-out of PwC, it's their global mobility services provider. They actually bought -- it's a new workforce customer and a new Auth0 customer, conveniently, they also bought IGA, which we're happy to talk about. And so as we reevaluate in the short-term, how to keep that momentum going, I think it's prudent to make sure that we reevaluate that target given the short-term changes that we're optimizing for the customer at a cloud. It's just about the integration of the sales teams and what that drove in terms of attrition, and some of the things we've talked about in terms of optimizing how we get that back on track to achieve this strategic imperative, which is we have to be the winner and the opportunity is tremendous in this long-term customer identity market. It's in the customer identity cloud and the buyer is the -- one of these people I'm talking about the VP of Technology, the CTO, the Chief Digital Officer, and that's Auth0. But it is very important to -- for us to really make this great because if you look at our past success, it's all been because of this really solid team that's fired up and working towards a common goal, and I think we can do a little bit better getting back to that. And I want to try to understand your broader comments there, and I'll break it into two pieces; A, on the workforce side, we had the opportunity to attend Gartner's Identity conference last week, and there was certainly a lot of discussion from both presenters and attendees that Microsoft is getting much more competitive here, whether it's causing Okta to change prices or actually losing share. And I think that's important, because the competitive environment, and I mentioned this before, first of all, we spent a lot of this call talking about this strategic market of customer identity, and it's a very, very important market for us, not because workforce is going away or drying up, not at all. You need everyone on your C-suite to be bought into these use cases and from Digital Officer and Marketing Officer and Technical Officer and CIO and we're going to build that vendor, and that's how we win long-term. So I think there's -- I think you're going to -- I think the industry is going to see that first of all, IGA is much bigger than we think it is because the solutions have been constraining the size of the pie. And that's why you see this outlining of this very â\u0080\u0093 we want to build this primary cloud for every organization in the world that addresses all of these identity use cases and raises identity at this level, that's how we're going to free them to safely use any technology and that's big and bold. Are these customer identity deals that Auth0 closes, they're big, and they need a sales team, but they all start from a developer trial or self-service, and I think on the -- over time the broader hundreds and hundreds of Okta sellers will get more and more effective at taking these deals and these self-service trials and really turning them into massive enterprise deals. So I don't think I would read too much into anything with Todd's what you're saying about people trading out of RMB like Todd said, that is actually one of the lowest attrition areas we have in the organization. They're going to -- it's going to be clear that whether it's customer identity cloud or workforce identity cloud that we all work together, and it's the best for them."
}