{
    "symbol": "OKTA",
    "quarter": 3,
    "year": 2023,
    "date": "2022-11-30 21:45:26",
    "content": " So, let's fast forward today, 90 days later, how have those things progressed because that's influencing us how we're thinking about the macro -- or the overall guidance for next year. And it translated into -- it's not just the impression from a conference, it translated into the really quantifiable metrics like the number of sales rapes that have actually done a Customer Identity Cloud deal is increasing the last three quarter sequentially, which is a really good sign. One of the key things -- we're still -- like I said, we're still early in our planning process, but one of the key goals we're talking about next year is around automation, around improving the productivity of not just the field but like my team, the R&D team, how do we make everyone a little bit more productive, and that's one of the ways we see the margins improving over time. It's -- we see the -- like I mentioned earlier, just kind of repeating myself here, that it's -- the conversations are a little bit -- there's like a different story for every customer in terms of -- some customers, particularly in the SMB segment are delaying purchases or reevaluating things. So, it's -- it all adds up to validating the long-term trends we know that have been powering our success for a long time, and we'll continue over the long term as well, but there's just a lot of uncertainty in terms of how it plays out in the details and the timing of the progress over the next several quarters. We're also very excited about the progress of our PAM product we announced at Okta, and that's going to be an early access just in a couple quarters, so in Q2 of â\u0080\u009824, which is six months from now or so, and then generally available by the end of next year. It's been taking longer than we thought, as we've talked about, but we're very confident in the dates we've delivered and also confident -- really optimistic about the early feedback we've had from the customers we have spoken with about it. And frankly, an area where with the workforce business, if you talk to a big global SI, the cloud modern workforce identity business, a lot of times is -- it's kind of too easy. One thing that is I think when you look at the income statement and expenses on R&D, one part of our strategy is really critical is that Workforce Identity Cloud, Customer Identity Cloud, we strongly believe that these are both important markets that -- to own the -- and provide value across an entire identity platform. I would just add that -- I mean, that's one of those things you've heard me talk about, Adam when we were talking about the guidance of being -- hey, one quarter, we really improved on a variety of things but we're being cautious about the future because one quarter doesn't make a trend. We just -- we know that the SMB segment of our business was less than we would have liked this past quarter and balance with a lot of other things, the whole -- overall mix of the entire book of business being more upsell focused than usual lead us to strongly believe that that's macro related, both just anecdotally in the conversations, but -- plus when we look at it quantitatively in the statistics across the whole business. So yes, I mean, the government needs identity just like every organization, every opportunity -- or every sector needs identity, and that's a big area of focus for us, and we're glad to see some progress."
}