{
    "symbol": "SOTK",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-13 14:44:04",
    "content": " After today's presentation, there will be an opportunity to ask questions. If you don't have a copy of the release, please go to the company's Web site at sono-tek.com and click on the press release/news tab in the Investors section. The product, market and geography sales tables on the last page of the release will be part of today's discussion. With me on the call today are Chris Coccio, Sono-Tek's Chairman and CEO; Steve Harshbarger, President and COO; and Steve Bagley, Chief Financial Officer. Please note the various remarks that may be made on this conference call about future expectations, plans and prospects for the company constitute forward-looking statements for the purposes of Safe Harbor provisions under the Private Securities Litigation Reform Act of 1995. Actual results may vary materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the company's filings with the SEC. For now, we're planning to hold two earnings calls for fiscal year; at midyear like today and for our year-end results. Today, we're going to discuss our results that were released earlier this morning for the second quarter of fiscal 2022 ended August 31, 2021. Steve Harshbarger, President and COO, will then go through the business and operational results and the sales growth guidance. We focused on important high tech markets that require the disability such as semiconductor manufacturing, electronic devices, medical devices, fuel and solar cells, and industrial process tools such as glass line,  and food coatings. We expect to finish the year with double digit sales growth and income  in our history, and there is a lot of upside and opportunity for growth in our focus markets of semiconductor, medical and clean energy. For the second quarter of fiscal 2022, net sales were 4.1 million, up 17% or $590,000 from the second quarter of last year. During the quarter, approximately 62% of sales originated outside of the U.S. and Canada compared with 38% in the prior year period. The gross profit margin was 51% compared with 46.6% for the prior year period, an improvement of 440 basis points. Diluted weighted average shares outstanding slightly increased to 15,602,000 compared to 15,533,000 for the prior year quarter. Cash and cash equivalents and short-term investments at August 31, 2021 were 9.7 million, an increase of 1.1 million when compared to our fiscal year end February 28, 2021. Second quarter CapEx was 147,000 for ongoing upgrades of the company's manufacturing facilities. I'll now turn the call over to Steve Harshbarger, President and COO, for a second quarter operational review. If you look at our Q2 earnings release that was put out this morning, you'll see in the short tables on the last page that we break down our sales in three ways; by markets, products, geography, and that's how I'm going to talk about them this morning. Fiscal second quarter net sales were 4,070,000, which is up 17% or nearly 600,000, and that's in comparison to the second quarter of last year. By product line, the second quarter sales increase was primarily driven by a significant shipment of multi-axis coating systems. Our OEM sales were up 613,000 or 264%, and this was due to strong sales from our OEM semiconductor partners and as well as our OEM PCB fluxing partners. Looking at the market segments, sales to the electronics market increased by 79% in Q2. This was primarily driven by strong sales to China for our OEM systems used in the semiconductor market, as well as those systems that I just mentioned to quote the electronic diagnostic devices for rapid COVID test kits. We continue to see growing investments in the clean energy sector from both government as well as private industry that are driving demand for our machines used for coating membranes and fuel cells, as well as carbon capture applications. By geography, approximately 62% of our sales originated outside of the U.S. and Canada compared with 38% in last year’s second quarter. These strong overseas sales were primarily driven from APAC and that was led by China, which reflects the transition to several countries as well as companies emerging from COVID-19 lockdowns and bringing the manufacturing operations really back online. Shipments to China during the second quarter included strong sales for our stent coating machines, the delivery of a newly developed specialty medical device coding system, and another follow-on strong quarter for our OEM semiconductor customers. Looking at APAC outside of China, sales included a new machine that shipped to Singapore for EMI coating, electromagnetic emission coating and which is an area we've spoken about several times as part of our focus growth initiatives. Sales to the U.S. and Canada did dip year-over-year, and this is primarily due to the shipment of a large float glass coating line in last year's Q2, which we didn't repeat in Q2 of this year. Throughout the COVID pandemic, Sono-Tek's really been adapting and refocusing our sales efforts to those countries that are most operational during these COVID-19 peaks and dips. This strategy has been really helpful to us in softening the impact of the pandemic on our operations, and we expect the sales packet  to be part of Sono-Tek's go-to-market strategy for the foreseeable future here. Backlog reached a company high record of 6,332,000 at the end of our second quarter. This is an increase of 45% from the end of the first quarter, an increase of 64% compared to the end of fiscal 2021 six months ago. Our network of labs located at Sono-Tek distributor sites around the globe and our home base here in New York, of course, are staffed with highly experienced application engineers that work together with our customers to develop solutions for their next generation accorded products. And we're excited about our opportunities for growth in our focus markets of semiconductor, medical and clean energy. Looking ahead, the sales growth guidance for the back half of our fiscal year is for double digit increases over the comparable periods of last year for both the third as well as the fourth quarters. And for the fiscal year, which will be ending now February 28, 2022, Sono-Tek is expecting double digit year-over-year growth, which will be our highest annual sales in corporate history. If I recall last quarter, there was one large system, 1.5 million in there. Right now we anticipate that unit to be going out in our Q4 of this year is when that's planned to be shipping out, so another five months -- four or five months from now. The backlog other than that, a good chunk of it is going to be shipping this fiscal year. We do anticipate that's probably 1 million to 1.5 million that's in that backlog that will be heading out in next fiscal year though also which is typical because some of these larger platform machines now that we offer which are high value and high dollars, they have a longer time to build them and ship them. It's pretty exciting for us to see this acceleration, and so many of our growth initiatives really starting to come through for us and to show promise. This past quarter, obviously, our margins were a bit higher than typical for us. Heading forward, I think we'll probably long term be getting back down into our normal operating range for margins, which is going to be the high 40s. However, in the short term, we are still seeing a lot of these OEM customers in particular coming out of Asia often to support the semiconductor industry. There's that chip shortage that's happening and it's impacting everybody, not just us here in the U.S. So we're seeing a lot of our Asia customers, the OEMs, in particular, buying a lot of our smaller OEM kits, which have nice profit margins on them. One last one; the alternative energy, you've had some let's say onesie-twosie business kind of going into fuel cells, and then you've talked about CO2 capture. The area where Sono-Tek is really focused and where our markets that our product serve is for coating membranes, they call it the PEM membrane and fuel cells or the membranes on CO2 carbon capture applications, and this is an application that on either marketplace, they're very, very similar. And it's because the technology is very, very similar. And so for us to transition from an area that we really knew well, we’re awesome at coding fuel cell membranes was very simple for us to go over to carbon capture membranes. And our customer bases, they knew us already as well because many of them came again from fuel cells. So what we're seeing now is some of these customers as they start to increase their volumes, they are changing over from doing low to mid volume manufacturing over to higher volume manufacturing. If you were to ask the same question a couple of years ago, we'd say, well, no one's doing roll to roll because no one's making any volume of these. Well, now they're starting to really plan to do roll to roll and starting to do higher volumes. So we engaged an outside partner, which comes from this industry and has a great deal of experience with roll to roll technology for the creation of these membranes. Well, our latest expansion, which was now completed last year, should allow us to easily go over $20 million in sales within our existing buildings likely up to 23 million, 24 million possibly. And we're just taking those over one at a time, and that's been what we've been doing. Yes, it's a good question, because I'll tell you a new employee recruits are hard to get in the present work environment. The best methods that we've really seen are word of mouth from fellow employees and our really strong internship program, which we've developed over the years. And our technology is, just as you mentioned, it's so unique that it really takes one, two, three years before someone is really fully effective to contribute in a very significant way. Looks like you've been hiring the right people because they're turning out the numbers, and that's what counts for us."
}