{
    "symbol": "NOAH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 06:30:25",
    "content": " Wealth management segment reported annual net revenues are up RMB2.2 billion, down 31.1% year-over-year, primarily due to clients leaning towards -- leaning more towards products with higher liquidity such as money market funds and fixed income -- fixed term deposits, leading to a decline in one-time commissions. On the other hand, the overseas AUM reached RMB32.5 billion, up 14.7% year-over-year, thanks to the successful fundraisings of Gopher's actively managed overseas real estate and private equity funds, as well as the launch of our US dollar cash management and fixed income products. As a result, although 2022 was a top year, we still achieve the increase in number of core clients up 18% year-over-year, that's Diamond and Black Card client and overseas AUM also increased by 15% year-over-year; due to stricter cost management measures and higher operational efficiency, Noah's operating margin grew from 27.9% to 35.1%. One time commissions fell by 46% year-over-year to RMB678 million, due to lower transaction values and the change in product mix, partially as a result of our proactive direction away from public security-based products, in the face of volatile market conditions last year, that usually bear high take rates for that type of product. Supported by a healthy balance sheet and continuous strong cash flow generating capabilities, pursuant to the dividend policy announced on August 10, 2022, the annual dividends to be declared and distributed for year 2022 will be 17.5% of the group's non-GAAP net income of 2022, approximately amounting to RMB176.5 million implicating US dollar $0.40 per ADS and Hong Kong dollars $6.25 per share equals to USD280, subject to final approval of our AGM on June 12, 2023 this year. We have a team about 40 people focused on the macro and also micro researchers on different kind of stocks and strategies for multiple strategy sort of fund and for overseas, we are investing heavily both in budget and talents actually for 2023 to make sure that we'll be able to meet the demand for our clients especially for the oversee allocation of more products towards public market type of products that in the past the market probably provides a lot of volume, but we weren't able to provide too much on the US dollar denominated public markets."
}