{
    "symbol": "NOAH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 00:35:19",
    "content": " In the first quarter of 2022, we suggested Noah's clients to re-examine the asset allocation of themselves and their families, actively rebalance the asset allocation and make the family asset allocation safer and more effective from the perspective of protection over growth. Focusing on the protective strategy and early primary market funds, the net income of the overseas sector was RMB190 million down 44% year-on-year and 2.3% quarter-on-quarter, accounting for 24% of the group's total revenues. In the first quarter of 2021 and the first quarter of 2022, Noah's core view is to reduce the secondary market product allocation and launch, increase the allocation of protective assets and support the health inspection of client's family asset portfolios. The emergence of negative volatility has started to pressure the equity market since the second half of last year, translating into softened investment investor sentiment, evidenced by a decline of 74% year-over-year and 57% quarter-over-quarter decreasing new issuance of mutual funds during the first quarter of 2022. Nevertheless, Noah has managed to weather through these challenges with a client-centric mindset, continuing to enlarge our black card and diamond card client group, made noticeable progress in our client segmentation strategy and also achieved 8% quarter-over-quarter increase in non-definite income with discipline OpEx management, while remaining committed to essential investments in client and market strategic initiatives. Reason being is that we're actually seeing a gap in that service that majority of our clients, probably 60%, 70% of our clients are entrepreneurs and they have their own enterprises, which is they either lack experience to work with more market oriented sort of treasurer management or money market type of funds or they actually didn't have enough research ability to actually navigate through the mutual fund market."
}