{
    "symbol": "NOAH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-21 22:00:28",
    "content": " As of September 30, 2022, growth of AUM was RMB156.2 billion, an increase of 0.5% over the end of the second quarter, among which private equity increased to RMB132.8 billion, public securities were affected by the fluctuation of NAV falling from RMB10.7 billion in the previous quarter to RMB10.2 billion. As a result of the challenging market environment dampened investment sentiment, total transaction value decreased to RMB18 billion, down 25.3% year-over-year and 7% quarter-over-quarter. Noticeably, the transaction value of private secondary products saw a significant increase of 38.9% quarter-over-quarter to RMB3.3 billion, representing a short rebound, but still down 68.5% year-over-year. And the total number of active clients for the quarter was 22,641, a 6.5% increase year-over-year and a 76% increase quarter-over-quarter, benefiting from continued strategic investments in our core client group, diamond and black card clients grew to $9,782, up 14.3% quarter-over-quarter and 21.6% year-over-year, among which the number of black card clients and dial-in card clients increased by, respectively, 39% and 17% year-over-year, thanks to the operational enhancements of a more targeted client segmentation strategy program and resumed client events. Income from operations for the quarter was RMB231.8 million, a 1.3% growth year-over-year due to our tightened expense control policy, but a 28.3% decrease quarter-over-quarter due to a 7.3% decrease in net revenue, and also 8% increase in operating costs and expenses as less expenses were incurred in the second quarter of 2022 due to the unprecedented COVID lockdown in Shanghai. Performance-based income grew to RMB27.6 million, up 6.8% quarter-over-quarter but down 66.4% year-over-year, while net revenues from other service fees continued to grow to RMB67.3 million, a 50% increase year-over-year, and a 45% increase quarter-over-quarter, mainly due to more value-added services, Noah offers to our high net worth clients. As for segmented results, net revenues from the Wealth Management segment were RMB465.9 million, down 28.7% year-over-year and 8.4% quarter-over-quarter due to a decrease in transaction value during the quarter."
}