{
    "symbol": "OXY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 16:10:05",
    "content": " I think what we've indicated in the notes was that as we complete the $5 billion and the $3 billion this year and then apply the balance of any additional cash to the balance sheet, driving that gross debt down into the high teens, that we would anticipate translating the debt reductions being the priority and more attack the debt on a -- as it comes to basis. And we do have cash available beyond that, which the current pricing environment would certainly suggest we would have cash well above those 2 pieces of $8 billion between those programs, we would resume applying that back to the balance sheet in the process for the balance of the year. If you go back into last year, it was really -- I think we talked about on the last call, a lot of transition from DUCs in the Rockies, which carried a lot of production into what I would consider a much more steady state drilling and completion cadence really in the second quarter of this year and to the back half of the next year. And so when we think about really the second quarter, we hit this -- add a couple of rigs, as you mentioned, in the Permian, to hit the 16 and really 18 overall, our net rigs, really not a big change because our net rigs stay about the same with the drop of the Rockies in the back half of the year. I think we've got flexibility in the back half of the year, as Vicki said, to adjust activities and really hit what is the right capital and development program for next year to hit really what the plan needs to be given the macro conditions and what we're trying to do as a company. So the preferred -- so obviously, the preferred -- if you look at the $3 billion of share repurchases and add into that the dividend at $0.13 as those are flat for the course of 4 consecutive quarters or 3 consecutive quarters, et cetera, you're still not going to quite be at the level of triggering the $4 per share Berkshire trigger. And so sitting here today in May, that 8 months away from January of 2023, we're not in a position to forecast where our cash flow is going to be in the first quarter or but if we can accomplish these goals, it puts us in a position where you try to the optionality, similar the optionality Richard described and discussed, production exiting the year of being able to be in a position where through additional shareholder returns, we would trigger Berkshire and begin reducing the principal of the Berkshire in the process of doing that. And so we would estimate year-to-date operating rates through March, these lag a bit, but were reported by industry at 81.6% year-to-date, which is not as high as you might think it might be, but there's been a lot of controls in that due to the outages that occurred during the industry during the first quarter, which is pretty typical. And the longer that supply/demand balance remains tight on the 2 sides of the business, the higher we're going to go towards the high end of that guidance, and we'll potentially revise that guidance at some point midyear, obviously, once we see on the second quarter turns out."
}