{
    "symbol": "OXY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 16:56:07",
    "content": " Once we have completed the $3 billion share repurchase program and reduced our debt to the high teens, we intend to continue returning capital to shareholders in 2023 through a common dividend that is sustainable at $40 WTI as well as through an active share repurchase program. Higher production in the second half of the year has always been an expected outcome of our 2022 plan, in part due to ramp-up activities and scheduled turnarounds in the first quarter. We are raising our full-year domestic operating expense guidance to $8.50 per BOE, which accounts for higher than expected labor and energy costs, primarily in the Permian, as well as continued upward pricing pressure on our WTI index CO2 purchase contracts in the EOR business. OxyChem continues to perform well, and we have raised our full-year guidance to reflect the exceptional second quarter performance as well as a slightly better than previously expected second half of the year. As Vicki mentioned, year-to-date, we repaid approximately $8.1 billion of debt, including $4.8 billion in the second quarter, exceeding our near-term goals for paying $5 billion in principal this year. But because of that, macro trends and our normal seasonal declines you would see in the fourth quarter in the business, we are projecting a softer second half of the year onto the first half of the year. So we expect this year to be able to lower our debt based on what we see from the macro by another $2 billion to $2.5 billion, which would get us close to $18 billion. And so certainly based on what Vicki just said and the fact for target, we should be able to do well beyond $1.9 billion left we have for the balance of the year on the share repurchase program, assuming the macro is consistent or relative to the strip prices right now. I think we would be comfortable with something closer to 1.5 by the end of this year, providing another certainly $1 billion of cash to work with this year just from the reduction on reserves."
}