{
    "symbol": "MXL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 19:40:23",
    "content": " Our comments today include forward-looking statements within the meaning of applicable securities laws, including statements relating to our guidance for the third quarter 2022 revenue, revenue growth expectations in our principal target markets and GAAP and non-GAAP gross margin, operating expenses, effective tax rate and interest and other expense. These forward-looking statements involve substantial risks and uncertainties, including risks arising from current geopolitical concern, competition, supply constraints facing the semiconductor industry, global trade and export restrictions, the impact of COVID-19 pandemic, our dependence on a limited number of customers, average selling price trends and risks that our markets and growth opportunities may not develop as we currently expect, and that our assumptions concerning these opportunities may prove incorrect. We are excited and confident in our ability to drive meaningful multiyear growth and market share expansion in the fiber gateway end market owing to: one, the ongoing and existing CapEx commitments from the carriers and governmental incentives for fiber upgrades; two, our industry-leading integrated PON and 10-gigabit fiber processor gateway SoC; and three, our significant fiber platform below material content and the breadth of it. Broadband revenue in Q2 was in line with our outlook at $139 million, up 3% versus Q1 and 23% higher year-over-year, driven by solid demand across our full portfolio of gateway solutions, including cable, fiber, hybrid DSL and fixed wireless access. Our infrastructure end market had a solid Q2 with revenue of $36 million, up 8% versus the prior quarter and up 22% year-over-year, largely driven by strength in wireless backhaul and high-performance analog. Please proceed with your question. And there, the challenge is that we're going to compete purely based on a pipe, but we're also bringing significant BOM on the platform to that market as well because where there is Wi-Fi, there is also Ethernet and there's also power management, and we're building a significant power portfolio that we don't normally talk about in this call because it's a part of the full BOM expansion. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}