{
    "symbol": "MXL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 22:30:02",
    "content": " Our comments today include forward-looking statements within the meaning of applicable securities laws including statements relating to our guidance for the fourth quarter of 2022, revenue, revenue growth expectations in our principal target markets, and GAAP and non-GAAP gross margin, operating expenses, effective tax rate, and interest and other expenses. These forward-looking statements involve substantial risks and uncertainties including risks arising from the current geopolitical concerns, competition, supply constraints facing the semiconductor industry, global trade and export restrictions, the impact of COVID-19 pandemic are dependent on a limited number of customers, average selling price trends, and the risks that our markets and growth opportunities may not develop as we currently expect and that our assumptions concerning these opportunities may prove incorrect. We continue to see exciting near and long-term growth drivers a fiber access gateway Wi-Fi connectivity, wireless and optical infrastructure, and industrial applications, which will allow us to outperform our end markets via share gains and increased silicon content in customer platforms. Moving to the rapidly growing high-speed optical data center interconnect market, we have a leading strategic position with our Keystone family of products, which is the industry's only 5-nanometer CMOS, 400-gigabit and 800-gigabit PAM4 production-ready silicon based on the anticipated trajectory of growth in hyperscale cloud data and processing requirements and our ongoing success with product qualifications at multiple OEMs, we feel confident in our ability to strongly grow our data center revenues in the next upgrade cycle. It's still relatively small in the whole scheme of things, but we do see a lot of growth, especially going into 2023, where we think we have the potential to double the fiber revenues or fiber-related revenues next year over 2022."
}