{
    "symbol": "MKC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-29 12:37:07",
    "content": " Broadly, our results in the second quarter were in line with our sales and profit expectations despite certain global challenges, including a greater-than-expected level of high cost inflation and supply chain challenges, significant disruption in China from COVID-related lockdowns and the conflict in Ukraine. We expect our pricing actions and other levers to begin to outpace cost pressures late in the third quarter, with higher cost and higher offsetting pricing actions than we expected on our last call, which further weights our 2022 profit to the second half of the year. Sales declined 1% from the second quarter of last year, including an unfavorable impact from currency. The volume decline was impacted unfavorably by several discrete items, including a 1% impact from the China consumption disruption and the conflict in Ukraine I just mentioned, a 1% impact from the exit of low-margin business in India and a 2% impact from lapping the U.S. trade inventory replenishment during last year's second quarter. Using 2019 as a pre-pandemic baseline, second quarter sales have grown at a constant currency compounded annual growth rate, or CAGR, of 6%. Although we anticipated the profit driven by sales growth in the second quarter would be more than offset by higher inflation and broad-based supply chain challenges, the impact was greater than expected due to continuing cost escalation. In the Americas, a sales decline in the second quarter included the impact of lapping a 4% over-shipment of consumption to replenish retailer inventories in the second quarter of last year. Looking at our Flavor Solutions growth over the past three years, since the COVID-19 restrictions caused dramatic second quarter comparisons in '20 and '21, our sales CAGR is 8%, largely driven by volumes. Our top line constant currency sales were comparable to the second quarter of last year, reflecting 7% growth from pricing actions, offset by a 7% decline in volume and product mix. On Slide 16, consumer sales in the Americas declined 4% in constant currency, driven by lower volume and mix, partially offset by pricing actions. In EMEA, constant currency consumer sales declined 11%, primarily due to lapping high year-ago demand driven by COVID-related lockdowns, the most significant impact of which was lower sales of Vahine homemade dessert products. Constant currency consumer sales in the Asia-Pacific region declined 18%, including a 20% unfavorable impact from the consumption disruption in China as well as the exit of low-margin business in India. On a three-year basis, APZ's second quarter constant currency sales CAGR was a 7% decline, driven by the China and India impact I just mentioned. In addition to the net impact of the anticipated items I just detailed, gross margin was also unfavorably impacted by the following items: As Lawrence discussed, cost inflation and supply chain pressures escalated during the second quarter impacting our results more than expected, primarily related to transportation costs and faster-turning materials. As you can see, right now, for the quarter, our pricing contribution to sales was about 7% and it's significantly higher going into the second half of the year."
}