{
    "symbol": "MKC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-29 12:45:23",
    "content": " In the first quarter, we grew sales 3% or 4% in constant currency on top of our 20% constant currency growth in the first quarter of last year, demonstrating again the strength of our product offering and broad global portfolio, which drives differentiated growth and consistency in our performance. In EMEA during the first quarter, we lapped high prior year demand, partially due to restrictions resulting from COVID resurgences last year while continuing our momentum with strong consumption growth in key categories compared to the first quarter of 2020. And in the Asia Pacific region, first quarter growth was tempered by scaled down Chinese New Year celebration due to several cities in China imposing restrictions as a result of new COVID outbreaks.These restrictions impacted our branded food service demand that is included in the consumer segment in China. Our Flavor Solutions segment grew 12% or 14% in constant currency driven by base business growth, new products and 1 month of incremental sales for our acquisition of FONA in December 2020. Consumer segment sales declined 2% in constant currency due to lapping high demand in all 3 regions last year, with a partial offset from pricing. On a 2-year basis, compared to the first quarter of 2020, constant currency sales grew 30% with double-digit growth in all 3 regions, reflecting the sustained shift to at-home consumption higher than pre-pandemic levels. On Slide 14, consumer sales in the Americas increased 2% in constant currency, driven by pricing actions, partially offset by lower volume of the product mix due to lapping last year's elevated demand. In EMEA, constant currency consumer sales declined 9% from a year ago, driven by lower volume and product mix, most significantly in Vahiné homemade dessert products due to lapping last year's high demand across the region. In the Asia Pacific region, Flavor Solutions sales rose 5% in constant currency, driven by pricing actions and growth from higher volume and product mix. As seen on Slide 21, adjusted operating income, which excludes transaction and integration costs related to the Cholula and FONA acquisitions as well as special charges declined 14% or in constant currency, 12% in the first quarter versus the year ago period. Adjusted income from unconsolidated operations declined 30% versus the first quarter of 2021, due to the elimination of higher earnings associated with minority interest as well as higher inflation costs impacting our McCormick de Mexico joint venture. And as we go through the second quarter, in particular, more pricing action goes into effect, which on top of that strong demand and with the relatively low elasticity that we're seeing will translate into both strong top line and strong bottom line growth in the second half of the year. We spent $60 million in COVID costs last year, of which some of that still remains in the underlying business, but that was -- that's a big tailwind for us to help offset some of the segment mix we've talked about, the pricing compression that we've talked about, which is the main driver."
}