{
    "symbol": "MMMB",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-14 19:34:09",
    "content": " This conference is being recorded today, June 14, 2021, and the earnings press release accompanying this conference call was issued at the close of market today. On our call today is MamaMancini’s Chairman and CEO, Carl Wolf; President and COO, Matthew Brown; CFO, Larry Morgenstein; and Greg Falesnik, CEO of MZ North America, MamaMancini’s Investor Relations firm. Before we get started, I’ll read a disclaimer about forward-looking statements. This conference call may contain, in addition to historical information, forward-looking statements within the meaning of the federal securities laws regarding MamaMancini’s. Forward-looking statements include, but are not limited to, statements that express the Company’s intentions, beliefs, expectations, strategies, predictions and any other statements relating to its future earnings, activities, events or conditions. These statements are based on current expectations, estimates and projections about the Company’s business based in part on assumptions made by management. Therefore, actual outcomes and results may and are likely to differ materially from what is expressed or forecasted in forward-looking statements, due to numerous factors discussed from time to time in this report and other documents, which the Company files with the U.S. Securities and Exchange Commission. In addition, such statements could be affected by risks and uncertainties related to factors beyond the Company’s control. Matters that cause actual results to differ materially from those forward-looking statements include, among other factors, the loss of key management personnel, availability of capital and any major litigation regarding the Company. In addition, this conference call contains time-sensitive information that reflects management’s best analysis only as of the date of this time of this conference call. The Company does not undertake any obligation to publicly update or revise any forward-looking statements to reflect future events, information or circumstances that arise after the date of this conference call. At this time, I’d like to turn the call over to Carl Wolf, the Company’s Chairman and Chief Executive Officer. We saw strong core sales growth in first quarter fiscal 2022, achieving record cash flow from operations, further fortifying our increasingly robust balance sheet. While we saw a slight revenue decline from prior year due to large one time panic ordering by grocery store customers during the onset of the pandemic in early 2022, our core momentum has trended positively with the 45% growth in the quarter over a two-year period as we are well positioned to grow further as new placements begin to take hold later this summer. The decrease in revenue for the first quarter was a result of strong prior year sales due to one-time panic buying by large grocery chains around the onset of the COVID-19 pandemic, while sales over a two-year period increased approximately 45%. While difficult to compare Q1 fiscal 2022 versus Q1 fiscal 2021, due to a once in a lifetime pandemic, we continued to show strong production in the plant during this recent quarter. As we entered Q1 fiscal 2022, we experienced labor rate increases due to state mandated minimum wage adjustments. Key pieces of cooking and packaging equipment were upgraded throughout the plant during the quarter, and in turn enabled us to cut back on manual labor. In Q1 fiscal 2022, we began the exploratory process of expanding on our cooking operation within the facility. As we push forward into the summer and beyond, we expect to make continued financial progress driven by our upcoming placements on thousands of tier-1 retailer shelves. This, when combined with our continued success in closely managing operating expenses and what I expect will be a near-term update on our acquisition efforts, has positioned MamaMancini’s for a bright future. With that, I’ll turn it over to the operator. We have shipping and commissions in royalties and potentially demos, now that’s starting again. Well, I would say right now, the facility is in good shape and in good position with some of the advancements that we’re making in terms of the construction work. I got  maybe because I couldn’t answer that question…\n But also, as Carl alluded to, and I’ll let him certainly take. No, I haven’t Carl. But I was going to say that, in addition to what Carl had alluded to earlier, Howard, is that, we are still investigating all opportunities for the Company, and we have been looking at potential acquisition that are accretive to the Company. My guess is we’ll do 3 to 5 -- if all goes well, we’ll do 3 to 5 by next fall. We had very surprising, to me, interest in the first round a year ago for -- which was way beyond what I thought we would get on the initial solicitations. We are -- on  (ph) front, we are doing very well at Costco. If you can sell one item in Costco nationally, not on rotationally year round, it’s about $25 million in sales. So, we’ve been building our Costco business based upon success and a good model. So, we’re very positive in the long run that’ll be very, very substantial. That is one of the five opportunities I mentioned, from a relatively small business to a very large business. So, our business right now at Costco is branded  Costco Kitchen is white label, a similar type volume $25 plus million per item. So, I think it’ll be very substantial. Well, we’re negotiating that. If all goes well -- and then, any candidate that’s acquired, there might be additional borrowings as well. And on the uplisting, if the back continues, like it closed today, at 3.20, four days if you’re over $3, you could be uplisted pretty quickly. The S1 filing has to be renewed periodically, and what you’re seeing is that. They’re now outstanding about 800,000 options to the Board of Directors and management and some key supplier relationships. But anyway, so there’s a very, very small amount of overhang. But right now, we’ll have -- we have about 30 -- I think about 35.5 million shares, and we have potential dilution of 800,000. So, it is not, we -- originally, we thought there would be dilution of about 30 -- total of 37.5 million share or something. We have received warrants but we made investments in the Company along with everyone else, but we never -- we haven’t received any operational options. That’s the last -- yes, that was great. As a final note, once COVID-19 subsides, we will continue to be active in attending top investor conferences and investor non-deal road shows, marking on both coasts of the U.S."
}