{
    "symbol": "TTOO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 23:08:04",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the T2 Biosystems First Quarter 2022 Earnings Conference Call. Forward-looking statements are based on estimates and assumptions as of today and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed or implied by these statements, including the risks and uncertainties described in T2 Biosystems' annual report on Form 10-K filed with the SEC on March 23, 2022, and other filings the company makes with the SEC from time-to-time. Today, I will review the company's performance in the first quarter and provide details on the progress we're making on our 3 corporate priorities. I will then turn the call over to our Chief Financial Officer, John Sprague, who will review our first quarter financial results before I make some closing remarks and we open the call for questions and answers. First, I would like to address today's announcement related to our NASDAQ listing. Today, we received a letter from the NASDAQ stock market, informing the company that its shares of common stock have failed to comply with the $1 minimum bid price required for continued listing on the NASDAQ global market under NASDAQ Listing Rule 5450(a)(1). The company has filed an appeal and hearing requests to the NASDAQ staff's determination, which will stay the delisting of the company's shares of common stock from the NASDAQ Global Market pending the panel's decision. The NASDAQ staff has informed the company that the delisting action has been stayed pending a final written decision by the panel and the hearing date has been set for June 2, 2022. While there can be no assurance that the panel will grant the company's request for continued listing, the company intends to present a plan to regain compliance to the panel that includes a discussion of the events that it believes will enable it to regain compliance in this timeframe and the commitment to affect a reverse stock split if necessary. During the first quarter, the T2 Biosystems team generated total revenue of $7.2 million, including product revenue of $3.8 million and R&D revenue of $3.4 million. We entered into contracts for 15 T2Dx Instruments during the first quarter, including 11 in the United States and 4 internationally, all of which will be used for Sepsis. We continue to make progress on our three corporate priorities: accelerating our sales, enhancing our operations and advancing our pipeline. Our first quarter results and our sales funnel have been positively impacted by our investments in sales, marketing and medical affairs. We are experienced sales success in the United States market as well as outside of the U.S., having signed numerous distribution agreements in Europe, Asia Pacific and Latin America, most recently in Norway, Finland and Turkey, and we anticipate additional international expansion. On the new product pipeline, we are advancing our two U.S. clinical trials launched in December of 2021 for the T2Resistance Panel and the T2 Biothreat panel. To remind you, Sepsis is the number one cause of death in U.S. hospitals, claiming nearly 270,000 lives annually. Sepsis is the number one cost of hospitalization in the United States, costing our healthcare system approximately $62 billion annually. Finally, Sepsis is the number one cause of 30-day hospital readmissions, resulting in nearly 20% of survivors to be re-hospitalized within 30 days and approximately 40% within 90 days. To further complicate matters, the current standard of care continues to rely on a positive blood culture to identify the presence of a bloodstream infection, target therapy for patients suspected of sepsis. Due to their poor sensitivity, blood cultures often require multiple samples of blood from critically ill patients and take anywhere from one to five days to achieve the growth necessary for pathogen identification. We are commercializing the first and only FDA-cleared products able to detect sepsis causing pathogens directly in whole blood in just three to five hours, eliminating the need to wait for a positive blood culture. At our Analyst and Investor Day in April, the critical nature of this mission and our progress spearheading the advancement of culture independent diagnostics was validated and articulated by influential key opinion leader and T2Dx users. To advance our mission and create value for our stakeholders, we're focused on three corporate priorities: accelerating our sales, enhancing our operations and advancing our pipeline. I'll now provide an update on our recent progress as it relates to each of these three corporate priorities, starting with our first priority, accelerating our sales. We have focused our sales strategy with respect to two distinct objectives: one, significantly expanding our T2Dx instrument installed base through the sale or placement of new instruments; and two, doubling our sepsis test revenue by driving broad adoption and utilization among new and existing customers. In the first quarter, we entered into 15 T2Dx instrument contracts, expanding our installed base of instruments to 91 in the United States and 55 internationally. In the United States, we achieved annualized sepsis test utilization of $109,000 per legacy T2Dx Instrument. While disruptions from the COVID-19 case surge in January negatively impacted sepsis test utilization, sepsis test panels were strong in the last weeks of the quarter. We continue to believe that over time, annualized U.S. sepsis test utilization will reach $200,000 per instrument. In recent quarters, we have significantly expanded our U.S. commercial team to accelerate sales of our sepsis product market penetration. As previously announced, we expanded our distribution networks with agreements in Norway, Finland and Turkey during the first quarter. We are having success expanding our international distribution network, enabling commercialization of our products in more countries, and we anticipate further expansion in 2022. Moving to our third priority, advancing our pipeline, our new product development priorities continue to be the programs under our milestone-based product development contract awarded by the U.S. Biomedical Advanced Research Development Authority, or BARDA, which is valued at up to $69 million. We highlighted the four products that we are developing under our contract with BARDA, the T2Resistance Panel, the T2 Biothreat panel, the comprehensive panel and the next-generation instrument at our recent Analyst and Investor Day. BARDA subsequently chose to exercise option 2B of the contract, which is valued at $4.4 million and planned for the period between April 2022 and July 2022. Upon successful completion of Option 2B, we are optimistic that BARDA will choose to exercise option three to continue to support the development of these important products. As a reminder, in December 2021, we initiated the U.S. clinical trials for the T2Resistance Panel and the T2 Biothreat panel, both ahead of our previously announced schedule. The T2Resistance Panel is a direct from blood test panel designed to run on the T2Dx instrument and simultaneously detect 13 antibiotic resistance genes from both gram-positive and gram-negative bacterial pathogens, which are known to cause antibiotic-resistant infections in three to five hours. The T2Resistance Panel was granted breakthrough device designation from the FDA, which provides for a prioritized FDA review process. The T2 Biothreat panel is a direct from blood test panel designed to run on the T2Dx instrument and simultaneously detect six biothreat pathogens identified as threats by the U.S. government, including Bacillus anthracis, Francisella tularensis Burkholderia mallei, Burkholderia pseudomallei, Yersinia pestis and Rickettsia prowazekii. Similar to our sepsis products, the T2 Biothreat panel is designed to provide results in three to five hours without the need to wait days for a positive blood culture. The U.S. clinical trial includes negative samples being analyzed at a single site, which has been completed and positive samples being prepared and analyzed at a high containment Biosafety Level 3 laboratory, which is expected to be completed in 2022, potentially enabling the filing of an FDA submission in 2022. The next-generation instrument is designed to be fully automated, on-demand and random access similar to our T2Dx instrument, but with faster turnaround times and the ability to detect an increased number of pathogens and resistance genes from a single whole blood sample. One, the T2 Biothreat panel, which we announced -- in April 2022; and two, the T2Lyme Panel, which we included in today's first quarter earnings press release. As a reminder, the FDA breakthrough devices program is a voluntary program for certain medical devices and device-led combination products that provide for more effective treatment or diagnosis of life-threatening or irreversibly debilitating diseases or conditions. It's available for devices and device-led combination products, which are subject to review under premarket approval application, or PMA, premarket notification or 510(k) or de novo classification request. This program is intended to help patients have more timely access to these medical devices by expediting their development, assessment and review while preserving the statutory standards for PMA approval, 510(k) clearance and de novo marketing authorization, consistent with the FDA's mission to protect and promote public health. With that, I'll now turn the call over to John Sprague to go over the details of our first quarter 2022 financial results and our financial outlook for 2022. Total revenue for the first quarter of 2022 was $7.2 million, an increase of 4% compared to the prior year period, driven by increased T2Dx instrument sales in BARDA contract activities, offset by decreased COVID-19 test panel sales. Product revenue was $3.8 million, a decrease of 17% compared to the prior year period. Research contribution revenues were $3.4 million, an increase of 47% compared to the prior year period. Product costs for the first quarter of 2022 were $6.2 million, an increase of $400,000 compared to the prior year period, driven by increased T2Dx instrument sales and offset by decreased COVID-19 test panel sales. Research and development expenses were $6.7 million, an increase of $2 million, driven by increased part contract activities. Selling, general and administrative expenses were $9.2 million, an increase of $3 million, driven by increased commercial and medical affairs headcount. Net loss for the first quarter of 2022 was $16.5 million or $0.10 per share compared to a net loss of $10.7 million, $0.07 per share for the prior year period. Cash, marketable securities and restricted cash were $20.5 million as of March 31, 2022. We continue to expect full year 2022 revenue of $28 million to $31 million, including product revenue of $16 million to $17 million and research contribution revenues of $12 million to $14 million. We are pleased with the progress across our three corporate priorities during the first quarter, and we're encouraged by the financial results we're generating following the expansion of our commercial and medical affairs teams. Under new commercial leadership, our expanded sales force is increasing the installed base of T2Dx Instruments globally while focusing on increasing adoption and utilization of our sepsis products. Our recent accomplishments have created business momentum early in 2022, and we're extremely excited about the future of T2 Biosystems and confident in our ability to change the standard of care for patients at risk of sepsis. First off for me, just congrats on filing for the breakthrough designation on T2 and the T2 Biothreat panel. As you probably know, there are an awful lot of submissions in queue, and we're hopeful that a successful breakthrough device submission will advance the cause much faster than otherwise. It's a single site Ben it is 100% contrive samples, and there are multiple T2Dx instruments at that site. So we do believe that, that's a pretty straightforward positive arm of the study, and we anticipate that it will be completed prior to the T2Resistance clinical trial. And then lastly for me, on the placements, you mentioned higher test panel pricing and volume commitments. And we certainly still offer capital options, although 90% of the time in the U.S. plus, it's been placements. And what it does also as part of that we also tie volume expectations to that so that when we do those with an account, they - obviously, they're signing up for increased pricing, but at the same time also signing up for volume commitments that then we monitor against a contract that we put in place with them so. Early on in the COVID pandemic, there was data first coming out of China, then in the U.S. and then other countries as the virus spread around the world that up to 30% of critically ill hospitalized COVID patients would go on to develop sepsis  infection and sepsis. So this is something that has been happening for the last couple of years, and we would anticipate it continuing to happen because these critically ill COVID patients are very susceptible and very vulnerable to bloodstream infections and sepsis. In terms of the underserved communities, Sepsis Alliance has put out a lot of data on the impact of sepsis in the underserved, and particularly the Latino and African-American communities, and it's pretty much across the board a factor of two higher - so there is a disproportionate impact of sepsis in the underserved, and we're trying to do something about that. And that actually leads me to my next question because obviously, the one thing the T2's technology is something that is standardizes a treatment protocol and puts you on a level playing field for those clinicians and rapidly addresses the critical time that you need to treat sepsis. And we strongly believe that our products can identify these pathogens much faster, lead to faster targeted therapy, and there's significant data out there that shows we can identify these pathogens faster."
}