{
    "symbol": "TTOO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 20:02:23",
    "content": " Importantly, our product sales included $2.4 million of sepsis and related product revenue, which excludes COVID-19 product sales, representing a 24% increase compared to the prior year period. As I mentioned earlier, third quarter sepsis-related revenue was $2.4 million, representing a record number for a single quarter and an increase of 24% compared to the prior year period. We generated sepsis test panel revenue of $1.5 million, representing growth of 25% from the prior year period. At the beginning of 2022, we communicated our belief that sales of our COVID-19 molecular diagnostic test, the T2SARS-CoV-2 panel would decrease during the year and provide an opportunity to convert COVID-driven instruments to sepsis testing. Several products are being developed with the goal of expanding the test menu on our FDA-cleared T2Dx instrument, including 4 products that I will highlight on today's call, the T2Biothreat Panel, T2Resistance Panel, T2Lyme Panel and T2Bacteria Panel enhancements. Total revenue for the third quarter of 2022 was $3.7 million, a decrease of 50% compared to the prior year period. Product revenue was $2.6 million, a decrease of 39% compared to the prior year period, driven by an 88% decline in sales of COVID-19 tests from $2.4 million offset by increased sepsis test sales. Product costs for the third quarter of 2022 were $6.1 million, an increase of $1.4 million compared to the prior year period, driven by increased supply chain cost and efficiencies. For guidance, we now expect full year 2022 total revenue of $22 million to $23 million, including product revenue of $11.5 million to $12 million and research contribution revenue of $10.5 million to $11 million, and we expect to close 50 to 55 T2Dx instrument contracts in 2022. It's just taken a little bit longer than we would have liked at this point, but it's an important part of our targeting, and it's something that, as I mentioned from -- and as John mentioned earlier, from a sales perspective in the U.S., we -- the team is focused on that much more additionally than they were, say, earlier in the year when we're focused a little more on sort of new account is so we split that effort."
}