{
    "symbol": "RMTI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 21:14:06",
    "content": " Finally, we are reengineering our dialysis products business, which will generate a gross profit for the first time in several years. We have made meaningful progress to improve this business, which we expect will reduce our cash burn in dialysis by about $15 million on an annualized basis. However, Rockwell Medical has been working to revise certain terms of its supply contracts with customers in an effort to stabilize its concentrates business, and last month, we announced an amended and expanded agreement to supply our concentrate products to our long-time customer and partner, DaVita Inc., which is a leading provider of kidney care in the U.S. with a market capitalization of approximately $10 billion. The amended supply agreement is designed to enable Rockwell Medical’s concentrate business to potentially operate profitably in the future with the aim of building a steady, reliable supply of life-saving concentrates in the U.S. With dialysis concentrates accounting for approximately 98% of our 2021 revenue and with approximately 90% of our 2021 sales coming from distributors and customers for use in the U.S., this new agreement is a significant milestone for Rockwell. We expect to soon begin a Phase 2 study where we believe we have significant opportunity with FPC in the rapidly growing area of home infusion therapy where we are confident there is a large unmet need for an effective iron therapy that FPC will effectively address that need, that FPC can be safely administered and based on our prior experience, that we can efficiently navigate the clinical and regulatory process. Finally, we are reengineering our dialysis products business, which will generate a gross profit for the first time in several years. We have made meaningful progress to improve this business, which we expect will reduce our cash burn in dialysis by about $15 million on an annualized basis."
}