{
    "symbol": "DAVE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 22:38:06",
    "content": "  Operator: Greetings, and welcome to Dave's First Quarter 2022 Earnings Call. This afternoon, Dave issued a press release announcing results for the first quarter ended March 31, 2022, which can be found on investors.dave.com. We would like to remind you that during this conference call management will be making forward-looking statements, including statements regarding expectations related to financial guidance, outlook for the sector and company, and the expected investment, and growth initiative. These statements reflect the company's views only as of today, should not be relied upon as representative of view as of any subsequent date, and Dave undertakes no obligation to revise or publicly release the results of any revision to these forward-looking statements in light of new information or future events. For a further discussion of the material risks and other important factors that could affect our financial results, please refer to the company's filings with the SEC, including its Form 8-K filed with the SEC on March 25, 2022. In addition, during today's call, the company will discuss non-GAAP financial measures, which they believe are useful as a supplement measure of Dave's performance. You will find additional disclosures regarding the non-GAAP financial measures discussed on today's call in Dave's press release, issued this afternoon, and its filings with the SEC, each of which is posted on the Dave website. During the quarter, we added 340,000 net new members in end of the quarter with approximately 6.4 million total members on the Dave platform. As a reminder, Q1 is historically our latest quarter due to tax refund season, reducing the need for credit amongst our target consumer. As we've previously mentioned, over the next eight to 10 quarters our focus continues to be making discipline investments and to achieve profitable growth and unit economics at scale. First, utilize our data driven underwriting advantage to profitably grow our ExtraCash resonation and average revenue per member. Over the course of Q1, we increased total originations by over 20% versus Q4, and increased average revenue per monthly transacting members. We've also increased our average size per origination by nearly 30% versus Q4, and nearly 90% year-over-year with better credit performance in Q1 2022 relative to each of those periods. To extend our lead in the industry, over the next few weeks, we'll be increasing our maximum ExtraCash amounts of $500, which we believe will be additive to our marketing message and drive existing member engagement. Dave can improve his customers for ExtraCash without a credit score, help them establish credit history for the first time or empowering them to build on what they already have. The final piece of the growth strategy is to accelerate banking, adoption and spend frequency ultimately building towards winning primary account status with our members. Moving forward, all Dave customers new and old will be required to have a daily spending account of which they will receive several benefits including faster and cheaper access to ExtraCash, as well as cash back rewards. In terms of top line performance, total non-GAAP operating revenues were approximately $43.7 million in Q1 2022, representing 24% year-over-year growth compared to the same period last year. On a GAAP basis, service base revenue was up approximately 21% year-over-year compared to the same period last year, which was primarily driven by growth and ExtraCash originations. Q1 GAAP transaction based revenue was approximately $3.3 million, up approximately 64% year-over-year compared to the same period last year. We continue to believe in the opportunity to drive substantial growth in transaction revenue as we integrate the ExtraCash and spend experiences, which Jason mentioned previously, and roll out additional product enhancements throughout the year to drive recurring fan engagement. In terms of key trends, Q1 is a seasonally slower from a growth and engagement perspective as tax refunds reduce the demand for the ExtraCash service. To recap the key drivers of this metric, our ExtraCash credit performance, as well as the primary direct cost drivers associated with our broader product portfolio. For the quarter, non-GAAP variable profit was approximately $17.8 million representing of approximate 41% margin relative to our non-GAAP total operating revenues. Further, we'd note that the period-over-period impacted these changes continue to be impacted by the secondary effects of large scale stimulus in late 2020 and early 2021, which drove large swings in total origination. In terms of credit performance for the quarter, we continue to see consistent and strong performance with an average 28 Day delinquency rate of 3.27%, a 22 basis point decrease versus Q4 2021's average. Our newest vintages are performing in line with our expectations and historical benchmarks, which I believe is a testament to our unique technology and capabilities that allow us to manage growth and risk effectively in a variety of markets and cycles. Next, we're seeing tighter gross spreads as we've increased our average size per origination which negatively impacts variable margin at a fixed charge operating. This was an expected trend, and though we're monitoring it closely, it's not something we're concerned about given it is consistent with our overall member engagement strategy. As we can help bring more members up the ExtraCash limit curve, we can serve as a broader state of their needs, driving better funnel conversion and longer-term engagement and retention, all contributing to increase lifetime value. Moving to operating expenses, the provision for unrecoverable advances totaled approximately $13.8 million for Q1 2022 compared to approximately $3.5 million in Q1 2021. As previously mentioned, significant fluctuation here was driven by volume growth as credit performance remains incredibly strong. It's also important to point out the efficiency of our balance sheet, with total receivables of just $61.8 million supporting the $545 million of origination volume for the quarter. In Q1 2022, processing and servicing fees totaled approximately $6.5 million, compared to approximately $5.2 million for Q1 '21. Again, this increase was primarily attributable to the increase in advanced volume, offset by volume associated discounts and cost savings due to price reductions from our processors, as we grow, we will continue to generate incremental leverage and efficiency as a percentage of our total origination volume in this line item. We continue to believe we have amongst the lowest customer acquisition costs in the industry, and that we can grow efficiently, particularly given the relevancy of our value proposition in today's inflationary environment. As of the end of the quarter, we had a total of 6.4 million members, a substantial population for us to continue to market to drive efficient monthly transacting member growth. In terms of outlook for our marketing and member acquisition spend, as I previously mentioned, we're attempting to align our marketing investments in periods of higher seasonal demand and engagement, particularly in the upcoming summer months. Overall for the year, we're expecting to invest between approximately $65 million and $80 million in marketing. If we feel that we can incrementally scale spend to drive further growth, while maintaining a discipline payback period of 12 to 18 months, and we see a strong case for value creation by deploying additional dollars into our marketing engine. In terms of adjusted EBITDA, as Jason alluded to earlier, we're still in considerable investment mode that we believe will set us up to drive consistent future growth at scale. We expect these investments will allow us to bring more value to our members, increase ARPU with a more robust offering and further penetrate our TAM to deliver strong growth over the next several years. With that backdrop, Q1 2022 adjusted EBITDA was approximately negative $18.3 million, with a GAAP net loss of approximately $34.8 million, which includes a number of one-time non-cash and leaseback related transaction expenses. As of March 31 2022, our fully diluted shares outstanding was $361.9 million. As a reminder, the closing of the business combination in January added approximately $202 million of cash after expenses, which relative to the $61 million of equity we had raised prior to going public is significant. Further, the additional $100 million of capital received from the FTX investment in Mark provides us with the added capacity and flexibility to pursue further organic and inorganic growth opportunities. Accounting for this new capital as of March 31, 2022 we had approximately $302.3 million of cash and marketable securities on the balance sheet. Therefore, we believe we're well capitalized to deliver significant growth, execute on our strategy and achieve profitability and positive free cash flow without the need to raise any additional equity capital. Now turning to our outlook, which we are reiterating for the year, we continue to expect non-GAAP total operating revenue to be between $200 million and $230 million for the year. We've gotten strong signal on the start of the second quarter, and that we have a compelling opportunity ahead of us to accelerate growth throughout the rest of the year and beyond. So I would say we're very focused on the top of funnel and our go-to-market strategy around that the credit first approach, we just find it with a macro environment around the stimulus waiting."
}