{
    "symbol": "TTC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-21 16:02:03",
    "content": " For the fourth quarter, net sales were up 22% over last year, and adjusted diluted earnings per share were up 98%. For the full-year, our topline exceeded $4 billion for the first time with net sales of $4.5 billion, up 14% year-over-year. For the full-year, net sales increased 14% year-over-year to a record $4.51 billion. Professional segment net sales for the quarter were $944.7 million, up 29% year-over-year. For the full-year, Professional segment net sales increased 17.1% to $3.43 billion and comprise 76% of the total company net sales. Professional segment earnings for the fourth quarter were up 58% to $159 million, and when expressed as a percentage of net sales, 16.8%, up from 13.8% last year. For the full-year, Professional segment earnings were $584 million, an increase of 15.1% compared to fiscal 2021. As a percentage of net sales, segment earnings were 17%, down slightly from 17.3% last year as a result of the Intimidator acquisition in the first quarter. Residential segment net sales for the fourth quarter were $223.5 million, down about 1% year-over-year. For the full-year, Residential segment net sales increased 5.8% to $1.1 billion and comprised 24% of the total company net sales. Residential segment earnings for the quarter were $17.5 million, and when expressed as a percentage of net sales, 7.8%, up from 5.3% last year. For the full-year, Residential segment earnings were $112.7 million, a decrease of 7.2% year-over-year. Operating earnings as a percentage of net sales for the fourth quarter were 12.8%, compared to 7.7% in the same period last year. Accounts receivable were $332.7 million, up 7% from a year-ago, primarily driven by organic net sales growth and our acquisition of Intimidator Group. For the full-year, we expect net sales growth in the range of 7% to 10%, and we anticipate the return to a more typical quarterly sales cadence with Q2 and Q3 being our larger quarters. For the full-year, we expect improvement in overall adjusted operating earnings as a percentage of net sales compared to last year, driven by higher earnings margins in both segments. Additionally, for the full-year, we expect capital expenditures in the range of $150 million to $175 million, depreciation and amortization of about $130 million, interest expense of about $55 million and an adjusted effective tax rate of about 21%."
}