{
    "symbol": "TTC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-01 14:06:06",
    "content": "  Operator: Good day, ladies and gentlemen and welcome to the Toro Companyâ\u0080\u0099s Third Quarter Earnings Conference Call. In addition, we have introduced a quarterly earnings presentation as well as an updated general investor presentation, both of which are now available on our website. We also have Angie Drake, our newly promoted Vice President of Finance; and Jeremy , who recently joined our team as Director of Investor Relations. This includes estimates and assumptions regarding financial and operating results as well as economic, technological, weather, market acceptance, acquisition-related and other factors that may impact our business and customers. Moving to our third quarter results, we continue to execute at a high level and build upon our long history of delivering financial performance in line with our expectations. Our third quarter net sales grew by 18.8%, while our adjusted diluted earnings per share grew by 29.3% both on a year-over-year basis. We continue to see favorable demand for our innovative products, along with incremental improvements in our supply chain and manufacturing efficiency. For our residential segment, demand was solid, moderating as expected and in line with more typical seasonal trends. Importantly, we achieved healthy single-digit growth in the residential segment and thatâ\u0080\u0099s on top of the higher base we have built with 2 years of double-digit growth. As a percent of net sales, we grew our adjusted operating earnings 100 basis points year-over-year and 30 basis points sequentially from the second quarter of this year. With this progress, we are raising our fiscal 2022 adjusted diluted earnings per share guidance for the second time this year. Throughout the quarter, we remain focused on our strategic priorities of accelerating profitable growth, driving productivity and operational excellence and empowering people. As a result, we delivered strong performance in the near-term while also setting ourselves up to capitalize on attractive long-term growth opportunities. Our latest report outlines performance goals and specific targets aligned with our strategic priorities, including increasing battery and hybrid product sales, reducing absolute Scope 1 and 2 greenhouse gas emissions and increasing the number of women and racial and ethnic minorities in leadership positions. Recently, we hosted our first Sustainability Lab, which is a forum we established to share ideas and facilitate increased collaboration between The Toro Company and Urban Park Systems across North America. These highlights are just two examples of the many ways we support our purpose of helping our customers enrich the beauty, productivity and sustainability of the land. While the overall supply chain environment remains dynamic, our team continued to adapt and execute well. We grew net sales to $1.16 billion, an increase of 18.8% compared to the third quarter of last year. Reported and adjusted diluted EPS for the quarter were both $1.19, up from $0.89 and $0.92 respectively in the third quarter a year ago. Professional segment net sales for the third quarter were $886.2 million, up 23.3% year-over-year. This growth was primarily driven by net price realization, increased shipments of zero-turn and stand-on mowers and incremental revenue from our acquisition of the Intimidator Group earlier this fiscal year. Professional segment earnings for the third quarter were $166.2 million, and when expressed as a percent of net sales, 18.8%. The year-over-year increase was primarily due to net price realization, productivity improvements and net sales leverage. Residential segment net sales for the third quarter were $270 million, up 7.1% from last year despite unfavorable hot and dry weather patterns in certain regions this year. Residential segment earnings for the quarter were $26.3 million and when expressed as a percent of net sales, 9.8%. The year-over-year decrease was primarily driven by higher material freight and manufacturing costs partially offset by increased net price realization, productivity improvements and favorable product mix. In the third quarter, reported and adjusted gross margin were both 34.5%. With our strong operational execution, we achieved a 200 basis point sequential improvement in adjusted gross margin compared to the second quarter of this year. Operating earnings as a percent of net sales for the third quarter were 14%, up from 12.5% in the same period last year. Adjusted operating earnings as a percent of net sales for the quarter were 14.1%, up from 13.1% in the same period a year ago. Interest expense for the quarter was $9.2 million, up $2.2 million from the same period last year. Turning to the balance sheet, accounts receivable were $351 million, up 16% from a year ago, primarily driven by higher organic sales and our acquisition of the Intimidator Group. Inventory was $939 million, up 41% compared to last year. During the quarter, we issued 10-year private placement notes to refinance $100 million of outstanding revolver borrowings. Our priorities remain: making strategic investments in our business to support long-term profitable growth, both organically and through acquisitions, returning cash to shareholders through dividends and share repurchases, and maintaining our leverage goals to support financial flexibility. These priorities are highlighted by our actions this year, which include our plan to deploy approximately $140 million in capital expenditures to fund capacity, productivity and new product investments, our $400 million acquisition of Intimidator Group in January and a return of $204 million to shareholders year-to-date with $94 million in regular dividends and $110 million in share repurchases. We are entering the fourth quarter with strong momentum, and weâ\u0080\u0099re encouraged by the incremental supply chain and operational improvements we are seeing. As Rick mentioned, we are updating our full year fiscal 2022 guidance based on current visibility. For the full year, we now expect net sales growth of about 14%. For the residential segment, we anticipate full year net sales growth in the mid-single digits. For the professional segment, we continue to expect net sales growth above the company average. Looking at gross margins, we have made sequential improvement in each of the three quarters of the year. Taking into account current macro factors and the addition of Intimidator Group, we continue to expect fiscal 2022 gross margins to be slightly below fiscal 2021 levels. For the full year, we continue to expect adjusted operating earnings as a percent of net sales to be similar to fiscal 2021. This takes into account the operational improvements we are realizing, the expectations for continued supply chain and inflationary pressures as well as our acquisition of the Intimidator Group. And as we expect to continue to engage more directly with our customers and prioritize strategic research and development investments, we expect the full year professional segment margin to be slightly higher than last year and the residential segment margin to be lower. We are confident as we close out the fiscal year, and weâ\u0080\u0099re raising our full year adjusted diluted EPS guidance to a range of $4.07 to $4.17. As a reminder, our adjusted diluted EPS guidance excludes the benefit of the excess tax deduction for stock compensation as well as one-time acquisition-related costs. In addition, we continue to expect depreciation and amortization of about $120 million, interest expense of about $36 million and an adjusted effective tax rate of about 21%. As we enter the final quarter of our fiscal year, we remain well positioned in each of the attractive markets we serve. Iâ\u0080\u0099ll now comment on the macro factors we are seeing in our markets, which could impact future results, starting with our professional segment. For underground and specialty construction, we continue to see strong demand with both private and public infrastructure investments, providing a multiyear tailwind. For municipalities and grounds, we continue to see the prioritization of green spaces as well as increasing interest in zero exhaust emission products. For customers seeking sustainable solutions, we are well positioned with a growing suite of no compromise offerings geared to professionals. For snow and ice management, we are seeing healthy preseason bookings following the late-season storms earlier this year that cleared out inventory in the channel. For landscape contractors, we are seeing more typical seasonal trends in retail demand. In the current environment, the need for solutions that drive productivity and efficiency are especially important and our three brands, Exmark, Toro and Spartan do just that and position us well to extend our leadership in this space. Importantly for us, this normalization of retail demand is on top of the higher base we have built over the last few years. From a broader perspective, we continue to keep an eye on overall business confidence as well as consumer sentiment and spending. Weâ\u0080\u0099re also monitoring inflation, monetary policy actions and the geopolitical environment and acknowledge a heightened level of macro uncertainty. Key drivers of future growth include our strategic investments in alternative power, smart connected and autonomous solutions. We believe our leadership and innovation, coupled with our sharp focus on enterprise-wide operational excellence, deep relationships and prudent capital allocation will drive value for all stakeholders going forward. I would also like to extend my gratitude to our channel partners, customers and shareholders for their continued support. And I think itâ\u0080\u0099s also important to recognize that during that same period, we saw growth in zero-turn mowers within residential as well as within pro. Maybe just one other positive is for our Flex-Force electric mower, we really saw continued growth in that area, and thatâ\u0080\u0099s just â\u0080\u0093 thatâ\u0080\u0099s part of that suite that weâ\u0080\u0099re very excited about. And then turning to the professional side, you indicated a couple of times that supply chain is improving, which is encouraging. And when I say that weâ\u0080\u0099re seeing improvement, weâ\u0080\u0099re seeing improvements in the bottom-line results of producing product. We donâ\u0080\u0099t have as many engine issues as we did last year at this time, but the big challenge on the more professional side of the businesses, a lot of the components are shared across multiple markets. So itâ\u0080\u0099s really â\u0080\u0093 weâ\u0080\u0099re working our way through the top issues further down into the list, but there are still a lot of issues that come up in different areas that weâ\u0080\u0099re working through. The good news is our team has really extended beyond our sourcing team to go â\u0080\u0093 or to include the design team, marketing team and working together to find solutions. As we look forward to price, the demand for our products, David, remains very solid, and itâ\u0080\u0099s been very dynamic over the last number of years. First of all, you used the expression a couple of times, you are seeing normalized demand in residential. So, if you think about the residential business specifically, that business has been an absolute champ through the pandemic period for the last couple of years. And obviously, we benefited from some of the pandemic effects, but underlying that was the foundational work that we did to change that business, adding channel partners, completely rebooting the product line, the marketing messaging and so forth as we have talked about in the past. So, we are at a new plateau of that business thatâ\u0080\u0099s substantially higher than it was in 2019 and before. That being said, we are returning to the more normal drivers of the business, which would be the seasonal drivers, the timing of spring, the weather patterns. So, itâ\u0080\u0099s really referring to the normal patterns that have been part of that business for a long time. And this last season actually was challenging for the residential business, starting with a late â\u0080\u0093 very late spring and then converting over to a very dry summer. And then on the landscape contractor side, is it â\u0080\u0093 it sounds like residential has done perhaps better than normal, and so itâ\u0080\u0099s returning to normal. If you are talking about the mowing aspect of that, if anything, there are a certain percentage of those products that are purchased by large homeowners as well. So, they have â\u0080\u0093 there is a small portion of that business that acts more like a residential type of customer. In terms of the broader contractorsâ\u0080\u0099 landscape creation, landscape contractors that maintain properties, that continues to be very strong from a pro-perspective. And just building upon that from an EPS standpoint, we did raise our guidance in that area, and thatâ\u0080\u0099s really the improvements we are seeing from both the supply chain and operational performance across the portfolio. In terms of â\u0080\u0093 you mentioned, Rick, as it relates to landscape contractor being behind that purchase. As you mentioned earlier, I think golf demand is strong into, if not through â\u0080\u009823. First of all, field inventory, in general for The Toro Company is significantly lower than we would like to see. We have talked about residential and the market during the summer and the late spring, but there are some categories of residential that have started to return to more normal levels of inventory in the field across virtually all of our pro-categories and markets we do not have enough field inventory to be at normal levels. As the supply chain gets better, obviously, we fulfill the end customer demand, and then we will work to bring back field inventories to a more normal level. Just speaking specifically to the backlog, we have â\u0080\u0093 the demand continues to be very strong and the backlog position is higher than it was when we ended our fiscal year. We have made some progress just within the last couple of months on bringing it down from the peak, but it continues to be very strong and primarily coming from those areas we talked about previously, the underground specialty construction business, golf, and for landscape creation, also a very healthy position from a professional snow and ice management business. They all â\u0080\u0093 there is a significant need for products for professional customers at this point, and we feel very confident in that demand. I think, Tim, we expect to see probably the residential business being more normal from a seasonal perspective. But the professional business, as Rick just said, is really constrained by supply chain. So, we think thatâ\u0080\u0099s going to take a little bit longer for us to return to a more normal cadence. But for some of our businesses such as golf and grounds and underground construction, we think thatâ\u0080\u0099s going to take a little bit longer. For some businesses, we are seeing a little more recovery sooner such as landscape contractor. Just one additional point, if you think about the newer parts of our business, the Ditch Witch business, special construction, underground, snow, they have different seasonal patterns and those are new factors, especially from 2019 on. In the case of the underground business, itâ\u0080\u0099s not really very seasonal. Hopefully, that continues as well as some of the commodities we have seen kind of coming off their peaks from a future standpoint. And we are seeing, as Rick just mentioned, the strength of our portfolio and the broad portfolio really helping us as we look at diversification. So, we feel pretty positive about next year as we go into it and do think it will be a strong year. What we would look at is price was a â\u0080\u0093 price realization was a major driver, Tim, to our growth as well as the Intimidator Group acquisition, factoring that in and also especially the strength of zero turns, we saw positive volume in that area as well. And the professional business, as we have stated, is still supply constrained. So we â\u0080\u0093 if we could build more from a professional standpoint, we would ship more and we did see growth in key product categories from a volume standpoint. So, demand overall solid, but we are seeing more of an impact of price versus volume and overall for the company. Maybe, Renee, kind of â\u0080\u0093 I know you guys on the margin front, called out the impact from the Intimidator Group. I was just wondering when you kind of expect that negative headwind from that acquisition to abate and move towards a more normalized cadence, if you will. We would expect â\u0080\u0093 we acquired Intimidator Group, the acquisition was recorded in Q2 and going forward â\u0080\u0093 I mean so certainly, there will be some impact from that first year just from an absolute standpoint. So, we are also seeing the benefit, not just with an Intimidator Group, but across the whole landscape contractor portfolio. What we are also really focused on is how do we leverage our technology with Intimidator Group, but also across our other brands as well. And then maybe, Rick, obviously, there is large portions of the U.S. have been and likely will continue to be impacted by drought conditions that really donâ\u0080\u0099t seem to be letting up. I would really characterize them as normal demand variation that happens in these kinds of periods, which we are accustomed to in our business. So, those â\u0080\u0093 it can actually be good initially for irrigation business."
}