{
    "symbol": "PLUS",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-05 15:50:28",
    "content": " Building on our first quarter performance, ePlus generated solid second quarter results with nearly 8% consolidated net sales growth and adjusted gross billings growth of more than 15%. Second quarter GAAP earnings per share decreased 8.5% to $1.07, reflecting investments in customer-facing personnel and investments in our internal IT capabilities to help us scale, increases in reserves and foreign currency translation losses and a challenging year-over-year comparison in our financing segment that we called out on our last earnings call. Net sales were up 7.8% year-over-year, totaling $493.7 million in the second quarter. We were pleased with the growth in adjusted gross billings of 15.3%, amounting to $765.8 million compared to $664.1 million reported in the year ago quarter. As we move to our consolidated gross profit, we reported 8.4% growth to $133.3 million in the second quarter compared to $123 million reported last year. While our service margin was 33.6% compared to 38.6% in the second quarter of fiscal 2022, as Mark mentioned, this was primarily due to higher third-party costs related to our professional services and several large project-related contracts that were competitively priced, which blended down our service margins as well as an increase from managed services costs. Although we made significant investments in personnel, operating income for the quarter was $44.1 million, essentially flat compared to the exceptionally strong level of $44.3 million reported in the second quarter of 2022, which benefited from several outside transactions in our financing segment. Including foreign currency translation losses from U.S. dollar-denominated loans with our subsidiaries in the United Kingdom that totaled $3.9 million, consolidated net earnings in the second quarter of fiscal 2023 were $28.5 million or $1.07 per diluted share, compared to $31.4 million or $1.17 per diluted share in the last year's second quarter. Just to briefly recap our financial performance year-to-date, net sales for the first 6 months of fiscal 2023 increased 8.8% to $952.1 million, driven by net sales growth of 10% in the Technology segment to $920.3 million. Adjusted EBITDA was up 0.2% to $88.6 million, and non-GAAP diluted earnings per share was flat year-over-year at $2.28 per diluted share."
}