{
    "symbol": "PLUS",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-07 21:38:05",
    "content": " Third quarter sales were $11.7 million compared to $17.9 million in the same period last year, primarily due to lower proceeds from sales of leased equipment. Technology segment net sales rose 28.3% to $611.8 million, driven by 31% growth in product revenue and 7.9% growth in services revenue. Adjusted gross billings were $888.6 million, up 29.7% compared to $685 million in the year ago quarter. As Mark mentioned, due to a decline in proceeds from leased equipment sales year-to-year, our financing segment revenue totaled $11.7 million compared to $17.9 million in last year's third quarter. Consolidated gross profit increased 18.1% to $138.4 million, and gross margin was 22.2% compared to 23.7% in the previous year's quarter. Financing segment gross profit declined 16.7% to $10.5 million, mainly due to decreased sales of leased equipment, partially offset by higher transactional gains. Overall, operating expense growth was well below our consolidated net sales growth, resulting in an operating income increase of 28.7% to $46.5 million. Consolidated net earnings in the third quarter of fiscal 2023, inclusive of other income, which includes foreign currency transaction gains and proceeds from a class action claim were $35.7 million, or $1.34 per diluted share compared to $26.4 million or $0.98 per diluted share in the year ago quarter. Summarizing our year-to-date performance, net sales in the first nine months of fiscal 2023 increased by 15% to $1.576 billion, mainly attributable to Technology segment net sales growth of 16.6% to $1.532 billion. The decrease in cash and cash equivalents reflected the effect of share repurchases on a year-to-date basis as well as increased working capital needs due to strong demand for our products and services, while inventory increased 57.9% to $244.8 million from fiscal 2022 year-end, we reduced inventory by $30 million sequentially compared to the fiscal second quarter."
}