{
    "symbol": "FULT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 14:24:05",
    "content": " Starting with commercial lending, with another solid quarter where commercial loans grew $225 million, or 7.2%. C&I loan growth accelerated, increasing $106 million or 10.6% versus 8.1% in the first quarter and 5.5% compared to the prior year period. As a reminder, commercial line utilization as of the first quarter of 2020 was 32%, representing a $530 million opportunity should line utilization revert to pre-pandemic levels at some point in the future. During the quarter, commercial mortgages rebounded from a flat quarter in the first quarter, growing $128 million or 7%, driven by strong origination and migration from construction to permanent loans. Commercial mortgage growth did impact commercial construction balances, which declined $79 million during the quarter. For the quarter, total deposit balances declined $397 million or 7.4%. In our commercial line of business, total fees increased $4.4 million, up 27% versus the prior period, driven by sizeable increases in capital markets, merchant activity fees and our core cash management business. Capital markets fees predominantly commercial loan interest rate swaps were up $2.2 million versus the prior quarter, driven by both volume and size of transaction. Merchant fees were up $1.1 million or 23% linked-quarter, driven by increases in gross sales volume. Cash management grew $634,000 or 11.7% linked-quarter, as weâ\u0080\u0099re starting to see increased activity and the impact of annual fee increases. Offsetting growth in the commercial business, wealth management fees declined $1.2 million or 5.9% linked-quarter, continued strong sales efforts, client retention and our recurring fee revenue model help to buffer the impact of declines in the financial markets. Total salaries and benefits were up $1 million linked-quarter, driven by annual merit increases in the month of April and one additional calendar day during the quarter. So until we really know that, Chris, I mean, Iâ\u0080\u0099m not going to go beyond the fourth quarter guide that we give, which I said is less than a $1 million and it reflected in the $220 million or $230 million overall fee income guide."
}