{
    "symbol": "FULT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-18 12:58:05",
    "content": " Overall, total loan growth was strong for the quarter at $584 million, or 12% annualized. The provision for credit losses of $14.5 million was an increase from $11 million last quarter, when excluding the CECL Day 1 charge related to the acquisition of Prudential Bancorp. Starting on Slide 3, operating earnings per diluted share this quarter were $0.48, on operating net income available to common shareholders of $81.2 million. Our operating results exclude $1.9 million of merger related charges recorded during the quarter for our acquisition of Prudential Bancorp, and $514,000 in core deposit in tangible amortization. As Curt noted, loan growth was very strong for the quarter at $584 million or 12% annualized. C&I lending grew $244 million, led by automobile floorplan increases, agricultural lending and an overall increase in-line utilization, which increased from 21 -- sorry, 22.5% last quarter to 23% this quarter. Consumer lending produced organic growth of $240 million, or 15% during the quarter. Putting together all of those balance sheet trends on Slide 4, net interest income was $226 million, a $10 million increase linked quarter. Our NPAs declined $21 million during the quarter, which led to our NPA to assets ratio improving from 76 basis points at September 30 to 66 basis points at year-end. Overall criticized and classified loans continued trending lower with a decline of $26 million or 3% during the quarter, following a $251 million or a 24% decline from the second to third quarters of 2022. With that, our 2023 guidance is as follows: we expect our net interest income on a non-FTE basis to be in the range of $895 million to $915 million; we expect our non-interest income, excluding securities gains to be in the range of $220 million to $235 million; we expect non-interest expenses to be in the range of $645 million to $665 million for the year; and lastly, we expect our effective tax rate to be in the range of 19% plus or minus for the year. Your line is open. Your line is open. When you look at the total allowance and basis points, it went down just a couple of basis points but that's a function of -- I mean we did have a charge-off of $12 million on a loan that was on non-accrual that we charged down. And just a clarification finally, the expense numbers that you gave that are going to be coming down in the -- from the fourth quarter with the $3 million and the $0.8 million and the $1.9 million. Your line is open. Your line is open. Your line is open. So if you take the -- if you take our $168.5 million in the fourth quarter, subtract down $1.9 million for one-time merger charges on Prudential, take out $3 million for incentive compensation and other accruals. Take out $800,000 for the branch closures that are planned in 2023 and then 1.9 million between legal and reserves that we set aside for a contingent liability during the fourth quarter. Your line is open."
}