{
    "symbol": "KB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 15:40:15",
    "content": " We will first hear the 2022 first half major financial highlights from CFO and Senior Managing Director, Scott Seo, and then have a Q&A session. Q2 â\u0080\u009822 group net profit was KRW 1.3 trillion, up 11.4% year-over-year as of the first half, reporting KRW 2.8 trillion. Group ROCE was 12.5%, being kept at a steady level as of the first half, while annualized EPS, earnings per share, was around KRW 14,000, up 11% year-over-year on a robust uptrend. And following last February, we decided to do share cancellation of KRW 150 billion of treasury shares and, as such, do KRW 300 billion of total share cancellation this year. Globally, there is growing concern over saturation while Korean economy is mired with 3 highs, high interest rate, high inflation and high exchange rate, which may undermine profitability of the banking business and widen credit risk. For example, this quarter, based on conservative projections for GDP growth, policy rates and the FX rate as well as other indicators and scenario analysis for crisis, we made around KRW 121 billion of additional provisions. By way of such conservative provisioning stance, weâ\u0080\u0099ve been enhancing loss-absorbing capacity, bringing groupâ\u0080\u0099s NPL coverage ratio to 222.4%, which is the industryâ\u0080\u0099s top-notch level as well as top-notch in terms of the global standards. Also, last May, we ran a group-level stress test based on internal and external economic conditions and probable future risk factors. And even under a severe recession scenario of negative 6.3% GDP growth of the IMF, the groupâ\u0080\u0099s capital adequacy will be above the regulatory requirement, yet again attesting to KBâ\u0080\u0099s sound financial prudence. Meanwhile, as a leading financial group fulfilling its social responsibility, KBFG is extending various different financial support for the vulnerable and the less privileged who are suffering from economic slowdown and rate hikes. Also, ahead of the end of COVID-19 financial forbearance program in May, to alleviate burden for small businesses and the self-employed, depending on the borrowersâ\u0080\u0099 repayment capacity, we allowed up to 10-year extension for amortization and introduced COVID-19 special long-term repayment amortization program offering grace period for repayment of the loans to allow for a soft lending. This has proven KBâ\u0080\u0099s distinctive expertise in household loans and customersâ\u0080\u0099 trust, and we expect there to be some growth in household loan growth going forward amidst somewhat of a sluggish first half growth. KBFGâ\u0080\u0099s Q2 2022 net profit was KRW 1,303.5 billion, up 11.4% year-over-year to KRW 2,756.6 billion on the first half basis. However, Q2 net profit was down 10.3% Q-on-Q as conservative FLC, forward-looking criteria, was used to preemptively book provisioning. And due to the lack of one-off gains such as the bankâ\u0080\u0099s corporate tax reversals in Q1, excluding the impact of such nonrecurring items, net profit is down 2.4% Q-on-Q. In more detail, first half 2022 group net interest income was KRW 5,441.8 billion. And Q2 net interest income was KRW 2,793.8 billion, up 18.7% year-over-year and 5.5% Q-on-Q. Q2 group net fee and commission income was KRW 874.9 billion, down 4.4% Q-on-Q. And on a first half basis, it reported KRW 1,789.9 billion, down slightly year-over-year. However, thanks to our business diversification and efforts to strengthen competitiveness, earnings fundamental behind generating fee and commission income has improved a notch, driving the IB business performance by twofold year-over-year, landing the group on a solid market position. Other operating profit this year underperformed on the back of valuation loss from bonds following market rate hikes, while rise in FX rates and foreign equity index drove losses from ELS and CVA valuation, dampening performance from securities and derivatives and FX, leading to sluggish performance both year-over-year and Q-on-Q. And since there is the added possibility that financial market volatility can increase including for FX, we wish to maintain a defensive management stance for the time being and improve earnings stability through portfolio diversification and a flexible position strategy. 2022 first half group G&A posted KRW 3,445.9 billion. Despite the increasing group level investment in digitalization, as a result of cost-control efforts including labor costs, it only increased 1.6% Y-o-Y and is being well controlled. In addition, for Q2, G&A expenses, due to seasonal factors, including increase in advertising and promotion costs and taxes and dues, increased 3.7% Q-o-Q. Q2 group provision for credit losses posted KRW 333.1 billion and increased by KRW 203 billion, a slightly high range Q-o-Q. And with the removal of the Q1 sizeable provisioning write-back in this quarter, the recurring level of provisioning, excluding these nonrecurring items, posted around KRW 210 billion level. First half provision for credit losses posted KRW 463.2 billion, an increase slightly Y-o-Y due to preemptive provisioning and asset growth but is maintaining a stable level on a recurring level. First, 2022 first half group ROCE posted 12.49%. And as a result of solid core earnings growth and cost control efforts, a level of higher than 10% is being well maintained. In the case of corporate loans, it posted KRW 157 trillion as of end of June. In particular, general SME loans increased around KRW 4 trillion YTD and drove SME loans growth. For large corporate loans, with the loan demand growth following worsening conditions for corporate bond issuing and as a result of efforts to strengthen the IB business, it decreased 7.5% YTD. On the other hand, June end household loans posted KRW 166 trillion and decreased 2.5% YTD and is posting a minus growth rate. This was due to weaker overall loan demand due to strengthened household loan regulations and burden due to loan interest rate hikes and, in particular, since there was an increase of pressure to repay unsecured loans. In the second half of this year, it is forecast that there will be a partial recovery of household loan growth. But since this is a period where conservative risk management is required due to internal and external conditions, we wish to focus on asset quality and profitability management and concentrate on qualitative growth centering on high-quality assets. This was mainly attributable to the rapid loan asset repricing, reflecting steep key rate hikes from August of the previous year and the valued asset profitability improvement. On the other hand, Q2 group NIM posted 1.96% and rose 5 bp Q-o-Q. With the card financial asset yield decline, including card loan and cash advance, and effects from card NIM contraction following funding cost increase, the increase was more limited compared to the bankâ\u0080\u0099s NIM. As you can see on the top left-hand graph, 2022 first half group CIR posted 46.5%, and the groupâ\u0080\u0099s cost efficiency is being continuously improved. And even in the situation where credit risk is increasing due to rapid interest rate hikes and economic downturn, it is still being maintained at a stable level. As of end of June 2022, group BIS ratio posted 15.64%, and CET1 ratio posted 12.93%. With expansion of corporate and overseas asset expansion, risk-weighted asset increase and with the interest rate hike and some price declines and with the decrease in accumulated other comprehensive income, it decreased YTD. But on the back of robust profit generation and strategic capital management, it is securing the highest level of solid capital buffer in the financial industry. With this, I will conclude 2022 first half KB Financial Group business results presentation. We see that the U.S. banks have started to end the treasury share-related cancellations, so weâ\u0080\u0099re concerned with this type of stance could actually continue and be sustained into the future. And second, if you look at our net profit this year, if our net profit this year is at least KRW 1 more, weâ\u0080\u0099re going to do our best to make sure our DPS also rises. And the third point I would like to emphasize is that our payout ratio, once we reach the 30%, rather than increasing the cash payout, we will focus more on share buyback and cancellation. If you were to compare us with banks in the U.S., excluding the credit cards, if you look at the provision, out of the total loan book, and this is not against the NPL but against the total loan book, if you were to compare our provision level versus the U.S. banks, there is no difference. So in KB Financial Group, we have global standards, and we have the most higher-notch criteria, based on which weâ\u0080\u0099ve done our best to provision as much as possible for our credit card. Now having said that, because of the rate hikes, if you look at savings banks, we believe that they are going to be quite severely impacted or highly impacted because if you look at the delinquency rate, delinquency rate is showing an uptrend. And the reason for that is because last year and 2 years back up to first half of this year, looking at the savings banks, thereâ\u0080\u0099s been a steep price in household loans, last year more than 50%. Whatâ\u0080\u0099s interesting is that these platform-linked loans -- now for credit card, it was a totally different picture. The reason I mentioned this is because at the savings bank, the subprime unsecured loans and household loans potential risk factors in the savings bank industry, it may have a big impact. And if you look at the relevant data, you will see that for the credit card industry, the platform-linked loans is very minimal at best. And also, if there are potential risk events or if thereâ\u0080\u0099s any borrowers whose credit worthiness is going to be significantly undermined, we actually have a model in place where we could preemptively assess for that and be ready for that. So at the overall group level, delinquency management, we are using AI and machine learning for bank, credit card, capital and savings bank. And also going forward, for all of our project financing sites, for all of the -- not just the KRW 40.3 billion but also highly risky work site, we have categorized them so that we could appropriately manage them. And also when it comes to real estate management, depending on different regions, there are unsold lots, there is potential risk as well as construction company-related risk, contractor-related risk, so we have a risk management regime in place. At the same time, we are also seeing the regulator loan banks perhaps to provide relief to more vulnerable borrowers to prevent their debt servicing burden. And on a yearly basis, compared to the early NIM, you can see in the first half, 11 bps was improved. And because thereâ\u0080\u0099s less demand for household loans, there will be more competition between the banks. When that time comes for the household loans, this will also apply to corporate loans as well, interest rate on household loans is going to go up quite significantly. So by the end of the year, what do you think is going to be the lending rate for the household loans as of the end of this year because according to our estimate, we believe that household interest burden is expected to go up by 50% compared to the previous year. But if you look at BOKâ\u0080\u0099s financial stability report on the mutual finance side, the corporate lending, there are cases where a household basically took out a loan under a corporate name and made investment into property. And if you look at these people, these types of borrowers, more than 50% of these borrowers are banking customers, so there seems to be rising risk from this. And also, you would have a lot of Chinese customers or -- excuse me, or the redundant customers who are taking out their loan as under the name of the household as well as under the name of a corporate. On the household side, end of this year, BOK is saying about 300 basis points and what impact will that have on our lending rates and what type of an impact would that bring. So basically, after 1 year, 80% of our loans will have gone through the repricing. For the bankâ\u0080\u0099s unsecured loans, after about 11-month period, we see a meaningful tick in the delinquency rate. And also for this year as well for the household loans, as our CFO has mentioned, weâ\u0080\u0099ve also set aside this ample amount of provisions for these household loans. If you look at second-tier financial market, our credit card, capital and savings bank, the unsecured loans, the about -- more than 95% are all amortization. So with regards to increases in interest rates, these nonbank affiliates are not going to be impacted by the interest rate hike. But as youâ\u0080\u0099ve mentioned, Mr. , for the mutual financing, there could be some borrowers whoâ\u0080\u0099ve received the loans under an individual and under a corporate. So these borrowers with multiple loans, we very closely manage these people because there we get multiple array of risk profile, based on which we manage these borrowers who hold multiple loans. And I think you can contact me also in person or one-on-one, but in the banking sector, we are -- of all of the banks in Korea, weâ\u0080\u0099ve been very, very rigorous in managing and controlling these borrowers who hold multiple loans."
}