{
    "symbol": "CLVR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 00:07:07",
    "content": " Our gross profit in the fourth quarter of 2022, which included an inventory provision of $0.9 million improved to $0.7 million compared to negative $0.3 million in the year ago period, which included a $3 million inventory provision. Our adjusted gross profit, which excluded the inventory provisions was $1.6 million in the fourth quarter of 2022 compared to $2.7 million in the year ago period. The operating expenses during the fourth quarter were driven by the $23.1 million restructuring charge, primarily related to the wind down of our Portugal operations. Note that operating expenses in the fourth quarter of 2021 include the impact of an $18.5 million noncash goodwill impairment charge, we recorded that quarter related to the acquisition of our Colombian operations in November 2019. Net loss in the year ago quarter included the impact of $18.5 million noncash goodwill impairment charge and to higher noncash share-based compensation expense, inventory provision and noncash interest expense recognized in connection with the conversion feature related to our 2024 convertible note with Catalina LP . Operating expenses in 2022 were $79.4 million compared to $64 million in 2021 and -- the increase was attributable to the $26.9 million restructuring expense that was primarily related to the Portugal wind down as well as the $19 million noncash intangible asset impairment charge we recorded in relation to our Colombian cannabis-related licenses in the third quarter of 2022. As a note for the prior year, operating expenses in 2021 included the impact of the $18.5 million goodwill impairment charge we recorded during the fourth quarter of 2021 related to the acquisition of our Colombian operations. The increase was driven primarily by the $26.9 million restructuring charge we incurred in 2022, along with the $19 million intangible asset impairment charge related to our Colombian cannabis licenses in the third quarter of 2022."
}