{
    "symbol": "KRG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 00:47:06",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Q2 2022 Kite Realty Group Trust Earnings Conference Call. For more information about the factors that can adversely affect the company's results, please see our SEC filings, including our most recent Form 10-K. Today's remarks also include certain non-GAAP financial measures. On the call with me today from Kite Realty Group are Chairman and Chief Executive Officer, John Kite; President and Chief Operating Officer, Tom McGowan; Executive Vice President and Chief Financial Officer, Heath Fear; Senior Vice President and Chief Accounting Officer, Dave Buell; and Senior Vice President, Capital Markets and Investor Relations, Tyler Henshaw. Despite the volatile macro landscape, we refused to get distracted and are attacking the opportunities in front of us with a continued sense of urgency. In fact, one of our core values at KRG is urgency, and we will leverage this mindset to take full advantage of the strong demand for our high-quality real estate. As reported yesterday, KRG generated FFO per share of $0.49, beating consensus estimates by $0.06 and representing a 44% increase per share over the comparable period last year. As set forth on Page 5 of our investor presentation, this massive year-over-year accretion is accompanied by meaningful improvements across every metric that historically correlates to earnings multiples. But suffice to say, we're outperforming both internal and external expectations across the Board. Excluding option renewals, blended cash spreads for comparable new and non-option renewals were 18.7%. For the first half of the year, we leased approximately 2.3 million square feet at a blended cash spread for comparable new and renewal leases of 14.5%. Five-years ago, self-checkout, BOPIS and curbside pickup did not exist in the same capacity as it does today. The structural shift in how open-air retail is utilized by retailers and consumers has resulted in an 18-month period of record low retail bankruptcies, record high leasing volumes and brick-and-mortar sales growth outpacing the growth in e-commerce. During our continuous discussions with retailers, they are making long-term real estate decisions to secure the best physical locations to serve their customer. As a reminder, our signed-not-open pipeline is contractually obligated rent that is scheduled to come online as outlined on Page 9 of our investor presentation. Thus far in 2022, tenants have commenced rent ahead of our internal budget, which is a testament to the intensity and dedication of the KRG platform. In a period where supply chain issues remain prevalent, we're thrilled with our construction and tenant coordination team's ability to deliver spaces on time, coupled with the urgency retailers are showing to open the source. As a reminder, the $41 million of signed-not-open NOI is only a portion of the near-term growth opportunity as shown on Page 8 of our investor presentation. Looking out across our sector, the remaining near-term leasing upside embedded in our portfolio is quite compelling. While our near-term capital outlay is primarily dedicated to leasing, we continue to allocate and raise capital in a measured approach to improve our portfolio. During the second quarter, we sold Plaza Del Lago in Chicago for approximately $59 million at a cap rate that is extremely accretive relative to the assets that we've acquired in 2022. The blended cap rate on our acquisitions this year sits at 5.75%, with unlevered IRRs expected to be in excess of 8%. In addition to our previously announced acquisitions in Dallas and Las Vegas, we acquired Palms Plaza, a 68,000 square foot neighborhood center for $35.8 million. Palms Plaza is an infill location in Boca Raton, Florida, anchored by highly productive specialty grocer, generating approximately $1,300 per square foot in sales. Year-to-date, we've completed $102 million of acquisitions in our target markets and $66 million in dispositions. On the development front, we stabilized two projects this quarter, Shoppes at Quarterfield and One Loudoun Residential. Shoppes at Quarterfield is a 61,000 square foot neighborhood center anchored by Aldi and LA Fitness, which is 100% leased. The One Loudoun Residential project added 378 multifamily units to our exceptional development project in Loudoun County, one of the wealthiest counties in the country. As a company, we now have a financial interest in over 1,600 multifamily units, and we're in discussions with joint venture partners to add up to an additional 1,000 units over the next few years. The One Loudoun apartments are approximately 90% leased, which is outperforming our initial expectations on base rent and absorption, which highlights the multiuse demand at One Loudoun. And with $80 million remaining to spend on our active developments, we are very comfortable with our outstanding capital commitments in relationship to our balance sheet position. As the top five open-air-shopping-center REIT, our increased relevance to our customer is clearly evident in the strong leasing volumes at outsized spreads. In turn, we are adding high-quality tenants and brands to enhance the merchandising mix in our portfolio. Each strategic benefit is operating on the shoulders of a rock-solid balance sheet with our net debt to EBITDA now standing at 5.3x, one of the lowest in the sector. Both internally and externally, we're reticent to bifurcate the two portfolios because they now operate as one. That being said, the extreme accretion associated with the merger was not just a function of the attractive deal terms. Bottom line, across every meaningful metric, the legacy RPAI assets have benefited from the KRG operating platform. For example, for the first 3.5 years prior to KRG's ownership, the legacy RPAI portfolio achieved non-option renewal spreads of 4%. Since the merger closed, non-option renewal spreads have been 13%. Moreover, since we executed the merger, on a year-over-year basis, KRG has increased FFO by 44%, increased our lease percentage by 230 basis points, all the while delivering double-digit blended comparable cash lease spreads and increasing our ABR per square foot by 6%. We've also improved key demographic metrics, including 3-mile average household income up 13% and 3-mile population up 34%. The culmination of all the great things I've just discussed is allowing us to raise our 2022 FFO as adjusted guidance to a range of $1.80 to $1.86, a $0.06 increase per share at the midpoint. We're also raising our 2022 same-property NOI growth assumption to a range of 3.5% to 4.5%, an increase of 1.25% at the midpoint. As always, I'm very proud of the KRG team not only for their results but for their extreme hard work and dedication and competitiveness. Our second quarter results are so compelling, I'm going to skip the cultural introduction and dive right in. For the second quarter, KRG generated $0.49 of FFO per share, both on a NAREIT and on an as-adjusted basis. As compared to NAREIT, our as-adjusted FFO results exclude the positive impact of $1 million of prior period collections. Same-property NOI grew by 3.8% this quarter with 290 basis points of this growth being driven by contractual rent bumps, increased occupancy and an increase in net recoveries. As you may recall, we had budgeted our same-store results to be muted in the second quarter and accelerate to the back half of the year. Due to our continued leasing outperformance, lower levels of bad debt and expense timing, our same-store results this quarter beat our internal budget. Given our same-store guidance was increased to 4% at the midpoint, it is safe to assume that our same-store growth for the balance of the year is expected to be largely in line with what we experienced this quarter. As John noted earlier, we are raising FFO as adjusted guidance by $0.06 at the midpoint to a range of $1.80 to $1.86 per share. The variance from NAREIT FFO is approximately $0.01, which represents $2 million of prior period collections to the second quarter, offset by our estimate of $4 million of nonrecurring merger-related costs. Approximately $0.03 of the increase are attributable to same-property NOI in the form of leasing outperformance, lower bad debt and a higher retention rate. Furthermore, at the midpoint of our FFO as adjusted guidance, we lowered our bad debt assumption to 1% of revenues, which is at the high end of our historical bad debt run rate. Our net debt-to-EBITDA is 5.3x, down from 5.7x last quarter and down from 6.4x from the same period in 2021. Our steady decline in leverage is not only an indication of our commitment to a strong balance sheet position, but evidence of the EBITDA growth we've experienced to date. In addition to record low leverage for KRG, we had two key capital market transactions closed subsequent to quarter end. We increased the borrowing capacity on revolving credit facility to $1.1 billion from $850 million, which is a more appropriate size for the company. We also issued a 7-year $300 million unsecured term loan, which is being used to address 2023 maturities and slots nicely into our maturity ladder. In connection with the loan, we entered into a 3-year swap, which fixes the interest rate at approximately 3.9%. Currently, only 7% of our debt is floating rate. It's important to note that together, these two transactions serve to eliminate our refinancing risk through 2023. Once the volatility has worked its way out of the fixed income space, we look forward to reembracing the public debt markets. Our balance sheet is in a phenomenal position to not only weather any storm, but to also think of as any opportunities that present themselves. So you guys just had -- reported killer spreads, strong lease volumes. It's more of a show-me story, and I think we understood that. So now for the last basically two and two-thirds quarters, we've been a combined company. And we have absolutely shown that, and we've shown that we were -- the thesis behind this, the thesis behind the combination was absolutely correct. So look, that being said, the market when it looks at a show-me, it wants lots of data, and we think we've delivered it. But I think candidly, when you look at the data that we give you, you look at the NAV page, for example, that we put in our sub that not everybody does, which gives you every component, you could simply insert a market cap rate for quality shopping centers such as ours, a market cap rate for high-quality ground leases. And I guarantee you that would spit something out between $26 and $30, let's say. But it's because of the -- it's what I said before, Floris. It's not only a confident group, but it's a very competitive group. So I think that, that will come shortly, but certainly, phenomenal opportunity as we sit here today for investors. And maybe if I can follow up with -- you guys have an incredibly -- probably your strongest balance sheet or financial health that you've had as a public company, at least as far as I can recall. And obviously, the market is in a little bit of a flux right now as people try to grapple with what higher interest rates and potentially higher cap rates could mean. I mean, in terms of specifically looking at opportunities within the markets, I think we've kind of demonstrated our ability to do that pretty effectively just this year. As I mentioned on the call, we sold a couple of properties and bought properties in a very accretive manner. I mean selling -- for example, the property that we sold in Chicago, and I used the word at an extremely accretive cap rate relative to our blended 5.75. That's our focus right now, Floris, because of the disconnect in the equity value, we're going to be smart about it. And the fact that we've been able to buy in Dallas and Las Vegas and now Boca, sell an asset in Chicago, we like that trade. And by the way, as I mentioned on the prepared remarks, buying something in the mid-to high 5 that has a growth trajectory that the ones that we did have, we can still deliver high 7s, 8s IRRs. But when we're looking at capital allocation, let's be clear, we still have a lot to do in terms of lease-up. And it's great because it's just future upside, but we're going to be spending significant capital in the balance of this year and all the way through next year in lease-up. But if you just look at the returns, Floris, like, for example, of all the deals we did this quarter, I think we did like 180, whatever, almost 190 total deals, our return on capital averaged 24%. We've been doing great there as well, and these are super high-quality projects. Thanks John, I can tell from your response, you're clearly passionate about the opportunity at hand. Your line is open. On the lease to occupied spread, it kind of contracted quarter-over-quarter, but your S&O value went up $4 million. No, I just think -- first of all, it's the mix of what's open and what's being signed basically is why that contracted, but the spread came out. Basically, what it's saying, Craig, is that we are starting to ramp up our opening activity, so that's opening at a swifter pace than we're leasing. No, I think the reason we lowered it from 1.25 to 1 is because we've got six months under our belt now. So again, I think it's basically just taking our actual bad debt results and continuing to have a nice conservative outlook for the remaining of the year. Again as John said, with record bankruptcies, Sure, there are some folks on the watch list, but and the watch list is certainly much smaller than it was pre-pandemic. Your line is open. First question, I just want to follow-up on the SNO pipeline, I guess, the leasing backlog. And I'm just curious, given the pipeline, for leasing today in tenant demand today. But I think our cadence of tenants coming in that begin paying rent, that's going to be at a pretty good clip as we - we opened 61% of that SNO number in 2022 and the balance of 2023. So we think it's pretty steady, but - we love the volume, we look the size of the SNO, and we expect to maintain that level. It's moving along extremely well with a group of tremendous tenants, Sephora, Lululemon, just a great lineup. So, we're really on pace in terms of what we're expecting out of that portfolio. Then to the second part of your question of some of the future opportunities we haven't locked that we expect to report on in the next quarter, and we're making progress the Carillon we're making progress at One Loudoun in terms of some of our rezoning activities. But I think for the most part, we're very pleased with where we are, but we're going to probably hold off and provide more information next quarter on a lot of good things happening in that way. One, it looked like net recoveries contributed to same-store growth in the quarter. As occupancy increases, obviously, we'll see net recoveries go up. However, as I mentioned in my remarks, we had some timing in the second quarter is getting pushed into the other quarters, which helped contribute to our outperformance on same-store in the second quarter. Your line is open. Good afternoon, out there Two questions, both sort of tackling something from two different ways. John, the - all the retail calls have been super strong. Absolutely no, Alex, I think, look, no there's a lot of narrative out there, but our performance is our performance. When we look at what's going on in Q3, there's really not anything that we see happening day by day in Q3 that is different than what happened in Q2. And the one great thing about the open-air platform is that we have such a diversity and particularly our platform, I should say. So your specific question about value, I've seen that commentary around value retailers, but look at the value retailers that we're dealing with and the strength of those companies like a TJ or a Ross or Burlington, any of the guys that are in that category are very strong. And as I said on my prepared remarks, they don't make real estate decisions based on short-term environments. So is it possible that over the next few quarters, there would be a crack here or there. Of course, it's possible, but in terms of what we're seeing and what we're hearing every day. I mean, there's absolute demand for the space, which is the friction that's creating the pricing power. But right now, Alex, its - business is continuing to be very strong. So let me ask you from this angle, some of the retailers - I mean, some retailer having great results, great earnings, great prints. Others, it's been on the opposite side as you talk to your compadres' at the tenants at the retailers and especially the ones where they aren't having such good earnings, are they seeing anything different or - I'm just trying to understand and especially as it impacts the stocks, when retailers print bad numbers, everyone goes, oh, sell the landlord. Yes I mean, it's a bit of a second derivative in that regard, right, because there is enough strength and against a backdrop of relatively low supply. So sure, if there is a particular retailer that may have a problem, we, at this point, have others that want the space. I mean anytime in the last year plus, where there's been a well-documented struggling retailer - a retailer we get inbounds, can we review all those spaces that you have with XYZ tenant that continues. Your line is open. Yes, Chris there's, a couple of forms. And then just taking some of our best practices principles like fixed CAM for example, and we're starting to convert a lot of the legacy RPAI leases into fixed CAM. So in general and I mentioned this before, you'll see our NOI margin start to improve. You should see those numbers revert back to historical tight norms, which were sort of 75% on the NOI margin, and high 80s on recovery ratios. With that said, Chris, it's not an overnight game. And then, John, you talked about the sort of diversity of your portfolio, geography, product type, I guess I'm just curious, given the demand, is there one area that you would highlight as being particularly strong, whether it is product type or geography or box size that you say, look, that's where we're killing it? I mean again, I think - look, in the mixture of assets that we have, we have really strong performance across the board. I mean, there's no doubt that in the last couple of quarters, lifestyle and mixed-use assets have generated extremely positive rent growth. By the same token, some of the spreads we've gotten in the box spaces, which are a little more power-oriented have been very, very strong again, lack of supply, strong demand. So I want investors and analysts in particular, to focus on that one - to focus on the fact that these results don't just come. And then, I guess, last follow-up question relates back to the capital allocation question. Just on that alone, should drive your leverage levels down its trading somewhere north of 7% on an implied cap rate. Obviously, when we look at buybacks of stock, we look at that from with a lens of extreme intensity around capital allocation and sources and uses and balance sheet strength. So - and the one thing that Heath mentioned in his call or in his prepared remarks was that literally up until a week ago, we were looking at $500 million of debt maturities, plus or minus in 2023, with having to understand what the solution to that is. So we're, filling that space that takes a lot of capital. And as I said on the call or on the remarks, we're generating 20-plus percent spreads on most of that capital in terms of TIs and lease up. It's definitely something that is a potential, Chris, but we're going to have to - we're focused on leasing up space and generating returns as well. Great, thank you, that's all I have this afternoon. Your line is open. Most of my questions have been answered, but I wanted to focus on the balance sheet a little bit. Heath, next year, you have about $250 million of debt maturing. Yes, so RJ that debt is probably around between 4% and 4.5% remaining for the balance of 2023. And again, as we mentioned, we're looking forward to the bond market Detroit in which case we'd like to be out in the public bond market late this year, early in 2023. The good news is, RJ, and you'll see this disclosed in our Q is that we ended up doing a trade in late December of last year, where we did a forward swap and basically locked in the tenure at 154 basis points. So when we go out to do a new deal, wherever the tenure is, we'll have obviously this great trade. And so we think that we can probably refinance that debt, the new bond issuance, again, taking into account this forward, somewhere around between 4% and 4.25%. And going back to my notes from the announcement of the RPAI merger, certainly wasn't a big hammering point and I don't think you guys spent a lot of time talking about refining RPAI's debt, but - has the higher interest rate environment changed any of your accretion expectations, given obviously the higher debt costs and was - how big a part of the story or thesis was that? Again, over the next several years RJ, it seems like it will be relatively flat. And when we modeled where we thought we'd be issuing debt at when we were analyzing the merger, it was obviously at rates that are lower than they are now. However, I don't think it's moving the accretion needle so materially that we wouldn't have done the transaction. Yes and I would just add to that RJ, definitely has not impacted what the results are going to be from the combination. In fact, as you can see, the NOI growth, the rent growth, the speed of leasing, those things are better than what we projected. And of course, the quality of real estate I really want to hammer home the quality of the real estate is evident in the results. That's a good way of looking at it, yes. All right, that's it from me. Your line is open. You have some leasing capital, some development, maybe seems some buybacks. Anthony, our long-term target is somewhere between 5% and 5.5%. I will say that, obviously, the leasing spend will start to increase as we start to turn on that $41 million of sign-on open. So I wouldn't be surprised to see that leverage level creep up maybe to 5%, 6% or somewhere around that neighborhood toward the end of the year. It's the strength of balance sheet that really allows us to -- as John said, to ignore these -- the growing course of uncertainty and just really focus on operations. We're going to take care of our maturities, and we're just going to keep executing and taking advantage of the current environment. So maybe one more, just we hear all the time concerns about retailers in this environment. I mean, look, at this point, we're not seeing a lot of weakness. I know people want to see it, but we're not seeing it. So I think, to be honest, Anthony, this is opportunistic really. We were so -- unfortunately, COVID was why it happened, but we got back those spaces, and we've released them at really strong spreads. I mean you hear sometimes conversations about fast casual because you have the pressure of cost of goods sold, you have labor. But I think across the board, we're seeing these type of customers not trading down. And I think Chipotle is a great example where you're seeing people stay sticky within their lines and not trading down, which is a great sign for the consumer as well as our customers. We're going to always watch help ratios, which we do as a standard practice. Your line is open. When we look at the quarter, it just happened, Craig, I mean we -- as I said, we did -- a little over 1 million square feet of leasing. And when we look at, as I said, I mean we're basically sitting here in the third quarter. So -- and again, I know that people want some negative news to fit their narrative, but the reality is this is a strong business. We have a lot of choices, and we have fabulous real estate that generates top-tier results for the last two plus quarters. Yes, and just to be a little more specific, we're at 89.3 right now from a small shop occupancy perspective, we're up quarter-over-quarter 80 bps, which was an strong quarter. And the best part of that is we still have 320 basis points to get to a high level mark prior to the pandemic, which shows a lot of growth yet to come. But Craig, we've never been focused on that -- the metric of where the lead percentage is. It's more about what's the quality, what's the cash flow growth we're going to generate out of those deals. So we'll see where it is at year-end, but there's no doubt in the next year, year and half. And of course, a lot of what's going on in the development pipeline right now is vis-Ã -vis the combination of the two companies and what large projects were active underway with the legacy RPI properties. But one of the projects we just did, as Tom mentioned, was the ground-up deal in Port St. Lucie and the Fresh Market deal. And in fact, when you look at the acquisitions that we just did, I would say that certainly, two of the three have significant potential for us to improve and add to -- so I would stay tuned on that. We really appreciate the time, and we look forward to talking to you in person soon. Ladies and gentlemen, this does conclude today's presentation."
}