{
    "symbol": "KRUS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-07 21:17:03",
    "content": " In a single year comparison against our fiscal 2021 third quarter, comparable sales grew by 65.3%. Sales recovery in our California market has been especially pronounced with third quarter comp growth of 95.5%, as compared to our 2021 difference, reflecting the sales impact of dining room restrictions during the previous year. Additionally, our operating expense revenue in the third quarter was $1.3 million or 3.5% of our sales mix. These combined factors have deserted in  operating profit margin of 22.5%, representing 470 basis points of margin expansion relative to the prior year quarter and 210 basis points, as compared to the same period in pre-pandemic fiscal year 2019. For the third quarter, total sales were $38 million, as compared to $18.5 million in the prior year period. As compared to our pre-pandemic results of the fiscal 2019 third quarter, our comparable sales growth was 28.3% with regional comps of 18.2% in California and 40.5% in Texas. Turning to costs, food and beverage costs as a percentage of sales were 29.7%, compared to 31.7% in the prior year quarter, due to pricing taken at the start of the fiscal first and third quarters and higher food spoilage costs in the prior year, partially offset by food cost inflation. Labor and related costs as a percentage of sales increased to 31% from 8.95 in the prior year quarter, due to the lapping of the employee retention credits recognized in the prior year. Excluding the impact of the ERC and retention of new hiring bonuses, labor related costs as a percentage of sales in the prior year quarter would have been 36.6%. Occupancy and related expenses as a percentage of sales improved to 7.1% from 10.2% in the prior year quarter, primarily due to higher sales leverage. Other costs as a percentage of sales decreased to 11.5%, compared to 14.7% in the prior year quarter, due to higher sales leverage as well. As a percentage of sales, general and administrative expenses were 15.5%, compared to 23.2% in the prior year quarter. Restaurant level operating profit as a percentage of sales was 22.5%, compared to restaurant level operating profit as a percentage of sales of 5.8% in the prior year quarter. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}