{
    "symbol": "REG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 15:27:06",
    "content": " Importantly, we're carefully monitoring our portfolio for any signs that these trends are softening, but we remain encouraged by the continued strength and progress we are seeing, leading us to further increase our 2022 same property NOI guidance, excluding prior year collections by 25 basis points to 5.5% at the midpoint. As has been our practice, we have not included any potential fourth quarter conversions in our guidance, but it is possible that we may see another 1% to 2% convert before year end, which could result in an additional straight line rent of $2 million to $3 million on top of what's currently in the 2022 guidance range. We raised our full-year 2022 Nareit FFO range by   at the midpoint   of which was driven by the prior year collections and straight line rent reversals that I just discussed, but most importantly, a large contributor to the increase was also further improvement in core trends, reflected in an increase in Same property NOI growth ex prior-year collections of 25 basis points at the midpoint to a new range of 5.25% to 5.75%. Please proceed with your question. In fact, our unresolved bucket of AR is down to about $5 million and it's largely out west and this has been a theme for us over the last 18 months and we're making â\u0080\u0093 the teams out there are making great progress and we're really happy to see us in the final innings of that. Please proceed with your question. Please proceed with your question. And I think that's evidenced by, if you look at our cash rent spreads for the quarter at 14%, which were obviously strong and if you think about it also in context of space that's been vacant for less than 12 months, we actually were driving 20% cash rent spreads. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}