{
    "symbol": "REG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 16:32:13",
    "content": " You should find that this new disclosure is helpful in making these things more clear and as you can see in the table, the largest positive contributors to second quarter performance where growth in base rent and improvement in current year uncollectible lease income which together added the total 450 basis points to our NOI growth rate while the offsetting factors include the tougher year-over-year comparisons related to prior year reserve collections and expense recoveries detracting a total of 380 basis points from our results. Please proceed with your question. Basically, the total number of transactions was right in line with trailing 12 months as the new leasing volumes and quite frankly rent spreads were very solid as well, but overall the GLA leased, was slightly down for the quarter due to the renewals and it's really the mix between anchors and shops, typically we're about 50-50 mix. But we continue, I think we sound like a broken record, but what the past 2.5 years if that's a long it's been, have really demonstrated and validated is the importance of the neighborhood community shopping center and the retail and service ecosystem and I said and I said we signed a broken record, if you went back and you listen to earnings calls prior to the pandemic and then throughout it, we feel really good about the future of our business. Please proceed with your question. Please proceed with your question. I can't help but just make a quick comment that while we talk about, it is extremely important to get the same but not occupied paying rent and to get back to maybe more stabilized level, I'm very happy if it stays where it is as long as our percent rent paying is also increasing because that means we're doing a lot more new leasing and so that's a good thing. Please proceed with your question. And I'll just reiterate what Jim just talked about with regards to the health of our tenant base, it sounds a little bit contradictory when we say we're coming into this, what may be what may become ever session, if it's not already from a position of strength and that meaning that the tenants that we have in place, the merchants that are in our shopping centers really have survived, I love that Jim says it's separate the wheat from the chaff, like really have survived a really difficult challenging time from a demand standpoint with COVID-19. Please proceed with your question. We don't see that trending materially outside of those bounds, Craig, I would probably point you more towards the upper end of that range at about 11% given the amount of space we have left to lease, it's just going to be a volume business that we probably will spend a little bit more capital, beyond and then to your point on prior year collections, so you got to eliminate the impact of prior year collections from a - to get to more of a core AFFO metric. Please proceed with your question. Please proceed with your question. I think it's really helpful, what it first does is highlights that base rent growth as we've been trying to point people's eyes to is the best line item to look at for the health and forward quality of our earnings stream in the near term and what you see there is yes, 3% growth outside of the noise in the first half of this year, we should do better than that to finish out the year on the base rent line. We've got, it was just a lot of COVID era type of adjustments still moving through really 2021 that are impacting all of the other components of growth, but I think looking forward, I would, my our eyes are focused on base rent growth, the amplified impact of recovery income as you lease up space and raise your commenced occupancy, you're going to amplify that growth by picking up margin on your collections and then we add into that the investment and what we just talked about with Wes and the contribution from redevelopments and you put all that in into the bucket and we feel great about achieving our long-term objectives of 3% or better through redevelopments and in the short term we should do better than that from an occupancy perspective, because we have room to grow rent paying occupancy. Please proceed with your question. I will reiterate again that regardless of the macro backdrop, we feel really confident about the quality of our properties and our going-forward health of our business, we were just re-it - just repeating really what we said in our prepared remarks, we have - we're entering this with a position of strength as we have worked through a lot of dislocation and disruption through the past two years, our operators, our tenants, our merchants are in an extremely healthy position and we believe in. Please proceed with your question. Please proceed with your question. Please proceed with your question. From an operator standpoint, you can walk in a retailer's store and get a pretty good sense of whether they're - whether they're a good retailer not and that's, that's what our folks in the field, do an excellent job of staying close to our, to our tenants and you can read the tea leaves and that's I mean it's hard to put it on paper and give you a metric, but that's how we, that's how we, you have to run your business to be able to stay ahead of that and I think that's one of the, one of the things we do very, very well at the asset manager level is really understanding what's going on behind those tenant doors. Please proceed with your question. So, but we think our numbers are probably in the mid, mid-single digit area, the 5% to 8% range, somewhere in that area, plus or minus, so we've got a little bit of room to run, but we're nearing the end and we'll continue to - we'll continue to make progress as we have,\n And I appreciate the question and the concern for, it's a metric that we have all begun to report, but the important thing to really focus on is bad debt expense because tenants can be a cash basis tenant by paying rent. Please proceed with your question."
}