{
    "symbol": "PAYA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 15:01:03",
    "content": " As a reminder, in any given quarter, the vast majority of our revenue growth comes from the continued penetration of our exceptional partners in durable end markets, principally B2B, not for profit, healthcare and government. This quarter was no exception with growth primarily driven by partners in each of these verticals and bolstered by continued strong retention, which itself is a testament to the value of powerful integrated solutions and Payaâ\u0080\u0099s great customer support in high quality end markets. The combination of Paya is exceptional and more durable end markets along with strong profitability, cash flow duration and balance sheet provide excellent conditions to remain laser focused on quality top and bottom line growth for the medium-term, while also delivering solid short-term results along the way. The â\u0080\u0093 similar story to last quarter, right, weâ\u0080\u0099ve seen really solid growth in our B2B partners, specifically some of the ERP relationships that we have, and those just come at us slightly less favorable revenue share compared to our blended. Your line is open. Your line is open. Your line is open. So fastest ROIs with the investments in sales and marketing support around partner penetration that I was just referring to, for sure, obviously, new product solutions and innovation such as the new gov solutions that we announced this quarter enhanced and streamlined B2B solutions and ERP integrations put that at the longer end and then in the middle sales resources, sales effectiveness. Your line is open. So we feel strongly that in our core vertical end markets, we should always be innovating and whether that innovation is to defend an existing growth rate or accelerate it further obviously the answer is you want both, but we donâ\u0080\u0099t view it as anything other than running a good quality business for the medium-term and being as good as we possibly can be in each of those core vertical end markets. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}