{
    "symbol": "AMED",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:42:47",
    "content": " The significant drivers are the prior year benefit of sequestration leap of $9 million, $5 million additional losses from Contessa, which includes an additional month of operations and two new home health acquisitions in Q2, which added $12 million of revenue and $1 million in losses. On an adjusted basis, total G&A was $182 million or 32.6% of total revenue, up 80 basis points, mainly due to Contessa and our recent home health acquisitions, which added $9 million of G&A. As we move from Q3 to Q4, weâ\u0080\u0099ll see impacts from the normal seasonality items such as an increase in health cost of $5 million to $6 million, our annual rate cycle, which is effective August 1 with an expected impact of $2 million, an increase in compensation costs of $5 million and a drop in hospice ADC driven by higher discharge rates in Q4. To confirm this, we recently commissioned an independent industry analysis performed by McKenzie, and their findings show that between enrollment and utilization recovery and rate, we can expect to see the total spend in home health grow by 6% to 8% annually through 2027 with fee-for-service market returning to a 3% to 5% year-over-year growth. Please proceed with your question. As we think about next year, right, I mean, you threw a few things here, whether it's the improvement in Contessa, G&A cuts of $20 million, some benefit enhancement costs coming â\u0080\u0093 kicking in 2023 and then MA contracts. I think that real number, when you consider Q4, having an extremely our highest health insurance month â\u0080\u0093 quarter, I am sorry, additional holiday in that quarter than we run in the first two, you're probably looking more of a $62 million starting point, annualized that you're getting in that 2.48, 2.50 type of range. Please proceed with your question. So getting paid on an episodic basis by PAC and CareCentrix with the additional upside based on quality outcomes is something we really want to lean into with those as partners and really put â\u0080\u0093 dedicate our capacity to doing more of that business as well as myNEXUS would be higher in volume, more of a traditional per visit rate, but much closer to the Medicare fee-for-service side. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}