{
    "symbol": "AMED",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 17:45:11",
    "content": " Our 2.8% increase in revenue per episode and the decrease in visits per episode were not enough to overcome the impact of Omicon volume and labor pressures resulting in a slight increase in EBITDA and a segment EBITDA was up $7 million, mainly driven by the CMS rate increase and the seasonality related to health insurance expense. So we're looking at models out there, and we hope to have something to announce hopefully pretty soon on a new kind of model that really actually drives us more into Medicare Advantage, wanting to take more of that allows us to our margins on that business and also frees up capacity with our existing clinical staff. And then one thing Scott can walk through is a little bit of the episodic math that we have on home health because we've seen like a 9% increase in our cost per visit, but it hasn't translated in a 9% increase in our cost per episode. And in our math today, if you look at just kind of our numbers and I'm using -- if you want to recheck my math, we're doing Mattheisen clinician cost per visit as Chris said, that's up about 9% with a 0.9% decline in the VPE that really brings that total cost per episode down about a 2% level, which, certainly, that's a manageable number. I think we've said before that first half revenue would come in around 20% in the first half and 80% of that number in the second half -- or I'm sorry, that's kind of where we think today. So from the plan's perspective, it's still staying more around the high acuity type of care of identifying patients that could -- that would normally land in a hospital and having them care for in the home or in staff than them care for in a home, but now it's starting to evolve more into also being able to work plans to identify patients who can receive levels of care in the home that can help prevent those hospitalizations. What we're seeing out there is the operating environment is challenging, but the good solid operators and the companies out there that have kind of are focusing on the right things, I think we'll still be able to navigate through some of this chop and actually take advantage of some of the less kind of sophisticated or operationally sound businesses out there and market share as the taking right now. And -- but also what we saw that come from that was higher LUPA rates a little bit lower -- in higher loss billing periods, which actually drove down our revenue per episode, and we missed kind of our internal target by about $42 an episode, which actually cost us about $3 million top line. While we do see now in some of our other kind of relationships out there is that what we have agreements in place, about 25% of our per visit Medicare Advantage business out there today is -- has some sort of upside opportunity based on hospitalization rates and outcomes for the patients. So we see that as a good sign of both sides wanting to have a kind of a partnership, but we still got -- we've got to change the game to really make the economic model work because it's a significant discount on the per visit side, and is just not going to create an environment to where we -- when we have limited clinical capacity that we're going to aggressively want to go out and take more of that business. That's -- I would say I just called it out, just to remind people, as you look at the numbers and where the -- if you're thinking through just kind of some of our cost to visit moves, that's a typical move from Q1 to Q2. I would say that we would -- if you think about that using our visit numbers at roughly about 1.7 million visits a quarter, we're going to -- our utilization is 4.3% of that right now."
}