{
    "symbol": "AMED",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 17:10:03",
    "content": " To quantify how impactful discharge has been to our performance, had discharge rates mirrored 2019 experience, year-to-date June ADC would have been 874 higher, resulting in an additional $29 million in revenue and $20 million in EBITDA for the Hospice segment. For the second quarter of 2022 on a GAAP basis, we delivered net income of $0.91 per diluted share on $558 million in revenue, a revenue decrease of $6 million or 1% compared to the second quarter of 2021. In Home Health, revenue was $349 million, down $1 million from prior year, which includes $14 million from our Q2 acquisitions and a $4 million impact related to sequestration. On an adjusted basis, total G&A was $182 million or 32.2% of total revenue, up 150 basis points, mainly due to Contessa and our recent Home Health acquisitions, which added $9 million and $4 million in additional G&A, respectively. As we move from Q2 to Q3, we will see impacts from the normal seasonality items such as an increase in health costs of $3 million to $4 million; our annual rate cycle, which is effective August 1, with an expected impact of $5 million; 1 additional holiday totaling $2 million. I would say we're still in that kind of 25% to 30% with some decent movement on the -- we'd like to see the rate get better, but it's moving that way. And now on the Home Health side, it's really kind of driving a little bit of a pivot in strategy for us, is that how do we lean into Medicare Advantage in a way that it is not a vendor-payer relationship, it's more of a partner relationship so that we can have kind of the economics as well as the dynamics that make us want to take more of that business and drive more volume and utilize our capacity more towards that business, at the same time, drive up quality and drive value proposition for the plans. We're seeing softness in utilization on Medicare fee-for-service for Home Health, but we're also seeing record demand from Medicare Advantage, which actually drives lower top line opportunity but -- growth opportunity but it's going to be impacting the top line. We have data that shows that even in that Medicare fee-for-service population, utilization of home health has declined from 8.8% of members using home health in the course of a year in 2019 to 8.1% in 2021 and still looks like it's declining further today. Normally, we see about a $5 million decline from Q2 to Q3 when you take out some of the COVID years that were abnormal, and that's driven by we give raises in Q3, we have higher health costs in Q3 and there's an extra holiday. That's about 10% of our total Home Health revenue that we're looking at today, would be under these unique new payment arrangements. We have contracts on the table that we're trying to get executed with plans that comprise 60% of that 20% that will be paid in a more of a per case -- case rate basis versus a per visit basis where we'll see opportunity for market expansion and margin expansion as well as organic growth because as we unlock additional clinical capacity, we're turning away a lot of business in that space today. We -- our strategy is leveraging our 1,300 sales reps that basically spend time in the physicians' offices and the referral sources' offices multiple times a day, every day to kind of, number one, remind them that this is -- only during the PHE is this allowed to be virtual and that it's going to have to be done in a physical format and then also educating our referrals and really starting to encourage physical face-to-faces today versus virtual so that we're moving into it a little bit to the extent that we can."
}