{
    "symbol": "EMN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 14:58:03",
    "content": " If we just use the -- where raw materials have already come down in VAM, PVOH and PX for the first quarter of this year and think about the energy off of the natural gas forward curve for the year, that's actually quite a bit more spread tailwind than what we would have thought last year of that $100 million because of the higher altitude. But as you look at the guidance we gave you for the year, given the outlook for the first quarter, I think it's appropriate to sort of look at the lower half of that guidance for how we're going to perform until we get past this quarter and have more insight on all these factors. So that's allowed us to get quite a bit of price up last year, so already good momentum, seeing some of that benefit already in the fourth quarter of last year that indicated the trajectory we're on for this year. So getting rid of all that market tightness, which is where sort of VAM and PVOH prices have now gone to some degree, I think there's still more coming down, but we're just using where we are today for this quarter and how we project spread improvement versus last year. And from what we can see so far, we think they will get this under control mostly by the end of this first quarter, and then you've got a big step up in demand when the destocking is over to sort of lower demand than what is normal but still a lot better than 40% down, and that's part of the step-up in earnings for Advanced Materials as you move into the second quarter. On the auto side, demand, we're being, I think, conservative probably a little bit more conservative than what the consultants would say about demand being slightly down in the fourth quarter -- in the first quarter and not improving much for the year. I also think we've demonstrated even back to the COVID environment that we also leverage a pretty variable cost structure when it comes to leveraging overtime contractors, and we're already taking the actions at the end of the year, starting in Q1 to change that cost structure to the current demand levels. That's another way to sort of think about how we get to sort of flat EPS, including pension is those specialty businesses have to offset basically inflation this year and growth relative to last year. So I would highlight as you think about the start-up, we're talking about roughly $35 million, including, I'll call it, the depreciation as it starts up in the back half of the year. But when you look at the upside in our stock, as you get through this, not just for circular, but for just market recovery, there's a huge mix upside for our company as you go into the back half of this year in '24 when you think recovery is coming, which we demonstrated coming out of 2020."
}