{
    "symbol": "VTOL",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-05 22:45:34",
    "content": " EBITDA adjusted to exclude special items, asset dispositions and foreign exchange gains was $33.9 million for the second quarter of fiscal year 2023 compared to $37.1 million in the first quarter or a decrease of approximately $3 million. We anticipate revenues to be in the range of $1.15 billion to $1.275 billion with an adjusted EBITDA, excluding asset dispositions and foreign exchange, of $148 million to $160 million when using an average pound to the U.S. dollar exchange rate of 1.16. For example, each GBP 0.01 movement in the British pound to U.S. dollar exchange rate will impact projected calendar year 2023 adjusted EBITDA by approximately $1.5 million. In addition, if we were to apply the average exchange rate for the British pound, the U.S. dollar in the last 12 months to the projected results for calendar year 2023, the adjusted EBITDA guidance range would be $158 million to $175 million. So in our projections, we're not necessarily referencing a specific price deck for oil, but more spending plans that we anticipate coming from our customers and some projects that we see in their pipeline, which we believe will be mostly disconnected from near-term volatility in the spot price because, again, we think the major issue is a medium- to long-term supply challenge as the global excess capacity for oil production is expected to be less than 2% of total global demand as we close out this year. We think that Bristow, as the global leader in vertical flight solutions, has a good opportunity to benefit from these new aircraft and incorporate them into existing operations for customers as well as use them in new market opportunities to expand the services that we're providing both to our current customer base as well as a new class of customer. And that there needs to be planning involved, if we're going to bring, for example, some idle S-92s back into operation that will take time and cost, and that cost will need to be born clearly by the customer as well as the fact that as we think about future growth, whether it be for government contracts or oil and gas, once all of the existing equipment is absorbed, that will eventually require new orders, which we don't really see a backlog for at the moment, but that will come."
}