{
    "symbol": "MAA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 17:06:02",
    "content": " Leasing traffic or leads were up 11% in the second quarter as compared to prior year generating a 7% jump in lease applications, new move-ins during the quarter from households migrating into our Sunbelt footprint increased slightly from last year and drove 15% of our new move-ins. The outperformance virtually all came from property revenues and stronger than projected rental pricing trends continued through the quarter, which produced a strong 17.2% increase in blended lease pricing for the quarter even as more challenging prior year comparisons began to grow late in the quarter. This increase is essentially all the result of higher revenue growth, strong price intends continued through the second quarter, as we mentioned, we're now projecting a 125 basis points increase in our effective rent growth expectation for the year to 13.25% at the midpoint. As mentioned, we also increased the expected growth rate for same-store operating expenses for the full year by 100 basis points at the midpoint of our range, now 6.5% to 7.5% for the full year, primarily reflecting the pressure in repair and maintenance costs as well as real estate taxes. So If you think about the forecast that we laid out there in the 8% back half of the year, blended lease-over-lease that comes out to about somewhere 12%, 12.5% blended lease-over-lease is what we're expecting for full year 2022. The migration trends that we've talked about over the last couple of years, of course, they were evident there prior to COVID and move-ins from outside the Sunbelt into our footprint prior to COVID, we're running somewhere around 9%. Yes, I mean we certainly -- in going back to last year, the third and fourth quarters Rob has talked about where the -- when you're leasing the tip of the spear was 15% in the third quarter and 16% blended pricing in the fourth quarter. I mean, obviously, the 9% to 15% metrics that you were talking about and sort of the move in traffic that we're seeing from outside the Sunbelt into our markets, it's only based on what we are actually seeing at our properties. I mean, certainly, as we talked about, as Eric mentioned, 8% over the back half of the year, there is a little bit lower expectation for the fourth quarter because that's 1 of the seasonality that we talked about would kind of begin because of the holiday season. So -- but in general, what we've built on is renewals continue to be the strongest I would say, in double digits, probably lower double digits, likely in that range with new leasing, which tends to feel the most pressure of probably both comps as well as certainly seasonality being in single digit by mid-single-digit range, and that's sort of the estimate for the back half of the year that you can roll in."
}