{
    "symbol": "MAA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 13:05:17",
    "content": " But as a consequence of the many enhancements we've made over the past few years to the portfolio mix, to the operating platform, to the balance sheet and to our external growth capabilities, we're excited to now also see MAA's ability to post strong relative performance during recovery and the up parts of the market cycle. Blended lease-over-lease pricing achieved during the quarter was up 16.8% as a result, all in-place rents or effective rent growth increased 12.4% on a year-over-year basis and 2.6% from the prior quarter. This increase is essentially all produced by higher revenue growth expectations as projected to continued strong pricing trends produce a 200 basis points increase in our effective rent growth, our expectation for the year to 12% at the midpoint compared to 10% in our prior guidance and 5.2% for the prior year performance. However, it's worth to note, this increase is more than offset by the revenue growth trends, which produced a revised same-store NOI expectation of 13.5% for the full year, which is  above our prior guidance. So I'm just trying to understand if this is a trend that you think you can -- that can persist for some time, or if there's been just now to the point where you're receiving some pushback on the renewal pricing and that may ultimately lead to need to, I guess, bring those down as we move through the year. So I think the fact that we're carrying the sort of renewal rates that we are and the new lease rates that we are through the last 6 months of the fall and winter heading into now, the more robust part of the year, I'm feeling pretty good about the trends that we're seeing. I think what we saw was we had always expected going back to when we gave guidance at the beginning of the year that we would have strength in the first quarter and begin to move into a situation where we have prior comp -- strong prior comps as well as the fourth quarter, some normal seasonal trends impact us that we didn't have last year. We do continue to have in the back half moving to a mid-single-digit kind of growth based on those prior year comps and that fourth quarter season we talked about, which is still strong on a relative basis in terms of years past, outside of the COVID period with that's still built into our -- we think we can do that, and we'll just have to see what performance is. And so if you look at the trends in our pricing over the last several quarters, go back to 2021 and started the year lending pricing at 2.7% and went to 8%, 8% to 15%, 16% in the third and fourth quarter, and then we put another 16.8% up in the first quarter this year. So I think what we're -- though we expect our blended pricing to be impacted by the trends this year, both prior year comps and the seasonal trends we talked about, that strength that we put in for the last several quarters is going to play out for another few quarters. Obviously, what we've projected as a strong second quarter continuing because we started off and so we started off, Tom talked about that's coming in, in the third quarter a good bit just because that's where the really -- if you go back to last year, that's when pricing really accelerated when we took off."
}