{
    "symbol": "MAA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 18:40:02",
    "content": " We also narrowed the expected range for same-store operating expenses for the full year, effectively increasing the midpoint by 25 basis points from last year's guidance -- from last quarter's guidance, excuse me, primarily reflecting the pressure from real estate taxes that I mentioned earlier. Your line is open. Your line is open. I think last quarter -- last two quarters, you kind of started your comments by saying you expect given the favorable demand trends that rent growth or same-store top line trends will continue to be nicely above trend for, I don't know if it was like 2023 or the foreseeable future. As Tim alluded to, based on where we sit today, we think the earn-in to next year based on the rent trajectories that we've captured over the last number of months is baked in next year is going to be 6% and then you start to think about what sort of market rent growth we're going to get on top of that next year. And as we sit here today and think about the drivers of demand surrounding the employment markets, the stress of single-family affordability and these net continued positive migration trends that we see across our markets, we continue to see an expectation lease I have a positive rent growth next year on top of the earn-in that we're getting. Your line is open. So, I don't think that -- we're not sitting here today looking at numbers that suggest to us that we're going to see a big lift in the supply deliveries next year relative to what we've been experiencing for the last year or two, particularly last year or 2022, I should say. So we -- because of some of the challenges that we've seen with construction labor and materials and permitting and all that goes into predevelopment, we're just -- we just don't see supply likely picking up, broadly speaking, in a huge way next year in 2023 as compared to what we've experienced in 2022. Your line is open. And we think that with our development pipeline headed towards $700 billion of active construction with emerging opportunities surrounding acquisitions that we think are likely to pick up more so next year, it puts us in a position to put together fairly meaningful levels of external growth that we think we can capture just through those processes that we have without the need to go out and do something more strategic in nature. Your line is open. Your line is open. Your line is open. Yes, this is Brad. Your line is open. The areas we're actually doing some unit interior renovates this year and the ones we're looking at for next year, it's actually a little bit wider debt kind of in that 25% to 27% range on the comps we're looking at. Your line is open. Your line is open. Your line is open. Your line is open. Really, in the -- from the underwriting perspective because of the seasonality we're seeing that didn't see earlier this year, I suspect when they go back in at this point, and get construction cost price updates they may not increase quite as much as they have been, but their rent growth when they update those at this point is showing seasonality. Your line is open. Your line is open. Your line is open. Yes, this is Brad."
}