{
    "symbol": "ASGN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 12:34:04",
    "content": " Revenues for the second quarter surpassed the high end of our guidance range and totaled $1.1 billion, up 17.1% year-over-year and up 4.7% sequentially, driven by the continued strength of our Commercial segment as well as growth in our Federal Government segment despite a difficult year-over-year comparable. Our Commercial segment had another very strong quarter with revenues of $850.6 million, an increase of 19.4% over Q2 of last year with strong growth in both IT staffing and consulting services. Apex Systems, our largest division, accounted for 83.1% of this segment's revenues for the quarter with top and retail accounts both achieving double-digit growth rates. Gross margin for the Commercial segment was 33.1%, up 110 basis points from the prior year, driven by our growing contribution of high-margin commercial consulting, creative digital marketing and permanent placement businesses. For the quarter, commercial consulting revenues totaled $222.2 million, an increase of 53.9% year-over-year. We had a particularly strong quarter for commercial consulting new bookings, which totaled $340.6 million, up 56.5% year-over-year. Revenues for the quarter totaled $291.2 million, an increase of 11% year-over-year, driven by a combination of organic growth and the impact of businesses we acquired in 2021. Gross and adjusted EBITDA margins were also up for the quarter related to improvements in the Federal Government segment's business mix, including a smaller contribution of cost reimbursable contracts, which carry lower margin than other contract types, as compared to the prior year and the contribution from the higher-margin businesses we acquired in 2021. For the quarter, revenues were $1.1 billion, up 17.1% year-over-year on a reported basis and 13.4% organically, which adjusts for the $36.3 million contribution from acquired businesses. Revenues for the quarter included $27.5 million from acquired businesses, and revenues for the second quarter of last year included $11.8 million from a low-margin web services resale program that the segment chose not to renew in Q3 of last year. These estimates are based on current production trends, assume 64 billable days in the quarter and include an estimated revenue contribution of $35.1 million from the recent acquisition of GlideFast and the 2 federal consulting acquisitions made in the second half of last year. The expansion in margin is driven by a higher mix of commercial consulting, creative digital marketing and permanent placement revenues, partially offset by investments in our operating platform to support high, sustainable growth in the business."
}