{
    "symbol": "QSI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 23:06:12",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Quantum-Si First 2022 Earnings Call. I would now like to turn the conference over to Juan Avendano, Head of Investor Relations for Quantum-Si. Today, after market close, Quantum-Si released financial results for the first quarter ending March 31, 2022. Joining me today are Dr. Jonathan Rothberg, Interim Chief Executive Officer; Patrick Schneider, our newly appointed President and Chief Operating Officer; and Claudia Drayton, Chief Financial Officer. Before we begin, I'd like to remind you that management will be making certain forward-looking statements within the meaning of federal securities laws. For a more complete list and description of risk factors, please see the company's filings made with the Securities and Exchange Commission. This conference call contains time-sensitive information that is accurate only as of the live broadcast today, May 9, 2022. During this call, we will also be referring to certain financial measures that are now prepared in accordance with U.S. generally accepted accounting principles, or GAAP, including adjusted EBITDA. In today's call, we will provide our business update and present our first quarter financial performance and outlook for 2022. We believe that digital massively parallel, single molecule protein sequencing will revolutionize life science research and healthcare. As our search continues, we're looking for an individual who has a deep understanding of technology. Our proven track record launching complex life science tools and the velocity, tenacity and charisma to make Quantum-Si a commercial and financial success. As interim CEO, I have been motivated by Quantum-Si team's commitment to our mission. And now even more confident that we have the right people, technical capabilities and resources to not only pioneer, but also own the fork in history we create with next generation protein sequencing. While I have loved leading the day-to-day operations of Quantum-Si and have been able to truly appreciate and help advance our technology, I am very excited to announce I have a new partner to raise the probability of our success. I would now like to introduce Patrick Schneider, our new President and Chief Operating Officer. During my past appointments, I led the acquisition, privatization and market introduction of many new technologies from Benchtop Flow Cytometry to ultra sensitive single molecule counting proteomics instruments and kits. All of these have had a common thread, instruments with reagents and software working in concert to deliver in a unique way, solutions to some of the most challenging problems in research and drug development. I emphasize productization because a big challenge for any technology company is to transition their technology into a product, introduce it to the market, and drive adoption. It has the potential to unlock a deeper understanding of the proteome, which is the collection of proteins and their variations that are associated with health and disease. Next-gen DNA sequencing fueled new understandings in genomics, and gave scientists insights into what might happen to an individual during their lifetime. The promise of next-gen protein sequencing is to tell scientists and ultimately clinicians, what is happening now. Proteins turning on or off, increasing or decreasing in their levels of expression, and importantly, being modified in ways that drive all of life processes from conception to death and have a profound impact on health. On average, it takes 10 to 12 years and an estimated $1.3 billion spent per drug develop. And about half of the approved drugs in the last several years are not first in class, which means no new or unique mechanisms of action. In order to develop better drugs faster, we need to find new mechanisms of action, we need to find new proteins to target. I'm excited about Quantum-Si's technology to bring the power and scalability of a semiconductor chip technology to this field, Moore's law, and help answer questions in proteomics that have been too difficult or expensive to answer using past approaches. I work closely with Dr. Jonathan Rothberg and the rest of the team as we build a dynamic, transformative company. Patrick, the team and I focused on launching in the second half of this year. I continue to be encouraged that continued progress, like we saw this quarter, will enable us to go from being committed to launch to all systems go for launch. On the operations front, we're executing well on our supply chain readiness. As a reminder, this is a chip assembly and packaging facility that we brought in-house to the acquisition of Majelac Technologies in Q4 of last year. In addition, we are preparing to launch our library prep and protein sequencing consumables by working closely with multiple reagents, vendors and placing advanced orders for key components. And I'm heartened to have both a great internal team as well as a group of vendors, we are confident in. To be successful, we understand we must fit into how people work today. To this end, we recently released an application note demonstrating the use of Quantum-Si's platinum sequencer to interrogate variants and beta-amyloid approaching of key pathological and clinical significance in the progression of Alzheimer's disease. Information on our products, technology and applications can be found in the newly created resources page on the Quantum-Si website. In addition to these initiatives, we continue to support our early access partners as they validate system performance and prepare to initiate their own research projects. Let's discuss the details of our Q1, 2022 financial performance. The increase in R&D expenses was primarily driven by the increased number of employees, including stock based compensation expense and product development activities. Selling, general and administrative expenses in the first quarter of 2022 were $8.4 million compared to $3.8 million in the first quarter of 2021. In aggregate, total operating expenses in the first quarter of 2022 were $27.1 million compared to $11.8 million in the first quarter of 2021. As of March 31, 2022, we had $434.8 million in cash, cash equivalents and marketable securities. Finally, we expect GAAP operating expenses to grow within the range of 70% to 80% in 2022. In summary, I'm excited to pass the day-to-day operational leadership of the gifted operations, commercial, research, technology, and software teams to Patrick, our new President and COO. I'm focused on driving the company strategy and identifying exciting projects to evangelize and bring to the world of technology that will transform life science research and ultimately, help save the life of someone you love. We've made substantial progress towards launching the world's first massively parallel, next generation protein sequencing system. I heard the commentary, but just wanting to know if it's continuing to grow to this day, I guess. And a good way to frame that might be talking about like how many of the, I guess 500 plus leads that you want to basically convert in the first maybe year or so post launch. And we watched oncology drive DNA sequencing, which makes sense, because cancer is a disease of genome. But as a general rule, we're seeing the 10s of 1000s of labs that adopted next generation sequencing are now ready to answer questions at the protein level. Now, there's a moment where they want to access proteins, but it's slow and cumbersome with mass spec, which either needs a core facility or intensive experiments, and half a million dollars plus of capital. So interest continues to be driven, because we're behind a huge wave of organizations moving from DNA analysis and now seeing that the next step in all of their projects, whether it's drug development, or biomarkers are focused on understanding the protein problems that their DNA work has elucidated. The other competing technologies are analog and people are realizing it's not about whether your protein is there, which you can do by analog technologies, but it's how that protein is being modified. So those 25,000 proteins can be modified in over a million different ways. So right now it's really about the world shifting from studying genes from using RNA as a surrogate for proteins and having an urgent need, especially with COVID and immunobiology to understand proteins. I know you're obviously bound by Khoisan, but I did just like what application projects are you confident that this QM chip will allow users to conductor in these early stages of commercialization. But again, now that you've confirmed the density of the chip, you can kind of like now drill down on these applications that you're looking at. And again, I'm drawing on analogies with next generation sequencing. And right now, at launch, the ideal match for us as people who are focused on 5 to 50 proteins, over three to four orders of magnitude in terms of concentration range and these can be questions from blood, from cerebral spinal fluid coming off your chromatography columns, but in most cases, they're panels of proteins. For example, if you're interested in cancer drug development, you work on the mTOR pathway, you want to pull down those 50 proteins and see if there are new proteins, or modifications of the proteins. So very targeted, and I look at the company as two Venn diagrams, or two circles of a Venn diagram coming together; what the world wants to do in proteomics and what we want to do; all comers any problem, throw it on the chip and get an answer. But I can tell you, in the same way, that when we worked on next generation sequencing, the people who framed questions, got great grants, got famous, discovered new biology, like small RNAs and the same thing is going to happen now. Because we can see single molecule modifications that no one else can see, often there are fragments of protein that fly the wrong direction . So people who ask focus problem, whether they're an aging, immunology, or COVID, will be able to get answers that will transform their work in terms of biomarkers, or drug mechanism of action. Again, general protein sequencing. But you want focus problems, where you have 5 to 50 proteins and this translates into the use of those 2 million wells, and in the same way next generation sequencing at first, was driven by  distribution. So we'll be happy when you get 200,000 to 600,000 reads, giving you great statistics on 5 to 50, or 100 proteins over that three to four magnitude of concentration difference. So focus problems and I promise you, investigators working with us will get famous, will get grants, will get drugs and biomarkers that absolutely will save the life of somebody you loved. Just sticking with kind of applications or capabilities, actually, and just thinking about like post translational modifications PTM. So when you do DNA sequencing, you have to have a platform that can distinguish four thing A, C, G, T. We have a platform that can distinguish 20 plus things, because we're watching the kinetics of our binding events. And so why I have confidence is we can see a single atom, a single oxygen change on the Methionine, amino acid, when it's next to one of our recognizers, that what this means is when we first start, we will have trained the system to recognize the most common and most important post translational modifications which are  formulations of tyrosine  and potentially common . However, when you look at post translational modifications, you realize that there may be as many as 50 types of modifications. And so what we'll be able to tell people with confidence is often will see those modifications but until we have a proof, or a truth set, that you may follow up with mass spec will be able to tell you by the way, you have an important modification in this sample versus that sample. So I have confidence, we'll see the modifications and competence together over the next few months, we'll start training the systems to understand more. Again, 25,000 genes code for protein, but probably over a million proteoforms, we'll be able to see those proteoforms, while analog technologies cannot, because you can't have a million different reagents. But we're able to do for common phosphorylations, or common modifications. And it's not only single molecule, but literally examples of single atom modifications. Again, can't answer all problems day one, just like you couldn't with DNA sequencing. But we have Moore's law and investigators that focus on key differences in samples that have enrich those samples, for 10s of 100s of proteins are going to make biomarkers and drug discoveries that will be profound and unaccessible, real dark matter for other technologies. For us to hit the ground running, we need to obviously understand and really place the technology with the key applications in that Venn diagram that Jonathan was talking about. And so in doing so, certainly training the sales team around those technology, application areas, but also working closely with the customers as well as we're driving adoption of the technology. One of the things that we also need to do is target, for example, academic researchers, as well as pharma and biotech and they'll have different needs. For example, in academic research, you'll be able to develop more closely with the researcher, particular application and application areas. One of the things that we're doing from a commercial market development perspective is we'll be announcing soon that will attend some trade shows in the last half of the year, generating more and more interest, and, of course, more and more leads. And so a lot of activity will be happening throughout the year in terms of getting us ready for commercial launch, getting our sales organization ready, and also working closely with customers. I hate to say it, but we're all like the people who hoarded toilet paper in the beginning of the pandemic. So we're working closely with our suppliers to make sure we don't just have the parts, but we're actually having them deliver now fully assembled units. But it has been a huge labor, and it's been going on for the last 15 months. Okay, that's fair, encouraging though, to say the least. That concludes the Quantum-Si Q1, 2022 earnings call."
}