{
    "symbol": "QSI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 11:20:06",
    "content": " Earlier today, Quantum-Si released financial results for the fourth quarter and fiscal year ended December 31, 2022. Joining me today are Jeff Hawkins, Chief Executive Officer; Patrick Schneider, Chief Operating Officer; and Claudia Drayton, Chief Financial Officer. This conference call contains time-sensitive information that is accurate only as of the live broadcast today, March 6, 2023, except as required by law, the Company disclaims any intention or obligation to update or revise any forward-looking statements. During this call, we will also be referring to certain financial measures that are now prepared in accordance to U.S. generally accepted accounting principles or GAAP, including adjusted EBITDA. In today's call, we will provide a business update, present our fourth quarter and fiscal year 2022 financial performance and provide an outlook for 2023. We achieved several major milestones during the year to name a few; on the research and development front, we accelerated our product development efforts and successfully demonstrated the ability to recognize 15 out of the 20 amino acids. This represents a path to more than 70% coverage of the Human Proteome identification of up to 90% of proteins, as well as a greater understanding of protein sequence variation and post-translational modifications. As a reminder, Quantum-Si's next-generation single molecule protein sequencing features our proprietary time domain sequencing method that allows us to sequence peptides at the amino acid level in a massively parallel fashion using a semiconductor chip. On the supply chain front, we work closely with our suppliers and contract manufacturers to build up the supply of instruments, ships, and reagent kits in support of internal product development needs and commercial launch. In addition, we successfully completed technology transfer and capacity increase activities at our chip assembly and packaging facility in Garnet Valley, Pennsylvania. On the commercial front, we increased our marketing efforts, including exhibiting our products at several industry trade shows in the fourth quarter of last year. Furthermore, and most notably, we concluded 2022 with the commercial launch of Platinum, the world's first next-generation single molecule protein sequencing system for research use only. Last year, we proactively implemented several cost rationalization initiatives that resulted in annual gap operating expenses increasing 28% year-over-year. 2022 was a landmark year for Quantum-Si, but as I look forward to this year, I believe 2023 will be an even more significant year for the Company. As I mentioned in our previous earnings call, one of the reasons I joined Quantum-Si is because I am passionate about new technologies and enjoy the challenges of building companies and creating new markets. To guide our execution through the year, Quantum-Si has established three corporate priorities for 2023. In addition, as part of our product roadmap, we are on track to launch Carbon our automated sample prep instrument later this year. As Patrick will comment on later in the call, we continue to push forward with our research and development activities and more optimistic about our ability to further improve the industry leading proteome coverage capability of our technology in 2023. Claudia will share more details during the review of our financial results, but I am glad to report that, we now project our current cash position supporting our operations into 2026. I would now like to turn the call over to Patrick, our President and Chief Operating Officer to discuss additional business updates. We continue to advance our amino acid recognizer systems, given this, we are well-positioned to increase proteome coverage capabilities of our technology in 2023. As a reminder, by proteome, we mean not only the 20,000 canonical proteins but also the millions of proteoform including post-translational modifications. That being said, we expect improvements to our Quantum-Si Cloud Analytics to be continuous in nature in order to address ongoing customer feedback from the commercial rollout. Earlier this year, we announced that we entered into a partnership and a licensing agreement with Biovista, an AI-driven bioscience firm to integrate Biovista's visit database and visualization technology tool into Quantum-Si's cloud analytics and help to advance proteomics research biomarker discovery and drug development applications. At the same time, we announced a partnership with Aviva Systems Biology, a leading provider of antibody protein and immunoassay reagent products to co-develop sample preparation kits for protein sequencing research workflows with Platinum, including targeted proteoform analysis. Staying on the subject of protein sample prep, we are on track to launch Carbon, our automated sample prep instrument in 2023. On the supply chain front, we remain confident in our supply chain and our ability to support both internal product development needs and external customer demand across instruments and sequencing consumables. In addition, in preparation for the Carbon launch later this year, we're scaling up production and transfer the manufacturing of Carbon consumables to our facility in Garnet Valley, Pennsylvania. Moving on to commercialization, as previously disclosed, we've shifted instruments to our first set of customers. On one hand, we're seeing customers who want to be first explored and tinker with the technology. As mentioned in Investor Conference earlier this year, in order to advance these interested folks through the sales process, we're offering a proof-of-concept testing service through which they can send us two or three samples, and we can process those samples and show them data for a modest fee. If we succeed, we would expect them to buy and in-source the technology, but we want to make it clear that we don't intend to run a high volume testing service business. So far as the majority of the demand has been from inbound activity, and this is sufficient to support our internal projections for the first half of the year. In the second half of the year, we plan to increase our outbound sales and marketing activities. Selling, general and administrative expenses in the fourth quarter of 2022 were $11.2 million compared to $13.4 million in the fourth quarter of 2021. The decrease was primarily the result of lower stock-based compensation expense associated with the business combination that took place last year, a reduction in consulting services, insurance and other professional fees, partially offset by an increase in compensation costs as a result of higher headcount. In aggregate, total operating expenses in the fourth quarter of 2022 were $38.8 million compared to $27.8 million in the fourth quarter of 2021. As of December 31, 2022, we had $351.3 million in cash and cash equivalents and investments in marketable securities. As previously disclosed at an investor conference earlier this year, we began shipping orders of Platinum in Q1 2023. That being said, given the early stage of commercialization, we do not plan on providing revenue guidance until we have a few quarters of commercial activity under our belt. With regards to operating expenses, we continue to increase our efforts to optimize costs and improve efficiencies, despite ongoing investments in R&D and higher investment needs and commercialization activities. As Jeff mentioned earlier, preserving our financial strength is one of our three corporate priorities for 2023. To this end, we expect non-GAAP operating expenses to be approximately flat in 2023 relative to the prior year. In addition, thanks to our cost improvement initiative, we now project that our current cash position can support our operations into the year 2026. The launch of Platinum is an important milestone and turning point not only for Quantum-Si, but also for the industry as we believe that our unique ability to sequence amino acids and characterize proteoforms and post-translational modifications can lead to novel proteomic insights, better diagnostics, improved drug development and truly transform the future of healthcare. So in terms of the current order volume, I was wondering if you could provide some background on that, and additionally, if you could provide any color on the number of Platinums you expect to ship or will be shipped in 2023 as well as just some more color on the timing of Carbon, that'd be appreciated. As Claudia mentioned in her remarks, we're not giving quantitative guidance yet today. We're really using this initial rollout to measure sort of the implementation timeframe, how quickly people ramp to full utilization, the types of questions that we know will be asked as we start to give out quantitative guidance. But to reiterate what we said, the demand for the machine, the implementation, being able to be done by the customer, these things are all moving in line with our expectations, and we're very pleased with the feedback we're getting as well as the funnel building to support the demand throughout the year. Obviously, we're focused on Platinum right now and so that's a big push. We're measuring the pull-through that those placements generate, really looking at the timeframe from when somebody receives a Platinum instrument to when they begin to run their studies and get to that utilization rate. So, today, there's nothing holding the customers back after test runs. I think what -- maybe to build upon what Patrick had mentioned in his remarks, there are customers today, who are in academic research centers people that -- those of us in the industry would consider key opinion leaders. There are some other customers though who, as Patrick mentioned, want to have a small number of samples tested to demonstrate that the technology is going to address sort of the study design they have in mind and that's where really the proof-of-concept testing service comes in. It's really a method to enable people to move through the sales funnel more quickly and get that sort of early technology demonstration, and then ultimately move to acquire the platform and in-source the work. So, that's sort of how the two different types of customers are progressing today."
}