{
    "symbol": "REGN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 14:07:06",
    "content": " In quarter two, global net product sales were $2.1 billion, an increase of 43% at constant exchange rates compared to last year, reflecting Dupixentâ\u0080\u0099s differentiated clinical profile and ability to effectively treat more and more patients with the type two inflammatory diseases where Dupixent is approved. In the U.S. we saw growth across all indications, including initial contributions from atopic dermatitis in patients as young as six months to five years of age and from eosinophilic esophagitis, both of which are indications approved by the FDA during the second quarter and represent the first approved systemic treatment options for these patients. In Oncology, Libtayo net product sales grew 25% globally at a constant currency to $141 million in the second quarter of 2022, including 17% growth in the U.S., driven by non-melanoma skin cancer indications and monotherapy non-small cell lung cancer. Based on interim data from a cohort of patients dosed with our recently modified step-up regimen, we believe odronextamab may have the lowest rates of grade 3 or higher cytokine release syndrome for this class of bispecific in follicular lymphoma and diffuse large B-cell lymphoma while still maintaining the efficacy profile previously reported. Turning now to Dupixent and markets outside the U.S., in the second quarter, net sales grew 61% on a constant currency basis to $510 million, driven by robust growth across all indications. Total Bayer collaboration revenue was $358 million of which $340 million related to our share of EYLEA net profits outside the U.S. Total Sanofi collaboration revenue was $678 million in the second quarter of 2022, improved 55% from the prior year driven by Dupixent. Your line is now open. Your line is now open. Your line is now open. Your line is now open. So I don't think there's any surprises that it's the small percentage of very hard to treat patients where somebody would try an untested agent that they're hoping might work better, but we have a real logical rational way that we are now taking EYLEA, bringing forth this high dose formulation and hope to extend the benefits that we're already seeing with this tried and true in terms of both safety and efficacy reagent, and even expand it and get even for these small percentage of patients longer dosing and even extend maybe everybody else. Your line is now open."
}