{
    "symbol": "PAR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:35:10",
    "content": " At the end of Q3, ARR reached $106.6 million, delivering a 29.2% year-over-year increase demonstrating the continued growth and scaling of our subscription services engine. If we assume that the $0.50 of operating profit degradates every year because of 5% churn, the IRR of just as one customer is in excess of 40% on the original $1 of sales and marketing investment, but I think thatâ\u0080\u0099s actually an understatement because our goal is to take the 5% churn and turn it into a 100% net retention, thereby taking the IRRs well beyond 50%. Total revenues were $92.8 million for the three months ended September 30, 2022, an increase of 19.1% compared to the three months ended September 30, 2021 with growth coming from both restaurant retail and government segments. Product revenue in the quarter was $31.3 million, an increase of $1 million or 3.5% from the $30.3 million reported in the prior year. Service revenue was reported at $37 million, an increase of $7.5 million or 25.3% from the $29.5 million reported in the prior year, driven by subscription services revenue from our operator solutions and guest engagement. Total subscription services revenue reported in Q3 2022 was $25.3 million, an increase of 34.6% compared to the $18.8 million in Q3 2021. The annual recurring revenue rate of subscription services exiting the quarter was $106.6 million, an increase of 29.2% compared to the Q3 2021, driven by 32% growth in operator solutions and 31% growth in guest engagement. Total funded backlog as of September 30, 2022 was an historical high as well with $95 million, a 150% increase compared to the funded backlog as of the third â\u0080\u0093 compared to the $38 million for the prior year. Backing out menu, the growth in SG&A is $4.1 million or 19% compared â\u0080\u0093 primarily driven by sales and marketing investments. Your line is open. And so on the product you take out the E&O reserve that I mentioned of $1 million, it gets you back to a 22% margin for product of which we expect, which a low-20s is what our actual range ranges in that product area. Your line is open. Your line is open. If you guys are â\u0080\u0093 if you take $115 million of ARR at the end of 2022, which is effectively what you added in the third quarter and bring bookings are up and you have payments, So $115 million feels like a conservative starting point and you say, okay, Iâ\u0080\u0099m going to grow 30%-ish percent next year, which gets me to $150 million of ARR. Your line is open. Your line is open. Your line is open."
}