{
    "symbol": "PAR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 05:12:06",
    "content": " As a company, we delivered a strong first quarter with reported total Q1 revenues of $80.3 million, a 47% increase from one year ago. This revenue growth was driven across all business lines, and specifically around our software recurring revenues, resulting in $94.4 million of total live ARR at quarter end and year-over-year growth rate of 172% from Q1 last year. Product revenues in the quarter continued to strengthen year-over-year and were reported at $25.1 million in this recently ended quarter, a 35% increase. PAR government had a solid Q1 financial performance, as evidenced by the 20% increase from Q1 last year and reported revenues of $21.4 million. Total revenues were $80.3 million for the three months ended March 31, 2022, an increase of 47.4% compared to three months ended March 31, 2021. Product revenue in the quarter was $25.1 million, an increase of $6.5 million or 35% from the $18.6 million reported in the prior year. Contract revenue from our government business was $21.4 million, an increase of $3.5 million or 20% from the $17.9 million reported in the first quarter of 2021. Contract backlog continues to be significant, noting a total backlog $195.7 million as of March 31, 2022 compared to $140.1 million backlog as of March 31, 2021. Service margin during the three months ended March 31, 2022 included $5.2 million of amortization of identifiable intangible assets compared to $2.1 million during the three months ended March 31, 2021. For the three months ended March 31, 2022, cash used in operating activities was $21.2 million versus $3.4 million for the prior year. Cash used for the three months ended March 31, 2022 was primarily driven by additional net working capital requirements due to a $5 million increase in accounts receivable related to our government segment, a $5 million increase in inventory and the payout over annual cash bonus. In regards to inventory, the balance as of March 31, 2022 was $40.9 million and we had a planned target for the company to exit this year at $30 million, while managing supply chain needs for our customers. Cash used in investing activities was $3.1 million for the three months ended March 31, 2022 versus $1.7 million for the three months ended March 31, 2021. Investing activities during the three months ended March 31, 2022 include a $1.2 million of cash consideration in connection with a small tech tuck acquisition to complement our drive-thru offering. Capitalized software for the three months ended March 31, 2022 was $1.6 million and was associated with the investments for various hospitality software offerings versus $1.59 million for the three months ended March 31, 2021. Cash used in financing activities was $1.4 million for three months ended March 31, 2022 versus $2.1 million for the prior year. So you've got $200 million in non-core value on an $800 million cap, it's whatever, $600 million and $120 million of contracted ARR, plus or minus, not including a lot of other things that don't go into it."
}