{
    "symbol": "AMRK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-07 18:59:04",
    "content": " Our third quarter was another strong period for A-Mark as we generated $54 million of adjusted pretax income or $4.45 per diluted share, with an 8.5% return on equity. A-Mark will acquire an additional 40% of the outstanding equity interest in SGB for approximately $44 million, consisting of $34 million in cash and 126,000 shares of A-Mark's common stock, implying an enterprise value of $110 million. Silver Gold Bull is one of the leading e-commerce precious metals retailers in Canada, with revenue of $633 million, gross profit of $41.2 million and pretax income of $26-plus million during the 12-month period ended March 31, 2022. For the 9-month period, our revenues increased 12% to $6.07 billion from $5.43 billion in the same year ago period. For the 9-month period, gross profit increased 58% to $194 million or 3.2% of revenue from $123.1 million or 2.26% of revenue in the same year ago period. For the 9-month period, selling, general and administrative expenses increased 78% to $55.9 million from $31.3 million in the same year ago period. For the 9-month period, depreciation and amortization expense increased 865% to $24.1 million from $2.5 million in the same year ago period. For the 9-month period, interest income increased 22% to $16.1 million from $13.2 million in the same year ago period. For the 9-month period, interest expense increased 11% to $16.3 million from $14.7 million in the same year ago period. The net decrease of $5.8 million includes a $6.1 million decrease related to JMB, a former equity method investment, which is now reported by the company as a wholly owned subsidiary, offset by increased earnings of $0.3 million from our other equity method investments. For the 9-month period, earnings from equity method investments decreased 69% to $4.3 million from $13.9 million in the same year ago period. Adjusted net income before provision for income taxes, a non-GAAP financial measure, which excludes depreciation, amortization, acquisition costs and remeasurement gains for Q3 fiscal '22, totaled $54.3 million or $4.45 per diluted share compared to $64.2 million or $7.40 per diluted share for Q3 fiscal 2021. Excluding this remeasurement gain, net income attributable to the company for the prior year 9-month period was $82.3 million. Adjusted net income before provision for income taxes, a non-GAAP financial measure for the 9-month period totaled $144.4 million or $11.89 per diluted share, which compares to $107.6 million or $13.48 per diluted share in the prior year period. We sold 34.5 million ounces of silver in Q3 fiscal 2022, which was up 4% from Q3 of last year and up 8% from last quarter. The number of total customers in the DTC segment as of Q3 fiscal 2022 was 1,968,200, which was a 20% increase from Q3 of last year. The increase in these metrics was mainly attributable to the addition of the JMB customer base, although it's important to note that the 20% growth in total customers from Q3 of fiscal 2021 to Q3 of fiscal 2022 is due to organic growth and is not attributable to customers acquired from JMB. Total DTC ticket volume, which represents the total number of product orders processed by JMB, Goldline and PMPP, increased 292% to 219,924 from Q3 of last year but decreased 5% in the second quarter of fiscal 2022. Wholesale ticket volume, which represents the total number of product orders processed by our trading desk, decreased 37% to 28,122 from Q3 of last year, but increased 5% in the second quarter of fiscal 2022. During the fiscal third quarter, our SilverTowne Mint produced an average of 750,000 ounces of silver per week, up 81% year-over-year and achieved a new record level of production with over 1 million ounces of silver produced in a single week."
}