{
    "symbol": "COLD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 11:34:04",
    "content": " At the third quarter, rent and storage revenue per economic occupied pallet in our same-store on a constant currency basis increased by 8.1% versus the prior year's quarter. Turning to our third quarter results, AFFO per share was $0.29, an increase of 7.4% compared to prior year. The same-store revenue and NOI growth was a result of our pricing initiatives combined with a 437 basis point increase in economic occupancy over the third quarter 2021, partially offset by declining throughput volumes of 1.3%. This will enable us to focus our attention on labor management in our core warehouse business where we own, operate, and utilize our assets to create value for our customers and shareholders and where we generate approximately 92% of Americold's total company NOI. At quarter end, within our global warehouse segment, rent and storage revenue from fixed commitment contracts increased on absolute dollar basis the $396 million compared to $346 million at the end of the third quarter of 2021. As you may recall, last year on the fourth quarter 2021, we started taking additional pricing in our services business due to inflationary pressure mostly in labour costs. For the full year, we expect the non same-store pool to generate approximately $34 million to $38 million of NOI which is net of approximately $14 million of start-up cost related to our development projects. Please note, this implies a meaningfully higher number in the fourth quarter 2022 versus last year's fourth quarter which was $21 million. Year-to-date, our AFFO per share was negatively impacted by approximately $0.01 and for the third quarter approximately a $0.025 due to the impact of unfavourable foreign currency exchange rates. We had provided detail around the building block but let me comment on this implied fourth quarter range as it relates to fourth quarter 2021 AFFO per share of $0.31, which is a challenging comp due to the low NOI lien items even though we're increasing full year 2022 guidance."
}