{
    "symbol": "COLD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 00:01:03",
    "content": " The four prerequisites for seeing NOI contribution dollars returned to pre-COVID levels are: first, we need to continue our current pricing initiatives to offset inflation; second, we need to integrate and fully commercialize recently added same-store facilities; third, we must achieve the proper mix of perm-to-temp hours ratio; and finally, we need occupancy and throughput volume to recover to pre-COVID levels. During the first quarter, power increased by approximately 18% in our same-store on a constant currency basis year-over-year, we're seeing the majority of this increase in our European portfolio within the same-store, driven by the increase in the cost of energy due to the conflict in Ukraine. At quarter-end within our global warehouse segment, rent and storage revenue from fixed commitment contracts increased on an absolute dollar basis to $367 million compared to $307 million at the end of the first quarter 2021, on a combined pro forma basis, we derived 39.8% of our rent and storage revenue from fixed commitment storage contracts. For the first quarter of 2022, global warehouse segment revenue was $541 million, an increase of 11% compared to the prior year. For the first quarter of 2022, our same-store global warehouse segment revenue was $483 million, up 4.5% year-over-year and 6% on a constant currency basis. For the first quarter, same-store global rent and storage revenue increased by 5.2% year-over-year and increased by 6.4% on a constant currency basis. Our same-store economic occupancy was 77.6%, which reflects an increase of 22 basis points from last year's first quarter economic occupancy, partially related to the timing of the Easter buildup and offset by continued food production challenges, with stable and consumer demand. This revenue growth was driven by our pricing initiatives, which increased our constant currency same-store warehouse services revenue for throughput pallet by 6.3% partially offset by changes in business mix. And next question, I mean, as we're about to slowly climb out of this neighbor shortage inflationary environment, it seems like there might be another storm brewing, if you – I'm not sure if you've had a lot of conversations with your food producers about this, but obviously there's been a lot of changes in fertilizer cost and some severe weather patterns in the U.S. that might potentially impact crop yield."
}