{
    "symbol": "COLD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 22:24:07",
    "content": " For the quarter, our Global Warehouse same-store pool generated total revenue and NOI growth of 8.1% and 3.1%, respectively, both on a constant currency basis. At quarter end, within our Global Warehouse segment, rent and storage revenue from fixed commitment contracts increased on an absolute dollar basis to $379 million compared to $333 million at the end of the second quarter of 2021. For the second quarter, we reported total company revenue of $730 million, which reflects an 11% increase year-over-year, and, as Rob mentioned, growth across all segments of our business, principally driven by our Warehouse segment. For the second quarter of 2022, Global Warehouse segment revenue was $564 million, an increase of 12% compared to prior year. Global Warehouse segment margin was 26.8% for the second quarter of 2022, a 191-basis-point decrease compared to the same quarter of the prior year. For the second quarter of 2022, our same-store Global Warehouse segment revenue was $498 million, up 5.9% year-over-year and 8.1% on a constant currency basis. For the second quarter, same-store global rent and storage revenue increased by 8.7% year-over-year and increased by 10.7% on a constant currency basis. Our same-store economic occupancy was 78.1%, which reflects an increase of 288 basis points from last year's second quarter economic occupancy. Because as I listen to you, you guys had $0.53 in the first half of the year, and I know you can't annualize the business because -- but as you think about kind of fourth quarter relative to first quarter, occupancy is going to be up a couple of hundred basis points as is your pricing. So I know it's kind of a long preamble there, but I'm just really trying to get to per share bridge to weight out to people... You'll see that our maintenance capital spend against our full year guidance ramps up through the back half of the year obviously, and it's -- our forecast implies that we're growing that spend relative to last year as our asset base has grown. So like is that on a seasonally adjusted basis, like in the second quarter, do you think for a second quarter level, do you think that's higher or lower or about the same stabilized occupancy once everything normalizes versus the actual in the second quarter this year."
}