{
    "symbol": "VISL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-27 11:37:07",
    "content": " The reason why thatâ\u0080\u0099s important is because thatâ\u0080\u0099s the area that weâ\u0080\u0099ve been focused on with our new products that weâ\u0080\u0099ve developed over the last three years, so whether itâ\u0080\u0099s our Quantum product or our new transmitter product, AeroLink, these are focused on those markets, so this underscores that our strategy, our technology strategy and our products meet the market and weâ\u0080\u0099re growing quite well in those markets, and we anticipate continued growth in those markets. Weâ\u0080\u0099re continuing to do that through our trade show activity and digital marketing efforts to bring both old customers that used to use our HDX product line, and then new customers that are interested in our AeroLink because not only does it do a proprietary COFDM link but it also brings bonded 4G/5G to areas where they donâ\u0080\u0099t want to deploy receive stations, so thatâ\u0080\u0099s a great opportunity for our customers to leverage whatever wireless capabilities are available. When you look at the public safety market, as I said, when we show whatâ\u0080\u0099s happening in sports and entertainment, these products are effectively the same but the markets that we play in is AVDS - aerial video downlink systems, which brings from the air, whether it be a rotary helicopter or a fixed wing or a drone to the ground, weâ\u0080\u0099re able to take that capability, send it to the cloud and distribute it to field agents, as well as command, so that proactive decisions can be made to better control situations. Our strategy from a trade show is twofold: one, weâ\u0080\u0099ll do the two large broadcast trade shows, one being IBC in September, and April for NAB - thatâ\u0080\u0099s in the U.S., and then weâ\u0080\u0099re very targeted with the public safety and sports and entertainment shows that we do during the year, so for instance Milipol, our security policing, or Heli-Expo, are all big shows where theyâ\u0080\u0099re not large shows, but the quality of the participants allows us to walk away with many qualified leads, whereas at a larger show you get a lot of names and a lot of people walking through, but the percentage of true potential buyers is a smaller percentage, whereas the smaller shows, itâ\u0080\u0099s a much higher percentage because itâ\u0080\u0099s a much more qualified smaller group."
}