{
    "symbol": "CMLS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 13:50:04",
    "content": " This consistently positive revenue performance reflects strong execution within the core business, bolstered by organic and profitable growth of multiple digital businesses, which now generate revenue at an aggregate annual run rate of more than $150 million, representing more than 15% of total revenue. In addition, we've also been unwavering in our focus on rightsizing the balance sheet by monetizing noncore assets at highly accretive multiples and through strong stewardship of our cash since June 2018, we reduced net debt by approximately $650 million, a value of more than $30 per share and reduced net leverage from 6x to 3.7x at year-end, achieving best among peers leverage and liquidity, while also returning over $31 million of capital to shareholders through stock repurchases, reducing our share count by 12% during 2022. We remain bullish about the potential of this revenue stream, not only given the more favorable underlying local advertising climate, but also our strong capabilities and go-to-market positioning that should help us capture share in the digital marketing services area, which is still highly fragmented, but has a more than $15 billion and growing total addressable market. In the meantime, we are taking every advantage of a relatively better local climate through portfolio optimization, strong sales execution and leaning into our digital businesses, in particular, our local digital marketing services business, where we see significant growth opportunities in an underpenetrated but large total addressable market. On a parallel path, we are continuing to rigorously manage expenses, finding ways to reduce fixed cost beyond the approximately $90 million of reductions executed to date versus 2019 to mitigate the impact of the loss of the WynnBET revenue as well as off-cycle political and high-margin national revenue declines. In aggregate, our digital businesses had an annual run rate of over $150 million based on Q4 performance and represented approximately 15% of our total revenue for the year."
}