{
    "symbol": "AIG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 13:22:10",
    "content": " With respect to PYD, there was a favorable release in the third quarter of $72 million or 90 basis points of the calendar year combined ratio. In Life Retirement, the business had another quarter of strong sales, with premiums and deposits coming in at approximately $9 billion up from $7.2 billion in the prior year, with positive year-over-year growth in each of its four business segments. One item to note in the International Personal Insurance third quarter accident year loss ratio is that it reflects approximately $100 million of losses related to COVID claims in Japan and, to a lesser extent, Taiwan. Furthermore, in North America, virtually every line of business was favorable, except for U.S. financial lines, which was unfavorable by $660 million net of the ADC, predominantly in accident years 2018 and 2019 and, to a lesser extent, 2020. For context, Hurricane Katrina and Irma, the first and third largest U.S. natural CAT losses in the last 100 years are estimated at $85 billion and $40 billions of insured losses, respectively, on an inflation-adjusted basis. Prior to 2017, on an inflation-adjusted basis, there were only 2 years, 2005 and 2011, that had greater than $100 billion of global natural cat losses and in both of these years, losses were led by primary apparels. Life and Retirement contributed adjusted pretax income of $589 million, which is $288 million below prior year quarter driven by lower alternative investment and call and tender income. Other operations adjusted pretax loss of $614 million compared to $562 million prior year quarter, mostly due to lower alternative investment income partially offset by lower interest expense. Net cat losses, excluding reinstatement premiums, were $600 million or 9.8 loss ratio points in the third quarter, which included $450 million from Hurricane Ian and $84 million from Japanese typhoons. Since 2018, we have seen the following: Total primary limits exposed in U.S. financial lines have been reduced by $32 billion on a comparative basis or nearly 80% through the third quarter of this year. The decrease was due to lower alternative investment, call and tender and fee income partially offset by higher investment income from fixed maturity and loan portfolios, less adverse mortality and an improved outcome in the annual actuarial assumption review, which other than DAC acceleration of $57 million showed no meaningful net movement in reserves this year. Adjusted pretax net investment income for the third quarter was $2.54 billion, a decline of $741 million or 23% compared to prior year quarter with $431 million attributable to Life and Retirement. And since then, we have paid dividends totaling $768 million, repurchased approximately $4.4 billion or 77 million shares of common stock, bringing our ending count to 747 million shares, a 9% reduction year-to-date. Now if I could spend two seconds on outlining what we've done, since we've announced Blackstone in July of 2021, so you go back into early third quarter of last year and we set up Corebridge's financial structure, not only do we do the IPO of 12.4% but set up their structure of $9.4 billion of debt, $1.7 billion of parent liquidity, during that period, we've reduced ongoing debt at AIG by approximately $12 billion, including the $1.8 billion make-whole in October."
}