{
    "symbol": "AIG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 12:22:03",
    "content": " Notably, underwriting income in the fourth quarter increased 27% year-over-year to $635 million. Global Personal reported an accident year combined ratio, ex-CATs, of 100.4%, a 610 basis point increase from the prior year quarter, as we continued to reposition this portfolio. Also, as I mentioned on our last call, the impact from deemed hospitalizations in Japan and to a lesser extent Taiwan contributed over $160 million in losses in 2022, having a 290 basis point impact on the International Personal accident year combined ratio. Many factors improved our overall property CAT reinsurance program, with highlights being: we were able to attain approximately $6 billion of limit, including increasing our per occurrence excess of loss placement; we maintained low attachment points on a model basis; we received support for a $500 million aggregate placement; and our overall spend for AIG increased less than 10% on an absolute and risk-adjusted basis versus 2022. Rate changes within Property CAT range between 30% and 100% in the U.S. as well as in peak zones outside the U.S. Risk-adjusted rate increases were approximately 50% in the U.S. Property and 35% in International Property and similarly, average margin improvement was approximately 50% year-over-year across the entire portfolio. Today, I will review net investment income, additional color on our fourth quarter and full year 2022 results in capital management and also update you on the progress we are making on our path to a 10%-plus adjusted return on common equity or ROCE. Turning to net investment income, on an APTI basis, fourth quarter net investment income was $3.0 billion, down $331 million or 10% compared to 4Q 2021. General Insurance delivered APTI of $1.2 billion compared to $1.5 billion in the prior year quarter due to lower investment income, partially offset by a $136 million increase in underwriting income. General Insurance APTI for the full year 2022 was $4.4 billion, up 2% from 2021 due to the $1 billion increase in underwriting profitability, offset by lower investment income. Full year adjusted ROCE was 6.5%, down from 8.6% in 2021, primarily due to lower alternative investment income, which was down $1.8 billion from 2021 or about 340 basis points of ROCE compared to 2021. As Peter and Shane have shared previously, achieving this goal is based on sustained and improved underwriting profitability; executing a leaner operating model across AIG; separation and deconsolidation of Corebridge; and continued balanced capital management, including reducing AIG common shares to between 600 million and 650 million shares through repurchases, while targeting debt to total capital leverage at the lower end of the 20% to 25% range post deconsolidation. And if you look at in the quarter, fourth quarter 2022 grew about $160 million just due to the rate resets and about 14 basis points from the pickup in yield on the portfolio."
}