{
    "symbol": "AIG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 12:05:31",
    "content": " And finally, I want to provide you more detail on the execution path to 10% ROCE for AIG and more detail on what we intend to do to get there, including income drivers, expense reduction and AIG 200 where, as Peter noted, we have contracted or executed on our stated goal of $1 billion of exit run rate savings 6 months ahead of our original time line. Life and Retirement declined $0.52 in APTI to $563 million, which was below last year's second quarter primarily due to $0.36 or $387 million unfavorable from lower net investment income, $0.19 or $202 million from accelerated DAC amortization and an increased SOP 03-1 reserves. As I noted, General Insurance's adjusted pretax income contribution in the second quarter was $1.26 billion, which reflects strong underwriting profit growth and continued improvement in the calendar year combined ratio of 510 basis points to 87.4%, and the accident year combined ratio ex cat of 260 basis points to 88.5%. The combined ratio improvement was due to improved underwriting income, earned premium growth, expense discipline, low catastrophe losses and favorable PYD, which all contributed to pretax underwriting income being up 73% year-over-year, increasing to $799 million from $463 million. International Commercial also continued to improve profitability with 550 basis points improvement in the accident year combined ratio ex cat this quarter, coming in at a strong 81.4% for the second quarter. The year-over-year decline was due to $387 million of lower net investment income, of which $224 million is from lower alternative investment income as well as accelerated DAC and increased SOP reserves of $202 million driven by the market declines in the second quarter. The second quarter includes execution of $1.7 billion in share repurchases, $256 million of common and preferred dividends and $1.4 billion net spend on debt reduction actions, including AIG debt retirement and extinguishment costs of $7.9 billion that is partially offset by the Corebridge debt issuance of $6.5 billion. Finally, during the quarter, we repurchased approximately 30 million shares at an average cost of $58.25, bringing our GAAP ending share count to 771 million with the quarterly average of 801 million compared to 873 million in the prior year quarter, representing an 8% reduction in average share count."
}