{
    "symbol": "FOLD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 13:34:07",
    "content": " In order to accomplish this, we will concentrate the vast majority of our efforts and investments in our priority growth franchises in Fabry disease and Pompe disease and we'll do this through the continued global growth and commercialization of Galafold to advancing the activities to secure global regulatory approvals, and commercial launch for AT-GAA and by making judicious strategic investments in next generation therapies in Fabry and Pompe, and in core science and platform technologies in the field of genetic medicine. The geographic breakdown of revenue during the quarter was consistent with what we've seen historically with $55 million or 69% of revenue generated outside the United States, and the remaining $24 million or 31% coming from within the United States and this is in line with the roughly 70/30 split that we expect as we continue to grow both parts of the business. On the other hand, if you look at the newer markets coming in Latin American countries like Brazil, Chile, Argentina, and Colombia, the Asia Pacific countries outside of Japan, the Gulf States, as well as countries in the Middle East and North Africa, including Turkey, where we're hoping to get approval later this year, we see the majority of net new patients are switch patients and we expect that to continue throughout the next several years. Moving to Slide 10, looking forward a little bit, we know that Galafold has the potential to surpass $500 million in annual revenue over the next few years through three primary growth drivers that we continue to talk about; continuing to penetrate into existing markets, continue to expand it to new geographies, and broadening the labels for Galafold. In the longer-term, we remain confident in that $1 billion peak revenue opportunity as we continue to see significant growth in the Fabry market globally driven by diagnosing patients through a variety of measures, including high risk screening, newborn screening, and other diagnostic initiatives, which we continue to support and invest in as well. This year we expect total non-GAAP operating expense to be within the range of $470 million to $485 million driven by continued investment in the global Galafold launch, and AT-GAA clinical studies and prelaunch activities. Your line is now open. Hey, guys, thanks for taking the question. Your line is now open. Your line is now open. So we think all of the data from all the clinical studies together with a real world experience of physicians, now with multiple uses in patients ranging from infants all the way through adults in the EAMS study, we would expect, again to Bradley's point significant numbers of patients in the United Kingdom to switch from existing standard of care enzyme, from the approved myozyme to AT-GAA over the coming months and into 2023 as we then look to the full approval. No, I think John you covered it well, it's really just that consistency, the fact that cross parameters that we measured in patients that we treated, all the different endpoints across the key manifestations, either nominally, significantly or numerically favored AT-GAA over alglucosidase alfa and then across naïve patients, experienced patients, non-ambulatory patients from Phase 1/2, patients with higher or lower baseline severities, we've just seen a really consistent effect. So when you step back then and look at Amicus with Galafold is the cornerstone of our success, where we are today and where we'll take it with the length of that intellectual property protection well into the 2030s, with $1 billion revenue potential for Galafold, with what we believe will be an approved product in Pompe disease that we think has the potential to become the standard of care, or at least split the market with the existing entrenched other competitor in the field, that's another potential billion dollar revenue product, also with significant intellectual property protection, including Composition of Matter on AT-GAA, extending well into the 2030s. Your line is now open. Hey, guys, thanks for taking the question. Your line is now open."
}