{
    "symbol": "FOLD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 03:37:08",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to the Amicus Therapeutics Second Quarter 2022 Financial Results Conference Call and Webcast. Leading today's call, we have Bradley Campbell, President and Chief Executive Officer; Daphne Quimi, Chief Financial Officer; Sebastien Martel, Chief Business Officer; and Dr. Jeff Castelli, Chief Development Officer. As referenced on Slide 2, we may make forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 relating to our business as well as our plans and prospects. For a full discussion of such forward-looking statements and the risks and uncertainties that may impact them, we refer you to the forward-looking statements and Risk Factors section of our annual report on our Form 10-K and on our quarterly report Form 10-Q for the year ended June 30, 2022, to be filed later today with the Securities and Exchange Commission. Has planned after 17 great years leading Amicus as our founding CEO, John has officially assumed the role of Executive Chairman of Amicus for a two year term, after which he is expected to continue as the Non-Executive Chairman of the Board. First, Galafold continues its strong performance and remains the cornerstone of our success. We continue to be very pleased with the uptake of Galafold globally, despite the significant foreign currency headwinds that spaced our industry this year. In the second quarter, operationally, our growth in key performance indicators are meeting or exceeding our objectives in all key geographies, and we are reiterating our guidance at constant exchange rates. There are now 44 orange book listed issued patents related to Galafold in the United States, 28 of which provide protection to 2038 and beyond, and importantly include three newly issued composition of matter patents, bringing the total now to four. Looking ahead, we expect continued growth for Galafold this year, and with the strength in IP protection, continue to believe it has a long runway well into the next decade. Second, we continue to make progress on our global regulatory filings for AT-GAA, our novel next-generation therapy for Pompe disease. Across all of our ongoing clinical studies and access programs, there are now more than 175 patients on AT-GAA today, which we believe represents 5% or more of the total treated Pompe patients around the world. Our global launch plans continue to move ahead, including prelaunch activities, targeted investments and additional personnel to support the launch, significant investments in the launch in inventory preparations. And third, importantly, Amicus has maintained a strong financial position and remain committed to achieving profitability in 2023, as we continue to execute on the global expansion of Galafold and prepare for the global launch of AT-GAA. First, the global launch of a second rare disease medicine with AT-GAA; and second, achieving profitability. On Slide 5, we see we're well on our way now towards achieving our key strategic priorities for this year, including continuing to drive Galafold to more people living with Fabry with amenable variance in existing and in new markets. We remain steadfast in our commitment to advancing AT-GAA regulatory filings and initiating the anticipated launch of AT-GAA in the United States, leveraging our seasoned global commercial team and experience across all areas needed for an effective drug launch, we are fully prepared and anticipate a very successful launch for AT-GAA. With that overview, let me now hand the call over to Sebastien Martel, our Chief Business Officer, who can further highlight the Galafold performance. On Slide 7, as you can see for the second quarter of 2022, total product revenue reached $80.7 million, driven by strong patient accruals, partly offset by foreign currency impact as well as the timing of orders in certain ex-U.S. markets. The geographic breakdown of our revenue during the quarter consisted of $53 million or 66% of revenue generated outside of the U.S., and the remaining $28 million or 34% coming from within the U.S. And as a result, Galafold reported revenue growth was 10.9% in the first half of 2022. In the first half of the year, our sales in the U.S. grew 16.1% at CER, while our ex-U.S. sales grew 18.5% at CER. And if you look at the growth in net patients on Galafold on a global basis, which is perhaps the truest measure of our underlying business performance, we see greater than 19% growth in patients on Galafold at the end of Q2 this year versus the same period last year. And while the global mix remains about 55% switch and 45% naive, many, many geographies were starting to see stronger uptake in naive populations. So while we're achieving higher market shares in countries where we've been approved the longest, there's still plenty of opportunity to continue to switch patients over to Galafold and to continue to grow the market as we penetrate into the diagnosed and treated segments and the newly diagnosed segments. All of that is underpinned by impressive compliance and adherence rates that continue to exceed 90%, reiterating our belief that those patients who go on Galafold generally stay on Galafold. We did experience some impact due to the timing of orders in the second quarter, and we expect this nonlinear quarterly growth to continue. Importantly, the value of Galafold continues to be recognized by payers, as we have a very strong track record of successfully negotiating and renegotiating reimbursement outside of the U.S. Our relentless focus remains on ensuring access to Galafold for anyone who needs it. We know that Galafold has the potential to surpass $500 million in annual revenue over the next few years through three key growth drivers: first, continuing to penetrate into existing markets; second, expanding into new geographies; and third, broadening the labels. In the longer-term, we continue to see significant growth in the overall Fabry market globally. And finally, we have orphan exclusivity in the U.S. and Europe, in addition to our now 44 orange book listed patents that give us IP coverage into the late 2030s, 28 of which provide protection through 2038, and that includes three new composition of matter patents. On Slide 11, let's shift gears, and I'll provide you here with an update on our launch preparations for AT-GAA, as we're poised for another successful product launch. So unlike when we launched Galafold, and at the time we were hiring and building the commercial infrastructure from scratch, we now have a presence in over 40 countries around the world, including all the major markets. We have experience across all areas that are needed for a successful drug launch, from regulatory to commercial, supply chain, experience with payers, reimbursement and access, and in addition, and maybe most importantly, the key relationships with physicians. Our experience with reimbursement and access around the world, and again, all the strategic planning that we're doing together with our partners at WuXi Biologics, we believe we're in a very strong position for a second successful launch of Amicus."
}