{
    "symbol": "KOS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 23:32:14",
    "content": " A fundamental measure of any E&P company valuation is its 2P reserve base, which with Kosmos has almost tripled over this timeframe from around 200 million barrels of oil equivalent at the end of 2017 to around 550 million barrels of oil equivalent at the end of 2022, with a lengthy runway of additional discovered resource potential beyond that, which I'll talk more about on the next slide. In 2021, the field produced 75,000 barrels of oil per day and we expect it to increase by around 25% from that level to 95,000 barrels of oil per day this year, due to the startup of the Jubilee Southeast project, which is on track to come online at the end of next quarter. In terms of the total gas opportunity in Mauritania and Senegal, there's potentially around 15 Tcf of recoverable gas at each of Tortue, Varela and the Yakaar-Teranga for approximately 12 Tcf of recoverable gas next to Kosmos, which is around 2 billion barrels of oil equivalent. At current oil prices, we expect to generate around $100 million to $200 million of free cash flow this year before working capital, which is back-end loaded as we reach the anticipated inflection point of lower CapEx and higher production. So those are the 3 things that sort of drove the selection of the GBS for the midstream, but it's sort of worth, I think, reiterating that we have a Phase 2 concept, which is going to leverage heavily the infrastructure from Phase 1 to what a Phase 2 comprise of there's clearly additional wells, manifold of those, but we're going to debottleneck the FPSO. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Yes, so I think those were early costs, and I think that we'll do a lot better than that on the upstream now as we've done further work to delineate what's actually going to be required to debottleneck the infrastructure that we have in place today to take in another gas flow of around 400 million, 450 million standard cubic feet a day that you need to provide for 2.5 million to 3 million tons of LNG liquefaction. Please proceed with your questions."
}