{
    "symbol": "KOS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 22:50:30",
    "content": " During today's presentation, we will make forward-looking statements that refer to our estimates, plans, and expectations. We're investing in growing oil supply in each of our core production hubs with an emphasis on high graded projects of yield, of low cost, lower carbon barrel that are highly cash generative. At the same time, we're working with our partners with new sources of natural gas into production. These projects address affordability and increase energy security by supplying more gas to global energy market, as well as into domestic markets in Africa. Over the next two years, we expect to increase oil & gas production by about 50% as we optimize current production and bring new projects online. The Kosmos, the cash flow from our current and planned activities enabled selective reinvestment into the most compelling opportunities in our deep natural gas portfolio, which can help meet demand and support the energy transition for decades to come. Longer term, we plan to continue shifting the balance of our portfolio from oil to natural gas and LNG to help meet the world's energy need as cleaner natural gas displaces coal, heavy fuel oil and biomass as a prime resource of energy in both developed and emerging economies. The world's demand for energy continues to grow, particularly in Africa and few E&P companies are investing to meet this demand. Given the quality of our asset base and the wealth of opportunities within our differentiated portfolio, we believe Kosmos has an important role to play in responding to these global energy challenges. Third, we forecast around 50% growth in production from now into 2024 from three development projects, which are progressing well. The largest portion of that growth is expected to be driven by Tortue, which increases the gas content of our portfolio materially just from Phase 1 with a larger transition anticipated as we deliver subsequent phases and our other gas projects in Mauritania & Senegal. We have strong focus on capital discipline, only pursuing the most compelling value-added projects in the portfolio, while making sure the balance sheet remains robust. We have a highly experienced management team, we have the energy to deliver our strategy and respond to the challenges we see across the industry today. So to summarize, I strongly believe Kosmos is well positioned for the future with a clear compelling strategy and we continue to deliver progress on our strategic priorities each quarter. We continue to grow the value of our oil portfolio with progress at the Jubilee Southeast and Winterfell development, and we have hydrated our ILX offer for next year's drilling activity. And finally, the balance sheet continues to improve as the portfolio generates cash, which drives down leverage with our year-end target leverage of 1.5 times achieved with further progress expected. Turning to slide six, which focuses on the performance of our production assets during the quarter. In Ghana, the Jubilee field continues to deliver with gross production for the quarter, around 69,000 barrels of oil per day. Following the excellent drilling performance year-to-date, which is seeing wells drilled safely and quicker than planned, we have now started to drill the first of the three Jubilee southeast wells ahead of schedule. We've completed the handover of the Jubilee FPSO operations and maintenance from MODEC at the beginning of the third quarter and the results so far have been encouraging with multiple opportunities identified, drive further efficiencies and reduce costs. On costs, we've identified potential savings in direct contracting, focused work stubs and competitive retendering. A TEN gross production of around 22,000 barrels of oil per day for the quarter was in line with expectation. The partnership also drilled the second and only riser based well during the quarter, which encountered approximately five meters in that oil pay, but with poorer quality reservoir than expected. The data from the two riser based wells will be incorporated into the expansion plans for TEN, which will now be focused on proved accumulation areas where we have existing well control. Equatorial Guinea, gross production has been consistent and stable with around 30,000 barrels of oil per day for the quarter, again in line with expectation. In late August, the partnership entered into a rig contract for next year's drilling campaign, activity scheduled to begin in the second half of 2023, when the partnership expects grow several infill wells in Block G, followed by an ILX well. The Gulf of Mexico net production of 40,700 barrels of oil equivalent per day was slightly below expectations, due to an extended Delta House turnaround and lease current impact in production of Tornado after the planned drydock at the production vessel concluded. At Delta House, there was an unplanned shutdown for around two weeks last month, due to an  of the gas compressor. So there have been a few issues with unplanned downtime over the past couple of months, but we're now back at around 18,000 barrels of oil equivalent per day net and focused on growing our GoM production. Work also began on Odd Job subsea pump project during the quarter, following sanction in 2Q, which is an important step into sustaining the long-term performance of the field. As we move our development projects forward, we continue to grow the value of the portfolio. On Jubilee Southeast, the project is now over 50% complete with the drilling of the first well is now underway. Initial production is expected in mid-2023 and the partnership is targeting a ramp up in gross Jubilee production to around 100,000 barrels of oil per day. At Winterfell, all partners signed the build development plan in September and the operator has signed a recommissioned lesson to drill and complete three wells starting mid-â\u0080\u009823. Host facility production handling agreement and mid-stream export agreements are also expected to be completed within the next several months, supporting our target of first oil at the end of first quarter in 2024. Given the scale of the potential resource with approximately 200 million barrels of recoverable oil, we remain excited about this project. Now that I've talked about our near-term, that's not an oil, I'd like to switch gear on slide eight, which looks at how we're growing the long-term value of our gas portfolio. First, Tortue Phase 1, our LNG project in Mauritania & Senegal, all work streams continue to make good progress with a project approximately 85% complete at the end of the third quarter. On drilling, four wells have been drilled in total capacity of around 700 million standard cubic feet per today. Combined across the four wells, we now have significantly more capacity than the 400 million standard cubic feet per day required to supply the liquefaction volumes for Phase 1. On the subsea, the shallow water gas export pipeline in the FPSO for the hub terminal has been installed and the deepwater pipeline vessel has arrived in the region. Around two weeks later, the vessel was returned to Kingstine and following the inspection carried out today there continues to be no material damage reported. With the required inspections and additional work scope resulting in Typhoon, the impact on the FPSO schedule has been around a month. And as a result, we expect to stay away the vessel around year-end. Stepping back and looking at the projects overall, the operator is working hard at making good progress to overcome the challenges with COVID, supply chain constraints, and more recently Typhoon Muifa. On the cargo sales opportunities, we talked about last quarter, a process of engagement has commenced with significant interest received to-date, including majors, traders and end users. We'll provide further updates as we progress the process, and we remain focused on crystallizing additional value by shareholders from this opportunity. Elsewhere in Mauritania & Senegal, we continue to move the various projects forward. On Tortue Phase 2, we're in advanced discussions with our partners BP, Petrosen and SMH, the two governments, including their respective Presidents, on the right concept to accelerate the second phase of the project. In light of the changed global market conditions following the invasion of Ukraine and the continuing volatility, our aim is to agree the best concept in the coming months, which will enable us to advance the pace with the right expansion. This is taking longer than initially envisage as we were to obtain the full agreement for both government, who are rightly considering the importance of their gas resource and the opportunity to build new government to government partnerships. There's a sharp focus on building the arise, low constellation, leveraging synergies of Phase 1 and accessing attractive pricing opportunities given the high demand environment. On BirAllah, we've now signed the PSC with the Government of Mauritania that's flagged in last quarter's results. In Senegal, we're continuing to progress the domestic gas scheme with the operator and the government. Turning to Slide nine, third quarter saw continued progress as we further enhanced our financial position. EBITDAX in 3Q was around $301 million, up almost 4 times, compared to the third quarter of 2021 on higher production and higher realized prices. We generated around $30 million of free cash flow in the quarter, which takes us up to around $320 million for the year-to-date. As our production has grown on a year-on-year basis, we now expect around $1.5 billion of EBITDAX for 2022 at an average oil price of around $100 per barrel. Looking forward, with expectations that the business continues to generate strong levels of free cash at current commodity prices, we plan to continue to prioritize debt paydown in the near-term. As Andy mentioned, net production of around 61,000 barrels of oil equivalent per day was in line with guidance, helped in particular by strong performance at Jubilee and offset by some weakness in the Gulf of Mexico. With the continued higher unplanned downtime in the Gulf of Mexico in September and October, full-year production guidance has been tightened to 63,000 to 65,000 barrels of oil equivalent per day. Excluding hedging, realized price was around $97 per barrel of oil equivalent. Costs generally came in line with guidance, our OpEx was lower than forecast due to lower Ghana operating expenses and some delayed projects in Equatorial Guinea. On capital, we expect 4Q to be broadly in line with the third quarter, which includes some slightly higher CapEx on Winterfell, reflecting the costs associated with the acquisition of our additional working interest. On the Greater Tortue project, there is also some uncertainty on the timing of accruals throughout the end of the year, which could either accelerate or defer capital between 2022 and 2023. To conclude the financial section of today's presentation, it was another good quarter of progress. We're also growing value across our gas portfolio with further progress in Tortue, the signing of the BirAllah, PSC in Mauritania. And finally, we have the right low cost, lower carbon portfolio at the right time, providing the energy the world needs today and supporting a just transition it addresses the trilemma with energy security, energy affordability and climate change. Please proceed with your questions. And with that, and we can talk more broadly if you want around the overall schedule, but that still puts us in the place whereby year-end â\u0080\u009923 we can be delivering the first LNG. So as with all big projects, it's a question of dealing with the sometimes challenges that are put your way. And clearly BP has been challenged with the COVID shutdowns and with the Typhoon, but they've done a really good job at overcoming those and making progress. You start with the wells, we've drilled four wells, we've just done the first completion, flowed the well back with a good clean up. You end sort of move to the hub terminal, essentially complete very high level of completion, actually the pack that we distributed this morning has a picture of the current stage at the hub terminal, you can see from that picture a level of completion that's there. FLNG vessel as the goal of -- declared in their own disclosures, it should depart Singapore in the first half and it's 60-day to 90-day transit. As I said in my remarks that the shallow water line has been done, the deepwater pipeline vessel is in the vicinity and it expects to start work later this quarter and have finished all the deepwater pipeline and flow lines by the second quarter. And then the critical pass-through of the FPSO, sales around year-end expected to arrive 90-days later. We do the hookup of the FPSO, the connection of the subsea, when all the equipment is laid, which is sort of the end of the third -- around third quarter. So therefore, you start to introduce gas around that timeline, which leads you to first LNG by the end of the year. So all the component pieces of that and when continue to deliver on those milestones as we go big projects there will be challenges around the integration of all of that, where there is a clear way forward and a lot of energy now in the delivery of that timeline. Our next question is coming from the line of Bob Brackett with Bernstein Research. Please proceed with your questions. I'm curious about â\u0080\u009923 CapEx, but I'll leave that question for somebody else and instead focus on GTA Phase 2, I hear your language around government to government and I recollect high level visits between the President of Germany and Senegal. And for them, it's about ensuring they've got the  project, which enables them to position their gas as an important trade relationship with Europe. So the right project, right scale, right timing as the governments think about that government to government relationships is factored into this piece of work, it's more than just the engineering. It's actually about them having to rethink their approach really as a result of everything that's happened in last, sort of, last six months. And of course, it's slightly more complicated, Bob, because you've got two governments involved and that's always been the challenge with GTA. We have a project, which is truly low cost, which has lower low carbon gas, there's no CO2 and therefore is an important piece of new supply for Europe. I think I'm optimistic that the operator will put forward a proposal actually this month that incorporates all of that feedback, which will enable us to agree the concept, which enables us to do the work to optimize that concept and then move the project forward into around that. I think the partnership really understands that we have an opportunity to deliver truly low cost project by leveraging fully the infrastructure that we've invested in Phase 1, I think it's clear alignment around that. Please proceed with your questions. Wanted to ask just a follow-up about Phase 2, but perhaps from the financial perspective, I think when you have spoken about this about Phase 2 in the past, the idea would be that the cash flows from Phase 1 would essentially make your pathway to -- or through building Phase 2 cash neutral. Yes, I think overall Charles, I think you're right. So when we talked about it, and about the phasing of the projects, it was always about ensuring that we had a really capital efficient Phase 2 by fully leveraging the Phase 1. And I think you're correct, I think in saying that I think probably from a cash flow perspective there could an opportunity to be slightly more positive as a result of that. I mean, I think the environment for gas prices and oil prices will clearly be positive versus the long-term that we put out in terms of creating that wedge, Charles. And so there's some upside there and clearly around the cargo sales opportunity, there's additional upside that would give us some more cash in that near-term period. So, yes, I think it's definitely moving in a positive direction versus just the neutral position. I guess I've been operating under your impression, there aren't a lot of untested four ways still out there in the Gulf of Mexico, but perhaps that's not correct. Yes, you know, you're right, So Charles, there aren't many four ways left in the Outer World Cup, this is maybe the -- you never say the last, but this is one of the remaining few I think there are there. So it's a high quality prospect, I think from a geologic perspective, itâ\u0080\u0099s got scale over 100 million barrels of resource, and it is a tieback. Please proceed with your questions. Look, the purpose of the two wells, they were appraisal wells, it was to test the greater and some area and allow us to calibrate the seismic to ensure that we have a solid development plan going forward. And just remember, this is new resource that we're bringing to TEN, so this is sort of new resource that obviously when developed becomes new reserves. I think with the appraisal wells have allowed us, I think, to get a better understanding now of the quality of greater and some area. And I think as we look, we can see the potential to bring new resource across that area, but we will be targeting accumulations where we have well control and therefore is lower risk. But so there is new resource to be brought, I think the appraisal wants to serve the purpose in terms of properly defining the opportunities that, so that we can bring something forward that is of the right risk profile and competes for capital within our overall allocation. So it has done what we wanted to do and we're now, sort of, fully integrating the results of those wells into the plan and this is something that we will be debating with the operator over the turn of the year. So we've made good progress in terms of debt reduction, which we've been clear that has been our key focus. We've been consistent in saying our near-term objective is to get leverage down to 1.5 times in the sort of sustainable oil price, and that will require us to continue to push debt down further than where we are today. And so if oil prices, sort of, stay where they are, I think we can get to the right place in the back half of next year to start having that discussion around shareholder returns. And based on the discussions we've had with our shareholders in the past, I think we're continuing to lean on the side of buybacks versus dividends. But -- so we're in a good place to continue to pass -- move the path forward on continued debt reduction and then when we get to the right time, push on the shareholder returns. Please proceed with your questions. I've just got a question on Ghana there, you've talked a bit about monetizing gas resources. And clearly today, we're producing around 100 million scuffs of gas from Jubilee. And so therefore, we're starting a conversation with the government about a gas sales contract for that gas. Integrated with that, is the development of TEN, which I talked about on a prior question, which will be an integrated gas and oil development with gas, but it's both associated gas from the oil and non-associated accumulations and putting in the infrastructure that enables us to optimize that. The approval of that plan by the government will then give the government an important source of domestic gas at a price, which is competitive with our current cost of gas. So as you start to think about the growth target, I think the big chunks of it are clearly Tortue, which is the biggest chunk. So a piece of it, it's going to be TEN gas. But overall, it's a minor part of the contribution to the 50% percent growth. Please proceed with your questions. Yes, I think clearly what's caused the -- created the opportunity is the transfer of the responsibility for the operations and maintenance from MODEC. And I think that we're seeing opportunities coming from really optimizing the work scope and because you're coming in with a different mindset, I think, from somebody who is a sort of third-party operator to one is that is now 100% focused on that task. So an opportunity from work scope optimization, I think there is some work to do with the contracting strategies, and how we can get better value from those. So I think the combination of those two things, other things that are allowing us to -- will allow us to make reductions in terms of the cost base. The 3Q production costs were I think below where we guided primarily, because we had a shift in the operational activity in Equatorial Guinea from 3Q to 4Q, but there was an underlying piece of self help from Ghana in particular, in Jubilee and we expect more of the same going forward. The operating costs where we have, I think, greater access to those opportunities. And again, I think, I do want to comment on how good the drilling performance has been. And I think on the cost side, there's probably a little more to go. Yes, and then James, I'll just take the second part of your question around 2023. I think you're right, it is still a bit early, because we're still finalizing the activity within the various partnerships that we have. But I think generally, we're looking to stay broadly flat into â\u0080\u009923 being sort of the last big capital year for us as we finish up the development projects. As Andy mentioned, even on the work scope side, so making sure we're efficient around every dollar we spend across the capital end as well as the operating end of the business. So we've got some good contracts, I think, in place in Ghana and we've benefited from those. We've -- the operator, I think, did a really good job on winterfell and getting sort of ahead of the market and getting that rig at a very good price. We're following with the rig on Tiberias, and I think we're getting a fairly high utilization rates for quality equipment, I think we are seeing inflation in those rig rates. There's clearly still stuff to finish on Tortue and the edges of contracts, which have to be finalized access to some of the workflows as we get into the installation campaign, that will be an issue for us. Please proceed with your questions. Good morning, everyone, you've taken a lot of questions here. Yes, great questions, I think if you start off from the biggest, sort of the strategic level, and they're different projects. I think as we look at BirAllah and Yakaar-Teranga look at BirAllah, I think this is about another -- it's a new source of gas in particular for Europe. So the work is ongoing at the moment as you said, there's a 30-day clock to 30-month clock to get to FID. But for me, our first objective is to generate something which is truly value-added, and as you look to the strategy of the company, I believe gas, as I said in my opening remarks, is something that is core to our future, it creates longevity and quality to the company. How can you come forward with the scheme now where you're not getting caught up in the timeline of putting a lot of money into appraisal, which generally is only going to destroy returns and extend timelines. I think the country is very clear about its needs, itâ\u0080\u0099s significantly larger population than the Mauritania, a growing population, they have -- they're burning heavy fuel oil today and for power generation displacing that with gas, not only brings economic benefit, it brings climate benefits. And then the follow-on, the follow-up that can come from that, if you like, early gas scheme to one where I think there is an export component to that as well. And then getting on with a domestic gas project, which the country does need and then how do you credit optionality from that follows. But I think you rightly talk about the value that's in our portfolio from these two projects, because I genuinely believe they are competitive gas sources globally and both in an export sense and from a domestic sense. Our next question is coming from the line of Bob Brackett with Bernstein Research. Please proceed with your questions. Just coming back with a fairly minor question, I was trying to understand the strategic or finance logic around the Panoro farm in Equatorial Guinea. Panoro obviously came in, picked up the total share, so they're going to , we haven't talked about it, but the big upside at Equatorial Guinea we tend -- the asset is performing well. We're seeing the extension of production profiles from good production engineering, particularly around the ESP program, but the real upside is going to come from the opportunity in the Albian an untested play, but some good, very, very strong four ways. And Panoro wanted to get access to that opportunity, which is great, because it sort of -- the decimals aren't quite right, but then we have alignment between the exploration potential and the ownership in the infrastructure. I think Charles asked the question around Tiberius, if you like about it, and it is a compelling four way. The Albian play in actual Guinea is equally interesting, because it's got really strong geology. There's clear source, and we have fundamentally a very good initial prospect and then real play extension now with the acreage around it. Well, thank you everyone for joining us today and that concludes today's call, if you have any follow-up questions, please reach out to Jamie."
}