{
    "symbol": "HYLN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 15:30:47",
    "content": " As I mentioned earlier, we have secured orders backed by deposits for early production slots for 200 units of the Hypertruck ERX, 190 of these orders were placed by the end of the second quarter, and another 10 of them were recently announced. Also previously announced in the second quarter, Holcim U.S., a global leader in innovative and sustainable building solutions with a focus on low carbon construction ordered 10 units of Hypertruck ERX production slots. Your line is open. While we did see sequentially a dip in our revenue recognition for this past quarter, I think, that backlog shows that thereâ\u0080\u0099s strong customer interest still in the product and a lot of the slip really just came from supply chain issues and specifically around availability of trucks. Your line is open. Your line is open. I think to our advantage, whatâ\u0080\u0099s working out well is a few quarters ago, we really buckled down and looking at what do we need over the years ahead from a supply basis, specifically as we go through the Hypertruck ERX development cycle and we have been working with those suppliers for a while now to make sure that we are able to obtain and secure those components. Your line is open. Your line is open. The other is just as we have been going through these supply chain issues of fleets and having issues arise where they are not able to down trucks for a period of time in order for us to do the install, we are looking at it as if we can supply them the entire asset, that allows them to move quicker, and ultimately, us to be able to deploy Hybrid systems more efficiently and effectively into fleetâ\u0080\u0099s operations. Your line is open. So I think from a timing standpoint, from what we are seeing itâ\u0080\u0099s going to line up well, because as a reminder, the Hypertruck goes into production in late 2023, so thatâ\u0080\u0099s when fleets will actually be purchasing the vehicles."
}