{
    "symbol": "HYLN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 14:50:04",
    "content": " Looking forward into 2023, we expect to continue to deliver Hybrid systems and full trucks with Hybrid systems installed at about the same quarterly rate as we averaged in 2022, or about $0.5 million of revenue per quarter, as we move towards commercial launch of the Hypertruck ERX system. In terms of actual timing of when we'd be ready to bring that to market, we're not ready to share yet just because the agreement with Hyzon is really around this initial development vehicle, proving that out, showing to the market that our powertrain is able to incorporate a fuel cell, just like it can incorporate the range extender CNG, the KARNO generator, and then from there, we'll showcase the solution with customers and we'll work with Hyzon to determine how we see best fit to potentially bring a solution to market and what the timing of that would be. And that's one of the reasons why we wanted to make sure we fulfill the roadmap that we had the, three stage roadmap of including a fuel cell as well, because we want to show that in --whenever hydrogen is ready, when those costs come down, and infrastructure gets built out, we're going to be able to have a solution that is piggybacking on a powertrain -- that, by that time, we expect weâ\u0080\u0099ll already have millions and millions of miles proven out with the CNG range extender. And what's been interesting -- and we've kind of forecasted this a little bit in the past is we're seeing that fleets are really struggling with these BEV vehicles that they're seeing charging as being a massive issue, the cost of infrastructure, the uptime of the vehicle, the amount of time that it spends having to be recharged, all these things are just factors that are really hurting fleetâ\u0080\u0099s abilities to adopt the best solution which is then in return actually causing more demand and more focus on our solutions, which is great. One of the exciting things for us is recently CARB had a call where they reiterated and expressed that if a near-zero emission vehicle that has the correct performance characteristics is available, they're not going to grant fleets extensions for not being able to get infrastructure and not having a vehicles available because CARB is doing it and saying that that near-zero emission vehicle is good enough -- is good that they should be adopting, so they're not going to get an exemption."
}