{
    "symbol": "MYTE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-15 13:29:04",
    "content": " First, the accelerated growth in our business in the fourth quarter and the strong results for the full fiscal year 2022 shows the consistency and strength of Mytheresa. First, in the fourth quarter, we grew our gross merchandise value, GMV, by plus 18.2% compared to Q4 of fiscal year 2021. For the full fiscal year, our GMV growth reached plus 21.3% compared to full fiscal year 2021. The United States, which is one of our key growth markets showed again an above-average GMV growth with plus 28.0% compared to Q4 of fiscal year 2021. For example, our customer satisfaction reached again an outstanding level as measured internally with a net promoter score of 83.2% in the fourth quarter of fiscal year 2022. Our average order value increased by plus 5.2% for the full fiscal year 2022 compared to fiscal year 2021, our customer acquisition costs only increased modestly by 3.8% in fiscal year 2022 whereas many other digital platforms struggled to keep cost increases at bay. And finally, we achieved our business growth with a very healthy gross profit margin, which was 4.6 percentage points higher in fiscal year 2022 compared to fiscal year 2021, driven not the least by our strong focus on full price selling. Despite the decrease of large-scale COVID related lockdowns, mainland China GMV grew by plus 22.5% in full fiscal year 2022 compared to fiscal year 2021. For the full fiscal year 2022, GMV was at â\u0082¬747 million, a strong growth of 21.3%. For the full fiscal year 2022, net sales was at â\u0082¬690 million a plus of 12.7% compared to fiscal year 2021. For the full fiscal year 2022, Mytheresa achieved a gross profit of â\u0082¬355 million, an increase of 23.7% compared to the fiscal year 2021. The gross profit margin for the full fiscal year 2022 increased to 51.5% compared to 46.9% in the full fiscal year 2021, mostly due to the before mentioned CPM effect. For the full fiscal year 2022, the shipping and payment cost ratio in relation to GMV was at 13.1% versus 11.6% in fiscal year 2021. If you exclude the DDP costs, the shipping and payment cost ratio in relation to GMV also for the full fiscal year was stable at 8.9% versus 8.6% in the previous year. For the full fiscal year 2022, the marketing cost ratio was stable at 12.9% compared to 13.2% in fiscal year 2021. For the full fiscal year 2022, the adjusted selling, general and administrative cost ratio was stable at 12.8% compared to 12.7% in fiscal year 2021. For the full fiscal year 2022, Mytheresa achieved an adjusted EBITDA of â\u0082¬66.3 million compared to â\u0082¬54.9 million in fiscal year 2021, and thus representing a significant growth of 20.7%. For the fourth quarter of fiscal 2022, Mytheresa reported an adjusted operating income of â\u0082¬11.4 million compared to â\u0082¬9.1 million in the previous year quarter. For the full fiscal year 2022, we achieved an adjusted operating income of â\u0082¬57.2 million compared with the â\u0082¬46.7 million in fiscal year 2021 and thus also representing a significant growth of 22.6%. Adjusted net income for the full fiscal year 2022 was at â\u0082¬44.5 million compared to â\u0082¬32.1 million in fiscal year 2021, an increase of 38.6%. Therefore, our guidance for fiscal year â\u0080\u009823 is GMV in the range of â\u0082¬865 million to â\u0082¬910 million, representing 16% to 22% growth; net sales of â\u0082¬755 million to â\u0082¬800 million, representing 10% to 16% growth; gross profit at â\u0082¬410 million to â\u0082¬435 million, growing in line with GMV, also representing 16% to 22% growth; and adjusted EBITDA in the range of â\u0082¬68 million to â\u0082¬76 million and an adjusted EBITDA margin between 9.0% and 9.5%. We also grew strongly in China in Q4, but we give the overall growth rate of China for the full fiscal year and in the full fiscal year, Mainland China grew by 22.5%."
}