{
    "symbol": "TXG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 20:49:14",
    "content": " Earlier today, 10x Genomics released financial results for the second quarter ended June 30, 2022. If you have not received this news release or if you would like to be added to the company's distribution list, please send an email to investors@10xgenomics.com. An archived webcast of this call will be available on the Investor tab of the company's website, 10xgenomics.com for at least 45 days following this call. Before we begin, I'd like to remind you that management will make statements during this call that are forward-looking statements within the meaning of federal securities laws. Additional information regarding these risks, uncertainties and factors that could cause results to differ appears in the press release 10x Genomics issued today and in the documents and reports filed by 10x Genomics from time to time with the Securities and Exchange Commission. 10x Genomics disclaims any intention or obligation to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. Joining the call today are Serge Saxonov, our CEO and Co-Founder; Justin McAnear, our Chief Financial Officer and Jim Wilbur, our Chief Commercial Officer. While some of these issues are behind us, we expect others will persist into the back half of the year. Based on these lingering headwinds in our first half results, we now expect full year revenue in the range of $500 million to $520 million, representing growth of 2% to 6% over the prior year. While our topline growth this year will be slower than our previous expectations, we firmly believe the underlying opportunity for single cell and spatial technology is as strong as ever. On our call today, I will focus on what we're doing to ready our organization for a next phase of growth. Justin will provide more details on the specific impacts to our second quarter revenue and our outlook for the year, as well as give additional color on steps we're taking to strengthen our financial profile. We're focusing on the strength that have always differentiated us, driving our innovation engine, providing a superior customer experience and investing in long term. In parallel, we will improve our execution and implement tools and processes, so we can increase leverage and scale to the next level of growth. As the only company to have the three fundamental technology approaches for single cell and spatial biology under one roof, we're uniquely positioned to be the best partner to help researchers around the world interrogate, resolve and master biology. Starting with Chromium, which is the unambiguous leader in single cell analysis. During the quarter, we continued to see solid demand for Chromium X Series instruments. Customers are enthusiastic about the new platform and its expanded capabilities, including access to our fixed RNA profiling kit, which is exclusively available on X Series. Turning to consumables where the breadth, performance and workflow of our broad menu of assays is an important differentiator for us and for our customers. As planned during the quarter, we began shipping two new kits designed to help make more samples and more sample types available for single cell analysis. The nuclei isolation kit, our first offering to help ease sample preparation provides a simple scalable workflows to make frozen tissues and previously challenging sample types more accessible for routine single cell analysis. This is a great example of how our continued innovation and workflow simplification will help expand our opportunity, bringing new labs and researchers into the 10x ecosystem and increase utilization among existing customers. It's early, but we're really excited by the strong initial adoption of this kit. We're also really pleased with the early feedback on our fixed RNA profiling kit, which we believe has the potential to be transformative to the Chromium franchise over the long term. It also offers a number of significant advantages including improved gene sensitivity, increased sequencing efficiency and built in sample multiplexing to achieve lower price at scale. While adopting a new workflow takes time, researchers have been running pilot experiments and side-by-side comparisons to see firsthand the performance of this assay. At the AGBT conference in June, we demonstrated how our fixed RNA kit can also unlock for the first time ever FFPE preserved samples for single cell analysis. Given that all the progress to date in single cell has been made using fresh or fresh frozen tissues, we expect this breakthrough capability should enable much more research, particularly in translational settings. Now, turning to Visium, while we're still early in the Visium lifecycle, we continue to be encouraged by the wider sustain adoption of the platform as the leading tool for our unbiased spatial discovery. To date, our customers have relied on Visium in almost 300 papers and pre preps. This is an important leading indicator and it also demonstrates the success, the discovery and translational researchers are already having with the current Visium platform. In June, we began shipping Visium CytAssist, our first spatial instrument. While it's still very early, we are pleased with the initial response and demand we're seeing from customers. By addressing the key challenges our customers have faced with the Visium workflow, CytAssist will enable more routine use of the Visium platform. We believe that ease of use, overall experience and performance is much better for customers and the data generated using the instrument is superb. In June, we also launched the second version of our Visium FFPE assay. Bringing up this new technology and associated manufacturing capabilities at the quality, scale, and resolution our customers expect is taking more time than we anticipated. As a result, we no longer expect to launch Visium HD this year. While we aren't providing an updated timeline right now, we are fully committed to delivering this capability to researchers as soon as we can. We continue to make great progress in the platform, which we expect to begin shipping by the end of the year as planned. At AGBT, the energy, interest, and enthusiasm from customers were stoppable and exciting to see so broadly. Internally, what has been particularly inspiring to our team is a strikingly powerful data we've been getting from our experiments, showing great levels of sensitivity, specificity and flex on challenging samples. Apart from used to work across a wide range of tissues, sample types, applications and biological systems. We believe from launch, Xenium will have the highest throughput of any in-situ instrument  enabling researchers to analyze the most tissue area of single molecule resolution in the least amount of time. And finally, we just designed Xenium to scale with customers evolving research needs, Future kits will be able to support the measurement of thousands of genes and infectious proteins on the same section. We firmly believe in Xenium's differentiated position, both at launch and as we look ahead at our comprehensive long-term roadmap for the platform. We're combining this customer input with our wealth of single cell data to design a broad menu of high quality curated gene balance, specific to both tissue types and application area. Stepping back, we continue to have every confidence in our technology leadership across each of our three platforms. Now, let's spend a few minutes on commercial. For the past few years, we've grown incredibly fast, too fast that the infrastructure we built didnâ\u0080\u0099t always scale with us, especially in commercial areas. In recent quarters, it has become clear that what got us to this point of growth wasn't going to get us to the next. Our challenge and our opportunity is to make sure our team has the right leadership, tools and processes, so we can increased leverage, scale to the next level of growth and unlock the massive opportunity we have ahead of us. Implementing better systems and tools will help us improve both our commercial execution and the customer experience in a number of ways, and here a few I'd highlight. First, we will reduce friction in the sales process and make ordering and reordering more efficient for our customers and our sales team. Second, we'll establish more rigorous and metric driven sales tactics to consistently manage our customers through every step of the sales cycle. We'll do this by establishing universal processes, robust training programs and better analytics that help with customer outreach and engagement. And third, we believe the right processes and systems will help us improve visibility and information flows, both within commercial and between commercial and the rest of 10x. Altogether, we believe these will help our sales be more efficient and effective with our time and know how to prioritize their efforts to have the biggest impact. This is essential as we further expand the breadth and depth of our portfolio, increase adoption with existing customers and continue to make inroads with new customer segments and applications. Now, I'm really excited to have Jim Wilbur on board as our new Chief Commercial Officer to lead this work. He comes to us from Meso Scale Discovery, highly regarded global leader in instruments and assays that have revolutionized protein measurement. He has a deep scientific and technical background, pride and developing high performing teams and is fundamentally a builder which I fact mean because we have so much more building ahead of us. My belief, and I know it's one you all share, is that its biggest single cell has become is really just getting started. In addition to our broad commercial reach and powerful innovation engine, we see our strong cash position as an important differentiator, especially in this environment. You heard me say it's the people of 10x who make the magic happen, which is what make decisions like these so difficult. The changes were made , especially for those directly impacted but they were necessary to make 10x more resilient in the current environment and more focused on our mission to drive our next phase of growth. Looking at the work ahead, we're incredibly grateful to our team for their dedication to our customers and tireless pursuit of our mission. To recognize their hard work and impact, we are making investments to further strengthen redemption and sustain the team's high engagement. As I shared at , during times of change we are staying focused on what's constant, our mission and our opportunity. We expect that in the future, just about old tissue samples, whether for basic research or for clinical diagnostics will need to be analyzed as single-cell resolution in spatial complex and at large scale. Yet through their research discoveries and publications, our customers remind us with increasing frequency of the tremendous potential of our technologies to accelerate the mastery of biology and ultimately Advanced Human Health. This is why despite all the progress we've made, we believe it's still early days, and this is why we are so confident in the end point and that 10x is the best company to deliver on it. Total revenue for the three months ended June 30, 2022, was $114.6 million compared to $115.8 million for the prior year period, representing a 1% decrease year-over-year. Consumables revenue was $97.9 million, increasing 1% over the prior year period and flat compared to the first quarter of this year. Instrument revenue was $14.7 million, decreasing 13% from the prior year period and up 2% from the first quarter of this year. Our Q2 results were impacted by macro headwinds, as well as some internal challenges. Revenue for the second quarter was $18.1 million, decreasing 15% from the prior year period and down 47% compared to the first quarter of this year. They extended into June and spread beyond the Shanghai area, impacting customer activity and resulting in lower sales. Revenue for the second quarter was $25.6 million, decreasing 11% from the prior year period and up 25% from the first quarter of this year. While revenues in the region improved sequentially, results were impacted by unfavorable currency fluctuations, delayed customer reorders related to the previously discussed cold chain logistics issue and some execution challenges. In the Americas, revenue for the second quarter was $70.9 million, increasing 8% over the prior year period and up 19% compared to the first quarter of this year. As a reminder, in the second quarter of 2021, we booked a onetime reversal of $14.7 million of accrued royalties related to a litigation settlement. Total operating expenses for the second quarter were $150 million, an increase of 24% from $121.3 million for the second quarter of 2021. The increase in operating expenses was primarily driven by higher personnel expenses, including stock-based compensation, increased research and development expenses and infrastructure costs, partially offset by a decrease in outside legal expenses. Operating loss for the second quarter was $63.1 million compared to a loss of $10.3 million for the second quarter of 2021, primarily due to the impact of increased personnel-related expenses. We ended the quarter with $500 million in cash and cash equivalents and marketable securities, net of restricted cash. As we are operating in a macro environment with increased economic uncertainty, we implemented a reduction in force of 8% of our global workforce to reduce spending, preserve cash and strengthen our financial profile. We estimate that we will incur between $5 million and $6 million of costs consisting primarily of cash severance, which we expect to recognize in the third quarter of 2022. In addition, we have canceled a number of open hiring requisitions and reduced our near-term hiring plan, while implementing targeted reductions in non-headcount spend as well. Over the next few quarters, we expect elevated levels of capital expenditures and subsequent cash burn as we finish construction of our operations facility in Pleasanton. We now expect our full year 2022 revenue to be in the range of $500 million to $520 million, representing growth of 2% to 6% over full year 2021. In the first half of the year, we experienced a slower-than-expected rebound as we emerge from the pandemic environment. This was driven in part by macro factors, some of which we expect to continue into the back half of the year. While we continue to have confidence in the tremendous opportunity our products are unlocking and the underlying demand for our technology, we are adjusting our expectations for the second half to reflect a more modest rate of increase and lingering macro headwinds. Thus, we expect Q3 revenue growth in the low to mid-teens percent over Q2, and we'd also expect Q4 to exhibit the same seasonality that we've seen in the past, barring any material changes to the macro environment. Thank you for all you're doing every day to push 10x, our mission and science forward. Maybe the first question, I really appreciate all the color on '22 and the macro factors involved there. I know Visium HD has been delayed, but there's number of new products coming on that could impact that growth rate. First off, there's a lot to be excited about when we think about 2023. So as you mentioned, a lot of new products coming out, it's going to be the first full year of Xenium. But as far as giving any color past that, right now I think we'll get through Q3 and Q4 without forecasting too far ahead of what we're seeing. I would emphasize, maybe to step back a little bit, a lot of what we're going to be doing, a lot of what we're going to be implementing matches more around the mechanics of commercial execution, not the fundamentals of the strategy. You kind of step back and think from first principles, we have -- you mentioned that weâ\u0080\u0099d have to focus on adding new customers to the ecosystem. And if you think about where -- how our business has evolved over the last several years, there's just been a huge increase in the complexity of our portfolio and also in just the shared number of customers that we have. And so it is on us to make it  our teams, certainly our sales reps and others, the tools -- much better tools to -- for them to know how to best spend their time most effectively and most efficiently and have the right analytics, information flows and tools. So that's going to be the Everest, I think there's a lot to be done across the board. It's a huge opportunity, and it's not going to be the kind of thing where it just sort of flip the switch necessarily, but over the coming quarters, we should expect to see good progress. As you alluded to, Jim, he has been here for all of its business days, so I want to be careful in terms of -- in terms of  on the specifics here. One thing I do want to emphasize, like I said in the previous answer is, the team is very strong. And I would caution again, focusing too much on the team turnover, which has not really been the case at this point. In the past couple of quarters, there's been a lot of discussion about Halo users and non-Halo users and sort of as the installed base has grown, how the divergence of some parts of the customer base and the utilization that comes with that. So it's hard at this stage to make any confident statements around these kind of longer-term guidance, which you -- which makes more sense to summarize in the course of across more like a year cadence. Overall, some similar trends we've seen before where instrument owners have consistent usage and consistent brands and daily users tend to be more episodic and use the products less. But Serge or Justin, maybe just back on new products, but more focused on this year. Iâ\u0080\u0099ve mentioned  there in particular, it's a new instrument. Certainly, as you've heard me saying multiple times now, fixed RNA profiling is a very exciting product. The one note of caution there is that, it's a new workflow, it takes some amount of time for people to benchmark it against our previous workflows. And Dan, as far as  the step up from Q3 -- as far as the step-up from Q3 to Q4 goes, what we're really getting across there is just we'd expect Q4 to exhibit the same type of seasonality that we've seen in the past. And then typically, with new products, we don't typically subscribe too much volume to new products right at launch or right after launch. And we're always launching new products, and they do typically take a number of quarters to get traction before they become meaningful. Maybe, Serge, just as a follow-up, I wanted to ask a question about CellPlex. As you've thought about the moving parts and the dynamics in the single cell market today, and you think about that product seemingly being important for the long-term adoption of single cell. CellPlex is one high throughput, HD kits is another one that has sort of some of the similar dynamics of reducing price per data point in order to drive volume. I would say so far, to the extent that we feel like  has fairly minimal kind of the extent of cannibalization on that front. So on the net, I don't think there's a material change yet that we're seeing. As far as your first question goes on trends to date, when we gave our updated guidance, we also gave some color on how we expect Q3 to go with a low to mid-teens percent increase from Q2 to Q3. And so far this quarter, the trends that we're seeing support that view. And then as far as your second question, just around overall growth in the different regions. One of your peers in spatial here called out this mix shift, if you will, away from multicellular resolution platforms to single cell or subcellular imagers. So we haven't seen, like, I would say, a material slowdown in Visium adoption. I think it's been sort of a different sort of use cases in many ways, and it's still quite early in that market. So it has been -- Visium has been growing, especially Visium FFPE has been growing quite robustly. So from that perspective, I think we're feeling good about the Visium trajectory, especially now with  coming out, which should put an additional sort of acceleration to the platform. But we absolutely see the excitement around in  projects and you refer to what's happened at the AGBT, we're certainly investing very aggressively in Visium. A lots of interest from customers, a lot of excitement internally here as well. Thanks for taking the questions. So I think before getting into the core of the question, I'll just talk a little bit about the drivers for Q2. On China, historically China has been about 15% of our business. And when we did our earnings call in the last cycle, when we reiterated guidance we also shared our assumptions for that guidance update, which had the China lockdown abating basically in May. And they didn't and they extended into June, and they also increased in scope as well. Keep in mind that 45% of our revenue is outside the U.S. And when you look at 2022 revenue, whereas about 17% is indirect foreign currency, we also have distributors that we sell through that we sell to -- that we sell to in U.S. dollars that sell to customers in foreign currency. And coming into Q2 into Q3 and Q4, we did expect a higher acceleration and we haven't seen it yet. And so really, while we're expecting a more modest increase today and still an improvement, it's not to the degree that we were expecting earlier in the year. And for right now, we're going to forecast what we're currently seeing with a more modest growth rate on top of that. I mean just in terms of kind of the balancing of kind of growth and profitability, you guys came out of the IPO, obviously, spent pretty aggressively going after this big opportunity, you put up great results for a couple of years stretch there. Can you just talk about how you guys balance that internally, again, still talking about the opportunity being very significant at the same time, focused on profitability. So maybe just talk about how you find that balance where you kind of direct the incremental dollars from here and kind of think about chasing growth versus, I guess, profitable growth versus kind of any growth. So I'll say like, first of all, at a very high level, we're still very much in growth mode. Now stepping back, if you look at, again, what has happened since over the last couple of years, since that deal, we've doubled the size of the team in the last two years. And it's not just the size that we've increased, the team organizational complexity, more layers, more roles, sometimes over specialized roles. And so there's an element of streamlining the organization kind of in -- really reflecting on the current economic environment, reflecting our current revenue rate doing some amount of adjustments to the organization and being more careful and deliberate with how we spend going forward. And so it is definitely a balance, but the first order, like we're absolutely investing and expecting lots of growth. Thanks for taking the questions. So you highlighted Serge upfront incredibly positive fundamental environment, but obviously, the last couple of quarters hasn't been as evident to us. And between the drag from the one-off factors and how your base business is doing, it'd be interested to get some more color there. So as far as -- on the first half of the year had a whole lot of different effects, puts and takes from different sizes. Like people need single cell resolution, they certainly need it for applications all across life sciences, all across biology. As far as questions in terms of cannibalization for spatial -- 3D spatial, I don't think that can be a material effect at this point given that there is not really much of both technologies out there, and we certainly would be seeing that on our side as well as that were happening. I think it's more broadly the slowdowns we've been seeing recently again these broad macroeconomic factors that Justin mentioned and also generally, we're still -- everybody is still trying to figure out what is the kind of the new world of research look-like coming out with the pandemic environment over the last two years. And then on 3D Spatial, well, I know you haven't really broken out specifics on the business in the past. So we don't currently -- you're right, we don't currently break Visium out. But I can tell you, as far as trends go, over the last few quarters it's relative percent of overall revenue, it hasn't fluctuated too much, meaning, it's been consistent volume-wise with the rest of the business. So as I said, there is -- this is like a very ambitious undertaking. But -- and we know it can be fundamentally, it can be done because we have the data to show that can be done. And we are adjusting our product development approaches here, but we're not ready yet to talk about the specifics or an updated time line. So on Visium, we are on track to launch it before the end of the year, and we have started taking preorders for these instruments precisely -- partially for that reason. Well, it is really feasibility at scale issue, because, again, internally, we have shown that it works, we see in the data and then transitioning into a scale is where there have been new challenges that we have encountered. Well, it's still very early. Like I said last time, HD was stalling some customer sales. It may actually unlock some going forward, but it's too early to speak at this stage. Earlier, we had said that we expected to be roughly flat year-over-year. I would say at this point, we'd expect it to be flat to slightly lower than last year. Justin, you mentioned the goal to be free cash flow breakeven or positive by the end of '23. Obviously, that's a quarterly number  you can get there. So as far as us putting out the goal to become free cash flow positive in 2023 -- by the end of 2023, we feel that hitting that -- it's an important milestone for us to hit to make sure that we have the right financial profile on our path to becoming a profitable company. And so obviously, there's different revenue scenarios that we're looking at for 2023. As we've shown right now, we are adapting to the environment that we're in, and I expect that we will continue to do so to the degree that it makes sense without hurting our longer-term growth prospects. So we'll share more about, like I said, the drivers for the 2023 top line later in the year. And also, just a few other points that we made on the call, we are expecting elevated levels of CapEx over these next few quarters, but I do expect those to drop off. So just on the spend side, that's a key factor to understand that once that operations facility is complete in roughly the Q1 2023 time frame, you will see a drop off in the CapEx. And we expect to spend roughly $140 million to $150 million CapEx over the next 12 months, but a good portion of that is front-loaded into the next couple of quarters. And then for Serge, just given some of the departures recently among the commercial and the marketing leadership as well as the reduction last week. So I just want to emphasize, the retention comment was made very much with forward -- with a forward lens. We have not had really material departures in terms of brain drain or -- in fact, I would say the level of talent in the company right now is as high as it has ever been, in fact, probably higher than it has ever been."
}