{
    "symbol": "WMC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-03 13:43:06",
    "content": " We achieved a number of accomplishments over the course of 2022, including completing 2 securitizations totaling $834 million of residential whole loans in the first and third quarters of 2022. Furthermore, we received $216 million from the repayment or pay down of our core assets, residential whole loans, and the remaining $1.2 billion portfolio has continued to perform well. And subsequent to year-end, we fully exited our ownership position in the CRE 3 junior mezzanine loans, selling it to an unaffiliated third party for $8.8 million, which was equal to the fair value of the loan at December 31, 2022. As a result, premium amortization expense from loan prepayments in the quarter was $677,000, down from $945,000 in the third quarter, at an average of $2.2 million for each of the first two quarters of this year. During the fourth quarter, more than $50 million worth of loans reset to higher floating rates, more than $90 million of current non-QM holdings are scheduled to reset in 2023 with more than $300 million resetting in the next 4 years. With respect to the junior mezzanine loan we refer to as CRE 3, as Bonnie noted, in February of this year, we fully exited our ownership position in this one, selling it to an unaffiliated third party for $8.8 million, which was equal to the fair value of the loan at both September 30 and December 31 year-end. We received $22.8 million from the sale and repayment of residential whole loans during the quarter, down from $41.3 million in the third quarter. Economic book value, which reflects the value of our retained interest in the consolidated securitization trust rather than the associated gross assets and liabilities decreased by 10.5% for the quarter to $17.23 per share as the value of the retained interest we hold in the securitization trust increased at a lower rate than the value of the assets impacting the economic value of our retained interest."
}