{
    "symbol": "ZVO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 19:21:02",
    "content": " Excluding certain items, our non-GAAP net loss for the first quarter of 2022 was $4.5 million, or a loss of $0.13 per diluted share. Turning to our other businesses, Fullstack Academy and TutorMe continue to perform well in the first quarter with revenues of $9.3 million growing 30% for the quarter year-over-year. Looking at the results of the quarter, revenue for the first quarter of 2022 was $61.6 million compared to $76.9 million for the same period in the prior year. For the first quarter of 2022, technology and academic services were $18.5 million or 30% of revenue, compared to $19.1 million or 24.9% of revenue for the comparable prior year period. Counseling services and support for the first quarter of 2022 were $21.3 million or 34.6% of revenue, compared to $25.3 million or 32.9% of revenue for the comparable prior year period. Marketing and communication expenses for the first quarter of 2022, were $21.9 million, or 35.6% of revenue; compared to $25.8 million, or 33.6% of revenue for the comparable prior year period. General and administrative expenses for the first quarter of 2022 were $7.1 million, or 11.6% of revenue; compared to $15.9 million, or 20.8% of revenue for the comparable prior year period. This is compared to a net loss of $9.5 million, or a net loss of $0.29 per diluted share for the first quarter of the prior year. The non-GAAP net loss for the first quarter of 2022, excludes acquisition costs of $0.5 million, certain non-GAAP stock compensation of $0.2 million, and other non-GAAP costs of $2.2 million including severance and legal costs. But first of all, we're really pleased that we're starting to see some outcome of the actions, and that was what I commented on a few minutes ago, that's for the first quarter of this calendar year sustaining were the ones for March 31st that the ending enrollment is greater than the beginning enrollment for the Universities and that, that follows the four quarters of 2021, which was a rough year, which we talked about. What I've been focused on since having the opportunity to lead this company, is that we address the root cause of enrollment decline, the contributing factors, we do that in partnership with UAGC's leadership team, which we do every day and I'm pleased with -- whether it's identifying the initiatives together, executing those initiatives, and ultimately the results that Kevin and I have shared in terms of improvement in the first quarter of this year."
}