{
    "symbol": "ATNX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 20:06:06",
    "content": " Our two lead clinical programs, KUR-501 and autologous GD2 targeted NKT cell product for the investigational treatment of patients with relapsed or refractory high-risk neuroblastoma and KUR-502, an allogeneic CD19 targeted NKT cell product for the investigational treatment of patients with PBC treated hematological B-cell malignancies are demonstrating very encouraging dose response and favorable safety and pharmacokinetics in Phase 1 dose escalation studies. Early results from ANCHOR, a Phase 1 dose escalation study were presented at the 2022 tandem meetings in April and demonstrated encouraging clinical responses in heavily pretreated patients with leukemia and lymphoma at the lowest dose levels of 10 million and 30 million cells per meter square. Thank you, and good morning, everyone. Looking ahead, first for KUR-501, enrollment of additional patients into the Phase 1 GINAKIT2 study at the 2 highest dose levels, dose level 5 or 300 million KUR-501 cells per meter squared is ongoing. And we continue to evaluate the possibility of investigating higher greater than 100 million KUR-502 cells per meter squared dose levels, as in the GINAKIT2 study as well as a multiple dose regimen within the same lymphodepletion time frame in the hopes of safely enhancing the frequency and durability of clinical responses in this heavily pre-treated B-cell non-Hodgkin lymphoma or acute lymphocytic leukemia patient population. As was also called out at this yearâ\u0080\u0099s ASTCT and CIBMTR tandem meetings, allogeneic CAR-NKT cells offer the potential to be the Goldilocks of cellular therapies, namely the best of T cells in terms of manufacturing, including proliferation post-activation and cryopreservation as well as memory and persistence, coupled with the best of NK cells in terms of tissue, lymph node tumor tissue homing and avoiding graft-versus-host disease without the need for TCR gene editing. Thank you, and good morning, everyone."
}