{
    "symbol": "ATNX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 01:43:04",
    "content": " This past quarter, we continue to advance our two lead investigational programs KUR-501 and autologous GD2 CAR-NKT cell therapy for patients with relapsed refractory high risk neuroblastoma and KUR-502 and allogeneic CD19 CAR-NKT cell therapy for patients with relapsed refractory B-cell malignancies. Data from both studies supported consistent findings, including encouraging responses at low dose levels, favorable kinetic profiles, demonstrating the ability of CAR-NKT cells to safer extend post adoptive transfer in all patients and peaking about one to two weeks post infusion. As a reminder, the interim data for GINAKIT2 study of KUR-501 in heavily pretreated patients with relapsed refractory high risk neuroblastoma included three objective responses in 12 patients with two of these three patients achieving responses at dose level four, that included a durable complete response persisting for over 12 months. Out of the five evaluable patients with non-Hodgkin lymphoma treated at low doses, a 60% overall response rate was observed, including two complete responses, persisting over six months and complete or partial responses in two or four patients who were previously treated with CD19 targeted CAR-T-cell. The clinical efficacy achieved this early in phase one clinical trial for a single infusion of KUR-502 at a low doses of 10 million and 30 million cells per meter square portends a high probability of clinical success, moving forward with dose escalation. Looking ahead KUR-501 enrollment of additional primarily pediatric patients with relapsed refractory high risk neuroblastoma in the single institution GINAKIT2 study of autologous GD2 CAR-NKT cells at the two highest dose levels, starting with those level five or 300 million cells per meter squared, while still maintaining the opportunity to offer a second cycle of treatment for consolidation is ongoing. Our KUR-502 the single institution ANCHOR study of one or two cycles of allogeneic CD19 CAR-NKT cells is presently expanding into a multicenter ANCHOR 2 study in order to expedite enrollment of patients with relapsed refractory B-cell non-Hodgkins lymphoma, chronic lymphocytic leukemia or acute lymphocytic leukemia. R&D expenses totaled $9.2 million for the third quarter, a decrease of $8.5 million or 48% year-over-year attributed primarily to our reduction in oral Paclitaxel development costs, as well as other operational costs."
}