{
    "symbol": "YRD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 11:54:04",
    "content": " In the third quarter of 2022, our total premiums reached RMB1 billion, representing a 36% increase year-over-year, surpassing the industry average growth rate by over six times. Revenue generated from Hexiang Insurance brokerage services reached RMB189 million, accounting for more than 22% of total revenue, and we expect to see an accelerated double-digit growth in the fourth quarter. Another highlight, I would like to point out is that second year renewal rate for our long-term insurance products reached 96.6% as of the end of the quarter this year, much higher than the industry average of 85%, which has further proven the high quality of our services. In the third quarter of 2022, total client assets reached the RMB 22.8 billion, an increase of 31% year-over-year, particularly on Yiren Select platform, which is the upgraded version of Yiren Wealth and our Super App strategy. With the ongoing penetration of our live class finance initiatives, and the balanced asset allocation investment educational concept, in the third quarter, the number of clients with client assets over RMB 1 million increased by 57% from prior year, a vivid reflection of the enhanced recognition for our improved serving capabilities. In the third quarter of this year, our total loan volume reached RMB6.3 billion, accounting for 66% of total loans facilitated in the first half this year and close to pre-restructuring level. Another notable highlight is that our MAU increased it to 1.7 million at the end of the third quarter this year, representing a 24% increase compared to the end of the last quarter, and a 54% growth compared to the end of the third quarter last year, due to our improved services and enhanced integration with our borrowers. Meanwhile, we see an increasing number of the users coming back for a second loan, as we continue to offer various value-added services and membership benefits, such as discounts, tailored insurance and products, and award credit in the third quarter of 2022, the repeat to borrowers accounts for 81% of the total borrowers for small revolving loan products compared to 62% in the third quarter last year, translating into a decline in acquisition cost per user. We delivered solid results this quarter, with total revenue reached RMB 841 million, accounting for 56% of total revenue in the first half of this year, with an accelerated recovery from the temporary impact of our product restructure and the pandemic lockdown. Contribution from holistic-wealth business reached RMB 294 million in the third quarter and accounting for 35% of the total revenue, up 8 percentage points compared with the same period last year. On the income side, total operating income was RMB 505 million this quarter, decreased by 38% compared with the third quarter last year. Turning to our balance sheet, our net income with substantial balance sheet reached RMB 5.5 million in total shareholders' equity of September 30, 2022, increased by 15% compared to as of December 31 last year."
}