{
    "symbol": "YRD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-17 16:02:07",
    "content": " For the full year of 2022, our total premium reached -- increased by 61% to approximately RMB 4 billion, significantly outperforming the industry average of 4.6% annual growth rate. Also, as for our customized exclusive whole-life insurance product,  that we mentioned last quarter, the premium saw a quarterly increase of 68% to close to RMB 100 million, reflecting its high popularity among our clients. Hexiang started to offer overseas construction insurance services in the third quarter last year, which had brought in approximately RMB 40 million premium with large ticket size policies as of the end of last year and is expected to post continued solid growth in the year of 2023. Looking into our holistic wealth business, total client assets reached more than RMB 23 billion as of December 31, 2022, representing an increase of 21% compared to the end of 2021. In the fourth quarter of 2022, our total loan volume reached to RMB 6.8 billion, representing an 8% increase quarter-over-quarter despite the COVID resurgence and the inflection peak post after reopening in November and December. In the fourth quarter of 2022, total revenue reached RMB 1.1 billion, representing a 29% increase quarter-over-quarter and 7% year-over-year due to our rapid growth in scale. On the quality side, total loan facilities this quarter was RMB 6.8 billion, showing a 10% annual growth, driven by offering borrower base and the strong demand of our smaller revolving loan product as Mei just touched on. As we continue in our Yiren digital operation, which like the cost savings from our subordinate departments, despite the write-up long volume allows for our contract assets receivable and others slightly increased by only 7% year-over-year to RMB 59 million due to the organization of our product mix. The full year 2022, total net profit reached RMB 1.2 billion, making an increase of  price compared to the prior year despite the impact from the growth of off-line business line that lays the dip in full year revenue."
}