{
    "symbol": "GLPI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 14:45:09",
    "content": " Please proceed with your question. I think we've had a conversation with every one of our tenants in the last quarter about different things that they are looking at, and like Peter said, no telling what will or won't happen, but it's a positive outcome for us to have that ongoing dialogue. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Yeah, the only thing that's tied up Robin as we talked about earlier, any new gaming developments that might come in the next seven years with the Cordish companies, that is one piece we’re hardwired into as a partner and we've got a few other structures with other tenants to have first look at things or the things that aren't – we don't know if they're going to come to pass or not. Please proceed with your question. The funnel is very wide at the top, but gets pretty slimmed down when you think about the criteria we have, and then it's a cost to capital question to see if each incremental opportunity, even if it's in an area that’s attracted us can make sense for us financially, and we have to wait and see how it plays out. We’ve got a lot of ongoing discussions across people that you might know the names of and that you don't know the names of, to think about ways where we might just like in gaming, get unique access or uniquely price something that could be the spokes solution for someone else and some sort of off market larger something. Please proceed with your question. And the most major tenant of ours and most applicable set of circumstances were our leases with Penn and we’ve since worked with them and I've arrived at a conclusion that we think balances these points very well, and effectively geo locates the activity that happens within our casinos and our leases with them and counts all activity that someone might have on their phone, which might sound like a small thing, but at the end of the day if I'm sitting at the bar with you, with someone else and we don't want to get up to go to a kiosk, there's certainly a decent amount of activity that happens in that manner, and it's really facilitated by the environment of the real-estate that the people are in."
}