{
    "symbol": "GBCI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-21 13:05:36",
    "content": " Pre-tax pre-provision net revenue was $106 million versus prior quarter of $92 million, an increase of $14 million, or 15%. Non-interest bearing deposits increased $233 million, or 12% during the current quarter. Net income -- net interest income for the quarter on a tax equivalent basis was $211 million, an increase of $12 million or 6% from the $199 million in the prior quarter. Despite the increase in interest rates, our gross new production for the quarter before payoffs was $1.7 billion, with yields at around 5.4%, which was an increase of about 80 basis points versus the yields in the prior quarter. The yield on the loan portfolio ended the quarter at 4.67%, up 15 basis points from the prior quarter and the core loan yield of 4.6% increased 19 basis points from the prior quarter -- core loan yield of 4.41%. On a tax equivalent basis, net income -- net interest income was $600 million in the first quarter and the first-nine months of the year, which was an increase of $111 million or 23% over the first-nine months of 2021. Our securities portfolio providing roughly $350 million of cash flow per quarter, which is being used upon loan growth. Your line is open. We've -- as we talked last quarter, we saw a lot of pull forward growth into Q2 that -- and then some pipelines slowing up a little bit as we discussed last quarter that's kind of reflective of what we saw in the third quarter. Your line is open. Your line is open. It could be -- in terms of fourth quarter, fourth quarter increase, it could be 15 basis points, 20 basis points of increase in loan rates next quarter. Your line is open. Your line is open. Your line is open. And the CRE growth really what participated out in the third quarter was a lot of the construction volume we had seen in prior quarters now that those have been rolled through to completion and stabilization they've moved out of that construction segment over to the firm segment, which is why you saw the commercial acquisition development construction line items drop quarter-over-quarter, that was expected as anticipated. And in terms of the volume and production, a little less on the construction demand for the reasons you noted, higher rates a little more difficult for deals to pencil unless there's a tremendous amount of equity, as Randy said, holding true to our credit discipline, that the projects that we are looking at typically have a very strong equity, cash equity positions in them and some good strong secondary support in the form of guarantor strength as well."
}