{
    "symbol": "GBCI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-22 14:43:05",
    "content": " Net income for the quarter was $76.4 million, an increase of $8.6 million or 13% from the prior quarter net income of $67.8 million. Pretax pre-provision net revenue was $92.9 million versus prior quarter of $88.8 million, an increase of $3.4 million or 4%. Core deposits continued to flow into our divisions, growing organically by $84.5 million or 2% annualized. Net interest income in the quarter on a tax-equivalent basis was $199 million, an increase of $8.6 million or 5% from the $190 in the prior quarter. Noninterest expense of $129.5 million decreased $787,000 or 60 basis points from the prior quarter. Overall growth in the loan portfolio not including PPP P loans was a record $714 million, again 21% annualized for the quarter. Our gross new loan production for the quarter before payoffs was a record $2.3 billion, a 27% increase -- gross new production of $1.9 billion. This quarter, core deposits increased by $85.5 million or 2% annualized. We added over $2 billion in new core loan production with yields around 4.5%, which was an increase of about 39 basis points versus the prior quarter. Noninterest income of $28.3 million declined $5.3 million or 16% from the prior quarter, primarily due to the reduced gain on sale income from residential mortgages. I think last quarter, we talked about kind of a glide path to fourth quarter run rate of $128 million to $130 million just want to get your updated thoughts on the outlook there too. And then maybe just touching quickly on the securities book just kind of taken the deposit commentary and the growth outlook together, would you expect that the securities books probably peaked here just given the organic growth outlook and cash flows probably reallocated towards loans, and then the new securities that you are putting on, just curious what you guys are buying or restarting to shorten up duration, just any commentary on that would be helpful."
}