{
    "symbol": "LINC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 13:07:02",
    "content": " Your line is open. Before the market opened today, Lincoln Educational Services issued its news release reporting financial results for the third quarter ended September 30, 2022. Statements made by Lincoln's management on today's call regarding the company's business that are not historical facts, may be forward-looking statements as the term is identified in Federal Securities laws. The words may, will, expect, believe, anticipate, project, plan, intend, estimate, and continue, as well as similar expressions, are intended to identify forward-looking statements. The company cautions you that these statements reflect current expectation about the company's future performance or events and are subject to a number of uncertainties, risks, and other influences, many of which are beyond the company's control that may influence the accuracy of the statements and the projections upon which the segment and statements are based. Factors that may affect the company's results include, but are not limited to, the risks and uncertainties discussed in the Risk Factors section of the annual report on Form 10-K, and the quarterly report on Form 10-Q filed with the Securities and Exchange Commission. All forward-looking statements are qualified in their entirety by this cautionary statement and Lincoln undertakes no obligation to publicly revise or update any forward-looking statements, whether as a result of new information, future events, or otherwise after the date thereof. Earlier today, we reported our third quarter results that were right in line with the expectations we laid out for you back in August. In addition, enrollments and graduation rates remain strong across our 22 campuses, and as we forecasted during our last call with you, starts during the third quarter did decline by 500 students as compared to a year ago period. Based on current trends and actual starts during October, we continue to expect fourth quarter student starts to increase at a solid rate. For example, the centralization automation of our financial aid process should accelerate both the financial aid application and award process leading to a better start rate and thus more students. The centralization automation of financial aid is an ongoing initiative requiring investment, however, it remains on schedule to be fully implemented by the end of 2022 and all signs are that we will realize a lowering of costs from this initiative during 2023. Our new hybrid teaching model provides greater flexibility for both students and faculty, while once fully implemented, lowering our operating costs. Not every program will be taught in the hybrid format, but all similar programs will be on a standardized calendar, which will assist with gaining efficiency across our campuses. As we've discussed in the past, this new model enables our students to work part time or manage other commitments, while they pursue their Lincoln Education, which will enable a higher percentage of students to successfully complete their education. Once existing programs are concluded and a majority of students are in the new hybrid model, we should start to see additional savings in efficiencies in 2024 and beyond. During the third quarter, we began to see the first tangible contributions in our topline performance from the new model, which provide certain classes and components digitally, while others remain in the traditional classroom setting. During our last call, we discussed three new corporate partnerships with industry leaders in electrical vehicle, electric vehicle, automotive paints and coatings, and collision repair segments. We are especially pleased to be partnering with Tesla, the world's leading electric vehicle manufacturer, as we help them meet their growing technician needs as well as potentially work with them in other areas of their organization. They like the quality of our students and the breadth of our program offerings and locations, especially our electrician program, since they view themselves as much more than just a car company. We're enrolling our first-class with Lincoln Tech and Tesla employees and will commence training in mid-December at our Denver, Colorado campus. Our corporate partnership agreements help our partners fill the urgent skills gap they are experiencing in light of the nation's continued overall low income, unemployment rate and increasingly more difficult search for employee training solutions required to continue their respective corporate growth. While there has been much talk in the financial media and government circles of the negative impact on job creation from rising interest rates, there still is a shortage of workers for the type of essential skilled position Lincoln trains for. Case in point, we recently celebrated the 20th graduating class from the Hussmann TechX Center located within our Grand Prairie, Texas campus, an effort to help fill a projected 385,000 HVAC job openings nationwide by 2030. Since 2018, Lincoln has helped Hussmann hire more than 200 new technicians across the country. During the third quarter, we announced the creation of a second campus in the metropolitan Atlanta area, one of the fastest growing metropolitan areas in the country. This new campus is strategically located in an area to serve students within the city limits, as well as points south of downtown. We expect to invest around $600,000 this year into the new campus and a total of $14 million in capital expenditures by the time we open in about a year. We continue to expect that within four years of its opening, the 56,000 square foot facility will be generating approximately $20 million in annual revenue and $5 million in annual EBITDA. The campus will focus on providing training programs in automotive technology, electronic and electronic systems technology, welding and heating, ventilation, and air conditioning technology. Combined with our existing Marietta, Georgia campus, north of Atlanta, Lincoln is positioning itself to be a major resource of train students to meet this expected demand. The new Atlanta campus is the first result of a plan to develop a minimum of five new campuses nationally within the next five years, each campus is designed to serve a local metropolitan market with the vast majority of the students coming from within 30 miles of the school. The curriculum will be based on our new hybrid teaching model and new technologies will be incorporated that enrich the learning environment and student experience, while giving our highly trained faculty tools to better track and monitor student success, all to continue to drive our strong graduation and placement rates. Based on employer demand for skilled employees and job growth projections nationwide, we have already identified 10 new markets where we can open new automotive and skilled trades campuses as part of our long-term strategic plan. Once that transaction closes, we will begin the process of transitioning our current operations to a new campus. We have identified a new site, but are waiting the closure of our current campus' sale before solidifying that transaction. Once we do close on our current campus sale, we will lease back the current facility until the build out of the new one is completed. As we discussed on the last call, the buyer of the Nashville property continues to pursue local agency approvals and continues to make the monthly non-refundable payments to Lincoln under the purchase contract, which as of today totals approximately $400,000. At this point, we believe the transaction will close during the second quarter of 2023 for a purchase price of $34.5 million. In fact, we're working on a new lease that will enable us to add automotive, electrical, and HVAC to our Lincoln Rhode Island campus. We're very excited by this recent development, which will enable us to leverage our existing management team and market presence with three strong programs and give us our 14th Auto Program. In addition to Lincoln Rhode Island, we will also be adding skilled trades programs into other existing campuses further leveraging existing management teams and market presence. Meanwhile, our constant evaluation of campuses has led us to closing our Somerville, Massachusetts facility at the end of next year. We were recently made aware of the building owner's decision to demolish the building and subsequently conducted a search in the Boston metropolitan region to move the campus, but were unsuccessful in finding the right location. As we've done in the past with campus closures, we are providing our current students with the opportunity to complete their program of study through December 2023. The campus offers medical assisting, dental assisting, and massage and serves approximately 250 students. As we look to the end of 2022 and into 2023, we continue to face the headwinds of a low unemployment economy that is providing students with other job opportunities, concerns over taking on debt in a rising interest rate environment, and inflation's impact on transportation costs in our operating expenses. As I noted earlier, we generated growth in starts during October and expects positive growth for the fourth quarter. However, the decline in Q3 starts and earlier softness in Q2 means our performance will be soft in the first half of next year. But as we opened the new campus and replicate programs, our second half should show much better in performance. Our transition to the new hybrid teaching model has higher temporary expenses as it requires additional faculty to complete the education of students that are operating under the old model, while the new model has started. In addition to incurring additional one-time costs, these two initiatives do generate some minor temporary inefficiencies in our business. The student experience and our operating efficiency both improved with these initiatives, and Lincoln's ability to scale more rapidly will be increased. Now, I'd like to turn the call over to Brian for review of our third quarter financial results and outlook. Veterans Day is particularly important for us at Lincoln since so many of our students, alumni, and instructors serve or have served in the military. into this bank agreement several years ago, when the company's cash position and financial performance were meaningfully lower. Since the bank agreement was established, operations have generated over $50 million of cash flow. In addition, we executed a sale leaseback transaction which generated net proceeds of approximately $45 million. Consequently, we are in a very strong cash position ending third quarter with nearly $7 million of net cash. Also, as Scott mentioned, our Board of Directors approved the plan to close our Somerville, Massachusetts campus in terms of the financial impact. For the nine months ended September 30th, 2022, campus revenues were $5.3 million, representing 2.1% of total revenue with an operating loss of $200,000. As a result, the closure of the campus is not expected to have a significant financial impact on the company. Beginning with our fourth quarter, the financial results for the Somerville campus including a full year of 2022 performance will be reclassified to and reported under our transitional segment. For the full year of 2022, campus revenue will be approximately $7 million with an EBITDA loss of $500,000. Moreover, for 2023, we are projecting an EBITDA loss of approximately $3 million, which includes the additional expenses to complete the teach out of these students and the other closing costs to the campus. As an update on our share repurchase plan, which we began in May, during the third quarter, we repurchase 668,000 shares for $4.2 million. As of the end of the quarter, we had 23.3 million remain remaining under our current share repurchase authorization. The revenue growth was mainly attributed to a 5.9% increase in average revenue per student, which offset a 2.7% decline in average population. The hybrid model delivers higher daily rates in certain programs, as their overall duration can be short, particularly, for our evening program. Our consolidated operating expenses were at $86.9 million, up 4.3% over prior year. And administrative expenses increased as a result of a couple of factors; salaries and benefit expenses due to salary increases and medical claims; severance expense, due to better align our cost structure in certain areas; and one-time items including expenses to advance our growth and operational efficiencies, totaling approximately $2 million. Our adjusted EBITDA for Q3 was $7.4 million, which includes add-backs of non-cash stock compensation, severance, and the rent expense for the Atlanta, Georgia campus. Revenue between $340 million and $350 million, adjusted EBITDA between $25 million and $30 million, net income ranging between $10 million and $15 million, student starts ranging from minus 3% to plus 3%, and capital expenses ranging from $8 million to $11 million. Given that third quarter results were better than expected and you reiterated for your guidance, the implied guidance for Q4 is pretty wide. You had said in your prepared comments that pretty much everything was in line with expectations for the third quarter with new students starts down 9.2% , was that in line with your expectations or it was a little bit lower than my than my point estimate? So, I think it was a little bit lower, one item was we didn't have starts in our Somerville campus in November and December -- November and December, I'm sorry, in October and September. So that full year reaffirmed guidance suggests a big increase in new students starts in the fourth quarter, greater than 12% or 13% by my math. So, as Scott mentioned in his comments, that starts were very strong for October, and we are anticipating growth for the fourth quarter. And the one thing that I misspoke when I talked about the full year guidance, it was a little bit higher because our Somerville campus that we'll close, it wasn't September, it was more in the fourth quarter that there -- we had to take those starts out in November and December. And then the full year guidance for starts, just to be clear was negative 3% to positive 3%. So, you're saying for the full year, starts kind of flat, maybe slightly lower year-over-year to get to the numbers that you're guiding for revenue and adjusted EBITDA and so on. And then obviously, you won't have the $304,000 of preferred dividends every quarter once that occurs. Your line is open. Sure, well, the increase that we are experiencing isn't tied to tuition increases, it's tied to the fact that our night program is now going to be in line with our day and afternoon programs in the new hybrid model. So, historically, we've been teaching the same curriculum to our nighttime students, but over a longer period of time, which means you're earning less revenue per student per month. But in the new hybrid model, they're going to be delivered at the same pace as the morning and afternoon classes, which means the acceleration -- there's an acceleration as we make this transition to the hybrid model in greater revenue. We should see that going into 2023, as well and as you mentioned, we are anticipating tuition increases like 3% to 5%, as well next year. So, we should get the benefit of both as more and more programs transition to the hybrid model, because it's the night program as well as it does shrink some other programs, but only by a month. We anticipate -- as we speak to our vendors, as we are going through the budgeting process, we're hoping to see some softness coming up. But it's basically the cash opportunities that we have are through our corporate partnerships now, versus through any kind of shorter term programs generating anything that's meaningful to us. Your line is open. It's really the latter, I mean, we definitely look to see what we could do in that marketplace with the programs. So, if you were to look at both campuses, and put a 30-mile radius around them, you'd see a Venn Diagram of overlapping opportunities there. So, it's not as if we're going to be leaving the marketplace 100% and we have a more attractive, I'll say, facility and rent structure in our Lincoln, Rhode Island. And as we look for programs and opportunities in the Boston market, it's just -- they just didn't avail themselves to something that was attractive as attractive of just growing, frankly, our Lincoln Rhode Island campus. And we look at the 2023, you have -- if we go back the past three quarters here and just kind of average it out, we're talking about negative on the student starts, and the first nine months of the year. To your point, Eric, that our carrying population will be slightly down, but what will be offsetting that is the what we just talked about tuition increases, as well as the rate increases that we're experiencing in our new hybrid model. But overall, when you looked at it, kind of, across campus and across programs, there was a decrease. So, I would say that where we see opportunity is, frankly, when we add new programs into campuses, and at those campuses, even when there's some I'll say, negative headwinds. By adding the additional programs, you're always able to kind of further penetrate that market and get some growth. But overall, I would just say there was definitely decreased kind of across the board in the third quarter, nothing stood out one way or the other. But it -- that's what you'll see in our add-back to our adjusted EBITDA, there was some and there'll be some more  in the fourth quarter as well. Your line is open. So I -- does start seems like -- I think is already pointed out, it seems like there's a -- in 4Q looks to be a pretty substantial swing in starts growth to get to the minus 3% to plus 3% starts. So, again, with regards to the guidance, with -- as it comes to starts, it would be negative 3% to 0% that I'd be focusing in on that range as far as where the fourth quarter is going to come out. As far as program demand and interest, as I kind of just stated, it's really kind of across the board, Raj, there's nothing that really jumps out -- like, no one wants to become a nurse anymore. And what we're hoping to experience is the trend, which I think we've seen before, at least recently, I've seen where more people are opting for shorter, faster ways to get into the workforce, regardless of the fact that there might be fewer people looking to make a change. But then we have to affect demand by looking to replicate and add more programs into our campuses, in our existing marketplaces, to again, get further penetration within an existing market to give us that growth. And we also anticipate that hopefully, as we move to the hybrid model, the flexibility that that gives students will enable more students to start. And as we have the financial aid process up and running smoothly, again, more students that know exactly how they're going to pay for their education are more likely to start their education. So, it's a matter of putting things online just to be able to continue the students' education, which we ended up doing very well, which is why we were able to grow the population. And so what the new model is, is basically, students coming to us only four hours in the day compared to maybe five or six hours in the day, and the rest being learned online. And that's advantageous to students because sometimes our students do switch between sessions as their jobs may change, and they may go from an evening to a night. Also the way that it is structured, we can better utilize our faculty members, to the extent we can populate students in the morning and afternoon, one -- in theory, one instructor can now teach two classes of students. So, that not only will create operating -- operational efficiencies in our business offers financial aid, but as well as marketing. Our major initiatives around financial aid in our hybrid model are progressing as planned, and will result in in efficiencies and even better student outcomes. Next year, we have the new Atlanta campus opening along with multiple program replications, which will enable us to better serve students and employers in several of our existing markets."
}