{
    "symbol": "GROV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 22:04:08",
    "content": " With me on today's call are Grove's, Co-Founder and CEO Stuart Landesberg and CFO, Sergio Cervantes. Some of the statements that we make today about our future prospects, financial results, business strategies, industry trends and our ability to successfully respond to business risks may be considered forward-looking. During today's call, we will also discuss certain non-GAAP financial measures. In 2022, we laid out our value creation plan with a goal of achieving profitable growth in 2024, and I'm pleased to report that progress against this strategy drove full year results that were ahead of our guidance on both top and bottom line for '22. Our value creation plan is built upon four pillars, improved marketing efficiency, omnichannel expansion, net revenue management and operating expense discipline, and we made progress on each during the fourth quarter. Now you'll hear Grove talk more about the growth drivers for 2024 and beyond, starting with today's call. That marketing overspend will benefit cohorts through the beginning of 2023, but as revenue stabilizes in the back half of this year, we are working to set ourselves up for growth in 2024. The first is channel expansion into retail, which I've discussed previously and we'll talk about more on this call, category expansion into wellness on our GCC site via Grove Wellness, the launch of which we announced today, and three, mergers and acquisitions, including through our partnership with HumanCo that we announced last quarter. Now on to our fourth quarter results, marketing efficiencies continue to improve on lower spend levels across channels, particularly in paid social and organic. The Amazon launch was facilitated by learnings gain from our plastic-free personal care brand, Peach not Plastic, which is approaching one million in lifetime sales on Amazon since its November, 2021 launch. We remain excited about this growth strategy that is not only extraordinarily capital efficient, but puts Grove products in the places where over 90% of purchases in our category are made. During the fourth quarter, we also implemented several net revenue management initiatives focused on strategic pricing, both on third party and growth brand products and on optimization of DTC net revenue provider. These initiatives are particularly important in this environment where inflation remains stubbornly high and while consumer response has been in line with our expectations, we are continuing to monitor our consumer's price elasticity in response to these actions. Lastly, by maintaining strict expense discipline, we've been able to streamline our operations and redirect resources towards initiatives that are most aligned with our objective of attaining profitability while investing for long-term future growth. Adjusted EBITDA loss in the second half of '22 was $19.1 million as compared to a loss of $60.7 million in the first half of 2022, a staggering improvement of $41.6 million as we implemented our VCP. Margins declined 50 basis points sequentially and improved 1,610 basis points year-over-year and came despite lower revenue as we strategically cut back on advertising spend to focus on the most efficient channel. It's also worth noting here that once we remove the impact of non-cash items, gross margin and EBITDA margin was up both sequentially and year over year. While the reduction in advertising spend has resulted in year-over-year comparative pressure on revenue, our current efforts to improve advertising efficiency have driven strong results and we remain confident that is the right step to position ourselves for profitable growth in the future. During the quarter, we continue to make progress towards our goal of being free from single use plastic waste by 2025. In the fourth quarter, 65% of Grove brand's net revenue came from either zero plastic, reusable or refillable products, meaning the companies beyond plastic standard, up significantly from 49% in the fourth quarter of 2021. Site-wide and through our retail partners, plastic intensity improves 0.98 pounds of plastic per $100 in revenue from $1.21 in the fourth quarter of 2021 and across all Grove brands, plastic intensity moved from 0.80 pounds of plastic per $100 in revenue from 0.99 pounds in 4Q '21. As I mentioned, one of the things I am most excited about is that we have line of sight to stabilizing our core business despite the challenging environment as we lap advertising -- as we lap the advertising overspend in the first half of 2022. I've already touched on the omnichannel distribution opportunity, so I'd like to take a minute to discuss the two other growth levers; wellness and M&A. Wellness is a massive market with dietary supplements alone, they're expected to reach $53 billion in the US in 2023. As we investigated our consumers' pain points and exciting, 89% of respondents said they would trust Grove over other brands to provide them with wellness product. Since our founding, our mission has been to make the CPG industry a positive force for human and environmental health and we are excited to further this goal to our strategic expansion into wellness. During the quarter, we announced that we entered into an agreement with HumanCo investment, a subsidiary of HumanCo, the mission-driven health and wellness holding company, co-founded by Jason Carb and Ross Behrman. Under the agreement, HumanCo will help us identify, evaluate and fund material M&A opportunities that can accelerate Grove's business and mission impact by quickly driving scale and shortening our path to profitability. We partnered with the intention of finding one or more highly synergistic M&A opportunities that has meaningful impact to accelerate our profitable growth strategy and to this end, HumanCo has agreed to consider funding up to a $100 million of new capital as previously announced. While we remain laser focused on continuing our path to improve profitability as an independent entity, as demonstrated this quarter, we believe the difficult macroeconomic environment will provide step change opportunities to advance our mission and create meaningful shareholder value over the coming quarters and years. Similar to previous calls we'll provide quarter-over-quarter comparisons in addition to the year-over-year changes, as we believe the sequential comparisons better reflect the trends in the business and the steps we have taken to position ourselves for sustainable profitable growth. Similarly, total orders were down 9% quarter-over-quarter and 25% year-over-year to $1.1 million and active customers were down 6% quarter over quarter and 16% year over year to $1.4 million on a trailing 12 month basis. Partially offsetting the declines in total orders were continued positive trends in DTC net revenue per order, which was of 5% quarter-over-quarter and 11% year-over-year to $63.04. This increase was driven primarily by the impacts of net revenue management initiatives, including the implementation of price increases on both Grove brands and third party products and introduction of a supply chain fee at the end of the third quarter, as well as by strong performance from seasonals. Excluding the full impact of the inventory reserve in the fourth quarter, gross margin would have been 51.7%. The year-over-year increase was driven primarily by the positive impact of the above mentioned net revenue management initiatives as well by the improved promotion and strategy partial offset by increased charter cost, including inbound freight costs. The year-over-year decline was driven by the launch of a large number of new third party products on to our website as compared to Grove brands as well as by a decrease in new customer orders, which tend to include more Grove brands products. The year-over-year increase was driven by $7.2 million increase in stock-based compensation, largely from charges related to our reviews from which we had started to record related expenses in June 22 when the performance condition related to going public was met as well as by $5.3 million expense related to operating these right of use asset impairment and an increasing cost related to being a public company. Excluding stock-based compensation, difference and the right of use assets-based permit SG&A expense in the quarter would've been $35.1 million or 5% less than the third quarter of 2022 and 17% less than the same period last year. Our adjusted EBITDA loss was $9.5 million, a slight improvement from the $9.6 million loss in the third quarter and a material improvement from the $25.2 million loss in the fourth quarter of 2021 despite lower sales. Our adjusted EBITDA margin declined by 50 basis points, quarter over quarter and improved by 1,610 basis points year-over-year to minus 12.9% inclusive of the impact of non-cash inventory reserve. Net income in the third quarter and fourth quarter of 2022 was inclusive of $32.6 million, $22.4 million respectively in gains of re-measurement of derivative capabilities. Turning now to the balance sheet, we finished a quarter with an inventory balance of $44.1 million down $11.9 million from the end of September, 2022, fueled by our yearlong efforts to improve working capital, coupled with increase in the inventory reserve. We end the quarter with $96 million in cash, cash equivalent and distributed cash, down $7.8 million from the previous quarter, mainly from the adjusted EBITDA losses, partial offset by improvements in working capital. Of sequence to the end of the quarter, we closed on an asset based loan facility with $35 million total capacity for which borrowing capacity is calculated from our inventory and account balances. Now turning to our outlook, we made considerable stride towards profitability in 2022 ending the year are a significantly lower rate than the rate we began hit with. Consumers continue to feel pressure and we are seeing the impact across our businesses, particularly in the retail channel. For the 12 months period ending December 31, 2022, we expect net revenue of $260 million to $270 million, adjusted EBITDA margin of minus 9% to minus 11%. In conclusion, while the environment remains challenging on the headwinds for our strategic reduction in other tighten spent will drive revenue down year over year in 2023, the year over year improvement is adjusted. We continue to invest in future growth drivers such as omnichannel expansion, the health and wellness vertical and strategic m and are excited about the future as we position ourselves for long-term success and leave the CPG industry away from plastic. We're very pleased with the improvements that we have made in our push to profitability, rapidly moving the company towards positive EBITDA despite the challenging environment. As Sergio stated, we plan to continue our aggressive push to outperform, especially on the bottom line throughout 2023 and set ourselves up to drive growth once we are past the challenging variables to overinvestment in marketing in 2022. That combined with opportunities for growth in retail, wellness and m and a should make this a very exciting year for Grove, for our mission and for all stakeholders. When you get a consumer product they truly love and when we surveyed our consumers, something like 78% of consumers are already taking vitamins and supplements and the stat I mentioned in the call blew us away. And from a business perspective, when you look at the P&L, these are higher average unit revenue products than our core home care category and when done well, it can also be a higher margin category. I think it's unclear that one will be the future for us, but what we are certain of is that the playbook of gathering data from a direct-to-consumer business model to allow us to create real innovation that answers a customer need is one that works in home care, works in personal care and we are certain will work in VMS. And then hopefully, over not too much time a place where we can leverage the learning in the second pillar category to not just improve our P&L today, but really help us build brand through innovation from a sustainability and efficacy perspective just like we did in home care in a second category that can drive expansion. So I don't want to say that's going to come out and impact our 2023 financials, but certainly we expect to use the same playbook that's been really successful in driving customer satisfaction, loyalty and innovation on the home and personal care side. If you do see us make a big investment here, it'll be one that we have a ton of conviction in and because we have the data to support that, that's an investment that can really step change what's happening for us in the category. And then if I could just add one more I'm curious, I'm not sure if you talked about just the growth in wholesale versus DTC in the quarter, if there was any big divergence there and then also the recent rollout to Amazon, Walmart, etcetera. I'm curious if there's any early reads there and if you're seeing any impact on the other channels that you already did business in, such as like your own DTC site or target. And from a cannibalization perspective across channels, we've now gone from 1600 target doors to well over 5,000 and we haven't yet seen any reason to believe there's sort of a cannibalistic impact from one channel to the other. In practice, what's probably happened is wheat happening is we are losing some customers to target in other places and there's probably other customers who find us in target and then come to our direct consumer side. So what we really do see is the biggest result of growing our retail presence is that our awareness is growing and we think that will have long-term benefits across the omnichannel footprint, but we don't have any reason yet to think that we're trading customers off among channels. I think, when we look out across driving profit -- our push to drive profitable growth in 2024, and we do still think we will grow that year and we do still believe it's possible that we will hit profitability that year; very optimistic. Talked a little bit about the call, the big marketing spend in the first half of '22 and just as a reminder to folks, if you haven't seen our first investor presentation, really the first six months of a cohort's life are particularly strong and then the first 14 months are strong and then after the first 14 months you really don't see a whole lot of degradation. So if we are lapping, high marketing spend through June, you can sort of 14 months from there is where we'll stop having the particularly tough comparables on a year-over-year basis. And also how do we build the right muscles around improving marketing efficiency, which I've been extraordinarily pleased with our progress and pushing for faster payback and improving metrics up and down the P&L including gross margin and you can see revenue came down on a year-over-year basis, but gross margin came down less because we're really doing a nice job controlling margin. So I'll let Sergio speak to the specifics, but our overall goal really is to make sure that we emerge from 2023 with a healthy P&L and an incredibly healthy set of practices and metrics across the business that can drive sustained profitable growth. So, one of the biggest impacts that we have seen and is a conscious decision as we move into the future per previous discussions is prioritizing profitability. So reducing the level of investment yes, it's impacting, it's impacting the growth that we have projected before and that we have put out as guidance for 2023. I would say at this point, because I'm not going to digest it and clarify split specifically the question, but I'm going to tell you that the majority is coming from the reduction in advertising as you could imagine. So basically as we, of course part of the strategy as Stu was describing, we have three levers for that growth and it's pretty important for us to continue pushing for the growth. So those together with the assessment of volumes, the assessment of how they go to market, what type of businesses they carry in the different regions, that's part of the assessment. And of course, at the beginning of each of those investments, you would imagine that we have impact in the profitability and as we go and grow in the different channels, we expect this to become profitable by having better leverage on the levers that we can pull by reducing the level of investment that is required at the beginning of each launch and also by having more awareness of our brand out there, but I'm going to leave also some space for Stu to answer this question. I will just say, I think at a high level, Dana, we see that the push towards zero waste from consumers is continuing to be a big sale for us. And I think that's something, something like 84% of US consumers want to see action taken on single use plastic. And I think, when I look at partnerships across the board, I think, look, we're learning into retail, we have a little over a decade of experience in DCC and not even two years in retail. And so as we continue to learn into the channel, I think the core thing that allowed us to be so successful in gaining distribution, in growing skew counts and continuing to put up good velocity numbers really is that intrinsic consumer value proposition of being a product that answers an unmet need in terms of zero waste that can be available at a really approachable price point. And so I think, Sergio's right, the rollout has been a little bit slower than we had originally anticipated, but growth rates in this segment are still very healthy."
}