{
    "symbol": "VRA",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-07 12:43:05",
    "content": "  Vera Bradleyâ\u0080\u0099s direct full price channel customers with higher household incomes remain more engaged and continue to spend more than customers with lower household incomes, especially in our Vera Bradley factory channel where inflationary pressures impacted traffic and discretionary spending; however, our Vera Bradley indirect channel experienced its third consecutive quarter of year-over-year growth. We do believe that continuing to leverage the ecommerce business, our indirect business, and really looking at our full price business as a way to get to the customer in the most efficient way and in the place where she shops, so I think that youâ\u0080\u0099re going to see that rationalization kind of continue through this year. As we detailed, a lot of the build is associated with just the cost to get inventory from Southeast Asia to Indiana, so as we think about next year, we anticipate--and obviously weâ\u0080\u0099ll come out with our guidance for next year at the next earnings release, but we anticipate by the end of next year getting inventory back in line to where we would normally be, and so ultimately we would expect to see some free cash flow benefit next year associated with that and a reduction in inventory. Weâ\u0080\u0099ve been--you know, weâ\u0080\u0099ve added some promotional deals into the brand and the consumer has responded, so we expect that as we move through fourth quarter that it will continue to be promotionally driven, targeted promotions but promotionally driven nonetheless, and so I think thatâ\u0080\u0099s part of the balance as we kind of move in the year ahead, is just how to balance that promotional environment for the consumer and finding opportunities to offset that expense through other ways, whether thatâ\u0080\u0099s through product cost or whether thatâ\u0080\u0099s through general SG&A. I think thatâ\u0080\u0099s another key area that Jacquie is really looking at as sheâ\u0080\u0099s thinking about the next go-forward strategy is kind of what is the role that stores play in Pura Vida, what are the first things she really wants to attack to get that business back on track. Weâ\u0080\u0099ve learned a lot as weâ\u0080\u0099ve worked through the franchises at--Disney is a great one, right, when we talk about our Disney collaborations, thereâ\u0080\u0099s a lot of different franchises within Disney that weâ\u0080\u0099ve worked with, and some of them have really worked well, particularly the ones that kind of fit with the Vera Bradley DNA, and so I think we get smarter and smarter over time, but I think it will continue to play a role but it will be a measured role as we move forward."
}