{
    "symbol": "CHRD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 13:44:02",
    "content": " Given this performance and combined with our strong balance sheet and alignment with our return of capital framework, we announced in August, we anticipate delivering 85% of our free cash flow generated in the quarter back to shareholders. So in aggregate, given our strong performance in the third quarter and taking into account the items above, we expect to deliver total second half production volumes favorable to our August update was slightly less oil, but also slightly less capital. Now turning to our return of capital program, given the strong quarterly performance previously discussed, we delivered an exceptional adjusted free cash flow of $326 million for quarter. Since the merger closed and including our November payout, we will return $869 million of capital as Chord, and our third quarter return of 85% of free cash flow will amount to $277 million and represent an annualized deal of 18%. In closing, a huge thank you to the full Chord team for delivering a great third quarter and expectations for the remainder of the year, this sets us up well moving into 2023, led by strong well performance and continued focus on cost control, which leads to excellent return on capital and a peer-leading return of capital program. Please go ahead with your question. When we think about capital with the inflation weâ\u0080\u0099ve seen to date through sort of run through the system and given where we think things are going as we move forward, weâ\u0080\u0099re expecting maybe around a 10% increase cost for 2023 relative to 2022. Please go ahead with your question. So given the free cash flow generation, the low reinvestment rate that weâ\u0080\u0099ve got in our balance sheet, I think weâ\u0080\u0099re in a great position for return of capital. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}