{
    "symbol": "NTAP",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-30 22:33:05",
    "content": "  During today’s call we will make forward-looking statements and projections with respect to our financial outlook and future prospects, such as our guidance for third quarter fiscal year 2022; our expectations regarding future revenue, profitability, and shareholder returns; the value we bring to customers; our ability to drive growth in our Hybrid Cloud segment and scale our Public Cloud segment; and our ability to manage through the current supply chain environment; all of which involve risk and uncertainty. Building on the momentum of last year and the previous quarter, revenue grew 11% year-over-year, with Public Cloud segment revenue growth of 85% and Hybrid Cloud segment revenue growth of 8%. As I’ve said many times, our Public Cloud services not only allow us to participate in the rapidly growing cloud market, but they also make us a more strategic data center partner to our enterprise customers, driving share gains in our Hybrid Cloud business. Public Cloud ARR grew to $388 million, an increase of 80% year-over-year, and Public Cloud dollar-based net revenue retention rate remains healthy at 179%. Number 1, Q2 was another strong quarter, with results at the high-end or above our guidance; number 2, our business model continues to show significant operating leverage as we grow our operating profitability and margins; number 3, our Cloud business had another outstanding quarter as we march towards the $1 billion ARR target; and number 4, we are increasing our full year guidance for revenue, EPS and Public Cloud ARR, driven by the outperformance in Q2, the addition of CloudCheckr, and a healthy demand pipeline for the second half of our fiscal year. Public Cloud ARR exited Q2 at $388 million, up 80% year-over-year and 15% sequentially, driven by strong growth in Azure NetApp Files, Spot and Cloud Insights. When combined, software product revenue, recurring support and Public Cloud revenue totaled $1.2 billion and increased 13% year-over-year, representing 74% of total revenue, up from 72% in Q2 '21. In total, our new guidance for exit fiscal '22 Public Cloud ARR is $510 million to $540 million, which at the midpoint, implies a 74% increase year-over-year. We are forecasting operating expenses to range between $2.795 million and $2.815 billion, driven by investment in revenue generating activities, including expanding our Public Cloud portfolio, and investments in both our Cloud and customer success sales teams. We remain committed to delivering more than $1.2 billion in free cash flow in fiscal '22, as our Hybrid Cloud business continues to fund the growth in our Public Cloud platform. Your line is open. Your line is open. And I think if you look at the second half guidance, my expectation is you should see that continued progression of the first half trends with product and cloud services growing quickly, and our services business growing a little bit slower than that in the overall revenue mix. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. We increased our full year guidance for revenue, EPS and Public Cloud ARR, driven by the outperformance in Q2, the addition of CloudCheckr and a healthy demand pipeline for the second half of our fiscal year."
}