{
    "symbol": "KUKE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 12:13:08",
    "content": " In terms of our smart music learning solutions segment, despite the headwinds in a challenging environment for education business, we have prioritized establishing deep rooted collaboration with public schools and kindergartens since the fourth quarter of last year, with an aim to further enhance our revenue streams through providing high quality smart music learning solutions to the underserved market of art and music learning in China. For our live music events segment, revenue in the first quarter reached RMB 13.8 million, mainly driven by income from the marketing, planning and execution services for live music events in China. During the first quarter of 2022, our revenue increased by 128.8% to RMB 26.1 million from RMB 11.4 million in the prior year period, and of which our licensing revenue increased by 275.8% to RMB 1 million from RMB 0.3 million in the same period of 2021 due to the larger client base. Specifically, smart music learning solution sales revenues increased by 183.1% to RMB 1.2 million from RMB 0.4 million in the same period of 2021, mainly due to increased sales of smart music learning products to public schools in the first quarter of 2021. Specifically, the gross margin of classical music licensing improved to minus 192.3% from negative 481.2% in the same period of 2021, mainly due to the year-over-year revenue growth in the quarter. Specifically, the gross margin of smart music learning solution sales rose to 35.8% from 28.8% in the same period of 2021 due to increased revenue from the business. So, for the second question about the rapid growth, the revenue from smart music learning solutions sales increased by 183% to RMB 1.2 million from RMB 0.4 million in the same period of 2021. During the first quarter, we have added full category long form videos content, including opera, live concerts, ballet, documentaries, masterclasses, international competition, and doing live streaming to further enrich our classical music library and also capture the growth opportunity across the China market."
}