{
    "symbol": "OMF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 13:23:02",
    "content": " Originations were $3.6 billion for the quarter, down 8% from the third quarter last year, but relatively strong given our cautious underwriting posture. For instance, we have significantly decreased unsecured loans to new customers and our top 2 risk rates, those with the best credit quality and lowest risk customers make up 60% of our new originations today versus 37% a year ago. Capital generation was $283 million, down $77 million from the third quarter of 2021, reflecting a $128 million increase in net charge-offs from the historic lows we saw in the year ago period. Net interest income was $895 million, up 2% compared to the prior year quarter, driven by higher average receivables. Loan net charge-offs were $290 million or 5.9%, above the historically low 3.5% we reported in the third quarter of 2021, but in line with the 6% we reported last quarter. Third quarter operating expenses were $359 million, up 6% year-over-year as we continue to invest in new products and channels, technology, digital and data science while maintaining expense discipline across our business. I would caution you on first quarter and second quarter of 2022, the year-over-year compare is going to be a little bit difficult because of the fact that we still had some of the tailwinds from stimulus and think about where the 30 to 89 was in the third quarter of it was still pretty low coming off that massive stimulus we saw in March of '21. But just like charge-offs, you're always kind of working a little bit behind here where the stuff we're putting on the books today, while it's flat to second quarter and up modestly versus prior year, -- it's going to take some time for that to sort of hold in a $20 billion portfolio. So if you kind of think about that, I think you'll start to see some credit tailwinds over the next 3 to 4 quarters, of course, assuming a stable macro environment and to fully reach -- assuming we stick with that box for the entire period, but I think take by end of next year, you would certainly expect, given the trends I just laid out, would be sort of fully incorporated."
}