{
    "symbol": "LBAI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 15:36:06",
    "content": " We posted record net income of $29 million driven by net interest income of $80 million, representing a 14% increase from the prior quarter. The increase in net interest income is attributable to our meaningful margin expansion plus our organic loan generation during the quarter, which totaled $270 million, representing a 16% annualized growth rate, while we're able to keep deposit betas low during the quarter. Noninterest income bearing deposits increased $30 million during the quarter and now total 27% of total deposits, while core deposits now make up 91% of total deposits. As Tom mentioned, Lakeland's second quarter net income was a record of $29.1 million or $0.44 per diluted share, compared to the first quarter of 2022 of $15.9 million or $0.25 per diluted share, and the second quarter of 2021, which was our previous record net income of $27.4 million or $0.53 per diluted share. To crystallize the record net income for this quarter, our previous high record income of -- in Q2 of 2021 was aided by a negative provision for credit losses of $6 million compared to the current quarter provision for credit losses of $3.6 million, which equates to a $9.9 million unfavorable impact to pretax earnings. On the income statement, Q2 financial results were favorably impacted by the organic loan growth of $270 million, deployment of excess cash into higher-yielding assets and the increase in interest rates, all combining to increase yields on our interest-earning assets by 36 basis points for the quarter. In comparison to the prior quarter, our pre-provision net revenue, excluding merger-related charges in Q1, increased $10.5 million or 33% to $43.2 million in Q2. The yield on our loans increased 30 basis points from the linked quarter to 4.22%, while loan prepayment fees remain elevated and combined with interest recoveries on nonaccrual loans and PPP fees had a positive net impact of 8 basis points to net interest margin compared to the prior quarter. Q2 net charge-offs were a recovery of $141,000 and would represent the fourth consecutive quarter of net recoveries excluding the accounting for the acquired 1st Constitution purchased credit deteriorated loans in Q1. Q2 noninterest expense of $45.1 million decreased $4.9 million in the linked quarter, which reflected the merger-related expenses from the 1st Constitution acquisition in Q1. On the balance sheet, in comparison to the prior quarter, total assets increased $98.9 million or 1%, with loans increasing $270.4 million or 3.8%, while the cash balances decreased $176.2 million to historical liquidity levels. For capital management, our capital levels remain strong and we're relatively static compared with the prior quarter with tangible capital ratio decreased less than 1% to 8.01% at June 30 compared to 8.07% at March 31, as asset growth, cash dividends and other comprehensive income changes offset earnings retention for the quarter. I mean if you were to back out the merger-related expenses that we had for our 1st Constitution in Q1, it's -- what we're looking at now is the $45 million of operating expenses in Q2 is a pretty good run rate for us as we head forward for the rest of the year."
}