{
    "symbol": "OKE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:16:03",
    "content": " Yesterday, we announced strong third quarter 2022 earnings, affirmed our 2022 financial guidance midpoints and provided our 2023 growth outlook to exceed $4 billion of adjusted EBITDA. Looking forward, we expect continued strength in producer activity and increased volumes and higher earnings from our fee-based services in all of our business segments in a favorable commodity price and increasing demand backdrop. After the waiting period ended, we incurred costs subsequent to the 45-day business interruption waiting period of $21.7 million, primarily related to third quarter -- I'm sorry, to third-party fractionation agreements and recorded a partial impairment charge of $6.7 million, representing the value of associated with certain Medford facility property based on the limited assessments completed to date. And lastly, for the third quarter, we ended with higher NGL inventory levels that have since been sold forward, and we will realize $17 million earnings benefit from those sales in the fourth quarter and first quarter of 2023. Key drivers for our 2023 outlook of a more than 10% increase compared with our 2022 midpoints to exceed $4 billion in adjusted EBITDA include continued strength in fee-based earnings and rates, stable to growing producer activity providing higher natural gas and natural gas liquids volumes in our system and expected higher realized commodity prices due to higher hedges. Rocky Mountain region NGL volumes increased 17% year-over-year and 12% compared with the second quarter 2022, driven by volume recovery following the April severe weather and overall volume growth, including higher incentivized ethane on our system. In the Natural Gas Pipeline segment, with strong year-to-date results benefiting from the continued increasing demand for natural gas storage and transportation services, we now expect this segment to exceed the high end of its guidance range of $400 million to $430 million. Think about the overall 2023 growth outlook, we expect our volumes are going to be up, both NGL and Gathering and Processing in all of our basins with the tailwinds, with the existing rigs we're seeing today as those carry over into '23."
}