{
    "symbol": "ABOS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 20:09:08",
    "content": " As many of you know, there are a number of anticipated upcoming clinical and regulatory developments for the novel Alzheimer's disease programs in the coming quarters, including Phase III data readouts for  bapineuzumab versus gantenerumab and Lillyâ\u0080\u0099s donanemab. First, I wanted to highlight that Frontier's and Neuroscience published a review article in late April that outlined an extensive rationale for targeting soluble amyloid beta oligomers in early Alzheimer's disease, as well as the preclinical evidence to characterize ACU93 selectivity and differentiated profile. As a quick reminder, ACU193 is unique and differentiated from other monoclonal antibodies studied in Alzheimer's disease, given its high selectivity for AÎ² oligomers relative to other anti-amyloid or anti- AÎ² monoclonal antibodies that are less selective or target different amyloid species such as deposited AÎ² amyloid plaques or AÎ² monomers. So for us right now, I think the important thing is to demonstrate the proof of mechanism in this INTERCEPT-AD study, established the sort of the -- the initial safety profile PK and target engagement, and that does set us up, we think, for the Phase 2/3 and future possibilities of combination strategies that, again, might offer increased patient safety and potential benefit. And that, of course, will depend on the results that we see in the Phase 1 study, but at least that's what we're planning right now when we do the interim for the Phase 2/3, it's possible that we would drop one of the arms depending on what the data show us. So just for others who might not be as familiar with the study, the patients are having MRI scans done in the study actually primarily to look for ARIA -- but there's also a, what's called a pulse sequence that can be used in an MRI and that has sort of advanced fairly rapidly in the field recently. And so really, the thought was these patients need to have the MRIs anyway, but let's get this sequence that can give us some information on blood flow and see if we do have one of these more immediate effects of ACU193, even in a Phase 1b study. We're not going to be doing that in this study, all the computerized testing will be done in the clinic in the SAD portion in the single, those portion actually patients are briefly in the hospital for a couple of days, but one of the advantages of this computerized testing is you can do it multiple times, there should be less variability in it then with sort of traditional scales like say, the ADAS-cog in Alzheimer's disease."
}