{
    "symbol": "MAIN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 11:25:04",
    "content": " We remain very encouraged by the continued favorable performance of our diversified lower middle market and private loan investment strategies and remain confident that these strategies, together with the benefits of our asset management business and our cost-efficient operating structure will allow us to continue to deliver superior results for our shareholders over the long-term future. Our lower middle market portfolio companies continued their strong performance overall, which resulted in another quarter of meaningful fair value appreciation in the equity investments in this portfolio. Consistent with our comments in prior quarters, these follow-on investments were made to support the growth strategies in some of our highest performing portfolio companies, which makes this aspect of our lower middle market investment activity very exciting for us. Additionally, this deleveraging, coupled with the attractive underlying operating results at our floor middle market portfolio companies allowed us to achieve $75 million in fair value appreciation in realized activities. Our investment activity in the fourth quarter included total investments in our lower middle market portfolio of $152 million, which after aggregate repayments on debt investments and return of invested equity capital resulted in a net increase in our lower middle market portfolio of $127 million. During the quarter, we also made $86 million in private loan investments, which after aggregate repayments of debt investments and return of invested equity capital resulted in a net decrease in our private loan portfolio of $26 million. At year-end, our lower middle market portfolio included investments in 78 companies representing over $2.1 billion of fair value, which is over 20% above our cost basis. To echo Dwayne's and David's comments, we are pleased with our operating results for the fourth quarter, which included a number of quarterly records and capped the year with Main Street achieving records for net investment income, distributable net investment income and net asset value, all on a per share basis. The fourth quarter surpassed our most recent quarterly record for total investment income flat in the third quarter of 2022 by $15.5 million or 15.7%, including meaningful increases in interest, dividend and fee income, which demonstrates the continued strength and momentum of our investment and asset management strategies. During the quarter, we recorded net fair value appreciation, including net realized losses and net unrealized appreciation on the investment portfolio of $36.2 million, including net fair value appreciation of $24.2 million in our lower middle market portfolio, $9.2 million of our private loan portfolio and $10.4 million in our external investment manager. During the fourth quarter, we were active on the capital front, including the execution of a new SPV credit facility with commitments of $255 million, the execution of a $100 million unsecured private placement notes, the repayment of the $185 million due on our 2022 notes at maturity and a net $71 million raised from equity issuances under our at-the-market program. Taken together with an additional $110 million provided by additional capital activities in January 2023, including the issuance of $50 million additional unsecured private placement notes and the expansion of commitments under our corporate credit facility by $60 million, we believe this provides us with the liquidity necessary to continue to be opportunistic and pursue attractive investment opportunities in 2023 while continuing to maintain a conservative leverage profile and healthy liquidity in these uncertain periods. As we look forward, given the strength of our underlying portfolio, we expect another strong top line and earnings quarter in the first quarter 2023 with expected DNII per share of at least $0.98 per share and with the potential for upside driven by the level of dividend income and portfolio investment activities during the quarter. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}