{
    "symbol": "CHNG",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-26 18:22:05",
    "content": " Good morning and welcome to Change Healthcare's earnings call for the fourth quarter of fiscal 2022 which ended on March 31, 2022. First, I would like to take a moment to recap a year in which we made considerable progress towards our mission of accelerating the transformation of the U.S. healthcare system through the power of Change Healthcare's solutions. We continue to deliver superior returns on investment to our customers and introduce innovative, new solutions like our Care Cost Estimator API, Stratus Imaging PACS, dual-eligibility advocate and our Coordination of Benefits solution. In a year of uncertainty created by the pending UnitedHealth Group merger and continued impacts from the COVID-19 pandemic, our Change Healthcare team members have shown incredible resilience, commitment, creativity and agility as they continue to deliver for our customers and partners. Solutions revenue, adjusted EBITDA and free cash flow were $859 million, $282 million and $174 million, respectively, in the fourth quarter. Our performance reflects continued new bookings momentum, existing customers expanding their business with Change Healthcare, new product introductions and new business initiatives. As part of the extension, UnitedHealth Group will pay a $650 million fee to Change Healthcare in the event the merger is unable to be completed due to the court's decision. In the event the merger is able to be completed, Change Healthcare will now pay a special cash dividend of $2 per share to its shareholders at or about the time of the merger closing. In payment accuracy, we closed multimillion-dollar claims extend deals with two major net new clients, including a large Blues plan and a high-growth, technology-enabled health plan with over 1 million members. In Enterprise Imaging, we had the strongest bookings quarter since taking Change Healthcare public, including closing several multimillion-dollar contracts with key strategic new clients. We've seen double-digit year-over-year growth in transaction volumes across our core networks driven by new customers, expansion of existing customer relationships and the last quarter of COVID-related tailwinds. We saw a 13% year-over-year volume growth in our medical network across eligibility, claims and ERAs, with this January being a record month for medical eligibility transactions. This client performed deep diligence and technical analysis on our APIs, choosing Change Healthcare because of our RCM experience, our consultative approach, our broad payer connectivity and the capabilities of our innovative Care Cost Estimator API. As of the end of Q4, we had a total of 324 APIs, software and hardware products from across our portfolio available on the Change Healthcare Marketplace and in multiple online storefronts, including AWS, Azure, Epic App Orchard and the Salesforce AppExchange. Our leadership in providing micro service-based and API-based solutions to the health care industry, along with our payments and data solutions businesses, are fueling the continued growth of our Network segment beyond underlying transaction volume growth. In Technology-Enabled Services, both the provider- and payer-facing businesses across desks have experienced continued momentum in their go-to-market efforts as evidenced by larger and more strategic deals in the fourth quarter. As in prior quarters, we continue to expand the underlying margins in the Technology-Enabled Services businesses through automation and AI, consistently increasing our efficiency and driving stronger performance for our customers. We remain confident that Change Healthcare which provides best-in-class connectivity, transaction management, insights and integrated experiences, will continue to play a central role in helping our customers prove a continuing transformation of health care. Our strong fourth quarter results demonstrate the resilience of our business and the underlying strength of our core franchises as we continue to make significant investments across the business, deepen our relationships with customers and implement new innovative solutions. Starting with Slide 6, for the fourth quarter, solutions revenue was a record $859 million compared to $804 million in the same period of the prior fiscal year which included a $10 million fair value adjustment associated with McKesson exit. Net of the impact of the deferred revenue in the prior period, solutions revenue increased 5.5% year-over-year. Net income for the quarter was $7 million, resulting in net income of $0.02 per diluted share compared to a net loss of $13 million or $0.04 per diluted share for the same period of the prior fiscal year. Adjusted EBITDA for the quarter was $282 million, an increase of 3.8% over the same period of the prior fiscal year. Adjusted net income was $130 million, resulting in adjusted net income of $0.39 per diluted share, compared with adjusted net income of $134 million or $0.42 per diluted share for the fourth fiscal quarter of the prior year. Starting with revenue; the Software and Analytics segment increased 6.5% year-over-year driven by new customers, volume growth with existing customers and new product introductions. Key drivers include volume growth from existing customers, implementation of new customers and continued double-digit growth in our data solutions and B2B payments businesses. In our Technology-Enabled Services segment, overall revenue increased 3.1% year-over-year primarily as a result of increased volume growth, incremental COVID testing and new sales. In Technology-Enabled Services, adjusted EBITDA decreased $4.9 million year-over-year driven by increased wage inflation, negative mix and customer credit adjustments. Due to the underlying momentum in the business, we expect solutions revenue growth of 2% to 4% in FY '23 despite headwinds from lower COVID-related activities and some customer attrition related to the UHG merger. So specifically to the first quarter of FY '23, despite the aforementioned headwinds, we expect low single-digit revenue growth year-over-year for both our S&A and Network businesses. In TES, we also anticipate low single-digit revenue growth year-over-year but a modest decline in adjusted EBITDA as wage inflation will continue to impact margins until both appropriate repricing of contracts occurs and additional transformation benefits are realized. Last, we expect free cash flow in the range of $450 million to $500 million for the full year driven by adjusted EBITDA growth and significantly lower add-backs year-over-year, partially offset by increased CapEx as we continue to target CapEx in the range of 8% to 9% of solutions revenue. I know they remain focused on developing and delivering innovative solutions for health care providers, payers, partners and consumers to improve clinical, financial and care outcomes. The strength of our financial performance to date and the ability to continue to deliver innovative, value-added solutions to our customers is a testament to our team members' commitment, innovation and agility."
}