{
    "symbol": "CHNG",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-07 13:07:03",
    "content": " Good morning and welcome to Change Healthcare's earnings call for the second quarter of fiscal 2022 which ended on September 30, 2021. I am joined today by Neil de Crescenzo, Change Healthcare's President and CEO and Fredrik Eliasson, Change Healthcare's Executive Vice President and Chief Financial Officer. First, Neil will provide a business update and then Fredrik will review the financial results for the quarter followed by closing remarks from Neil. We continue to create value for our payor, provider and consumer customers by delivering innovative and transformative solutions. Along with our customers, we remain focused on lowering costs, enhancing access and improving outcomes for the benefit of everyone in the healthcare system. Solutions revenue, adjusted EBITDA and free cash flow were $774 million, $246 million and $90 million respectively. Our performance results from continued positive momentum from customers expanding their business with Change Healthcare, new product introductions and new business initiatives, supported by improved healthcare utilization trends as pandemic impacts recede. We remain confident in our ability to continue to deliver strong performance as we move through the remainder of our fiscal year, while continuing to make significant investments across our platform and executing on the transformation initiatives in our TES segment. We continue to see opportunities across the segment as payors and providers take advantage of Change Healthcare's high ROI solutions that leverage our unique data, AI models and workflow capabilities. In payment accuracy, risk adjustment in quality and RCM technology solutions, we continue to expand our relationships with a broad range of customers, including some of the largest payors and providers in the country. For one large and well known leading healthcare customer, we implemented Risk View, Dual Enrollment Advocate, Research Complete, Part D Complete and Community Advocate, our innovative social determinants of health solution. In Q2, we introduced Change Healthcare's Stratus Imaging PACS, our new comprehensive native cloud solution, which is now in production with standalone radiology groups and where we have contracts in place to deploy in hospital-affiliated practices in 2022. In the quarter, we signed multiple clinical decision support contracts, including our first InterQual sale through the Change Healthcare marketplace. We are pleased with the consistent growth of that new offering and in Q2, we signed a contract for this network service with one of the five largest healthcare payors in the country. Also in the network segment, we are maintaining double digit growth in our payments business as more payors and providers adopt our electronic payment solutions to streamline their workflows and provide a better experience for their members and patients. DSaaS enables customers of all sizes to use a secure, easy to access and experiment with and comprehensive approach for understanding risks to health outcomes and possible solutions to case specific healthcare and social determinants data. We added 118 new products to our Change Healthcare marketplace this quarter, bringing the total to 198 APIs, software and hardware products from across our portfolio available in the Change Healthcare marketplace as well as other storefronts such as the AWS marketplace and Microsoft Azure marketplace. I am especially pleased that we have further expanded our partner ecosystem, adding 31 new partners in the quarter, including a remote patient monitoring company that just raised a large Series B, a growth stage healthcare analytics company working to accelerate adoption of value-based care and a diagnostic start-up using AI to provide a holistic picture of patient well being. As we have stated before, our technology-enabled services segment exemplifies Change Healthcare's tech-forward approach. As one example, we recently partnered with a large anesthesia services customer using our RCM services and operational expertise while incorporating our technology tools including Coverage Discovery, Smart Pay and Business Performance Insight Reporting. The client previously worked with a billing company that could no longer scale or innovate to support their growth, but Change Healthcare's extensive knowledge of RCM processes in anesthesiology and our technology prowess made us a great partner for them. Through continued innovation, we are providing greater value by leveraging technology and insights to reduce administrative waste, streamline and accelerate payments and enhance consumer engagement to drive better experiences and outcomes throughout the patient journey. We remain confident that Change Healthcare's platform, which provides best-in-class connectivity, transaction management, insights and integrated experiences, will continue to play a central role in helping our customers through the continuing transformation of healthcare. For the second quarter, solutions revenue was $774 million including a deferred revenue adjustment of $3 million as part of the fair value adjustments associated with the McKesson exit compared to $706 million in the same period of the prior fiscal year, which included a $39 million fair value adjustment. Net of the impact of deferred revenue and the net revenue related to acquisitions and divestitures in each period, solutions revenue increased 5.2% year-over-year. Net loss for the quarter was $36 million, resulting in a net loss of $0.11 per diluted share compared with net loss of $43 million or $0.13 per diluted share for the same period of the prior fiscal year. Adjusted EBITDA for the quarter was $246 million, an increase of 6.3% over the same period of the prior fiscal year. Adjusted EBITDA reflects the items I outlined related to revenue, partially offset by investment to support business initiatives, including new product launches and the market expansion opportunities. Adjusted net income was $114 million, resulting in adjusted net income of $0.35 per diluted share compared with adjusted net income of $104 million or $0.32 per diluted share for the second fiscal quarter of the prior year. However, adjusting for the $6 million impact of the Capacity Management divestiture, revenue in our software and analytics segment increased 4.2% over the prior year. Key drivers include a return to more normal health utilization, incremental revenue for COVID-19 vaccines, growth from implementation of new customers and continued double digit growth in the data solutions and B2B payments businesses. In our technology-enabled services segment, overall revenue increased 0.1% year-over-year, primarily as a result of volume recovery and new sales, partially offset by customer attrition. Network solutions adjusted EBITDA increased 19.6% year-over-year, driven primarily by continued growth across the segments and COVID-19 vaccine-related revenue. In technology-enabled services, adjusted EBITDA increased 6.3% year-over-year, driven by the same factors that impacted revenue as well as the continued optimization of our cost structure. In TES, we expect to have a stable to slightly improving performance in both revenue and adjusted EBITDA year-over-year as we move into the second half of the year with majority of the transformation benefit positively impacting the fourth quarter. We anticipate vaccine-related revenue to trail off in the remainder of the year and as a result, we expect the second half network revenue to be slightly lower than the first half. In closing, Change Healthcare remains focused on developing and delivering innovative and transformative solutions for healthcare providers, payors and consumers to improve clinical, financial and care outcomes. The strength of our financial performance to-date and ability to continue to deliver innovative, value-added solutions to our customers is a testament to our employees' commitment, dedication and innovation. We will continue to partner with our customers to help them lower cost, enhance access and improve outcomes, creating value for everyone in the healthcare system."
}