{
    "symbol": "CHNG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 11:20:34",
    "content": "  Operator: Good morning, everyone, and welcome to the Change Healthcare's Earnings Call for the Third Quarter of Fiscal 2022. Good morning and welcome to Change Healthcare's Earnings Call for the Third Quarter of Fiscal 2022, which ended on December 31st, 2021. I want to recognize that this momentum and strong execution, are due to the confidence, our customers and partners have in Change Healthcare's products and services, and our innovation roadmap, as well as the commitment, creativity, and agility of our Change Healthcare team members. Along with our customers and partners, we remain focused on lowering costs, enhancing access, and improving outcomes for the benefit of everyone in the healthcare system. Solutions revenue, adjusted EBITDA, and free cash flow were $811 million, $260 million, and $112 million respectively. Our performance reflects continued new bookings momentum, existing customers expanding their business with Change Healthcare, new product introductions and new business initiatives. We remain confident in our ability to continue to deliver strong performance as we move through the fourth quarter of our fiscal year, while continuing to make significant investments and innovating across the Change Healthcare platform and executing on the transformation initiatives in our TES segment. We've seen double-digit year-over-year growth in transaction volumes across our card networks, driven by new customers, expansion of existing customer relationships, and COVID-related tailwinds. Expectations are that by partnering with Change Healthcare, this customer will see digital payments go from 50% to 90%, driving financial benefits that could exceed $10 million annually, depending upon provider adoption. We added 134 new products to our Change Healthcare marketplace this quarter, bringing the total to 332 API software and hardware products from across our portfolio available in the Change Healthcare marketplace and in multiple store fronts, including AWS, Azure, and now, the Salesforce AppExchange. Our leadership in providing micro service and API-based solutions to the healthcare industry, along with our payments and data solutions businesses, is fueling the continued growth of our network segment beyond the underlying transaction volume growth. In technology-enabled services, we continue to help our clients navigate the strains that COVID-19 is placing on the healthcare system while improving patient access and their revenue cycle management. And with the current condition of the labor market, we're uniquely positioned to staff the specific skill sets required to manage customers patient access and revenue cycle needs, allowing them to focus on providing care to their patients and having a stronger financial base to support their mission. In calendar year 2021, our technology-enabled services segment handled approximately 1 million COVID patient access calls, about 200,000 nurse triage calls, sends about 6.5 million automated COVID patient reminders, and process about 8 million COVID testing claims. We remain confident that Change Healthcare's platform, which provides best-in-class connectivity, transaction management, insights, and integrated experiences will continue to play a central role in helping our customers through the continuing transformation of healthcare. Starting with slide 6 for the third quarter, solutions revenue was $811 million compared to $735 million in the same period of the prior fiscal year. The quarter was positively impacted by volume growth and new sales volumes across all three segments of the impact of deferred revenue and the net revenue related to acquisitions and divestitures in each period, solutions revenue increased 17.5% year-over-year. Net loss for the quarter was $24 million, resulting in a net loss of $0.08 per diluted share compared with net income of $2 million or $0.01 per diluted share for the same period of the prior fiscal year. Adjusted EBITDA for the quarter was $260 million, an increase of 11.2% over the same period of the prior fiscal year. Adjusted net income was a $117 million, resulting in adjusted net income of $0.36 per diluted share, compared with adjusted net income, a $110 million or $0.34 per diluted share for the third fiscal quarter of the prior year. However, adjusting for the $5 million impact of the Capacity Management divestiture last year, revenue in our software analytics segment increased 5.1% over the prior year. Key drivers include volume growth and incremental revenue from COVID-19 vaccines, growth from implementations of new customers, and continued double-digit growth in our data solutions and B2B payment businesses. In our technology-enabled services segment, overall revenue increased 4.6% year-over-year, primarily as a result of increased COVID testing volume growth and new sales, partially offset by customer attrition. Network solutions adjusted EBITDA increased 16.3% year-over-year, driven primarily by continued growth across the segments and COVID-19 vaccine-related revenue. In technology-enabled services, adjusted EBITDA increased 55.4% year-over-year, driven by the same factors that impacted revenue, as well as the continued austenization of our cost structure, partially offset by increased wage inflation. Since announcing our RCM transformation efforts last year, we’ve operationalized margin improvements of over $40 million and are well on track to exceed our original $60 million run rate target by the end of fiscal year '23. They remain focused on developing and delivering innovative solutions for healthcare providers, payers, partners, and consumers to improve clinical, financial, and care outcomes."
}