{
    "symbol": "OWLT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 20:09:10",
    "content": " Our expenses are rightsized and this will demonstrate our rebased operating expenses in Q1 and Q2 with the plan to spend no more than $40 million in 2023 adjusted operating expenses, excluding stock-based compensation. After re-launching our flagship stock monitoring product in the U.S. in January and transitioning from our CAM 1 to CAM 2 in July, we achieved full year product portfolio revenues of $69.2 million within our targeted range, while retaining strong satisfaction, it's notable that since January 2022, we've reduced the cost of our media acquisition spend, CPA by 80%. Headwinds for margins last year were primarily related to the return to vendor program we offer to all domestic retailers as a result of the FDA warning letter, the substantial write-off of prior generation inventory deemed obsolete, additional promotions to support the launch of our Dream portfolio, elevated PPV costs incurred due to supply chain shortages in 2021 and inventory adjustments and reconciliations cleanup. We exited the fourth quarter with operating expenses, excluding stock-based compensation of $19.6 million when factoring out bad debt reserves and onetime expenses such as costs from our financing activities, severance, regulatory clearances and out-of-period expenses, the underlying spend to operate the company was $15.2 million, marking a significant improvement to prior periods. We will continue to find opportunities to reduce costs in the first half of 2023 to maintain operating expenses under $40 million in 2023, excluding stock-based compensation and Q1 financing transaction costs. Q4 operating expenses included $2.4 million in preliminary bad debt reserves subject to change, $600,000 in fundraising transaction costs, $500,000 in spend toward our regulatory submissions and approximately $400,000 in partner and marketing expenses from prime periods, which we don't expect to see in the future. I just want to take a minute to thank everybody who has been so supportive of the business through the past year and getting back online with Dream Sock, getting our FDA submissions and really grateful for the team that has dug in to accomplish a lot of work in a very short period of time to get Owlet in a position to be focusing on getting to profitability this year and getting FDA clearances, which we believe are going to provide a lot of future growth for the business and also will help improve the safety and health of a lot of babies and help a lot of families."
}