{
    "symbol": "POWW",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-15 23:14:10",
    "content": "  Welcome to today’s Conference Call to discuss AMMO, Inc.’s Financial Results for the Second Fiscal Quarter of 2022. Based on the strong Q2 results and continued momentum across our entire business, we are again raising our outlook, increasing our fiscal 2022 revenue forecast to $250 million from $210 million previously and increasing our forecast for adjusted EBITDA to $80 million from $70 million previously. Total revenues rose 408% to over $61 million inclusive of our first full quarter from our marketplace segment, GunBroker.com. Total net revenues for the second quarter of fiscal 2022 were $61 million, up 408% from the $12 million we reported in the year earlier period. For the quarter, ammunition sales were $40.2 million compared to $8.7 million in last year’s second quarter, an increase of 360%. Gross profit of $26.2 million in the second quarter compared to $1.3 million in the year earlier period, reflecting significant growth in revenue. For the quarter, gross profit margin rose to 43% from 10.7% in last year’s second quarter as we benefited from scale-related efficiencies and manufacturing as well as the addition of high margin revenue from our marketplace segment. As a percentage of net sales, operating expenses declined to 19.7% in the second quarter of fiscal ‘22 from 25% in the year earlier period, reflecting the mix and shift in favor of higher margin marketplace revenues plus operating efficiencies related to our entry scale. Given the continued strength of demand across our businesses expanding capacity, we are again increasing our full year fiscal ‘22 revenue guidance to $250 million from the prior forecast of $210 million. Just wanted to talk about the updated outlook, so the $250 million in revenue for the full year, maybe if you could just provide a breakdown between the core AMMO Inc. revenue and the GunBroker marketplace business in terms of revenue split? And Matt, on your – on some of your other questions regarding the capacity build out, every – we are increasing capacity daily, whether it be through the automation that we are putting in, the machines that we have added, it is going, I can’t give you – I just give you a rough number and say it’s approximately $450 million currently, but something you need to keep in mind is at the new building, when we start, which should be, say mid-summer we will be producing out of that building. And then I guess just one more housekeeping one, maybe for Rob Wiley, just wondering if you could talk about the working capital dynamics, maybe within the second quarter and then how you see it playing out for the remainder of the year, it looked like use some cash to build inventory, a little bit of AR on the balance sheet as well. I don’t know if there is like $5 million through the first year of just AMMO, AMMO, Inc., products in the marketplace."
}