{
    "symbol": "POWW",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-16 21:49:08",
    "content": "  Welcome to today's conference call to discuss AMMO, Inc.’s Financial Results for the First Fiscal Quarter of 2022. Matt Nicholson, our Vice President of Sales and Anthony Tate, our director of National Accounts has done a tremendous job over the past 16 months, putting together an outstanding call centre with current backorders over $200 million. For the quarter, ammunition sales were $28.4 million compared to $6.4 million in the last year's first quarter. Our perspective on the significant growth we're seeing in our marketplace segment, note that the two months of GunBroker.com revenue we reported in the first quarter were 59% higher than the comparable two-month period last year. As a percentage of net sales, operating expenses declined to 20.9% in the first quarter of fiscal 2020 and 40% in the year earlier period, reflecting operating leverage, manufacturing scale, and the mix shift in favor of higher margin marketplace revenues. Given strong underlying demand and our better than expected results in the latest quarter, we're increasing our full year fiscal 2022 revenue guidance from $190 million to $210 million. In fact, looking on to our next quarter, with a full three months of GunBroker activity, coupled with our increasing ammunition operations, and leveraging that platform, we expect our margins to end up in approximately 45% conservatively, and you mentioned, just our adjusted EBITDA may seem low in comparison to the increase in guidance. So the first question on the shorter-term, when it comes to the GunBroker.com, low hanging fruit, you guys mentioned you're going to push, I think, 25 million was the number that's from ammunition and in other products? A boring comment we'd like to leave you guys with is that, we're very excited about this fiscal year and in fact raising guidance, point we'd like to make is that, we have over $31.5 million in net operating losses coming out of our previous fiscal year."
}