{
    "symbol": "CBU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-24 14:18:04",
    "content": " Adjusted pre-tax, pre-provision net revenue or adjusted PPNR per share, which excludes the provision for credit losses, acquisition-related expenses, other non-operating revenues and expenses and income taxes was $1.25 in the third quarter, up $0.21 or 20.2% over the prior year's third quarter. The company recorded total revenues of $175.6 million in the third quarter of 2022, this was up $18.7 million or 11.9% over the prior year's third quarter and established a new quarterly record for the company. Net interest income, the primary driver of the company's revenue growth was up 17.8% or 19.2% over the prior year's third quarter due to market interest rate related tailwinds, strong loan growth, and investment securities purchases between the periods. The company's average interest-earning assets increased $1.08 billion or 8%, while the tax equivalent net interest margin increased 29 basis points from 2.74% in the third quarter of 2021 to 3.03% in the third quarter of 2022. Net interest income was also up $7.2 million or 7% over linked second quarter results, while the tax equivalent net interest margin expanded 14 basis points. Although interest expense was up $2.4 million over the prior year's third quarter, the company's average cost of funds was up just 6 basis points from 10 basis points in the third quarter of 2021 to 16 basis points in the third quarter of 2022. Noninterest revenues increased $0.9 million over the prior year's third quarter, led by a $1.6 million or 9.7% increase in banking related revenues and a $1.3 million or 7.6% increase in wealth management, insurance services revenues. Banking noninterest revenues increased from $16.9 million in the third quarter 2021 to $18.5 million in the third quarter of 2022, driven by an increase in deposit service and other banking fees. Although asset quality remains very strong, the company recorded $5.1 million in the provision for credit losses in the third quarter reflective of strong loan growth and a weaker economic forecast. The $2.2 million or 2% sequential decrease in quarterly operating expenses was largely attributable to a $4 million decrease in acquisition-related expenses, partially offset by increases in salaries and employee benefits, data processing and communication expenses, and other expenses. Exclusive of $437 million of loans acquired in connection with the second quarter acquisition of Elmira, ending loans outstanding have increased $824 million or 11.3% over the prior 12-month period despite a $156.2 million decrease in PPP loans. During the third quarter, the company originated over $750 million of new loans at a weighted average rate of just under 5%. The company has an abundance of liquidity, the combination of the company's cash and cash equivalents, borrowing capacity at the Federal Reserve Bank, borrowing availability at the Federal Home Loan Bank, and unpledged available for sale investment securities portfolio provided the company with over $5.2 billion of immediately available sources of liquidity at the end of the third quarter. Looking-forward, we are encouraged by the momentum in our business, the company generates strong organic loan growth over the prior five quarters, the net interest margin expanded meaningfully in the quarter, asset quality remained strong, and the loan pipeline is robust. With that said, we do have about $600 million of securities, maturities and payments next year in 2023, which, if you kind of do the math on that, that can support about 7% growth rate on our existing loan portfolio. On a longer term basis, we still think that our expectations around mid-single digit kind of growth in loans as a more of a -- a standard process as opposed to 1% or 2% in prior years will support margin expansion over time. If loans can grow kind of mid-single digit, but you got opportunities to take some of the cash flows from the investment securities portfolio in 2023 to fund that, how would -- how should we think about average earning asset growth over the next few quarters. And to your question about the fourth quarter specifically, yes, some of the shorter term borrowing costs will dampen our ability to increase the net interest margin to the fourth quarter, but then as we head into next year, we'll continue to see some of those securities cash flow start to effectively transfer over to the loan portfolio. I think that's something we've been pretty good at over the years in terms of building a really stable, sound low cost core deposit funding base that's really -- that sticks with us through the ups and downs of markets including rates up and rates down and recessions and credit crises and the whole gamut of things that that the economy kind of goes through over different cycles over time."
}