{
    "symbol": "CBU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-25 16:17:05",
    "content": " Fully diluted operating earnings per share which excludes acquisition related expenses and other non-operating revenues and expenses were $0.87 for the quarter, $0.10 per share or 10.3% below the prior year's first quarter and $0.06 per share or 7.4% higher than the linked fourth quarter results. The $0.10 decrease in operating earnings per share as compared to the first quarter of 2021 was driven by increases in the provision for credit losses, operating expenses, income taxes and the fully diluted shares outstanding offset in part by increases in net interest income and non-interest revenues. The company PPP related interest income totaled $1.7 million in the first quarter of 2022, as compared to $6.9 million of PPP related interest income in the first quarter of 2021. The $0.06, or 7.4% increase in operating earnings per share over the linked fourth quarter results were largely different by decreasing the provision for credit losses, higher non-interest revenues and lower operating expenses. Adjusted pretax, pre provision net revenue per share, which excludes the provision for credit losses, acquisition related expenses, other non-operating revenues and expenses and income taxes were $1.12 in the first quarter of 2022, as compared to $1.09 in both the prior year's first quarter and the linked fourth quarter. The company reported total revenues of $160.5 million in the first quarter of 2022, a new quarterly record for the company, and an $8.1 million or 5.3% increase over the prior year's first quarter. Comparatively total revenues were up $0.9 million, or 0.5% over fourth quarter 2021 results to go $1.8 million, or 2.7% increase in non-interest revenues, partially offset by $0.9 million, 0.9% decrease in net interest income driven by a $1.9 million decline in PPP related interest income. Comparatively the company reported net interest income of $95.7 million during the fourth quarter of 2021, $0.9 million higher than the first quarter 2022 results. Employee Benefits Services revenues for the first quarter of 2022 were $29.6 million, up $3.1 million or 11.5% in comparison to the first quarter of 2021. The company recorded insurance service revenues of $10.4 million in the first quarter of 2022, which represents a $2.3 million or 27.7% increase over the prior year's first quarter driven by organic expansion as well as the second quarter 2021 acquisition of a Florida based personalized insurance agency and the third quarter 2021 acquisition of a Boston based specialty lines insurance practice. Banking management's revenues increased $1.4 million, or 9% from $15.6 million in the first quarter 2021 to $17 million in the first quarter of 2022. Comparatively the company's financial services business revenues increased $1.3 million, or 2.7% over the linked fourth quarter results while banking related non-interest revenues were up $0.4 million or 2.8%. Although economic forecasts remain generally consistent with the prior quarter, companies allowance for credit losses increased $0.3 million from the end of the fourth quarter of 2021 due in part to a $90.7 million increase in non PPP loans outstanding. The company recorded $99.8 million in total operating expenses in the first quarter of 2022, compared to $93.2 million of total operating expense in the prior year's first quarter. Exclusive of stock-based compensation benefits, the company's effective tax rate was 22.3% in the first quarter of 2022, as compared to 21.4% in the first quarter of 2021, primarily attributed to an increase in certain state income taxes. This representing $1.01 billion or 6.9% increase from one year prior, and $73.2 million or 0.5% increase in the end of the linked fourth quarter. This included a $2.25 billion or 61.4% increase in the average book value of the investment securities due to the company's security purchase activities, and the $30.4 million 0.4% increase in average loans outstanding partially offset by a $735.8 million or 44.1% decrease in average cash equivalents. Ending loans at March 31 2022 of $7.43 billion were $48.6 million, or 0.7%, higher than the four quarter of 2021 and $53.9 million, or 0.7% higher than one year prior. Exclusive of PPP loans; ending loans increased $410.3 million, or 5.9% over the prior 12-month period, and $90.7 million, or 1.2% over the prior quarter. At March 31 2022, the company's allowance for credit losses totaled $50.1 million, or 0.68% of total loans outstanding, which compares to $49.9 million or 0.68% at the end of the fourth quarter 2021 and $55.1 million, or 0.7%, 0.75% a year prior. This compares to $45.5 million, or 0.6%, 0.62% of total loans outstanding at the end of the fourth quarter of 2021 and $75.5 million, or 1.02% of total loans outstanding at one year earlier. Hey, good morning, guys. Hey, good morning, guys."
}