{
    "symbol": "CBU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 20:37:04",
    "content": " A $2.8 million decrease in PPP-related revenues between the periods and a $6.4 million increase in the provision for credit losses, excluding acquisition-related provision, were responsible for a $0.13 decrease in fully diluted operating earnings per share net of tax over comparable periods. The company reported a $2.1 million provision for credit losses in the second quarter of 2022, excluding acquisition-related provision. Adjusted pre-tax pre-provision net revenue per share which excludes the provision for credit losses, acquisition-related expenses, other non-operating revenues and expenses and income taxes was $1.13 in the second quarter of 2022, $0.07 or 6.6% higher than the prior year second quarter and a penny per share higher than the linked first quarter. The company reported total revenues of $167.2 million in the second quarter of 2022, a new quarterly record for the company and a $15.7 million or 10.3% increase over the prior year second quarter. Comparatively, total revenues were up $6.7 million or 4.2% over first quarter 2022 results due to an $8.3 million or 8.7% increase in net interest income, partially offset by $1.6 million or 2.4% decrease in non-interest revenues. Between comparable periods, the company's average interest earning assets increased $1.1 billion or 8.2% and a tax equivalent net interest margin was up 10 basis points from 2.79% in the second quarter of 2021 to 2.89% in the second quarter of 2022. The tax equivalent average yield on interest earning assets in the second quarter of 2022 was 2.97%, 8 basis points higher than the tax equivalent average yield on interest earning assets of 2.89% in the second quarter of 2021, despite a decrease in PPP-related interest income while the cost of interest-bearing liabilities decreased from 15 basis points to 13 basis points. Comparatively, the company reported net interest income of $94.9 million during the first quarter of 2022, $8.3 million less than the second quarter 2022 results, while the tax equivalent net interest margin was 2.73%. Employee benefit services revenues for the second quarter of 2022 were $28.9 million, up $1.4 million or 5.3% in comparison to the second quarter of 2021. The company reported insurance services revenues of $9.8 million in the second quarter of 2022, which represents a $1.6 million or 19.1% increase for the prior year second quarter driven by both organic expansion, the acquisition of several insurance practices and books of business between the periods. For the second quarter of 2022, the company reported a provision for credit losses of $6 million, $3.9 million of which was due to the acquisition of Elmira. The company's allowance for credit losses increased $5.4 million from the end of the first quarter of 2022 to $55.5 million, but remained consistent with the prior quarter at 68 basis points of total loans outstanding. The company reported net loan charge-offs of $0.4 million, or an annualized 2 basis points of average loans outstanding during the second quarter of 2022 as compared to net loan recoveries of $0.6 million or an annualized 3 basis points of average loans outstanding for the second quarter of 2021. The company reported $110.4 million in total operating expenses in the second quarter of 2022 or $106.1 million in core operating expenses, exclusive of acquisition-related expenses. The $12.5 million or 13.4% increase in core operating expenses was attributable to a $7.5 million or 38% increase in salaries and employee benefits, a $3.4 million or 36.5% increase in other expenses, as well as increases in data processing, communication expenses, occupancy and equipment expenses, intangible asset amortization totaling $1.6 million. The other non-compensation expenses were up due to the general increase in the level of business activities, including costs incurred to pursue several new business opportunities in the company's non-banking businesses and incremental expenses associated with operating an expanded franchise due to several non-bank acquisitions between the periods and the second quarter acquisition of Elmira Savings Bank. Comparatively, the company reported $99.8 million of total operating expenses in the first quarter of 2022. The $10.6 million or 10.6% increase in total operating expenses on a linked quarter basis is largely attributable to a $4 million increase in acquisition-related expenses, a $3.8 million or 6.1% increase in salaries and employee benefits, and a $2.3 million increase in other expenses. The company's total assets were $15.49 billion at June 30, 2022, representing a $686.5 million or 4.6% increase from one year prior and $138.1 million or 0.9% decrease from the prior quarter end. Likewise, average earning assets were up from $13.37 billion in the second quarter of 2021 to $14.47 billion in the second quarter of 2022, representing a $1.1 billion or 8.2% increase. This included a $2.32 billion or 58.6% increase in average book value of investment securities and a $383.9 million or 5.2% increase in average loans outstanding, partially offset by a $1.6 billion or 77.2% decrease in average cash equivalents. On a linked quarter basis, average earning assets increased $235.3 million or 1.7% due primarily to the Elmira acquisition. Despite the Elmira acquisition during the second quarter of 2022, total assets decreased in the prior quarter due primarily to the net outflow of municipal deposits totaling $368.4 million, due in part to seasonal factors and a $260.2 million decrease in the market value adjustment on the available for sale investment securities portfolio due to an increase in market interest rates. Ending loans at June 30, 2022 of $8.14 billion were $722.4 million, or 9.7%, higher than the first quarter of 2022 and $900.5 million, or 12.4%, higher than one year prior. The increase in ending loans year-over-year was driven by increases in all categories of loans, including consumer mortgage, consumer indirect, business lending, home equity and consumer direct loans, due to the Elmira acquisition and net organic growth despite a $259.9 million decrease in PPP loans. During the quarter, the company reported $196.7 million in after-tax other comprehensive loss driven by the decline in the market by the company's available for sale investments securities portfolio. The combination of the company's cash and cash equivalents, borrowing available in the Federal Reserve Bank, borrowing capacity of Federal Home Loan Bank, and unpledged available for sale investment securities portfolio provide the company with over $5.8 billion in immediately available source of liquidity at the end of the second quarter. Although we do believe that there was some spend down of deposits that municipalities accumulated during the pandemic kind of in the back end of the 2022 school year and also some capital projects I think that got funded as well, but we do expect a couple $100 million back in the third quarter. So, Chris, just as a matter of kind of a backdrop, if we look at the third quarter of '21, the fourth quarter of '21, and the first quarter of '22, and take kind of a simple average of the operating expenses for the company in those three quarters, it's just about $100 million."
}