{
    "symbol": "CURV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-08 20:27:06",
    "content": " For example, during the quarter, approximately 30% of the customers shopping in new stores were new to the Torrid brand, and these customers typically spend 25% more in their first year compared to those acquired on the web. Starting with the third quarter results, net sales came in at the low end of our guidance at $290 million, which was down 5% compared to $306 million last year. As a percentage of sales, SG&A decreased to 20.4% from 21.7% compared to the third quarter of last year, due to higher private label credit card income and lower performance bonus expense. We did not have any adjustments to net income in the third quarter of '22, but for comparison purposes, adjusted net income last year was $28 million or $0.25 per share. Please proceed with your question. So I've been here a few months and one of the things that we've really focused on aside from building the right team and building the right operational foundation for the business is the process for developing our product assortment flow and those assortments by channel and some of that discipline had been lost over the pandemic time period and we've reinstated processes that are very straightforward that are very typical and well known in kind of this environment and moving more of our analysis and development earlier in the process, meaning a template for the development and then being able to really test and react more appropriately as we move down the path. Please proceed with your question. The inflation channel question, one of the things that we've been talking about is that in the first several quarters of this year that the inflationary impact really was most prominent in our lower household income customers. Please proceed with your question. One is the trend that we've seen going through the third quarter, the uncertainty of the overall macroeconomic environment and our desire to maintain cleanliness in our inventory position and set us up for 2023 that we're pretty optimistic about where our product development as we roll into spring will position us well. Please proceed with your question. Please proceed with your question."
}