{
    "symbol": "NCMI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 22:55:04",
    "content": " In fact, in the second quarter of 2022, the box office broke the $100 million barrier for five straight weekends. Our total revenue for the quarter -- second quarter of 2022 was $67.1 million, our highest quarter since the fourth quarter of 2019. National sales revenue for the second quarter of 2022, was $50.7 million, also the highest quarterly national performance in the pandemic began. While still a small percentage of our revenue, our digital business continues to be an important diversification strategy, total digital revenue for the second quarter for the second half of 2022 -- excuse me, for the first half of 2022 was 21% above the first half of 2021 and 19% higher than the second quarter 2019. Total revenue for the second quarter was $67.1 million, up more than 4.5 times from last year and slightly above the middle of our guidance range. National revenue for the second quarter was $15.7 million, up nearly five times compared to the prior year and marks the highest quarter for national revenue in the last two years. Local and regional revenue for the second quarter was $10.5 million, which was up two times compared to the same period of the prior year. For the second quarter, our network theaters had attendance of $124.2 million, the highest level we reported since the pandemic began and an improving 67% of 2019. Second quarter operating expenses, excluding depreciation and amortization, were $53.7 million approximately a 7% increase compared to the first quarter. In the second quarter, our core operating expenses averaged approximately $6.5 million per month, compared to our pre-COVID run rate of $9.5 million per month for savings of 32%. The increase in debt was related to the $50 million revolver that was funded in January 2022, net of the approximately $25.8 million of NCM LLC's 5.875% senior secured notes, which NCM, Inc. acquired for an average price in the mid-70s during the second quarter. NCM LLC's cash balance at the end of the second quarter was $57.7 million and including the $6.8 million of availability under the revolver, NCM LLC total liquidity at quarter end was approximately $64.5 million, which was in excess of our liquidity covenant that requires a minimum liquidity of $55 million."
}