{
    "symbol": "ROK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-03 11:14:07",
    "content": " Substantial backlog in all three business segments, low cancellation rates, and detailed component supply forecasts give us confidence that we will achieve double-digit revenue growth this fiscal year and reach $9 billion of profitable sales in the next couple of years. In the Intelligent Devices business segment, organic sales declined 3% versus prior year, a sharp reversal from the 25% growth in the first quarter, reflecting volatile components supply. Segment operating margin was 15.7%, approximately 300 basis points worse than we expected and primarily impacted by lower-than-expected sales volume and higher input costs. Versus last year, our margins declined 630 basis points mostly due to negative price cost and higher investments in key growth areas. As we said last quarter, we expect Q2 to be the most impacted by negative price cost as the benefits from prior price actions will be more heavily weighted to the second half of fiscal year 2022 and into fiscal year 2023. Segment margins were up sequentially for this segment and declined 520 basis points compared to last year, mostly due to higher year-over-year investment spend, negative price/cost and the impact of acquisition integration costs. Segment margin was up sequentially for this segment and declined 170 basis points compared to the prior year, driven by lower labor utilization caused by supply chain constraints, partially offset by higher sales volume and lower incentive compensation. We expect second half margins of around 22%, up four percentage points from first half levels, primarily driven from higher sales volume and a 250 basis point improvement from price cost. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. We started the year saying, we expect investment spend to go up approximately $200 million, we now expect that – we scale that spending down to now instead of increasing $200 million to only increase approximately $100 million and that will be part of the benefit that we expect in margin in the second half of the year. Your line is open. Your line is open. Your line is open."
}