{
    "symbol": "TNL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:22:05",
    "content": " Between buybacks and dividends, we are increasing our full year capital return forecast from a range of $350 million to $400 million to approximately $475 million or 14% of our market cap. We expect full year adjusted EBITDA cash conversion from adjusted EBITDA to be closer to 50% this year as a few timing items, primarily the placing of receivables and term ABS transactions, will see cash flow shift to the first quarter of 2023. Looking at the performance in our two business segments, in the third quarter, Vacation Ownership reported segment revenue of $754 million and EBITDA of $188 million, increases of 13% and 4%, respectively, over the third quarter of 2021. In the third quarter, we delivered 158,000 tours and a VPG of $3,393, representing increases of 22% and 5%, respectively over the prior year. EBITDA for Travel Membership was $65 million compared to $64 million in the prior year, increases of 5% and 2% respectively over the third quarter of 2021. In October, we closed on our third ABS transaction of the year, a $250 million transaction with an advance rate of 88% and a weighted average interest rate of 6.9%. In the fourth quarter, we expect gross VOI sales to be in the range of $490 million to $540 million, a 13% to 25% increase over the prior year, and full year gross VOI sales to be in the range of $1.95 billion to $2 billion. Please proceed with your question. And so when we think about portfolio growth, you take the VOI sales and with our percentage of sales finance now being at up around 60%, thatâ\u0080\u0099s how we can think about growth in the future is a natural reduction of about $1 billion we placed to buy new originations at 60% of VOI sales. Please proceed with your question. And if we had not changed our percent finance to drive incremental NII, we would probably be facing about a $7 million headwind this year, and weâ\u0080\u0099ve cut that at least in half, if not 75% by the increase in NII generated by our additional percent finance. Please proceed with your question. And then secondly, as of the end of the third quarter, we have over $100 million more in receivables this year than we did at the end of last year, that wonâ\u0080\u0099t get in an ABS transaction until next year. Please proceed with your question. And I think it will come back a little bit due to inflation â\u0080\u0093 once inflation starts to cool, my growing belief is that that range that we are staying at today, of $2,700 to $3,000 maybe more sustainable at the high end of that range, simply based off the performance that we have seen post COVID and when we adjust for the new owner mix. Please proceed with your question. Please proceed with your question."
}