{
    "symbol": "TNL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 10:43:02",
    "content": " Looking at the performance in our two business segments in the second quarter, Vacation Ownership reported segment revenue of $735 million and EBITDA of $187 million, increases of 22% and 36% respectively over the second quarter of 2021. In the second quarter, we delivered 148,000 tours and a VPG of $3,489 representing increases of 26% and 11% respectively over the prior year. Revenue in our Travel Membership segment was $188 million in the quarter, compared to $194 million in the prior year and above the $164 million in the same quarter of 2019, after removing $66 million for the sale of the North American rental business. In the third quarter, we expect gross VOI sales to be in the range of $530 million to $550 million, a 20% to 25% increase over the prior year, with VPG expected to be between $3,300 and $3,400. It is important to note that this expected increase in the provision in the third quarter is not a quality issue, but rather driven by strategic decisions made by us to return to a growing portfolio through a higher percentage of sales financed and continuing efforts to increase our new owner sales mix. I think the biggest driver of that is the close rates moving up by 300 basis points, which to me is a clear reflection of our ability to raise credit quality and benefit the overall efficiency and margins of our business, which leaves us the remainder our ability to grow the portfolio, which as we mentioned, we've been very successful in the second quarter to getting our portfolio growing again at a really good clip. And the last point I would make is, even though we did guide to 18.5% for the third quarter, for the second half of the year, we are keeping our provision guidance consistent with while we talked in our last call at 18% commitment with because there is some timing in there. Our second quarter results and full-year outlook underscore the persistent strength of leisure travel, people's commitment to vacations and the consistent performance of our timeshare model."
}