{
    "symbol": "TNL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 10:36:04",
    "content": " For the full year, adjusted EBITDA increased 10% year-over-year to $859 million and with strong adjusted free cash flow conversion, adjusted free cash flow doubled to $439 million over the prior year. Revenue in our travel membership segment was $163 million in the quarter compared to $170 million in the prior year, a 4% decrease. Adjusted EBITDA was $57 million compared to $62 million in the prior year, a decrease of 8% primarily due to a decrease in exchange subscription revenue resulting from lower average member count. We expect to be within our targeted 55% to 60% adjusted free cash flow conversion range by the end of 2023 and for it to be weighted to the second half of the year, primarily due to the timing of inventory spend and ABS transactions. Keep in mind, that vacation ownership adjusted EBITDA faces a $5 million year-over-year headwind to net interest income in the first quarter as a result of higher interest expense on our most recent ABS transactions. We expect Travel and Membership adjusted EBITDA in the first quarter to be down in the mid-single digits year-over-year, primarily due to the impact of lower RCI member count on exchange transactions and the timing of marketing spending at our travel clubs. Overall, we expect adjusted EBITDA for the first quarter to be in the range of $170 million to $180 million and $920 million to $940 million for the full year. Please proceed with your question. Please proceed with your question. Please proceed with your question. First of all, our Travel Club's transaction growth was 37% last year and we've laid out guidance this year of 20% to 25%. In a year where we're down 0.25 million members to start the year, with that as a fact in the vast majority of our EBITDA, the fact that we can lay out mid-single digits growth for travel and membership this year, not only says that our exchange business continues to diversify what they're doing with share of wallet, but it also says that our travel club business is adding incremental growth to a segment of our business, which has been consistently 0% to 2% growth. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}