{
    "symbol": "AMEH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 11:32:02",
    "content": " These forward-looking statements can be identified by terms such as anticipate, believe, expect, future, plan, outlook and will and include, among other things, statements regarding the company's guidance for the year ending December 31, 2023, continued growth, acquisition strategy, ability to deliver sustainable long-term value, ability to respond to the changing environment, operational focus, strategic growth plans and merger integration efforts as well as the impact of the 2020 novel coronavirus or COVID-19 pandemic on the company's business, operations and financial results. We executed against our operational strategy in 3 key ways: one, growing our membership in core and new geographies; two, moving members along the risk ladder towards global risk value-based contracts; and three, enabling our providers to deliver excellent patient outcomes in order to manage that risk effectively; and finally, we completed several strategic transactions that we believe will support that growth strategy for years to come. For the quarter ended December 31, 2022, we recorded total revenue of $294.2 million, an increase of 51% from $195.1 million for the prior year quarter; and adjusted EBITDA of $23.7 million, an increase of 54% from $15.4 million for the prior year quarter. For the full year of 2022, ApolloMed achieved total revenues of over $1.14 billion, an increase of 48% year-over-year; and adjusted EBITDA of $140 million, up 5% year-over-year, yielding an adjusted EBITDA margin of 12.2%, which is within our long-term target EBITDA range of 10% to 20%. Earnings per share on a diluted basis were $1.08 per share compared to $1.63 per share for the prior year, mainly due to the increase in operating expenses mentioned earlier; a $10.5 million increase in unrealized losses on investments year-over-year, which was primarily driven by a decrease in the stock price of certain investment holdings; and a $7.6 million increase in our provision for income taxes year-over-year. As shown on Slide 10 of our earnings supplement, we are pleased to be providing the following guidance projections for this year: total revenue of between $1.3 billion and $1.5 billion, which would translate to between 14% and 31% year-over-year growth; net income of between $49.5 million and $71.5 million; EBITDA of between $89.5 million and $129.5 million; adjusted EBITDA of between $120 million and $160 million; and diluted EPS of between $0.95 and $1.20."
}