{
    "symbol": "NVTS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 23:29:10",
    "content": " Your line is open. So last year we had an opportunity to kick off some major strategic programs, and other regions with some pretty strategic customers we took that opportunity went for it even though the price points were a little bit lower, which is not too surprising for the very first program to start their GaN adoption knowing for well that we would one balance that out with higher margin business elsewhere including China. Your line is open. Your line is open. Last year was a bit of anomaly as we’ve discussed before with Xiaomi launching their first inbox in Q1, which is not a typical major production year it’s usually a softer quarter and that bled into Q2, so we had a more balanced let’s say split between first half and second half last year, but I think this year is still shaping up to be in that range of one third first half, two thirds second half. Your line is open. Your line is open. Great question And you know we especially focusing on or like ultra-fast charger category, which is typically things that are delivering more than 100 watts of power to a Smartphone which is an extraordinary amount and usually once you get to that 100 watt level end up you have to add additional circuitry it’s called PFC or Power Factor Correction that doubles typically began content and as you go up from 100 watts that can even triple or even quadruple begin content. Your line is open. Your line is open. And now we’re working with specific customers who are adopting that design putting it into commercial production and ramp which will roll out next year as we talked about but that design center has a whole roadmap of system level developments and innovations largely are developed collaboratively with key customers and we can’t name the names yet but as those things become public obviously we would love to share it but we do have multiple customers engaged with that design center to influence the roadmap, collaboratively designed these new systems and of course bring them into production using our GaN ICs. There’s a small team in general both of these design centers are looking at about a dozen engineers in their first phase and then they’ll grow from there and the EV Design Center is already looking to produce its first GaN based on board chargers later this year, again collaboratively with customers who are influencing those co designing them with us and then ultimately bringing them to production And we’re hopeful even though I reiterated 2025 as are expected EV revenues, we certainly hope these things accelerate and expect that they accelerate the timing. Your line is open."
}