{
    "symbol": "NVTS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 22:43:05",
    "content": " This pure-play focus on next-generation power semiconductors without any distraction or dilution by traditional silicon power devices, uniquely positioned Navitas for growth and leadership in next-generation electrified systems from EV and renewables to industrial and appliance markets to mobile consumer and data center segments. We rapidly expanded into these new market segments transitioning from a company in 2021 that was 100% mobile consumer focused to a more diversified set of markets resulting in 2022 revenues with approximately 30% in appliance and industrial, 12% in solar and storage, 5% in EV, and 40% in mobile and consumer segments. Last year, Navitas and our customers developed nearly 100 new GaN fast charger designs from Samsung, Oppo, Lenovo, Dell, Anchor and more plus the recent 210 watt GaN fast charger for Xiaomiâ\u0080\u0099s Redmi Note 12, which enables 100% charge in a lightning fast 9 minutes. Now with leading edge GaN, silicon carbide, digital isolators and analog controllers, we are uniquely positioned to displace legacy silicon power devices in multi-billion dollar established markets, while also enabling the electrification of major new growth markets like solar, energy, storage and electric vehicles. Together with GaN, we exit the year as a pure-play next-generation power semiconductor company with a complete set of products, industry-leading technology, organizational scale and our most important asset, a group of incredibly talented and committed employees to successfully address the market opportunity totaling over $23 billion by 2026. For fiscal year 2022, non-GAAP gross margin was 40.8% compared to 45.4% in the prior year, as we were adversely impacted during the year by higher wafer prices from TSMC and a strategic decision early in 2022 to absorb lower margins in a targeted new market. This represents substantial year-over-year growth of approximately 85% over the $6.7 million we recorded in the first quarter of 2022, and it reflects expansion of our product lines and new market opportunities. We also highlighted nearly 100 new GaN chargers developed with our customers last year, adding to the ones already released in the market, that puts us at something like 250 plus GaN chargers released to production, many of them ready to launch as that market comes back."
}