{
    "symbol": "NVTS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 22:05:11",
    "content": " GeneSic has existing revenue and development customers including BYD the world's number one EV supplier, Land Rover, Mercedes AMG, Jieli, Shinwari, LG Magna,  our EV focused design center will immediately add developments with GeneSic technology and accelerate its success into an even broader range of EV customers and applications. As the GeneSic team has focused heavily on core silicon carbide design process and technology, Navitas has invested heavily in global sales and operations, strong technical support and system design centers in bringing our GaN IC technology to market. This digital isolator technology has already been optimized for the high switching speeds of GaN and silicon carbide and will allow Navitas to offer complete power stage chipsets or integrated solutions and delivering more value and content to our customers in each target market, including datacenter, solar energy storage, EV and others. The number of GaN chargers in the market is expanding rapidly with new OEM launches that include Vivo's X-fold Motorola Edge plus, Oneplus 10 R and 10t models, including charging power levels that reach up to 200 watts, setting a new industry benchmark of zero to 100% charging in less than 10 minutes. In summary, we're excited about the growth opportunities in front of us and how the combination Navitas and GeneSic accelerates our vision of becoming the industry's next generation power semiconductor leader. Yes, this is Ron. We love that company in particular, because they've already optimized those digital isolators for the high speed, high frequency capability of GeneSic, silicon carbide technology and GaN. And especially as we become the only pure play next generation power semiconductor company that both GaN and Sic I'm sure our customers, our markets, and our businesses really going to benefit from those investments. Those are all obviously right up our alley, not just with GaN, we're already working on in the next few years, but now immediately going to benefit our silicon carbide business we're already shipping into those markets. Yes because both an interesting diversity to GaN synergistic nature, it's opening up all new customers and applications that we wouldn't have done GaN only and conversely, I think the same for GeneSic on the silicon carbide side, but also there's good overlap and synergies. You had a before we picked up GeneSic you had like kind of a roadmap for higher voltage applications on your GaN product, you're pushing forward with onboard chargers, you have solar roadmap, and you completely expects to extend that and then you have the silicon carbide portfolio that was sitting on top of it. But with GeneSic this puts us immediately in production with significant relationships and revenue, a lot of those same EV customers, solar customers, energy storage customers, and that we show up very quickly with not only leading edge silicon carbide, but leading edge GaN to make sure we've got the right tool in the toolbox to deliver whatever is going to get them the very best next generation power system capability. Yes, this is Ron. I think when you look at margins going forward and they starting to move up in Q4 it's really a part of it is mix on the GaN side, both end market and customer base And then also Gen-four, we're introducing Gen-four, and the full quarter of GeneSic. How should I look at your positioning what it is to some analog companies that are ramping silicon carbide, but they're the targeting billion plus in silicon carbide, whatever you next year, if I kind of look at let's say you do $65 million in three years. Now adding silicon chips with the VDD digital isolators, now adding an extraordinary company with GeneSic and the silicon carbide capability, really positions us to follow our strategic plan very well and positions us as the only pure play next generation power semiconductor company."
}