{
    "symbol": "NVTS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:14:05",
    "content": " Both Gene and our newly acquired silicon carbide business continues to show significant growth prospects fueled by our excellent progress in developing and launching new products, accelerating customer adoption with our unique system design center capabilities and expanding rapidly into new markets, regions and customers. In only about three months since acquiring GeneSic, we've added over 50 new silicon carat opportunities, which adds to our strong revenue growth expected for next year. This was in line with our guidance while we continued to see the impact of the slowdown in the mobile market that is impacting the semiconductory industry broadly, this was offset by gains we made in diversifying our end markets and customer base and strong demand for our new silicon carbide products. Putting all this together, the non-GAAP loss from operations was $10.3 million compared to a loss from operations of $6.5 million in the third quarter of 2021 as we invest simultaneously across new markets in this phase of our company's growth. As we noted last quarter, we continue to believe that gross margins will expand over the next few quarters as we transition to new GaN products and as the revenue contribution from our silicon carbide products continues to grow. The sequential increases related to a full quarter of GeneSic operations and continued investment in that business, increases in compensation types of bonuses paid to China employees, which is effectively an additional month of salary, which is standard in China, and further investments in R&D, new products and added design center activity around future growth opportunities. We expect, silicon carbide business to con continue to grow and like I said, we have new products coming in on the GaN side that are, that provide higher margins than what we would see today, a better cost structure. And again, if you think about you know, what we talked about potentially doubling our revenue next year and the margin guide and kind of the OpEx guide, I think you get to a number where, it's $12 million to $14 million a quarter now and it'll go down through next year."
}