{
    "symbol": "OPK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 23:11:04",
    "content": " As Phil outlined, we entered into our transaction to acquire ModeX today and paid a total of $287 million in shares of OPKO, issuing approximately 90 million shares as well as restricted stock and stock options totaling approximately 6 million shares that we will invest over the next four years. In addition, as Phil mentioned, Pfizer, our partner for our long-acting growth hormone recently launched in Japan and Germany, which triggered $85 million in milestone payments, which we will receive in the second quarter of this year. We continue to invest significantly in our commercial organization, including Scarlet Health, our digital health platform, and we accelerated the investment during the quarter in our GeneDx commercial team, which resulted in an increase within SG&A of approximately $10 million. Revenue from product sales in the first quarter of 2022 increased 8% to $36.7 million, which included $5.1 million of revenue from RAYALDEE compared to $33.9 million in the 2021 period, inclusive of $5.8 million related to RAYALDEE . With respect to the transfer of intellectual property, we reported $6 million of revenue for the 2022 period compared to $4.2 million from a year ago, reflecting a milestone payment received for the launch of RAYALDEE in Europe, partially offset by decreased Somatrogon R&D-related revenue. Overall, research and development expense for the quarter -- first quarter of 2022 was $12.3 million compared to $15.8 million in 2021, reflecting a decrease in spending on our Somatrogon development program. We have added R&D expenses to reflect the development programs at ModeX, and we anticipate performing between 3 and 3.5 million COVID diagnostic tests during 2022, including the 2 million tests we've already performed in the first three months of the year. So the $85 million milestones from Pfizer as well as the Sema4 $18 million that you referenced, we should expect both of us to hit the income statement in the second quarter."
}