{
    "symbol": "PBPB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 23:15:17",
    "content": "  Operator: Good afternoon, everyone, and welcome to Potbelly Corporation’s First Quarter 2022 Earnings Conference Call. After today’s presentation, there will be an opportunity to ask questions. And I would now like to turn the conference over to Ms. Adiya Dixon, Potbelly’s Senior Vice President and Chief Legal Officer. After our prepared remarks, we’ll open the call for your questions. I’d like to call your attention to our cautionary statements on Slide 2, and note that certain comments made in this call will contain forward-looking statements regarding future events or the future financial performance of the company. Additional detailed information concerning these risks regarding our business and the factors that could cause actual results to differ materially from the forward-looking statements and other information that will be given today can be found in our Form 10-K under the headings Risk Factors and MD&A and in our subsequent filings with the Securities and Exchange Commission, which are available at sec.gov. As always, I would like to begin today’s call by thanking our employees for their continuous hard work and positive energy. I’m so proud of our associates, and I’m grateful they choose Potbelly as the place to grow their careers. Now let’s begin on Slide 3, where I’ll provide a brief overview of the first quarter 2022. Following Omicron and weather-related headwinds early in the quarter, same-store sales gained momentum at an accelerated pace, and we’re extremely excited to have achieved record AUV performance in the month of March. Our adjusted EBITDA for the quarter was a loss of $2.3 million, which although negative, still represents a significant improvement compared to a loss of $6.6 million for the first quarter 2021. During the period, we renewed our focus on food innovation and food-focused promotional initiatives, including the rollout of our seasonal red velvet cookie for Valentine’s Day and buy one get one free promotion celebrating our 45th Anniversary and National Meatball Day. We’ve also seen strong improvements in our catering business following successful promotional activity, including a focus on social catering for occasions such as the Super Bowl and March Madness. Following the rollout of our upgraded tech stack, we also enjoyed continued positive response from our customers as well as increased enrollment and engagement in our Perks loyalty program. Not only have our digital platform investments, enhanced customer value, but they’ve also driven top line performance through increased check, traffic and accessibility to our shops with the various order and service channels that meet our customers’ needs. We’ve implemented a number of new initiatives to strengthen the workplace environment for our dedicated associates, thus driving stronger employee satisfaction and retention, which have resulted in continued improvements in overall customer satisfaction. For example, we’ve successfully rolled out our digital tipping in all of our shops. We’ve seen extremely encouraging results from this initiative, including better service for our customers and better pay for our associates. Lastly, we’ve been very active in executing against our Franchise Growth Acceleration Initiative announced last quarter. Later in today’s presentation, as we discuss shop level margins, Steve will provide a more detailed explanation of this presentation change. Please turn to Slide 5 of the presentation, where we outline the progression of average unit volume, or AUV as well as same-store sales throughout the first quarter of 2022 and the month of April. Turning to Slide 6, I’ll walk you through our income statement and specific financial performance for the first quarter of 2022 compared to the first quarter of 2021. During the first quarter, total revenues were $98.2 million, an increase of 25.8% compared to $78.1 million in the prior year quarter. This was driven by a combination of increased traffic, improved staffing and customer service, successful marketing and promotions, our new menu launched last year and strategic price increases. The previously mentioned headwinds and seasonality impacted sales early in the quarter, along with heightened inflation, which placed pressure on margins. The increase on a dollar basis was driven primarily by compensation as multiple senior leadership team positions were vacant in Q1 2021, and our CEO is receiving a $1 salary in his first year. As we continue to pivot our business towards being a franchise-focused organization, we have adjusted our shop level margins to better align with this shift. Shops now carry certain advertising and marketing expenses, including fees to support our scaled media spend based on a percentage of sales. To reflect this adjustment, we will be providing a reclassification of shop level margins for the past four quarters on our Investor Relations website to support easier comparison. Food, beverage and packaging costs or F&P, were $27.3 million or 28.0% of shop sales versus $21.5 million or 27.7% of shop sales in the year ago period. As we’ve discussed previously, we are working to mitigate the impact of increased input costs and have optimized our cost-saving actions to drive the greatest value for our customers. During the quarter, we saw our average hourly wage increased 14% compared to the year ago period. In an effort to recruit and retain our employees, we’re proud to have implemented new recruiting measures, referral programs and as Bob alluded to our tipping program. Shop level margins under our new presentation were 5.0%, a meaningful improvement compared to a negative 0.2% in the year ago period, driven by strong top line performance and cost discipline. It’s also worth noting that just as sales built through the quarter, margin performance was strongest in March as well. Our liquidity position at the end of the first quarter was $19.5 million, which consisted of $9.5 million in cash on hand and $10.0 million available on our credit facility. Turning to Slide 7, I will talk you through our same-store sales metrics for each of our shop types versus the year ago period. Each of our shop types, except drive-thrus, delivered growth in same-store sales on a year-over-year basis. While in-shop dining saw a slight step down in contribution sequentially, primarily due to weather and Omicron-related challenges, we are pleased to see our dedicated customers continue to come into our shops at an elevated rate year-over-year. Before I pass the call back to Bob, I’d like to turn to Slide 9 to discuss our 2022 priorities and guidance. Additionally, we remain on track to deliver our 2022 guidance of record AUVs, double-digit growth in same-store sales and shop level margins in the low double-digit range. For the second quarter, we are expecting revenue of between $110 million and $116 million as well as shop-level margins between 9.0% and 11.0%, a notable increase on a sequential basis. On Slide 10, I’d like to briefly remind everyone of our Five-Pillar Strategy, which continues to serve us well as the foundation for our three-year strategic growth objectives, which we unveiled last quarter. To wrap up my prepared comments on Slide 11, I’d like to remind you of the 2024 growth targets we unveiled last quarter. Number one, AUVs of $1.3 million achieved through continued shop recovery, customer service and satisfaction and our targeted marketing efforts leveraging digital and our Perks loyalty program. Number two, shop level margins of greater than 16%, supported by top line leverage and aggressive cost discipline, including labor as well as supply chain and food cost management. Number three, refranchising approximately 25% of our company shops is significant as we move towards a franchise growth company. First one on pricing, I understand from your comments and from your release, you took a 5.4% increase during the quarter in February. One is to make sure that we continue to have a well-balanced kind of price value equation for our customers, but also to offset some of the inflationary headwinds that we had coming our way. And we didn’t quite outrun it completely in terms of the price increase, we came pretty close. And we’ve been consistent with not just this past price increase, but with prior price increases that we’ve seen as well. Yes, so we are planning two more price increases through the year, but I would emphasize, similar to the thoughtfulness that we put into this past price increase – they’re discretionary to a certain extent, right, as we see the inflationary environment evolve as well as the consumer behavior environment in all evolve. I think based on the way we thought about inflation evolving both on the wage side and on the F&P side, the price increases that we considered should net us out pretty close to even in terms of net margin impact. And…\n Yes, Matt, if I can add to Steve’s comments on the pricing – and I think you’ll hear a lot of this, this earnings cycle, just a lot of sensitivity to the inflation on the one hand and consumer demand on the other hand, and kind of threading that needle. As Steve said, we’ve got those two discretionary price increases on our calendar for later this year. So we’re looking at a lot of things internally that measure the customers’ perception of value and how they’re reacting to those price increases and ensuring that especially for our loyal customers, as you saw us do things like our BOGO offers, some loyalty Perks promotion activity. And even we’re – frankly, we’re very excited to continue to see the value of our three size menu were those Skinny sizes gives people our lower price point and the pick-your-pair that they can use. So our customer reaction to the price increases has been – sure some have noticed it, but we’re really pleased with the flow-through and the persistent consumer demand. I think it’s also good to reiterate, as Steve talked about. And are you planning any additional wage increases at this point, so I guess we’ll start there. Sorry, I didn’t – I think just to cater the numbers really quickly. We mentioned in the prepared remarks that we saw wage increases at about 14%, and those are associate wage, so the hourly wage increases for the quarter that’s versus prior year. And we’ve, I think, seen – somewhat of a flattening of the acceleration that we saw kind of last – end of last year into this year and that’s helpful to us. And as you heard in the prepared remarks, we’ve instituted a tipping program, which has been beneficial to not just recruitment but retainment of our store-level employees. And of course, in those markets, and there are fewer of those this year than last year where there’ll be legislative wage increases. But candidly, in many cases, in most cases, we’re well ahead of those legislative numbers anyway because the market drove the wages higher. Yes, we don’t share those internal trends, but we are excited to tell you that our shop turnover numbers, both at the associate level and at the manager level are well below the numbers that we get for fast casual as an industry. And overall staffing, where I think we talked a couple of quarters ago, it was probably one of the worst environments I’ve seen in over 30 years in the business. We can always use more high-quality people, but we’re not in crisis mode and certainly in a much, much better position than we were even six months ago. Our expectation is that many of the workplace things that we’ve been working on training and staffing and positioning guidelines and the labor guidelines, the management staffing that we’ve done, all of that is beginning to bear more and more fruit for us. It’s not only showing up in our employee turnover numbers as those, as I said, are proving to be very good. We’ve got marketing campaigns, outreach campaigns. As you suspect, we look forward to making news on any deals that we sign, and we’ll do that when we sign them, much like we did last week when we issued that press release for our Reef partnership for our mobile – our ghost kitchen partnership that we have with Reef. As we have new deals, whether they’re refranchising deals or new SDAA deals, we’ll make sure that you guys know about them in real time. I guess, final question for me is on digital marketing, which is based on my understanding, one of the core components of you’re getting the system to $1.3 million over time. But much of the spend that we’re investing in that scale media is, in fact, in awareness building. I think we – as we’ve shared before, we hold ourselves to a very high standard for the returns on those investments. And unlike a lot of e-commerce where you’re simply tracking the click-throughs and the online purchases, we’re actually measuring pre-post net of control sales lift overall sales lift because we recognize that much of our advertising drives foot traffic into the shops. We’re comfortable that the investment is delivering returns, and then we take the next step to expand it a little further. So in fact, quite a bit of it is awareness building advertising, and we’re very pleased with how it’s working for us. We believe Potbelly is at the forefront of growth, and we look forward to unlocking the company’s fullest potential."
}