{
    "symbol": "DO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 15:31:07",
    "content": " Firstly, the Ocean BlackHornet had its contract extended by 2 years with an estimated backlog add of $290 million. Secondly, the Diamond managed Auriga secured a 1-year extension with BP which will keep the rig contracted through March of 2024, with an estimated backlog add of $150 million. I'll also touch on our marketing and management services agreement with Aquadrill LLC, provide a brief overview of the reactivation and contract preparation work beginning for the Ocean GreatWhite, provide some insight into our projected results for the full year 2022 and offer some commentary on the new contracts we announced yesterday. Our contract drilling revenue for the second quarter, excluding reimbursable revenue, grew to $177 million as compared to $150 million in the prior quarter. In the second quarter, we recorded $20 million in contract drilling revenue and $2 million in EBITDA associated with the managed rigs. We expect the total cost to be incurred in advance of contract commencement to be in the range of $35 million to $40 million, consisting of $18 million to $20 million associated with reactivation scopes with the remaining $17 million to $20 million being allocated to operating expenses until contract commencement, emissions reduction equipment, mobilization costs and customer specified equipment. Consequently, our contract drilling revenue for the full year 2022 is anticipated to remain in line with our prior guidance of $700 million to $730 million, exclusive of reimbursable revenue. Our liquidity at the end of the second quarter stood at $339 million, including $43 million of unrestricted cash and $296 million of undrawn capacity on the revolving credit facility and delayed draw first lien notes. The $610 million in contract awards we signed since the close of the quarter, combined with our previously existing contracts, secures revenue for approximately 75% of our available 2023 capacity, excluding planned shipyard stays and cold stacked rigs, giving us greater visibility and confidence in our 2023 results."
}