{
    "symbol": "STKS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 14:59:06",
    "content": " For the third quarter, our total revenue grew to $73 million, reflecting our U.S. average weekly sales of $290,000 at STK and 95,000 at Kona Grill. When compared to 2019, our pre-pandemic base year, consolidated comparable sales increased 45.6%, consisting of an increase of 7.6% at STK and a 22.3% increase at Kona Grill, which shows that weâ\u0080\u0099ve retained the share increases for both brands and that our differentiated fine dining experience is resonating with our guests. Despite the challenging construction environment, we plan to open during the remainder of 2022 and first quarter of 2023, one within the next couple of weeks a managed STK in Stratford London U.K., 3 company-owned Kona Grills, Kona Grill in Riverton, Utah, Kona Grill in Columbus, Ohio; and Kona Grill in Desert Ridge, Arizona. Included in our total revenue is our owned restaurant net revenue of $69.5 million, which increased 2.3% from $68 million for the same quarter last year. Owned restaurant cost of sales as a percentage of owned restaurant net revenue decreased 120 basis points to 24.9% in the third quarter of 2022 compared to 26.1% in the prior year, primarily due to operational cost reduction initiatives, partially offset by increased commodity prices. When adjusting for the gains on CARES Act loans, COVID-19-related expenses and other non-recurring expenses or gains, adjusted net income was $2.1 million or $0.07 adjusted net income per share compared to an adjusted net income of $3.7 million in the third quarter of 2021 or $0.11 adjusted net income per share. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And then for the fourth quarter, we are looking at another 5% coming in pricing for STK and Kona Grill and we are putting that effectively at the beginning of November, which is around right now. Please proceed with your question."
}