{
    "symbol": "CMPR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-30 17:20:16",
    "content": " Our profitability this past fiscal year and also in the fourth quarter was significantly weighed down by high levels of discretionary investment and also cost inflation that increased in the second half of the year and was not offset by price increases, although we believe there's opportunity for that in the near term that we've started to take action on. With our foundational investments in place, the Vista team now has a clear focus on demonstrating that Vista's transformation can now yield rapid improvements to customer value and the financial returns on the significant investments that we've made, and we look forward to sharing tangible examples of that at our September Investor Day. In our letter, we've once again shared our range of estimated steady-state free cash flow, which shows a decrease from our pre-pandemic high due to Vista's financial results and, in particular, the impact of cost inflation and also product mix changes, which is partly offset by increases in our other businesses. In terms of capital allocation, we've mentioned in the letter, Sean has spoken about different times that we -- although, we don't change what we consider our -- or our hurdle rates month-to-month, quarter-to-quarter, even year-to-year, there is a implied hurdle rate of what we need to do, given the opportunities for capital investment, whether it's organically in the Upload and Print businesses or Vista or National Pen or importantly, places like share buybacks and debt repurchases, which we have not done. More broadly, I'd say that the -- even before this inflationary environment, the Vista strategy we've laid out is to take that traditional strength in do-it-yourself design that Vista has had that differentiated us from so many other our competitors out there and really double down on that by -- if you look at just to create 99 designs, the investments we're making our customer service-based design, those are really at the core of the elevation of the value proposition or the increase of the value proposition we're giving to our customers in Vista. And so some of -- I think, some of our recent actions, I think, have been informed by this notion of a higher hurdle rate, exiting long-term investments for the reasons that Robert talked about before, like our businesses in Japan and in China, I think are clear examples where we just -- we can't justify those long-term investments right now relative to increased hurdle rates when we can allocate capital and our time and focus elsewhere. But with the mid- and upper-funnel ad spend that we've had in FY '22 and the nature of that and the fact that that isn't intended to pay back in year and the fact that we've only included just a small amount of our performance advertising in our growth investments that we outlined in the letter, I think from my perspective, that line is pretty clear as well. And then the other one that's, I think, the hardest for you all to judge is the investment in Vista OpEx, that talent-base, where we've added significant costs over the past few years, either in terms of hiring new talent, which we have a very high level of confidence in, in areas like user experience, design or in product management or data and analytics and brand, and even in our technology teams, which now as we can look beyond replatforming, many of those teams can shift to building new capabilities. Well, I think visible means to appear, I think the -- yes, what we're trying to get across there is that there should not be an expectation based on the commentary that we provided that we're entering into a large year of margin expansion in Vista as we still annualize the increased investment levels that we had in FY '22 and also the significant cost inflation that we've had, and we've outlined that in our documents last few quarters. But I think that especially given the impact that we felt over the last few years, either from the pandemic, from changes in product mix, from cost inflation, of course, in order to get to the point that's referenced in the question to justify and have strong returns on all of our investments, of course, we have to first get to what we outlined in the document. But we're moving forward into FY '23 because we feel that we have never been better positioned, including at Vista in terms of technology, people, products and a strategy to give much greater value to the customer in a way that's not done anywhere else, and that will, we believe, translate to value to shareholders."
}