{
    "symbol": "DSGR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 10:55:26",
    "content": " With the inclusion of Lawson from a comparative basis, sales increased 46% or $109.5 million over the third quarter of 2021 with $68 million coming from acquisitions and organic growth of slightly over 15%. Excluding these items as well as for previous quarters Lawson's adjusted EBITDA improved to $9.7 million compared to adjusted EBITDA of $7.6 million a year ago, primarily driven by the sales and gross margin improvements, partially offset by increased compensation and health care costs. On an adjusted EBITDA basis, the third quarter ended at 8.7% of sales or $10.1 million, representing an increase of $4.6 million over a year ago quarter of which approximately $2.5 million came from the 2021 and 2022 acquisitions previously mentioned. If there's not a deliberate reason to make an acquisition where you think it makes the financial and long-term sustainability of your core better, then there's not a real reason to go out lay off that capital because like I tried to talk about our in the prepared remarks, the incremental returns on invested cash capital -- on invested capital and working capital is are so high in distribution businesses that you can compound your business very attractively, most attractively through capital invested in working capital, or in internal initiatives. And so as we look at how to bind together the capabilities of TestEquity on their engineer, and production supply business, and the Gexpro and Lawson -- Gexpro services and Lawson OEM and MRO, SKU and technical knowledge, there's some pieces in the marketplace that fit really well, that pull kind of have long been part of our vision of pulling those elements tighter together as one solution. But as we think through the future in terms of better looking for ways to better serve our specific needs of our customers with such a diverse customer base that we have within A segments and different end markets, but both sides as well, we're very carefully working with a field in our sales team to develop different testing in different ways to continue to become stickier, and being able to allow our more precious time for our sales team to be in front of customers. But as we enter into 2023, certainly, we're looking to expand those margins, really based upon the continual organic growth that we're seeing, the M&A that we've talked about, a lot of the initiatives that are taking place across all three companies in terms of sales expansion, as well as some cost opportunities that we're identifying as well, which we feel that more of those will be realized in in '23, than what are currently coming through the P&L in '22. And as we're all getting to know better the businesses that are included in the new DSGR, I would love to just maybe if we get to discuss qualitatively, kind of how Lawson but especially TestEquity and Gexpro kind of responded in a recessionary environment in terms of new kind of factors that impact demand volatility, detrimental margins, and things like working capital, just obviously, not necessarily numbers, but just maybe help us better understand some of the factors that influence how each, each of the three businesses behave in a downside scenario. Notwithstanding inflationary pressures on it going forward to be able to either manage a larger revenue base, and watching our working capital intensity, come back down several percent -- 100 percentage points, or several 100 basis points, or being able to pull significant cash out of working capital, which is what we've been able to do historically, in these businesses, even across our distribution companies during softer periods, these instances, we were associated with them all during the COVID cycle. Russ  are jumps in, you talk about, for Brad, we've added 3,600 SKUs 3,300 SKUs, in the last 90 days on our digital platform, part of kind of that investment in working capital in the last six months, that's taken place in test and in Gexpro Services and in Lawson, as well."
}