{
    "symbol": "DSGR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 14:38:17",
    "content": " In addition, we attained our adjusted EBITDA margin target during the second half of 2022 and most recently during the fourth quarter we delivered strong double digit organic sales growth that beat expectations realizing an adjusted EBITDA margin of 10.3% on fewer selling days. In our pursuit of strategic acquisitions, we not only look for fit within each of our operating companies, but we also seek to find opportunities that have commercial logic for all three businesses units, bringing them closer together while enhancing each of their organic growth rates and returns on working capital investment. This represents an increase of 155% on a GAAP basis driven by the inclusion of Lawson Products commencing on April 1, organic growth of the businesses and acquisitions made by both Gexpro Services and TestEquity in 2021 and 2022. With the inclusion of Lawson from a comparative basis, sales increased 42%, or $97.6 million, over the fourth quarter of 2021, with approximately $60 million coming from acquisitions and organic growth of 16.7%. On an adjusted basis, taking into account merger related costs, stock-based compensation, severance and other nonrecurring items, adjusted EBITDA improved by $16.3 million to $34 million, or 10.3% of sales, exceeding our previously stated goal of exiting 2022 at 10% and third diluted loss per share was $0.10 for the fourth quarter. Lawson's adjusted EBITDA improved to $11.5 million compared to adjusted EBITDA of $6.8 million a year ago quarter, primarily driven by the sales and gross margin improvements, partially offset by increased compensation and healthcare costs. Total sales were $100.1 million for the fourth quarter of 2022, an increase of $33.6 million over Q4 of 2021 of which $26.3 million was driven by acquisitions and $7.3 million from organic growth. This increase in aggregate sales was primarily driven by new customers with the expansion of existing customer relationships, Gexpro Services adjusted EBITDA expanded to $10.8 million, or 10.8% of sales, as compared to $4.6 million, or 6.9% for the year ago quarter. Acquisitions drove approximately 3.9 of the earnings increase for the quarter, and on a year-to-date basis, Gexpro Services adjusted EBITDA grew to $43.2 million, an increase of $19.9 million over 2021. Of the $42.7 million sales increase for the quarter, approximately $33.9 million was generated from the 2021 and 2022 acquisitions while organic sales increased 14.5% with approximately 7% coming from price. On an adjusted EBITDA basis, the fourth quarter ended at 9.9% of sales or $10.5 million, representing an increase of $5.9 million over a year ago quarter of which approximately $3.8 million came from the 2021 and 2022 acquisitions previously mentioned. In 2023, we are prudently executing against our capital allocation strategy by analyzing the best long term ways to drive shareholder returns with our collective resources by assessing one; investment opportunities in our core businesses; two, paying down debt with free cash flow; three, selectively buying back our stock and four, investing in highly strategic and accretive acquisitions that add economic value, commercial durability and accelerated organic growth to our platform. And all that's continuing to unfold and accelerate as we've continued to expand engagement between the businesses and as we've expanded engagement between the businesses and I went to Bob's Sales Leadership  120 people, and all three of Russ, Cesar and myself joined Bob in kind of an open forum to talk to all those 120 sellers and kind of lead folks for Gexpro services and where they are today their momentum and enthusiasm for how to work together collaboratively and the way that we're rewarding people inside of the organization for uncovering ways to accelerate organic opportunities is exciting and it seemed you could feel the energy level amongst the colleagues there. And much of what we're focused on today is not only continuing to drive that, but now it's given us some real momentum with Cesar's leadership to really go in and look at ways to invest in even more opportunities for growth or giving our sales force even more tools to give them more bandwidth so that we can get more operating leverage off of them longer term and they'll be able to make more money. Yes, Bryan, I would just add on that, and Ken when we look at the growth of the adjusted EBITDA from a year ago quarter, about $8.6 million of that growth of the call it almost $17 million was organic growth. We've enjoyed a great first nine months together and now it's eleven months and the momentum continues to offer us a lot of confidence and enthusiasm around bringing these businesses together and the opportunities that we are more discreetly able to see and to try and tackle in front of us that we think it's going to not only enhance our existing strengths in the marketplace, but also give us a stronger platform for growth and enhance shareholder value."
}