{
    "symbol": "KIRK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-30 14:52:05",
    "content": " On today's call, I'm going to go over our performance in the second quarter, the current state of our customer acquisition strategy, our liquidity and inventory management goals for the remainder of the year, and what the consumer spending environment looks like as we head into harvest and holiday selling season. As I spoke earlier, we have been hyper focused on inventory management to significantly improve our liquidity profile by the end of the fiscal year, we made a clear effort to begin working through our inventory position as we churn through excess inventory -- excess products that we needed to clear off our balance sheet knowing we would sacrifice margin. Net sales were $102.1 million, compared to $114.8 million in the year ago quarter, which included a comparable same store sales decline of 8.6%, which was driven by the year-over-year decline as in-store and online traffic and conversion, partially offset by an increase in average ticket. We expect to be in a good seasonal inventory position and have products available for the scheduled set dates, which we believe will benefit holiday demand the most with year-over-year sales trend improvement in the back half of October and the first half of November. So I think that that's where we pull back for the balance in this year, but also trying to hit that goal for our liquidity, we want to really make sure that we are as clean on the balance sheet with as little borrowings as possible at the end of the year and try to hit that Nicole number of between $80 million and $90 million. And we want to make sure that we treat that inventory with respect now that we've gotten through the second quarter where we knew we just had to lower the overall number, here Nicole said on the call earlier that you're not seeing it as much, because we're also bringing in harvest and Christmas at the same time, which has been very natural liquidation through the third and fourth quarter. So we took the position of taking categories that we knew we had more inventory, especially in core categories, and letting that inventory have a higher discount, which allowed us to have a good quality basis of inventory for the back half of the year and going into next year, the worst thing that we could possibly have done would be to take great products that we know, we wouldn't have to reorder next year."
}