{
    "symbol": "KIRK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-04 11:31:06",
    "content": " However, soon thereafter, we began to see traffic decline rapidly, both in-store and online, along with experiencing the effects of significant inventory reductions on our merchandise mix, both of which ultimately drove our overall quarterly sales lower on a year-over-year basis. While we're still planning to provide larger ticket items in categories such as furniture and outdoor, we're going to be working on rebalancing our merchandise assortment with a focus on opening price points, starting in the $20 range and ensuring that our inventory availability appropriately supports customer demand. Overall, I'm very proud of what this organization has been able to accomplish in such a difficult macro environment this past -- as this past year, including improving the quality and design of our merchandise, updating the customer, the company's branding, enhancing the omnichannel experience and optimizing our operating structure with a focus on delivering long-term profitability. For the fourth quarter, net sales were $162.5 million compared to $176.2 million in the year ago quarter, which includes a 4% decline in store count and a comparable store sales decline of 6.1%. Third, store occupancy costs increased 140 basis points to 9% of sales from 7.6% in the prior year quarter, largely due to deleverage from a lower sales base. Fourth, outbound freight costs, including both store and e-commerce shipping expenses increased 150 basis points to 8.3% of sales from 6.8% in the prior year quarter. Total operating expenses were $43.5 million or 26.8% of sales, compared to $44.6 million or 25.3% of sales in the prior year quarter, an increase of 150 basis points. But as I look into '23, I think you should probably think about it as neutral, I think and maybe a slight cash generator just given where we are from a store count basis as we end the year I think the way to think about it is we'll probably end the year right around the way we started it with a little bit of a, you know, obviously a peak into third quarter as we prep for the high selling season."
}