{
    "symbol": "LIQT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 13:35:18",
    "content": " Importantly, quarter 4 2022 operating expenses continued to trend sequentially lower to $2.3 million, excluding any restructuring expenses compared to $2.4 million reported in quarter 3 2022, and we reduced annual operating expenses by 37% from the prior year period, hoping to substantially reduce our revenue breakeven point. Simon will hit on the numbers a bit more but I can confirm that we are on track to deliver a profitable business based on quarterly revenue breakeven around $7 million, which is a significant improvement from where we were a few quarters ago. As we look through the first quarter, we are expecting revenue of about $4 million, which was representing an 11% increase from the year ago first quarter and about flat with the fourth quarter. In terms of outlook for the first quarter, I also echo the remarks made by Fei indicating a Q1 revenue of approximately $4 million, an improvement of about 11% compared to Q1 last year and flat compared to the fourth quarter of 2022. Total operating expenses for the year was $13.1 million compared to $12.3 million in 2021, with the year-on-year increase explained by the restructuring cost of $1.9 million as well as non-recurring costs related to the CEO transition and China closure. As Fei mentioned, fourth quarter OpEx came in at $2.3 million, excluding restructuring expenses, this compared to $3.7 million in the fourth quarter of 2021, i.e., a reduction of 37% evidencing the benefits of our cost reduction efforts. Concluding on the P&L, net loss was $14.2 million for the year compared to a loss of $11.1 million in 2021, with increase explained by the non-recurring restructuring costs, China closure, early repayment of convertible note and the CEO transition. For the fourth quarter, net loss was $2.2 million compared to a loss of $2.7 million in the fourth quarter of 2021, hence, a meaningful improvement despite lower revenue and a review of our inventories conducted during the quarter. We ended the year with $16.6 million in cash, down $1 million compared to the third quarter evidencing a significantly lower cash burn compared to the same period last year."
}