{
    "symbol": "LIQT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 14:22:08",
    "content": " Joining us on today's call from the company are Fei Chen, Chief Executive Officer; Alex Buehler, Former Interim Chief Executive Officer and Member of the Board of Directors; and Simon Stadil, Chief Financial Officer. Although the forward-looking statements reflect the good faith and judgment of management, forward-looking statements are inherently subject to known and unknown risks and uncertainties that may cause actual results to be materially different from those discussed during the conference call. The company therefore urges all listeners to carefully review and consider the various disclosures made in the reports filed with the Securities and Exchange Commission including risk factors that attempt to advice interested parties other risks that may affect our business, financial condition, operations and cash flows. If one or more of these risks or uncertainties materialize or if the underlying assumptions prove incorrect, the company's actual results may vary materially from those expected or projected. The company therefore encourages all listeners not to place undue reliance on these forward-looking statements, which pertain only as of this date and the date of the release in conference call. I believe we all understand the tremendous opportunity that is in front of us to leverage our highly unique technological advantages, brand competences and sustainability value to build a growing and profitable business in the years to come. I need more than eight weeks to provide you with step by step details on our going forward strategic plan, let me provide some high level observations and initial thoughts on how we are accelerating our commercial and business development processes. It is therefore very interesting for me all of the years, these years later to assume the responsibility to accelerate the commercialization of LiqTech membrane technology, which is even stronger today. Strategically, it's rather obvious that we are currently too reliance on large silicon sales to generate revenues. To balance this reliance we are moving quickly to maintain and grow our markets where we have increasing potential for recurring revenue such as pool and spa systems, diesel particulate filters, membranes, plastics and aftermarkets. For instance, just last week we launched our new Aqua Solution membrane that that demonstrates notable improvements to our existing member solutions both in production process stability as well as final product robustness. You likely have not heard us talk much about the pool and the spa market, but from my experience, this brings an imminent opportunity for recurring revenue like we had preserved for many years with DPS. As a point of reference, we have five pool system delivery trended for the fourth quarter, so we are very excited about this market and intend to aggressively pursue it in the years to come. Further our agreement in the Middle East addressing produced water treatment for oil and gas production where we are operating in a build, own and operate model has similar recurring revenue characteristics. Importantly with this result in hand, we are working intensively and go to market plan for produced water in Middle East region. Specifically at the end of September we closed a large order consisting of nearly 1,200 membrane elements. I will provide more details in the future, but please understand that expanding our commercial activities where we can achieve more recurring business is a team strategic focus going forward. Where we work to expand our focus on recurring revenue opportunities and develop distributor relationships, we will maintain our current efforts to further develop system projects to our target markets including marine, scrubbers, black carbon, oil and gas, acid purification and others where we have a number of systems set to be delivered that will drive near-term revenue growth. On top of that following the successful commissioning of our first system for asset purification market in the U.S., we are active discussion with this customer regarding a second system deployment at another site. I will let Simon to provide details on the outlook for the fourth quarter, but in general based on our existing recurring revenue covered with system delivery planned for quarter four. In late September, we announced the appointments of Ms. Janne Pedersen as Vice President of Sales and Mr. Kim Hansen as Managing Director of LiqTech Plastics. Kim has many years of leadership experience with international companies such as Mercuri International Group and Grundfos and was recently Managing Director of Flexiket, Intertek and Bording Link where he achieved successful turnarounds and transformations. Having included a successful career in sales, business development and product management from firms such as Hach Lange, Grundfos, Diatom, FOSS Analytical and Alfa Laval. Additionally, this week we announced the appointment of Tobias Baldrian Madsen as our new Head of Strategy and Business Intelligence as we work on advancing LiqTech to the next stage of commercial development. Nevertheless, we indeed experienced some slowdown in order closure in quarter three due to the energy crisis, macroeconomic uncertainty, high inflation and the rising interest rates. Firstly, we are moving quickly to accelerate the commercial and the business development processes here at the company. We are continuously working to develop markets where we can create more predictable recurring revenue opportunities, leveraging our differentiated technology, working to overcome gauging sectors that has hinted certain end markets where we see opportunity for the numerous large system deployment. Secondly, we will continue to drive opportunities through our traditional direct go-to market sales pathways, but also look to create new distributor relationships to address certain end markets. Currently, we have bought in highly accomplished commercial sales individuals that can â\u0080\u0093 to develop end market strategies, but more importantly can exclude on those strategies. I believe the additions of Janne,Kim, Tobias and others will make significant contributions with their professional leadership skills and the rich industry knowledge. Similar to what Alex and Simon mentioned last quarter, we remain on track to achieve breakeven at around U.S. $7 million to U.S. $8 million per quarter in revenue. With that, let me turn the call over to Simon to review the financials in more detail after which I do wrap up with a few comments and then open the call to your questions. This development reflects a quarter with stable contribution from our plastics, ceramics and aftermarket businesses, underpinned by increased share of membrane and spare part sales. However, the quarter was also impacted by a slowdown in water system deliveries due to reduced order intake and delayed shipments due to general supply chain issues and longer lead time on our core EQS  membrane production. For our business, the uncertainty did result in reduced order intake for our ceramic DPF and plastic products, which was partly offset by the delivery of large, marine and on-road DPF orders for the Asian market secured earlier in the year. The reduction in plastics revenue of 22% compared to same period last year generally reflects a slow start to the quarter with lower than expected order intake during European summer holiday, amidst the escalating energy crisis. The revenue of 0.8 million represented a 47% reduction compared to Q3 last year with the lack of system deliveries explaining the reduction partly offset by increased aftermarket activities, more specifically commissioning and general spare part sales. Looking at the currency development, the U.S. dollar appreciation against the Euro did continue into the third quarter with the year-to-date September FX rate 12% higher than the same period last year. On that note, I can confirm that approximately 70% of our year-to-date revenue has been denominated in non-U.S. dollar currency, predominantly Euro and DKK. In terms of outlook for the fourth quarter, I echo the remarks made by Fei indicating a Q4 and full year outlook at the low end of the previously communicated guidance. Before diving further into the numbers, I like to highlight that we, despite the challenging market backdrop, have been working thoroughly and with clear and decisive measures to right size our business and restore financial stability. On that note, Iâ\u0080\u0099m pleased to see substantial improvements in both cash flow, fixed cost and OpEx reduction efforts. To be specific, our operating cash flow in the third quarter ended at negative 0.5 million representing a significant improvement compared to previous quarterâ\u0080\u0099s run rate. Fixed cost and OpEx came down 19% sequentially and now more than 30% compared to the beginning of the year, which reflect our commitment to substantially reduce our breakeven point of the business measured on an adjusted EBITDA basis. In the same context, I can confirm that we are on track to deliver a profitable business based on quarterly revenue breakeven around $7 million since at the low end of the previously communicated target of 7 million to 8 million. With regards to cash flow outlook, I can confirm that the company continues to benefit from reduced CapEx commitments and the successful refinancing of the convertible note earlier this year. The company had as of September 30, less than $1 million of outstanding cash CapEx commitments and no interest payments due on the senior notes. Furthermore, following the delivery and installation of the new production equipment in early 2023, our company will have ample capacity to significantly grow our water systems after market and ceramic membrane business without further investments over the near to medium term. The gross margin in the third quarter of 3% reflects low activity levels within our water systems business, but also the adverse impact from the escalating in anti-crisis in highly inflationary environment across Europe. The quarter was further challenged by non-recurring inventory adjustments and write-downs within our ceramics business, reflecting a proactive and proven review of our ceramics inventory for dated and slow moving products in the period with reduced activity and increased uncertainty. On a more positive note, we successfully secured and delivered high margin membrane and marine DPF orders during the quarter as well as large aftermarket orders allowing for a stable sequential development in the reported gross margin, this despite the lower top line. Furthermore, our increased focus on pricing discipline is continuing to support our underlying profitability, which combined with sequential reduction in fixed cost of $0.2 million did allow for significant improvement in both gross and contribution margin when excluding the non-recurring inventory adjustments previously I mentioned. The cost savings represent and mix up reduced employee costs as well as increased focus on reducing run rate travel, marketing, legal and IT costs. Concluding on the P&L, net loss for the period was $1.7 million compared to $2.9 million in the same period last year, indicating a vital step in the right direction with cost reductions and improved capital structure being the main drivers. We ended the quarter with $17.6 million in cash down $2.1 million from last year â\u0080\u0093 from the second quarter, sorry. To summarize and reaffirm, we are committed to further improve our financial performance through incremental cost reductions, which together with the improved product mix and pricing discipline will pave the way for a business imbalance over the coming quarters from both a profitability, cash flow and capital structure perspective. We are during the course of 2022, stabilized and right sized our business and is evident that we now will position to take the next step on our commercial and strategic journey. Look into quarter four, we have a busy quarter ahead of us as we focus executing the various initiatives I mentioned today and delivering a number of systems that are currently in production. So, clearly, if â\u0080\u0093 folks on our products plastics, DPFs, membranes, we haven't seen a price erosion. And obviously, that's always a balancing act, but in terms of price competition and price situation that's not on the agenda. On the system side, there is obviously a more complex picture where we are trying to leverage the value proposition and the value we are creating for our clients to basically increase our pricing and achieve a high contribution margin process business going forward. Yes, I think I would like to add on top of that the new end markets, which we mentioned today, we really believe because our solution has a unique property there, so we might have much better price in the future. And just another question with the 17.6 or so million dollars in cash on the balance sheet, do you think that I mean it's no small task for you to more than double your current sales to get to break even. I think the capital structure obviously is an important vital step, getting the convertible note of our balance sheet, reducing our CapEx commitments and really using the CapEx group spend this year to invest into the right machinery. We have significant capacity at our facilities in Denmark, so we don't need CapEx over the coming years to grow our business even significant growth. If you do get to breakeven, the incremental revenue generated, Fei, from these new applications, I'm not as familiar, within the full space outside of in some of these other verticals. I think a minimum of 40% we need to deliver on, we are striving higher than that and even in Q1 this year and you look into our Q3 numbers and adjust some of the non-recurring items, we are above 40%. So you can say for every million dollars of implemented revenue, we should have at least 40% fall through to Q2  EBITDA and help us achieve that cash flow stability faster than what we've guided to you in the past. We now confident in saying it's more seven and if we achieve higher, better pricing, maybe it could go lower than that."
}