{
    "symbol": "HAE",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-07 14:17:06",
    "content": " Today, we reported third quarter organic revenue growth of 21% and adjusted earnings per diluted share of $0.85, 1% growth over a record third quarter last year. We update our expectation for hospital organic revenue growth to be approximately 19% in fiscal '23, the lower end of our previously issued guidance range of 19% to 22% due primarily to COVID-related challenges in China. North America disposals represented 85% of our plasma revenue and increased 46% in the quarter and 52% year-to-date, driven by strong growth in collection volume and price as a result of the technology upgrades. Encouraged by the strength of our business and the opportunity to continue to support CSL as a result of the newly amended agreement, we are raising our fiscal '23 organic Plasma revenue guidance to 35% to 40% growth, up from the 30% to 35% growth we communicated last quarter. The third quarter adjusted gross margin was 52.5%, a decrease of 240 basis points compared to last year when we reported one of our highest ever adjusted gross margins of 54.9%. Adjusted operating expenses in the third quarter were $101.4 million, an increase of $17.6 million or 21% compared with the prior year. Adjusted operating expenses year-to-date were $299.9 million, an increase of $46.7 million or 18% compared with the prior year. As a percentage of revenue, adjusted operating margin was 19.3% in the third quarter and 19% year-to-date, down 330 basis points and 30 basis points, respectively, when compared with the same period in fiscal '22. Our adjusted operating margin guidance includes higher performance-based compensation, approximately 380 basis points of impact from macroeconomic headwinds and increased operational inefficiencies, partially offset by $26 million in target fiscal year '23 gross savings from the operational excellence program. The adjusted income tax rate was 25% in the third quarter and 24% year-to-date, compared with 21% and 22% in the same period in fiscal '22. Third quarter adjusted net income was $43.6 million, up approximately $1 million or 2%, and adjusted earnings per diluted share was $0.85, up 2% when compared to the third quarter of fiscal '22. Year-to-date adjusted net income was $116.5 million, up $17 million or 18% and adjusted earnings per diluted share was $2.26, up 17% when compared with the first nine months of fiscal '22. The combination of the adjusted income tax rate, interest expense and FX had a negative $0.02 a $0.12 impact on adjusted earnings per diluted share in the third quarter and year-to-date, respectively, when compared with fiscal '22. We are updating our fiscal '23 adjusted earnings per diluted share guidance to be in the range of $2.90 to $3 compared with the previous guidance of $2.70 to $3 The midpoint of our adjusted earnings per diluted share guidance includes an approximate $0.16 headwind from volatility in foreign exchange, adjusted income tax and slightly higher interest expense. Cash on hand at the end of the third quarter was $224 million, down $36 million since the beginning of the fiscal year, primarily due to the $75 million accelerated share repurchase program, $35 million in earnout payments related to previous acquisitions and a â\u0082¬30 million investment in Vivasure Medical, partially offset by higher net income. These include significantly higher net income, lower inventory, primarily due to the Nexus conversions in the U.S. and higher accrued liabilities, including higher performance-based compensation, excluding capital placements, inventory increased year-over-year We believe in our ability to generate strong cash flow and update our guidance for free cash flow before restructuring and restructuring related costs for fiscal '23 to be in the range of $160 million to $180 million compared with $150 million to $180 million previously. In our Plasma business, we are experiencing unprecedented growth in collection volume across all of our customers, disproportionately contributing to the anticipated 35% to 40% revenue growth in our fiscal '23. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}