{
    "symbol": "HAE",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-07 11:17:04",
    "content": " Today, we reported second quarter organic revenue growth of 27%, and adjusted earnings per diluted share of $0.83, an increase of 38% compared to the second quarter of the prior year. North American disposables represent 85% of total plasma revenue, and increased 63% in the quarter, and 56% year-to-date, driven by strong growth in volume and price as a result of our technology upgrades. In the U.S., volume growth was again driven by both new and mature centers, with 38% growth in the quarter, and 39% year-to-date for our long-term customers, and is now trending above pre-pandemic levels. Our Plasma business was a powerful driver of revenue growth and margin expansion, and our strong performance is a result of our market leadership with more than 10 million commercial collections and representing nearly half of all U.S. NexSys collections today, Persona is playing a critical role in helping to drive plasma volume recovery. Encouraged by strong volume growth and the market momentum we are helping to enable, we now expect our organic plasma revenue growth to increase from our previous guidance of 15% to 20% in fiscal '23 to a range of 30% to 35%. Apheresis revenue declined 1% in the quarter, and 7% year-to-date, in both periods this business was impacted by unfavorable order timing, lower revenue from convalescent plasma, and customer staffing and donor shortages at blood centers across the globe, and geopolitical disruptions. As a percentage of revenue, adjusted operating expenses increased by 100% basis points and were at 33.3% when compared with the second quarter of fiscal '22. As a percentage of revenue, adjusted operating margin was 20.4% in the second quarter and 18.9% in the first-half, up 210 basis points and 140 basis points respectively when compared with the same period in fiscal '22. Year-to-date adjusted net income was $72.9 million; up $70 million or 30%, and adjusted earnings per diluted share was $1.41, up 29% when compared with the first-half of fiscal '22. The combination of the adjusted income tax rate, interest expense, and FX had a negative $0.03 and $0.04 impact on adjusted earnings per diluted share in the second quarter and year-to-date, respectively, when compared with fiscal '22. Moving to balance sheet and cash flow, in the second quarter of fiscal '23, we entered into an accelerated share repurchase agreement to buyback $75 million of common stock under our previously announced $300 million share repurchase authorization. Cash on hand at the end of the second quarter was $241.2 million, down $18 million since the beginning of the fiscal year, primarily due to the $75 million accelerated share repurchase program, and $32 million in earn-out payments related to previous acquisitions, partially offset by a $50 million revolver drawdown that was fully paid off subsequent to the end of the second quarter. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}