{
    "symbol": "PCTY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-05 23:01:06",
    "content": " Strong sales performance and operational execution helped drive our total revenue to $246 million or 32.2% growth over Q3 of last year, beating the top end of our guidance by $3 million as we continue to build momentum across our target markets. As Toby noted, our sales team had another strong quarter, and we were pleased to come in $5 million above the midpoint of our Q3 guidance and to raise fiscal '22 revenue guidance by $97 million at the midpoint, resulting in fiscal '22 guidance of 32% to 33% revenue growth. On a dollar basis, our year-over-year investment in total R&D increased by 28.8% when compared to the third quarter of fiscal '21 and we remain focused on making incremental investments in R&D as we continue to build out the Paylocity platform to serve the needs of the modern workforce. And adjusted EBITDA is expected to be in the range of $228 million to $231 million, implying an adjusted EBITDA margin of approximately 27.3%, which represents leverage of 60 basis points versus last fiscal year as we've driven scale across our business to more than offset the roughly 50 basis points of dilutive impact of the Blue Marble and Cloudsnap acquisitions. In conclusion, we are pleased with our Q3 results and we're pleased to raise fiscal '22 guidance to 33% revenue growth at the top end, which in combination with the adjusted EBITDA margin represented in our full year guide, achieves the Rule of 60 for fiscal '22. So the team that's focused on some of the larger clients as -- we've called them out in the past as having some really good momentum in terms of bringing on customers above 500 employees in that -- even in that 1,000 to 5,000 market already, and that was continued momentum with -- in the quarter. So it's examples like that, that we're seeing really gain traction that, as you said, go beyond the traditional compliance kind of ROI, automation-driven message and extend into a much more modern experience that we think can drive significant benefits when it comes to retaining talent and then ultimately getting our customers to be successful growing their business. And so we think the value that we're offering to our clients is producing the right results, both from a revenue that we're able to drive, but also attach and finally, retaining the customers that we've got. So I think we certainly recognize it's a tough labor market, but I think we've been -- we're pretty happy that our employment value prop is really resonating with candidates in the market, so feel good about it."
}