{
    "symbol": "PCTY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-03 20:35:05",
    "content": " And I think as it relates to this year, calling it flat, just under 27%, and I feel like we’re on a pretty good path this year, performing against that, especially in the context of essentially maintaining that margin guidance in the context of also doing two acquisitions that are providing roughly 50 basis points headwind to that. And I would think about it the same way we’ve done historically, which is kind of a similar number of reps that we add to be able to kind of get us to our financial targets and get back to productivity increases, which is great for us to see. So I would say we didn't see impact from Omicron whether that was in our client base and the number of employees that were on the platform or even in our sales motion, we had a really strong January such a big sales month for us, and we're really pleased with sales going into January and then with our starts in January and our ability to guide strong for the back half of the year. I mean one of the things I'd add to Steve's description of the move-up market is if you think back to how we described downmarket initiatives two, three years ago, what we had said was we've been seeing a lot of traction there, and we adjusted the TAM from an external perspective to really just describe the traction that we were seeing. So I really think from our perspective, we're obviously pitching to customers is we have a lot of the same modules everybody else has, but we've got a much more modern view of how you should be interacting with your employees, and we've got a lot of tools that will actually help you attract and retain talent. I think there was 1 positive, I think from – I don't know if it's really a tailwind, but I certainly raise the level of importance of these conversations is, if you ask CEOs of our customers with 20 of your top challenges, they're going to tell you people and it's attracting and retaining talent. And so the newer clients, because they're going through the sales process and they're feeling this pressure in the marketplace and they're looking at our solution, they definitely want to leverage these types of tools, and they're more active in terms of getting on set up with community, launching announcements, using things like video and then just getting engaged with their employees earlier in the implementation cycle. And so we've been driving activity levels over the last six months, higher activity levels into MWI and I think that's probably been one of the bigger contributors in seeing our existing clients use more community features or even use things like surveys and learning."
}