{
    "symbol": "PCTY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-05 22:59:01",
    "content": " Our sales team continued its strong execution in the fourth quarter with total revenue growth of 36.7%, marking our fourth straight quarter with more than 30% revenue growth as our differentiated value proposition of providing the most modern software in the industry continues to resonate in the marketplace. Average recurring revenue per client was over $25,000 in fiscal 2022, compared to just under $22,000 in fiscal 2021, an increase of 16% as a result of increased employees on the platform and rising product attach rate across our client base. Building off this strong momentum, weâ\u0080\u0099ve expanded our sales force for fiscal 2023 by adding new sales reps, while at the same time, investing in training initiatives and marketing and channel programs to drive productivity, which saw steady improvement throughout the course of the year and now sits ahead of pre-pandemic productivity levels. For fiscal 2022, adjusted EBITDA was $237.8 million or 27.9% margin, resulting in leverage of 120 basis points versus fiscal 2021, despite the roughly 50 basis points of dilutive impact from the Blue Marble and Cloudsnap acquisitions. On a full year basis, we are estimating the average daily balance will be $2.4 billion with an average yield of approximately 100 basis points to 125 basis points or approximately $24 million to $30 million of interest income in fiscal 2023. For the first quarter of fiscal 2023, total revenue is expected to be in the range of $237.3 million to $241.3 million or approximately 31% to 33% growth over first quarter fiscal 2022 total revenue. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So if you can get that kind of months onboard a little bit earlier, that can be a driver. So if you can get that kind of months onboard a little bit earlier, that can be a driver. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}