{
    "symbol": "NDRA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 19:31:02",
    "content": " All statements by management other than statements of historical facts, including statements regarding the company's strategies, financial condition, operations, costs, plans, and objectives, as well as anticipated results of development and commercialization efforts, the timing of clinical studies, potential partnership opportunities, and expectations regarding regulatory processes, receipt of required regulatory clearances, and product launches are forward-looking statements. In parallel to our clinical data progress, we're maintaining a steady cadence of marketing activities, including participating in 11 clinical conferences in Europe and the U.S. last year, where we showed our TAEUS system to hundreds of potential customers. As we mentioned on the last call, several ENDRA patents focus on novel cloud-enabled connectivity of medical devices including ENDRAâ\u0080\u0099s TAEUS system, and we're actively pursuing potential licensing opportunities of this technology to help other companies collect data from their equipment, such as laboratory equipment which may not have an internet connection. While some of our clinical study site users were able to obtain clinical TAEUS measurements with high repeatability and good reproducibility that is commensurate with the system's capabilities, other users had significantly higher variability. With the aim of normalizing operator performance across users and clinical sites, we updated the instructions for use and added interactive graphical user feedback that guides the user in positioning the TAEUS probe to enable the operator to obtain measurements more reliably and with higher repeatability. So correct, we deployed the system to our clinical sites in Europe and North America last year, we collected over 100 scans and noticed that some users were able to achieve the high performance that the system is capable of and others were struggling a little bit more."
}