{
    "symbol": "FSS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:41:43",
    "content": " Consolidated net sales for the quarter were $346 million, up $48 million or 16% compared to last year despite a $3 million unfavorable foreign currency translation impact. Consolidated operating income for the quarter was $39.5 million, up $5.2 million or 15% compared to last year. Consolidated adjusted EBITDA for the quarter was $53.5 million, up $6.1 million or 13% compared to last year. Net income for the quarter was $31.8 million, up $2.6 million or 9% from last year. On an adjusted basis, EPS for the quarter was $0.53 per share, an improvement of $0.05 per share or 10% compared to last year. Order intake for the quarter was again strong with orders of $382 million, representing an increase of $32 million or 9% compared to Q3 last year. In terms of our group results, ESG's net sales for the quarter were $285 million, an increase of $36 million or 14% compared to last year. ESG's operating income for the quarter was $33.9 million, up $3.1 million or 10% compared to last year. ESG's adjusted EBITDA for the quarter was $46.5 million, up $3.8 million or 9% compared to last year. ESG reported total orders of $321 million in Q3 this year, an improvement of $29 million or 10% compared to last year. SSG's net sales for the quarter were $62 million, up $12 million or 25% compared to last year. SSG's operating income for the quarter was $10.5 million, up $2.9 million or 38% from last year. SSG's adjusted EBITDA for the quarter was $11.5 million, up $3 million or 35% from last year. SSG's orders for the quarter were $61 million, up $2 million or 4% compared to last year. Tax expense for the quarter was $4.9 million compared to $4.3 million last year, with the increase primarily due to the recognition of fewer discrete tax benefits in the current year quarter compared to the prior year. The new credit facility provides greater financial flexibility to invest in internal growth initiatives and pursue additional strategic acquisitions like TowHaul Corporation, which we acquired shortly after the end of the quarter for an initial payment of $43 million. With benefits from pricing actions, strong aftermarket demand and contributions from recent acquisitions, our businesses were able to deliver double-digit year-over-year net sales and earnings growth, gross margin improvement, and an EBITDA margin towards the high end of our target range despite supply chain disruption, which impacted production and shipments at certain facilities within our Environmental Solutions Group early in the quarter. In fact, so far this year, our U.S. municipal orders for street sweepers are up around $40 million or 40% over last year, while sewer cleaning orders are up $25 million or 22% over the same period. Last year, TowHaul generated revenues of approximately $23 million, we expect that TowHaul will be able to perform within ESG's target EBITDA margin range and will be accretive to earnings in 2023. We are already starting to see the benefits from the economic stimulus packages, which started to be made available to municipalities earlier this year, and we also expect the infrastructure bill with $550 billion in new spending, we could see capital equipment demand increase to support infrastructure investments in areas such as roads, bridges, electrification, broadband, clean energy and water and public transportation buildup."
}