{
    "symbol": "FSS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 11:26:04",
    "content": " Consolidated net sales for the quarter were $330 million, up $51 million or 18% compared to last year. Consolidated operating income for the quarter was $28.5 million, up $700,000 or 3% compared to last year. Consolidated adjusted EBITDA for the quarter was $42.2 million, up $1 million or 2% compared to last year. In total, orders in Q1 this year were $453 million, an increase of $69 million or 18%, compared to Q1 last year. Backlog at the end of the quarter was $751 million, another all-time high for the company and an increase of $342 million or 83%, compared to Q1 last year. In terms of our group results, ESG's net sales for the quarter were $274 million, up $46 million or 20% compared to last year. ESG's operating income for the quarter was $26.8 million, compared to $27.1 million last year. ESG reported total orders of $388 million in Q1 this year, an improvement of $63 million or 20% compared to last year. SSG's net sales for the quarter were $56 million, up $5 million or 10% from last year. SSG's operating income for the quarter was $7.9 million, up $700,000 or 10% compared to last year. SSG's orders for the quarter, was $65 million, up $5 million or 9% compared to last year. Corporate operating expenses for the quarter were $6.2 million, down $300,000 or 5% compared to last year. Turning now to the consolidated income statement, where the increase in sales contributed to a $6.9 million improvement in gross profit, including the effects of production inefficiencies, that we encountered in the early part of the year, consolidated gross margin for the quarter was 22.9%, compared to 24.7% last year. Overall, aftermarket revenues for the quarter were up 20% compared to last year, representing approximately $12 million of ESG's year-over-year revenue growth. The first $170 billion tranche started to be distributed last year, and we are seeing that translate to new business with our first quarter orders for sewer cleaners and street sweepers, both up by more than 40% compared to last year. With our first quarter performance, our record backlog and current expectations of component availability, we are raising the low-end of our full year adjusted EPS outlook range by $0.04, establishing a new range of $1.80 to $2. So you can almost use it as a multipurpose vehicle -- so if you look at that as well, those sewer cleaner orders in the quarter, they were up 43%, which is about $20 million of year-over-year improvement."
}