{
    "symbol": "FSS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 15:21:03",
    "content": " Net sales for the year were approximately $1.43 billion, a record high for the company and an increase of $222 million or 18% compared to last year. Operating income for the year was $160.8 million, an increase of $30.1 million or 23% from last year. Adjusted EBITDA for the year was $215 million, up $34.5 million or 19% compared to last year. On an adjusted basis, we reported full year earnings of $1.96 per share, up $0.21 per share or 12% from last year. Orders for the year were $1.69 billion, another company record and an increase of $153 million or 10% from last year. With the strong momentum in customer demand, consolidated backlog at the end of the year was at an all-time high level of $879 million, an increase of $250 million or 40% from last year. Consolidated net sales for the quarter were $392 million, an increase of $90 million or 30% compared to last year. Consolidated operating income in Q4 this year was $46.6 million, up $16.5 million or 55% compared to last year. Consolidated adjusted EBITDA for the quarter was $61.1 million, up $21.1 million or 53% compared to last year. GAAP EPS for the quarter was $0.57 per share, up $0.25 per share or 78% from last year. On an adjusted basis, EPS for Q4 this year was $0.57 per share, an improvement of $0.17 per share or 43% compared to last year. In terms of our fourth quarter group results, ESG sales were $325 million, an increase of $80 million or 33% compared to last year. ESG's adjusted EBITDA for the quarter was $57.6 million, up $21.4 million or 59% compared to last year. SSG sales in Q4 this year were $66 million, up $10 million or 18% compared to Q4 last year. SSG's adjusted EBITDA for the quarter was $13.2 million, up $2.2 million or 20% from last year. SSG's adjusted EBITDA margin for the quarter was 19.9%, up 20 basis points from Q4 last year. Corporate operating expenses in Q4 this year were $10.2 million compared to $4.1 million in Q4 last year, which included a non-recurring $3.5 million benefit from the reduction in the fair value of contingent consideration associated with acquisition. During the fourth quarter of this year, we recognized $500,000 of expense from acquisition and integration-related activity compared to a $3 million benefit in Q4 last year, with the majority of the year-over-year change driven by the prior year contingent consideration benefit I just referenced. Income tax expense for the quarter was $7.4 million compared to a $300,000 income tax benefit in the prior year, with the year-over-year change largely due to higher pre-tax income levels and a $1.9 million reduction in discrete tax benefits. Demand for our product offerings continues to be as strong as ever as demonstrated by our outstanding fourth quarter order intake of $444 million, contributing to another record backlog entering the year and reflecting strength across our end markets. In fact, in 2022, our municipal orders for street sweepers are up around $34 million or 22% over last year, while sewer cleaner orders are up $27 million or 15% over the prior year. The improvement has been almost across the board, but most notably for our TRUVAC safe digging trucks and our Guzzler industrial vacuum orders, which collectively were up $67 million or 62% year-over-year."
}