{
    "symbol": "FSS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 16:22:05",
    "content": " Consolidated net sales for the quarter were $367 million, up $32 million or 10% compared to last year. Consolidated operating income for the quarter was $46.2 million, up $7.7 million or 20% compared to last year. Consolidated adjusted EBITDA for the quarter was $58.2 million, up $6.3 million, or 12% compared to last year. GAAP EPS for the quarter was $0.55 per share, up 15% compared to last year. On an adjusted basis, EPS for the quarter was $0.53 per share up 6% compared to last year. Order intake for the quarter was again outstanding with orders of $413 million, representing an increase of $53 million, or 15% compared to Q2 last year. Backlog at the end of the quarter was $795 million, another all-time high for the company and an increase of $358 million or 82% compared to Q2 last year. In terms of our group results, ESG's net sales for the quarter were $306 million, an increase of $25 million, or 9% compared to last year. ESG's operating income for the quarter was $39.1 million up $600,000 or 2% compared to last year. ESG's adjusted EBITDA for the quarter was $51.6 million, up $1 million, or 2% compared to last year. ESG's orders for the quarter were $352 million, an improvement of $52 million, or 17% compared to last year. Turning now to SSG, who reported net sales of $60 million in Q2 this year, an improvement of $7 million, or 13% compared to last year. SSG's operating income for the quarter was $10.3 million, up $2.5 million, or 32% compared to last year. Corporate operating expenses for the quarter were $3.2 million, compared to $7.8 million in Q2 last year. During the quarter, we recorded a $1.7 million benefit from acquisition related activity, compared to $300,000 of expense last year with the majority of the year-over-year change driven by the receipt of the post closing adjustment I just referenced. Tax expense for the quarter was up $3.1 million, largely due to higher pre-tax income levels, and a $1.5 million reduction in excess tax benefits from stock compensation activity in comparison to Q2 last year. As a result, our effective tax rate for the quarter was 24.9% compared to 21.2% last year, representing a year-over-year EPS headwind of about $0.02. Looking now at cash flow, we generated $15 million of cash from operations during the quarter, representing an increase of 16% over Q2 last year despite incremental investments in chassis and other raw materials. On the industrial side, demand remains high, particularly for our safe digging products with orders in the first half up $26 million or 69% year-over-year. Although we expect the volatile supply chain environment to continue, we are encouraged with how our teams have navigated through these challenges so far this year, notwithstanding the EPS headwind in the second half of the year associated with higher interest expense, with our performance in the first half of the year, our record backlog and current expectations of component availability, we are raising the midpoint of our full-year adjusted EPS outlook by establishing a new range of $1.85 to $2 updated from the previous range of $1.80 to $2. For the quarter it was 50 or 60 in Q2 last year, so that's what we talked about the year-over-year impact, I think for the next certainly for the next several quarters, while we're in the current situation, I think what we're strategically trying to do is make sure that we can serve our customers, right, and if they're struggling to find chassis, and we have access to chassis, I think that's something we want to work with our customers to assist them in that regard."
}