{
    "symbol": "SMP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 14:11:02",
    "content": " You can see on this slide that Q4 net sales of $242.4 million were down slightly versus the same quarter last year, but this year up against a difficult comparison in Q4 '21, where sales were up almost 6%. For the full year, sales of engine of $975.2 million were up 4% with the increase driven primarily by sales from acquisitions made last year, higher pricing and continued strong demand. Looking at the margin for Engine, the fourth quarter gross margin rate was 28.5%, up 0.9  points from last year as a combination of our cost savings efforts and pricing actions taken in the second half of the year overcame some of the inflationary pressures we've been experiencing. Temperature Control net sales in Q4 2022 were up $3.1 million or 5.2% for the full year were up $33.9 million or 9.7%, with the increases mainly reflecting a very strong summer season and higher pricing, both of which helped the division to outpace a record year last year. Our consolidated net sales for the fourth quarter were essentially flat with last year, while full year sales were up 5.6%, reflecting the impact of sales from acquisitions, higher pricing and continued strong demand. And for the full year, our gross margin rate was down 1.1 points to 27.9%, largely as a result of the cost inflation I mentioned before, but we were pleased to report higher gross margin dollars on the back of strong sales growth. Moving to SG&A expenses  with respect to profitability, consolidated operating income, as shown here on the slide, was 7.9% of net sales for the quarter and 8.2% for the full year and earnings per share and EBITDA were lower for both the quarter and full year for the reasons already discussed. Accounts receivable of $167.6 million at the end of the quarter were down $13 million in December 2021, with the decline a result of the timing of sales at year-end as well as the write-off of a receivable related to a bankrupt customer as noted in our release this morning. Inventory levels finished Q4 at $528.7 million, up $60 million from December 2021, with the increase to result of higher sales levels this year, inflation and inventory costs and a strategic investment to buffer against supply chain volatility. As such, we expect adjusted EBITDA to be approximately 10% for the full year in 2023 as we continue to face an uncertain operating environment and costs from customer factoring programs that will hit $45 million to $50 million at current rates, but can still go higher depending on economic conditions and further rate hikes by the Federal Reserve. In connection with adjusted EBITDA, we expect depreciation and amortization expenses and our income tax rate to be in line with 2022 but expect our interest expense on outstanding debt to be about $4 million to $5 million each quarter, given higher rates in average borrowings versus last year. Regarding the cadence of earnings across the four quarters in 2020, we expect Q1 will be impacted by headwinds of several things, including the usual carryover of unfavorable manufacturing variances from lower Q4 production, as well as from the impact of lowering our inventories further in 2023, higher year-over-year costs from customer factoring programs and some temporary sales softness related to the bankruptcy of one of our customers. Well, we are providing it as one single corporate growth number and not looking to break it out into the different segments, partly because it's early in the year, and there's a lot of moving pieces, as mentioned in my prepared remarks and as you're alluding to, we believe that Engineered Solutions and long-term growth potential that can exceed that of the aftermarket simply because we're dealing with a business that is much more diverse globally, so a lot more end markets to find growth in, and we're starting with a relatively small base."
}