{
    "symbol": "SMP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 00:03:08",
    "content": " As we go through the numbers, I'll first give some color on sales and margins for each division, then look at the consolidated results, cover some key balance sheet and cash flow metrics and finally, provide an update on our financial outlook for the full year in 2022. You can see on the slide, that net sales there in Q2 were $241.9 million, up $8.7 million or 3.7% versus the same quarter last year with the increase a result of sales from acquisitions made last year and higher pricing. The second quarter gross margin rate for Engine Management was 25.8%, down from last year but remember, that last year's margin benefited from the impact of strong production, to rebuild inventory levels as the economy reopened. And for the first six months, we're up $26.8 million or 15.9% with the increase mainly reflecting a solid start to the season so far and higher pricing. Our gross margin rate for Temperature Control in the quarter was 26.7%, a decrease of 0.2 points from last year, while the gross margin rate for the first six months of 25.8% was down 0.6 points from last year. The slight decrease in margin for the quarter and first six months, was due to inflation in our costs and some higher freight expenses related to stocking higher levels of inventory to prepare for the summer season. Our consolidated net sales reflected the growth we saw in each division, with Q2 up 5.1% versus last year and the first six months up 10.3% versus last year. Our consolidated gross margin rate was down for the quarter, and first six months for the reasons noted before, but given our year-to-date growth in consolidated sales, we did report higher gross margin dollars for the first six months of the year, despite a lower rate. Our consolidated SG&A increased in the quarter and the first six months, as rapidly rising interest rates drove expenses from customer factoring programs higher and we had additional costs from acquisitions made last year. Our consolidated SG&A expenses increased by $6.8 million in the quarter, and included $4.7 million of higher factoring costs and $2.9 million of additional costs from acquisitions made last year. Excluding the factoring costs, for the first six months, our SG&A as a percentage of sales, would have been 18.5% and lower than last year. Looking at the bottom line, consolidated operating income as shown here on the slide, was 7.8% of net sales for the quarter and 8% for the first six months of the year, and earnings per share and EBITDA were lower than last year for both the quarter and first six months, for the reasons already discussed. Accounts receivable of $229.7 million, at the end of the quarter were up $49.1 million from December 2021, with the increase typical of the seasonal nature of the business and mainly a result of higher sales during the quarter. So, in the quarter, our factoring costs were up $4.7 million versus last year and for the first six months, they were up $5.5 million versus last year."
}