{
    "symbol": "SMP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:20:38",
    "content": " Third quarter gross margin rate was 26.2%, down 0.9 points from last year mainly due to inflation in our costs, but also due to lower production volumes as inventory levels moderate. Engine's gross margin for the first nine months was 26.5% and was down from last year, mainly as a result of higher material and labor costs from persistent inflation not experienced to the same degree during the first nine months of 2021 and increased transportation expenses resulting from stocking higher levels of inventory. And for the first nine months, were up $30.7 million or 10.7% with the increases mainly reflecting a very strong summer season and higher pricing, both of which helped the division to outpace a record year last year. The increase in margin for the quarter was mainly due to another record sales year, while the slight decrease for the first nine months was due to cost inflation and some higher transportation expenses related to stocking higher levels of inventory. Inventory levels finished Q3 at $534.3 million, up $65.6 million from December 2021, with the increase of result of higher sales levels this year and a strategic investment in inventory, to both make sure we meet our customers' delivery expectations and to buffer against supply chain volatility. I think you asked Daniel about implications to -- I guess, in the market to our customers' customer, and really, what we see -- what we have seen is that our products are largely not price sensitive due to their nature, in that, they are nondiscretionary and professionally installed, which typically means that the car owner, whose vehicle needs to be repaired, they -- I don't want to say that they basically have no choice and typically didn't appreciate what the cost is going to be anyway because it's a nonrecurring type of expense for them. I think with regard to factoring, in particular, we talked about this on the last quarter's call, I think the way to think about it is with sales that are factored roughly $800 million, each 1% moving interest rates, obviously, is about $8 million."
}