{
    "symbol": "SMP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 15:18:14",
    "content": " As Eric noted earlier, we had a very good first quarter of the year, as sales were higher than last year and margin and operating profits were in line with the expectations we laid out at the beginning of the year. You can see on the slides that net sales there in Q1 were $239.3 million, up $27.2 million or 12.8% versus the same quarter last year. And while we did pass on higher prices to customers during the quarter, we expect to take more pricing actions throughout the year to offset the persistent inflation we're seeing in materials and supply chain costs. Temperature Control net sales in Q1, 2022 were up $18.8 million or 30.2% with the increase mainly reflecting a fast start of pre-season ordering by our customers, but also business wins and higher pricing. Inventory levels finished Q1 at $534.4 million, up $65.7 million from December 2021, with the increased result of higher sales levels this year, and a strategic investment in inventory to both make sure we meet our customers’ delivery expectations and a buffer against supply chain volatility. Turning to cash flows, our cash flow statement reflects cash use in operations in the first quarter of $104 million as compared to $11.4 million last year with more cash used for accounts receivable stemming from management of our supply chain financing programs and more cash used for inventory for the reasons noted before. Regarding capital expenditures, we continue to invest in our business and used $6.4 million of cash for CapEx during the quarter up from $5 million used last year. While our sales were higher in Q1 than last year, $25 million of increase was expected from acquisitions made last year, and much of the remaining increase came from our Temp Control business, where we have to keep a few things in mind. Lastly, while we expect to continue to see very good leverage of operating expenses, remember, we incur these expenses evenly throughout the year at a rate of about $64 million to $68 million each quarter, even though sales and profits are earned in a more seasonal pattern."
}