{
    "symbol": "DEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 16:12:02",
    "content": " Our long lived CO2 EOR focused oil business is providing an ever greater proportion of carbon negative blue oil, and our multiyear path toward development of the massive Cedar Creek Anticline EOR resource will reach a key milestone with first EOR production this year, beginning the first of many decades of significant production of carbon negative, high-margin oil from this great asset. In 2022, we made investments in multiple attractive oil focused development projects and progressed our crown jewel CCA EOR project, which we expect to drive company production growth beginning this year as that flood ramps up, delivering 100% blue oil. Based on our current 2023 projections, assuming a $75 per barrel oil price, expected cash flows are relatively balanced with our planned investments, which include a $510 million capital budget, $36 million of P&A activity and $17 million in CCUS equity investments. As we laid out in our CCUS Business Outlook Event last year, we expect CCUS capital will continue to increase over the next several years, as we build out what we believe will be the industry's leading CO2 transportation and sequestration network. For 2023, at an average oil price of $75 per barrel, we expect our hedges will benefit our cash flow by roughly $15 million, a nice change from last year. As expected, fourth quarter oil and gas capital expenditures were our highest for the year at $121 million with the CCA EOR development representing more than 40% of our development capital spend in the quarter. While the exact timing of the production ramp will be calibrated by actual performance data as the flood progresses, our latest estimates have us around 750 BOE per day incremental EOR production response for the year, exiting the year near 2,000 BOE per day and reaching our expected 7,500 to 12,500 BOE per day range by late 2024. The breakdown of the capital this year, where we're looking at the $150 million of CapEx on CCUS is mostly focused on storage sites, and I'll say mostly focused on the acquisition of storage sites."
}