{
    "symbol": "DEN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 17:06:04",
    "content": " I would now like to turn the conference over to your host for today's call, Brad Whitmarsh, Head of Investor Relations. Good morning, everyone and thank you for joining us today. We're certainly very excited to announce not only strong first quarter results, but also a significant new CCUS transport and storage agreement, as well as an authorized share repurchase program. You can read our full disclosures on forward-looking statements and the Risk Factors associated with our business in the slides accompanying today's presentation, our most recent SEC filings and today's news release. Also, please note that during the course of today's call, we may reference certain non-GAAP measures. This morning, our brief prepared comments will come from Chris Kendall, President and CEO; Mark Allen, CFO; David Sheppard, SVP of Operations; Nik Wood, SVP of Carbon Solutions; and Matt Dahan, SVP of Business Development and Technology are all here to participate in the Q&A. Good morning, everyone and thank you for joining us on today's call. Further, increased energy costs are adding to already high levels of inflation, and supply chains and services continue to be challenged with rising demand. While we are all experiencing the effects of supply chain breakdowns in our daily lives, our team, careful planning and diligence, have thus far mitigated any significant impacts on Denbury’s business, keeping us firmly on track with our key development projects. This morning, I'll focus on four primary topics; highlights from our first quarter results, as well as updates to our annual guidance; the $250 million share repurchase program we announced this morning; continued progress on our capital developments, as well as increasing momentum in our carbon solutions business. Denbury delivered robust financial and operating results in the first quarter, enhanced by our high leverage to oil prices. Operating cash flow before working capital changes totaled to $131 million for the quarter, resulting in free cash flow of $51 million, sales volumes, differentials and operating costs, were all in line with our expectations and guidance, and we exited the quarter with only $35 million in debt. Also, we concluded an amendment to our bank credit facility that increased the borrowing base by 30% to $750 million, while extending the facility's maturity and relaxing various restrictive covenants. Looking forward, we are maintaining our full year guidance ranges across sales volumes, capital and expenses. However, with the increased outlook for commodity prices and recent inflationary pressures, we anticipate that some of our cost items will trend toward the upper half to upper end of those ranges. Also, we have updated our income tax expense outlook for the current oil price environment, which reflects a higher anticipated tax rate and some cash taxes in 2022. Regarding production, we anticipate that second quarter volumes will be slightly lower than the first quarter due to recent downtime for unplanned maintenance and late winter storms that occurred early in the second quarter. As oil prices have continued to strengthen, we've added to our hedge positions for 2023, primarily with collars that provide floor protection around $70 or higher, while also providing exposure to significantly higher oil prices. With an enhanced cash flow outlook, our board recently authorized a $250 million share repurchase program. As we've emphasized in the past, while maintaining a strong balance sheet, our capital allocation priorities are; first, to fund our production business at a sustaining to moderate growth level; second, to fund expected CCUS investments; and third, to return capital to our shareholders when generating sufficient free cash to do so. Based on our success to date and our view toward expanding our CCUS business, we anticipate meaningful capital needs in the future. However, at current commodity prices, we expect to have the ability to meet all of those needs, as well as to fund the share repurchase program. Phase 1 CO2 injection commenced on February 1st, and as of today, we have 55 Wells on injection with a total rate of over 115 million cubic fee per day or over 2 million tons of industrial sourced CO2 on an annual basis. This extraordinary asset is the largest EOR development we have undertaken with a total recoverable EOR potential of over $400 million barrels, more than twice our current proved reserves. Based on our exclusive use of industrial sourced CO2, all produced barrels will be carbon negative blue oil and should be some of our highest margin production. Financially, it drives strong cash flows that allow us to organically fund our CCUS investments and new investment opportunities in the energy transition space. Technically, the pipeline, project management, wells, and subsurface skill sets that we have developed in our 20 plus years of EOR operations are the exact same skill sets needed for highly reliable CO2 transportation and sequestration. And operationally, EOR is still the only form of CCUS available at scale in the US today, providing offtake certainty for industrial customers to move forward with capture projects. As I mentioned in our 2022 outlook call, this year will be transformational for Denbury CCUS business. Our carbon solutions team continues to make great progress, both in building out our sequestration capacity through new four space agreements, as well as reaching agreements with industrial partners for the transportation and storage of their CO2 emissions. This morning, we announced the execution of a new term sheet for another significant transportation and storage agreement in the Gulf Coast, representing an incremental 2 million tons of captured CO2 per year. This is a planned chemicals facility, intended to be constructed in close proximity to our existing CO2 pipeline infrastructure. With this agreement, we have now reached an industry-leading 7 million metric tons per year of CO2 for new transportation and storage services. And based on what I see today, in terms of what we are working on, I believe we are on-track this year to substantially exceed our cumulative annual target of getting to 10 million tons per year. While the agreements we have reached to-date have been for CO2 transportation and storage, we are offering industrial customers a full suite of service options, ranging from transportation and storage to transportation only, and even providing a full package that includes the implant capture process as well. The team is highly focused on the development of our contracted sequestration sites, and is engaging with the various EPA regions in support of our Class VI permitting process. In addition, we are continuing to build out storage capacity further, and I expect that we will complete several more sequestration site agreements in the coming months. Our production business is generating strong cash flow and we are developing an incredible EOR resource with our CCA project that will drive volume growth beginning late in 2023 and into 2024, becoming the foundation of our production for future decades. Concurrently, our CCUS business is making important progress, the details of which we plan to further layout as we go through the year. Denbury has an incredible and energizing opportunity in front of us, not just to redefine the future of our company but to also provide the energy our world needs, while reducing carbon emissions in a meaningful way. My first question just concerns Slide Number 12 and there is comment, a footnote on there and it indicates that you are considering a 2 to 3 times expansion in the Green Pipeline. And I think this opens the door to several questions, and I apologize because this is tiered, but I'm just trying to understand. And so looking at that expansion of the Green Pipeline, and that's honestly something that we have been planning for some time. And so it's certainly not contracted today, as you can see from just our progress towards the goals that we have right now. And primarily, we can start with the line itself and adding pump stations at various locations to enhance the capacity and line loops within an existing right of way as per your question, we can do an awful lot of expansion just with that. Remember we have about 16 million tons of capacity in the line right now, which is only being used at about a quarter of capacity. It seems like this could be a tier development where the storage sites that are closer to the pipeline get developed first, and then New Orleans and will be Alabama later. And I don't really -- I don't quite think of it as tiered development, Clay. I mean, if you were to look into Nik's team right now, you'd see that they're steadily churning on the permitting process for every single site that we have. And like I mentioned just a minute ago, we're going to be adding more sites as we go building this over the coming years. But certainly, our view is towards matching with the projects that we are aware of that are either being executed or are in plans right now to have those sites available when that time comes. And certainly, I would think that as we ramp this up, we want to do quite a bit of work next year. So I expect capital to meaningfully increase in 2023 as we build these sites out, along with the pipeline laterals that connect to the sites as well as to the emitters. And along the way, one thing that we're thinking about, Clay, is just we want to make sure going back to the efficiency of this system that not only do we have one site that's ideal for any particular emitter, but that we have redundancy in the system and that we can bring emissions to various locations across the system. That's part of the beauty of the system, the way that we think about it. I mean, you know, honestly when I just look back at what Denbury does, for 21, 22 years now, we have been primarily focused on enhanced oil recovery using carbon dioxide. So if you were to look inside the company, Clay, you'd see a suite of technical and operational professionals who have handled all things CO2 for 20 plus years. We have the longest operated CO2 pipeline network in the United States, split between the Gulf Coast region that you mentioned earlier, as well as in our Rockies region. So a great head start on infrastructure as well that I think really sets a backbone in place that allows us to access storage sites, that allows us to be close to emissions sites as well. And really at the end of the day, creates the most economic solution for industrial emitters to bring their emissions into the system and capture, put them underground permanently. And so, when I look at it and so I think okay, $250 million authorization, it's a great arrow to have an quiver. But it doesn't necessarily mean that you're going to -- it's good to have that option, but having the option is different from committing to doing it. So what I want to ask is, how are you, the management and the board, thinking about the relative attractiveness of spending free cash, buying back your shares versus frankly to the point you've already been making on this call really -- seems like a really rich and deep opportunity set in front of you, not just on the CCUS side but even on the tertiary side. But like you, we see this abundance of opportunities within our EOR business, within the CCUS business, and we're focused on executing on all of those. We honestly just have the luxury with where prices are today to have cash flow on top of all of that, being able to do everything that we want to do and look at this buyback. And then honestly, when we look at where the share price is today compared to what we see as the value of this company and particularly, the potential ahead of us with CCUS that we are making gains on every single day, it just doesn't look like it's in the right place. Charles, as Chris said, we are obviously not pleased with the share price performance through the first part of this year. And so as we think about this and look at the free cash flow generation that we see, we want to be thoughtful about this. So you guys, with this South Louisiana new build project, you are at 7 million tons per annum you have signed up and you said you, you want to be at 10 and you have multiple ways to get there. So to point out that we have continued on the progress that we have and we continue to see a pathway to continue to gain more emissions on the same type of suite of services, we provided previously is accurate. We continue to see new ways of servicing different emitters and different industrial partners, one of which is adding additional capture services to our suite of services. The way I think about Charles is just every one of our industrial customers has different needs and preferences, and what we are trying to do is just make sure that what we can provide meets that. Continuing with the same discussion just previously with Charles, related to Den and Bury potentially expand -- or looking at expanding the suite of services. And of course, handling 70 million tons of CO2 a year in our EOR operations, and I think compressing pretty much all of that, we just have a great depth of experience in compression, dehydration as well. And Chris, if you could provide any more details on how you're thinking about this or the team is thinking about it. And so I don't think it's primarily one end or the other, Richard. What I'd say is, as we go further upstream, we would very likely look at partnerships with other entities that deal in some of that upstream work in a more day-to-day fashion than we do, for example, if it's beyond the compression and dehydration, I'd say. But end of the day, what we'd look at in any case here is making sure that we're driving a good return on capital for our investors, while also providing the best solution for the industrial customer. Pipeline conversions, we've been hearing from some industry participants’ discussions plans to possibly convert natural gas pipelines to CO2 transporters. We talked about it a bit in the past, and just the nature of the operating pressure of moving CO2 in dense phase. For us, it's typically an anti 900 service, which has a maximum pressure above 2,000 PSI. And the conversions that we've seen have been with typically natural gas service that's around 1,400 or 1,500 PSI, which is harder to transport in dense phase. It's just it presents some, for us in our view at least, Richard, it presents some operational limitations and some costs of compression and needing to be sure that you can get to a pressure you can inject underground at the other end that works better for us. It is just something -- it really on a case by case basis how it works, we strongly prefer going with the system that we've talked about. So when I think about the Class VI permitting timeline and where we're at, the permitting process is a continuous permitting process and that we have continuous interaction with the EPA. As we get to a point where we are at a construction permitting process, we will get a construction permit from the EPA for Class VI construction. Just on your question on primacy, that's one. We have great confidence in EPA just along with what Nick said, that we're going to continue to work that. But at least right now, I wouldn't say it's moving -- it should be closed but it seems to be moving a little bit slower than we expected. Mike, I think it's more of the latter. For us the legislation that we think is interesting is just ultimately, I think it's inevitable that the tax credits, the 45Q tax credit will increase. It's just that today where the tax credit is, we already see a great business. And when it does, it's just that great business just becomes that much better. Just considering the current political environment, I know that there is some forces at work to push that forward, we will just have to see how it works out here. And we just continue working through the portfolio, should get the bulk of them done within the next year, certainly well ahead of any new emissions coming in that's going to require it."
}