{
    "symbol": "SWAV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 22:53:02",
    "content": " Our team has remained focused, which has enabled us to sustain our high level of performance as evidenced by our first quarter revenues of $93.6 million, a 194% increase from the first quarter of 2021. ShockWave Medical's revenue for the first quarter ended March 31, 2022 was $93.6 million, 194% increase from $31.9 million in the first quarter of 2021. The increase included $51.3 million from the coronary product Shockwave C2, which is launched in the U.S. in February of 2021. International revenue was $15.1 million in the first quarter of 2022, representing a 39% increase from $10.9 million in the first quarter of 2021. Looking at product lines, our peripheral products Shockwave M5, Shockwave M5+ and Shockwave S4 accounted for $22.9 million of the total revenue in the first quarter of 2022, compared to $16.1 million in the first quarter of 2021, a 42% increase. Our coronary product Shockwave C2 accounted for $70.3 million in total revenue in the first quarter of 2022, compared to $$15.3 million in the first quota of 2021, representing that 359% increase. So that's a, and I think the key for us Bill is, is we're getting great reorders from our last customers and we've still got a chunk, a decent chunk of accounts that we plan on launching throughout this year to drive kind of new customer growth. So some of the areas that that you view, there aren't as obvious to the outside world were sort of our, which are critical backbones to the company to support this – support the sales – and the sales efforts those might not be quite as leveraged right now, but as the – as sales ramp through this year you'll see sort of top line far outpacing some of that that G&A expansion and Dan, I don’t know if I probably said before you were going to say, sorry. It's nice to have reimbursement out of the gate, but just in terms of account coverage there with the sales team, we do not have nearly the team on-the ground that we had in the U.S. And we were in hundreds and hundreds and hundreds of PCI accounts already with our peripheral business in the U.S. And lastly, just on China, I don't think I heard any update on this call, on the last call I think you said you expect approval by the end of this year. And while we feel fortunate that we're able to both invest heavily and drive profitability, we still – even though today's tape, doesn't suggest that growth is very popular, we still think growth is long-term going to be what rewards our customers, because it's going to mean we've brought them better solutions and it'll reward our shareholders. If I can ask one more, just on the a fine point on coronary center activation in the U.S., I'm trying to track that quarter-to-quarter here as you ramp towards close to full market penetration in the U.S. Is it fair to say that new accounts activated in the first quarter, given the lingering Omicron challenges were de minimis and that the focus for the rest of the year will be bringing on board that one quarter of accounts that you haven't opened yet?"
}