{
    "symbol": "KNOP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-25 16:01:02",
    "content": " Continue to focus on safety, maintain high scheduled operational utilization in line with our historic track record, ensure the remaining dry docks in 2022 are successfully closed out, keep close dialog with our customers to ensure we can respond as opportunities arise, work hard to secure employment for our vessels that remain open in 2022 and 2023 with particular emphasis on the North Sea and we think by targeting these things we will be keeping the best long-term interest for the Partnership unitholders to the fall. So in summary for this quarter on slide 12, we have strong utilization at 100% for scheduled operations, we generated distributable cash flow of $9.4 million following the several dry docks in the quarter, we paid a quarterly distribution of $0.52 for the 28th consecutive quarter, we had $487 million of remaining contracted forward revenue, excluding options at the end of the quarter and no refinancing due until the third quarter of 2023. Please go ahead, your line is now open. Please go ahead, your line is now open. I think in terms of balancing the future, we've obviously, as you said, had a very high concentration of drydocks which we prepared for and was foreseeable, and we -- we tried to take a long-term view balancing all of the things we -- I think it's quite clear that we're fairly conservative and we try to be a very stable business, taking a long-term view and trying to spot the differences and see the differences between something that is a temporary divergence versus something that is slightly more fundamental in nature. Please go ahead, your line is now open. So I think it's -- I think we have definitely seen a situation where we haven't been able to achieve the highest rates in all circumstances, but certainly we are in a tight market still, even though there is softness here, we're only talking about a few vessels out of 79, and we believe that's for a temporary period and I think some of the activity that we're seeing in Brazil, for example now, is a result of some of our customers realizing that if they don't kind of get to move on they may be left behind in terms of available tonnage. If we would start as a company selling put options on the price of the stock, say at $16 a share, $15 a share wherever they are available, out two, three months and thereby use the existing cash we have as a back up to the purchase price of the shares if the  shows confidence of the management in the nature of the business and what the future should hold for the business, and at the same time would give us a small amount of positive cash flow."
}