{
    "symbol": "FSTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 11:46:03",
    "content": " As previously mentioned, net sales for the quarter included a $4 million adverse impact associated with the Crossrail settlement. Adjusted EBITDA in Q3 increased $4.9 million to $9.3 million, a 111% increase year-over-year. Operating cash flow was a usage of $5.5 million in Q3, due primarily to higher working capital levels needed to deliver the robust organic sales and quarter end backlog, which increased 9.1% from the second quarter. The Bridge on the left shows the overall change in sales, which reflects the strong organic growth of $15.3 million or 11.8% during the quarter. Adjusted EBITDA for the current year third quarter removes the impact of the Crossrail settlement, acquisition and divestiture related costs, the purchase accounting adjustment and contingent consideration expense related to VanHooseCo and the loss on the Track Components divestiture. Third quarter rail segment revenue increased $3.4 million year-over-year, driven by 11.8% organic growth, partially offset by a 1.9% reduction associated with acquisition and divestiture activity and a 5.3% reduction associated with the Crossrail settlement. As reflected on Slide 12 Precast Concrete Products segment revenue increased $10.9 million or 60.6% year-over-year, organic sales increased 25.2% and the VanHooseCo acquisition contributed 35.4% year-over-year. The rail segment declined $6.1 million or 2.7%, driven by the track components divestiture accounting for $2.4 million of the decline, as well as the Crossrail settlement. The precast segment realized a $16.8 million increase, or 33% driven by $6.4 million from the VanHooseCo acquisition and strong sales in the Southern U.S. region. Precast gross profit increased by $2.3 million, including gross profit of $1.3 million from the VanHooseCo acquisition, which included the $900,000 inventory purchase accounting expense. Selling and administrative expenses for the year-to-date period increased $1.5 million or 2.5%, including $2 million associated with the company's current year transformation activities. Adjusted EBITDA year-to-date, which is adjusted for the impact of the Crossrail settlement, acquisition and divestiture related items and non-routine insurance proceeds was $16.7 million, a 7.8% increase compared to the prior year period. As expected, our net debt increased during the third quarter to $94 million, with the closing of the $52 million VanHooseCo acquisition. Also, in the third quarter, we generated approximately $7.8 million in cash from the track components divestiture, and we finally received the $5.6 million federal income tax refund. We continued to see strong order intake in our precast concrete business with Q3 orders totaling $31 million, up approximately 31% versus last year, driven by the VanHooseCo acquisition, which added $7.1 million in orders since we took ownership. One moment for our next question, please. One moment for our next question, please."
}