{
    "symbol": "FSTR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 13:30:05",
    "content": " Our portfolio transformation and margin improvement initiatives delivered a strong 260 basis point improvement in gross margins, and a $7.5 million in adjusted EBITDA, which was 5.5% of the net sales and up nearly 133% over last year. Fourth quarter sales were $137.2 million, an increase of $24.2 million over Q4 last year, driven by strong organic growth and the accretive strategic transformation actions taken in 2022. Adjusted EBITDA in Q4 increased $4.3 million to $7.5 million, a 132.6% increase year-over-year. Fourth quarter backlog increased $62.1 million year-over-year due to a 22.9% organic increase and 7.4% increase from acquisitions, partially offset by a nominal decline from divestitures. The chart on the left shows the improvement in sales, which reflects the notable $14.6 million organic growth in the legacy business during the quarter, representing a 12.9% increase year-over-year. Our legacy business delivered a $1.1 million increase in adjusted EBITDA, representing 7.5% leverage on the incremental sales achieved in the quarter. The impact of the portfolio transformation is even more significant with a $3.2 million increase in adjusted EBITDA achieved on the net $9.6 million sales growth from M&A related activities, representing approximately 33% leverage on the net M&A related sales growth. The combined result is a meaningful increase to our overall profitability with $7.5 million in adjusted EBITDA, representing a 5.5% of net sales and nearly double the EBITDA margin reported in Q4 last year, and up 233% on an absolute dollar basis. Fourth quarter Rail segment revenue increased $6.9 million year-over-year driven by a 10.2% organic growth, partially offset by a nominal reduction associated with acquisition and divestiture activity. New orders in Q4 were up nearly 26% year-over-year and backlog was up 9% versus last year, with broad strength in demand across the portfolio  Turning to Precast Concrete on Slide 11, revenue increased $16.5 million, representing an 81.3% improvement year-over-year. Selling and administrative expenses for 2022 increased $6.7 million or 8.8%, representing 16.6% of sales for the full year, up from 14.8% in 2021. We expect 2023 sales to range between $540 million and $570 million, with a range representing year-over-year growth of 8.5% and 14.6% respectively."
}