{
    "symbol": "FSTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 23:13:04",
    "content": " Gross profit margins improved by 80 basis points on a reported basis due to the favorable mix as a result of the divestiture of the less profitable Piling business offset in part by higher raw material and labor costs, coupled with unfavorable building sales mix in our Precast Concrete segment. I would highlight that the 17.7% reported gross profit margin in Q2 was an increase of 110 basis points compared to 16.6% in Q1 of 2022 with the improvement resulting from increased volume and improved price realization, partially offset by unfavorable building sales mix in Precast Concrete. Adjusted EBITDA in Q2 declined $2.2 million to $6.1 million, with $1.1 million due to the Piling divestiture and the balance due to lower gross profit and slightly higher SG&A costs in the remaining business, largely related to our transformation initiatives. As mentioned earlier, second quarter orders adjusted for the Piling divestiture totaled $141.4 million, up 24.7% versus last year and backlog finished at a robust $250.8 million. Second quarter Rail segment revenue decreased $7 million year-over-year, largely driven by lower volumes and timing of orders in the Rail Products business unit. Despite the lower sales, gross margins increased 30 basis points year-over-year due to the higher volume and the more profitable Friction Management business unit, coupled with improved margins within Technology, Services and Solutions. However, gross margins were down 530 basis points year-over-year due primarily to higher raw material and labor costs coupled with an unfavorable building sales mix compared to last year's quarter. Sequentially, Q2 margin dollars increased approximately $1 million on improved volumes but the margin percent was down 210 basis points due primarily to unfavorable building sales mix. Sequentially, Q2 margins were up 900 basis points reflecting the increased fixed cost absorption due to the higher volumes as well as favorable business sales mix. Sales in the Rail business declined $9.5 million or 6.1% due to the timing of customer shipments, primarily in our Rail Products business unit. Adjusted for Piling, year-to-date gross margins were down 100 basis points due to the higher input costs, primarily in our Precast and Steel Products and Measurement segments. Lastly, we've generated approximately $11.9 million in cash after the end of the second quarter from the track components divestiture as well as receipt of a portion of our federal income tax refund, which also improves our leverage ratio."
}