{
    "symbol": "PPG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-22 12:08:02",
    "content": " At this time, I would like to welcome everyone to the First Quarter PPG Earnings Conference Call. Joining me on the call from PPG are Michael McGarry, Chairman and Chief Executive Officer; Tim Knavish, Chief Operating Officer; and Vince Morales, Senior Vice President and Chief Financial Officer. Our comments relate to the financial information released after U.S. equity markets closed on Thursday, April 21, 2022. Following management’s perspective on the company’s results for the quarter, we will move to a Q&A session. The company has provided in the appendix of the presentation materials, which are available on our website, reconciliations of these non-GAAP financial measures to the most directly comparable GAAP financial measures. For more information, please refer to PPG’s filings with the SEC. Since the beginning of the war in Ukraine, we have been focused on protecting the health and safety of our employees and their families from Ukraine as well as our employees in Russia. PPG and the PPG Foundation have also committed more than $800,000 to humanitarian relief as well as longer term recovery support. In addition, PPG employees have also been providing direct support to those in need, including taking refugee families into their homes. As a result, we have recorded a pre-tax charge of $290 million for impairment of substantially all of our company assets related to our Russian operations. For context, net sales in Russia represented approximately 1% of total PPG net sales for the year ending December 31, 2021. Before I provide the regular quarterly review of our results, I’d like to provide a concise summary of the key issues impacting our business in the quarter as we look ahead. During the first quarter, we had two major events: the Ukraine-Russia crisis and increased COVID-19 restrictions in China which have created some new uncertainties about overall regional demand and possible global carry-on effects. Specifically, we continue to experience improvements in our supply chain and our raw material availability. Additionally, outside of China, COVID restrictions have continued to decrease in many parts of the world. As a company, we have continued to improve our pricing realization in both pace and cadence. Our price capture this cycle is much faster and we are now pricing in the second quarter for second quarter inflation impacts, so we are basically pricing in real time. While many of our businesses and regions have not fully recovered from the pandemic, as a matter of fact, we are still down about 5% in aggregate. However, when a business does deliver volume improvement, we are realizing good bottom line gains. For the first quarter, we delivered record net sales of $4.3 billion and our adjusted earnings per diluted share from continuing operations were $1.37. To quickly summarize the quarter, our sales performance was better than our January guidance despite unexpected impacts from the crisis in Europe, COVID-related disruption in China and continuing logistics bottlenecks. Above market sales volumes were achieved in several of our end-use markets, including our PPG-Comex business, which during the quarter opened their 5,000th concessionaire location in Mexico. In addition, our automotive refinish business performed well with strong sales volumes in the U.S. and Europe. Also, our aerospace business benefited from year-over-year initial improvements in the market and we expect further industry demand growth as we are still well below pre-pandemic levels. In addition, our selling price increases increased 10% year-over-year, marking the 20th consecutive quarter of higher selling prices. Our selling prices are up over 12% on a 2-year stack basis versus the first quarter of 2020, reflecting our continued actions to offset generationally high inflation. Our recent acquisitions also performed well, including the realization of targeted synergies. The Tikkurila business delivered year-over-year sales growth of more than 10%, excluding our Russian operations. During the quarter, we also launched a significant expanded Pro Painter initiative with The Home Depot. And despite continuing raw material constraints restricting our ability to fully load inventory, we now have our full Pro Paint assortment available in about 60% of their stores. In the first quarter, our selling prices did offset year-over-year raw material inflation, but did not offset inflation from other sources, including logistics, energy and labor and we did not fully recover prior year inflation. Sequentially, versus the fourth quarter 2021, our overall margins improved by more than 200 basis points. Due to higher crude oil and energy prices, we are implementing incremental selling price increases in the second quarter and expect that we will exit the second quarter offsetting all inflation categories on a run-rate basis. In several businesses, we continue to face certain raw material shortages resulting in our overall sales backlog growing to about $180 million exiting the quarter. Additionally, these are two of our many industries we supply where inventory levels are extremely low all the way to the end consumer. We have continued to control our controllables and once again lowered our SG&A as a percentage of sales, decreasing by about 40 basis points compared to the first quarter 2021. And we are experiencing growing digital adoption from our customers, most notably in the architectural coatings business. In the first quarter, our net debt increased mainly due to the higher dollar value of inventory reflecting inflationary effects. We expect our cash flow generation to match prior year end trends, which is to consume cash early in the year and generate strong cash flow as we progress through the end of the year. Strategically, on April 1, we completed the acquisition of Arsonsisi’s Powder Coatings business, continuing our focus on growing our powder coatings manufacturing capabilities. In addition, we divested some architectural coatings businesses in Africa as we continue with our legacy evaluating all regional businesses and product lines to ensure that they continue to have strategic value and meet our financial hurdles. In the first quarter, we continued to take additional measurable steps to further advance our ESG program by issuing our inaugural DE&I report. While I am proud of what we have achieved, we know that there is more work to do and additional areas of opportunity to focus on. If you have not already done so, I would encourage you to read our report and learn more about what we have done and our aspirational goals for the future which are outlined in our presentation materials. Looking ahead, while our underlying demand continues to be solid in most of our end-use markets and regions, second quarter economic activity, in particular in Europe, has started to soften as consumers remain cautious based on the current geopolitical issues in the region. In addition, manufacturing supply chains have been recently impacted in China due to severe restrictions from rising COVID cases. In the last few weeks, up to 5 of our smaller manufacturing sites have been mandated to shutdown due to restrictions plus our principal Protective & Marine Coatings production facility. As mentioned earlier, we expect further sequential inflationary pressures on raw materials, logistics and energy. Our 2-year stacked raw materials inflation expected to exceed 35%, but only up low to mid single-digit sequentially versus the first quarter. Due to the heightened levels of uncertainty, our earnings guidance considers a wider range of outcomes for the second quarter. More generally, our guidance assumes that restrictions in China ease somewhat in May and that geopolitical issues do not expand beyond the current Russia-Ukraine boundaries. While the current environment remains difficult to predict, I expect that as 2022 progresses, we will begin to experience an easing in supply chain disruptions, general inventory rebuilding across many end use markets and still a healthy consumer willing to spend, especially in North America. This includes continued recovery in the automotive refinish, OEM and aerospace coatings businesses; normalization of commodity raw material costs, which should moderate over time given supply dislocations are improving and there is a softening in certain regional economies. As demonstrated this past quarter and supported by our lower cost structure, strong operating leverage on any sales volumes growth, accretive earnings growth from our recent acquisitions from both their historical base earnings and further synergy capture; above market organic growth driven by our advantage and leading brands, technologies and services. In closing, as we look ahead, I remain confident about the company’s future. I strongly believe in our team of 50,000 employees as we work to do better today than yesterday everyday. Chris, what I would tell you is that our input shortages remain consistent with what we have seen previously. We have seen improved reliability, exclusive of the Shanghai area, for Asia. Ghansham, let’s start with the share buyback question first. But obviously, at the share price, we are going to balance what’s most accretive to the shareholders. And in regards to China and Europe, what I would tell you is the car situation in China is being impacted probably a little bit more than some of the other markets. So clearly, we’re concerned about the rising number of COVID cases. And we expect to get the other two plants up and operating in the next 3 to 5 days, I would say, if we’re being a little bit optimistic here. I think if we think more broadly as we put together our Q2 forecast, we do expect China to – some of the COVID restrictions to ease in the early part of May and continue to ease through the balance of the quarter, but they are certainly restrictive right now. In Europe, again, we’re concerned about – maybe overly concerned, but we’re concerned about the effect on consumer of energy prices and just the overall environment. We hope we’re being a bit bearish, but that’s what we’ve forecasted and we will see how the cards fall as we go through the quarter. Guys, just on U.S. architectural, are you seeing any discounting by your competitors? David, I’m going to – we have Tim here. Look, in our architectural U.S. business, in fact, our architectural business is around the world. And that pricing, while never easy to get, is being accepted by our customers. So on the pricing front, Michael, you kind of indicated you’re almost at a point where it’s real-time pricing. Well, John, first of all, we’re not going to be giving this pricing back. They see raw materials that we buy, they can see it in their own systems going up. They can see transportation going up, they are paying for transportation. So from that standpoint, most of the bullets that they usually try to fire at us, that our salespeople try to avoid, that’s not happening. So we’re telling people, this is the new price. And if you don’t like it, please don’t place purchase orders. And if the purchase orders come in without the new price on it, we’re sending those purchase orders back. So when you see oil at $107, our customers are getting priced like that. Michael, I’d like to drill in a little more on this relationship with Home Depot. Michael, you mentioned the 60% level of a particular metric. But I’m sure there is many, many steps involved in the rollout of that relationship. Stephen, I’m going to just tell you the 60% referred to, we’ve only been able to stock 60% of their 2,300 stores, and I’ll let Tim add additional color to it. Look, the program is – while it’s in 60% of the stores will continue to ramp up as we move throughout the next several months as supply situation improves and we continue to build inventory. That will continue to grow as we learn, as The Home Depot associates learn and as the supply continues to build, and we will pivot as necessary. And then we expect this to be a long-term, multiyear growth initiative for both us and The Home Depot in the Pro category. And Steve, again, just more broadly, and we talked about this on our January earnings call. And again, we’re really targeting availability for the professional painter on a daily basis. And as Tim mentioned, that omni-channel approach that can come to our stores, they can go to our dealers or they can go to Home Depot, and that’s all within a close proximity of their job site. The last thing I would add is, look, at the beginning of the day, every time we go into a new market with Home Depot, we get substantial new wins right out the gate. Michael, I’d be curious to get your updated thoughts on sort of the home improvement market just given since our last call there is been a big move in interest rates and housing market seems tight still. Okay, Vincent, I’ll let Tim comment on this. Look, there is – right now, there is such a strong backlog, particularly on the residential side. And even, obviously, rising interest rates, there is going to be some mortgage and affordability impact there, but there is such a shortage of overall housing in multiunit housing. So absolutely, it’s something that we’re watching. But we’re certainly bullish on that for at least the rest of this year, and we will see beyond that. The one thing I would add to that is that we do a Pro Painter survey, and that Pro Painter survey continues to show a very strong backlog of our professional painters. But at the end of the day, our Pro Painters still show pretty good backlog. Yes, in fact, our last Pro Painter survey which we just wrapped up, 75% of the painters had a backlog that was at least as big or higher than what they had 90 days and a year ago, so certainly no impact on the short to medium term. And is that achievable in a scenario that you lay out where China lockdown impact perhaps stay over the next couple of quarters, but Europe perhaps enters into a minor recession. Miles driven, we’re actually almost back to 2019 levels in the U.S. We see miles driven improvement in Europe as well. You probably noticed yesterday, Boeing said they were going to start rebuilding or building 787s again. And so when you think about what the run rate of car should be, we’re still very bullish that car builds in the U.S. have been muted because of lack of chips, lack of parts. So overall, I would tell you that we’re in good shape. Our synergies are going to be continuing to come in, productivity is continuing to improve. So I feel very good, I feel very comfortable around $9. And the price raws, we’re going to be past that in the second quarter. Historically, third quarter tends to sort of seasonally decline from 2Q, but it sounds like the pricing rise is going to get better as you noted. And I think from Q4 to Q1, you saw our margins move up 200 to 300 basis points, depending on the segment. We think that’s the true indicator of how well we’re doing, how well the industry is doing. So again, we’re looking sequentially. And again, we’re very proud with our performance Q4 to Q1. We do expect – again, there is a lot of noise in 2021. So we do expect, as you’ve heard Michael in the opening, some improvement in demand, as we go through the year, especially as China comes back. And again, we’re just looking sequentially. Our margin’s getting better Q4 to Q1, Q1 to Q2 versus historical patterns, and that’s really our marker. Obviously, a lot of questions already on price. Michael, I was just curious what the absolute number you’re expecting in 2Q would be versus that 10% in 1Q. So Frank, first of all, we try to give you a guide on that second quarter. So if you take John’s little dotted line on that chart, you’re going to dot a line up to around 12%. We certainly are internally pushing the team for more than that, but I think that’s a realistic outcome. And we – as we have talked about before, we think Tikkurila can look just like what Comex is. So, we get more growth in the local markets and we get better value for what we are selling and that leads to an ever-improving return on our investment that we invested in buying Tikkurila. Since we brought Tikkurila, one of the other businesses that performed really well in Q1 was our Traffic Solutions business, the prior Ennis-Flint acquisition. But again, we still ended that – ended the quarter with a very strong backlog and now we are going into a very strong quarter. Hey Frank, it’s Tim. Vince mentioned 25% top line growth, all-time record quarter for that business. And much like what Michael described with Tikkurila, the prior Ennis-Flint business pricing discipline was very different than what we – how we executed PPG. I just wanted to, again, drill into some of the drivers of maybe Q3 and Q4, understanding that your visibility is relatively dynamic. Honestly, our visibilities in terms of all the dynamics that play into inflation is probably 60 days to 90 days. And what we could tell you is we are seeing better supply in Europe, certainly. Better supply in the U.S. China is obviously, we are going through a transitory period due to the restrictions. And as we said many times, we do feel there is enough structural supplier capacity to easily satisfy global coatings demand. But at some point, we will normalize across supply/demand based on historical patterns, just too hard to predict Q3, Q4 right now. We do have enough – we do have good pricing going in, as Michael said, in Q2, which is enough to compensate for the sequential increase in raw materials. If we see more raw materials in the back half of the year, we will put in that real-time pricing engine again. When we look at beverage can demand globally, it seems pretty strong. Look, we have picked up new share at, I would say, 70% of the new beverage can plants. So, we are in very good shape from that going forward. Second, when you look at the packaging numbers, you have to remember we had phenomenal comps last year, and that will make it more difficult. So, I feel very good about our position in our packaging coatings business. I would also tell you that when I think about that business, it’s not just the volume, it’s also the price that we are realizing as well. If you look at the U.S. and Europe, on a year-over-year basis, volumes were up about mid-single digit, and that’s off of a tough comp from last first quarter. It was a good quarter, especially in the U.S. Asia was off a little bit, mainly driven by when we talked about the Winter Olympics slowed activity down and there was obviously some restrictions in March. First, on the manufacturing side, back in January, I think you talked about a $0.20 EPS drag in the fourth quarter. And then on the CapEx side, if I read the numbers right, it looked like your first quarter spend was $194 million versus $80 million last year. So, the January number was probably a little bit inflated, but our overall spend for the year is not going to change. And we are still looking at that 3%, $500 million kind of range. As you know, some – a little bit of that is catch-up from the under-spending in ‘20 and a little bit of early 2021. And the problem is it’s not that we are having challenges making things, it’s we are having challenges scheduling things because of raw materials predictability, what comes in. And if you are missing one item, you can’t make the paint. So, that’s a bigger issue. So, as you can imagine, going into Q1, we had a certain natural gas number for Europe. So, I would tell you, overall, the manufacturing is getting better. And I would say for Q2, you should anticipate another 50% improvement in that number. But given your sort of first quarter that you reported, the second quarter guidance, first half is going to be down year-over-year. So, not only we are going to use the asset, it was running five days a week, one shift, now it’s running 24 hours a day, seven days a week. And PJ, on the margins, I am glad you brought that issue back up, because I do feel it’s really the measurement stick because of all the noise last year. Our first quarter last year was very strong, benefited by – the first quarter of 2021 benefited by some pandemic recovery. And then as we got through the balance of the year, our second half of ‘21 was very, very weak. But again, the trajectory of margins sequentially for each of these quarters, I think is the true marker for our industry. We do expect, again, from some of the reasons Michael mentioned, abating supply shortages, improvement in our manufacturing and catch-up on pricing, we do expect our margins to improve sequentially versus historical patterns for the foreseeable future. If we see anything strategically, we want to execute on, we will act accordingly. Again, if you look at our interest rate and blended interest rate, it’s the best-in-class of our space or close to the best-in-class, so again, no change in our strategy or outlook in the near term. So, our manufacturing has gotten better because their predictability of running has gotten better. And the one question nobody asked, so I am going to throw the answer out there and make sure you know it is our automotive team has priced higher than company average. And then from an EV standpoint, we don’t see battery shortages this year. But right now, when I think about where we are winning in that space, our protective coatings that go into the battery has been a huge win for us. So, one of the top five guys, we are also running a long-term cathode binder study with, that’s more like a 3-year to 5-year program, but the fact that they came to us to do that is really a good sign about how they see us playing in this space long term. And Mike, I just want to – I am glad you brought the question up again because I do want to talk a little bit more broadly about auto build. Michael mentioned, targets from third-party consultants this year is around 80 million builds. Again, we think the market, on a run rate basis, is typically over 90. So, there is at least, let’s call it, 10% to 12%, 15% catch-up that will occur in the next, you pick the number of quarters or months, 12 months to 18 months. On top of that, we think there is a fleet rebuild that has to occur for things like car rental fleets. On top of that, there is an inventory replenishment cycle for – in the U.S., for example, dealer lots, so, a very long runway. New builds are up 20% year-over-year, and it’s up strongest in China, which is where we are strongest. So, that’s really good for us. So, I have high hopes for our teams, our Protective/Marine business over time that is continuing to do well. When you talk about the auto business, fixed costs, we actually paint EV cars just like you paint an internal combustion cars. So, we are going to still have all that business and fortunately you sell additional paint for the battery box. So, actually, your fixed – your cost structure improves as the volume goes through. So, the transition from internal combustion engines to batteries is actually a good trend for us. So, we are doing – I would say, we are doing better than our typical market share on internal combustion engines. Now, will we look at acquisitions in that space, we are always looking for things that add shareholder value. There is a number of people playing in it, whether it’s the protective coatings, whether it’s films, whether it’s powders, whether it’s thermal gap fillers, there is a variety of different applications on how you win in that space, but we feel very good about this. So, I would like to hand the call back over to John Bruno. Before we wrap up the call today, I wanted to let everyone know that Mary Anne Bendzsuk will be retiring in the second quarter and this will be her last quarterly earnings call. I think a lot of people on the call had dealt with Mary Anne and she has been a valued team member here at PPG for many years and provided excellent support to the investment community, supporting Investor Relations for more than 20 years. If anybody has any other questions, please give us a call."
}