{
    "symbol": "FSBC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 16:00:26",
    "content": " Loans held for investment increased during the quarter by $202.5 million or 8.51% from the prior quarter, primarily within the commercial real estate concentration of the loan portfolio. The proceeds received from the subordinated notes, net of debt issuance costs and required debt servicing reserves will be used to redeem $28.8 million of previously existing subordinated notes on December 15, 2022, with the remaining $39 million downstream to Five Star Bank during the quarter. Non-interest income decreased to $1.5 million in the third quarter from $2 million in the previous quarter, due primarily to a $0.3 million decrease in gain on sale of loans relating to lower volumes of loans sold during the quarter and a $0.2 million decrease in loan related fees due to lower swap referral fees earned during the quarter. Non-interest expense remained relatively flat quarter-over-quarter, with increased professional services of $0.2 million related to legal expenses incurred for corporate organizational matters completed in 2022, offset by declines in other operating expenses, a $0.3 million related to reduced travel expenses incurred during the quarter related to attendance of professional events, conferences and other business related travel combined with a $0.1 million of lower loan related expenses incurred. Maybe if I could start, James, on loan growth came in I think a bit better than we anticipated this quarter and maybe a bit better than we spoke about on last quarterâ\u0080\u0099s call, I think, your comments about kind of strength and resiliency in the pipeline. And as you think about kind of being comfortable to 10% to 15% loan growth range, on the other side of the balance sheet, I know deposit growth has been kind of tougher across the industry the past couple of quarters. I think, James, on the call last quarter, as well as may be intra quarter, there was commentary around the deposit pipeline kind of running ahead of the loan pipeline and maybe an expectation that this quarter be able to fund or match the growth of loans with that deposit."
}