{
    "symbol": "FSBC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 14:56:01",
    "content": " Non-PPP loans held for investment a non-GAAP measure that is reconciled in our press release, increased during the quarter by $301,900,000, or 14.52% from the prior quarter, primarily within the commercial real estate concentration of the loan portfolio. Loans designated as substandard totaled $1.2 million at the end of the quarter, representing a decrease in substandard loans of approximately $1.8 million from the previous quarter. During the second quarter, deposits decreased slightly by $1.8 million, 4.07% (ph) as compared to the previous quarter. As a result of these factors, our net interest margin was 3.7% for the quarter, while net interest margin for the prior quarter was 3.6%, which also included $600,000 of PPP income recognized based on forgiven loans. The change in the yield curve as a result of interest rate hikes that occurred during the quarter had a negative impact on the company's accumulated other comprehensive income in the amount of $5.5 million, primarily in our mortgage backed and municipal securities portfolios, resulting in decreases to each of those portfolios of $7.3 million and $5.2 million, respectively. Non-interest income decreased to $2 million in the second quarter from $2.2 million in the previous quarter, due primarily to a decrease in other income as a result of a $300,000 gain recorded on a distribution received on an investment in a venture backed fund in the prior quarter, which did not recur during the current quarter. Non-interest expense increased to $10.2 million in the second quarter from $9.6 million in the previous quarter, driven largely by an increase and other operating expenses as a result of an increase in travel related to attendance of professional events, conferences and other business related travel during the quarter. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}