{
    "symbol": "AJX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 19:55:19",
    "content": " The regular payment performance of our mortgage loans and our mortgage loan JV structures in excess of our modeled expectations at the time of acquisition, for loans purchased at a discount to UPB, has increased previous GAAP income by accelerating purchase discount accretion, because of the required application of CECL. Net interest income from loans and securities, including $1.1 million of interest income from the application of CECL was approximately $5.1 million in Q4. As a result, since our joint venture investments have been growing faster than our direct loan investments, GAAP interest income will be lower than, if we directly purchase loans outside of joint ventures by the amount of the servicing fees and GAAP servicing fee expense will decrease by the corresponding offsetting amount. Previous increases in housing prices helps maintain these payments -- prepayment patterns and lead to increases in the present value of expected reserves and the related income recognition of $1.1 million of unallocated loan purchase discount reserves under CECL in Q4, an additional reserve recaptures in each of the previous seven quarters as well. Cash flow income was primarily driven by continued prepayment and the related loan purchases are captured for non-performing loans and increasing monthly payment re-performance from non-performing loans and regularly performing loans, offset by higher interest expense and a lesser amount of loans and securities under balance. As I mentioned earlier, for both RPLs and NPLs, purchasing aged low LTV loans at more than 50% discounts to property values provides a natural head to housing price declines and the recession has resulting increases in delinquencies, shortest duration and increases corresponding yields. On page 11, average loan yields and average yields on beneficial equity interest in our joint ventures declined primarily due to significant loan reperformance, which extends duration and the acceleration of GAAP purchased discount recapture as a result of CECL requirements. The -- that being said, because we own our loans at such huge discounts to property value on the -- for example, the portfolio we bought in October, the large joint venture, we bought 39% of property value, and we bought it a 15-point discount in a way it's basically a hedge against recession causing increased delinquency because of short duration and we recapture the discount faster."
}