{
    "symbol": "AJX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 00:26:07",
    "content": " The significant cash flow velocity from our mortgage loans and mortgage loan JV structures increases income acceleration through the application of CECL, but it also rapidly pays down our loan and securities portfolio as well as the associated â\u0080\u0093 and the associated asset-based financing, which can also reduce income and ROE. At June 30, we had approximately $52 million of cash as well as a significant amount of unencumbered securities and loans. Weâ\u0080\u0099ve certainly seen the benefit of this during the COVID pandemic and in 2022 so far with significant ongoing loan cash flow velocity and credit performance and with our 2022-A and 2022-B securitization structures, the first AAA-rated structures with up to approximately 40% of loans greater than 60 days or more delinquent and still rated AAA. Net interest income from loans and securities, including $1 million of interest income from the decrease in the present value of expected credit reserves was approximately $11.7 million in the second quarter. Loans that are not regular monthly pay status typically of materially shorter durations, we have seen and continue to expect the stability of housing prices will still drive prepayments from property sales for both regular paying and non-regular paying loans, and it also catalyzes monthly re-performance on previously delinquent loans. Additionally, as mentioned earlier, we took a $1.8 million fair value adjustment for duration extension for over re-performance of previously non-performing loans. In addition to the $25 million face amount of preferred and the associated warrants and put rights we repurchased, in the second quarter, we also repurchased approximately 475,000 shares of common stock at a weighted average price of $9.77 per share. We purchased an NPL portfolio of approximately $85 million in late Q3 of 2021, in which all of the loans are secured by properties in Miami-Dade, Broward and Palm Beach counties in Florida. On Page 12, our total repurchase agreement related debt at June 30 was approximately $509 million of which $219 million was non-mark-to-market, non-recourse mortgage loan financing and $217 million was financing on Class A1 senior bonds in our joint ventures. At June 30, we had approximately $139 million face of unencumbered mezzanine bonds as well as $126 million UPB of unencumbered beneficial interest certificates and joint ventures and $29 million UPB of unencumbered mortgage loans."
}