{
    "symbol": "AGYS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-25 21:25:03",
    "content": " Thanks to the successful of product modernization and innovation efforts over the past few years, we continue to operate at record highs in the gaming and destination resort market areas, which also happened to be the dominant areas of our business, constituting more than 70% of our overall sales and revenue levels. More than 90% of our new customers and new sites this fiscal year have preferred cloud SaaS solutions leading to a reduction in perpetual license sales, affecting one-time software product revenue. Despite all these various remaining short term business environment challenges, overall global sales levels across all verticals during the first three quarters of fiscal 2022 were at more than 90%, of the levels seen during the pre-pandemic fiscal 2020 two years ago. Thanks to the current availability with us of modern SaaS-ready software solutions across the entire band of hospitality industry needs, despite all the challenges in multiple market verticals, we have sold more subscription-based recurring fees in annual contract value terms in just three quarters of this fiscal year than any other previous full fiscal year. Total sales of property management systems, PMS products and related additional modules during the first three quarters of fiscal 2022 have already surpassed sales levels during all of pre-pandemic fiscal 2020. The first three quarters of fiscal 2022 have also been our best ever in annual contract value of sales of additional products to current sites, what we normally refer to as new product sales. Each quarter of fiscal 2022 has been a record for subscription revenue, with this quarter growing by 25% compared to Q3 of last fiscal year and by 48% compared to Q3 of fiscal 2020 two years ago before the pandemic. Overall, total recurring revenue was 5% sequentially higher than Q2, 10% higher than Q3 last fiscal year and 20% higher than Q3 of fiscal 2020 two years ago. Fiscal 2022 third quarter overall revenue was $39.5 million, our highest level since the start of the pandemic nearly two years ago, but still below expectations and at the low end of revenue guidance. Q3 revenue was 4% sequentially higher than Q2, 8%, higher than the comparable quarter last fiscal year and 6% lower than Q3 from fiscal 2020 two years ago, which was our last full quarter not affected by the pandemic and that $42 million was a record for quarterly revenue. Overall, hardware and software product revenue taken together of $8.1 million was 11% sequentially higher than Q2, 7% higher than Q3 last fiscal year and 33% below Q3 of fiscal 2020. Q3 services revenue was $6.2 million, 5% sequentially lower than Q2, about the same as last fiscal year and 30% lower than Q3 of fiscal 2020 two years ago. Adjusted EBITDA for the quarter was $6.6 million and about 17% of revenue, slightly higher sequentially compared to Q2, 13% less than Q3 of last fiscal year and 104% better than Q3 in fiscal 2020. Consistent with our revenue structure, ResortSuite comes with a mix of one-time software product, services and annual maintenance recurring revenue, which should all together add up to slightly more than $1 million per quarter for the next few quarters, of which about 70% should be annual maintenance recurring revenue. Third quarter fiscal 2022 revenue was $39.5 million, a 7.6% increase from total net revenue of $36.7 million in the comparable prior year period. Our inventory levels have increased by over 175% since the start of the fiscal year, while logistical challenges with delivering products to the end customer resulted in a reduced topline Q3 product revenue. We are also pleased with our subscription revenue growth, which grew year-over-year 24.9% during the third quarter of fiscal 2022 to a record $11.7 million and 5.5% sequentially over the second quarter. Add-on software modules made up 11.7% of subscription revenue in the third fiscal quarter of 2022, despite many of these sales remaining on the backlog due to outlet closures and labor shortages at our customer sites. In summary, despite the various pandemic-related challenges which remain across Asia, Europe, managed food services, cruise ships and hotel chains, we expect Q4 to be our best revenue quarter yet, getting us to the lower end of the fiscal 2022 full year total revenue guidance range. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}