{
    "symbol": "AGYS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-27 22:36:04",
    "content": " Despite the lack of recovery in multiple verticals and geographic market areas, this was our best Q1, April to June quarter with respect to sales success and revenue level slightly higher than Q1 two years ago, when all our markets are operating normally with no pandemic-related challenges. Professional services and hardware sales bookings during Q1 fiscal 2022 were close to even with Q1 two years ago, while software sales was ahead of pre-pandemic levels. Taking a look at our financial results, beginning with the income statement, first quarter of fiscal 2022 revenue was $38.7 million, a 29.9% increase from total net revenue of $29.8 million in the comparable prior year period. When comparing to the pre-pandemic period of fiscal 2020, we are encouraged that the current quarter has returned to similar levels of revenue and sales as the comparative 2020 quarter, while the total backlog is at record levels. We are also pleased with our subscription revenue growth, which grew year-over-year 33.2% during the first quarter of fiscal 2022 to a record $10.2 million. Add-on software modules that build out our product ecosystem beyond the core point of sale, property management and inventory procurement offerings are adding scale quickly and are now contributing to 8% of total sales this quarter, when less than two years ago, the add-on modules were not a meaningful contributor to sales. We continue to expect fiscal 2022 revenue to be in the $160 million to $170 million range, with adjusted EBITDA being slightly north of 15% of revenue despite expected increased spending levels in all customer facing areas. Your line is now open. And then just a quick follow-up to that, you reiterated the guidance despite coming in sort of above, at least our expectations for the quarter and talking about sort of record levels of, of bookings and backlog here, is there just an extra element of conservatism given the ongoing uncertainty or have some of these project delays and the delays associated with recognizing revenue just not sort of giving you that extra confidence to raise the guidance range. Your line is now open. So year-over-year, Nehal you should expect subscription revenue to be around the 20% higher than the previous year, when you add up all the quarters of a year – when you add up all the four quarters of the fiscal year and compare it to the previous fiscal year, it will end up around the 20% mark we think. Your line is now open. Your line is now open. But now we’ve kind of normalized out the stock-based compensation, I think you'll see us go back to ranges you're more familiar with, for example, G&A will probably remain in the 14% to 16% of revenue, product development start coming down into the 28%, 29% of revenue and sales and marketing will start to come up 10% to 12% of revenue."
}