{
    "symbol": "AGYS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-17 17:56:02",
    "content": " Despite the various business environment challenges, overall global sales level during fiscal 2022 was 44% higher than the previous year and 96% of our best previous year fiscal 2020 just before the onset of the pandemic. Due to various levels of on and off lockdowns across countries practically throughout the year, sales in the APAC region decreased by 15%, that is one-five, decreased by 15% compared to last year and by about 50%, that is five-zero, by about 50% compared to the pre-pandemic fiscal 2020 year. Fiscal 2022 was our best year with respect to subscription software sales of PMS and related modules, 53% higher than the previous best year. Fiscal 2022 Q4 revenue was a record $46.6 million, 18%, that is 1-8, 18% sequentially higher than Q3 earlier this year and 28% higher than the comparable prior year quarter. Recurring revenue during Q4 fiscal 2022 grew to $26.6 million, driven by a 33% year-over-year increase and a 10% sequential increase in subscription revenue. Quarter product and services revenue were well north of 90%, 9-0, well north of 90% of previous best levels, both achieved during Q3 fiscal 2020, October to December calendar 2019. Q4 fiscal 2022 gross margin was 59.5%, higher than pre-pandemic levels, but less than the comparable quarter last fiscal year due to increased levels of product and services revenue. Thanks to increasing subscription revenue levels, we are pleased to have achieved a record annual revenue level in fiscal 2022 despite the business environmental challenges faced during the year, which depressed product and services revenue levels during a couple of quarters. Adjusted EBITDA for the quarter was $7.5 million about 16.1% of revenue, that is one-six, about 16.1% of revenue, more or less at the same levels as the previous couple of quarters, 6% higher than the comparable prior year quarter and 110% better than Q4 in fiscal 2020, a couple of years ago. Adjusted EBITDA for fiscal 2022 full year was $27.3 million at about the same level as the previous year, and again, 110% higher than fiscal 2022 years ago. We expect fiscal 2023 annual revenue to be in the range of $190 million to $195 million, driven among other factors by year-over-year subscription revenue growth of around 30%, that is three-zero of around 30%. We also expect adjusted EBITDA for the full year to remain greater than 15% of revenue that is one-five, 15% of revenue, though the EBITDA levels may fall to slightly below 15% during Q1 and Q2 due to incentive comp accrual increases; vacation balance-related accounting adjustments, which are significant and typically affect Q1 cost levels; employee salary merit increases; accounting and other professional fees, which tend to occur in Q1; additional participation in trade shows, including an all-expense paid hospitality consultants forum being conducted this week to update the industry influencers of our current product and services trends; additional hiring, especially in the sales and marketing areas and additional spend related to internal IT infrastructure improvements. Fourth quarter fiscal 2022 revenue was a quarterly record of $46.6 million, a 28.1% increase from total net revenue of $36.3 million in the comparable prior year period. The improved sales activity, we have seen during fiscal year 2022, left us with an exit total backlog, 38% higher than our prior year FY 2021 exit with all three product lines significantly increased. As a result of the continued momentum in our business, we are pleased to see 18.6% total annual revenue growth year-over-year with all three product lines increasing over the prior fiscal year, despite certain aspects of our business continuing to be negatively impacted throughout the beginning of fiscal 2022. Product revenue increased 34.6% over the prior fiscal year, professional services increased 26.6% over the prior fiscal year, and recurring revenue during fiscal 2022 was up 11.7% over the prior fiscal year. We are also happy with our continued subscription revenue growth, which grew 32.8% during the fourth quarter of fiscal 2022 and 28% for the full fiscal year, despite tough industry circumstances in a few of our business verticals and delays in professional services implementations during the first three quarters of the fiscal year. For our fiscal year 2023, we expect revenue to be in the $190 million to $195 million range, inclusive of subscription revenue growth of approximately 30%."
}