{
    "symbol": "AWR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 17:15:20",
    "content": " This was in large part due to losses incurred on our investments to fund one of the company's retirement plans as compared to gains in the same period of 2021, as well as timing issues with receiving a final decision from the California Public Utilities Commission, or CPUC, on our water general rate case at Golden State Water. Excluding the gains and losses on investments from both periods and including the additional revenues and water supply caused from the delay in the water general rate case in our second quarter results, adjusted consolidated diluted earnings for the second quarter of 2022 were $0.71 per share as compared to adjusted diluted earnings of $0.69 per share for the same period in 2021, an adjusted increase of $0.02 per share. Has the new rates being approved and implemented on January 1, 2022, consistent with November 2021 settlement agreement reached between Golden State Water and the public office of the CPUC, we would have recorded additional revenues and water supply costs that will have resulted in higher earnings of $0.10 per share for the second quarter of 2022. So excluding the gains and losses on investments from both periods and including the additional revenues and water supply cost caused by the delays in the water general rate case in the results, adjusted consolidated earnings for the second quarter of 2022 were $0.71 per share as compared to adjusted earnings of $0.69 per share for Q2 of 2021, that's an increase of $0.02 per share. For our water utility subsidiary, Golden State Water Company, earnings were $0.40 per share as compared to $0.57 per share last year, a $0.14 decrease. So factoring the same effect from the two items, adjusted earnings for the second quarter at water segment were $0.57 per share, which was an increase of $0.03 per share as compared to adjusted earnings of $0.54 per share for the same period in 2021. Also included in the water segment's results for the quarter were a $1.7 million reduction in revenues or $0.03 per share to reflect our best estimate at this time of revenue subject to refund from Golden State Water's pending cost of capital application, which includes the impact of a lower cost of debt requested in this application. Also, as mentioned previously, while the revenue for the second quarter of 2022 were based on 2021 adopted revenue due to the CPUCs delayed on the pending water general rate case, the increase in  revenues were largely due to the CPUC approved rate increases effective January 1, 2022, partially offset by a decrease in customer usage as compared to the same period in 2021. In addition, as previously discussed, has a new water rate in the GRC segment has been approved by the CPUC and implemented on January 1, 2022, our earnings would have increased by $0.19 per share. Excluding the gains and losses on the retirement plan investments from both periods, including the result of the new water rate fund settlement agreement for the first half of 2022, adjusted consolidated earnings for the six months ended June 30, 2022 were $1.21 per share, which were higher than the adjusted earnings of $1.20 per share for the same period last year. At 2022, water rates been approved, consistent with the settlement agreement in the general rate case and implemented on January 1, 2022, Golden State Water's earnings contribution for the second quarter would have been $0.10 per share higher and $0.19 per share higher for the first half of 2022. We also recorded a reduction to water revenues, which decreased the quarterly and year-to-date per share earnings by $0.03 and $0.06, respectively, to reflect our best estimate at this time based on our accounting assessment of revenues subject to refund from the pending cost of capital proceeding filed in May 2021, which includes primarily the impact of Golden State Water's lower cost of debt requested in its application. In the second quarter, we recorded a reduction to revenues of $1.7 million or $0.03 per share and $3.1 million or $0.06 per share for the year-to-date 2022 to primarily reflect the estimated revenue impact of a lower cost of debt of 5.1% as requested in our cost of capital application as compared to 6.6% included in 2021 rates currently being billed to water customers."
}