{
    "symbol": "D",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-05 13:42:08",
    "content": " Earnings materials, including today's prepared remarks, may contain forward-looking statements and estimates that are subject to various risks and uncertainties. Please refer to our SEC filings, including our most recent annual reports on Form 10-K, and our quarter reports on Form 10-Q for a discussion of factors that may cause results to differ from management's estimates and expectations. This morning, we will discuss some measures of our Company's performance that differ from those recognized by GAAP. Joining today's call are Bob Blue, Chair, President, and Chief Executive Officer. As outlined in our fourth-quarter call in February, over 80% of that capital investment is emissions reduction enabling. We offer a dividend yield of 3.5% and expect -- decarbonization investment opportunity in the nation, which as you'll hear today -- as you will hear in today's prepared remarks, is steadily transforming from opportunity to reality. There's quite a few exciting developments related to that transformation to discuss this morning, including the pending settlement of our triennial review and our offshore wind application in Virginia, in addition to other positive updates across our operating segments. Before handing it to Bob for those and other business updates, I'll discuss our Third Quarter results and related financial topics. Positive factors, as compared to last year, include growth from regulated investment across electric and gas utility programs, higher electric sales due to increased usage from commercial and industrial segments, and the impact of the share repurchase completed late last year, and a return to normal weather. This is our 23rd consecutive quarter, so almost 6 years now of delivering weather normal, quarterly results that meet or exceed the midpoint of our quarterly guidance ranges. Note that our third quarter and year-to-date GAAP and operating earnings together with comparative periods, are adjusted to account for discontinued operations, including those associated with the sale of our gas transmission and storage assets. For the Fourth Quarter of 2021, we expect operating earnings to be between $0.85 and $0.95 per share. Positive drivers, as compared to last year, are expected to be normal course regulated rider growth, continued modest strengthening of sales from commercial and industrial segment, and slight margin help within contracted assets. Given where we are in the year, we're narrowing our 2021 full-year guidance range to $3.80 to $3.90 per share, preserving the same midpoint as our original guidance. Assuming normal weather for the remainder of the year, we expect operating earnings per share for 2021 to be in the upper half of its narrowed guidance range. We're also affirming long-term operating earnings and dividend growth guidance, no changes here from prior communications. We will, as usual, provide 2022 guidance on our fourth quarter call early in the New Year. On Slide 6, we've summarized several important financial milestones achieved since our last call. First, we issued $1 billion and 10-year green bonds at our parent Company at a cost of 2.25%. And as a reminder, we'll have additional fixed income issuance at Dominion Energy, Virginia, Dominion Energy, South Carolina, and in our parent Company during the remainder of this year. This all-cash transaction was valued at nearly $2 billion, including the assumption of about $430 million of existing debt. Obviously, it's quite a bit of press attention currently on some of the dynamics unfolding around various shareholders of Southwest Gas, but I would highlight that there is no early termination mechanism in our purchase and sale agreement. As a reminder, this transaction does not impact Dominion Energy's existing financial guidance this quarter or otherwise. Next as a result of our continued focus on both our capital allocation process and on our corporate credit profile, we've elected to monetize additional value from our investment in Cove Point by financing our stake with an attractive, non-recourse term loan. We've received binding commitments on $2.5 billion non-recourse term loan, which is at the entity that holds our 50% non-controlling equity method investment in The Cove Point facility. Over the past few years, we've been -- we've taken intentional and significant steps to effectuate fundamental change to lower our business risks, to maximize the recycling of capital into our attractive regulated utility businesses, and to improve our credit metrics. As you will recall, we invested approximately $4 billion in the construction of the Cove Point Liquefaction project. And through the combination of prior stake sales and the project financing we're announcing today, we will have monetized well over $6 billion of capital to date, even before accounting for any distribution. Turning now to electric sales trends, weather-normalized sales increased 2.4% year-over-year in the Third Quarter in Virginia, and 1% in South Carolina. In both states consistent with the trends seen last quarter, we've observed increasing usage from commercial and industrial segments overcoming declines among residential users as the stay at home impact of COVID wanes. Looking ahead, we continue to expect electric sales growth in our Virginia and South Carolina service territories to continue at a run rate of 1% to 1.5% per year. Next, let me discuss what we're seeing around rising natural gas prices and we're hearing a lot about this topic across the industry this quarter. We prioritize our customer rate affordability, and implement price mitigation strategies across our businesses in a variety of ways to account for the impact of changes in gas prices. So, this is less of an issue as to how the recent price increases may impact earnings, if they are sustained, but rather how they'll impact our customer's bills, something we obviously care about and we watch very closely. In our gas distribution service territories, we expect the bill impact of rising fuel prices to be less pronounced than what some recent headlines suggest due to few things, the proximity of gas resources, our widespread use of storage to offset peak-day requirements, and the effectiveness of our gas supply hedging strategies. In our Western states, our unique state regulated cost of service gas production also helps customers avoid price spikes. In fact, we estimate that our customers save over $100 million over just a seven-day period during the winter storms experienced last\n February. In our electric service territories, we also have longstanding risk mitigation strategies including hedging and storage with most fuel costs trued up to customer bills on a delayed basis a structure which helped to smooth out the bill impact of commodity swings. In summary, we certainly don't want to see any increased costs for any of our electric and gas customers. So we will continue to employ these mitigation measures to keep any increases as muted as possible, for the avoidance of doubt, we currently don't see any impact on our -- to our decarbonization focused growth capital investment plan. And wrapping up, we plan to use our Fourth Quarter call early next year to provide a comprehensive update and roll-forward of capital investment, financial outlook, and related disclosures akin to the format of our last Fourth Quarter earnings call which we believe was well received. Investors should expect further evidence in support of several fundamental Dominion Energy themes compelling an earnings and dividend growth, combined with the largest regulated de - carbonization opportunity in the industry, and unyielding focus on extending our track record of successful project, regulatory, and financial performance. As shown on Slide 7, I'm very pleased that our results over the first 3 quarters of this year are tracking closely to the record-setting OSHA rate that we achieved in 2020. As it relates to our electric utilities, I would note that through the first 3 quarters of this year, we're in the top quartile of performance for the South Eastern electric exchange in combined incident rates. At gas distribution, in North Carolina, we reached a comprehensive settlement with the public staff last month for our gas operations, with rates based on a 9.6% ROE to be effective this month, and generally in line with our financial plan expectations. A new hydrogen blending pilot which, like our existing blending pilot in Utah, is part of our goal to be ready to blend hydrogen across our entire gas utility footprint by 2030, a new option to allow our customers to purchase R and G attributes and a new and expanded energy efficiency programs. For $5 per month on a typical residential bill, customers who opt into the program will fully offset the carbon impact of their gas distribution use. In South Carolina new rates were effective beginning September 1st, after the South Carolina Public Service Commission, with the support of all parties, unanimously approved the proposed comprehensive settlement in a General Electric rate case. It's also worth noting that in September, we filed an interim update to our modified 2020 IRP and resource Plan 8, remains the preferred plan, calling for the retirement of all coal fire generation in our South Carolina system by the end of the decade. Last month we announced a comprehensive rate settlement agreement in our pending triennial rate case in conjunction with the State Corporation Commission staff, the Office of Attorney General, and other intervener parties. We appreciate the balanced, reasonable, and cost-effective approach among the parties, which allowed an agreement which supports continued capital investments in Virginia in order to meet the Commonwealth's Clean Energy priorities and the needs of customers. Those investments include the development of offshore wind, which I will touch on in a few minutes, as well as growing one of the leading state regulated utility solar and battery portfolios in the country. The settlement also provides significant customer benefits as shown on Slide 9, and supports our existing financial earnings guidance. In October, we filed for rider cost recovery for the capital investment associated with extending the lives of our 2 nuclear units at the Surrey Power Station, and our 2 nuclear units at the North Anna power station, each for an additional 20 years. Today, we're filing our offshore wind application with the SEC, consistent with the project schedule that we communicated previously. The filing will outline the important details of our process and costs, including contract per selection in terms, project components, transmission routing, capacity factors and permitting. Due to the importance of today's filing milestone, and especially given the sizable volume of information which will be included in this filing, I'm going to spend a little more time than normal this morning summarizing the important aspects. First, this project represents a viable and needed opportunity for Virginia to achieve its clean energy goals. Once complete in late 2026, this project will generate enough clean energy to power up to 660,000 customer homes and avoid as much as 5 million metric tons of carbon dioxide emissions annually, which is the carbon equivalent of removing more than a million cars off the road each year. As a reminder, capital invested on the riders allow for more timely recovery of prudently incurred investments in costs. In Virginia, rider recovery mechanisms use a forward-looking test period and allow for construction work in progress, all of which minimizes traditional regulatory lag. As outlined on Slide 12, we estimate this project will create hundreds of jobs, hundreds of millions of dollars of economic output, and millions of dollars of tax revenue for the state and localities, as well as supporting Virginia in becoming a major hub for the versioning offshore wind industry in North America. For example, last week, Siemens Gamesa announce plans to establish the first offshore wind turbine blade factory in the U.S. The facility located in Hampton Roads, Virginia, will create new jobs and supply turbine blades to offshore wind projects in Virginia and throughout the North American offshore wind industry. Our filing details that we've satisfied the requirements for offshore wind, but let me touch on 3 key tests required for rider cost recovery. Second, our projected levelized cost of energy or LCOE, of $87 per megawatt hour is substantially lower than the $125 per megawatt hour maximum established by the VCEA. And third, the VCEA requires that the projects construction commences prior to 2024 for U.S. income tax purposes, or the plan to enter service prior to 2028. The long-term costs to our customers of this project which we believe is the most important metric for a regulated project of this nature, is $87 per megawatt hour, and remains within previously guided levelized cost of energy range of $80 to $90 per megawatt hour. For example, it's still early, but we estimate that further expansion to tax credits benefiting offshore wind would reduce the cost to our customers to $80 per megawatt hour. First, our 12-megawatt pilot project which consists of the only operating turbines in federal waters has provided considerable benefit to the development and planning of the full-scale development. For example, the pilot project is providing better information about the wind resources off the coast of Virginia. Secondly, we've contracted with firms that have significant experience in offshore wind farm design, construction, and operations to support the project. When we announced the project in September of 2019, the initial pre -engineering and pre - RFP estimated cost was approximately $8 billion. Since that time through the process of detailed engineering, and most importantly through competitive solicitations for all components and services, we've now developed a detailed budget of approximately $10 billion. As I've been discussing across several quarterly calls now, the cost increase can be attributed to, among other things, commodity and general cost pressures as seems to be the case across a number of industries right now. And the completion of the conceptual design phase for the onshore transmission route, which has gone through extensive stakeholder engagement with consideration given for resiliency and connection into our existing 500 kV system, as well as to minimize impacts on surrounding communities, including environmental justice communities, private lands, environment scenic, and historic resources. The remaining project costs include $1.4 billion for onshore transmission, substation facilities, and currently projected system upgrades as well as approximately $1.5 billion for other project costs including contingency. As relates to our  compliant wind turbine installation vessel, construction remains on track with delivery expected in late 2023, and we continue to expect it to be an invaluable resource to the growing U.S offshore wind industry. Turning to Slide 15, let me discuss how our project cost compares to the other U.S off-shore wind projects. First, most of these unregulated or merchant projects remain in the permitting and approval process. For our projects, I would note that it's the only state regulated offshore wind project, we've made considerable progress on development to date, and remain on track to complete construction in late 2026. Next, these offshore wind projects located up and down the East Coast obviously differ significantly in their timing or vintage size and scope. For example, the announced capital costs and expected LCOEs for some projects, include the cost for necessary onshore transmission upgrades and interconnections as our budget does. And some headlines focus on the year-1 PPA pricing for many of these unregulated or merchant projects without reflecting the full cost and incorporating such factors as it's pricing, escalation, which we incorporate. Regardless, we show here a comparison based on publicly available information, including all such factors of the levelized cost of energy of those merchant projects to our own regulated project. Turning to slide 16, let me address customer rates in Virginia, inclusive of our offshore wind project. First, a reminder that between 2008 and 2020, our typical residential customer rate increased on average by less than 1% per year, which is much lower than the average annual inflation over that period of closer to 2%. Second, based on EIA data, our typical customer rate is 17% lower than the national average and 36% lower than other states that, like Virginia, have joined Reggie. And third, going forward, we see typical residential rates increasing by a compound annual growth rate of around 2.1% through 2035, which is a comprehensive estimate and includes, among other factors, the impact of the de - carbonization investment programs, like our offshore wind project discussed today. If we move the starting point back to 2008, that rate of increase falls to 1.8%, which is lower than projected inflation for 2021. In summary, we continue to be on an unwavering path to meet Virginia's clean energy goals by 2045, and it's incumbent upon us to deliver energy that is safe, reliable, increasingly sustainable, and affordable. We're focused on executing our project construction and achieving regulatory outcomes that serve our customers well, and we're aggressively pursuing our vision to be the most sustainable regulated energy Company in America. When we set that 6.5% rate in July of last year, July of 2020, we were confident then. As the capital we'll update, capital on the fourth quarter call as we mentioned in our prepared remarks. And then just lastly on coastal wind, it's a huge day to dump so I appreciate that incremental color you provided. The $87 LCOE capital costs are higher, so obviously you're seeing some cost pressures despite being below the projections and still within the range, right. You're right, the capital costs number is, that we estimated earlier now that we've done all of the competitive bidding process and moved from conceptual to firm contracts, has gone up . But as we mentioned, the production expectation, that capacity factor out of this, has also gone up as we've got more data which means that the customer bill impact is the same. As we said, it'd be in an $80 to $90 per megawatt hour range, and we're squarely within that at $87. You also have to focus on how much electricity is it generating, since it's going to be generating more than we had previously assumed. That's what lands that customer impact, right where we've been talking about in the $80 to $90 range. In the last, if you look back over the last 15 years or so in Virginia, I think that party, and power, and the Governor's mansion has changed twice. What's remained consistent throughout that period is that our Company has maintained constructive relationships with members of both parties, and we don't see any reason that that would change, and the reason is that what has remained also consistent over that period and even before, is a bipartisan commitment to economic growth and jobs and the economy in Virginia. So what I would expect is that Virginia will continue that bipartisan commitment to jobs and economic development As witnessed in the announcement we talked about in our prepared remarks, the Siemens Gamesa offshore wind blade finishing factory, that was the result of bipartisan work. Wondering Jim, maybe if you could comment on how meaningful something like a direct day option would be for potentially loosening or lessening future equity needs given the many renewable projects that you guys have here at Omnicom. A Lot of commentary on that topic so far this earnings season of both  in some of that, and I agree with certainly one thing that's come up a lot that it's super hard to speculate on moving target pending and draft with legislation so hasn't landed yet. It's funny, a couple quarters ago on this call, we were all speculating as the impacts of the straight up corporate rate increase -- corporate tax rate increase so how things have changed. But a few thoughts, hard to say exactly what's going to be in the final version but it does seem to us that something is going to pass. So we'll see here next month or two, we imagine it will include the Clean Energy tax incentives and the direct pace future you're talking about. So that kind of thing, an extension of the tax credits under refundable basis, it's pretty clear that's going to be valuable and will benefit probably both our customers and shareholders. We expect incentives are going to reduce the cost of renewables to our customers, could accelerate everything we're doing in our Clean Energy transition, and probably provide some pretty nice cash flow features to fund additional capital investment, seems pretty good, details to come. So we'll get more clarity over time, maybe next quarter we can be talking about facts instead of speculation, but at all -- it's manageable as a package. So, as we mentioned a couple of times here, we're going to provide a pretty comprehensive update on our fourth quarter call on all those details. So a couple of things; keep in mind, that's spread over 6 years. So when you do a 1-year roll-forward, it's going to include that 2026 year, previous version only went through 25, So that will be included, but keep in mind that there are some other gives and takes, some other moving parts in our plan. For example, we announced in our IRP in September that we were undertaking a postponement for further evaluation of a couple of things, like some CTEs in Virginia and pump storage projects, so that's not in the current version of the near-term plan. We're going to go through all that on the fourth quarter call, but for the avoidance of doubt, we expect all those updates are going to be supportive of EPS and dividend growth guidance. And let me -- let me -- let me answer that a little bit higher level just for further one's benefit if they're not following, maybe as --- as closely. We ran and we feel very good about the announcement we made in October to sell that asset to Southwest Gas Holdings, all-cash transaction almost $2 billion and it is on track. So yes, there is -- there's a lot of back and forth right in the press, we get that but we don't see any impact in our transaction. Obviously that would improve the customer bill impact associated with how the project is -- as you correctly identify, if there's a tax benefit that gets passed on to customers we're still sorting through that. But again, based on the inputs that we've defined here, we're just staying right in that 80 to $90 range. Yeah, I think that they've evolved to be pretty consistent with what we expected when the project was first announced. So we had a pretty good idea of what will be involved in terms of construction and construction on onshore for the electric transmission, there may be some additional benefits probably with onshore electrical because that's going to be given what we had to do to route this and to make sure we're connecting to the 500 kV. And I think that Siemens Games announcement is really important because it starts the process here in Virginia, a state that is very well-positioned given its location on the East Coast, given its port and the access to the port unobstructed by bridges and the deep water port to be a real hub of offshore wind economic activity. So, obviously, starting very small, but we have 5 projects that are under construction now, 2 of which should be entering service in the next couple of months and 4 more that are expected to be under construction by year-end. So we're still doing -- it increased hydrogen blend up to -- from that testing but -- our next steps, several isolated and started the initial design planned test."
}