{
    "symbol": "THR",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-14 06:32:03",
    "content": " We were particularly pleased with the sharp increase in quotations, up 63% over prior year, followed by robust order growth of 59% year-over-year a historical record, which included a large onetime labor and third-party material contract booking in excess of $20 million. Backlog at quarter end was $155 million, up 31% over prior year and 34% sequentially. Our efforts to address labor shortages and overcome supply chain challenges resulted in a sequential improvement in productivity and utilization over the first quarter, which were masked by $1.2 million in COGS related to operational execution on an isolated project completed late in FY '20. Despite the global supply chain challenges in the quarter and associated lower gross margins, the team delivered $11.4 million in adjusted EBITDA, up $1 million from prior year on $81.3 million in revenue. As a growing part of our business, we also secured over $4 million in additional multiyear rail and transit contracts at attractive margins during the quarter. On a trailing 12-month basis, orders of $341 million exceeded the prior year period for the first time in five quarters. During the current quarter, orders of $121 million grew 59% over the prior year period, exceeding FY '20 pre-COVID levels, and were up 66% sequentially. Revenues were up in 3 of our 4 regions with the U.S. Latin America, Canada and EMEA regions, all greater than 25% above prior year, while our smallest region in APAC contracted by 13% due to the continued impact from COVID-related government lockdowns in India and lower project volume. Finally, we took the charge in cost of goods sold related to operational execution on an isolated project completed in fiscal year '20 for $1.2 million or 150 basis points in the quarter as we near completion of that on-site work. Point-in-time revenues grew 40% in the quarter and 37% on a year-to-date basis, which again highlights the acceleration of our customer spending and viewed over the longer term is representative of the value of the global installed base we have built since our inception. The new debt has no floor and the current pricing grid puts the blended cost around 1.875% versus a previous cost of 4.75%, yielding a cash interest expense savings of over $4 million per year."
}