{
    "symbol": "THR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-26 16:10:22",
    "content": " Revenue finished the quarter up roughly 40% year-over-year at $102.6 million, driven largely by strength in North America. Excluding the one-time labor contract, which represented $12 million in revenue during the quarter, revenue grew by 24% year-over-year. This quarter, we also saw price increases and productivity essentially offset inflation, with $18.3 million in adjusted EBITDA for the quarter, up 214% over the prior year quarter. Turning now to Page 7, revenue in the fourth quarter was $102.6 million, up 40% versus prior year. The large one-time contracts contributed $12 million in the quarter, so excluding that project, Thermon revenues were up 24% versus prior year. Point-in-time revenues grew 34% in the quarter and 33% in the full fiscal year, which underscores the strength in maintenance spending across our global installed base. First, we back out the adjusting items from last year’s quarter totaling $3.3 million or 450 basis points, giving us a comparable base of 41.2% adjusted gross margin in the year ago quarter. This quarter, the one-time contract with revenue of $12 million was dilutive and impacted margins by 570 basis points, giving us a comparable figure of 45.8% gross margin in fiscal 2022 fourth quarter. In the quarter, SG&A was $23.6 million or 23% of revenue versus a prior year of $20.6 million or 28% of revenue, primarily driven by investments in strategic initiatives and costs on higher volume. From a full year perspective, adjusted EBITDA finished at $58.5 million, representing growth of over $22 million or 61% versus the prior year. Our fiscal year ‘23 plan includes an incremental $6 million in key investments, new product development, sales, and business development to execute on our strategic initiatives. Based upon these factors revenue guidance is projected to be from $350 million to $380 million for the full year, which at the midpoint represents 10% growth over our core business at $333 million in fiscal year ‘22."
}