{
    "symbol": "URGN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 15:51:04",
    "content": " These may include statements regarding our ongoing commercialization activities related to JELMYTO, anticipated seasonality for JELMYTO in 2023, our ongoing and planned clinical trials, commercial and clinical milestones in the year ahead, the potential of UGN-102 to transform the treatment paradigm as the first non-surgical treatment for low-grade intermediate risk non-muscle invasive bladder cancer, market opportunities, potential future commercialization activities for UGN-102 if approved, data presentations, regulatory filings, future research and development efforts, our corporate goals, our optimism regarding multiple avenues available to us to further strengthen our balance sheet and 2023 financial guidance, among other things. 2023 is shaping up to be an important year for UGN-102 with multiple near-term catalysts, including top line data from the ATLAS trial, the precursor to ENVISION which enrolled 282 patients who completed treatment with either UGN-102 or primary TURBT, top line results from the Phase 3 envisioned trial mid-year and assuming positive results from the Phase 3 trial, preparing for an NDA submission with the FDA in 2024, the goal would be to target priority review, which if granted may potentially result in approval at the end of 2024 or early 2025. The increase in R&D expenses of $5.3 million is primarily attributable over to higher research and development expenses in 2022 related to Phase 3 ENVISION study for UGN-102, research into ingredients scale-up and production efficiency for JELMYTO, partially offset by lower stock-based compensation expenses in 2022. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. We're very excited about what's happening with JELMYTO, we're very excited about the fact that this year we'll actually be able to share data on a significant number of patients for UGN-102, as everybody knows, that's been a highly anticipated medicine for us."
}