{
    "symbol": "HEPS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-28 14:38:05",
    "content": " Since we has reported on an unadjusted for an inflation basis as previously, we would have reported 69% GMV growth and 72% revenue growth, resulting in an 8.3% gross contribution margin in the first half of the year. In the second quarter, on an unadjusted for inflation basis, we had 57% GMV growth and 63% revenue growth. When adjusted for inflation, our GMV and revenue declined by 10% and 6%, respectively, compared to the second quarter of last year. While we continue to deliver solid order growth at 8% year-on-year basis in Q2, the revenue decline in 1P and 3P operations during this period was mainly due to the limited pass-through effect of inflation to our average order value. On an unadjusted for inflation basis, our revenue grew by 63% in Q2 2022 compared to the second quarter of last year. As a result, we secured a high level of inventory and had higher inventory turnover days in Q2, where the average order value growth was realized below the inflation rate for the reasons explained previously, resulting in 3.3-percentage-point decline in inflation adjusted gross contribution margin. On an inflation adjusted basis gross contribution margin in Q2 declined 2.8 percentage points compared to the second quarter of last year, mainly due to decline in revenue, relatively higher monthly inflation rates and comparatively higher inventory days. On the other hand, compared to the first quarter of 2022, our gross contribution margin improved by 1.3 percentage points in the second quarter within the context of slowdown in the monthly inflation rate and with our increased focus on better inventory management, this performance is an indication of our focus on path to profitability. Our inflation adjusted net operating expenses as a percentage of GMV was at 11.1% in this quarter, improved from 11.6% a year ago and 12% in the first quarter of 2022. On an unadjusted for inflation basis, EBITDA as a percentage of GMV improved by 0.5 percentage points compared to the second quarter of last year and 1-percentage-point compared to the first quarter of 2022, in line with our focus on path to profitability. On an adjusted for inflation basis, while the EBITDA as a percentage of GMV declined 2.4 percentage points compared to the second quarter last year, we observed an encouraging quarter-on-quarter progress with 2.1-percentage-point improvement. Overall, our second quarter results on an inflation-adjusted basis showed improvement on several lines, including gross contribution margin, advertising expenses and enhanced EBITDA when compared to the first quarter of this year."
}