{
    "symbol": "HEPS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-01 11:51:09",
    "content": " Please refer to today's earnings release, as well as the risk factors described in the Safe Harbor slide of today's presentation, today's press release, the 6-K, our Form 20-F filed with the SEC on May 2, 2021, and other SEC filings for information about factors which could cause our results to differ materially from these forward-looking statements. Before diving into the first quarter dynamics and our actions in more detail, let me quickly replace our memory on the operating environment in Q1 2022. Challenging macroeconomic continues to shape the operating environment, including the rising inflation in Turkey and global markets, continued devaluation of Turkish Lira, ongoing challenges on the global supply chain, and headwinds from the tragic war in Ukraine. Accordingly, we delivered 8.3 billion GMV, corresponding to a 84% year-on-year growth in line with our expectations. A strong order growth of 53% year-on-year was mainly instrumental in this performance, driven by healthy growth of active customers and order frequency, which I will discuss on the next slide. Similarly, we had a strong revenue growth of 82% on a yearly basis, mainly driven by the increased share of 1P operation, which grew by 92% in revenue. Our gross contribution margin was 8.3%, lower by 1 percentage point on a year-on-year comparison, while the continued sequential margin improvement was achieved by 1.2 percentage points on top of previous quarter, in-line with efforts for our path to profitability. Our best-in-class customer experience, powered by our robust logistics and technology infrastructure was once again confirmed with our NPS leadership in this sector, with a significant improvement by 4 points compared to Q4 2021. As  options becomes more important in customers' eyes, Hepsiburada stands out with its innovative payment solutions and services such as multi-credit card payments, payment in installments, instant customer loans, store credit such as Buy Now Pay Later and charge to billing ability with a telco partner. Within this context, Hepsipay continued its expansion in our customer base, reaching 7.1 million opened wallet by the end of the first quarter, up from 5.2 million just a quarter ago. Now, let's take a closer look at the first quarter dynamic and I'll   in more detail. Our strong performance in customer experience, enhanced by our nationwide logistics network and data driven marketing, helped create an important role in the consistent increase in both of these indicators. Compared to the first quarter of last year, our   particularly increased in fashion and supermarket domain. Last but not least, it is important to reiterate that we believe our   to go to solutions complements our customer value proposition quite well, especially in the current macroeconomic environment. Therefore, in February 2022, we launched a new store credit solution called Buy Now Pay Later, marking a first in Turkish e-commerce. Let's take a deeper dive on our progress with respect to our value proposition for our customers, as well as our merchants. We designed our customer journeys to provide peace of mind to our customers with compelling experiences, including frictionless return, next day delivery, and convenient two man handling cargo service, all enabled by our robust logistics and technology infrastructure. Our comprehensive merchant value proposition and our progress in enhancing merchant lifecycle management helped us increase our active merchant base to around 83,000 in Q1 2022, up by 55%, compared to a year ago. As a result, the number of SKUs reached roughly 111 million with continued expansion in nonelectronics and long tail products, up by under 10%, compared to last year. HepsiJet delivered around 53% of total marketplace parcels in Q1, the number of merchants using Hepsi logistics fulfillment services reached 330, up from 191 at the end of previous quarter. Moreover, over 9,000 merchants used adtech solutions HepsiAd in Q1 2022, compared to 6,000 a year ago. Following this pilot phase, we began enabling export to the Azerbaijan market in the first quarter of 2022, which we aim to scale gradually with strong focus on customer experience, and asset-light business model. At Hepsiburada, our innovative payment solutions and services played an instrumental role in our customer value proposition. We offer a wide range of solutions such as one-click check-out, payment in installments, multi-credit card payment, instant customer loans, store credit such as Buy Now Pay Later and charge to billing ability with a telco partner. Within that context, our wallet solution, Hepsipay Wallet continued its strong momentum by reaching 7.1 million in Q1 2022. In the first quarter of 2022, around 40% of total GMV cut through Hepsipay Wallet. In February 2022, we also launched a new store credit solution called Buy Now Pay Later for purchases at our Hepsiburada store marking at first in Turkish e-commerce. Buy Now Pay Later limits are defined based on the financial history of our consumers, combining their track record at the Credit Bureau of Turkey and their shopping history at Hepsiburada. First, attracting more customers, driving further order frequency, expanding our merchant base, and increasing our selection are of strategic importance to us. In particular, we are focused on executing segment based customer initiatives, primarily addressing women, running target marketing campaigns, scaling our automated growth agent journey, and customizing lifecycle management along each stage of the lifecycle from our customers and merchants. Considering the current dynamics, the limited visibility on inflation trajectory and its impact on consumer behavior for the remainder of the year, we are not making any adjustments to our GMV growth guidance at this time and keeping it around 50%. Powered by our disciplined cash and cost management, we move forward on our path to profitability and commit to not raise capital for another 18 months from the end of Q1 onwards. The share of marketplace GMV was around 65%, same level as the fourth quarter of 2021. In Q1 2022, strong order growth at 63% was instrumental in generating the GMV growth. These order drops came through continued increase in active customers, reaching 12 million and order frequency reaching 4.9. As at the end of Q1 2022, the annual inflation as published by the Turkish statistics institute reached 61%, whereas our order value rose by 13% in Q1 2022, compared to Q1 2021. Second, the unit sales of certain consumer electronics such as TV, laptops, and robot vacuum cleaners declined compared to the first quarter of 2021, which could be attributed to   despite the  . Also, let me remind you that the inflation impact is more likely to be passed on the customers across the food and grocery related product groups, which only make a very limited portion of our product mix. Therefore, any company operating in Turkey and reporting under IFRS, including us, will be required to apply International Accounting Standard 29, Financial Reporting in Hyperinflationary Economies to their financial statements, for the periods ending on and after June 30, 2022, which will be   after more than 15 years. Although, we will be reflecting inflation accounting to our financials from the second quarter onwards, we believe we initially restated this quarter's GMV growth through this methodology for exemplary purposes. By using the official monthly consumer price index numbers, the restated GMV growth in Q1 2022 compared to Q1 2021 would be around 19%. This performance was achieved by 92% growth in 1Q operations, 45% growth in our marketplace revenue and 44% increase in our delivery service revenue. While there was a 1 percentage point decline in gross contribution margin, compared to the first quarter of last year, our gross contribution margin continued to improve sequentially by 1.2 percentage points in this quarter. As a percentage of GMV, our net operating expenses rose 0.3 percentage points, mainly due to 1.8 percentage points increase in advertising expenses and 0.2 percentage points increase in other operating expenses, offset by 1.7 percentage point decrease in payroll and outsource staff expenses. The 1.8 percentage point rise in advertising expenses reflects our investment in our brands and growth drivers in a more competitive market environment, where both the need and for the cost of marketing increased, compared to the first quarter of last year. Normalizing for this item, our G&A expenses as a percentage of GMV would increase by 0.9 percentage points, reflecting the rise in the number of employees and also annual salary increase. The shipping and packing expenses driven by 63%   or the   in unit price increase applied by our delivery partners remain unchanged as a percentage of GMV, compared to the first quarter of last year. As a function of aforementioned drivers, EBITDA in the first quarter of 2022 was negative TRY 303 million, compared to negative TRY 104 million in Q1 2021. This quarter comes to a negative 3.7% EBITDA as a percentage of GMV in the Q1 2022 indicating a 1.4 percentage point year-over-year decline, whereas it continued its improvement gradually by absorbing 4.3 percentage points from the previous quarter. Net cash used in operating activities increased by roughly TRY 1.1 billion, reaching TRY 1.2 billion in the first quarter of 2022, which is mainly due to decrease in change in networking capital. Higher volume of inventory procurements and increased trade and service table such as advertising, shipping, and other operational expenses in Q4 2021 and which were paid in Q1 2022 was the primary reason for such cash requirements. CapEx was around TRY 119 million in the first quarter of 2022, over 60% of total CapEx consistent of the cost of   employees who are mainly employed for the development of website and mobile platforms, while remaining CapEx mainly consisted of purchase of property and equipment and software and rights. Accordingly, free cash flow was negative TRY 1.4 billion, compared to negative TRY 159 million in the first quarter of last year. Before I end my presentation, let me also emphasize our commitment to focus on sustainable growth with disciplined cash and cost management. And second question is related to your cash flow management, I mean, Korhan has already explained about the increase in trade payables, which is the main cause, I mean, majority of the working capital need is arising from this. And also on the order side, from regarding the order side, I guess, we also from the consumer's point of view realized the pressure on consumers' wallet. And luckily, at Hepsiburada, we are well-positioned in that sense by offering a wide range of affordable solutions ranging from the multi-credit card payments, instant customer loans, installments, and now Buy Now Pay Later and so on. And also, we understand consumers are shifting their purchases towards more affordable alternatives, which is again thanks to our hybrid model with 1P and 3P with our wider selection we are trying to assess that need as well, as they shift their decisions to lower priced items and so on, we also tend to address the EBITDA  . In additionally, we cannot refer to the fact that there's a kind of a decline in unit sales of certain consumer electronics such as TVs, laptops or robot vacuum cleaners with respect to customer behavior. I guess, in general, these are the  I can refer in terms of customer insights and observations, but another detail actually I  , we also kind of observe the need for trustworthy shopping experience, trusted and reliable after sales experience also becomes very important. It has brand over 20 years of history and with our living experience in terms of NPS, we believe we are also offering a safe and reliable option solution to our customers. Our free cash for Q1 2022 is negative by TRY 1,360 million and out of this 360 million is comprised of net loss for the period, roughly   and our CapEx spending is roughly 120 million. Also due to global supply chain issues and high inflation expectations in Turkey, we procured more inventories during Q4 to get readiness for Q1 to ensure that our products are available on the platform and those payments are done in the first quarter of 2022. Also during the quarter, Q1 quarter, we continued such procurements with shorter payment terms and even in certain categories like electronic we paid in advance. Having said that, I would like to mention that our cash spending will be lower during Q2 and Q3 compared to Q1 2022 and it will be minimum during Q4 if it continues to procure in advance for readiness in the following years. And in terms of like our overall approach in Fintech and how we also see and manage the Buy Now Pay Later in this environment, let me quickly address those questions. And as you know, we always offer a wide range of services and solutions, which I already mentioned in my previous answer, ranging from hidden customer loans, installment multi-credit card payments, now Buy Now Pay Later and ability to charge the billing. And that's why we believe we are unique license with the operational and functional capabilities are well-positioned to evolve into a leading Fintech player in this market, spanning across online and offline. And let me also replicate the fact that in Buy Now Pay Later, even though our current focus is all about perfecting the precision credit scores and making sure we show this service the right relevant services, and also making sure we continue to perfect the customer journey. In general, it's actually, we’re right now use by defining the limit, the financial need for consumers from the Credit Bureau of Turkey and the shopping track record at Hepsiburada. First one actually is, we believe Turkish market offers a sizable opportunity given the fact that e-commerce has an inflection point and expect to exceed 20% penetration between total retail by 2025. However, the third one, actually, we have very well-defined and clear strategy in place to overcome those challenges and we continue to execute this prudently and it's very core principle, guiding principle of disciplined cost and cash management."
}