{
    "symbol": "NXST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 22:47:03",
    "content": " Operationally, Nexstar had another great quarter, which drove all-time high second quarter net revenue results of $1.25 billion, reflecting strong year-over-year increases in total television advertising, distribution and digital revenues. In addition, Nexstar's local sales initiatives continue to deliver healthy levels of new business with our sales teams generating new-to-television revenue of $36 million, up 10% over the prior year. Record second quarter distribution revenue rose 4.7% from the prior year quarter to approximately $646 million, reflecting distribution agreement renewals in '21 on improved terms and annual rate escalators. Our top line growth, second quarter cash distribution from our -- I'm sorry, our top line growth, second quarter cash distributions from TV Food Network ownership interest and continued expense management drove record second quarter adjusted EBITDA of $486.3 million and free cash flow of $219 million. Second quarter direct operating and SG&A expenses both increased as a result of higher revenues, continued recovery from the COVID-19 pandemic, increased affiliation in programming and other costs related to the move of News Nation from syndicated programming and news programming which is offset in our adjusted EBITDA calculation from reduced programming payments related to syndicated content as well as a full quarter of expenses from The Hill. During the quarter, we refinanced the Company's senior secured term loans and revolving credit facilities, which reduced annual cash interest expense by approximately $10 million and extended our maturities. We expect Nexstar's cash interest expense to approximately $91 million for the third quarter and $326 million for the full year, reflecting a continued increasing interest rate environment, net of our recent refinancing and expectations for debt repayment. In the first half of 2022, we returned approximately 62% of Nexstar's year-to-date free cash flow or nearly $12.16 per share to shareholders."
}