{
    "symbol": "NXST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 16:44:06",
    "content": " Operationally, in the fourth quarter, we renewed and extended our network affiliation agreement with ABC on terms favorable to the company, and we successfully renewed and extended distribution agreements with our largest MVPD partners on terms that will enable Nexstar to enjoy continued annual growth in distribution revenue for the foreseeable future. Consistent with our capital allocation priorities and focus on enhancing shareholder value, in January, the Board of Directors increased Nexstar's quarterly cash dividend by 50% to $1.35 per share per quarter, substantially exceeding our historical compound annual dividend growth rate of 25%. For the '23, '24 cycle, we expect to generate pro forma average annual attributable free cash flow of approximately $1.25 billion, inclusive of our approximate $90 million attributable to the investment losses associated and tax benefits related to our turnaround of the CW. Net revenue for the quarter increased 19.3% from the prior-year quarter due primarily to our strong political results as well as inclusion of the results from the CW, partially offset by a decline in core advertising primarily a result of national advertising market softness. Nexstar's local TV advertising revenue, which represents approximately 70% of our total core TV ad revenues, excluding the CW continues to meaningfully outperform national declining just 2% year-over-year despite significant inventory allocations towards political during the quarter. In addition, Nexstar's local sales initiatives continue to deliver healthy levels of new business with our sales teams generating new local advertising incentive program revenue of $37 million, flat to the prior-year despite significant political displacement. Nexstar generated fourth quarter political revenue of $265.9 million propelling our full-year of political advertising to $505.6 million, just 1% shy of the 2020 Presidential election year results and up an impressive 32% pro forma over 2018, the last midterm comp. On a consolidated basis, fourth quarter adjusted EBITDA increased 19.8% over the prior-year to $598.2 million, representing a 40.2% margin and fourth quarter attributable free cash flow increased 27.8% to $422.1 million. Excluding the CW, fourth quarter adjusted net income increased 32% to $662 million, and free cash flow increased from 38.7% to $458.1 million. With respect to our free cash flow guidance, we've opted to use an attributable free cash flow figure that includes the cash flow of Nexstar and its interest in the Food Network and our attributable 75% interest in the losses of the CW and the related tax benefits of those losses. Together, fourth quarter direct operating and SG&A expenses increased $72.5 million, primarily due to the inclusion of the CW, including the onetime restructuring expenses of approximately $30 million I just mentioned. Excluding the CW, fourth quarter direct operating and SG&A expenses increased only $5.9 million as a result of higher variable costs related to higher revenues, increased programming and other costs related in part to the move of NewsNation from syndicated programming to news programming, which is offset in our adjusted EBITDA calculation from reduced programming payments related to syndicated content. Fourth quarter operating cash taxes were $53.1 million, which includes $65.3 million attributable to Nexstar, excluding CW and a $12.2 million benefit from the attributable tax deductible losses from our investment in the CW. Overall, for the year, cash operating taxes were $334.1 million for Nexstar, excluding CW, implying a 25.5% pretax income rate and $321.9 million, including the tax benefit from the CW attributable tax deductible losses. We expect Nexstar's cash interest expense to approximate $110 million for the first quarter and $450 million for the year, reflecting current forward curve and expectations for debt repayment. We returned $1.02 billion or 68% of our attributable free cash flow to shareholders in 2022, paying $142 million in dividends and repurchasing $880 million of stock or 5.1 million shares 12% of our shares outstanding as of December 31, 2021. For all the factors are enumerated by Perry and Tom, we are excited about the prospects for 2023 and remain confident in our ability to enhance shareholder value and deliver on our new pro forma annual -- average annual attributable free cash flow guidance for 2023, 2024 cycle of approximately $1.25 billion, including $90 million of attributable losses and associated tax benefit in connection with our ownership interest in CW. We've returned $1.02 billion or 68% of our attributable free cash flow to shareholders in 2022 and recently increased our 2023 dividend by 50% to $5.40 per share per year, representing a 2.8% yield. LIV Golf was viewed by over 1.4 million total viewers across both the CW linear network as well as our digital platform, the CW app, compared to the average linear golf game on television year-to-date LIV Golf's two day average linear viewership was 24% higher than the average."
}