{
    "symbol": "NXST",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 14:07:04",
    "content": " We delivered an all-time high first quarter net revenue of $1.21 billion, driven by strong year-over-year increases across all of our core and political advertising, distribution and digital revenue sources. Overall, television advertising revenue grew 8.3% versus Q1 of '21, and core television advertising of $428 million was a first quarter record and increased 4% over the prior year quarter. In addition, Nexstar's local sales initiatives continue to deliver healthy levels of new business with our sales teams generating new to television revenue of $35 million, marking an increase of 27% over the prior year. Record first quarter distribution revenue rose 7.5% from the prior year quarter to approximately $668 million, reflecting distribution agreement renewals at the end of '21 on improved terms and rate escalators. Top line growth and our first quarter cash distribution from TV Food Network, owners from our TV new Food Network ownership interest, combined with our expense management, drove record first quarter adjusted EBITDA of $643 million and an all-time high quarterly free cash flow of $560 million. Cash interest expense was approximately $66 million and compared to $68 million last year, due primarily to lower first lien borrowings by approximately $347 million of face value, offset by higher LIBOR of approximately 15 basis points over the quarter and refinancing a portion of missions revolver with which occurred in the second quarter of 2021. Now we recorded $193 million in distributions from equity investments related to our 31% ownership stake in TV Food Network in the first quarter, which represents a $15.3 million increase over the prior year quarter. We expect that Nexstar's cash interest expense to approximate $75 million for the second quarter and $320 million for the year, reflecting updated estimates for LIBOR and expectations for debt repayment. I think sports betting, -- I think I've said this in quarters past, it's just too early and there's just like a lot of different moving pieces with new states coming online and the different operators doing different things in the markets. We think that over time, and that means probably end of this decade, that total revenue from monetization of an ancillary uses of our spectrum we believe could rival current distribution revenue, which for this company, is something north of $2.5 billion this year. But I do think that you'll see once we have -- get the 50% on our own and could reach maybe 90% of the population with a partner or 2, I think then you'll begin to see use cases, and I think that's going to be within the next 2 years."
}