{
    "symbol": "NXST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:40:09",
    "content": " I'm pleased to announce that we booked total net political revenue for the fourth quarter of $260 million, which equates to $500 million net for the year as of today and that represents 103% of our election year 2020 as of election day. While we did experience a slight uptick in the sub attrition rate in the third quarter, we continue to be confident in our ability to grow our distribution revenues even in the phase of MVPD subscriber attribution, given the continued disparity between the percentage fees, the broadcasters get paid versus the continuation of our stations to total viewership and the fact that we also get paid when a consumer moves to a virtual MVPD service. Our resilient local advertising business, our ability to continue to grow distribution revenues and a stellar political advertising year has enabled us to achieve our 2022 objectives despite market headwinds, the absence of Olympics in the quarter versus last year and an increasing interest rate environment. We expect fourth quarter to benefit continuation of strong political advertising trends, which we discussed earlier, while 2023 we'll see distribution revenue upside from renewals of agreements representing more than half of our subscribers. Looking forward, we expect 2024 to benefit from another record year for political advertising, due to the presidential election combined with the benefit of another wave of 2023 distribution agreement renewals for approximately 40% of our subscribers. We generated another quarter of strong operating performance with all-time high record third quarter net revenue of $1.27 billion, reflecting strong year-over-year increases in total advertising revenue, distribution and digital revenues. Total television advertising revenue growth of 18.8% was driven by record third quarter political advertising revenue, which more than offset declines in core advertising, we like other media companies saw. In addition, Nexstar's local sales initiatives continue to deliver healthy levels of new business and our sales teams generated new local television advertising and center program revenues of $36.1 million for the quarter, which was up 4% over the prior year. Record third quarter distribution revenue rose 3.7% from the prior year quarter to approximately $642 million, reflecting distribution agreement renewals in 2021 on improved terms and annual rate escalators more than offsetting subscriber attrition. Together third quarter direct operating and SG&A expenses increased by $28 million or 4%, primarily as a result of higher variable costs related to higher revenues, increased programming and other costs related to the move of NewsNation from syndicated programming to news programming, which is offset in our adjusted EBITDA calculation from reduced programming payments related to syndicated content, as well as a full quarter of expenses from The Hill. We expect Nexstar's cash interest expense to approximate $103 million for the fourth quarter and $326 million for the full year reflecting a continued increasing interest rate environment, net of our recent refinancing and expectations for debt repayment. We also intend to provide investors with supplemental financial presentation including non-GAAP measures for net revenue, adjusted EBITDA and free cash flow that reflect: one, Nexstar's operations excluding the CW and two, the CW operations on a standalone basis."
}