{
    "symbol": "AIRC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 19:00:09",
    "content": " First, after reducing leverage by $330 million last year and $630 million year-to-date through April, we plan to reduce total leverage by another $557 million in the second quarter with proceeds from June's anticipated collection of the Aimco note together with the prepayment penalty. And second, we entered into a $400 million treasury lock in anticipation of a second quarter refunding of currently outstanding term loans with proceeds from a private placement of a debenture whose terms are expected amount of $400 million, expected duration of 10 years and expected pricing of around 170 basis points over the 10-year treasury now locked at 2.39%, 59 basis points below yesterday's closing 10-year rate. And as you know, we designed AIR to be very efficient and so that more of our revenue will flow through to the bottom line of our shareholders and part of that efficiency is maintaining G&A expenses equal to 15 basis points or less of our GAV and for the current year at the original guidance of $17 million, we anticipated not only achieving that 15 basis part - basis point benchmark, but coming in well under that. I guess the way we've thought about it was first the market and at least a number of the analysts and shareholders who spoke to me price the spread income at a low multiple even one times, knowing that would end in two years and we could see that the loan was losing profitability even sooner as higher interest rates narrowed the spread between interest income on the Aimco loan and the interest expense on AIR borrowings to fund the loan. So I was looking at the guidance and specifically juxtaposing it to the pro forma run rate that you provided and I know we talked about this little bit earlier to make sure I understood it, but as I look at this, it seems as though you're - not that you're going to give '23 guidance, but it seems as though you're $0.23-ish cents behind as a starting point when you say - when you remove the prepayment penalty income and also take the full allotment of reduced interest income for the full year. We also will have higher run rate interest cost from fixed in the $800 million of debt - or excuse me, the majority of those cost will run through our numbers this year, but we will have a little bit of our earning next year, so that's why we provided that 219 run rate."
}