{
    "symbol": "AIRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 17:11:03",
    "content": " At this time, I would like to welcome everyone to the Air Communities Second Quarter 2022 Earnings Conference Call . I would now like to pass the conference over to our host, Lisa Cohn, President and General Counsel of AIR Communities. My name is Lisa Cohn, and I am President and General Counsel of AIR Communities. During this conference call, the forward-looking statements we make are based on management's judgment, including projections related to 2022 expectations. Prepared remarks today come from Terry Considine, our CEO; Keith Kimmel, President of Property Operations; John McGrath, our Co-CIO and Chairman of our Investment Committee; and Paul Beldin, our Chief Financial Officer. Thank you, Lisa, and thanks to all of you for your interest at AIR. In the past few months, AIR has largely completed its separation from the old Aimco 18 months ahead of schedule. At AIRâ\u0080\u0099s IPO, 12% of AIR NAV was entangled with Aimco, now it is less than 30 basis points. The acceleration of the Aimco note and the cancellation of the Aimco master lease of four properties created noise in the quarter, making modeling more difficult, but they are important milestones in simplifying AIR'S business, which is growing steadily. With the separation from old Aimco now behind us, we can see more clearly what AIR will be. We can see the strength of the AIR operating platform, what Keith calls the AIR Edge. For example, challenged by inflation, peers increased second quarter operating expenses year-over-year by almost 5%. Our emphasis on customer selection and satisfaction results in stable communities with good neighbors and peer leading margins, coupled with low G&A, AIR enjoys the highest conversion of rent to free cash flow. Thanks to Paul, AIR has low financial leverage with limited refunding and repricing risk. But the business model also has none of the supply chain risks and ongoing cash requirements of unfinished developments, and no need to replace the runoff of maturing loans, as is the case with lending programs. And after reinvestment of more than $1 billion, our excellent portfolio is now even better. Average monthly rents approached $2,600,  among the apartment REITs. But more important to shareholders, the properties purchased have expected returns 50% greater than the properties we sold to fund their purchase. And when considering investments, we regularly compare our proposed purchase to the buyback of AIR shares. And in the second quarter, we purchased about 3 million shares for $125 million. When we look inside the business of AIR, we see no sign of recession, none, not now. Our balance sheet is not exposed to higher interest rates or near term maturities, we have no buildings to finish, we have no lease-ups to complete. In the second quarter, Keith and his ops team delivered outstanding results. The momentum earning of leases made this year and lost to lease releases to be made next year, plus their remarkable ability to manage costs through productivity suggest that next year will also be a very good year. Paul will report on our balance sheet and why tax characteristics make the dividend on Aimco shares especially attractive to individuals, C corps, foreign investors and all who are interested to reduce income taxation. Patti Shwayder has been called away by family duties of a happy nature, so Lisa will be her backup, ready to report on our recently published targets based on the UN sustainability goals and our commitment to measurement and public reporting of our ESG undertaking. Lisa may also express our gratification that AIR teammates high engagement exceeds the Kingsley Index, rising when others are falling, and perhaps one reason for another Kingsley report, this one that AIRâ\u0080\u0099s ranked first among public apartment companies and second among all apartment companies for customer satisfaction. And I thank my colleagues on the AIR Board, you're remarkable, engaged and committed to making AIR excel. With that, I'd like to turn the call to Keith Kimmel to discuss our operating results. The second quarter was outstanding with over 80% of our leasing volume now complete for the year, I'd like to share a number of takeaways. First, rate performance is historically strong with leading indicators pointing towards elevated lease-to-lease performance in the second half of 2022 and into 2023. Renewals were up 10.6%, leading to a blended average increase of 14.1%. In July, rates strengthened further with new leases up 20.4% and the blended average up 16%. Looking forward, our loss to lease remains above 10% and indicates transacted rates will remain strong for the balance of 2022 and into next year. Average daily occupancy in the second quarter was 96.8%, up 160 basis points from last year. By design, we saw sequential declines in average daily occupancy associated with higher move-out volumes during the summer leasing season, a trend which peaked in July and will reverse in August. Third, AIR is the most efficient multifamily operator. Our approach starts first with resident selection and world class customer service, which led to a record low trailing 12 month turnover of 38.4%. In the second quarter, expenses were up 10 basis points year-over-year with controllable expenses up 2.7% due to timing of increased maintenance of communities, offset by lower taxes and insurance. We focus first on avoidance of cost, using process design, investment or technology to remove the cost altogether. All that said, for the full year, controllable expenses will be on plan, roughly flat to last year. Our efficiencies are realized in net operating margin, which for the second quarter was 73.6%, up 310 basis points from one year ago. Fourth, the AIR Edge, when applied to newly acquired communities, is a tremendous engine for growth. Our five 2021 acquisitions are expected to have revenue growth 600 basis points above our stabilized portfolio in the fourth quarter, the first time period we have a year-over-year comparison. The AIR Edge transforms the entire operation, strengthening the customer relationship, sharpening the team's approach, implementing our technology platform for efficiency and improving the physical community. This leads directly to pricing power, with weighted average lease to lease increases up 26% in the second quarter that further increased to 28% in July. Our 2022 acquisitions, Coconut Point in Estero, Florida, Watermark in Miami, Willer Towers in Chevy Chase, Maryland and now, the district at Flagler and Fort Lauderdale are off and running with the implementation of the AIR Edge well underway. And finally, the business activity happening today is not only securing a blockbuster 2022 but earning into strong performance in 2023. Eventually, the tailwinds that AIR and the industry are experiencing will subside. My thanks to all the AIR team members, your dedication to serving our residents and your drive to continuously improve our business have made this quarter a great success. With that, I'll now turn the call over to John McGrath, the Chairman of our Investment Committee. Since the separation with Aimco, the AIR portfolio has been materially enhanced in terms of quality, risk and capital allocation. Over the past 18 months, we completed $3.1 billion of transactions, $1.7 billion of equity sources, $1.4 billion of which was used to acquire nine properties located in South Florida and Washington, D.C. And we currently have another $500 million of sources and $200 million of uses under contract. Our sales supported the deleveraging efforts, which Karl reported on in the past, improved the quality of the portfolio as measured by criteria such as rents, age and physical condition and reduced concentration risk and regulatory exposure. Through acquisitions, we invested in high quality properties, which will benefit from the AIR Edge, and we reallocated capital to some markets that exhibit high growth due to durable demand factors and constraints on competitive supply. In effect, our portfolio is bifurcated into a fast growing same store portfolio and an even higher growth AIR Edge portfolio. Today, the AIR Edge represents about 11% of the portfolio. Over time, we expect the allocation to increase to approximately 30%, provided we can find opportunities which produce an attractive spread over our cost of capital and are within leverage policy. Before reporting on our second quarter transactions activity, allow me to offer a few thoughts. Having lived through the recession of 2001, 2008, '09 and 2020, AIR's seasoned investment professionals have the real world experience to navigate choppy waters, which may lie ahead. Despite market uncertainty, we see the opportunity to make profitable trades, and we remain focused on the continued systematic enhancement of our portfolio through disciplined accretive growth funded by paired trades. Simply put, AIR is in the spread business. While we do expect future transactions to be highly accretive, we will only transact when we can earn an attractive spread over our cost of capital, be within our leverage policies and are able to deploy the AIR Edge. During the quarter, we raised equity capital through a sale of fortuitous timing and pricing of four of our lower ranked properties located in California and Virginia for approximately $203 million. On top of these sales, we have another $500 million under contract with nonrefundable deposits. We invested $467 million to acquire three properties located in the Washington, D.C. metro area and in South Florida. And as previously announced, we entered into an agreement with Aimco for the cancellation of its master lease of four properties for $200 million. Additionally, earlier this week, we acquired one property located in South Florida for $173 million. In accordance with our investment policies, these acquisitions are expected to earn IRR spreads of at least 200 basis points over our cost of capital, are leverage neutral and will be enhanced through the AIR Edge. Today, I will discuss our strong and flexible balance sheet, second quarter results, our expectations for the balance of the year and conclude with a brief comment on our dividend. We made significant improvements to the balance sheet during the quarter, the details of which can be found in our earnings release. While we target a leverage-to-EBITDA ratio of 5.5:1, we expect that the actual ratio will vary from quarter-to-quarter based on the timing of transactions. As part of our paired trade discipline, we seek to keep our sources and uses in balance, rarely does the timing of the transactions align such that our sources and uses are in perfect balance at quarter end. For example, today, we are slightly out of balance due to the $125 million of second quarter share repurchases and the July acquisition of the district at Flagler. We expect that the imbalance will be completely eliminated before year end by the closing of the $550 million sale of properties, $500 million of which are under contract today. Second, our balance sheet is insulated from interest rate volatility and any potential economic slowdown. 98% of our leverage is fixed, with rates and maturities fixed for about the next seven years. In fact, only $205 million or about 7% of our leverage is subject to repricing in the next 30 months. Third, we have abundant liquidity with $840 million available on our revolving credit facility, $84 million of cash and properties unencumbered by debt with an estimated value of almost $8 billion. Second quarter FFO was $0.66 per share, $0.01 above the midpoint of guidance, pro forma the timing of the Aimco note repayment. Instead, approximately 30% of the payment was deferred into July, the effect was to shift $0.03 of the prepayment penalty from June to July. The aggregate prepayment penalty was approximately $0.035 below our expectations, a result of short term treasuries increasing significantly more than forecast. With the payment of the Aimco note, it was no longer necessary for AIR to maintain this ownership position. Looking forward, we are narrowing our expectations for our full year FFO to be between $2.38 and $2.44 per share, maintaining the $2.41 midpoint. Primarily, our expectations for run rate FFO, which is pro forma FFO, excluding the earnings effect of the Aimco note and the gain on sale of the cost basis investment, is also unchanged at $2.19. Relative to one quarter ago, we now expect $0.03 of incremental FFO from stronger NOI growth in our same-store and acquisition portfolios, offset by $0.02 of lower contribution from the cancellation of the four Aimco leases and $0.01 of other items. As Terry commented in his remarks, first 18 months of AIR's existence has been a period of transition during which the vision and promise of the AIR business model was implemented. With deleveraging complete and entanglements between AIR and Aimco greatly reduced, simplicity of the AIR business model is clear. Best-in-class property operations, delivering strong operating results from our same-store portfolio and even faster growth from our acquisitions as they benefit from being added to the AIR operating platform and low G&A results in predictable, high quality income and faster earnings growth. Lastly, the AIR Board of Directors declared a quarterly cash dividend of $0.45 per share. For example, in 2021, two thirds of AIR's dividend was a tax-free return of capital, while the remaining one third was taxable at capital gain rates. In the same year, approximately 60% of peer dividends were taxed at ordinary income rates with the remaining 40% taxed to capital gains. If you step back, obviously, you've articulated a lot of the go forward positives for the AIR company as well as portfolio, your stock is at the lowest multiple on  the FFO or FFO any, which way you measure it. But what I would say is that what we have set out to do and I think have accomplished is a business model which deserves a very favorable risk premium, a very low risk because we don't have the travails of development today. And if you look at the last many years, Keith and his team have excelled at doing just that. To be fair, Terry, a number of these shouldn't have been an issue for when AIR was created. And so a lot of what you call entanglements, the loans, the fact that you were too highly leveraged coming out of the box, the fact that you didn't have an ATM and had to go issue direct equity at a big discount, and while the balance sheet sits today, let's not forget, it wasn't and that was a risk that the company took. I need a little bit more from you in terms of the stocks at a big discount, reflective of the fact that you purchased stock in the quarter at 43, good execution. If you look at the TSRs for the seven large apartment REITs, the two Sunbelt REITs have done the best, but the AIR AID combo has outperformed handsomely the remainder. So it gives you a couple of data points to know that we think that we're going to have a strong 2023, and we have more strength as we finish up the balance of this year. So you started mid-4s and then you have this loss to lease, which could go up or down depending on the market, but the starting pointâ\u0080\u0099s 4 with some upside essentially is what you're saying. Second question is, you talk a lot about AIR Edge, and I appreciate the the terminology and all that. But I think all of your peers have their own version of AIR Edge, and that's what makes you kind of separate from the pack. The second thing, with an advantage also in G&A, more of that gets through to where it can be either distributed to or invested for the benefit of shareholders. In response to our expense expectations we did -- for our expense expectations, we did both narrow our range for expected growth and reduced the total growth at the midpoint by 25 basis points. But also, it reflects the fact that we're now halfway through the year and we have greater visibility into the items that are outside of that bucket, most notably real estate tax expenses where we've had a good year-to-date where we're actually negative 2% on a year-to-date basis. And we expect that for the full year, real estate tax growth will be quite moderate, maybe in the 1% to 2% range. And so through that we get, as you point out, lower repairs and maintenance costs. So it's the combination of, one, having low turnover, but having high rents on both new and renewal rates and ultimately, avoidance of cost to find its way all the way down to margin and the cash that comes through. I'll first start by saying when we think about cap rates, first, comparing them to an imprecise science. But with that said, we've seen the cap rates across the board have expanded about zero to 25 basis points on core assets and about 25 to 50 basis points on noncore assets. Valuations, we're seeing about 5% to 7% down. As far as the bid-ask spread, what I'd say on that is, if I use, for an example, the  we have in the market, including the $500 million we have under contract today, we're not seeing a big bid-ask spread. And so as we look at our second quarter bad debt, our bad debt expense, on a net basis, was about 20 basis points of revenue, which is in line with our typical long term results. So if you look at bad debt as we do before those payments, that was about 1.9% of revenues. And as we are projecting to the balance of the year, we're not assuming that our bad debt experience is going to get any better in order to make our guidance."
}