{
    "symbol": "VXRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 19:50:31",
    "content": " Before we get started, I would like to remind everyone that this conference call -- that during this conference call, Vaxart may make forward-looking statements, including statements about the company's financial results, financial guidance, its future business strategies and operations and its product development and regulatory progress, including statements about its ongoing or planned clinical trials. Second, the data we have produced so far across our multiple programs, suggests that our vaccine candidates also trigger mucosal immunity, and that our vaccine platform has the potential to offer advantages over injectable vaccine in four areas, broad cross reactivity against variance, reduction in viral transmission, longer protection, and the more benign tolerability. For example, in the Phase 1 study of our S+N COVID-19 vaccine construct, 46% of the subjects had a 1.5 fold increase or better against SARS-CoV-2 in the nasal IgA responses and all these responses are highly cross reactive against all the Coronavirus we tested again, not just SARS-CoV-2 but some really divergent Coronavirus as a beta and the alpha families. Here's some of the highlights of our data, in our Phase 2 challenge study, and then analysis conducted by BARDA, there was an 80% chance of our oral vaccines significantly reduce viral influenza shedding better than an injected commercial influenza vaccine. In June, we reported positive preliminary data from a Phase 1b trial of our norovirus vaccine candidate in subjects aged 55 to 80 years, which showed stimulation of robust immune responses across all doses with a dose dependent production of IgA antibody secreting cells. One of the things I did want to point out is that we did see some strong cross reactive responses against Omicron in that Phase 2 study both in serum and mucosae, and certainly that is weighing on us a little bit from the standpoint of making decision of how to next steps and looking at efficacy in that Omicron challenge. And I think that's one of the reasons why you see uptake in vaccination with the new Omicron or bivalent vaccines being so low because especially here, but we're really not sure how these are going to protect against emerging variants. Having said that we have no idea it could be higher as well, but RX and -- and again there's one challenge study that's been published that was successful, but leukocyte and G11 that was done several years ago, and I believe the efficacy on that vaccine was about 40% some odd. This one's coming in about the workshop, Sean's is going to come to you that you're just in the midst of doing a note of the November 7 workshop on mucosal vaccines for COVID that Dr. Tucker is speaking as it seems like a fantastic forum to educate the scientific community and pandemic preparedness community on the benefits of vaccines, candidates, create some buzz for the company, it would seem natural to alert investors and Wall Street to this."
}