{
    "symbol": "VXRT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 20:51:01",
    "content": " These milestones have the potential to support the continued advancement of the Norovirus program towards the Phase 3 trial, while also providing further validation of the promise of our oral pill vaccine platform. To showcase our differentiated Norovirus program and bivalent candidate, I am pleased to announce that we will be hosting a virtual key opinion leader call on March 28 at 1:00 P.M. Eastern Time, with several leaders in the Norovirus vaccine development. As stated in this afternoon's press release, a key component of our prioritization of the Norovirus vaccine program, is the expansion of the ongoing Phase 2 GI.1 Norovirus challenge study to include additional challenge cohorts. As announced last month, we initiated and dosed the first subject in the Phase 2 dose-ranging study of our bivalent norovirus vaccine candidate, a critical next step in advancing this promising candidate to a Phase 3 clinical study. Moreover, based on the substantial mucosal cross-reactivity data reported to-date from the Phase 1 and Phase 2a studies of our COVID-19 vaccine candidate, we believe that we may be able to potentially create an oral pan-betacoronavirus vaccine. These milestones include, reporting top line data from the ongoing Phase 2 dose-ranging study of our bivalent norovirus vaccine candidate in mid-2023. Reporting top data from our ongoing Phase 2 channel study, for our G11 monovalent norovirus vaccine candidate in Q3 2023. Finally, as I mentioned earlier, we will host a virtual key opinion leader call on March 28, at 1:00 p.m. Eastern time that will illustrate the differentiated nature of our norovirus program and our bivalent vaccine candidate. So we really believe that we have one of the leading norovirus vaccine candidates, and it's important to emphasize that, and our decision to focus on the norovirus program followed an extensive strategic review of our business and a review of our entire pipeline candidates, including looking at what would be the fastest path to commercial product for us, as well as the most efficient way for us to maximize our current resources. So we believe we have key catalysts that would really drive the potential interest in our stock price in the next two quarters, as we mentioned earlier on this call, those costs do include a top line data readout for our Phase 2 dose-ranging study as well as the top line data for our Phase 2 challenge study for norovirus."
}