{
    "symbol": "DRI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-24 10:15:17",
    "content": " Your line is open, please go ahead. While 6% seems high on -- in terms of how historically we price, considering the environment and considering what we're pricing over two years, we don't think it's too much. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. We don't think the pricing actions that we have taken are going to change that dramatically because we're still, as Raj had mentioned, much lower than most full-service restaurants combined over a two-year period. Your line is open. Your line is open. Your line is open. And as things slow down a little bit, it's just -- it's not -- I just don't see companies, especially where the supply chains have been somewhat broken and inventories levels are low, I don't see us getting to a higher -- a significantly higher unemployment level anytime in the near term, barring something really happens bad with what's going on overseas. Your line is open, please go ahead. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open, please go ahead. My question was on the idea that the pent-up demand post-COVID itself and not just Omicron, and given all the -- how data-intensive you are, I'm wondering if you can share any data on how many -- whether you're seeing consumers come back in that haven't come in, in a couple of years, maybe how material that is, whether you're really seeing a shift in consumers kind of more post-COVID. I think as investors are concerned about what gas prices might be doing to consumer, it's higher prices in different regions and specifically in the West Coast, whether you're seeing any kind of more pronounced near-term impact as you think about maybe your quarter-to-date trends, whether there's much variability there. Your line is open."
}