{
    "symbol": "HUT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 13:41:26",
    "content": " In our first full quarter generating fee-based monthly recurring revenue through our 5 data centers and an increased mining capacity that grew to 2.78 exahash by June 30, we generated strong quarterly revenue while also increasing our Bitcoin holdings. Our long-term vision is to generate enough revenue from our high-performance computing business and working the stack to fund our digital asset mining operations without being reliant on capital markets, which can be both expensive and at times unreliable. This performance was driven by strong digital asset mining activity with a solid contribution from the first full quarter of operations from the high-performance computing business, which we acquired earlier this year. Our newly acquired data center business contributed an additional $4.7 million of revenue, reflecting a full quarterâ\u0080\u0099s worth of revenue since we acquired the business at the end of January 2022. Within the digital asset mining operation site operating costs increased by $10.8 million driven by electricity costs, which stemmed from a combination of higher power prices and a modest increase in consumption. In terms of margins, our digital asset mining operation generated mining margins of approximately 38% versus 62% in the prior year period, reflecting the combination of lower Bitcoin prices and the increased electricity costs. Hut 8 achieved adjusted EBITDA of $6.8 million for Q2 2022, reflecting our ability to maintain profitability despite a challenging macro environment for digital asset mining. Itâ\u0080\u0099s a very unique position for us to be in to have this full stack of infrastructure from mining all the way up two Tier 3 traditional data center assets, which really allow us to provide infrastructure for that Web 3 ecosystem thatâ\u0080\u0099s unique in the space for us as a digital asset native company. Yes, looking at sort of our thinking around and explorations around how we reengage around working the stack, I guess maybe more specifically, that would mean from our perspective generating yield, generating income associated with our substantial and unencumbered Bitcoin holdings So, yes, that will range from sort of direct yield programs very similar to what we have done in the past, to explore more sort of algorithmic approach to trading against a small portion of our stack, perhaps."
}