{
    "symbol": "ALHC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 22:35:21",
    "content": " And again, it's really on the back of that strong year-to-date performance that we're comfortable making a few of those investments today, that are the things we might have otherwise made in the future, but we have the opportunity to kind of really go after them here and now. Beyond the kind of investment in the sales and marketing season, which happens every year, I think you heard a bit from John in his prepared remarks just really describing a lot of our focus these days on the ground game and making sure that the investments we made more recently in some of our provider engagement resources and our community representatives are continuing to help us gain traction not just for this year's enrollment period but also looking out towards the 23 AEP season. And so that's been our experience in the past and it's kind of how we underwrite our investment cases, looking out to not just Florida and Texas but even some of the contiguous county expansions within California as an example that we're really excited about for next year. I'm not sure we're going to kind of break down all the moving pieces, but I think if you kind of look at the gross profit beat in the second quarter relative to the full year raise, again obviously, part of that sort of extra conservatism in the back half gross profit I think relates to COVID but then a portion of that is certainly the investments themselves. But in general, again, I think we're very focused on making sure that we're kind of deploying capital in a way that is very mindful of our short-term profitability objectives, but also making sure that we're doing the right thing and setting ourselves up for success and value creation over the next kind of one, two, three plus years. But as we think about -- and we're making investments now in 2022 about the 2023 new markets, but as we head into 2024, we're going to be -- bars going to be pretty high in terms of adding new states out there, just because the TAMs in the existing states are so big and the new market contiguous counties are so big. And I also think that like you're going to see us have more kind of in-state joint ventures, in-state co-branding opportunities, kind of in-state just kind of large partnerships with different providers and hospitals this past couple of years we've announced, I guess, Scripps and Hoag and Seeders and Sutter, all these big strong wonderful delivery systems that want to partner with us and we want to partner with them."
}