{
    "symbol": "WE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 13:59:08",
    "content": " Systemwide gross debt sales, which includes new debt sales as well as renewals, were $211,000 in the first quarter or the equivalent of 12.7 million square feet sold. System-wide new sales were $106,000 in the first quarter and consolidated new sales were $83,000 in the first quarter, equating to 6.3 million and 5 million square feet sold, respectively. At the market level, WeWork's Q1 2022 gross sales in Manhattan and San Francisco, were equivalent to 17% of the traditional office market leasing on a square foot basis, while WeWork's portfolios of 5 million square feet in New York and 2 million square feet in San Francisco account for approximately, 1% of total office stock in the two cities. All Access revenue for the quarter was $36 million, based on 55,000 All Access memberships at a Q1 ARPM of $235, yielding an annual run rate revenue of $155 million as of March. The strong increase in physical memberships, combined with a stable ARPM and continued increase in All Access revenue resulted in the total revenue of $765 million in the first quarter, which exceeded the high end of our $740 million to $760 million prior guidance by $15 million from the midpoint of $750 million. First quarter revenue of $765 million increased $47 million or 7% quarter-over-quarter and 28% year-over-year, driven by a 7% increase in physical memberships and a 24% increase in WeWork Access revenue versus the fourth quarter. Building margin was positive $34 million in the first quarter, a $43 million improvement quarter-over-quarter and a $243 million improvement year-over-year. Adjusted EBITDA loss was $212 million, driven by a $47 million  revenue improvement and a $43 million expense reduction for a total $71 million improvement relative to the prior quarter. The key components bridging from net loss to adjusted EBITDA in the first quarter include, $171 million of depreciation and amortization, $147 million of interest and other expenses, and $13 million of stock-based compensation, partially offset by a $39 million net gain from restructuring and impairment expenses related to the write-off of lease right-of-use assets associated with our portfolio rationalization activities. We ended the first quarter with approximately $1.6 billion in cash and commitments, which includes $519 million of available cash on hand, $550 million available of senior secured notes that we can issue and $550 million of capacity under our letter of credit facility. Today, we are pleased to announce the amendment of WeWork's $1.75 billion letter of credit facility, which is now subdivided into a $350 million junior LC tranche and a $1.25 billion senior LC tranche. We expect the second quarter revenue to be between $800 million and $825 million, which is a tightening of the range of $775 million to $825 million, we provided on our Q4 earnings call, hence, taking the midpoint up by $12.5 million from $800 million to $812.5 million, and also expected adjusted EBITDA of between negative $125 million and negative $175 million. Your line is open. Pro forma for the LC amendment, this amount decreased by $500 million of unused LC capacity, which is mostly offset by our immediate access under the junior tranche to $350 million, arriving at a pro forma liquidity balance of $1.5 billion for Q1. Additionally, as a result of the LC amendment, we unlocked $500 million of senior -- I'm sorry, a secured debt capacity that had previously been allocated to unused LC capacity, bringing us to a total pro forma balance of almost $2 billion. And adjusting the almost $2 billion for a negative $225 million of adjusted EBITDA, $200 million of cash interest and $175 million of net CapEx, we now expect to have approximately $1.4 billion in total liquidity at the end of 2022. Your line is open. I think if you look at that Slide 13, we end at that $1.6 billion cash and commitments at the end of Q1 and so for the LC amendment, if we wanted to make that adjustment, this amount decreases by $500 million of unused LC capacity, which is mostly offset by immediate access under the Junior LC tranche of the $350 million that gets you to the -- I guess, $1.469 billion for Q1 2022. And then again, just reiterating the point I made earlier, so if we take that going forward, adjusting the almost $2 billion of pro forma liquidity and capacity, you then look at $225 million negative adjusted EBITDA for the balance of the year as well as $200 million of cash interest and $175 million of debt CapEx. It sounds like FX is mostly a non-event, but obviously, there will be some translation impact to free cash flow, where do you think cash balance will -- I mean, are we going to see cash drop another $500 million in the second quarter, or where is cash going to go clipping. It should be -- the actual cash balance at the end of the year, if you take the $1.4 billion, take out the $500 million of unused capacity, take out $350 million of the junior tranche is about $500 million. Your line is open. Your line is open. And I think in the last call, I said that effectively, we'll get to that $3.4 billion, $3.5 billion of revenue for the full year, which equates to sort of that $900 million to $1 billion of revenue in Q3 and Q4. Your line is open. Your line is open. Your line is open."
}