{
    "symbol": "WE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 13:45:24",
    "content": " At actual foreign exchange rates, revenue was $815 million, an increase of 7% quarter-over-quarter and 37% year-over-year. The system-wide revenue was $938 million, an increase of 7% quarter-over-quarter and 41% year-over-year. First, total revenue was $815 million, up 37% year-over-year driven by increases in physical memberships and All Access memberships. Next, our adjusted EBITDA loss in the second quarter was $134 million, a $78 million sequential improvement from Q1 and over $300 million better than last year due to higher revenue and careful management of our expenses, including our SG&A, which declined 17% year-over-year. Our free cash flow for the second quarter was negative $298 million, a $114 million sequential improvement from the first quarter driven by improved operating performance, lower cash restructuring and select asset sales partially offset by higher CapEx. And finally, we are affirming our annual revenue guidance of $3.4 billion to $3.5 billion and our adjusted EBITDA guidance of negative $400 million to $475 million, both excluding the impact of FX on our budgeted FX rates, as we've said previously. So we believe, again, between the cash on hand, between the undrawn $550 million line, we have a senior secured line with SoftBank, as well as we put the $500 million of available capacity under -- a senior capacity under our bond indenture, now granted we would actually have to go out and issue that, we think between those 3 sources is more than sufficient to carry us for the next year. As Andre said, that we have $300 million of cash by year-end, and so if it's a $50 million to $100 million loss, you'll still end the year with $200 million of cash by year-end plus the $550 million of SoftBank money. So you've got $750 million before we even have to think about going to the market, so there's enough liquidity to carry us through all the way to the end of 2023, quite honestly. And if you just do the math, right, I mean, again, I'm just doing the top of my head, right, so if you drew the entire $550 million, which youâ\u0080\u0099re not going to do but let's just say you did that, we've done about $35 million, $40 million of interest for the year, so it's not material. As I said to you previously, we sort of tap out in between 75,000 and 80,000 members because of capacity, so I've challenged the team to figure out ways to increase capacity, so we can take that to 100,000 or so members and we can increase revenue on All Access to over $300 million."
}