{
    "symbol": "INSM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 13:38:03",
    "content": " At this time, I would like to welcome everyone to the Insmed Third Quarter 2022 Financial Results Call. Good morning, and welcome to today's conference call to discuss our third quarter financial results for 2022, and to provide a business update. Before we start, let me remind you that today's call will include forward-looking statements based on current expectations. Such statements represent our judgment as of today, and may involve risks and uncertainties that may cause actual results to differ materially from the results discussed in the forward-looking statements. Please refer to our filings with the Securities and Exchange Commission, which are available through the SEC's website at www.sec.gov, or from our website for information concerning the risk factors that could affect the company. The information on today's call is not intended for promotional purposes, and it is not sufficient for prescribing decisions. Joining me on today's call are members of the Insmed executive management team, including Will Lewis, Chair and Chief Executive Officer, and Sara Bonstein, Chief Financial Officer. Insmed's business is currently comprised of four pillars, ARIKAYCE, Brensocatib, TPIP, and Translational Medicine. The third quarter of 2022 marked a major turning point for Insmed, as we advanced revenue growth, clinical trial enrollment, and secured meaningful financing. With approximately $1.3 billion in capital, we are now fully resourced to realize numerous clinical trial readouts from each of our four strategic pillars. Specifically, data from the frontline NTM program, Brensocatib in bronchiectasis, Phase 2 data from TPIP, in addition to anticipated IND filings, and preclinical and clinical data from our fourth pillar. Before providing detailed updates on our four pillars, I want to take a moment to discuss the recent financing. The strategic rationale of the financing was to raise needed capital to achieve our ambitious objectives, to mitigate some of the macroeconomic and geopolitical risks that continue to weigh on the markets, and to protect ourselves strategically as we advance our four pillars. Rather, it places us in an enviable position against the backdrop of one of the more difficult market environments in recent history. Our aim was to catapult us past these concerns, and place us in a strong financial position in the future when we have what we hope will be positive results from each of our four pillars. We feel very good about the future of this company and the meaningful catalyst this financing will support, and that should be the takeaway message of these transactions. Sara will cover revenue in more detail, but the key takeaway is that our third quarter global revenue results were strong. We saw continued ARIKAYCE growth in the US, and despite COVID and foreign exchange headwinds in Japan, the region still meaningfully contributed to global revenues. I remain very pleased with the performance of the commercial team globally, even as preparations are already underway for additional potential launches, including ARIKAYCE for Frontline NTM, and Brensocatib for bronchiectasis, if approved. Now, let me provide more detail on the clinical development activities within each of our four pillars, starting with the ARIKAYCE Frontline clinical program, which consists of ARISE and ENCORE, two global trials running in parallel. We believe results from these trials, if favorable, will support full FDA and select international approvals of ARIKAYCE for newly diagnosed MAC NTM patients. In the US in Japan, our two largest geographies, the number of newly diagnosed patients with MAC NTM, is approximately 115,000, and 145,000, respectively. While we work to refine those who are appropriate for immediate treatment, should we secure frontline approval, by any calculation, the expansion into Frontline would represent a multifold increase in our current addressable market. To remind you, our goal with the ARISE data is, first, to demonstrate that the PRO is valid and responsive. Next, we will examine the entire dataset, comparing the treatment and non-treatment arms using the PRO, as well as culture conversion, and other important measures. We remain on track to complete enrollment in the ENCORE trial before the end of 2023, and look forward to updating you on the pace of enrollment as we move forward. Additionally, with the ARISE data, we hope to have a clear understanding of the likely performance of ENCORE. Should adjustments be necessary to ENCORE, we will have the time and opportunity to do so before the data readout, increasing our likelihood of success in this registrational study. I'll now turn to our second pillar, Brensocatib, an oral DPP-1 inhibitor that we believe has enormous potential to treat an array of neutrophil-mediated diseases, thereby representing a potential pipeline in a product. If successful, we believe Brensocatib could be a groundbreaking addition to the anti-inflammatory treatment landscape. We are working to build a platform around this first-in-mechanism approach, and have settled initially upon four separate indications to pursue clinically, bronchiectasis, cystic fibrosis, or CF, chronic rhinosinusitis without nasal polyps, or CRS, and hydradenitis suppurativa, or HS. Starting with bronchiectasis, the encouraging pace of enrollment in our Phase 3 ASPEN trial continues, giving us confidence in our estimate of completing enrollment before the end of the first quarter of next year. With this target in mind, we are excited to share our expectation of topline data from the ASPEN trial in the second quarter of 2024. In addition, I am pleased to report that the third meeting of the Data Safety and Monitoring Board, or DSMB, occurred earlier this week where it was determined that the ASPEN study should continue as planned. If Brensocatib is approved by regulatory authorities for use in treating bronchiectasis, we plan to target approximately 1 million bronchiectasis patients at launch in three key geographies, the US, Europe, and Japan. Though bronchiectasis is a broader opportunity than NTM, the synergies between these indications are significant, and we expect to benefit from the overlap in call points, and be able to leverage much of the commercial infrastructure between these indications. The Phase 2 PKPD study is advancing as planned, and we remain on track to have topline data by the end of this year for both patients on CFTR modulators, and those not on CFTR modulators. Recall that CF represents another sizable market opportunity, with an estimated 70,000 total diagnosed patients worldwide, and nothing approved to treat reduction of exacerbations in this population. As previously shared, we have identified two indications for further clinical development, CRS and HS. Importantly, like NTM in bronchiectasis, CRS is another condition where there is nothing approved for treatment. Our third pillar is TPIP, a treprostinil prodrug in Phase 2 development for pulmonary hypertension associated with interstitial lung disease or PHILD, and pulmonary arterial hypertension, or PAH. The work we are doing in this pillar will become increasingly important to Insmed's long-term strategic vision, as it reflects compounds and technology platforms with the potential to have a profound impact on patients in the rare disease space. From this pillar, we intend to generate on average one to two INDs per year for the next several years. This pillar includes a world-class gene therapy group, in addition to novel methods of manufacturing that, if successful, we expect would lower the cost to produce gene therapies multifold. In addition, we are making progress using artificial intelligence and advanced capabilities in protein engineering to attempt to deimmunize the actual AAV caps used to dose patients with gene therapy, potentially enabling us to redose patients. Finally, unrelated to gene therapy, we also have ongoing efforts pursuing specific deimmunized therapeutic proteins, where patients would benefit from redosing. As an outcome of our financing activities last week, we are in the strongest cash position in the company's history. Earlier today, we issued a press release with our detailed third quarter financial results, all of which are aligned with our internal expectations. As reported this morning, we ended the third quarter with $513.3 million in cash and cash equivalents, and marketable securities. Subsequently, following the completion of our financing last week, we more than doubled our cash position, resulting in a pro forma balance of approximately $1.3 billion in cash and cash equivalents, and marketable securities. We have and plan to continue to manage this strong balance sheet, with a sharp focus on cash preservation, while mindfully investing in our pipeline. In the third quarter of 2022, total net revenue for ARIKAYCE was $67.7 million, demonstrating the strongest quarter of sales since ARIKAYCE launched. Notably, total net revenue in the third quarter showed a 45% increase versus the third quarter of 2021. On a regional basis, net revenue in the third quarter was $49.5 million in the US, $14.5 million in Japan, and $3.7 million in Europe and rest of world. Specifically, in the US, we saw a 29% increase over prior yearsâ\u0080\u0099 third quarter performance, showing continued overall growth in our largest market. And this, along with heightened physician suspicion of respiratory disease, could yield greater identification of appropriate patients who may have delayed their treatment during COVID. Finally, we continue to see a trend in patients restarting their therapy. In Japan, we saw meaningful contribution, representing more than 20% of our overall global ARIKAYCE revenue. While we faced two headwinds in Japan in the third quarter, COVID restrictions, and the impact of foreign exchange rates, we remain very pleased with the fundamental performance from this market, and look forward to building on this strong foundation. We continue to anticipate a more modest revenue contribution from Europe relative to the US and Japan, and our commercial operations are scaled to reflect this. Importantly, Europe continues to be a key territory for clinical trial work, thought leadership engagement, and medical affairs activities. With a demonstrated track record of success, and a favorable growth profile, we believe there's opportunity for further ARIKAYCE growth globally. We've clearly exceeded our revenue guidance of more than 30% for 2022, and we look forward to ending this year in this position of strength. Although the uncertainties of COVID and foreign exchange rates had a meaningful impact on the year, we are hopeful that these headwinds will be less prominent in 2023. In the third quarter of 2022, our gross to nets in the US were approximately 11%, which is in line with our guidance of mid-teens throughout 2022, and consistent with gross to nets in prior years. In the third quarter of 2022, research and development expenses were $99.9 million, and SG&A expenses were $75.6 million, reflecting the support of our ongoing clinical trials, and the commercial infrastructure for ARIKAYCE. In closing, Insmedâ\u0080\u0099s tremendous balance sheet strength provides us with ample runway at a crucial time as we continue executing across all of our pillars. Hopefully, from today's call, you can see how we have deliberately established the pieces to bring about this achievement. This quarter, we made another important step forward on this path, and we are now positioned and resourced as never before, supported by a team that is motivated to do the right thing to bring medicines to patients with serious and rare diseases. I would like to thank the patients who participate in our studies, the caregivers and families who support them, the Insmed team, and those who have sponsored us financially. Actually, I think it's really hard to answer that with any great clarity because the uncertainty that surround both of those variables. What I will say is that the performance side of Japan, at a fundamental level, the ability to have the product have impact on patients and the perception of physicians about its utility, is really strong. Clearly, it's on, at the moment, a down slope, but it still takes some time to regain access to physicians and hospitals. And as far as FX goes, I don't think anyone would've expected us to be at 147 to the dollar, or wherever we are today. We just don't know, and that makes it very difficult to sort of forecast with any accuracy or confidence what's going to happen in Japan. Yes, so the - as to the second question, that's really why we broke it out that way. I don't know that there is a reason to expect there to be, but of course, that market is segmented by those who are able to benefit from CFTR modulators and those who are not. Importantly, there's nothing approved to treat exacerbations in CF patients regardless of the background therapy. In terms of where we're going to go with doses, we have to look at the data first and then we'll be able to give you some guidance on that, but we expect to have the data in hand by the end of the year to know what that's going to look like. Having said that, I think each of our quarters this year, we've done a nice job in terms of performance. I expect the ARIKAYCE brand globally to continue to grow, whether that will be contributed to more or less from Japan, given the headwinds we just referred to, et cetera. As we were very clear about on the call today, the US is almost back to where it was pre-COVID. But the landscape before us, and this happened to also inform thinking about the financing, is just very uncertain. And so, I think we want to be cautious as we move forward. And so, that's where the uncertainties weigh in on our thinking, and caution is the watch word of the day. If you held FX constant from the January rates when we obviously came up with our guidance, the impact of that was - is over $10 million on what an annual basis would be for revenue. So, the fact that we've been able to continue to meet and exceed our guidance and be able to hold our guidance despite those headwinds, we're really - we feel really confident in ARIKAYCE and what itâ\u0080\u0099s been able to produce and what it has the ability to produce in the future. So, the first thing we have to do is validate the PRO, and that'll happen in the first half of next year. Assuming that that goes as planned and the PRO is both responsive and tracks patientsâ\u0080\u0099 behaviors, then we'll be able to make commentary on what is clinically meaningful in terms of a change within the use of that PRO. Once we've identified that, we'll be able to compare the two arms and make, obviously, statements about the degree to which our drug has provided that benefit to patients. I'd say today, we feel pretty good about - while it's all blinded still and we can't see individual data, but the overall blended blinded data suggests to us that there is something going on within the trial. We've been doing this for several years now, and that's consistent with what we're seeing in the blended data. So, my expectation is that we will see that this PRO is able to track change, and my expectation is that that will be in favor of the ARIKAYCE arm. To what degree, it's hard to say, but I'm happy with what we're seeing so far. On the first one, maybe with respect to the recent financing deals, understand being opportunistic in this market, but just wondering if you could talk more particularly on the decision to monetize ARIKAYCE and Brensocatib royalties. So, the strategy there was to sort of look for ways to bring on capital in quantities so we could message that we are going to catapult past all these geopolitical and macroeconomic dislocations that may be operating in the market for some time. The royalty is very small, as you know, less than 5% on ARIKAYCE, and less than a point, 75 basis points on Brenso, and that's assuming that it gets approved and moves forward. As you think about the repayment of this, it is a capped royalty, and that is probably the most important point to take away. This is a repayment of the royalty over a period of time, and once it's done, it goes away for good. So, one of the things that was entering under our mind is to make sure that we don't burden either of these assets for any extended period of time so that they continue to have real strategic value. And if we see change and it's associated with feeling - patients feeling better, then we know we've got a winner. And on that particular measure, let's say it's cough, cough improves dramatically and it makes patients feel better to cough less, we can track all of that and it's better in the ARIKAYCE arm, that's obviously something we want to make sure we are emphasizing in the ENCORE study. It may be that at the conclusion of ARISE, we don't need to make a single change. I think the beauty of the design, if I can suggest it, is that we have the ability to make change should we come across unexpected outcomes. Thanks for taking the question. So, we did shut down the TPIP study, I think back in August, somewhere around that timeframe. And at some point, we just said, we should be focusing on recruiting for the Phase 2b and Phase 2 PHILD and PAH studies directly, which are more traditional designs, should not encounter these kinds of delays because we're not asking them to undergo this onerous procedure. To put a footnote on that, I don't think anyone has ever done a right heart cath study that's lasted more than about four hours. So, it was really quite a big ask, and I think we just missed that one based on the guidance we had gotten from KOLs. Because of the variability that surrounds these patients, while favorable, probably doesn't make sense to put it out there and suggest that this is going to be the performance of every patient, but I would just tell you, we walk away very, very good, feeling very, very good about the potential of TPIP, the enthusiasm we have for these Phase 2 trials, and the fact that we can get somebody to 320 micrograms. It's not exactly apples to apples because they dose multiple times a day, but we are achieving our objective of getting more drug into the patient slowly released over time and over a 16-week time frame. So, we haven't given specific guidance on the two studies and when they're likely to read out. Unlike all the other indications we're pursuing, this actually does have products that are approved to treat it, but there's a lot of enthusiasm from physicians. And so, I think we're going to have some success in enrolling this, but we'll have to see what that pace looks like. You had sort of spoken about your launch plans in the EU previously, and I just kind of wanted to know which territories were next. You listed a few that you had already completed toxin, or at least were advanced in, but what's the ongoing progress and timeline of other countries being added for the â\u0080¦\n So, it's really - yes, in the category of any day, I mean, important territories that remain are France. As you may be aware, we've had a compassionate use program there under a particular program that they have for early access to drugs. It's been very successful in treating patients, but it introduces uncertainty about when they will make their final decision, what that decision will look like with regard to reimbursement rates, et cetera. Overall, the addressable market in Europe right now is roughly 1,400 refractory patients. Nonetheless, we think as we move through these approvals, it does two things. And two, it permits us to begin the process of educating physicians and engaging with them for the ultimate launch of Brensocatib in bronchiectasis, which is quite prevalent in Europe. So, we're looking forward to where this - where we go with - from here, and we'll take we'll take their contribution in the next year, now that we have some of these approvals in hand. Thanks for taking the question. First, just on Q3 ARIKAYCE sales, I think it's fair to say that they came in maybe a little better than internal expectations. Yes, I think just quickly what I would say is, the US continues to perform as it exits the COVID overpressure. Japan has struggled with the two headwinds it's facing, but the fundamentals in the Japanese market are very strong. An as Sara quantified, it's quite a meaningful impact. And we've seen in the US, as a precedent, that it takes some time for that to clear out and for everything to return back to normal. So, I'm particularly excited about what we're seeing in the US. And so, there are a lot of physicians who have a number of patients that are just going to be waiting to get an appointment. It's hard to get access to a physician in the post-COVID world, particularly with a respiratory condition. So, I think that limits the degree to which we have a bolus of patients. Instead, it's probably more of a slope of additional patients over time, at least that's my expectation, but it's a solid queue, and I think we'll probably see the same thing in other regions around the world. So, what's clear is that if you've had a good experience with ARIKAYCE and you get reinfected, as unfortunately is going to be the case for many of these patients, the instinct is to go back to that treatment because it was successful before. The drug is very effective at keeping patients culture negative, and if they get reinfected, it is inevitably a new infection, not an old infection reappearing. So, that's an encouraging piece of information for patients to understand, that if they're getting retreated, they're probably not going after the old infection. And to see that over - at a fairly steady pace over the last several quarters, tells us it's real and it's probably not going to go away. So, that's one trend that I would highlight for attention and I think a positive one for us as we go forward. Beyond that, I don't think there's anything else I would comment on. But to get something advanced there on the regulatory front, would require a separate PRO and a separate trial, and that hurdle is one I don't think we want to surmount. So, trends for the appropriate patients continue to be positive. I think we continue to see growth on the horizon, and I'm just really happy in the post-COVID world, how much things have snapped back to the way they were before COVID, and I think that bodes well for the future. So, the challenge there, Joe, is with the other headwinds operating, in particular the COVID one, it makes it difficult to sort of tease out exactly what impact that may have had. I think as time goes forward, we'll get a clearer picture on that. But in the current environment, it's just too hard to discern that. And then on Brensocatib, given ASPEN is such a large study and it's good to see is closing in on full enrollment, we were wondering if you can tell us about any things you've been doing to ensure that the right sites and patients are enrolled, and how you've been monitoring conduct there. So, the conduct of the ASPEN study, I would say, is going exactly as we would have hoped and expected. We know, on a blinded blended basis, we look at this down to the country level on a weekly basis, the rate - blended rate of exacerbations in the trial. And I think the most important thing to take away is that this trial looks behaviorally very much like WILLOW did, and that is a point of comfort for us. We cross examine it a bunch of different ways, but right now, it looks a lot like WILLOW did, and that's important because WILLOW was big enough and it studied the right endpoints, which are the same ones we're going to be studying in Phase 3. So, we know what to look for and what good looks like within the trial on a blinded basis. If you look at recent meta studies that have been done, you see a lot of variability in respiratory trials. The key lessons from prior bronchiectasis studies, is that you have to have enough events in your trial to make sure that your drug, whatever it is, has the opportunity to perform. So, we feel very good about the event rate, what we're seeing on a blended basis, again, being consistent with WILLOW. All signs point to, things are going as planned, and importantly, that we have the right patients in the study. And that's why we - as we've always said, we prioritize quality first, speed second, and budget third when it comes to the execution of this trial. This is a landmark trial, and I think the fact that it's a single study is another advantage. Thanks for taking the question. Yes, it's a fair question. I think the first thing we need to do is quantify, and let me just go into a little bit more detail here. When you think about a PRO and you're looking at a particular measure, there's sort of an assumed level of change within the measure that would represent something that's clinically meaningful. Using the bronchiectasis questionnaire in the setting of bronchiectasis, this QOLB instrument that we have tailored for NTM, one would normally expect a around an eight-step change to be clinically meaningful in the setting of bronchiectasis. It's not clear yet what would be considered clinically meaningful in NTM, but what I can tell you is that on a blended blinded basis, we're already seeing changes in these measures in excess of that threshold. So, that is a very encouraging sign to know that we are seeing change in the patients, and that that is being captured by this instrument. But to clear that hurdle and to know that we're seeing change and it's being tracked, is an important accomplishment, I think, already. And we'll know it across several different measures, not just the PRO, but also culture conversion, and also other measures beyond that, that are secondary and exploratory. So, we'll have a range of data that should really spell out what is happening to patients on our combination of therapy versus the alternative, and what does that result in, in terms of their symptoms, how it makes them feel, as well as the impact on the presence or absence of the infection itself. Historically, we've seen very good data on culture conversion, both overall levels and time to culture conversion. When this drug was first conditionally approved in the US for refractory, there was very little information, both about the disease and the impact of the drug. And that is a very different clinical picture and dataset, which the FDA will be evaluating when they think about whether it's suitable for frontline use. And this is considered widely, I think, at the FDA to be a case study of success in the approval of a novel antibiotic for the treatment of a disease that had nothing approved previously. When I think about what is going to be happening over the course of about the next year and a half, there is going to be a flywheel of clinical data readout that is positive. And that starts with ARISE, starts with really the CF data at the end of this year, the ARISE data next year, PHILD results, obviously ASPEN results. And if I could just add one other piece to that, the amount of diligence that our partners have done through this structured, also gives heightened level of confidence, I think, from an external perspective on that they wanted to put this capital to work after doing very thorough diligence on ARIKAYCE, on Brenso, and what itâ\u0080\u0099s matched to offer. I noticed earlier this month that the actual enrollment on clinical trials, so the actual enrollment was 34 patients versus the 48 expected, and then it was originally designed for a 50-50 split between the CFTR and non-CFTR patients, and that doesn't seem to be the case any longer. The non-CFTR patients are fewer and far between, and it's harder to get a hold of them. But it was just on the non-CFTR modulated patients that we had, I think some time ago made - reduced the number of patients that we were going to bring forward in that arm. So, the - what we have completed is the 10, 25, and 40-milligram dose, and that's the 34 patients that you're seeing. And then, Jennifer, on your OpEx question, so what you see in our OpEx is you see continued support for all of our programs. TPIP now is underway and those Phase 2 programs, you're seeing those spend levels included in OpEx. You're seeing ASPEN and ARISE, ENCORE, full investment in those, some pre-launch, pre-commercialization activities for Brenso. Weâ\u0080\u0099re thoughtful on what do we need to spend today versus what can we wait to spend, while making sure that we're prepared for a potential launch of almost a million patients at launch, assuming success with ASPEN. So, weâ\u0080\u0099re thoughtful on our spend levels here and we'll continue to be thoughtful, and you can see that through our development of waiting to start CRS until middle of next year, those types of activities. I think before, you've talked about how Q3 seasonally is more modest versus the rest of the year. The third quarter is usually impacted by people, for lack of a better way of saying it, just going on vacation and traveling, and they like to take holidays from their medicines during that time. So, there's not a specific target per se. What we're going to be looking for is the impact of the drug on NSPs, is one of the measures we're going to be looking at, and not just neutrophil elastase. It's all the NSPs that we track, that we have assays for in both blood and sputum. So, that's going to be what we look at. So, success here would sort of replicate some of that behavior, even though it's an abbreviated timeframe. Nonetheless, weâ\u0080\u0099re hopeful that we'll see some of those similar trends here in a dose-dependent manner. So, I'm just going to hand it back to the management team for final remarks."
}