{
    "symbol": "ATO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-10 14:28:07",
    "content": " Over that 11-year period, we invested over $15 billion in modernizing and expanding our natural gas systems, replacing approximately 6,300 miles of distribution pipeline, approximately 440,000 steel service lines and over 1,200 miles of transmission pipeline. Our fiscal 2022 capital investment of over $2.4 billion supported the modernization of our distribution and transmission systems through the replacement of 715 miles of distribution pipe, the replacement of more than 47,000 service lines, of which 24,000 were steel service lines and over 155 miles of transmission pipe, all to further enhance system safety and reliability. As of September 30, we had about $777 million available under existing equity forward arrangements that will fully satisfy our anticipated fiscal 2023 needs and a portion of our anticipated fiscal 2024 needs. As a result of these financing activities, our equity capitalization at the end of fiscal year, excluding the $2.2 billion of winter storm financing or 61.3%. Second tranche was a $300 million 10-year senior note with a coupon of 5.5% because we have already satisfied our fiscal 2023 equity needs through our ATM program, this transaction and completed our anticipated fiscal 2023 financing activities. In addition to addressing our fiscal 2023 financing needs, during the fourth quarter of fiscal 2022, we've also been preparing to ensure supply reliability and competitive natural gas prices for our customers for the upcoming winter heating season. This level of spending will continue to support rate base growth of about 11% to 13% per year, which translates into an estimated rate base of approximately $25 billion in fiscal 2027, up from $14 billion at the end of fiscal 2022. For fiscal 2023, we anticipate O&M to range from $700 million to $720 million, and we've assumed O&M inflation of 3% to 3.5% annually through fiscal 2027 off of FY 2022 levels. To mitigate interest rate risk associated with our anticipated long-term debt financing needs beyond fiscal 2023, we currently have about $1.35 billion before starting interest rate swaps to effectively fix the treasury component of our total cost of financing at rates ranging from 1.5% to 2.2%. And our debt profile remains very manageable with a weighted average maturity of 18 years and a weighted average cost of debt of about 3.78%, excluding the $2.2 billion of incremental financing related to Winter Storm Uri, and no material refinancing needs until fiscal 2027. The execution of this plan to modernize our system through disciplined capital spending, timely recovery of those investments through our various regulatory mechanisms and balanced long-term financing all supports our ability to grow earnings per share and dividends 6% to 8% annually through fiscal 2027. Yes, I'll start and then hand it over to Chris. Yes, I'll start and then hand it over to Chris."
}