{
    "symbol": "SOVO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 21:35:18",
    "content": " And lastly, to avoid any confusion, organic net sales growth for the fourth quarter and fiscal year 2022 represents growth on a 13 and 52 week comparable basis that excludes the extra week. Sovos Brands delivered another year of sector leading growth in 2022 with organic net sales up 19.5%, accelerating to 28.4% in the fourth quarter. Excluding Birch Benders, our full year organic net sales growth would've been 23.5% versus prior year. Raoâ\u0080\u0099s had another impressive year, surpassing $0.5 billion of net sales, up 35% organically for the full year and accelerating to 45% in the fourth quarter. Total Raoâ\u0080\u0099s household penetration increased to 15.2%, up 210 basis points versus prior year, as a result of adding new households across all categories. And for the first time, Raoâ\u0080\u0099s was the number two ranked pasta and pizza sauce brand reaching a 14.7% dollar share for the year, up 150 basis points versus 2021. For the full year total net sales of $878.4 million increased 22.1% or 19.5% on an organic basis, driven by 10.8% volume and 8.7% price, excluding Birch Benders, our full year organic growth would have been 23.5%. Fourth quarter total net sales of $262.1 million, a $72.9 million or 38.5% increase over the prior year period, excluding the extra week organic growth of 28.4% was driven by 16% volume and 12.4% price. Beyond Raoâ\u0080\u0099s, total net sales growth in the fourth quarter was up 12.5%, for noosa down 0.3% for Michael Angeloâ\u0080\u0099s, and up 6.7% for Birch Benders. Adjusted gross margins were 29.2% for the quarter slightly ahead of our expectations, reflecting a 220 basis point decline versus a prior year period. $42.4 million of adjusted operating expenses inclusive of marketing and selling increased by $6.7 million or 18.8% over the prior year period, driven by growth enabling investments primarily to support our talent and capabilities. Adjusted EBITDA of $37 million, increased $10.5 million or 39.7% versus Q4 2021, while adjusted EBITDA margin was 14.1%, up 10 basis points versus the prior year period. On a full year basis, total net sales were $41.2 million, an adjusted EBITDA with negligible, reflecting elevated reinvestment into the brand with bottom line performance relatively consistent by quarter. We generated volume led 22% sales growth, year-on-year bottom line growth and catapulted forward on our March to $1 billion of net sales for Raoâ\u0080\u0099s. Your line is open. Your line is open. And we increase 100 basis points year-on-year on sauce, and we see both of those up meaningfully in two months into the quarter, not going to quote exact number, weâ\u0080\u0099ll talk about that on our next call, but those distribution gains are playing through right now in consumption and most importantly to us in household penetration gain. Your line is open. But the way to do that is to invest, and Iâ\u0080\u0099ll just give you perspective in 2022, we invested an increased year-on-year and awareness for the Rao's brand, Iâ\u0080\u0099ll just use that as a proxy, increased from 48% to 58%, 1,000 basis points, ten-fold percentage points year-on-year. Your line is open. Your line is open. Your line is open. Your line is open."
}