{
    "symbol": "SOVO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 03:03:04",
    "content": " Our largest brand, Rao's, continues to grow robustly, passing $500 million of net sales and growing 13% on an LTM basis. Volume increased 2.5%, inclusive of a negative 8-point headwind to total company volumes from lapping two large volume driving events from a year ago for the Noosa and Michael Angelo's brands that we did not repeat this quarter. For the quarter, total Rao's franchise dollar consumption grew 27.7%, led by nearly 20% unit growth that was driven by broad-based gains in distribution and velocities. Additionally, household penetration for Rao's Sauce continues to grow, finishing the quarter up 160 basis points versus the same time last year to 11.8%. In totality, these businesses have now surpassed to combine $100 million of IRI measured annual net sales, with dollar growth up nearly 50% year-over-year on an LTM basis as well as in the third quarter. While our market shares in household penetration levels today are relatively modest in the context of these multibillion-dollar categories, we see material growth opportunities for the Rao's franchise in these and other categories for years to come. Our volume grew 2.5% in the quarter, inclusive of a negative 8-point headwind due to lapping 2 prior year volume driving events for the Noosa and Michael Angelo's brands, which we did not repeat this quarter. Adjusted operating expenses, inclusive of marketing and selling of $35.8 million increased by $8.7 million or 32.3% over the prior year period as we continue to invest behind our talent, brands and capabilities to drive sustainable growth for the long term. Similar to last quarter, we prioritized our growth investments defined as marketing plus R&D, with total spend in the third quarter up nearly 20% versus last year and up over 32% versus the second quarter of 2022, which itself was also up materially on a year-over-year basis. Adjusted EBITDA of $29.5 million increased $3.7 million or 14.5% versus Q3 2021, while adjusted EBITDA margin was 14.1% versus 14.4% in the prior year period.Net income for the quarter was $1.5 million or $0.01 per diluted share compared to a loss of $4.6 million or negative $0.06 per diluted share in the prior year period. Your line is open. Your line is open. We've got total Rao's franchises went to reinforce just passed $0.5 billion LTM, seven times larger than when we acquired it, up 30% versus prior year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. In fact on frozen, very pleased with our consumption results, the combination of Rao's and Michael Angelo's frozen, nearly 20% growth in consumption during a quarter where our shipments for Michael Angelo's were below a year ago because of not repeating the event. Your line is open."
}