{
    "symbol": "SOVO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 05:29:05",
    "content": " Lastly, please note that all consumption data cited on today's call will refer to dollar consumption as the 13-week period ended March 27, 2022, and growth versus the prior year unless otherwise noted. Faced with unprecedented inflationary and supply chain headwinds as well as lapping 41% brand net sales growth in Q1 2021, we were once again able to deliver double-digit top line growth with results continuing to be led by volume growth in our core categories of sauce, yogurt and frozen. The combination of sauce, yogurt and frozen for Sovos Brands grew dollar consumption by nearly 22% versus 7% for the categories in aggregate, with a key point of differentiation being that we delivered such outsized growth almost entirely through increased volume while the categories were the opposite, with price as the sole driver to growth while volumes were negative. From a household penetration standpoint, total Rao's increased by more than 290 basis points versus prior year to 14%, primarily due to sauce and frozen entrees as they continue to realize substantial distribution, dollar and unit velocity growth. This rate of growth translated into a 270 basis point increase in dollar share versus the prior year period to 15.1% as dollars, units, TDPs and velocities continued to grow by double digits, which remains in stark contrast to the category where units are down low single digits and the entirety of growth is being driven by price. As a result, household penetration growth for Rao's sauce was the fastest in the category, increasing by 250 basis points versus the same time last year to 11.5% despite the size of the brand at over $0.5 billion in retail sales. Notably, these retailers are geographically dispersed throughout the U.S.  Our total frozen entrees portfolio, which includes Rao's and Michael Angelo's, also outperformed as dollar consumption of 15% was over 2x faster than the category, while units grew in contrast to a decline for the category. At the brand level, Rao's remain the driving force behind our growth, increasing net sales by 19.4% in the quarter despite a very robust 84% year ago comparison as well as intermittent supply challenges that detracted from our ability to fully meet the robust demand for our entire Rao's portfolio. Given our strong Q1 results, we have line of sight to hitting the upper end of our full year outlook, which calls for $800 million to $815 million in net sales and represents 11% to 13% growth year-over-year. But if you look at Rao's sauce trends, I know you asked about that in the pricing dollar sales in the first quarter, up 34%; category, 10%; unit sales, up 30%; and the category, down 2%; and our unit consumption for the 52 weeks was up 31%. And I do think we're in somewhat uncharted territory with a brand like Rao's that's actually, in measured MULO plus natural specialty, measured, it's $510 million of retail sales, a 42% CAGR, fastest-growing brand in the sort. Not only is Sovos the fastest-growing food company of scale in the U.S. but Rao's, although it's over $500 million in SPINS, MULO and natural, we continue to be the fastest-growing brand of scale of any greater than $100 million, growing 42% over the past 2 years. So that is playing into the -- in the spirit of putting everything in the blender of what's coming out, 84% growth on Rao's last year was very, very large. I mean if you look at just our -- so putting pricing aside right now, last 13 weeks, just data yesterday, units up 26% of Rao's sauce, 22% on soup, 30% on dry pasta, 36% on frozen."
}