{
    "symbol": "EWCZ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 15:13:08",
    "content": " We continue to believe it's important that our sales and dues match and we delivered record top and bottom line results in line with the annual guidance we gave at the beginning of last year, despite a significant change in the consumer landscape during 2022, generating $899 million in system-wide sales and $71.6 million in adjusted EBITDA representing 13% and 12% growth respectively. Top line growth was a result of unit expansion, including 33 net new centers during the quarter, coupled with a strong 6.3% same-store sales increase driven by all cohorts, including mature centers. Fourth quarter adjusted EBITDA margins increased 210 basis points to 35.9%, primarily driven by SG&A leverage on top line growth and a favorable shift in the timing of advertising expense year-over-year. Adjusted EBITDA margins decreased 140 basis points year-over-year to 34.5%, primarily due to public company costs in the new medical supply arrangement, partially offset by operating expense leverage from top line growth. As David mentioned earlier, we plan to deliver more than 10% unit growth once again based on 95 to a 100 net new center openings this year with 45 to 50 expected openings in each half of the year. From a system-wide sales perspective, we believe that 2023 sales will be slightly more weighted to Q2 and Q4 as compared to prior year with the continued strength of Wax Pass sales generated in those quarters during our regular semiannual promotional periods. So I think we've got better opportunities as we've got a better visibility to CRM and brought new capabilities in to help drive that, where we can take a look at those guests that might have not come as often as they had been in 2021 and 2022 and really retarget them with very specific personalized targeted messaging to drive them back into the center. While we're incredibly pleased to deliver this level of unit growth in back-to-back years and as David touched on, we feel incredibly confident about future development, I don't think we're there yet to say, let's assume 10-plus percent is the new baseline. We're making discrete investments in our development and operations teams that if you think about our -- as we continue to grow our network, we don't have to add a new development person or a new field business consultant every 10 or 20 centers but every 80 to 100 centers, you're making fairly modest discrete investments to continue supporting that growth. In terms of a slightly stronger Q2 and Q4, we've seen that over the last couple of years -- actually, the last several years, you may recall, we run our traditional semiannual Wax Pass promotions in the second quarter and in the fourth quarter."
}