{
    "symbol": "EWCZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 06:53:06",
    "content": " As a reminder, those priorities are, one, expanding our national footprint through new centers; two, capitalizing on our enhanced marketing and loyalty programs to drive deeper customer engagement; three, increasing the pipeline of lack specialists to support our long-term growth; four, leveraging our scale to benefit our supply chain and franchisees; and five, optimizing our capital structure to lower our cost of capital and increase flexibility. The majority of our 2022 growth is still coming from these non-institutional players, with our compelling unit economics, including a modest upfront investment of approximately $350,000, average unit volumes of over $1 million at maturity and robust four-wall margins that remain above pre-pandemic levels, existing franchisees still make up more than 90% of our pipeline. Total revenue growth exceeded system-wide sales growth, due to the medical supply arrangement with franchisees that began early in 2022, which should generate approximately $10 million in total revenue for European Wax Center this year. From a modeling standpoint, sales at our new centers typically build up throughout the first year to nearly $500,000 in year one and continue to ramp to more than $1 million in year five when they are considered mature. In summary, European Wax Center's strong asset-light business model is generating significant cash flow and driving results for our guests, franchisees and shareholders. Similarly with our 50% off that new second service that we offered guests that we've extended into this quarter, we see that also from a lifeline standpoint that it's an opportunity for us to sell a second Wax Pass to those guests. And anything that we've run, so a rebooking contest giving more dollars for referrals, selling Wax Passes, this is all right in the wheelhouse of the great operational expertise of our franchisees and that's why I think we've seen such nice results in terms of the levers that we pulled in Q3 and will continue in Q4. We probably spend more time talking about the wax pass and the positive halo effect of getting guests on a wax pass, but every one of our promotions is really intended to drive first new guests into the center, maximize share of wallet there, and then best case get them on a regular routine so that we get the -- our franchisees get the benefit of that frequency."
}