{
    "symbol": "AIP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 14:04:07",
    "content": " We're excited to report our continuing momentum in 2022 with annual contract value, plus trailing 12-month royalties of $51.7 million in the second quarter, up 18% year-over-year despite HiSilicon's contract ending in Q2, which removed $3.3 million of annual contract value. Total revenue for the second quarter was $14.8 million, up 37% year-over-year, benefiting from higher-than-expected concentration of point-in-time IP deployment revenue. At the end of the second quarter, ACV plus trailing 12-month royalties and other revenue was $51.7 million, up 18% year-over-year, in particular, driven by growth in automotive, consumer electronics, AI/ML, enterprise and 5G communication market segments, and down 2% quarter-over-quarter, reflecting the removal of the $3.3 million ACV associated with the 2019 HiSilicon license agreement, which ended in May 2022. Cash flow from operations was approximately $0.2 million in the quarter, while free cash flow, which includes capital expenditure, was positive $0.1 million, reflecting the benefit of both the previously mentioned IP deployment deals and also the earlier-than-expected collection from a major customer. For the third quarter, we expect ACV plus trailing 12-month royalties of $51.0 million to $53.0 million and revenue of $10.5 million to $12.5 million with non-GAAP operating loss margin of 41.2% to 56.2% and non-GAAP free cash flow margin of negative 41.2% to negative 56.2%. ACV plus trailing 12-month royalties to exit 2022 at $48.0 million to $52.0 million, representing a $3.6 million decrease at the midpoint compared to prior ACV plus TTMR guidance, reflecting the removal of the $3.7 million ACV associated with the 2020 DJI license agreement, which ends in December 2022 and some caution on the timing of fourth quarter deals as a result of the current economic uncertainties. So if you look at the whole year with the exit point of '22 versus exit point of '21, which is really the way that it should be sort of characterized because it's sort of an annual measure, the headwind between HiSilicon who ended in May and DJI, which ends future in December, the headwind between those two is $7 million on ACV."
}