{
    "symbol": "GMED",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 20:56:04",
    "content": " Q2 was a record sales quarter for Globus, with revenues reaching $264 million or 5% growth, surpassing the difficult Q2 '21 comp where we had achieved 69% growth. In addition, Q2 had 14% sequential growth versus Q1 with stronger performance throughout the portfolio, setting a new monthly sales record in June, where we exceeded $100 million in monthly sales for the first time. Enabling Technology sales were $29 million, up 44% on a constant currency basis versus prior year, setting new quarterly records in both domestic and international sales. On the international front, our spinal implant business grew 8% on a constant currency basis compared to the second quarter of prior year. Our trauma business delivered its strongest quarter-to-date with 67% annual and 5% sequential growth, driven by sales force expansion, strong uptake of our ANTHEM Mini Fragment Plating System and the second quarter launch of ANTHEM Distal Femur Fracture System. Revenue in the second quarter of 2022 was a record $263.6 million, growing 5% as reported versus Q2 of 2021 and 6.5% on a constant currency basis. I call specific attention to our record sales in Q2 and the associated 5% growth when compared to the prior year quarter, given the tough comp in Q2 of 2021, where we grew 68.6% when compared to Q2 of 2020 and 29% when compared to Q2 of 2019. Drilling further into sales, our second quarter U.S. revenue was $225.3 million, growing 4.7% as reported when compared against the second quarter of the prior year. International revenue for the second quarter was $38.4 million, growing 6.9% as reported and 17.3% on a constant currency basis when compared to the second quarter of the prior year and is reflective of the continued global expansion of our robotics portfolio. Consistent with our Q1 call comments, our robotics pipeline saw sequential improvement between the first and second quarters, resulting in higher sales of robotic units when compared to the prior year quarter. SG&A expenses for the second quarter were $106.7 million or 40.5% of sales, compared to $107.3 million or 42.7% of sales in the second quarter of the prior year. So just one other thing I would add on Enabling Tech, Shagun, is that when you look -- I made a specific comment in there, that we saw higher sales of our robotic units in Q2 versus prior year. So you guys obviously -- number has been a bit lower in the first half than what you've seen in prior years and what we're normally used to seeing, and I believe you're expecting a big second half or a rebound and an acceleration. Then given the strength that we're going to do with our launches and our recruiting and our drives, I don't see why we wouldn't have a couple of strong levers to get into stronger deliveries in the second half of the year."
}