{
    "symbol": "ICFI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 18:06:04",
    "content": " Key takeaways include our 22% year-on-year growth in service revenue comprised of 7% organic growth and the contribution from our recent acquisitions, 15.5% year-on-year growth in revenues from commercial energy clients, a 14.8% adjusted EBITDA-to-service revenue margin and record third quarter contract wins totaling $865 million, resulting in a book-to-bill of 1.85x for the quarter. Our year-to-date results also underscore our ability to reach the long-term financial goals we laid out in our May 2022 Investor Day, namely to achieve high single-digit organic service revenue growth through 2024, driven by our 5 key growth areas, drive double-digit total revenue growth by adding acquisitions that are a strong cultural fit and offer revenue and earnings synergies and by the end of 2024, increase EBITDA by roughly $100 million from the $143 million we reported in 2021, which implies a CAGR of approximately 19%. ICF's third quarter revenue growth was led by our federal and state and local government clients and our commercial energy work, which taken together accounted for over 87% of the company's total revenues for the period. With an annual revenue run rate of approximately $500 million, ICF's IT modernization business inclusive of SemanticBits at a leadership position in providing well code, open source and cloud data solutions, and we are thus well positioned to continue to grow our IT modernization revenue at a double-digit rate over the coming years. This range expects to become a more meaningful contributor to revenue growth over the next several years, given how well our capabilities are aligned with significant opportunities stemming from the IIJA to address the consequences of climate change, including -- excluding weather events and rising sea levels throughout the U.S. Second, currency translations especially related to the euro and British pound have negatively impacted third quarter revenues. Aviation consulting revenues continue to grow, increasing at a high single-digit rate in the third quarter and up more than 25% year-to-date, driven in large part of our sustainable aviation offerings, new airline and investor clients are seeking out ICF's unique marketing sites around the policies, technologies and finances. More specifically, our third quarter cash flow was reduced by an additional payroll cycle relating to approximately $25 million that occurred in the third quarter of 2022, which will benefit us in the fourth quarter, as well as temporary delays in billing and collections associated with recent acquisitions due to the timing of integration activities which equated to about approximately $28 million in additional unbilled AR, which has since been billed and collected in Q4. And with the backlog of $3.7 billion, it's approximately 50% funded, expectations for significant new awards in the fourth quarter and with a robust business development pipeline, we are confident that 2023 will be another year of strong performance for ICF."
}