{
    "symbol": "KIDS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 11:00:04",
    "content": " Consistent with our pre-announcement on January 9, we generated quarterly revenue of $31 million, representing growth 25% compared to the fourth quarter of 2021. For the full year of 2022, we generated $122.3 million, representing growth of 25% compared to 2021. In the fourth quarter of 2022, we generated total Trauma & Deformity revenue of $22.1 million, representing growth of 34% compared to the prior-year period. In the fourth quarter, we generated Scoliosis revenue of $8 million, representing organic growth of 12% compared to the prior year period. In the fourth quarter of 2022, we generated quarterly international revenue of $8.3 million compared to $5 million the prior-year period, primarily driven by new set sales to our stocking distributors, as well as the addition of MDO and Pega international revenue. This, along with the integration of Pega products in our European sales agencies, additional international product launches in key markets, new market expansion within the MDO franchise, and increasing willingness for set purchases from our international stocking distributors, gives us confidence that our international business is well positioned to generate strong growth in 2023. In the fourth quarter of 2022, we generated total international revenue of $8.3 million, representing growth of 67% compared to the prior-year period. For the full year of 2022, Trauma & Deformity revenue of $85.1 million increased 29% compared to 2021. In the fourth quarter of 2022, Scoliosis' organic revenue of $8.0 million increased 12% compared to the prior-year period. We have several growth drivers in place across the business, such as set deployments and key account conversion, continued share gains in T&D with the leading products such as PNP | Femur, outsize growth in our new non-surgical specialty bracing business, accelerating growth of the Pega Medical franchise, continued share gains in our Scoliosis fusion and ApiFix non-fusion segments, and the opportunity for further international sales growth as markets stabilize. And so, I think as we get inventory for this product, as well as new products that offer both MDO and Pega and we can get those in the hands of both our US and international selling organization, we expect those product lines, those two businesses to grow in excess of 20% for the next several years. Lastly, the $25 million in sets, I think in the past you'd said some of the new acquisitions, maybe before MD Ortho, maybe ApiFix and Orthex had sort of a different investment needed, so the $25 million that you're forecasting this year, I guess any comments or color on how maybe the new newer products are a component of that or what's core versus what's new or how it maybe MDO and Pega compared to the other acquisitions you've done from a set standpoint?"
}