{
    "symbol": "KIDS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 12:08:03",
    "content": " In the second quarter of 2022, we generated total revenue of $32.9 million, representing growth of 23% compared to the second quarter of 2021. Excluding MD Orthopedics, second quarter organic revenue growth was approximately 14% compared to the prior year period. In the second quarter of 2022, we generated total trauma and deformity revenue of $22.6 million, representing growth of 26% compared to the prior year period. MD Orthopedics, which will be reported as trauma and deformity revenue going forward, generated revenue of approximately $2.6 million in the second quarter of 2022. Excluding MD Orthopedics, second quarter organic trauma and deformity revenue growth was approximately 11% compared to the prior year period. In the second quarter of 2022, we generated total scoliosis revenue of $9.4 million, representing growth of 23% compared to the prior year period. In the second quarter of 2022, U.S. revenue was $25 million, a 15% increase from the second quarter of 2021. The growth in the quarter was primarily driven by organic growth across scoliosis and trauma in deformity correction as well as the addition of MD Ortho, which added $1.3 million of incremental revenue. In the second quarter of 2022, we generated total international revenue of $8 million, representing growth of 61% compared to the prior year period. In the second quarter, trauma and deformity revenues of $22.6 million increased 26% compared to the prior year period. In the second quarter of 2022, scoliosis revenue of $9.4 million increased 23% compared to the prior year period. Finally, Sports Medicine/Other revenue in the second quarter of 2022 was $939,000, which declined 15% compared to the prior year period. In the second quarter of 2022, we realized a $5 million fair value adjustment benefit, which was driven by the valuation inputs that were lower in comparison to the same period last year, compared to roughly a $1 million charge in the second quarter of 2021."
}