{
    "symbol": "KIDS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 23:23:17",
    "content": " In the third quarter of 2022, we generated record total revenue of $35 million, which includes stronger than expected revenue from our 2 acquisitions, MD Ortho and Pega Medical, and in total represents growth of 39% compared to the third quarter of 2021. In the third quarter of 2022, we generated total Trauma and Deformity revenue of $23.9 million, representing growth of 42% compared to the prior year period. In the third quarter of 2022, we generated total Scoliosis revenue of $10 million, representing organic growth of 37% compared to the prior year period. In the third quarter of 2022, U.S. revenue was $26.5 million, a 37% increase from the third quarter of 2021. In the third quarter of 2022, we generated total international revenue of $8.4 million, representing growth of 47% compared to the prior year period. In the third quarter, Trauma and Deformity revenue of $23.9 million increased 42% compared to the prior year period. In the third quarter of 2022, Scoliosis organic revenue of $10.0 million increased 37% compared to the prior year period. Finally, Sports Medicine/Other revenue in the third quarter of 2022 was $1.1 million, which grew 8% compared to the prior year period. Total operating expenses increased $10.7 million, or 48%, from $22.2 million in the third quarter of 2021 to $32.9 million in the third quarter of 2022. Sales and marketing expenses increased $2.1 million, or 21%, to $11.9 million in the third quarter of 2022. General and administrative expenses increased $4.1 million, or 37%, to $15.1 million in the third quarter of 2022. In the third quarter of 2022, we recorded a $3.6 million charge to operations related to trade name impairment, which was primarily driven by the decrease in forecasted revenue that was lower in comparison to the same period last year. Research and development expenses increased $0.9 million, or 69%, to $2.2 million in the third quarter of 2022. In the third quarter of 2022, we realized a $23.0 million fair value adjustment benefit, which was driven by the decrease in forecasted revenue that was lower in comparison to the same period last year. For 2022, we now expect annual revenue to be in the range of $124 million to $125 million, representing year-over-year annual growth between 26% and 27%. Lastly, we plan to deploy between $20 million and $24 million of new sets in 2022, representing year-over-year annual growth between 47% and 77%."
}