{
    "symbol": "SM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 12:39:14",
    "content": " I would now like to hand the conference over to Jennifer Samuels, VP of Investor Relations. To answer your questions today, we have our President and CEO, Herb Vogel and CFO, Wade Pursell. I direct you to Slide 2 of the accompanying slide deck, Page 4 of the accompanying earnings release and the Risk Factors section of our most recently filed 10-K and 10-Q, which describe risks associated with forward-looking statements that could cause actual results to differ. Also look this morning for our first quarter 10-Q, which we have filed. And with that, I will turn it back to the Operator to take your questions. On CapEx first, you probably saw in the first quarter that we were under spend by about 20 million. And we really just -- that's just timing, and we moved that into the second quarter. We really like to keep crews running consistently, if at all possible, because we get much better capital efficiency that way. And I just also wanted to ask about return of capital, just kind of reading some of the prepared comments in the transcript, it sound like you all believe you'll hit your debt metrics in the fourth quarter. I mean, we've been pretty clear about our targets and we're approaching really quickly, one times leverage, but also want to absolutely get down to $1 billion. And things stay the way they are right now commodity prices, et cetera, that should occur sometime in the fourth quarter, as you indicated, and that would be the time that we would start looking at a potential return of cash to shareholders. I guess one, just kind of based on production trajectory for the rest of the year. So as we step through '22 and our activity level’s pretty flat here and we wind up with more and more completions coming on, that's what leads to great production in 3Q and 4Q. And then in 4Q, we have those four Permian tabs we've talked about before. So those don't come online, that's 20 well, that don't come online until early '23. When we have those sorts of things going on, we just see it year-over-year. That's pretty much the way you should look at it, the way you see it, year-over-year low-single-digit production growth and -- but generating a lot of free cash flow. In the prepared remarks, you talked about completing some Eagle Ford wells in 1Q and then three more Eagle Ford completions in 2Q. The newest to our DUCs that we've had sitting around for a while, we have some other Eagle Ford DUCs. I think we talked about 38 completions for the year, I believe around 30 of those are Austin Chalk, maybe 32 and 6 to 8 are Eagle Ford. So that was the original plan, but very capital efficient when we can get to the DUCs. Just looking at Slide 6 it shows you're -- in your slide deck, it shows your capital efficiency’s among the best in the industry over the last five years. So, we're still running off a contract in the first quarter that we've had for a while, so. The others, we continue to use the same drilling and completion service providers. So when you see things happening within it's really just things happen faster, and we don't make that in our budget process. No, Mike, we're really fortunate that, we were quite strategic in getting sand supply committed in 2017 being the anchor customer of a new sand mine in Lamesa. Mike, that's a great question. So, we are in the -- you're probably aware, last quarter, we talked about that additional 18 million in data gathering, which will help us optimize the completion design. In some cases, we've got some additional data. So we're hard at it, we have not implemented anything really differently so far. There's one minor variation, but that's -- there's still lots to come. The interesting thing though is that, we've noticed now that there's 11 operators active in Webb County in the Austin Chalk, five of them are public and six are private. So Mike, we do engage with a few of the other participants on data trade, and then some of them are -- other ones are quite new. I know you were asked about the Eagle Ford earlier, I just wanted to follow-up on that. Well, our price has definitely helped there, the completion design is pretty much the same that we've been running in the Eagle Ford. There were a couple that were drilled in 2019 and those are targeting great landing zone and they're decently long laterals, and that helps also. But we do feel like we have a great Eagle Ford option out there in -- that's really not much in our approved reserves, but it's out there in our inventory. So if there is a sustained high gas price out there, we have quite a bit of inventory to come after. I know you’ve got 40 wells now that you've delineated the play with, still looking at that 400 locations as kind of the best number for the inventory there. Mike, we're sticking with 400 now. So, but it's just a great resource base out there. And as you started looking into 2023, there's a lot of obviously concerns about Permian gas takeaway, and your production in the Permian typically is a little bit more oily. But can you remind us of how you’re positioned there if you've got, firm takeaway that's going to be ample and not seeing these issues? So, let's go on the Permian gas takeaway. Since that time Kinder has gone out there and said, they'd be able to do compression expansions and those would be online by fourth quarter of '23. We're not really changing our plans at all for any of this, because on the volume risk side, most of our purchasers hold firm capacity or they're selling in the fair markets. And then on the price risk side, things do start getting tight. We've put basis hedges in place, you'll see in our appendix, we've got base hedges in place through ‘25. But overall, it's going to depend on supply and demand. Out at the Permian, people really crank up production when that shortfall might occur. On the Eagle Ford, you're probably aware that there was a lot of gas production out of the Eagle Ford, mid-decade, from 2014, '15. So there's a lot of fair takeaway capacity and what we see and have baked in for July '23 and beyond is some of our old legacy contracts that were at higher takeaway costs, higher takeaway – basically, costs. As to LNG uplift, we were really just going to be going with the marker. So if LNG pulled up Houston Ship Channel or Tennessee Zone 0 or Hub, we would see it brought in that way. And back to the Permian, can you tell us the purchasers that take away your gas there, you said they affirm capacity. So what we do is we sell to the purchaser at the wellhead, and the purchaser only will sell to parties who represent that they have firm capacity on the line or are selling into a firm market, like a local market. So because they have that capacity, so let's say they have 20% of one of the pipelines and 15% of another line’s capacity, that's where our Mcf will flow. I would assume that things stay the way they are currently with the strip and in our kind of our steady activity profile that we would probably begin paying some cash taxes later this year, in the kind of teen and mid-teens million area. On a go forward basis, and this is very round forecasting, but I see something for us that getting up to kind of peaking in an area of the 100 million to 150 million a year. And that again, that assumes that kind of a strip type price. So obviously that assumes a significant amount of free cash flow, offsetting that. But that's kind of where things could be added, assuming there's no big changes. Yeah, it's certainly well south of the statutory rate, the 20% area, it's wealthy under there. Yeah, very round numbers, probably somewhere in the half of the statutory tax rate area, but that's very round numbers. But that's simply because of the assumption that we continue with a steady capital program, all of the tax rules stayed where they are, IDCs, et cetera. As long as those things are in place, that's what's going to happen with respect to our rate -- effective rates. First, we’re producing top tier flow breaking assets in two great basins, #1 and #4 in the country. We’re rapidly paying off debt, and really moving EV to equity. Ladies and gentlemen, this concludes today’s conference call."
}