{
    "symbol": "FRPT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 13:16:02",
    "content": " Furthermore, when measured on an annual basis for the full year 2023, we expect our results will be significantly better than last year's on several KPIs, including adjusted gross margin, freight as a percent of sales and adjusted EBITDA margin. Q4's results benefited from better-than-projected net sales, improvements in quality and logistics cost and lower media spend versus a year ago, which I'll note was planned. In terms of the cadence of the adjusted EBITDA, it will be back loaded again this year as we will incur significant plant start-up expenses, heavier marketing expense and transitory logistics costs in both Q1 and Q2 and lower volumes against higher fixed overhead now that we have Ennis online and need to grow into its scale. We're not seeing anything specific yet, but you can't be in a spot where you look at the macroeconomic factors that we're seeing, whether it's consumers starting to pull back on and trade down in a variety of other categories, not necessarily in our category and think that it's going to be smooth sailing for the balance of the year. Please proceed with your question. So there's actually a decent history of us demonstrating the kind of long-term growth that we've seen at 9% of sales, and that's how we got comfortable with that number. And then probably most significantly for us this year is what we're talking about from an e-commerce standpoint and expanding kind of our presence in e-commerce and are offering their kind of a product that we're coming with at the end of this very end of this quarter and the beginning of next quarter, you'll start to see that kind of come out to the market. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}