{
    "symbol": "BRX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:58:09",
    "content": " With me on the call today are Jim Taylor, Chief Executive Officer and President; and Angela Aman, Executive Vice President and Chief Financial Officer; as well as Mark Horgan, Executive Vice President and Chief Investment Officer; and Brian Finnegan, Executive Vice President, Chief Revenue Officer, who will be available for Q&A. Before we begin, let me remind everyone that some of our comments today may contain forward-looking statements that are based on certain assumptions and are subject to inherent risks and uncertainties as described in our SEC filings and actual future results may differ materially. And importantly, that execution provides exceptional visibility on forward growth through 2023 and beyond, even in a more disruptive economic environment. During the quarter, we signed 1.7 million feet of new and renewal leases at a record rent of $19.26 a foot, and a blended cash spread of 14.2%, which included 660,000 square feet of new leases at a record rent of $21.20 and a comparable cash spread of 32%. This record setting performance underscores the transformative impacts of our value-add plan in the related tenant demand to be in our well located, highly traffic centers. I'm also pleased by the breadth of that demand as we continue to drive strong market share with store openings for our core tenants and categories like grocery, fast casual, wellness and value apparel. Our leasing activity drove overall lease occupancy to a company record of 93.3%, a year-over-year increase of 180 basis points. And importantly, we commenced another $14 million of new ABR during the quarter, driving our build occupancy to 89.6%. Importantly, we also set another record in small shop occupancy, which rose to 88.8% on new rents achieved of $24.78 a foot. More than any other milestone achieved, this growth and occupancy and rate for our small shops truly underscores a transformative follow-on benefits of our reinvestment strategy. We also drove our average in place ABR to over $16 a foot, another record for the company, but which still has plenty of room to run is demonstrated by the nearly $20 a foot achieved on all new leases over the trailing 12 months. As we've said, many times, our attractive rent basis provides the opportunity to outperform through disruptive environments such as we experienced in 2020, as well as strong supply demand environments such as we're experiencing today. Our execution delivered top line, same-store growth of 4.8% in NOI growth of 3.6%, which is particularly impressive when you consider the drag of 250 basis points from revenues deemed uncollectible due primarily the declining prior period run collections as we work down our remaining receivables. Year-to-date, as we've driven occupancy and improved recovery rates, we've grown bottom line FFO by 6.5% on a comparable basis. Looking ahead, we have $53 million of signed but not commenced rent, which will commence over the next several quarters as well as $40 million of annual base rent in our forward new leasing pipeline. Even with the declining rate, or the naturally declining rate of prior period collections as those receivables are paid in full and the increased possibility of disruption is economic concerns loom, we still expect continued outperformance in our revenue and NOI growth in 2023 and beyond. Given our increased cash flow and confidence in continued growth, we are pleased to announce a dividend increase of 8.3%, which will keep us still at one of the lowest payout ratios in the sector as we utilize free cash flow to self-fund our value-add plan without reliance on the volatile capital markets. Speaking of that plan, our reinvestment pipeline continued to deliver despite ongoing supply chain issues as we partnered with tenants to get stores open on time. We stabilized $46 million in projects during the quarter at an incremental yield of 8%, bringing our year-to-date deliveries to $113 million at a 10% yield, creating significant value even in a higher cap rate environment. Since we began this program, we've completed over $800 million of reinvestments at an incremental return of 11%. And importantly, we have another $400 million leased and underway providing a significant future value creation. Keeping our power drives, we believe there will be compelling opportunities in the coming quarters as private less well capitalized landlords struggle with upcoming debt maturities and cash flow constraints. With that said, even in this more challenging capital markets environment, we've continued to find some liquidity to sell smaller non-core assets at opportunistic values with over $110 million in sales transactions completed during and subsequent to the end of the quarter. And importantly, as Angela will discuss further, we have $1.3 billion of liquidity and no debt maturing until 2024, allowing us to be opportunistic from an external growth perspective. Nareit FFO is $0.49 per share in the third quarter, driven by same property NOI growth of 3.6%. Base rent growth continues to accelerate, contributing 480 basis points to same property NOI growth this quarter. Excluding the impact of lease modifications and rent abatements in the prior period, base rent growth contributed 440 basis points, representing a 70 basis point acceleration from last quarter, reflecting continued growth and build occupancy in significant releasing spreads over the last year. Ancillary, and other income and percentage rents contributed 80 basis points on a combined basis, while net expense reimbursements contributed 50 basis points. Revenues deemed uncollectible detracted 250 basis points from same property NOI growth, primarily due to the fully expected moderation of out-of-period collections of previously reserved amounts. As a result, we do expect revenues deemed uncollectible to be a headwind to both same property NOI and FFO growth next year as the total level of revenues deemed uncollectible reverts to historical levels. Build occupancy was up 60 basis points sequentially, while leased occupancy was up 80 basis points sequentially. The anchor leased rate now stands at 95.4%, up 60 basis points sequentially, while the small shop leased rate stands at 88.8%, up 110 basis points sequentially, reflecting another new portfolio record for this metric. And the total sign, but not yet commenced pool, which includes an additional 50 basis points of GLA, related to space that will soon be vacated by existing tenants, totaled $53 million. As we've highlighted in the past, one of the strongest indicators of forward growth is a persistently widespread between lease and build occupancy while both build and lease occupancy are increasing. In addition, the blended, annualized based rent per square foot on the sign but not yet commenced pool remains well above $19, approximately 20% above our portfolio average, reflecting the broad based impact of our granular reinvestment initiatives. From a balance sheet perspective, as of September 30, we had $1.3 billion of available liquidity, only 4% floating rate debt and no debt maturities until mid-2024. As a reminder, with the execution of our amended credit facility in April, we obtained a $200 million delayed draw term loan that we expect to utilize before April 2023 to continue to extend the duration of the balance sheet. As noted in last night's release, we have also renewed both our $400 million share repurchase program and our $400 million at-the-market equity offering program, which were set to expire in January, proactively extending our ability to capitalize on a wide range of capital markets conditions. As Jim highlighted, we are pleased to also announce an 8% increase in our quarterly dividend last night to $0.26 per share, or $1.04 on an annualized basis. This dividend increase reflects the strong growth in taxable income experienced over the last year, while also allowing the company to retain as much free cash flow as possible to continue the execution of the value enhancing reinvestment program. Please proceed with your question. As we've talked a lot about a lot our business plan is built for an environment of higher rates, less liquidity because it's self-funded and because importantly, the absolute returns that we're achieving are quite compelling. And we also, as you're seeing in all of our metrics, Craig, we're driving some real important follow-on benefit not measured in those initial returns in terms of follow-on occupancy and rate and our small shops. We like that it allowed us to outperform during the disruption of COVID where over that 2.5-year period we grew our NOI, I think, at the top of the peer group. But also in a strong environment such as the one we're in today, really, we're seeing more tenant demand than we've seen in quite some time. But then importantly to what's implicit in your question, should we see a reversion to more normalized levels of tenant failure, et cetera, we believe this reinvestment plan is the way to really position a stop perform in that environment as well. And interestingly, even with the small and local tenants we saw demand to backfill those tenants with better, more well-capitalized operators. Obviously, out of the small shop tenancy, whether it's local, regional or national, we're able to drive higher absolute rents, we're typically able to drive higher embedded growth, as well as absolute growth in that portion of our tenancy. But we, like importantly how it's positioned today. We think we've got a very good balance of national, regional, and local tenants that provides great visibility on instability from a cash flow perspective. Please proceed with your question. Just first question, I guess following up on the local tenants and that exposure in the portfolio, wondering if you are seeing any change in the health or ability of your local small shop tenants to pay rent today. We're seeing very good strength out of our entire tenant base, particularly in the small shops. It's reflected Todd in the rents and occupancy levels we're achieving, which we're really proud of. And frankly, as we've executed this plan, an upgrade in the quality of tenancy, which we think is implicit in our results, but something that's worthy of being highlighted. And the other thing I would emphasize is, as both Jim and I sort of talked about in our remarks, out-of-period collections of previously reserved amounts have continued to be pretty significant, we are continuing to collect amounts from 2020 and 2021 and even earlier in 2022. I think that says something, despite the fact that there were some delays in payment with those tenants. When you look at what we've been able to drive in terms of collections and the enforcement of our leases, I think, we've done a really good job there. Notwithstanding, some of the noise from out-of-period collections that you mentioned, Angela, are you expecting to see minimum rent growth continue to improve into the fourth quarter from the 4.4% in the third quarter? And it's being driven by that visibility on the sign, but not occupied pipeline as well as the forward pipeline. So, if you think about it over a long period of time, we feel good that that rent growth is going to trend towards the upper end of the range. Yes, I would say on a year-to-date basis, our contribution from base rent growth, sort of stripping out the lease modification and abatement number, year-to-date is at 430 basis points. And as Jim said, we're very pleased with the signed but not commenced pipeline, the way that that continues to deliver and the leasing pipeline Jim mentioned in his remarks behind that. Please proceed with your question. Given the recent transaction activity, I was hoping you could provide some perspective on cap rates especially curious on where cap rates on grocery versus non-grocery assets are today and how they have moved here over the last quarter. We are seeing Haendel, and I think it's true across the universe, a real slowdown in overall transaction activities. I think in an environment of transition like this, everybody can point to a tight cap rate or a wider cap rate. With that said, I think, it's clear that there is upward pressure on cap rates even for the most core grocery anchored shopping centers due to where the tenure has gone and where the cost to finance has gone. And in part it's a testament to Mark and team finding liquidity from both smaller private buyers, 1031 buyers, et cetera, as well as buyers looking at alternative uses for the properties such as what we capitalized on in College Park, Maryland. Yes, I would comment then when you look at the market over the past few months, it's really been driven by a pretty wide bid-ask spread between owners and sellers. I think you are seeing some owners say they are going to wait and see what happens in the rate environment, and that's really what's driving, I think, some of the slowness in the market today. Yes, I mean, when I look at the pool of assets we sold subsequent to quarter end, there were I believe five shopping centers in that pool, one of which was sold for an alternative use at a very low cap rate. The cap rate, the blend on the $81 million subsequent to quarter end is going to be below where you've seen us transact historically, but we would prefer to wait and give cap rate on the full quarter once we give Q4 results. Looks like the SNO spread widened 20 bps from last quarter, but the embedded rent declined by about a $1 million. So, there is a bit of a nuance between the spread between lease and build occupancy and what we report in the signed but not commenced pool that's footnoted in the supplemental under that signed but not commenced table. So last quarter, the total sign but not commenced pool represented 420 basis points and included 70 basis points of space related to tenants that were currently in build occupancy, getting you down to that 350 basis point spread between leased and build occupancy. Today we're still at 420 basis points in the signed but not yet commenced pool, but only 50 basis points of that is related to tenants that are currently in occupancy. But I think as Jim talked about in his opening remarks and as we've talked about on prior calls, our operating teams are working very closely with retailers. We found that our retail partners are being incredibly flexible in this environment, keeping existing HVAC units or keeping the bathrooms in the locations where they're at, because they are incentivized to get these stores open, and we've had some great successes year-to-date. I would agree, and I would say what we're actually commencing in the quarter is exceeding our expectations. So we talked about the $14 million of rent that commenced this quarter, and the team is doing a phenomenal job of getting the tenants open in an occupancy. And as you could imagine, we're absolutely aligned with the tenants in that regard. Curious what you see is reasonable â\u0080\u0093 reasonably achievable full occupancy, and I'm doing air quotes for those not in the room with me, for the portfolio as it stands today. As we think about the plan, what we're excited about is that we continue to increase not only occupancy, but potential occupancy for the portfolio. And so that's why you're seeing a set records today, but we still believe we have room to run. We believe we have room to run both an overall occupancy of a couple of hundred basis points but we also see it importantly in the high rate, small shop component of our portfolio as well. But another important thing to consider about this strategy, it's not simply about getting to full occupancy. It's about maximizing the ROI on the assets that we have, recycling capital effectively, improving rate, driving NOI growth in doing so in a value-added and disciplined manner. So even in a more full occupancy environment, this is a platform that will continue to create value as we recycle through opportunities that exist throughout the portfolio to create value. But when you look at it, we have another $400 million underway, substantially leased, that's going to be a 9% to 10% incremental return. So, like that we've got several years of visibility of value-added activity even in an environment today where it's a self-funded and internal growth-driven plan. Obviously, we're in an environment today where, I think, it makes sense to pause. Please proceed with your question. Yes, what we've seen and also on the cost side of the equation is we're seeing it come through in terms of the cost to redevelop these centers. But fortunately, we've been able to offset that with the rents that we're realizing on the reinvestment projects driven by the tenant demand. And we think what we like about that is even in an environment of rising cap rates and rising interest rates, which we've always underwritten, we're still creating significant value. Maybe not as much incremental value as when interest rates were in the low single digits, but we're still clearing it by a healthy margin. And importantly, we're setting these assets up for continued growth as the balance of the assets benefit from the investments we're making. Yes, I would also just add to that, that the risk associated with the type of redevelopment work we're doing continues to be very low. So when you think about that complexion from a risk standpoint against the returns we're achieving and where cap rates are today or where they might go, I think, that activity continues to be very attractive on a risk-adjusted basis. It's actually been fairly broad-based across the portfolio, whether it's by region, whether it's by demographic. But also interestingly, we've seen it from both grocery-anchored and non-grocery-anchored portfolio, which really makes us really encouraged about what we're seeing in terms of the overall demand in traffic in centers. Please proceed with your question. Let us get back to you on that in terms of a specific quantum, but you're hitting on a very important point, which is the rents in the small shops are higher. And we're driving benefit from that reinvestment, both in terms of occupancy and the small shop and rate. And we're seeing in those assets growth in the small shop occupancy of several hundred basis points, not to mention rate. But to something implicit, in the start of your question, we're creating huge value in the boxes, too. You're talking about spreads for us of 30%, 40%. And when you look at the yields that we're driving just on the absolute capital invested, repositioning anchors or repositioning portions of shopping centers, that's pretty compelling. I can just say Floris, we do give some good disclosure, I think in the portfolio overview page in the sup, but the different components of the GLA and the portfolio and the rent on each of those buckets. But as your point sort of underscores, while small shop is a smaller portion of the portfolio, our small shop space only represents about 31% of our total GLA across the portfolio. Occupancy gain in that smaller portion of the portfolio certainly has a disproportionate impact, given that the rents in small shop even in place today are $25 versus $16 for the portfolio overall. Please proceed with your question. If you break that down into thirds, basically I would say a third of that $38 million, I would put a zero percent probability on collecting. Those are amounts that we've gone through the process, we've determined they're highly likely of being uncollected. We're continuing to work with some of those prior tenants to get those amounts collected, but clearly the probability on that bucket is lower than on the one-third of the $38 million that relates to tenants that are still active in the portfolio. So in terms of probability, waiting again a third relating to active tenants, higher probability, a third relating to tenants that have moved out but we're still pursuing, and then a third I would put effectively a zero percent probability on. I would also say just in terms of the granularity of that pool today, it is a very small balances spread out across many, many tenants across the portfolio. So it is much more difficult to predict the timing of when those amounts come in and I would say not only might we see some in 2022, maybe some in 2023, as I said in my remarks, we expect it to be pretty minimal. It's just it's becoming much more difficult to have good visibility on, on the timing of those collections given the granularity. And when you think about the total rent during the pandemic period and the collection percentages that this company has achieved, it's pretty impressive. And I think it stacks up against anybody, and I think that goes to the quality of our centers, the quality of our leases, and frankly the focus of the team and making sure that we drive the collection of those prior period amounts. So I'm real pleased with the cash flow that we've been able to capture, and frankly as Angela alluded to earlier the strength of the tendency in being able to pay some of those prior period amounts, some of those deferrals, et cetera but we're finally moving to the other side of that. I guess help us understand what the level of fallout you could see, whether it's boxes or shop there's clearly been some noise in the news about some sort of retailers. And I appreciate the question, and we really tried to lay it out in our prepared remarks as we look at returning to a more normalized level of tenant disruption as we look at the coming quarters. What tenants that we have on watch list wouldn't surprise anybody and we're watching them closely and where we have any opportunities to recapture space, we're doing it and reducing our exposure to those tenants as you would expect us to. So when you look at the in-place rents that we have, and you look at where we've been signing new rents, we have a lot of rooms around, and you look at the discipline on capital, we're not buying these rents. So I like, again the all-weather nature of this plan and how it positions us to grow in a high demand environment such as the one we're in, but also one that's choppier. And I think it's logical to assume, and I think it's a good exercise for you to go through as we have an understanding of the puts and takes as we look into 2023 and beyond. Please proceed with your question. So Angela, maybe just continuing on Samir's line of questioning, not asking for a specific 2023 guidance, but you guys have discussed the 250 basis point headwind from back rents that were paid this year. There's also, it sounds like Jim's comments normalization, or sorry, going to a normalized tenant credit loss. I don't know if that's maybe in the 50 to 100 basis point range, but â\u0080\u0093 and then I think you guys are pretty good on the balance sheet, so not really too worried on floating rate exposure, but can you go through some of the things that absolutely and in â\u0080\u0093 maybe in dollar amounts that we should be thinking about as we're updating our models and thinking about 2023? I mean, I just go back to my prepared remarks, Alex, and the few things we mentioned, which for the most part I think you just articulated. As I mentioned, it's about $21 million of out of period collections. We've seen year-to-date in 2022 that will absolutely act as a headwind to growth next year, and so that's something to be mindful of. I also said in my remarks, and you heard Jim reiterated as well, that we expect bad debt in total to look like historical levels. That's obviously in the absence of prior period collections, not something anybody should be expecting continue â\u0080\u0093 to continue going forward. But I also mentioned in my prepared remarks, we have a $200 million delay draw term-loan that we may utilize to continue to extend duration across the balance sheet. As we're talking this year, the same property guidance implies kind of 450 basis point contribution from base rent at the midpoint of the range. So the growth we're seeing in the current environment based on the strength of leasing demand and based on the minimal amount of fallout we have had this year certainly can support as we look into 2023, a more normalized level of tenant disruptive activity while still putting up as Jim underscored in his prior comments, very strong top line growth. That's all we've highlighted at this time, Alex. I think first you'd start with target who is said they're distributing, 95% of their orders are coming from their stores, and they said on multiple calls that the store is the center of what they do. And looking at taking a portion of those stores for last mile fulfillment you saw Wal-Mart do the same thing at the start of the pandemic, and now that's flowing down into some smaller retailers like junior boxes where you see an Ulta for instance, that's taking a portion of their store to allow for it. Prior to the pandemic, we had mostly large format retailers and grocers, now it's a wider range where they're interacting with the customer, both in the store, taking the most expensive part of the delivery out of it by having curbside pickups. So where we've really seen it though is in, I think some of those small shop and junior anchor retailers, like in Ulta, who's utilizing their space and their sales floor area a portion of it for last mile. Please proceed with your question. Angela, I know it's up in 2023, I think about $14 million sequentially but just from a timing perspective, can you just give a little bit of a sense of when that commences or like a time-related ABR for the year, just some type of incremental color on how we should be kind of flowing that through the model? As I look at the 2023 commencements, so it's $32 million in total in 2023. As we continue to sign leases in the fourth quarter and early in 2023, you'll continue to see that second half number be added to, but of the existing $32 million in that pipeline it's pretty weighted to the first half of the year. If we think of that, again I know you guys aren't doing 2023 guidance, but you talked about kind of the minimum rent growth for this year and I think 4% to 5% range. I think we give really good visibility on the sign, but not commence pool. So I think at this point a little bit of a hard question to answer, but I would just reiterate that I think the total size of the sign, but not commence pool. The waiting as we described in 2023, the timing in 2023 is as high as it's been in any year, certainly, and I think that bodes really well for growth overall. As we look into next year, we're not counting on significant speculative activity. We've done most of the business already, which is always a good position to be in and we're liking how we're seeing tenant demand and momentum continue to build in our forward pipeline. And then just kind of one curiosity, I guess we talked earlier the call about kind of 21% from the local tenants, but how much of that bucket is like single kind of unit operator versus local guys who may have kind of multiple units and a little bit more of a revenue base to lean on in case, the economy does weaken. It's a bit of a mix and I would point to some things we talked about on prior calls in terms of our underwriting standards, because coming out of the pandemic, our leasing teams partnered with Angela's group in finance to really tighten that up. So our credit profile is much better today, I'd say both from a local and a national perspective, but we're really excited about the depth and quality of local tenants that we have. Please proceed with your question. And it's against Ki Bin, I think versus other environments, a supply demand backdrop that's incredibly supportive for landlords. So as we have calls with national, regional and local tenants alike and meetings we remain very encouraged by the breadth of that demand, as I talked about and the depth of it and the position that it puts us in as a landlord to continue to drive rate. I like how we're positioned to perform particularly on a relative basis, again given our rent. Our traffic levels continue to remain strong and elevated, and we in particular are benefiting from a value added reinvestment program that's transforming the portfolio. If there's a long regulatory road ahead and as Brian said, this will take time to play out, but we like how we're positioned both on an absolute basis given the productivity of the stores as well as a relative basis given the limited degree of overlap our portfolio has. Please proceed with your question. I would say based on the significant amount of free cash flow we generate, we can continue to fund 100% of our redevelopment activity on a leverage reducing basis. So we're really not, as Jim sort of mentioned earlier, we're not beholden to the disposition market or the public equity market in terms of continuing to fund the portfolio transformation efforts and generate those very attractive 9% to 11% incremental returns. Please proceed with your question. And I can see your disclosure that during the last 12 months, the average ABR for new anchor leases being around $16 for square foot. So if it's a consistent use, your capital per foot over a tenure basis can be a couple of bucks a foot. And so when you're coming off a rent that's $8, $9, $10 and you're dealing with a new rent that's $16 or higher, you have the ability on a net effective basis to be positive, not to mention the ROI. And then every quarter we show you what we've delivered and that's really I think, the litmus test for us in terms of whether or not we're creating value in the repurposing of a box. You could spend $40 a foot, you could spend $70 a foot, $80 a foot even more depending on what you're doing with the box. If you're dividing the box up, say you're taking a large box and you're making a small shop, you could be at the upper end of that range. And again the decision as to what to do with that box is going to be driven by what we believe is right for the center, but also what we think is going to maximize ROI and that that comes through in those reinvestment yields that that we show you. I think what's happening in the capital markets is clearly we're going through a reset, and I don't think levels have found normalcy yet. So you have many lenders who have pulled back in terms of providing debt capital or where they do, it's pretty high cost debt capital that will work itself through. But even in that environment, I do think you have private landlords that have upcoming debt maturities who've been reliant perhaps on low interest rates to recapitalize, refinance and take equity out of assets. And that's where we think our advantages as a national platform with access to understanding tenant demand, the ability to redevelop and reposition boxes, and importantly the track record to do so, and also the liquidity to capitalize on it. We're not pounding the table and saying it absolutely will happen, but it feels to me like we're setting up for a very attractive cyclical redeployment period. Please proceed with your question. One you want to see where cost of capital is settling out, but also perhaps even more important than cap rate or equally important to cap rate is that you're finding opportunities to truly grow ROI and achieve very attractive unlevered returns even in an environment such as the one we're in. It's certainly something that happens in cycles and we could see platforms combining in part because there's certainly benefits to having scale such as we have in dealing with landlords or excuse me, in dealing with tenants. Please proceed with your question. Not a statement that we're going to use it or not use it, but we always want to have those tools available to us as with every other tool necessary that we think can drive our growth as an enterprise. But again I think what's important here to appreciate is what Angela highlighted before, which is we have a self-funded plan generated and driven by opportunities embedded in the assets that we own, that we believe is going to deliver growth towards the top of the peer group. It's a plan that we think is all weather, and again it's driven by opportunities that we control and funded by free cash flow as Angela highlighted on a leveraged â\u0080\u0093 de-leveraging basis. But I think as we've demonstrated over the last six plus years that we've been part of this team we, we will be opportunistic with capital and, and step into those situations that we think really enhance long-term shareholder value. I think retailers, it's something that I think the entire market that was grappling with here over the past few quarters, but I think we've seen that stabilize a bit. In our discussions with our retail partners, incredibly focused on getting those stores in and open ahead of holidays and even work out â\u0080\u0093 working outside what typically would be blackout windows pushing those out. There were periods where they didn't want to get very close to Thanksgiving, but they're really focused on getting those stores open and having those stores fully staffed. So we've seen that certainly improve, and I think a good signal of that from our retail partners is that focus on getting a lot of those stores open this year. Please proceed with your question."
}