{
    "symbol": "BRX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 15:10:19",
    "content": " As we look forward and consider the natural moderation of prior period collections as well as the potential for economic disruption, we remain very pleased and confident in our strong visibility of continued growth as reflected in our $53.8 million of ABR and leases signed but not commenced that will commence through 2024, our forward new lease legal pipeline of $50 million of additional leases under negotiation, our real-time volume of new deals coming into our leasing committee for commencement in 2023 and beyond, our current and ongoing discussions with tenants to accommodate their store plans in our centers as retailers try to grow their most profitable channel. In addition to these visible growth drivers, we continue to deliver tremendous value through the ongoing execution and delivery of our reinvestment pipeline, as evidenced by another $30 million of reinvestment delivered during the quarter at an incremental return of 11%. The spread between lease and billed occupancy remains 350 basis points and the total signed but not commenced pool, which includes an additional 70 basis points of GLA related to space that will soon be vacated by existing tenants increased by $2 million this quarter to $54 million at a blended rate of $19.20 per square foot, more than 20% above our portfolio average ABR per square foot. Your line is now live. Your line is now live. Your line is now live. Your line is now live. And what we're particularly encouraged about is, again, that not only the signed but not commenced pipeline but the forward legal leasing pipeline and the conversations that we're seeing that allow us to capitalize and continue to capitalize on our attractive rent basis to drive more accretive reinvestment projects and more fundamental growth and ROI. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}