{
    "symbol": "WHR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 11:30:26",
    "content": " As we reset our cost structure, we expect to expand ongoing EBIT margins to approximately 7.5% and deliver approximately $800 million in free cash flow. Next, as we execute $500 million of strong cost takeout actions throughout the year, alongside raw material benefits, we expect a positive 425 basis point impact to margins. As we navigate temporary demand declines, an easing inflationary environment and execute our decisive cost takeout actions, we expect to deliver approximately 35% to 40% of our earnings in the first half of the year. During that same time period, we have returned over $5 billion cash to shareholders, including $900 million of buybacks in 2022 and a 25% increase in our quarterly dividend, representing the tenth straight year of dividend increases and nearly the 70th consecutive year of paying dividends. First of all, as you heard from my prepared remarks, there's a lot of reason to believe that consumer demand and particularly U.S. housing as it exits will head into much stronger years because, as you know, there's fundamentally structurally undersupplied housing market in North America but not only in North America which is at 1 point will materialize. If you completely zoom out, Sam and you've observed us for many years, of a total $800 million to $900 million, given where we are in the year, I would say we have right now a 70% to 80% fill rate of our actions which is actually pretty high compared to other years. But given the $3 billion purchase price, I think it would be really helpful for investors to understand what the contribution is expected in 2023 on sales and margins and on a quarterly basis in the upcoming year to kind of give us a sense of how the acquisition is doing, I think, would be very, very helpful. So the follow-up I think from my side would be it seems like by the second half of the year, you're assuming that industry volumes get closer to things like for your own volume assumptions, there's an assumption for a share gain, so potentially a little volume growth that will help drive some of the year-on-year capability in margin as the year progresses."
}