{
    "symbol": "WHR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 11:54:02",
    "content": " Additionally, price increases or pricing actions referenced throughout this call reflect previously announced cost-based price increases. Before I get into the results of the quarter, Iâ\u0080\u0099d like to step back and share with you the progress that we are making structurally improving Whirlpool for the better. We are operating in unprecedented times, but thanks to our strong balance sheet, transformation efforts and the hard work of team, Whirlpool continues to perform better today than in past and we will see a record performance over the medium-term. Today, we will discuss our second quarter results and highlight how we continue to successfully manage our business despite near-term pressures, while at the same time remaining focused on delivering towards our value creation goals over the long-term. Throughout the past years, we have demonstrated that we take needed actions early and decisively, and we have done so again in the second quarter. We are confident in the actions we have taken to mitigate industry headwinds, including our focus on enhanced operating margins with strong global cost-based pricing and broad cost reduction initiatives throughout the world. In particular, we delivered solid ongoing EPS of $5.97 and 9% ongoing EBIT margins, with ongoing EPS approximately 50% better than the second quarter of 2019, even in the face of historic levels of cost inflation and the demand slowdown. We experienced mid-single-digit to double-digit demand slowdown in key countries in the second quarter, alongside a rapidly strengthening dollar and yet we impressively delivered relative stable revenue of down 2%, excluding the impact of currency. Even more impressive, North America delivered over 14% margins, demonstrating the structurally higher profit levels of a region. Next, with the confidence we have in our business and the strength of our balance sheet, we continue to fund innovation growth, while returning approximately $400 million to shareholders in the quarter. Additionally, we signed an agreement for the divestiture of Whirlpool Russia business, triggering $747 million of one-time almost entirely non-cash charges. We expect the Russia sale to close in the third quarter and we believe it to be the best course of action for our employees, shareholders and overall business. Lastly, the near-term impact on demand from consumer sentiment led us to revise our full year ongoing EPS guidance from $22 to $24. However, to put it into context, this guidance represents the second highest full year ongoing EPS in the history of the company, despite inflation running at 40-year highs and with additional headwinds that we have been discussing. Turning to slide five, we show the drivers of our second quarter EBIT margin. Led by our fully executed cost-based price actions across the globe, we successfully delivered positive price mix resulting in 675 basis points of margin expansion. Net cost negatively impacted our margin by 175 basis points, largely driven by increased logistics and energy costs alongside operational inefficiencies from supply disruptions. Lastly and in line with our expectations, raw material inflation continues to be a significant headwind negatively impacting margin by 750 basis points. In the quarter, the industry continued to be negatively impacted by softening consumer sentiment alongside the constrained supply chain. We believe the fundamental strength of consumer demand trends remain intact, as we continue to see elevated cooking appliance usage over 2 times above pre-pandemic levels. We delivered 14.1% EBIT margins, despite inflationary pressures, alongside the negative impact of operational inefficiencies and temporary volume deleveraging. The revenue decline was largely attributed to reduced volume, which was negatively impacted by the war in Ukraine, including our operations in Russia flowing to a near shutdown, excluding currency, the regionâ\u0080\u0099s revenue declined by approximately 10%. That was more than offset by lower volumes and cost inflation, resulting in the EBIT margin contraction of 2.3 points in the quarter. As a result of this transaction, we recorded $747 million of non-recurring primarily non-cash charges, including $346 million primarily associated with the write-down of Russia assets, which triggered a comprehensive assessment, resulting in a $384 million goodwill and intangible asset impairment in the EMEA region. Net sales growth of 3%, driven by strong execution of cost-based price increases, fully offsetting expected industry softness. The region delivered strong EBIT margins of 7.2%, once again demonstrating the consistency in which this region delivers results in any environment. Revenue growth of 26% is largely attributed to higher volumes in India, as the region was impacted by COVID-related shutdowns in the prior year period. The region delivered a significant EBIT improvement of $19 million, resulting in EBIT margins of 6.8%, driven by cost-based pricing actions and higher volumes, fully offsetting cost inflation. Now, on slide 12, I will turn it over to Jim to discuss our full year 2022 guidance. We have revised our full year guidance to reflect the larger than expected industry slowdown, while there is no change to our expectation for long-term growth, including a robust multiyear appliance demand outlook, we have adjusted our 2022 guidance to reflect the current environment. As a result, we now expect a revenue contraction of approximately 5% to 6% and ongoing EBIT margins of approximately 9% for the year. Next, we continue to expect to generate significant free cash flow of approximately $1.25 billion or around 6% of net sales. Turning to slide 14, we show the drivers of our full year ongoing EBIT margin guidance. We have increased our expectation of negative net cost by 50 basis points to a negative 150 basis points, reflecting the added inefficiencies resulting from temporarily reduced volumes and additional logistic and energy costs. Next, with the strengthening of the dollar, we now expecting negative currency impact of 25 basis points, driven primarily by Brazil and India, all other drivers remain unchanged. Including our expectations of previously announced cost base price actions driving 725 basis points of margin, fully offsetting raw material inflation, which we expect to peak in the second and third quarters. We are reducing our global growth expectations to negative 6% to negative 4%, reflecting updated industry expectations for North America in 2022. In North America, our near-term growth expectations are negative 7% to negative 5%, with a second half industry performance in line with the second quarter. Looking beyond 2022, we remain confident in the fundamentals of the demand environment for North America, supported by; one, broader home nesting trends; two, an undersupplied housing market; three, a strong replacement cycle; and four, continued elevated levels of consumer engagement with our appliances. Regarding our EBIT guidance, we expect North America to deliver approximately 50% EBIT margin, which remains in line with our long-term expectations for the region. Our industry and EBIT margin expectations for EMEA, Latin America and Asia remain unchanged. We continue to expect to generate significant free cash flow of $1.25 billion, with cash earnings of approximately $2 billion and a modest level of inventory supply recovery, while funding innovation through our capital investments. We repurchased approximately $300 million of our stock in the second quarter, bringing us to over $800 million year-to-date. And let me recap what you heard over the past few minutes, we have a right global action in place to deliver strong second half, our raw material inflation expectations remain unchanged, and we do expect raw material inflation to peak in the second quarter and third quarter. Consumers continue to use our clients that in the elevated rate, alongside strong replacement demand and undersupplied housing market. Lastly, we are on track to return approximately $1.5 billion in cash to shareholders in 2022 and we have reduced our outstanding share count by over 10% in the last four quarters alone. Your line is open. I wanted to focus first on North America, and obviously, the big driver of the change in your guidance, part in -- part of the second quarter but also in the back half. Multiple questions in one question, let me still try to address them, North America demand and Joe should probably also add some color. But we did see in pretty much around the late April, May time frame, a pretty strong drop in consumer demand, which is ultimately driven with consumer sentiment dropping off and we all know it, I mean, itâ\u0080\u0099s consumers -- itâ\u0080\u0099s not that consumers have no cash available, I think, versus disposable income, itâ\u0080\u0099s the consumer sentiment driven by inflation, all the bad news around war and the pandemic, which is still now behind us. We do not see both fundamentals of consumer sentiment going away probably for year end, because the fundamental drivers between inflation, war, and probably, upcoming mid-term elections donâ\u0080\u0099t help consumer sentiment probably pretty much until November. But again, that has not changed our outlook what it means for 2023, 2024 in terms of long-term demand and we continue to remain bullish on the long-term demand trends. I will put it differently, pretty much if you look at Q3 last year Q4, Q1 and Q2, itâ\u0080\u0099s pretty steady with a slight, slight increase towards the end of Q2. In addition to the comments Marc made, we really saw the sentiment impact the promotional period, the holiday period in Q2 and so that was the factor that contributed to our outlook changing for the back half. But if we look at the fundamentals that still remains in a very positive light and so our outlook there remains as it has been, but the back half really is where the increased sentiment depression occurred. And maybe just as a follow-on, Joe, you kind of hit on promotions there and when -- it would be very helpful, I think, to kind of unpack the drivers of reducing the North American margin guidance from 16% to 15%. But as you know, we have shared that our price margin and mix, all those kind of fully on track and as kind of offset of the RMI, we expect that to continue for the rest of the year. The deleveraging is kind of what we were talking about in terms of impacting margins and also the inefficiencies as a consequence of some of that lower volume that really kind of the new news that occurred in Q2, so maybe just separating the two. From a price and promotion standpoint, I think, we have over many years and quarters demonstrated a high ability to manage that space, only participate when ROI positive or a positive returns to the company. Of course, there will be always some promotions but nothing has changed versus our prior outlook in terms of how much we think we can get from price mix. To Joeâ\u0080\u0099s point, a slight margin drop is largely coming from volume deleveraging, because we have to adjust inventories in line with market demand and that is just -- has a certain cost associated with that volume deleveraging and some temporary cost, which we were pretty convinced will go away in the short-term. Now to see the positive, and again, we should put that always in context, with 9% margin in Q2, that was an environment where we had a 40-year high in inflation and market demand being down. That tells you a lot about the resilience of this business and North America at 14% in that environment, I think, speaks to the health and the structural changes of this -- of our business. Your line is open. So I am just trying to get a sense if your -- of your view of the likelihood of a sale in light of the idea that European demand is weakening, the financing markets and the capital markets are also to an extent tightening up and FX is a pressure. And so within this quarter and as we mentioned in our remarks earlier, we did at least reached an agreement to divest of our Russia business, which was a necessary step considering the sanctions in the environment that we were trying to operate in and that is a progression along the past in terms of our strategic assessment here. Sam, maybe just adding to this one, as we indicated in the April earnings call, we are looking all options and just to be clarified the options on the table are anything from selling the business to partial sale to keeping business. Now keeping the business would have to qualify and as is not really the option, keeping the business would be a reduced footprint or a different Whirlpool Europe, pretty much all options on the table, but at this point, it would be pure speculation to see what the likely outcome is. But as we stated before, we do expect by the end of Q3 to kind of pretty much come to a conclusion of our strategic review. My second question, mathematically, it looks like your guidance for pricing year-on-year is going to be better in the second half than in the first half by about point or two. From a pricing promotion standpoint, as we touched on earlier, obviously, that is very different than, I will say, years ago and we expect that to remain at, I will say, muted or moderated levels and has been in Q2 to-date and thatâ\u0080\u0099s kind of where we are at from a pricing promotion standpoint. The bigger factor is your first point, which is how things affect or take on throughout the year kind of the cumulative impact of that, as each of the final decisions were made in the Q2 period. Your line is open. Now, obviously, the combination of price increase in housing markets, which were well ahead of the extra supply and the mortgage rate put a big dent on home affordability, which led to cancellations, and I would say, slowdown in the short-term. So I would expect that also going forward, call it, the next 12 months, this is to be the case, and yes, I would probably say, some correction home prices is necessary to and re-stabilized market. Doesnâ\u0080\u0099t change the long-term outlook, the positive outlook which we have in housing, but I donâ\u0080\u0099t think the next 12 months you see -- we will see a very dynamic market in that respect. So we did not see a dramatic drop-off by now in Q2, but we also donâ\u0080\u0099t expect a lot of growth now in Q3 and Q4. I didnâ\u0080\u0099t see really any material changes from what we are expecting in Q2 and then the remodel area, which is kind of a quasi builder area, didnâ\u0080\u0099t really see any new information there either in Q2. Just as a follow-up question, I guess, the share repurchase activity, you seem to be running at a pretty good clip here mid-year. And so we are turning about a $1.5 billion to shareholders, which the dividend makes up about $400 million of that and then we did the majority of the share repurchase in the first half of the year with where the market conditions were in all that, as well as where our cash position was, but that doesnâ\u0080\u0099t change our estimate for the full year right now. Your line is open. First of all, on the topline, as we indicated earlier, we do see the current environment is temporary, but doesnâ\u0080\u0099t change our long-term demand outlook. So we do expect and itâ\u0080\u0099s, obviously, this is not a 2023 or 2024 guidance, but right now we would assume by 2023 and 2024 we would see healthy underling market growth, again driven by replacement needs, housing markets and by higher usage of appliance. In that environment, we still expect in particular North America to rebalance our market share back to pre-COVID levels. In addition, globally, we have several growth markets, which continue to -- in the combination between strong market share and underlying market dynamics like India. On the margin side, Liz, right now, again, we are pretty much guiding this year to a 9%. Keep in mind that 9% also includes several kind of costs which are not typically in the cycle, because you still had expressed shipments all kinds of extra costs, which were related to supply constraint, which obviously will go away and it has a significant volume deleveraging. So just taking that out of the equation, you start getting a lot closer to 11% coupled that with additional cost action and then focus more and more on high margin businesses that we believe it will be 11% to 12%. And just to maybe add to what Marc said there is, we have talked about to as we go forward our focus on higher margin businesses and thatâ\u0080\u0099s where we will invest on top of this. And then even as we talked about the strategic review in EMEA and Marc alluded to that no matter what the scenario is it would not be the same as it is today and so even in a keep situation, you have a turnaround and a fundamentally different business structure there. Your line is open. We still saw quite significant supply chain disruption, pretty much, I would say, until April to early May that impacted, but the situation got better as Q2 progressed. On a going forward basis, we still donâ\u0080\u0099t fully expect a fully normalized supply chain environment, but still significantly better than what we have seen last year, and probably, until April, May. Specifically then on production levels and inventory, with the drop-off of the April, May volume, frankly our inventory towards June is probably slightly elevated to what we had in minds, because we assumed a higher market demand level. But as you would expect from us, we are adjusting production and inventory in line with what we see right now from industry forecast, or put it differently, we are correcting production, we did already in June and we will continue to do so going forward and we are not going to wait until year end. We do believe the raw material market will turn favorable, notable extend as we like in 2022, but it starts turning more favorable, and thatâ\u0080\u0099s why I said earlier, we do think inflation peaked in Q2 and Q3, but above and beyond, we are taking additional cost actions. So we are -- you should expect us to be a very disciplined on net working capital and how we manage the net working capital and our cash flow accordingly, and in that context, I am also very pleased that we are -- in our scenario we are able to keep the guidance on the cash flow. Your line is open. Just going back to the promotional dynamics, I was hoping if you could help quantify how much of the 420 basis points year-over-year decline in North America EBIT margin came from the increased seasonal promotional activity and how do you expect that to trend in the back half, are you assuming kind of a similar magnitude of promotions or any color there would be helpful? But as we talked about earlier, when we look at price mix for the year, for the total company, which is very reflective of North America, because itâ\u0080\u0099s about half of our business. We have really said that in the back half of the year, we still expect to have price mix benefits that are still coming, so that would imply that we donâ\u0080\u0099t see whether itâ\u0080\u0099s now or in the back half of the year, promotions being a big impact on our margins overall. As we have talked about, the impact on margins is more been driven from; one, a cost inflation perspective, which has come whether it be materials or logistics or labor or freight and warehousing costs again; or thatâ\u0080\u0099s come from volume deleveraging as we have just managed the business to a lower level of demand right now and had to reduce our production levels. Maybe just to build on that to Jimâ\u0080\u0099s points, the deleveraging did occur pretty much in Q2 a bit. From a price promotion standpoint, expectations remain, didnâ\u0080\u0099t see elevated levels in Q2, so those are more static than anything else. As Joe talked about earlier, there are price increases we took in Q2 that fully running in the back half of the year. And then as we talked about too, we are seeing material cost is maybe being stable in the back half of the year that we are hitting the peak now. What I mean with that is, first of all, if you look at Q1 and Q2 margins, we are pretty close to 14% in North America, with 15% in Q1 and 14% on Q2. So we are pretty much on the run rate, despite inflation will be just at peak in Q2 and Q3 and despite the volume negative environment. So, I would say, with this North American margin, given the environment are spectacularly strong. They clearly demonstrate how strong that underlying business is and again, thatâ\u0080\u0099s with all the volume deleveraging and with all the inflationary pressure. So also if you look at the competitive environment, I donâ\u0080\u0099t think you will find any competitors who are even close to these North American margins. So I think that is a price, the North American margins and others are concerned going forward. Your line is open. First of all, just some clarity, you made a comment about rebalancing market share back at pre-COVID levels and so what I wanted to understand in the back half of the year, if industry volumes are softer and inventories are normalizing if not a bit heavy, is it your intention -- itâ\u0080\u0099s an environment that certainly seems right for more promotions either driven by retailers or competitors to try to make up some of the lost volume coming from softer consumers, is the year intent to participate in promotions or is it your intent to not participate in promotions and what does that suggest for your market share outlook through that period of time? Just kind of setting up a response to that question, if you look at what transpired in Q1 to Q2, we did grow share slightly in Q2, even in a depressed environment. We think we will continue to look for opportunities to improve and rebalance share back to pre-COVID levels in the back half and itâ\u0080\u0099s a -- frankly into 2023, in terms of promotions, I mean, thatâ\u0080\u0099s always the case that there is different factors in the market. And as I said, we slightly grew, excuse me, in Q2 and we expect to kind of continue that into the back half of 2022 and into 2023, promotions is a bit of a constant how we participate is also a bit of a constant in that. And I think what you are looking at to here is the year-over-year and when you take year-over-year, it would imply that year-over-year the back half of the year, cost, especially in that cost is a little bit less of an impact. The second thing is, when we look at the back half of the year and we talk about, itâ\u0080\u0099s not as much the volume deleveraging here, but you are getting an offset with some of the cost reduction actions that we talked about earlier, the things such as reducing our hiring, the things such as looking at some of our discretionary expenses in other areas. That helps to offset some of those net cost headwinds that we are seeing in the back half of the year and thatâ\u0080\u0099s why it implies that the back half would be slightly better year-over-year, but for the full year we are still at about 150 basis points. We changed our guidance, but frankly, we donâ\u0080\u0099t like, but itâ\u0080\u0099s a guidance towards the second best year ever in the history. Yes, we would have like to make it another best year, but we are going to be pretty close and I think all the actions which we talk about now for the back half of 2022 will line up our business very well for 2023 and going forward."
}