{
    "symbol": "TGLS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 13:48:08",
    "content": " We are very pleased with our record fourth quarter and full year 2022 results, which reflects above-market performance attributable to the resiliency of our business model and previously implemented high-return automation and capacity intensions. Our focused efforts to further penetrate the single-family residential market drove fourth quarter and full year 2022 single-family residential revenues, up by 59% and 73%, respectively. It is also important to reiterate that approximately two third of our single-family residential revenues are tied to repair and remodel demand, which has remained relatively resilient in our markets and for our products despite higher interest rates, pressure in natural construction activity more broadly. Total revenues increased 60.2% year-over-year to a record $211.1 million for the fourth quarter and 44.2% year-over-year to a record $716.6 million for the full year 2022, attributable to a strong rebound in commercial activity growing demand for our single-family residential products and market share gains. This strong fourth quarter performance contributed to a year of record full year gross profit, including 800 basis points of margin expansion to a new record full year gross margin of 48.8%. The step-up in our gross margin is directly related to the structural and sustainable operational improvements we've made in our business through our high-return automation initiatives as well as a higher portion of revenues in single-family residential, which is more accretive to margins given the higher mix of manufacturing revenues versus lower margin work. Based on the positive momentum in our business throughout 2022 and a solid start in the first quarter of 2023, we are confident in our ability to achieve another year of record growth in the revenue and adjusted EBITDA for the full year 2023. Based on this sales outlook, our anticipated mix of revenues, and our expectations for cost and expenses, we expect full year adjusted EBITDA to be in the range of $300 million to $320 million, representing a 70% growth at the midpoint of the range. We expect gross margins to be in the high 40s range for 2023, mainly attributable to operating leverage on higher sales, structural advantages from our vertically integrated operations, partially offset by an increase in the mix of installation versus product revenue for the year."
}