{
    "symbol": "TGLS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:44:12",
    "content": " Third quarter single-family residential revenues increased 44% year-over-year to a record $85.8 million and accounted for 43% of total revenues, reflecting an expanding customer base and share gains. SG&A was $35.2 million compared to $21.7 million in the prior year quarter, with the majority of the increase attributable to shipping expenses as a result of a higher sales volume and higher unit shipping costs in part to serve a more fragmented single-family residential market. The structural and sustainable operational improvements related to automation initiatives, the shift in our business strategy to penetrate the higher-margin single-family residential end market where we don't do installation, and improved operating leverage on higher revenues, which have more than offset depreciation and labor and other indirect manufacturing cost. Our impressive history of cash generation has provided us with financial flexibility to drive additional value for our shareholders, including a recent 15% increase to our quarterly dividend announced last quarter, and today's authorization of a new $50 million share repurchase program. Based on this sales outlook, our anticipated mix of revenues and our exceptional margin performance, we now expect full year adjusted EBITDA to be in the range of $240 million to $255 million, representing 67% fully organic growth at the midpoint of the range. Gross margins are now expected to be in the mid- to high 40s range for 2022, mainly attributable to the leverage on higher sales, favorable pricing and FX dynamics structural advantages from our very integrated operations and an overall higher mix of product versus installation revenue for the year. But nevertheless, we were able to generate quite a bit of cash flow from operations and in line with what we discussed earlier, we continue to invest on growth CapEx to get to about $950 million in sales by 2023 or operating capacity of $950 million in sales."
}