{
    "symbol": "SAN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 10:41:04",
    "content": " We've built a strong franchise in Europe, and we're strengthening our position in the U.S. We are recognized as global leaders and have been in the top 3 over the last 10 years in businesses related to energy transition and infrastructure, both of which are expected to grow in a significant way in the next few years. And this cross-border collaboration revenue, not achievable by local banks and which we measure, we've measured for several years, was EUR 3.4 billion in '22 and represents 50% of CIB total revenue and is growing at 33% last year. Q4 increased 6% versus Q3, mainly driven by Europe, 13%, mainly in Spain with a 25% growth and another strong quarter in North America after record NII in Q3. We improved this year, and we were able to end 2022 close to our target despite the inflationary pressures and the lag in some regions between its impact on cost, almost -- which is almost automatic mainly in Latin America, and the uplift to revenue from higher interest rates, which will continue to fit through the coming quarters. All combined, we expect cost of risk to increase in 2023 but remain below prepandemic levels of in -- that we had -- of 2.85% in 2019 as the improved portfolio mix will support the asset quality. In terms of coverage provisions, et cetera, the EUR 1.4 billion macro provisions we made in 2022, for the group as a whole, we believe, are sufficiently prudent to support the guidance of a cost of risk of below 1.2% for next year. This is also about the global businesses and the Santander network, which has been one of the key advances we've made in the last few years, and there's a lot more opportunity to leverage these global businesses as we're already doing and showing with CIB, Wealth Management and payments and auto to a lesser extent. So I mean the structural hedge in the U.K., which was the final question, it's pretty stable at around GBP 100 billion, so GBP 100 billion, more or less, structural hedge in the U.K. Is that relative to the actual number reported in 2022, the 4.8% or the underlying one of 4.6%, which excludes the one-off that we saw on Q4."
}