{
    "symbol": "CORZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 22:49:09",
    "content": "  Steven Gitlin: Good afternoon, ladies and gentlemen, and welcome to Core Scientific’s First Quarter Fiscal Year 2022 Earnings Call. Before we begin, please note that on this call certain information presented contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include without limitation, any statement that may predict forecast, indicate or imply future results, performance or achievements, and may contain words such as believe, anticipate, expect, estimates, intend, project, plan, or words or phrases with similar meaning. Forward-looking statements are based on current expectations, forecasts and assumptions that involve risks and uncertainties, including but not limited to, economic, competitive, governmental and technological factors outside of our control that may cause our business strategy or actual results to differ materially from the forward-looking statements. For further information on these risks, we encourage you to review the risk factors discussed in Core Scientific’s periodic reports on Form 10-K and Form 10-Q filed with the SEC, and Form 8-K filed today with the SEC, along with the associated earnings release and the safe harbor statement contained therein. This afternoon, we also filed a slide presentation with our earnings release, and posted the presentation on our website at corescientific.com in the Events & Presentations section. The content of this conference call contains time-sensitive information that is accurately only as of today, May 12, 2022. Joining me today from Core Scientific are Chief Executive Officer, Mr. Mike Levitt; and Chief Financial Officer, Mr. Denise Sterling. On behalf of our nearly 300 employees who work in our corporate headquarters and data centers around the country, welcome to today's first quarter 2022 earnings conference call. Before we review first quarter results, I'd like to comment briefly on current market conditions. However, market conditions are slowing the flow and limiting the availability of outside capital required to fund our industry. We cannot control the price of Bitcoin or other digital assets or the sentiment of the equity markets, but we can control our execution, our focus and our ability to create value over the long-term for our shareholders. We self-mined 3,202 Bitcoins in the first quarter as illustrated on slide 5 of our earnings presentation, representing more than the second and third largest miners combined. Last week, we announced that we also mined 1,121 Bitcoins in April for an average of 37.4 Bitcoins a day, again, more than any other public miner. At quarter end, we operated a total of 16.2 exahash in our five data centers. And by the end of April, 17 exahash across our self-mining and hosting businesses. To provide a summary of our first quarter financial performance, I'm pleased to introduce our CFO, Denis Sterling. After Denise's comments, I will return to discuss a few additional subjects. I'm honored to join you today, and look forward to meeting our shareholders and the analysts who cover Core Scientific. In the quarter, we generated revenue of $192.5 million, an increase of 255% over first quarter 2021. Importantly, this loss was driven primarily by three items: 2 non-cash mark-to-market adjustments, as accounting rules require us to revalue private securities we issued as well as digital assets we produce at a different level than their original value and stock-based compensation. And as suggested, requires us to re-measure the value each quarter. The second adjustment is a $54 million reduction in the value of our digital assets, which correspondingly increases our quarterly expenses. Accounting standards require us to record impairment each quarter, when they value our digital assets decline. Unfortunately, these rules do not permit us to mark these digital assets up when their values rise. And last, stock-based compensation in the quarter totaled $25.8 million, and these represent employee stock options that previously were issued and have now begun to test. Excluding these and a few other non-operating items, adjusted EBITDA for the quarter was $93 million, an increase of 644% over the prior year. Operationally, we continue to expand our total cash rate from 13.5x ash at the end of 2021 to 16.2 exahash at the end of March. Digital asset mining revenue of $133 million or 69% of total revenue, hosting revenue of $33.2 million or 17% and equipment sales of $26.3 million or 14% of revenue. Hosting revenue increased by 162% year-over-year as a result of contract renewals for existing customers and new customers filling available hosting capacity, as we brought it online. As a reminder, self-mining and hosting revenue will represent an increasing share of our revenue going forward. The first was, because we continue to expand our mining fleet, the depreciation expense associated with the larger fleet increased; and second, as the self-mining and hosting fleet has increased also, the consumption that -- it has also increased the consumption of electricity. Additionally, we previously indicated, our average cost of electricity has risen by approximately 15% to 20% over prior assumptions for 2022. First quarter research and development expenses totaled $3.3 million, an increase of approximately 176% posted in the first quarter 2021, driven by higher stock-based compensation and an increase in project-related professional fees. Sales and marketing and general and administrative expenses totaled $41.6 million, a nine-fold increase over 2021. Non-operating expenses, including the convertible note valuation mentioned earlier, also interest expense, loss on debt from extinguishment and other non-operating expenses net totaled $397.1 million, an increase of $394.9 million from 2021. The net loss for the quarter was $466.2 million, as compared to net income of $6.8 million in the prior year. Again, this loss was primarily driven by non-cash valuation adjustments to our convertible notes and digital assets held, as well as stock-based compensation. First quarter 2022 adjusted EBITDA was $93.0 million, an increase of $80.5 million from 2021. As of March 31, 2022, we held 8,497 bitcoins with a carrying value of $307.2 million, net of accounting valuation adjustments. Total cash, cash equivalents and restricted cash was $110.4 million at the end of the first quarter. Cash used in operating activities and investing activities totaled $3.6 million and $269.1 million, respectively, and cash provided by financing activities was $251.5 million. As of the end of our first quarter 2022, we had outstanding agreements to purchase digital asset mining equipment, totaling approximately $391 million, of which $256.2 million was paid as deposits for equipment to be scheduled to be delivered in 2022. We are very pleased with our first quarter operating results, and we remain well positioned for significant growth through the remainder of the year. The conflict in Europe and the words impact on energy and agriculture markets, global inflation, interest rate increases and a resurgence of COVID in a number of countries present uncertainties for every business, including ours. These factors have weighed on the price of Bitcoin, factor into investor perceptions and impact public equity valuations. While we cannot control these uncertainties or perceptions, we believe we are well positioned for continued growth and to take advantage of new opportunities that may come our way. In this type of environment, having hosting revenue payable in dollars, owning our infrastructure, producing more digital assets than any other public company in North America and building our digital asset holdings provide us with a strong foundation for continued growth and to create value for our shareholders. That said, we have sold digital assets this year, and we expect that will continue to be the case. We are also collaborating with our industry partners to educate legislators and decision makers in Washington, D.C. and state capitals about our industry's positive impacts. As an industry, we are leading the movement to work with power providers in their development and provision of carbon-free energy. The large predictable baseload provided by data centers such as ours provides stability and flexibility to grid operators and supports the business case for more carbon-free power projects, whether from hydro, wind, solar, nuclear or geothermal. With that background, I'd like to discuss our outlook for 2022, highlighted on slide 12. We still have 1.2 to 1.4 gigawatts in the site, but additional development will only be undertaken when and if capital is available on compelling terms, whether from the markets or through prefunding by our customers. We continue to expect approximately 30% of our incremental 2020 data center development and minor deployments to be completed by the end of the second quarter, and we expect a roughly even split of hosting versus self-mining mix for the year. As of March 31, 2022, we had contracts in place for self-miners and hosted miners representing 14 exahash. In other words, we have clear visibility for 100% of our 2022 operating objectives of 1 gig. To summarize, despite a very challenging environment, we are sufficiently capitalized to achieve our 2022 objectives and we have the ability to exceed those objectives should it make sense to do so. Thank you to our incredible employees, our outstanding customers and our valued shareholders for your confidence in our team. I guess my first question would be, I think last quarter the message was that even though you had some pretty robust growth projections for 2022, it was mostly funded. As we discussed, the capital markets and formation of capital is challenging for many in our industry. And we want to be mindful of the environment we're in and make sure that, frankly, as always, we are fully transparent with you all. But that said, others with whom we do business also need to form capital and bring in capital, if they don't, then we don't need them as customers. And so yes, I think it's very fair to say it's both consistent with the discussion we've had all along, as well as conservative from the point of view of we don't like to disappoint and we do like to be clear. And obviously, with market conditions, we don't want to count on anything at this point. Some of which I heard that equipment financing has started to tighten up in the last couple of weeks, and there's a chance or a very good chance that some miners won't be able to pay for equipment, they've already got deposits on just given those dynamics. Very clearly, and we've spoken in the past on some of the conferences at which I've spoken and perhaps on the calls, I referred to an era of consolidation and cleansing, and we may have come to it a little sooner than we thought. We do think there are going to be opportunities for us to take advantage of highly accretive situations, whether we're talking about companies or assets. And this is the point, I guess, I was making a little bit or trying to make a little bit earlier which is to say that we agree that we have -- what we have heard is that raising capital has become more difficult for many others in this market. Obviously, at our current share price, we're not very interested in issuing our equity. You are right, there are any number of folks that have commitments that were dependent upon there being able to raise additional capital and they're finding it challenging to raise that capital. I would say, we would love for times to be better, but we've always felt very strongly that we wanted to be positioned to take advantage of compelling opportunities. I can tell you that at these current levels, we remain very profitable in our self-mining as well as our colocation or hosting business. And so as we sit here today, despite the depressed levels of Bitcoin and the sell-off that we've experienced, we are still quite profitable on a per coin basis. And when I think back to last year, we saw a number of your peers you were not public at the time, but make announcements about machine orders for the following year. And my recollection is, this was kind of – has been industry norm to kind of order machines 12 months or so out. So in a market like today, I'm sure this is more challenging. One, you're right, people made pronouncements last year, et cetera. And so as you know, we're very focused on making sure that we do what we say we're going to do. With regard to new equipment, and again, I think this is something that we have touched on in the past before sort of the current market environment. We said that, we thought that there was going to be some period of disruption in markets, more volatility in our industry. We had a point of view that, in fact, there would be perhaps difficult times for all of these companies that had put in big orders and that there might be an opportunity to pick up units at better value in the future. So other than the $130 million we've got that is outstanding on 70,000 or so rigs that we've got coming this year. And so if, in fact, we do see value because of some compromised orders, if you will, we are in a position to take advantage of that. But again, just we didn't – we haven't put it in order this year for a new unit. Not that we're so prescient about everything, but – and as Chris is saying, it's a little bit unfortunate the chaos, but we were concerned about all of the capital that was coming into the space. And kind of from here on out, you approach it opportunistically and you're not in a rush to sign new orders for 2022 delivered. So Lucas, look, we have another roughly – when we think about roughly 80,000 to 90,000 miners to deploy, of which a bit more than 10,000 are on the ground now and on their way to us. So another 70,000 plus to be delivered, right, which will take us to well over, I guess, it's 170,000 machines, all of which are of the very new generations, very high-performing, very efficient. And as I said, we only have $130 million all-in. Technically, it's actually only about $100 million for the miners that we own. So we're looking at deploying, if you will, almost another 90,000 miners, and all we got to pay for them is a bit over $100 million, which is a position we really like to be in. And whether or not we pursue additional miners will depend on price, availability, terms, et cetera. So all the preparation that's gone on for our additional infrastructure, all of the groundwork, all of the agreements, the permitting, all of that stuff has continued a pace, which gives us your right, tremendous optionality. Should we, in fact, whether it's our customers are willing to pre-pay sufficiently or capital is available at a reasonable price. So we can take advantage of it, whether it's for third-party co-location or for additional self-mining. And it just has to do with taking what we would characterize as an appropriately conservative approach to growth, making sure we have the money to do what we say we're going to do. And even with the turmoil today, I could imagine how folks who have miners on the ground or -- I mean could be desperate, right, to get their miners passing to generate revenue. And then there are the folks that were referred to earlier, who've got big deposits, but perhaps need financing to finish off payments for their orders. And so we are, in fact, we've received inquiries from both folks that have what you can refer as rigs on the ground as well as folks that are trying to finish off their payments for the miners they've ordered, but they can't get financing unless they've got assurances that, in fact, those units have a home. And we think that we can probably help them out, but they need to be helped on terms that are acceptable to us, which is to say that we're not going at risk for a need for additional capital. But if they've got the ability to put the capital, we're happy to talk with them and many of them do. And as we have discussed in the past, the -- absolutely and appropriately and very fairly, we've raised what were the historical colocation rates. I think it's very fair to assume that as the cost and benefit of immersion has evolved, we've been studying it all along. We've been running some immersion in our facilities to make sure that we're very up on, both the technologies and the evolving technologies as well as the benefit that can be gotten out of it. And I think it's very fair to say that, yeah, over the course of -- when you talk about out into 2023, over the course of the next 12 months, I think it's very fair to assume that we will be running some number of our rigs in immersion. But we're running -- where we are running the rigs in immersion, it doesn't have to do with climatic issues. We've done a lot of work assessing how it is frankly, we can just increase our return on investment. I likened to the fact that solar is actually now a very, very affordable energy source, whereas years ago, it wasn't. And as such, the answer is yes, you will see us running some immersion over the course of the coming six to 12 months. An archived version of this call, all SEC filings and relevant company and industry news, can be found on our website, corescientific.com. We wish you a good day, and we look forward to speaking with you again following next quarter's results."
}