{
    "symbol": "ISUN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 10:26:03",
    "content": " For the full year, our revenues increased by 69% to a record $76.5 million, above the revenue range we provided in November of 2022 despite the industry dynamics and exceeding the Street's consensus. On a year-over-year basis, fourth quarter 2022 revenue was down slightly from what was a strong fourth quarter in the prior year at $27 million, and that benefited from end of year transaction surge. As of December 31st, 2022, our total backlog was $164.2 million, and our pipeline reached 1.6 gigawatts of projects at the end of 2022, up an impressive 1.1 gigawatts from the end of 2021. Thus, we are reaffirming our expectations for total revenue in fiscal year 2023 of between $95 million to $100 million, reflecting a 24% to 31% increase in total revenues from 2022, along with gross margin expansion and full year EBITDA profitability. iSun reported fourth quarter 2022 revenue of $25.9 million, slightly lower than 2021's strong Q4 revenue of $27 million, but sequentially $6.9 million or 36% higher than the $19 million we produced in Q3, 2022 and above Street consensus. For the full year 2022 revenue was a record $76.5 million, representing a $31.2 million or 69% increase from 2021. Our Commercial division generated $0.4 million and $3.8 million in the fourth quarter and full year 2022, respectively, and has a contracted backlog of approximately $11.2 million expected to be completed within six to eight months. Our Industrial division generated revenue of $13.3 million and $30.2 million in the fourth quarter and full year 2022, respectively, and has a contracted backlog of approximately $132.5 million, expected to be completed within 12 to 18 months. Lastly, our Utility and Development division generated revenue of $0.4 million and $4.2 million in the fourth quarter and full year 2022, respectively. For full year 2022, operating income was a loss of $18.3 million compared to a loss of $10.6 million in 2021. ISun reported a net loss of $3.1 million or $0.12 per share in the fourth quarter of 2022, also better than Street consensus compared to a net loss of $1.1 million or $0.07 per share in the same period in 2021. You will recall we finalized a new debt facility of $25 million in total that closed after the end of third quarter 2022, allowing us to consolidate our debt and offering us access to working capital for operational execution as needed."
}