{
    "symbol": "ISUN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 12:09:03",
    "content": " iSun reported third quarter 2022 revenue of $19 million, representing a $12.4 million or 185% increase over the same period in 2021. By segment, our residential division generated revenue of $10.2 million and $24.3 million in the third quarter and year-to-date 2022 respectively. Our commercial division generated revenue of $1.1 million and $3.4 million in the third quarter and year-to-date 2022 respectively, and as a contracted backlog of approximately $12.6 million expected to be completed within six to eight months. Our industrial division generated revenue of $5.9 million and $19.1 million in the third quarter and year-to-date 2022 respectively, and has a contracted backlog of approximately $140.7 million expected to be completed within 12 to 18 months. Lastly, our utility and development division generated revenue of $1.8 million and $3.8 million in the third quarter and year-to-date 2022 respectively. Year-to-date, 2022 non-cash depreciation and amortization expenses were $5.3 million compared to $0.6 million in the same period in 2021. iSun reported a net loss of $4.9 million or $0.36 per share in the third quarter of 2022 compared to a net loss of $0.7 million, or $0.08 per share in the same period in 2021. Adjusted EBITDA for the third quarter of 2022 was a loss of $2.5 million, or $0.18 per share compared to a loss of $1.1 million or $0.12 per share in the same period in 2021. Year-to-date 2022 adjusted EBITDA was a loss of $3.4 million or $0.24 per share, compared to a loss of $4.8 million, or $0.56 per share in the same period in 2021. As noted in today's press release and our Form 8k filing, we're very pleased to have finalized a new debt facility of $25 million in total that closed after the end of the third quarter. The main projects are a new customer that we've been working with providing some pre-NTP engineering services to and one, I believe it's three separate projects up there 12.1 megawatts and over $9 million projected revenue. So sort of that ease of transaction, these are large, complicated, we are regulated projects with incredibly difficult supply chains and have one company that you can rely on to, to bring you through the process from concept to completion, I think really helps customers in a lot of ways and so being there early, instilling that confidence, and then the customer and then executing that pre NTP work, I think really helps us secure the back-end EPC work."
}