{
    "symbol": "KODK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 18:49:03",
    "content": "  Turning to slide five, revenue in the second quarter increased $30 million or 10% and compared to the prior year quarter, which demonstrates our commitment to One Kodak, customer first, customer support and satisfaction, and our firm control of our products. When excluding the impact of foreign exchange, revenue increased $49 million or 17% compared to the prior year quarter. For the second quarter of 2022, we reported revenues of $321 million compared to $291 million in the prior year quarter for an improvement of $30 million, an increase of 10%, adjusting for the unfavorable impact of foreign exchange of $19 million in the current year quarter, revenue increased by $49 million or 17% compared to the prior year quarter. The 2022 and 2021 second quarter results include income of $4 million and $1 million respectively related to changes in the fair value of embedded derivative liabilities and income of $4 million and $3 million, respectively related to noncash changes in workers' compensation reserves. Excluding these current and prior quarter items, income for 2022 was $12 million, compared to income of $6 million in the prior year quarter, reflecting an improvement of $6 million. Excluding the impact of non-cash changes in workers' compensation reserves in the current and prior year quarters and foreign exchange in the current year quarter, operational EBITDA improved by $3 million, when compared to the prior year quarter. For the first half of 2022, we reported revenues of $611 million, compared to $556 million in the prior year period for an improvement of $55 million Adjusting for the unfavorable impact of foreign exchange of $29 million in the current year, revenue increased by $84 million compared to the prior year. Excluding the unfavorable impact of foreign exchange in the current year and non-cash changes in workers' compensation reserves in the current and prior years, operational EBITDA decreased by $10 million. Excluding the impact of non-cash changes in workers' compensation reserves in the current and prior quarters, operational EBITDA improved by $18 million. As presented on the bottom portion of the slide, excluding the current and prior year impact of net proceeds from refinancing transactions, and the effect of exchange rates on cash in addition to the prior year funding of the letter of credit facility, the year-over-year decrease in cash and cash equivalents was $85 million, primarily driven by use of cash from working capital in order to strengthen the company's ability to serve our customers."
}