{
    "symbol": "NOTV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-12 21:30:04",
    "content": " DSA benefited from $7.4 million or 36.5% of internal growth augmented by incremental revenue from strategic acquisitions of HistoTox Labs, Bolder BioPATH, BioReliance, Gateway Pharmacology, Plato BioPharma and ILS that we've made to expand our suite of preclinical solutions, we continue to optimize integrate our DSA operations. The period ended with the backlog for DSA, totaling $133.6 million, which is up 147.9% from $53.9 million a year ago, and an increase of 27.7% from $104.6 million as of December 31, 2021. During the second quarter of fiscal 2022, the company spent $9.5 million on capital expenditures, or approximately 6.8% of revenue. For the 6 months ended March 31, 2021, the company spent $15.2 million on capital expenditures or approximately 6.8% of revenue. Based on the recent trends and backlogs, we're providing guidance for revenue of at least $290 million in total for Q3 and Q4 fiscal 2022, which will be at least 500 to $10 million of total revenue for fiscal '22. In the second quarter of fiscal 2022, our total revenue increased to $140.3 million from $18.8 million in the comparable prior year period, driven by a $20.3 million increase in DSA revenue and $101.2 million increase of incremental RMS revenue. Our DSA segment revenue grew 108% year-over-year to $39.1 million, reflecting $12.9 million of incremental service revenue from the acquisitions of HistoTox Labs, Bolder BioPATH, Gateway Pharmacology, Plato BioPharma, BioReliance and ILS plus $7.4 million of higher service revenue from internal growth. In the second quarter of fiscal 2022, our total gross profit increased to $44.7 million or 31.9% of revenue, and that is up from $6.3 million or 33.5% of revenue in the comparable prior year period. RMS gross profit in the second quarter of fiscal 2022 was $32.4 million, or 32% of RMS revenue. Operating income in the second quarter of fiscal 2022 totaled $7.9 million, compared to an operating loss of $0.5 million in the comparable prior year period, reflecting higher revenue and higher gross profit, partially offset by increased operating expenses. Net loss in the second quarter of fiscal 2022 totaled $6.1 million or negative $0.24 per diluted share, compared to a net loss of $0.7 million or $0.06 per diluted share in the comparable prior year period. But we want to note that this quarters reported figure was impacted by $6.8 million of tax expense, which was the result of a change in the company's forecasted effective annual tax rate primarily due to the favorable earnings impact of acquisitions. Our DSA backlog at the end of the second quarter of fiscal 2022 was $133.6 million, up 27.7% from $104.6 million on December 31, 2021, and up 147.9% from $53.9 million on March 31, 2021. cash flow from operations during the second quarter of fiscal 2022 totaled $5.2 million, compared to $2.9 million in the comparable prior year period. CapEx in the quarter totaled $9.5 million, or 6.8% of revenue, and for the 6 months CapEx totaled $15.2 million or 6.8% of revenue which included investments in facility improvements, site expansions, enhancements to laboratory technology, and system enhancements to improve the client experience."
}