{
    "symbol": "NOTV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-10 21:13:09",
    "content": " In addition, our revenue's grown from approximately $26 million at fiscal '18 to a pro forma revenue of fiscal 2021, reflecting the acquisition of Vigo of approximately $395.8 million. The first quarter adjusted un -allocated corporate G&A was approximately $7 million or 8.3% of revenue, compared to 16.2% of revenue for the same period last year. Several common goals got our actions across both segments, including listening to our customers and desire to provide them with a high touch consultative service, building a comprehensive offering to meet our customer's needs and control speed-to-market, scaling our business and strategic growth areas, cross-selling services and products to expand customer base, respecting our employees, customers, and shareholders while encouraging a culture of playing to win, and investing in people, technologies, and infrastructure and facilities to build a contemporary and scalable company. In the first quarter of Fiscal 2022 our total revenue increased 370.4% to $84.2 million from $17.9 million in the comparable prior year period, driven by a $14.9 million increase in DSA revenue and $51.4 million of incremental RMS revenue. Our DSA segment revenue grew 83.2% year-over-year to $32.8 million driven by $10 million of incremental service revenue from the acquisitions of HistoTox Labs, Bolder BioPATH, Gateway Pharmacology, and Plato BioPharma, and $4.9 million of higher service revenue from internal growth. In the first quarter of fiscal 2022, our total gross profit increased to $19.3 million or 22.9% of revenue, and that was up from $5.9 million or 33% of revenue in the comparable prior year period. Operating loss in the first quarter of fiscal 2022 totaled $33.6 million compared to operating income of $14,000 in the comparable prior-year period, reflecting higher non-cash stock compensation expense of $23.8 million, which included $23 million of post-combination stock compensation expense recognized in connection with the Envigo transaction, and that related to the adoption of the Envigo equity plans and higher strategic investments in unallocated corporate G&A to support additional future revenue growth. Net loss, attributable to common shareholders in the first quarter of fiscal 2022 totaled $83 million, or a negative $3.93 per diluted share compared to a net loss of $366,000 or a negative $0.03 per diluted share in the comparable prior year period. This quarter's reported figure, as mentioned above, was impacted by post-combination non-stock compensation expense recognized in connection with the Envigo acquisition of $23 million relating to the adoption of the Envigo equity plan and a $56.7 million loss on fair value remeasurement of convertible notes issued in September 2021. Our backlog at the end of the first quarter of fiscal 2022 was $104.6 million, up 28.5% from $81.4 million on September 30, 2021, and up 130.9% from $45.3 million on December 31, 2020."
}