{
    "symbol": "DUOL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 08:29:05",
    "content": " So for the outperformance I mean look, it's a number of factors, but I think if you ask me, the main factor is just something we've said from the time we IPO-ed, which is we're still in the early days of our journey. Another one that we mentioned in the letter that also, I'm particularly excited about is this thing called Side Quests, which are -- in the new home screen of the app, you're going to be able to tap on the animated characters and that's going to give you kind of these fun little mini games obviously to practice your language. And the gem economy on Duolingo is something that we're very excited about because it's going to help us with in-app purchases, which is something that we're going to be investing on for the next few years. But I -- when people ask us about math or Duolingo ABC, which is our literacy app, I'd like to remind everyone that for the foreseeable future, I mean, certainly, this year, next year and even the year after that, we are primarily a language learning company. It took us a while to do this because when we run the experiment to change the prices, we really are trying to measure what that's going to do for our long-term bookings and kind of we're looking for lifetime value of users and we're trying to see what it does for recurring digital subscriptions, so renewals and everything. Thank you for asking about the Duolingo English Test because it's something -- it's a project that is very near and dear to my heart, and it's something that we're very excited about. And so it's hard to know if I could think about it and theorize about it, for example, my guess is that free users are not going to -- like basically, our free user growth is going to continue equally. And that may be the case of -- and we have users everywhere in the world, in poor countries, a country like India or something, just very few people are paying us and they're just using Duolingo for free. I mean I think it would be foolish for us just having seen what has happened to all the majority of Western companies that invest a lot in China, I think it will be foolish for us to suddenly invest $200 million to grow in China, that's just unlikely to happen."
}