{
    "symbol": "LPL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 00:25:19",
    "content": " Today, I'm joined by the CFO, Sunghyun Kim; Hee-Yeon Kim, Senior Vice President of Corporate Strategy Group; Seung Min Lim, Vice President of Corporate Planning; Jeong Yi, in charge of Business Intelligence; Daniel Lee, in charge of Large Display Marketing; Seong Gon Kim, in charge of Medium Display Marketing, and Ki Hwan Son, Vice President of Auto Marketing. Due to COVID-19, there were lockdowns in some of the Chinese production basis, which have also affected the production and shipment of the company's high value and IT products. And as a result, the company's business performance in Q2 has underperformed on the initial guidance. There were shipment disruptions from lockdowns in production bases, soft demand in the downstream and continued fall in LCD panel price. Area shipment in Q2 was 7.85 million square meters, decreasing 4% from the previous quarter. Set makers, to minimize inventory, reduced their purchase, resulting in less shipment of both large and medium display products. Shipment of POLED smartphones decreased due to seasonality, and LCD panel price continued to decline. The company's production capacity in Q2 decreased 5% Q-o-Q, owing to active adjustment in general use LCD production as well as new product development and maintenance. Even as LCD panel price continued to decline, shipment of OLED TV panels increased, thanks to its positioning in the high-end TV market. IT panel took up 35%, down three percentage points Q-o-Q with a significant impact from shipment disruptions resulting from Chinese lockdowns. The inventory was prepared against shipment disruptions from Chinese lockdowns and to be ready for high-end product shipments in the second half, such as new POLED models. Shipment of IT panels affected by Chinese lockdowns will recover and shipment of large OLED and POLED smartphones is expected to grow, in response to the seasonal demand. But recovery in Q3 is likely to be limited, due to demand slowdown caused by macro instability and weaker consumer confidence, as well as customers' attempt to minimize inventory. ASP per square meters is also expected to rise to 20% level, thanks to increased shipment of POLED smartphones and wearable products as well as OLED TV panels. Per product, price is expected to keep declining for IT panels, while for LCD TV panels, the price decline is expected to gradually moderate as panel makers adjust production such as utilization rates. Next is presentation by the company's CFO, Sunghyun Kim on operational strategy. Following the briefing on Q2 business performance, allow me to explain to you the company's operational strategy. Assuming that the trend will continue for some time, the company will strengthen risk management, while actively seeking to identify new growth drivers for the future. One example is LCD TV panels, where differentiation is deemed to be limited. We will also ratchet up activities for cost innovation and efficiency, as the insecure supply chain and inflationary pressure have driven up volatility in production costs. The company intends to focus more on minimizing inventory, given the uncertainty in market outlook. There was the specific issue of Chinese lockdowns in Q2, but in the second half, we will focus on recovering the shipment disruptions and proactively and flexibly adjusting production to minimize inventory by the end of the year. While remaining steadfast in investment to upgrade the business structure and secure future competitiveness, we will revisit all adjustable investments, including current investment, to review their size and timing as well as execution speed. Even as uncertainties remain high in the global economy and business environment, the company intends to preemptively control risks, by flexibly responding to changes enabled by stronger internal operation activities. Meanwhile, the company is also actively implementing activities to create unique performance that is unaffected by the market and to discover future growth engines. First is to strengthen dominance in the large OLED and IT segments, where the company already has differentiated competitiveness. OLED TV is showing meaningful performance, growing in actual sales, even when the overall TV market is showing negative growth. We will continue solidifying our market dominance in large OLED, based on our fundamental competitiveness, as large OLED increasingly becomes the mainstream. Second, the company will actively develop make-to-order business to establish more consistent business operations. In mobile, we plan to ensure profitability with differentiated POLED products and establish the basis for new technology businesses in collaboration with strategic customers. We will also expand our IT product portfolio and solidify high-end leadership through mid-sized OLED, where investment is ongoing. In auto, the company continues to broaden its market dominance by providing differentiated solutions to global customers with our lineup ranging from OLED to high-end LCD. We will focus on broadening new businesses to prepare for a differentiated future, where we are already seeing visible results in large OLED. Market-creating businesses include gaming and transparent OLED, as we are actively trying to open up or broaden new markets in life display. Similar to OLED TV and high-end IT, the company plans to broadly utilize our differentiated technologies, to more diverse applications. Although volatility remains high in todayâ\u0080\u0099s business environment, the company will continue to differentiate and create value through preemptive risk management and operational efficiency improvement while preparing for the future and ensuring growth. Please go ahead with your questions. I have two questions, one for each â\u0080\u0093 one for LCD and another for OLED. Now, for the LCD, we see that the set makers that utilize LCD display are also seeing demand decline. And related to this, it appears as if the domestic companyâ\u0080\u0099s realignment of the LCD business has been a bit delayed or a bit belated, despite the fact that the LCD marketâ\u0080\u0099s sluggishness has already been predicted since COVID-19. Now, the â\u0080\u0093 overall, the demand for TV continues to fall, and also we see that the LCD panel prices are also declining. This is Hee-Yeon Kim, Senior Vice President of Corporate Strategy Group responding to your question about the operation of LCD lines. Now, because of the lesser competitiveness, the LCD TVs fab capacity has been â\u0080\u0093 gradually been reduced since 2019. And now, for the domestic LCD business, where the competitiveness is weak, the business will be downsized and we are planning for an earlier exit. But for the LCD TV fab in China where we do have cost competitiveness, we will keep converting them to the more competitive products, like IT or commercial. Now, in the Korean P7 fab, the capacity is 150,000 and we will be reducing 60,000 in the second half of the year and another 30,000 in the first half of next year. The Chinese fab, we have 200,000 capacity, and of this, 10% has already been converted to IT, and the remaining 170,000, they will be converted, as I explained earlier, to either commercial or IT, whichever is more â\u0080\u0093 whichever has bigger competitive edge. So by the second half of next year, about 40% of the TV capacity would have been reduced. And aside from the TV capacity, the IT capacity, for which we have about 200,000, so the IT capacity will remain depending â\u0080\u0093 so based on the cost competitiveness, as well as the product competitiveness. Next, this is Daniel Lee in terms of Large Display Marketing, responding to your question about the OLED shipment and the plan for the remainder of this year. So for the TV market, there was negative growth of 24% in 2021 and another negative growth of 10% in the first half of this year. But in the first half of this year, what we have seen is, despite the challenges, the OLED TV, the actual sales of OLED TV has increased by about mid 20% Y-o-Y, and we believe that this is quite a meaningful performance that has been achieved, in cooperation with our customers. And now in the second half of the year, now, unlike the market in general, we still expect the actual sales of OLED TV to continue to grow. Having said that, because of the economic downturn, as well as the sluggish demand in the downstream, we believe that the overall sales are also going to slow down, compared to the first half. So the company will keep monitoring the market situation, and will run our own operations and inventory, according â\u0080\u0093 based on the assumption that the downside risks are going to materialize. Please go ahead with your questions. Now, as the CFO has also pointed out earlier, now the company is quite strong in terms of technology in IT and automotive. And then also, there are the OLED, new MI devices. So up until July, it appeared as if the LCD TV price decline had slowed down, but more recently, we see that the pace of decline has picked up again. This is Ki Hwan Son, Vice President of Auto Marketing responding to your question about the OLED technology. This is Jeong Yi, in-charge of Business Intelligence, and I would like to respond to your question about the second half market outlook, as well as the LCD price trend. Now, first of all, about demand for in the second half, because of the sluggish actual sales for the set makers, their inventory level at the end of the second quarter ranged from four weeks to seven weeks, meaning that they have an excessive level of inventory. And because of the high inventory level, the set makers will continue to adjust their purchasing of panels into the third quarter of the year. And as a result of this there is likely to be a bigger decline in the purchase of panels, more so than the decline in the actual sales of the set products. So against this backdrop, then looking toward the price trend in the second half, it appears as if the price decline is likely to continue into the third quarter, but then now in the fourth quarter as a result of the supply adjustment, the price trend is likely to at least partially stabilize. Now, first about the LCD IT business, it's assumed that the profitability in the second quarter would have deteriorated. And the second question is about the OLED TV and that the company was in negotiation with a new customer, domestic customer. This is Seong Gon Kim, in charge of Medium Display Marketing, and I would like to give you a response regarding the IT market, as well as the profitability and profitability outlook. Now, as has been mentioned several times by other speakers already, the IT market is now in a downturn, and because of this, demand for most of the products, including monitors and notebooks is also declining. And that is why we also see that overall in the market, there also is quite a high level of inventory, and this also translated into lesser purchasing of panels as well. So we see that overall the market is struggling and slowing down, but then now, as you would also know, the company is mostly engaged in the high-end segment where the volatility is less. So in the â\u0080\u0093 between the first quarter and the second quarter, compared to the overall decline in the IT market in general, I would say that the company's profitability impact has been lesser than the average market level. And then in terms of the outlook for the next quarter and on, now although the other players are adjusting their utilization rate, which is also going to affect the overall demand and supply dynamics, the company will keep focusing on the high-end segment to generate consistent performance. Now, as you would also know, the company has been focusing on solidifying the position of OLED panels in the market, to make it a norm in the market. And in this process, a new potential customer expressed intent to use our panels and the market also became aware of it. And down the road, we will be cooperating with any potential customers to create synergy effects, as long as they recognize the value of OLED and are willing to work together to create new markets. Please go ahead with your questions. Now, in terms of the inventory, it became higher in the second quarter and in the presentation, it was explained that this was a preemptive preparation for the demand to come in the future. And another question is, now in the financial statement, it seems as if the short-term borrowings has increased significantly to about KRW6 trillion level. This is Seung Min Lim, Vice President of Corporate Planning and I would like to respond to your question about the higher inventory level. Now, for the inventory increase, now a considerable part of the increase is owed to our plan, to respond to the higher demand for POLED in the second half. So in the second half, according to the sales situation and changes in the demand, we plan to normalize the inventory level. Now, on one hand, the long-term borrowing is not acceptable in the market these days and also the interest rate for long-term borrowings has gone up considerably. And the case that you have mentioned, that is actually where we set up credit line based on mutual agreement, and then we would draw â\u0080\u0093 we would continue to roll over in the form of short-term borrowings. And also because of the â\u0080\u0093 but then also because of the higher inventory level, for example, the materials costs or other costs, probably would become certain costs."
}