{
    "symbol": "UIS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 14:36:16",
    "content": " Total company ACV grew 43% year-over-year, supported by the growth I noted in ACV for GWS and C&I, total company TCV was also up 5% year-over-year in the quarter, although given clients increasing preference for shorter duration contracts. We're encouraged by the significant year-over-year increase and new business signings in the quarter, and we expect momentum to accelerate in the second half of the year as a result of our marketing and selling initiatives that are designed to increase awareness and differentiation of our expanded and enhanced solution portfolio. This momentum is not necessarily reflected in the year-over-year compares as revenue and profitability in the quarter were impacted by a few known headwinds, specifically the anticipated clear path forward contract renewal timing, and the DWS private label field service contracts that we exited in 2021. As a reminder, ECS revenue was lower year-over-year due to fewer contracts being scheduled for renewal in the first quarter as opposed to renewal rates themselves which remain over 95%. Our first half, second half ECS license revenue split is still expected to be approximately 35% and 65% in the front half and back half of 2022 and approximately 15% of full year ECS segment revenue is expected to be earned in the second quarter. While this inherently means that there's more work to be done to achieve our full year goals, we're still expecting to be at the low end of our 2022 revenue guidance of 5% to 7% year-over-year growth. Given the ECS renewal schedule, we expected this to translate to total company non-GAAP operating profit margin and adjusted EBITDA margin being down approximately 450 to 550 basis points year-over-year in the second quarter. I mean, the Wall Street Journal just came out and the Washington Post with, with the contraction of the economy in the first quarter in the U.S. And, I do want to look at our mix of business, obviously for us to thrive, we have got to sign new revenue, new logos, new expansion, there's everybody in our business has to do that."
}