{
    "symbol": "DRQ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 16:21:12",
    "content": " We had a nice sequential increase Q-on-Q there as well, that's really broad based Latin America was strong, both in Mexico and Ecuador, Middle East was strong, specifically Saudi, and we're starting to see our deepwater business emerge, there's a real growth opportunity there. You know, obviously, when people are talking about a recession, I'm wondering if they're talking about that at all, or if your customers are instead looking the other way and really think about this energy, global energy crisis we're facing and how they see kind of playing into that. And what we're hearing from our customers, it's very easy to look at today's environment and say, hey, it's $100 oil or $90 oil, you know, everybody's getting back to work, but they're looking at much, much lower breakevens when they're doing that analysis. Obviously, you could do the math and figure out that that's a little back and loaded, right now, doesn't surprise us that it's back and loaded, we would have originally thought that at the beginning of the year, I think we might have gotten a little optimistic early in the year when oil prices were good and the inflationary environment wasn't there. So, I was curious, you mentioned before, your talked about some of the short cycle business running through, and I don't -- do Subsea Services that doesn't run through backlog, I'm assuming is that that goes right through revenue, but maybe just kind of talk about your overall mix in terms of some of those short cycle versus longer cycle opportunities, and how that compares to maybe a few years ago, which I would have thought probably most of your business would have been more in kind of a longer cycle category. So that's kind of the overall, you know, I think if you think about , you know, they're really looking at, I'll be curious to see how the new legislation that's working through right now plays out, I think, in Guyana, they're really looking for what I would say is regulatory certainty. Maybe kind of what's kind of compared to -- I know we're such an early part of the recovery here, but I don't know if there's anything to be gleaned from this recovery versus the prior recovery -- but just in terms of the competitive outlook out there would be helpful. We've got it narrowed down to kind of a final two, three areas that we're thinking about, and we'll be working on that really over the next, I'd call it, more 9 to 12 months You should expect the balance of this year. Obviously, we sell deepwater trees, and you're right to say that we're optimistic that's going to opportunistic those tend to be smaller to midsize players versus the large projects when the project gets to a certain size, that's when we'll team up with the likes of Aker or the likes of OneSubsea on EPCI on the deepwater. Maybe just talk about -- I think it's got a little bit on the shorter cycle here on these tools because you're saying kind of that happens, you get a -- you get a you kind of come out the right as these things are happening. I was just about to say, if you don't have it -- if you're not ready, you don't get to work so the next thing I'm thinking about is what have you -- do you see an opportunity because your competitors in that business have not done that."
}