{
    "symbol": "DRQ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 15:29:11",
    "content": " We would think for the rest of the year, if we look at the orders mix going into Q2 and beyond, you're going to see a much better mix of SPS, wellheads, et cetera. So I think as we see the year play out, I would probably target around maybe $5 million to $7 million that will pick up this year, it'll be flipped over between cost of goods and G&A. Inbound orders for products totaled $63 million, which was within that that new hire stepped up guidance range of $60 million to $80 million, but closer to the floor, yet you've just reaffirmed annual bookings guidance for growth of 20% this year and clearly continue to think that forecast has potential variance, it's skewed to the upside. So we had, so with a total of 87 development and exploration wellheads under that MSA, about 30% of those have already been placed in terms of purchase orders, and we're in the bookings in Q1, that's well ahead of the schedule that we would have expected to see. And I'm optimistic that as those teams colocate, we're just going to see even more benefits in the back half of the year, both in terms of improved on-time delivery, improved customer responsiveness, and really just margin improvement as we start to attack costs in a meaningful way. But in terms of how much we think we're going to pull in this year, it's a little bit tough to tell right now with what's going on the market and different pieces of property have different values and so forth. But I think we're pretty optimistic that we'll at least see 10% growth in Q2, and then gross margins would continue to tick up call it 450 basis points Q-on-Q is what the expectation is. We think as we've talked about earlier, on the way up, just like we saw on the way down we're probably going to overshoot some of the incrementals just because of the cost that's been taken out. If you take a look at the productivity we're targeting and getting revenues much further north than here, we would think that the gross margins on products are an overall would be somewhere in the mid to high 30s is kind of what we would take a look at from a historical standpoint, in addition to sort of the math we've done internally. On the product side of the house, if you look across both downhole tools, in addition to subsea products, again, I think you're probably going to see that probably in the low to mid 30s with service bringing us up to that kind of mid to high 30s. When we take that approach, I think the thing that we're monitoring very closely right now, it's tough to understand the market right now when you've got the challenge in Ukraine, the challenge in Russia, the shutdowns that we see kind of spreading through China, it's just making sure that we understand the underlying environment when we're making that decision."
}