{
    "symbol": "EKSO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 18:08:09",
    "content": "  Operator: Greetings, and welcome to the Ekso Bionics Fourth Quarter 2022 Financial Results Conference Call. Joining me from Ekso Bionics are Scott Davis, Chief Executive Officer; Jerome Wong, Chief Financial Officer; and Jason Jones, Chief Operating Officer. Earlier today, Ekso Bionics released financial results for the quarter and year ended December 31, 2022. Before we begin, I'd like to remind you that management will make statements during this call that include forward-looking statements within the meaning of the federal securities laws, which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. All forward-looking statements, including statements regarding our business strategy, future financial or operating expectations, or our expectations of the regulatory landscape governing our products and operations are based upon management's current estimates and various assumptions. Ekso disclaims any obligation except as required by law to update or revise any financial or operational projections, its regulatory outlook or other forward-looking statements, whether because of new information, future events or otherwise. We're pleased to have officially closed 2022 with continued solid demand for EksoNR and the completion of our most significant transaction to date, the acquisition of Human Motion & Control business unit, or HMC, from Parker Hannifin. The importance of this acquisition cannot be understated, as it expands our product offering across the continuum of care to home and community use markets. We generated revenue of $3.6 million in the fourth quarter, which included bookings totaling 27 EksoHealth devices, of which two were Indego devices that were booked in the last few weeks of December, post close of the acquisition. Throughout our EksoHealth segment, we continue to leverage our advanced robotic exoskeleton technology and rehabilitative programs to help patients on their road to recovery and improved health, with better outcomes than the current standard of care. In 2022, we successfully executed on our commercial strategy, resulting in the placement of substantial volume of additional devices within network operators globally and the completion of many multi-unit orders, both of which contributed to drive a solid year for EksoNR bookings and record revenue internationally. With EksoNR receiving FDA clearance for the multiple sclerosis indication, the first known exoskeletal device to carry this designation for rehabilitative use in patients suffering from MS, enthusiasm for EksoNR continues to grow. Furthermore, we have made significant inroads with many of the large network operators or IDNs throughout the year, as they continue to make EksoNR their standard of care in lower extremity neurological rehabilitation. Our pipeline of new opportunities remains strong; although due to more challenging economic and market conditions, the sales timeline is taking longer than in previous quarters. Our integrated sales and marketing teams are executing on our overall commercial strategy, putting us in what we believe to be a favorable position heading into 2023. Now, turning to our acquisition of the HMC business from Parker Hannifin, which is synergistic and broadens our product portfolio in commercial health and expands our reach into home use. These products acquired include: Indego Therapy and Indego Personal, now renamed Ekso Indego Therapy and Ekso Indego Personal. Ekso Indego Personal is a lightweight exoskeleton, safer use in most home and community environments. Ekso Indego Personal is primarily sold to veterans by using existing reimbursement and rehabilitation programs supported through the Veterans Association, but has also been funded through Workmen's Compensation and various international programs. Ekso Indego Therapy is an adjustable modular exoskeleton used primarily for patients with spinal cord injury, but also stroke, complementing Ekso's product offering in outpatient facilities. Last month, we showcased our new Ekso Indego Therapy with functional electrical stimulation, or FES, at the American Physical Therapy Association meeting, and recently filed premarket notification 510(k) with the U.S. Food and Drug Administration that covers the addition of integrated FES hardware and software to Ekso Indego Therapy. Through this acquisition, Ekso added the ongoing development of intelligent robotic assisted technology designed for use in the orthotic and prosthetic, or O&P, industry. Also, along with these current and future products, this combination expands the current Ekso team to include the former employees of HMC, comprised primarily of highly-experienced engineering, operations, clinical and sales professionals. With Ekso's core engineering staff and experienced quality and operations team, we are thrilled to have joined forces with this elite academic partner to help power new product development. To showcase the value and benefits of our newly integrated product line, I'd like to share a story of a patient who regained mobility through the use of Ekso Indego Personal. Eventually, he was chosen to participate in the VA's exoskeleton evaluation program, where after exposure to multiple exoskeleton devices, he opted for a rehabilitation program utilizing Ekso Indego. In 2022, our EksoWorks business refocused its product offerings and go to market strategies, temporarily rescaling our sales and marketing resources, while refocusing and refining our market approach to larger high-volume customers. Now, I'll turn the call over to Jason Jones, our new Chief Operating Officer, to provide background on himself and an overview of the initiatives that he'll be working on to improve our efficiencies. As background, I've been with Ekso since 2018, previously serving as Senior Vice President of Product Development. My goal as COO is to leverage my experience in engineering, product development and supply chain management to build Ekso into their platform with the capacity to design, produce, distribute and service a broad range of products that amplify human motion and mobility. As a case in point, the recent acquisition of the Indego product line represents the next step in leading the way for patient rehabilitation. Additionally, as mentioned earlier, we are starting the process of combining our engineering and product development teams, while also working with Vanderbilt in an effort to  (ph) our technology innovation. On the EksoWorks side, in 2022, we began the process of adding external manufacturing capability for our EVO product line at a contract manufacturing partner located in Malaysia. At this time, I'd like to turn the call over to our Chief Financial Officer, Jerome Wong, to review our fourth quarter and full year financial results. Our gross profit for the fourth quarter was $1.7 million, representing a gross margin of approximately 47% compared to a gross margin of 59% for the same period in 2021. The decrease in gross margin was primarily driven by an increase in service and supply chain costs, elevated labor costs and lower average selling prices of device sales due to sales channel mix. Gain on warrant liabilities for the quarter ended December 31, 2022 was $0.3 million from the revaluation of warrants issued in 2019, 2020 and 2021 compared to a $2 million gain associated with revaluation of warrants issued in 2019, 2020 and 2021 for the same period in 2021. Gross profit for the full year ended December 31, 2022 was $6.2 million, representing a gross margin of approximately 48%, compared to a gross profit of $6.7 million for the same period in 2021, representing a gross margin of 60%. The decline in gross margin is primarily due to an increase in service and supply chain costs, elevated labor costs and lower average selling prices of device sales due to sales channel mix. The increase was primarily due to one-time severance costs associated with management changes, costs related to the relocation of our corporate headquarters and manufacturing facility and acquisition and operating costs of HMC. For the year ended December 31, 2022, we recorded a gain on warrant liabilities of $1.3 million associated with the revaluation of warrants issued in 2019, 2020 and 2021, compared to a $4 million gain associated with revaluation of warrants issued in 2019, 2020 and 2021 for the same period in 2021. As of December 31, 2022, the company had a strong cash balance of $20.5 million. So, at the start of the call, you said -- I think you said, there were two Indego installs in the fourth quarter. To answer the first part of your question, which is regarding the lead time, generally speaking, we are experiencing slightly longer times to close, maybe a couple of months, generally speaking, anywhere from 30 to 60 days that we're seeing, as we have seen more of our customers beginning to use some third-party financing options that we offer, and it simply takes a bit longer to work through that process. In many ways, Ekso's sales team all carry with them the Indego product line as well, and we have a slightly different method for -- sales methodology for selling the personal unit that has also been aligned to work in conjunction with our sales team. On the R&D side, that -- we have a plan that includes integrating some systems there that really is going to take through the remainder of the year, this year, it's kind of incremental. Those are separate functions today and I think that's a longer process, because the business units are kind of operating as is already. 2022 was a transformational year for Ekso Bionics, was highlighted by the successful acquisition of the Indego product line, FDA clearance to market EksoNR for rehabilitation use in patients with MS, and a strong number of EksoHealth bookings. The complementary acquisition of the HMC business was critical to our future growth, principally as it expands our product offering across the continuum of care to home and community use markets. We believe that the smooth integration of the HMC business, combined with the continued strong demand for our industry-leading products, has us well positioned to continue our momentum into 2023 and beyond."
}