{
    "symbol": "WMT",
    "quarter": 3,
    "year": 2023,
    "date": "2022-11-15 12:12:01",
    "content": " If we double-click on advertising with Walmart Connect in the U.S., we see it's benefiting from growth in e-commerce and from improvements made within the business itself, and we've seen strong growth in return on ad spend over last year. Constant currency sales in Walmart International were strong, up 13.3% led by Flipkart and Walmex, while Sam's Club U.S. delivered its 11th consecutive quarter of double-digit comps with growth of 10.3%, excluding fuel and tobacco. The team has done a really good job addressing our inventory situation, as reflected by Q3 inventory being up only 13% versus last year, including 12.4% growth in Walmart U.S. Each of our major markets delivered positive comp sales, led by a great quarter from Walmex, with comp sales growth of 11.7%, reflecting strong performance in Bodega stores, Sam's Clubs and 17% growth in e-commerce. For the full year, incorporating the Q3 upside, we now expect net sales growth of about 5.5%, including comp sales growth of 5.5% for Walmart U.S. On an adjusted basis, we expect operating income to decline 6.5% to 7.5% and EPS to decline 6% to 7%. Also, as we've had $236 million in LIFO charges this year at Sam's Club, we're likely to experience LIFO charges in Walmart U.S. as well next year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. But we also saw in China a 41% e-commerce penetration, and we're learning a lot from that market about how to deal with those kind of volumes, of deliveries and e-commerce as well in Sam's Club and is a real great format therefore in sharing much of the private brand and much of the innovation that Sam's Club in the U.S. is bringing through. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}