{
    "symbol": "WMT",
    "quarter": 4,
    "year": 2023,
    "date": "2023-02-21 12:31:05",
    "content": " And our Sam's Club U.S. team announced expansion plans that will have us opening more than 30 new clubs across the country over the next several years in addition to a multiyear plan to invest in and modernize our supply chain, especially in the U.S. We've worked through a lot of the operational stress in our business from last year, and we made progress on strategic initiatives as we did it, and we're doing it in a way that's uniquely Walmart. Please proceed with your question. So China, turning to China, clearly, the big news in China was the opening of China as I look though into last year, we saw continued strength in hypermarkets, which is the higher-end offering that we have within China slightly different positioning to Sam's Clubs in the U.S. and in Mexico, they continued very strongly. Please proceed with your question. Please proceed with your question. Please proceed with your question. On this call, there's been a few different references to an algorithm to 6% top line growth compounded over the last few years to growing operating income faster than sales. But we'll be able to give more insight into both our top line and bottom line in terms of what we anticipate over the next several years at our Investor Day, April, but we absolutely 100% believe that we've got a business that can drive that kind of outcome where we've got sales growing at 4% or higher, frankly, as well as operating income outpacing that. It's when we look at the composition of our business and how it's changing and the returns related to some of these initiative areas, it's just such that the financial architecture suggests that the operating income should outperform sales growth over the next several years. If you look, particularly for the U.S. business, the incremental margins will be higher year than what you typically see, and in large part for the reason that you mentioned, we're lapping like even in the last quarter, we lapped $500 million of COVID costs alone in that quarter, but when you look at it on a full year basis that creates a tailwind in terms of incremental margins. Please proceed with your question. Please proceed with your question. Please proceed with your question. And it's a way that customers can access an interesting combination of all of our assets from our digital front end, which is become one experience over the last couple of years the fact that we have inventory within 10 miles and 90% of the population is another way that this call comes together. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}