{
    "symbol": "TSQ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 16:31:03",
    "content": " However, because of our differentiated and unique position as a digital-first local media company focused exclusively on local markets outside of the top 50 cities, Townsquare achieved our Q3 guidance and set an all-time Q3 revenue and Q3 profit record and, in turn, drove strong cash flow growth in the third quarter. To start, our net revenue overall was up a very strong plus 8.4%, to approximately $121 million, and up plus 7.5%, ex political. As I highlighted on slide 11, over 50% of our revenue is digital, 2.5 times the industry average, and our digital business continues to deliver strong growth, up 17% in Q3 over prior year. In the third quarter, political revenue of $1.6 million was well below 2018 levels by 31% and below 2020 levels by 64%. In total, 50% of our September year-to-date revenue and 49% of our September year-to-date profit came from our digital businesses. Third quarter digital advertising net revenue increased plus 21% year-over-year, and third quarter digital marketing solutions net revenue increased plus 10% year-over-year. Third quarter net revenue increased 8.4% over the prior year period to a record-setting $120.6 million, within our third quarter guidance range of $120 million to $127 million despite the softness in political, auto and national broadcast advertising. Third quarter adjusted EBITDA increased 6% year-over-year to a record-setting $30.9 million, achieving the middle of our guidance range of $30 million to $32 million. Townsquare Interactive's third quarter profit increased approximately 4% year-over-year to $6.4 million, at a 20% profit margin. Townsquare Ignite, our digital advertising segment, was the largest driver of growth in the third quarter and year-to-date periods, with net revenue increasing 21.3% in both periods. As Bill noted, although we view it as a mature cash cow business, our broadcast advertising net revenue increased 3.4% in the third quarter as compared to the prior year. We expect fourth quarter net revenue to increase and be between $116 million and $122 million, which is a 5% to 10% increase over the prior year. We expect that 2022 adjusted EBITDA will be between $113 million and $116 million, once again representing a very strong year-over-year growth of 8% to 10%. Two, our digital growth engine in Q3 increased revenue plus 17% year-over-year, and Q3 digital profit increased plus 7% year-over-year, with a Q3 digital profit margin of 29%. In total, 50% of our September year-to-date revenue and 49% of our September year-to-date profit came from our digital businesses."
}