{
    "symbol": "TSQ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 16:04:03",
    "content": " First quarter net revenue increased a very strong plus 13% year-over-year to $100.2 million, above our guidance range of $97.5 million to $99.5 million. Our first quarter adjusted EBITDA also increased double digits, up a robust plus 10% year-over-year to $22.1 million, also above our guidance range of $21 million to $22 million. In the first quarter of 2022, our digital revenue and digital profit increased plus 16% and plus 11%, respectively, over the prior year. In the first quarter, Digital Advertising net revenue increased plus 17% year-over-year and Digital Advertising profit increased plus 13% year-over-year. On a trailing 12-month basis as of March 31, we generated $121 million of Digital Advertising net revenue and $38 million of Digital Advertising profit, a 31% profit margin. On a trailing 12-month basis as of March 31, Townsquare Interactive had $85 million of subscription revenue and $25 million of subscription profit, a 29% profit margin. And in the first quarter of 2022, net revenue at Townsquare Interactive increased plus 15% year-over-year, and profit increased plus 7% year-over-year, and we added approximately 1,050 net subscribers, 200 more than the first quarter of 2021. Based on our own experience, we know that we can drive accelerated digital revenue growth at stronger and more profitable margins such that within a few years, the Cherry Creek markets will be approaching a 50% digital revenue contribution and a 30% profit margin just like Townsquare has today in digital. Digital Advertising profit, which we just started breaking out and providing details on in March with our year-end results, increased 13.1% year-over-year to $8.2 million in Q1, with a 28% profit margin. In total, digital revenue composed of our Subscription Digital Marketing Solutions segment and our Digital Advertising segment increased year-over-year by 15% in the first quarter. For the full year 2022, we are reaffirming our net revenue guidance of $460 million to $475 million, representing a year-over-year increase of 10% to 14%. We've set a record for our Q1 most number of net adds in Q1 obviously, continued strength almost adding $3 million in revenue in Q1 to Q1, plus 15%. So we see an acceleration of Digital Advertising in Q2 after having a very strong plus 17% quarter in Q1 and digital revenue being up 16% in Q1 and digital profit being up 11%, which brought us to, for the first time ever, over 50% of our revenue and 50% of our profit was from digital solutions, 51% of our revenue and 55% of our profit now comes from digital solutions."
}