{
    "symbol": "TSQ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 12:27:06",
    "content": " In 2022, our net revenue increase plus 11% year-over-year, reaching an all-time high of $463 million. In 2022, Townsquare Interactive contributed nearly 20% of our company's total net revenue and adjusted operating income, which is especially relevant in a downturn scenario as it represents a non-advertising based recurring revenue stream. In 2022, Townsquare Interactive net revenue increased plus 11% to $90 million and profit increased plus 7% to $26 million. In 2022, Townsquare's Digital Advertising net revenue was again the fastest growing segment of our company and increased plus 20% year-over-year to $140 million and digital advertising profit increased plus 16% year-over-year to $43 million. I am proud to report that, in total, our digital revenue grew a very strong plus 16% year-over-year to $231 million and, importantly, generated $69 million of profit, representing a 30% profit margin, a margin much higher than most local media competitors. We are confident with our current capitalization and the strength of our balance sheet, with $43 million of cash on hand at year-end, a fixed interest rate of 6.875%, and no maturities until 2026 and net leverage of 4.29 times at year-end 2022. Fourth quarter net revenue increased 8.8% over the prior-year period, to an all-time Q4 high of $120.3 million, which was within our fourth quarter guidance of $116 million to $122 million. In 2022, we reached an all-time high net revenue of $463.1 million, representing 10.8% year-over-year growth. Fourth quarter adjusted EBITDA increased 11% year-over-year to a Q4 record high of $28.4 million, achieving our guidance range of $27.7 million to $30.7 million. In 2022, Townsquare Interactive's net revenue increased 10.5% year-over-year to $90.4 million and profit increased 7% year-over-year to $26.1 million at a 29% profit margin. Townsquare Ignite, our digital advertising segment, was the largest driver of growth in the fourth quarter and full year periods, with net revenue increasing 16.9% year-over-year in the fourth quarter and 20.2% year-over-year for the full year. In the full-year period, other revenue increased $4.7 million or 124% to $8.4 million due to hosting more events in 2022 than we did last year. We anticipate that first quarter digital revenue growth will largely be offset by steep national broadcast revenue declines, leading to a flat to a plus 2% year-over-year total net revenue growth."
}