{
    "symbol": "LAZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 10:53:05",
    "content": " In Financial Advisory, first quarter revenue of $388 million increased 22% from last year's period, reflecting continued momentum, particularly across Europe and North America. In Asset Management, operating revenue of $312 million decreased 5% from last year's period, reflecting lower average AUM for the quarter. As you see interest rates rising, credit markets more challenged, at least parts of the credit market is more challenged, and I think an increasing focus on what's going to happen with earnings in the economy over the course of the next year, I think you're going to start to see -- by almost definition, you're going to see dialogues pick up in restructuring, and that usually is followed by activity levels picking up. But we are seeing significant interest in a lot of our value and quality strategies as we mentioned in this environment where there's been more of a tilt, more towards fundamental active investing, sort of gears more towards our quality or our value type investments and certainly, the thematic strategies that we've been building out over the last number of years, continuing to see very, very significant interest. I think we expect that we're going to continue buying shares with excess free cash flow, continuing the policy we've had and as we generate cash through the year and again, as the business strengthens as we get some revenue growth, certainly, we're more aggressive in buying the shares and it's been a focus of ours. And then sometimes a little bit in Q2, although I'd say, given the performance, given the market volatility that we've seen and sort of the turn down in so many asset classes in different markets, just over the last several weeks, I think you'd expect it to be more muted towards the middle of this year. But look, over time, as you've seen just in the last 2 or 3 years, incentive fees are becoming a bigger portion of the sort of the fee structure that we have and a little bit more in terms of the total revenue across the asset management business. I'm kind of specifically thinking, one, in the first quarter, given the price -- the risk of price declines late in the quarter and what appears or I'm guessing our seed capital losses in the corporate line, but then also in general kind of since we saw incentive fees really kind of spike up in 4Q '20."
}