{
    "symbol": "BNED",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-29 12:42:06",
    "content": " In fiscal '22, our inclusive access offerings contributed to a 2.3% increase in comparable course material sales completely offsetting the significant industry headwinds and representing the first-time course material sales through in over 5 years. During fiscal '22, our First Day Complete program grew to 76 stores, representing approximately 380,000 undergraduate students with revenue growing more than 5x over the prior year to $106 million. As Tom will highlight further, when we look at our First Day Complete schools that utilized the program during fiscal '22, they experienced a 67% increase in total course material sales as compared to less than 1% for non First Day Complete schools and an 83% increase in year-over-year total course material gross margin dollars versus 6% for non-SCC schools. As we look to fiscal '23 and beyond, we expect our key strategic initiatives centered on growing course material sales through our Fosie access offerings, growing our general merchandise business through our partnership with Fanatics and Lids and scaling our digital business to drive earnings growth and shareholder returns. This morning, I'll start with a brief overview of our fiscal '22 results and then share insights on the transformation within our course material business and why we are so excited by the results we've experienced with our inclusive access offerings, First Day and First Day Complete. Our textbook sales benefited from our rapidly growing First Day offerings which collectively grew over 150% to $35.1 million during the quarter, while our general merchandise business benefited from more students returning to campus the resumption of social activities and from our partnership with Fanatics and Lids. Further breaking them apart, First Day Complete revenue increased 41% and to $106.1 million, while our First Day by Course revenue increased 24% to $128.1 million. When First Day Complete is adopted by an institution, which includes all classes and provide students with all their required course materials in both physical and digital form, our sell-through rate increases to approximately 80%. To further highlight the massive impact of our First Day Complete offering and isolating the 62 stores that adopted FTC during fiscal '22, the revenue from that cohort increased 90% from $61 million in fiscal '21 to $116 million in fiscal '22 and their year-over-year gross profit more than doubled from $16 million to $37 million. At our Investor Day presentation, a year ago, we outlined our key strategic initiatives that are centered on growing adoptions of our inclusive access models to grow textbook sales, accelerating our general merchandise business through our Fanatics and Lids partnership, growing subscribers within our DSS business and as a result of these initiatives and increase our value proposition for our campus partners, grow their number of schools we serve."
}