{
    "symbol": "RHI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 19:16:04",
    "content": " For the fourth quarter of 2022, company-wide revenues were $1.727 billion, down 2% from last year's fourth quarter on a reported basis, but up 1% on an as-adjusted basis. On an as-adjusted basis, fourth quarter talent solutions revenues were down 1% year-over-year. Non-U.S. talent solutions revenues were $264 million, up 5% year-over-year on an as-adjusted basis. Currency exchange rate movements during the fourth quarter had the effect of decreasing reported year-over-year revenues by $39 million, $27 million for talent solutions and $12 million for Protiviti. Contract talent solutions bill rates for the quarter increased 7.8% compared to one year ago, adjusted for changes in the mix of revenues by functional specialization, currency and country. On an as-adjusted basis, global fourth quarter Protiviti revenues were up 4% versus the year ago period, with both U.S. and non-U.S. Protiviti's up by 4% on an as-adjusted basis. Company-wide fourth quarter public sector revenues were $83 million, of which $60 million was reported by Protiviti and the balance reported by talent solutions. In contract talent solutions, fourth quarter gross margin was 39.9% of applicable revenues compared to 39.8% of applicable revenues in the fourth quarter one year ago. When combined with contract talent solutions gross margin, overall talent solutions gross margins were 47.5% compared to 47.2% of applicable revenues in the fourth quarter one year ago. Adjusted for deferred compensation related classification impacts, gross margin for Protiviti was 28% for the quarter just ended compared to 29.3% one year ago. Adjusted for deferred compensation-related classification impacts, enterprise SG&A costs were 30.4% in the quarter just ended compared to 29.7% one year ago. Adjusted for deferred compensation-related classification impacts, talent solutions SG&A costs were 37.2% for the quarter just ended compared to 36.2% one year ago. SG&A as a percentage of revenue, excluding deferred compensation classification impacts: talent solutions, 36% to 38%, Protiviti, 14% to 16%, overall, 30% to 32%. From a contract operating margin standpoint, since our stance toward headcount adjusting has always been never to anticipate, but pretty much to just coincident with what we see at the topline, there's always going to be a one or two-quarter lag between the actions we take on our cost, particularly headcount and how they show up in the P&L. Well, if you look at the progression over 2022 of Protiviti's SG&A percentage, you will see that it grew quarter by quarter by quarter to get back to more normal levels because 2021, early 2022, they didn't have as much training."
}