{
    "symbol": "JOBY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 19:33:27",
    "content": " Hi, everyone, and welcome to Joby Aviation's fourth quarter and fiscal year 2022 financial results conference call. On the call today, we have JoeBen Bevirt, Founder and Chief Executive Officer; Paul Sciarra, Executive Chairman; Didier Papadopoulos, Head of Aircraft OEM and Matt Field, Chief Financial Officer. After management's prepared remarks, we will open up the call for questions. Please note that our discussion today will include statements regarding future events and financial performance, as well as statements of belief and expectation and intent. For a more detailed discussion of these risks and uncertainties, please refer to our filings with the SEC and a Safe Harbor disclaimer contained in today's shareholder letter. The forward-looking statements included in this call are made only as of the date of this call, and the company does not assume any obligation to update or revise them. A reconciliation of non-GAAP to GAAP measures is included in our Q4 FY â\u0080\u009822 shareholder letter, which you can find on our Investor Relations website along with the replay of this call. Thank you, Teresa, and thank you everyone for joining us today. 2023 is going to be a pivotal year, not just for Joby, but for our industry as a whole. On certification, on manufacturing, on preparing for commercial operations. Already in the first few weeks of this year, we've demonstrated that the Joby approach works. Last year, we worked hard to become the first eVTOL company to complete Stage 1 of the type sort of process by having our G1 certification basis published in the Federal Register. And already in 2023, we've become the first eVTOL company to complete Stage 2 of the process. Last year, we worked hard to complete our pilot manufacturing facility in Marina, California. And already in 2023, we've become the first eVTOL company to start final assembly of a company conforming aircraft. Last year, we worked hard to build in-house testing capacity, including powering up our integrated test lab and already in 2023, we're running developmental tests in that facility. We expect to have all 13 of our area specific certification plans submitted to the FAA in the first half of the year, and we plan to start conforming tests across the majority of our system areas before the end of the year. As we move into this period of execution, our team is delivering like never before, knocking down the industry first one by one. And a few weeks back, we invited our team members to bring their families along with them to Marina to show them what we've been working on. We had nearly 2,000 people turn up, which I think is not only a sign of the pride and dedication of our team, but it's also the largest crowd that has ever seen an eVTOL aircraft fly in real life. And as we move into the execution phase in manufacturing, we're also making the same transition in our certification and testing work. Didier will talk more about this in a minute, but having a clear path to certification is essential to moving into the execution phase of the certification process where we focus on testing. At the end of January, we were honored to host Billy Nolen, the Acting Administrator of the FAA along with members of his team, including Larry Liu, Executive Director of the FAA's Aircraft Certification Service and Paul Fontaine, Acting Assistant Administrator for NextGen. Watching people see, and here our aircraft fly for the first time is still one of the most amazing things that happens at our Marina facility and it was a proud moment for our team. It's home to the largest aerospace companies in the world and it's home to the FAA, who have set the gold standard on certification throughout the modern era of flight. With our world class team, our committed partners, and a clear path to certification, we look forward to continuing to set the bar for the rest of the world. For every document we submit and with every percentage point of progress we make, dedicated and talented professionals at the FAA are putting in the hard work of reviewing, refining and approving those documents. As we do every quarter, today we published a chart in our shareholder letter that outlines our progress towards achieving tax certification. With the publication of our G-1 Certification Basis last year, we formally completed the first of five stages. And as JoeBen mentioned earlier, we recently announced that we now consider the second stage to be complete as well. In this stage, we've identified the means of compliance, but what we will do to demonstrate compliance with the requirements we set in the first stage of the process. We don't expect those numbers to move substantially at this point, and so our focus has now largely transitioned onto the latter three stages. As we make good progress through Stage 3, our focus increasingly shifts to Stage 4 testing and analysis. In this stage, we developed and execute on detailed test plans across every aspect of our aircraft design and systems. During the quarter, we had further plans accepted, including some covering a  (ph) bonding for our structural system test. As we look ahead to beginning formal FAA testing in more system areas, we continue to expand our in-house testing. During the quarter, we successfully ran structural ring tests, battery vibration tests, propeller birds strike tests, actuation system testing and much more. To support our testing work, we've also designed and built a significant amount of in-house testing capabilities. In particular, I want to highlight the integrated test lab at our production facility in Marina. In this lab, we replicate all of the hardware and software systems that the real aircraft uses, but it's designed to never leave the ground. That means we can perform development and FAA for credit testing, as well as any other testing we want to perform at minimum risk, faster pace and without requiring the costs associated with flying an aircraft. While we're able to complete the vast majority of testing in-house, we couldn't turn down the invitation to test our propeller system in the world's largest wind tunnel facility. Phase just down the road at the NASA Ames Research Center, the National Full-Scale Aerodynamic Complex or NFAC is widely considered to be the gold standard for aircraft aerodynamics and performance analysis. It played an instrumental role in the development of a range of iconic vehicles, including the space shuttle, the V-22 Osprey, the F-35 Joint Strike Fighter and a number of next generation helicopters. Over the next few months, we have a rare opportunity to gather a range of high-fidelity data to support our certification program. It's a genuine privilege to extend our partnership with the U.S. Air Force and NASA, again, as we deliver the next generation of aircraft that will change the world. Moving on to manufacturing, the biggest news for the quarter was the progress we made with the first aircraft to be manufactured on our pilot production line. With all the main structures complete, and at least one of every key part now manufactured were beginning final assembly. This is a real moment of celebration for us, and not just because we get to see the aircraft come together. It's the way in which we've built this aircraft, that separates us from any aircraft we've built previously. We developed a quality management system that complies with FAA Part 21, 135 and Part 45 regulations and forms the foundation of the quality systems that will be required to achieve our production certificate. These three pillars mean that for the first time, we're seeing a company conforming eVTOL aircraft in final assembly and we're already assembling major structures for the next aircraft and parts for multiple aircraft after that. For each one, we'll apply the right level of development and inspection process, defined under our quality management system to match the purpose of the aircraft, allowing us to iterate quickly and incorporate learnings. Good afternoon, everyone, and thanks for joining us today. The progress that JoeBen and Didier highlighted reflects the hard work by the Joby team, which now numbers more than 1,400 globally. Over the course of last year, we grew our team approximately 30% with 90% of this hiring directly supporting engineering and manufacturing initiatives. Turning to our financial results in the fourth quarter of 2022, we incurred a net loss of $66.9 million or $0.11 per share, reflecting a loss from operations of $101.4 million partly offset by other income of $34.5 million. Other income included the revaluation of our derivative liabilities worth $25.9 million and interest and other income, which rose to $8.1 million. Our net loss in the quarter was $72 million below our net income in the fourth quarter of 2021, largely reflecting higher operating expenses of $24 million, a lower favorable revaluation on derivative liabilities of $35 million and the non-recurrence of a one-time tax revaluation last year of almost $11 million. Our fourth quarter adjusted EBITDA, which as a reminder, is a non-GAAP financial measure that we reconcile to net income in our shareholder letter was negative $77.6 million. This was $12.4 million greater than the fourth quarter of 2021, reflecting higher operating expenses outlined earlier and nearly flat compared with Q3 of 2022, reflecting the continued growth in personnel and R&D expenses to support our operations offset by the higher grant payments referenced earlier. Spending increased compared with the third quarter, reflecting higher capital expenditures, which included the acquisition of property and facilities in Santa Cruz to support Jobyâ\u0080\u0099s long-term growth for $25.5 million. In the fourth quarter, we also received the final disbursement from Summer Bio, our equity investment that discontinued operations last year. For full-year 2022, our net cash used in operating activities and purchase of property and equipment totaled $290.8 million. In last quarter's call, we highlighted that we expected our operating cash outflow to be under the low end of our spending guidance. Our reduced spending reflected the payment from Summer Bio, earlier than expected payments from the Department of Defense for contract deliverables, and lower spending across our operations. As we've explained in past quarters, our cash flow as referenced in our shareholder letter and which will be included in our 10-K, excludes cash held in our short-term investments. In the first quarter, we invested a substantial sum of the proceeds from our merger with the Reinvent Technology Partners. Therefore, our statement of cash flow shows a more sizable cash outflow reflecting this investment. As you have heard, we expect 2023 to be an exciting year as we shift from the definition phase to the implementation phase of type certification, including producing our company conforming aircraft and flying with a pilot on board. In addition, we are actively discussing potential locations for our Phase 1 manufacturing plant with multiple states. As mentioned last quarter, we are also negotiating with the Department of Defense on our next contract, which is anticipated to include on base operations. This is a key step forward for our initial operations expected in 2024 and it presents an opportunity to build operational experience in areas like training, maintenance and scheduling that are critical to our future success. At Joby, we're committed to maximizing the effectiveness of every dollar we spend. It's the smart way to do things and that methodical, rational approach can be seen in each area of our operations. It allows us to de-risk our business model and keep each area of our business aligned, so we're only spending when we need to. In each case, we iterate, test and learn on a smaller scale with minimal investment prior to incurring more sizable cash outlays. In 2023, our key priorities continue to be progressing certification, ramping manufacturing and delivering on our commitments to our partners, including the Department of Defense and Delta as examples. To support these efforts, we expect our net cash used in operations and capital expenditure to fall between $360 million to $380 million. Higher R&D expenditures including material to support certification and manufacturing, an increase in DoD-related deliverables related to R&D activities, lower capital expenditures, as well as the non-recurrence of the cash payments from Summer Bio. As you've heard today, we have a lot happening this year to talk about. Good afternoon, everyone, and congrats on another strong quarter. We know from prior releases that relationship has been enhanced to now north of $75 million you said today, you reiterated that you expect to monetize that relationship in 2024, which will be prior to certification and commercialization, which is great. We've obviously been very excited about having two paths to revenue, which I think sets Joby apart from many of the other companies in the space. One, is the focus on moving through FAA certification to broader consumer launch. But the second, as you noted is that we have opportunities to begin to put aircraft into service with the DoD and we've always expected that, that has an opportunity to happen well ahead of FAA certification. And the conversations with our DoD partners, that is both the Air Force and the Marines about what potential service would look like are happening right now. So in the current liquidity number in Q4, that includes the $60 million equity investment from Delta. It's excluded from the operating metric, I usually cite, which really just focuses on net cash and operations and our capital expenditure. That cash is unrestricted, so it's a direct equity investment into the company. Just to clarify, so what we said in the call was the pilot and test flight in the company conforming aircraft would be by year-end. I mean, when you look at the -- by the way, thank you for all the color that you're giving regarding the -- your progress and type certification. And when we look at this timeline here, I mean, you've finished your certification basis, you've done Means of Compliance and you're for Stage 3 for where you guys are at, you're at 93% already. Really appreciate it, and yes, really excited about all the progress that the team and FAA support in achieving the progress to-date with Stage 1, 2 behind us and really focusing on Stage 3 and 4. I think the factors that we shared in the previous quarter remain consistent at this point, whether it be the progress that we're looking into the -- as far with the FAA that remains an important factor. And Matt, on free cash flow, I mean, it seems like your cost cutting and the timing of payment got you to below your 2022 usage. But now when we think about 2023 and beyond, should 2023 be the peak in free cash flow usage, because now you have the land in place, your manufacturing facility. One, is the recruiting we made this year, hiring 30% more than the prior year, that will flow through and that's the biggest contributor to our cash flow increasing â\u0080\u009823 versus 2022. We did have non-recurrence of a couple of one-timers, puts and takes there on both sides, so whether in Summer Bio or the purchase of the Santa Cruz facility. As you look beyond 2023, we will have continued growth in our cash flow simply, because we will then need to build out the commercialization side of the business. We'll be looking to add on capacity, we're talking about Phase 1 manufacturing that really won't affect 2023 in any meaningful way. Now the offsets to those, there's a number of opportunities we're leaning into. So, one on the manufacturing side, its state incentives and government support through things like Title 17 present significant opportunities to help us defray that capital expenditure. On the aircraft side, it's building out those tools and mechanisms that would basically equate to the aircraft leasing structure in the broader industry, if that's an opportunity that comes together. And then lastly, I would add, our go-to-market approaches may vary whether that's things like the DoD, which present not only early revenue opportunities, but long-term opportunities. And as we talked about before, foreign affiliates, where as we put vehicles in market that will pull ahead the cash, because there will be sales to those markets whether they're a joint venture or another own company by a partner and so forth. If I could squeeze a third one, I'm not sure if it's a good question for Paul or Didier. Does this change in rule make it easier for Joby aircraft to operate once it goes into service, since itâ\u0080\u0099s -- you know technically would be powered lift. So, I would say broadly some of these areas are positive and I think indicative of what JB was alluding to at the front of the call. We felt really good about the sort of lenient across the FAA and that includes not just the certification effort that Didier was referencing when he talked about the progress, sort of, momentum that we're continuing to build on the trade-off of documentation, but that also relates to areas like pilot training and operations. So, we think that it's getting the right attention from the right folks at FAA. In general, I've been really, really, really positive about the progress to-date. This is really the combination of many years of development and testing happening in-house on each of the components, the subsystems and systems and now seeing all this come together. Generally speaking, I'd say it's been exciting to see all this, no surprises that we hadn't really accounted for or planned for most of the changes are minors in nature. That's really part of the development process that we're going through here, and yes remain really positive about the progress to-date here. And if I -- just a clarification on just the testing process, just because Joby is doing more, kind of, internally built, kind of, parts that obviously has a clear advantage. Effectively the testing when you think about it from aircraft system and equipment, it really is all the same. It's really about who's actually executing the testing, whether it be Joby the OEM or suppliers. In this case, we will be executing the vast majority of the testing, but weâ\u0080\u0099d also scale appropriately for that. So, you really have to think about it big picture, not just the aircraft manufacturer, but also all the supporting infrastructures and so on. But it does give an advantage in a lot of ways in that the development, the testing, the manufacturing is all in-house. We're all co-located here and we're able to adapt, make changes and address any of the findings really quickly here. So, I do think this is a really, really, really positive thing. Any of the feedback, we're getting is quickly feeding back to the work instructions, to the design, to the testing team and adapting these very quickly for the next series of airplanes, which we're already building here on the manufacturing line. Just wondering, how is the process of selecting a production site in the U.S. going so far? As we think about site selection, we're really looking for -- starts off with the basic requirements. Then we really look at like labor availability, which is critical for any manufacturing decision, not unique obviously to aviation. And then what you hit on there, next is in incentives and how those packages compare across states, but also how do you think about the total cost of those sites, whether it be labor rates and so forth. So for example, having completed development of our first quality system. And so that's really an opportunity for us to actually use that and exercise it through the first build, second build and third build, so that we're always fine tuning it and optimizing it. So in terms of build to conformity, really, we can think about the airplanes we're going to manufacture in two groups. One is a series of company conforming airplanes, and the next one is the FAA conforming airplanes. We do that in order to effectively dry around the testing that we will eventually rerun again and demonstrate with the second group of airplanes, which is the FAA conforming. And generally speaking, we tend to look at some of the more essential and critical features in the first airplane and progressively build on that as we continue to build out. But for all intended purposes, our design is firmed up here and it's really about building against that design and starting to execute on our testing from here on. We're not communicating updates on that front, really the focuses here is to build and deliver on the pilot to flight or I should say the pilot onboard flight, of course, all of our airplanes have been piloted. And then separate question on just the battery strategy, I think a few of the competitors out there have come up pretty publicly using cylindrical, I think two of them are using  cell. So on the battery, we continue to be very pleased with the performance of our battery systems, including the safety features around our battery system and the remarkable performance that we've been able to deliver with it. And again, I'd like to highlight how important we think the lifecycle of the batteries is to the operating economics of our service and the environmental impact of replacing the battery pack. And as we've stated previously, we've demonstrated more than 10,000 representative flight cycles in the lab. And during the flight tests of our prototype aircraft, we've also seen really fantastic life out of them. I know it's a small piece, but just curious. Like I mentioned earlier, those are -- there's a small percentage here and there that may evolve over time. But for the most part, this is really inconsequential really what matters is that we've been able to proceed into the certification plans and the test plans. I would now like to turn the floor back over to Joby's CEO, JoeBen Bevirt for closing comments."
}