{
    "symbol": "HOFT",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-09 14:14:06",
    "content": " This morning, we reported consolidated net sales of $133 million, a decrease of 16.3 million or 11% as compared to last year's third quarter. Net sales increased by 8.7 million or 18.5% in the Hooker Branded segment compared to the prior year quarter, driven by higher demand and inventory availability as well as lower discounts. We've implemented price increases to mitigate increased product costs; however, due to current order backlog levels and customer price changes taking effect at different times, we anticipate seeing more of the benefits of price increases in future periods as more products sold reflect the new pricing. Net sales decreased by 27.5 million, or 37%, compared to the prior year third quarter, driven by inventory unavailability due to the temporary COVID-related closure of factories in Vietnam and Malaysia during the period. We are encouraged that demand remains strong, with Home Meridian finishing the quarter with backlogs 12.5% higher than last year’s third quarter, but more than double as compared to the pre-pandemic levels. In the Domestic Upholstery segment, net sales increased by 2.6 million or 10% in the fiscal 2022 third quarter compared to the prior year period. Since this segment has a current order backlog of five to six months and prices were not increased on backlog orders, we anticipate seeing benefits of the price increases beginning in the second quarter of next year. On a positive note, as COVID vaccines have rolled out, especially among the senior population, H Contract's incoming orders have increased three consecutive quarters in a row, and finished the quarter with backlog 150% higher than the prior year third quarter. Cash and cash equivalents stood at 57.2 million at the end of the quarter, down 8.6 million compared to the balance at the fiscal 2021 year end as we worked to increase our inventory levels, which were unacceptably low at year end in an effort to service the high demand that we've experienced all year. Your line is open. I do want to add to Paul's question or his answer on the last one that the savings at HMI for next year won't be fully realized, but around 6.5 million if you consider West Coast warehouse, some salaries that had to do with the RTA division mostly and then the savings that we're anticipating with Savannah by not having the drage from the port all the way to  and then Madison, those are very significant. Your line is open. Your line is open. Your line is open."
}