{
    "symbol": "HOFT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-13 14:53:04",
    "content": " This morning, we reported consolidated net sales of $594 million, an increase of $53.5 million or 10% compared to last year, driven by year-over-year sales increases of more than 20% in both our Hooker Branded and domestic Upholstery segments. Contributing factors in the fourth quarter loss included inventory unavailability due to COVID related Asian factory shutdowns from August through late in the year, continued high freight costs, decline in ecommerce and hospitality furniture sales and cost of approximately $5 million for the company's planned exit from unprofitable businesses and channels. Our planned exit from unprofitable businesses and channels at HMI, including inventory write-downs, chargebacks from the Clubs channel, and order cancellation costs as we wind down our RTA furniture business resulted in one-time cost of over $5 million in the fourth quarter, which was a major driver of our consolidated net loss during the final quarter of the year. For the 2022 fiscal year, net sales increased by $38 million or 23.5% compared to the prior year. For the fiscal 2022 Fourth quarter, the HMI segment’s sales decreased by $19 million or 23.7% as compared to the prior year fourth quarter. Driven by higher freight costs, exit costs from the RTA furniture category and significant chargeback from the Clubs distribution channel, HMI reported a $21 million loss for the year. The segment reported operating income of $4.3 million or 4.2% operating margin as compared to the 12.4% operating loss in the prior year, which was attributable to a $16 million non-cash intangible asset impairments. In our all other net sales increased by $200,000 or 1.7%, compared to the prior year due principally to sales increases in our lifestyle brands division, a business that started in fiscal 2019 targeted at the Interior Design channel. For fiscal 2022 fourth quarter, all other net sales increased by a $1 million or 46% as H contract net sales increased by 44%, which offset sales decreases in the first three quarters. Obviously, I don't mean you're going to be in Minnesota and selling a bunch of outdoor in the winter, but there are a lot of states that do sell outdoor year round, and some of those would probably surprise you, but so we don't think there's a big seasonality component in that business."
}