{
    "symbol": "HOFT",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-09 15:35:04",
    "content": " This morning, we reported consolidated net sales of $162.5 million and net income of $7.5 million or $0.62 per diluted share for our fiscal 2022 second quarter, which ended on August 1. Compared to last year's second quarter, net sales increased by $32 million or 25%, while net income increased $1.7 million or 29%. For the fiscal 2022 first half, consolidated net sales were $325.4 million, up $90 million or 38% compared to last year's first half. Operating income in the fiscal 2022 second quarter was $8.9 million or 17.9% operating margin, compared to $6.1 million or 15.7% margin in the second quarter of last year. Turning now to the Home Meridian segment, HMI's second quarter sales were $87 million, up approximately 23% over the prior year. Incoming orders increased about 4% as compared to the fiscal 2022 first quarter, but decreased by about 35% compared to the prior year second quarter when business rebounded dramatically after the height of the initial COVID crisis. Our Pulaski Furniture division delivered particularly strong Q2 results, with net sales exceeding the prior year by 68% and operating income increasing by $1.3 million. In the Domestic Upholstery segment, net sales increased by $5 million or 29% in the fiscal 2022 second quarter compared to the prior year quarter due to significant sales increases at Bradington-Young and Shenandoah and to a lesser extent our Sam Moore division. Operating income for the fiscal 2022 second quarter was $457,000 or 2% of net sales compared to a small operating loss in the prior year second quarter. In All Other, sales increased by $300,000 or 10% in the second quarter as compared to the prior year period due to an 11% sales decrease at H Contract. Operating income for the quarter was $230,000 or 8.5% of net sales compared to $350,000 or 11.5% of net sales in the prior year. Finally, touching on our cash and inventory position, cash and cash equivalents stood at $37.4 million at the end of the quarter, a decrease of $28 million compared to the fiscal 2021 year end, due primarily to a $33 million increase in inventory as we continue to build inventories to meet increased customer demand and prepare for the holiday selling season."
}