{
    "symbol": "BYND",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 21:41:09",
    "content": " Q2 2022 net revenue per pound was $4.88, down from $5.69 per pound in Q2 2021 and was primarily attributable to decreased price per pound, including the impact of selling to liquidation channels, and other pricing changes, including the EU list price reductions instituted in Q1 2022, changes in foreign exchange rates and increased trade discounts. The sequential improvement was driven by an increase in revenue per pound, including a onetime true-up of $1.4 million, primarily for pricing on Q1 volumes and a decrease of Jerky as a total percentage of the mix. We estimate Jerky accounted for an approximately 57% of the increase, with the remainder being driven by increased manufacturing costs, including depreciation, increased materials cost, higher transportation and warehouse costs and increased inventory reserves versus the year ago period. We estimate to reiterate, we estimate Jerky accounted for approximately $0.57 of the increase, with the remainder being driven by increased manufacturing costs, including depreciation, increased material costs higher transportation and warehousing costs and increased inventory reserves versus the year ago period. Logistics costs, including those associated with internal transportation and warehousing, increased $0.15 per pound in Q2 2022, and versus Q2 2021. But in Q2, we also had an increase in inventory reserves that created an increase of approximately $0.14 per pound of additional costs versus Q2 2021. Note, contained in our Q2 2022 operating cash flows, we contributed approximately $6.7 million towards the build-out of our new innovation and headquarters facility here in the L.A. area, which was recorded in prepaid rent compared to approximately $26.6 million in Q2 2021. The significant majority of the decrease was driven by three main areas: first, reductions in our outlook of Europe and the Middle East, where according to Nielsen data, plant-based meat across all our brands for Burger, Mince, Meat balls and Sausage in our key European markets has decelerated from growth of approximately 7% in 2021 to shrinking approximately 14% year-over-year in the first half of 2022. Our gross margins in Q3 2022, while we do not expect similar liquidation and inventory headwinds to Q2, the decreased revenue forecast puts additional pressure on gross margin versus earlier forecast by negatively impacting capacity utilization which could also give rise to termination fees to exit certain supply chain arrangements, driving less leverage on fixed costs and delays the speed at which cost savings initiatives make their way into the P&L. Although we will continue to look for opportunities to reduce this further by deferring additional spend, we expect additional cash contributions for the build-out of our innovation center and headquarters facility will be $12 million in the second half of 2022, with the expected $15 million remaining to the completion now deferred into 2023."
}