{
    "symbol": "BYND",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 20:37:03",
    "content": " During the quarter, our products notched several accolades, including among others, BuzzFeed's number one spot for plant-based chicken tenders, All Recipes Community Choice Awards for Best Plant-Based Meat Brand, Edge News Best New Product Award for Beyond Chicken Tenders, along with Best Plant-Based Burger and Sausage for the Beyond Burger and Beyond Sausage. We saw a solid increase in pounds of products sold, rising 12% year-over-year, which was partially offset by a 10% decrease in net revenue per pound, driven by increased trade discounts, strategic list price reductions in EU and changes in sales mix and decreases in the value of the euro relative to the dollar. According to Numerator data through the first quarter of 2022, household penetration for the Beyond Meat brand stood at 10.3%, an increase of 180 basis points year-over-year, while our repeat rate increased 80 basis points year-over-year to 46.3%. For Q1 2022, average net revenue per pound was $5.13, down from $5.70 per pound in Q1 2021, primarily driven by increased trade discounts, strategic list price reductions ahead of expected cost reductions, changes in mix and a negative impact from foreign exchange. We estimate Jerky accounted for approximately $0.68, with the remainder being driven primarily by increased manufacturing costs, including depreciation and higher transportation and warehousing costs, partially offset by improved material cost and reduced inventory reserves and write-offs relative to the year ago period. For the non-Jerky inventory we manufactured in Q1, although still impacted by new product launches, lower foodservice volumes than initially anticipated and variability of demand across products, our costs improved later in the quarter as we stabilize the network, matched labor to production needs and optimized where we produce each SKU based on the overall best economics. In Q2 2022, we expect a similar sequential uptick in net revenues to what we experienced last year, followed by accelerated year-over-year growth in the second half of the year, driven by recent distribution gains, acceleration in international markets as a result of price resets and broader availability of extended shelf life products in the EU, anticipated new product launches and expected QSR launches and trials both in the U.S. and abroad. But amongst price and then maybe a little bit in understanding what's been going on in the international markets because if we take a look at the results, it felt like in the U.S., the discrepancy between volume growth and then ultimately, sales growth, it wasn't that big, but it was kind of stunning to see how significantly you were able to expand volume in the international business, be it in retail or foodservice, i.e., by 20% up to 30%. So again, this is -- Phil can add to this, but this again where I think we just have to kind of everyone take a step back and look at what we're doing, so we were able to increase volume in retail in the EU by about 19% for the quarter year-over-year, but that was offset by a 21% reduction in net revenue."
}