{
    "symbol": "DK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 17:09:02",
    "content": "  Operator: Good day, and welcome to the Delek US Holdings 2022 First Quarter Earnings Call. I would now like to turn the conference over to Blake Fernandez, SVP of Investor Relations. Joining me on today's call is Uzi Yemin, our Chairman, President and CEO; Reuven Spiegel, EVP and CFO; Todd O'Malley, EVP and Chief Operating Officer; as well as other members of our management team. As a reminder, this conference call may contain forward-looking statements as that term is defined under Federal Securities laws. In addition to reporting financial results in accordance with Generally Accepted Accounting Principles, or GAAP, we report certain non-GAAP financial results. Investors are encouraged to review the reconciliation of these non-GAAP financial measures to the comparable GAAP results, which can be found in the press release posted on the Investor Relations section of the website. Our prepared remarks are being made assuming that the earnings release has been reviewed, and we are covering less segment and market information that is incorporated into the press release. On today's call, Reuven will review financial performance. On an adjusted basis, for the first quarter of 2022, Delek US had a net income of $42.9 million or $0.58 per share compared to a net loss of $80 million or $1.08 per share in the prior-year period. I would like to highlight that during the quarter, the Tyler refinery inventory was retrospectively converted from a LIFO accounting basis to FIFO. In an effort to simplify messaging, we plan to discuss underlying performance on an adjusted EBITDA and EPS basis going forward. Moving to Slide 4, we provide the cash flow waterfall. In the first quarter of 2022, we had a positive cash flow of approximately $27 million from continuing operation, which includes a working capital detriment of $77 million. Excluding net debt at Delek Logistics of $903 million, we had net debt of approximately $456 million at March 31 of this year. Moving to Slide 6, we provide first quarter guidance for modeling. Regarding the $64 million share purchase from the Icahn Group on May 7, this represented 4.7% of our shares outstanding. Given that the transaction occurred fairly late in the first quarter, the full impact of our share count will not be witnessed until the second quarter results. Finally, the planned acquisition of 3Bear places us well on track to achieve our longer-term midstream EBITDA target of $365 million to $395 million across our segments. This transaction should help transform DKL into a larger, more scalable entity with approximately 40% of pro forma contribution margin coming from third parties on a fixed fee basis, along with broader diversification within the Permian Basin and expanded product mix into natural gas and water. Collectively, these attributes should further propel DKL toward becoming a true stand-alone entity and enhance the underlying value of DK's interest in the company. With that, I will turn the call over to Todd to discuss operations and CapEx. During the first quarter, our total refining system crude oil throughput was approximately 272,000 barrels per day. In the second quarter of '22, we expect crude oil throughput to average between 280,000 and 290,000 barrels per day or approximately 94% utilization at the midpoint. With no major turnaround activity planned for the balance of the year, we are in a strong position to capture the elevated margin environment. On Slide 7, capital expenditures during the first quarter were $33 million. Before turning it over to Uzi, I would like to highlight the significant growth being witnessed in our Permian Gathering system. Strong producer demand drove a significant ramp-up in volumes with a 20% increase sequentially, and we expect volumes to at least double from 4Q '21 to 4Q '22. With that, I'll turn the call over to Uzi for his closing comments. Adjusted EBITDA reflected a significant improvement, and we expect ongoing momentum into the second quarter based on prevailing margins and no planned maintenance. As we generate free cash flow, we will continue to look for opportunities to enhance our balance sheet and return cash to shareholders. In our Legacy DPG system, we're seeing opportunities for organic growth. Not only does this provide an avenue for incremental earnings in our gathering business, but should ultimately lead to more attractive crude discounts in our refining system. Additionally, strong producer nominations gave us the confidence to pursue the announced 3Bear acquisition. This strategic opportunity will help springboard DKL to be more competitive among midstream peers, and provides a platform for further growth into the future. After a challenging several quarters through the pandemic-led downturn, our company is firing on all cylinders and well positioned to capture opportunities that exist in the market. Good morning, Carly, thanks for taking the time to ask us these questions. So we said all along that there will be no turnaround during this year, no major turnaround. We took the opportunity to fix a couple of things in the first quarter, the reason you see the $272 million number. Actually, we are right now over 100% our nameplate running for quite some time. Now I don't want to commit on behalf of our lead operator, Nithia Thaver, who just got nominated. I want him to beat the expectations, but it looks pretty strong right now. Well, Carly, I said to the guys here that I'm going to be -- to give reality the way we see it. The margin we see now are -- and I've been doing it a long, long time, I've never seen any margins like that in my entire career. And we positioned ourselves -- we didn't know that the margins will be as strong, but we've positioned ourselves with no major maintenance. We obviously took the opportunity to buy the shares from the Icahn Group at $18 and change, we're already up 40%, 35% on that investment. That's what you investors expect from us, and that's what we do. In our malls, we look on doing that toward the second quarter or the third quarter when we announced the second quarter results. If things stay like that, there's no reason to believe that we won't look at both. In doing that, depends on what the market looks like. But right now, the margins are so strong and operation looks good. So we are bullish about returning cash to shareholders on top of doing other investments similar to what we did with 3Bear, we don't have anything on the horizon with the acquisition. And last I just wanted to congratulate, Uzi, on your retirement, and thank you very much for all of the value perspectives over the years. Yes, good morning Uzi, and I assume this is going to be your last major call with us. If so, then I offer my congratulations as well, although I know you're not leaving the company altogether. Honestly, this is going to be my -- the one before the last one. I want this quarter to be the prior quarter, if you will. One historically, Delek has had a fairly high distillate yield as a refiner and certainly among what we consider the smaller mid-cap refiners. So I was curious how that still appears to -- assuming that still is intact, how that's running through the system. And then as you look at an environment today that's very different than what we've typically seen when we think of outsized earnings power for Delek, it's always been more of a crude feedstock driven. Well, certainly, you saw in the past 4 handle with crack spread 4 handle when I say 40% and more, 41%, 42%, 43% for distillate with crack spread being $80 per distillate or $70, we're pushing everywhere we can through the DHTs, the different DHTs in the different places. And gladly or luckily, we had some room for days like that, both in El Dorado and in Tyler. So absolutely, we're planning to be with the four handle 40-something percent for the quarter. Obviously, higher than 42%, 43% will be just great achievements. And then as we think about the -- I think Big Spring is a little more gasoline, a little less diesel than the rest. And Nithi, I don't know if you want to say something about that. Nithi, I don't know or if you want to add anything to that. The DHT in Big Spring, you should look at the historic numbers running at full. During times like that, all you want is to run what you know is reliable. What I'm going to tell you, though, that because of our experience and because of the work we have done over the last few quarters, we do run, as I said, more than 100% utilization. But over these last 40 earnings season or so, I've always looked forward to your comments on macro and refining, Uzi. So I would say, post 2Q, the refining earnings season would just not be the same without your insights. We have been -- we know each other for a long, long time. So Uzi, a quick question here is, over the last 10 years, let's go back a little. Now as the company has evolved, particularly in the last two, three years, the perception that is here is that now Delek is a Permian Midstream company that also happens to run Permian crude. We always said, and I remember one of your note saying that this is -- that we are changing the company. With the addition of 3Bear, we certainly feel that we achieved our target of $375 million EBITDA. Especially in light of the activity that we see in the Permian, that's an opportunity for me to say that we actually saw gathering going to -- if you remember, Manav, it was 80,000 barrels by the end of last year. So the activity in the Permian is certainly picking up, and we are going to continue with this Midstream strategy all along. At the same time, we are -- we want to capitalize on refining. During the downturn, there were some talks about different refineries to be shut. I felt and still feel that during downturn, we just tight your belt and you stick to it. But refining, for sure, is something that we will continue to look at and make sure that this is the bread and butter of our company. Thank you so much, Uzi. Uzi, I guess I'll add my congratulations. 15 years now, Doug. One of us still is, I'm not sure which one. Look, when we did meet it was during the original Golden Age, it didn't last very long, I guess. That's a great one, Doug. Let's -- and by the way, I read your note about the new Golden Age. We're not too sure our ages now, you and I. And I don't know, $80 distillate crack. Now big picture, the war in Ukraine in my mind is not going to end tomorrow morning. And even if it ends tomorrow morning, there will be some time before things pick up in Ukraine or in Russia, I'm sorry. At the same time, there were a lot of closures of refineries, including here in the U.S. And the crude situation didn't get much better because of the downturn and because of the lack of investments. So I think what will happen now as producers still, we hear a capital discipline. But $100, you'll say one day capital disciplined, the second day. So what we will see in the U.S. is picking up -- in our mind, picking up of drilling, and that will lead to differentials widening up. That's on top of the ESG movement, which we all know exist. And ESG, and we all know that, if you run LIFO with build, your emission, your greenhouse emission is much lower than when you run heavy sour crude. So overall, I think that you'll note and your timing was just spot on looking at the industry, I think we're right for a good 12, 18 months ahead of us. Well, let's say, I think it takes longer than that. But in absolute terms, it's pretty much been range grown for almost 10 years. And when I look at things like the cost of the industry, your G&A is about a thirds of Marathon, but the company is about a tenth of the size of Marathon, just to use that as an example. Is our refinery focused on the way you've focused on the lower 48 inline crude discounts, which have obviously tightened some. First, I'm going to challenge you back. If you take the combined operating cost, together with G&A, you will see that we not only were in line, but screened better than others. We want to challenge ourselves on that, but I'll leave it to that. You're asking a much bigger question than the G&A, because the G&A is just allocation between the buckets. DK, and I said it, and I was bold in the past, DK as well as other small companies don't need to be stand-alone companies. And it's not a secret that during the pandemic with CVR buying shares, I thought that it's better to be together. I'm still saying that small companies, not only on the refining side, also on the midstream side, we see that the market favors the big names of Valero, PSX and NPC. The market also favors midstream big guys, even though DKL performed very, very well. Like enterprise or EPD, Magellan, and other names, Kinder Morgan. So I think the industry, especially in light of these golden ages or diamond ages in the last 12, 18 months or, as you say, 24, 36 months, this industry is ripe and should be consolidated. Uzi, perhaps you or maybe the new CEO could talk about the outlook for your cash return structure. We -- the capital allocation and the capital return, as you said, these are really extraordinary times. And there's no reason to believe, you know it, that over the years, you've been with us a long, long, long time that we increase the dividend on a quarterly basis. We -- and with the times the way they are today and the amount of free cash flow, the cash or returning cash to shareholders is certainly something on the radar. To be honest, we considered to do it even this quarter, but we decided not to do it just to be prudent and to see how things shake up. But the way it's going, our Board certainly looks at it very favorably. And could you just say your usual round up of -- well, we know that demand in your region is a bit different. But obviously, what we're looking at is demand disruption, pricing levels. And I'm sorry, I'm not being very jokey, but I did enjoy your line about being old and handsome. Well, as we say, with the Permian activity picking up, the demand is certainly there. I said it, we're running wide open, completely full nowadays. However, I think that the lot of these 4 million barrels of refining capacity as well as the things that are happening in Russia more than offset the demand disruption. Paul, it's up 0.8%. Hey guys, good afternoon. Mr. Cheng, are you going to give me hard time as you know now that I'm leaving? I mean that just wish you have a wonderful time in retirement, but you're too young to actually fully retire. So I'm sure that we'll see you again at some form, but also that we should be able to spend a lot more time with your families in this world. Certainly, there's somebody over there waiting for me. Hey, Paul, it's Blake. I think you probably noticed that in our 1Q, we have just under $10 million of business interruption. And just curious that once that -- now you are -- everything is in FIFO, one of your competitors, CVR, they treat the FIFO impact as a special item. Paul, the approach we're taking is that it will not be adjusted out. And so going forward, our communication with yourself and your peers is largely going to be around what adjusted EBITDA is going to be. But on a full-year basis, that will even out. So on a full-year basis, the number should look fairly comparable with peers. As you know, Paul, when you look back at NAPCO, we are going to continue to invest in retail. But if the opportunity comes, then, for sure, that's something that I'm sure the new management will look at. As you know, building a store costs $6 million, to be conservative. The EBITDA for that store is $1.2 million, $1.3 million, therefore it's 5x. There's not a lot of projects that you can do that, especially with the free cash flow that is coming our way. But at the same time, if we can get a nice multiple and it makes sense for somebody else to take it, then for sure, we will look at that. I think you've been saying that for some time, but you're saying that you need a certain critical mass before you will consider a sale. Well, if you remember, NAPCO, we had like 35 NTIs, the prototype, if you will. And these NTIs, as I said, generate $1.2 million. So you're talking about another $40 million, $45 million of EBITDA on top of the $50 million that we have right now. So if you're approaching $100 million, then you probably have a great chain that you can monetize it if you decide to do so. Hey guys, this is actually John Royall filling in for Phil. If you look at our midstream, obviously, the leverage will go up now because we are going to finance the 3Bear deal mainly through debt. So -- but long-term, we always say to ourselves that between 3x and 3.5x on the midstream side makes sense. And then if you look at the stand-alone, the other business, if you will, like refining, retail and renewables, we don't want to be more than 1x on that. Obviously, with the EBITDA that we're generating, we will be something lower than that. But we see that, honestly, with the amount of cash that is being generated, we can do several things or show up the balance sheet, making sure that we have money for investments and at the same time, return cash to shareholders. We used to think that $1 billion is a good number, and I don't think that we change that much. So it would be great if you could just give some color around your updated expectations there and your view on Permian production growth, I guess, over the... Yes, I'll let Todd to take that one. As I'm sure you're aware, the Midland differentials have been bouncing around kind of at $0.50 premium to about $1.50 premium. Right now, they're pretty much somewhere right in the middle of that at $1. As we go out the curve, because of exactly what you just mentioned, the fact that we see incredible growth in the Permian, especially around our Midland gathering system, we see that differential between Midland and the coastal markets widening out significantly. In addition to that, Brent-TI is also fairly wide on a recent history basis in the backs of the curve, so about a $5 differential. We feel good that, as Uzi said earlier, differentials will continue to erode. And then in addition to that, with the incremental growth that we're seeing, that's a big tailwind for the DKL piece of the business as we start to load into Wink to Webster and also just on the Delek Permian Gathering system. So if you have any follow-ups, we can go deeper, but I think that covers it. Uzi, just wanted to echo the comments that others have made. And I was wondering if you could discuss some of the benefits, if there are any, that the acquisition brings not to the MLP, but to the C-Corp from an operational synergy standpoint. You're asking actually three questions, Jason. First, getting into 3Bear, we felt that, that's the right timing. And the moment we felt that the market is changing, that was the time that we put the trigger. Similar to what happened with the -- with the Icahn Group, we were been working with them for a while. And then when we thought that the time was right, we put the trigger to buy their shares. We felt that we need to complement what the DPG system that we have with another Delaware system, if you will. The second thing is, obviously, the timing is with everything that is happening in the Permian, we hope that producers will continue to drill and accelerate that. We got into this business because it has two other areas of interest for us, natural gas and water. And also, we are with the lack of water in the Permian, we are going to move as an industry from fresh water to produce water, which 3Bear know to do very well. That will open up the opportunity for us to lend these two lines of business, not excessive -- not too expensive entry point and maybe to apply it to the DPG and to the existing producers we have. Hey, Jason, it's Todd. And if Uzi has any other comments, he can jump in on the back end. So for us, we were involved in the process, but those barrels look relatively expensive to us. The benefit that we see is the fact that as those barrels come out of the SPR, we have seen -- we did see a couple of weeks after the fact when they started hitting the market, that Brent-TI spread widening out. And in addition to that, we also saw the differentials come off, which I think is, by and large, a product of the fact that a number of those barrels out of the SPR release went offshore and satisfied some of that demand and that left some of the inland barrels hunting for home. So again, that was extremely advantageous for us, and that was our view. Well, I'd like to thank my colleagues around the table. With the new nominations of Avigal Soreq, as our new CEO; Todd O'Malley, as our COO; and Mr. Thaver, as our President of Refining, I think we have a very experienced and very capable management team. I know all of them for many, many years, and I believe that they will do an excellent job for our company. Also, I'd like to thank you investors in believing in us, the analysts for asking questions. The Board of Directors, obviously, for sticking with us during the downturn. But mainly and mostly, I'd like to thank each one of the employees of this great company, who makes it what it is."
}