{
    "symbol": "ENS",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-09 20:58:02",
    "content": " We delivered strong Q3 results reporting $920 million of revenue and $85 million of adjusted operating earnings, our highest revenue and highest adjusted operating earnings in the company's history as all three lines of businesses performed well. Despite interest and FX rate headwinds, as well as ongoing supply chain and inflationary pressures, we reported third quarter adjusted earnings of $1.27 per diluted share, above the midpoint of our guidance and a 26% increase versus $1.01 per share in Q3 '22. Adjusted operating earnings were also a record for the company at $85 million in the third quarter, up 41% from Q3 '22 and 30% higher than Q2. As Dave mentioned, Energy Systems delivered significant improvement to adjusted operating earnings as a result of impressive price/mix cost recapture taking hold for the second consecutive quarter, with nearly 170% adjusted OE improvement versus prior year and over 60% improvement sequentially. On another positive note, Motive Power adjusted operating earnings improved approximately 20% over both prior year and prior quarter, driven by mix improvements in maintenance-free sales, as well as positive price/cost recapture. While we are still incurring significant cost increases, Q3's $0.40 per share of price/mix cost recapture is our second consecutive quarter of significant improvement, further closing the gap on the unprecedented cost increases we have endured over the past two years. Excluding the impact of our $150 million asset securitization program, we believe the leveling off of our primary operating capital levels in Q3 '23 represents an inflection point in which further efficiencies should positively impact cash by the end of fiscal '23, with significant cash generation opportunities when supply chain volatility and costs begin returning to pre-pandemic levels. However, while our year-on-year improvement is commendable, it significantly understates the impressive operational improvement of our business, as our guidance reflects our expectation of continued sequential volume and net price/mix/cost gains, but our strong financial performance will again be muted by FX and interest rate headwinds similar to what we saw in Q3 '23. We expect our gross margin to be in the range of 22% to 24%, and we are refining our CapEx expectation for the full fiscal year '23 to approximately $90 million, reflecting investments in new products, including lithium production lines, continued expansion of our TPPL capacity and cost improvement in automation initiatives. And those -- we've got different pricing strategies for different markets, whether it's surcharges for energy in Europe, whether it's list price changes, whether it's gains of high stakes chicken with certain big OEM customers, we've had to run the full gamut, the full playbook over the last few quarters, but you can see some of that starting to catch up. So, we just -- we've got a lot of work to do, but I think the general question in terms of our CapEx deployment and generating enough demand to continue the growth in TPPL, I think we're -- everything's full steam ahead in that area."
}