{
    "symbol": "ENS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-11 15:46:03",
    "content": " First quarter net sales were $899 million, an increase of more than 10% over Q1 '22, driven primarily by our strong volumes and ongoing aggressive pricing actions, partially offset by FX headwinds. Excluding the FX headwinds and shutdowns at our Missouri plants due to serious supply chain issues, our first quarter revenue would have been approximately $40 million higher. A record $1 billion first quarter of orders continued to outpace sales in the quarter, growing our backlog by more than $150 million to $1.5 billion and 70% higher than Q1 fiscal '22 and a staggering 165% higher than Q1 fiscal '21. Energy Systems saw continued strong demand and volumes in the quarter, reporting revenue of $409 million or more than a 10% increase compared to the same period -- same prior year period. Our Specialty segment reported revenue of $123 million in the quarter, a 14% increase year-over-year, which was driven by strong volume and improved price mix despite the continued challenges of labor and supply shortages, including the Missouri shutdown mentioned earlier, along with the normal seasonality in both transportation and aerospace and defense. Our first quarter fiscal '23 net sales increased more than 10% over the prior quarter to $899 million due to an 8% increase from price mix improvement and 7% from organic volume growth, partially offset by a 5% decrease in foreign currency translation impact. The Missouri shutdowns, Dave mentioned, reduced revenue by approximately $10 million with a $3 million drag on operating earnings due to a richer mix of revenue being impacted and with $2 million of incremental costs from the shutdown being deferred until Q2 '23 when the inventory will be sold. Adjusted operating income was $65 million in the first quarter, down slightly from the $67 million reported in the fourth quarter of fiscal '22, net of an increased FX drag and down $10 million over Q1 '22 net of over $4 million of FX pressure with the remainder due largely to the price/cost recapture lag. On a sequential basis, we incurred approximately $0.50 per share of volume-adjusted incremental costs in Q1 '23, which were mostly negated by $0.40 per share of improvement in price mix. Compared to the first quarter of fiscal '21, we have incurred aggregate cost increases of over $1.70 per share with $1.35 per share having been offset by price/mix improvements, leaving approximately $0.35 per share of quarterly price cost recapture opportunity when costs stabilize on top of the impact of future mix improvements when supply chains become balanced. Regarding the impact of FX on our Q1 results, in Q1 '23, operating earnings were reduced by approximately $0.07 per share after tax from the weak euro, which was fully offset by the favorable impact of FX revaluation and other income and expense from the declining euro. Compared to the fourth quarter, the net impact of FX created approximately $0.03 of incremental drag on both OE and our earnings per share and compared to the prior year, OE was pressured by approximately $0.09 per share of incremental impact with the $0.03 per share incremental net drag on EPS from foreign exchange after the favorable FX benefit in other income and expense. We have increased inventory almost $225 million in the past fiscal year, $61 million of which was in the first quarter due to increased sales volumes, higher costs and lead times and a focus on lithium cells lead and other raw material components to mitigate supply disruptions. Our guidance reflects the seasonally slower quarter due to holidays in Europe and is also absorbing $0.04 per share hit from the Q1 23 Missouri closures and approximately $0.08 per share pressure from FX on op earnings as we assume the euro-dollar relationship will remain at Q1 23 levels, and we won't benefit from the other income and expense gain we experienced this past quarter when the euro value declined. The closure of our Ulta facility is expected to save us approximately $8 million per year, with $2 million of savings beginning in the back half of fiscal '23. As Dave mentioned, we're in the process of our annual strategic plan refresh. While timing and market conditions have been volatile this past year, our market opportunities have only continued to grow. We are confident the true profitability of our business and advancements we have made against our strategic plan will be evident when market conditions stabilize, and we look forward to providing you our update later this fiscal year. The closure of our Ulta facility is expected to save us approximately $8 million per year, with $2 million of savings beginning in the back half of fiscal '23. As Dave mentioned, we're in the process of our annual strategic plan refresh. While timing and market conditions have been volatile this past year, our market opportunities have only continued to grow. We are confident the true profitability of our business and advancements we have made against our strategic plan will be evident when market conditions stabilize, and we look forward to providing you our update later this fiscal year."
}