{
    "symbol": "ENS",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-10 22:32:04",
    "content": " Second quarter net sales were $899 million, an increase of nearly 14% over Q2 '22 even after absorbing approximately $45 million of FX headwinds with strong volume growth in all lines of business. Despite ongoing supply chain and inflationary pressures, we reported second quarter adjusted earnings of $1.11 per diluted share, above the midpoint of our guidance and up $0.10 versus prior year. Margin improvement was driven by an impressive $30 million of favorable price/mix accomplished across all segments of our business, which was partially offset by an additional $11 million of volume-adjusted costs versus the first quarter. Backlog was up 38% versus prior year and, for the first time in several quarters, declined slightly to $1.4 billion due to an easing supply chain that enabled more products to be shipped, primarily for Energy Systems and Specialty. Energy Systems saw continued strong demand and volumes in the quarter, particularly in broadband and data center, reporting revenue of $437 million or an 18% increase compared to the same prior year period. Sales related to the California Public Utility Commission, CPUC, Public Safety grid shutdown, extended network powering program are ramping as expected with $40 million build in 1H F '23, including $20 million in the second quarter and $95 million remaining in backlog. Motive Power delivered another solid quarter considering the typical seasonal slowdown in EMEA, with 2Q '23 revenue of $338 million, increasing 5% compared to Q2 '22. Our second quarter fiscal '23 net sales increased nearly 14% over the prior year to $899 million, driven by 10% organic volume growth and 9% price/mix improvement, partially offset by a 5% decrease from foreign currency translation. Adjusted operating earnings were $65 million in the second quarter, up 7% from the second quarter of fiscal '22 and in line with Q1. On a segment basis compared to the prior year, all lines of business posted significant revenue growth, driven by higher volumes and substantial price/mix improvements which were partially offset by $45 million of foreign exchange headwind. However, the favorable impact of volume and price/mix improvements on operating earnings was offset by higher costs and $5 million of unfavorable FX year-on-year. This easily dwarfed the $0.23 per share of volume adjusted incremental costs incurred during the quarter, which while still significant, where half of the sequential cost increases we incurred in the first quarter, illustrating the long anticipated catch-up on price/cost recapture with our most substantial net quarterly price/cost recapture gain by far. Expanding on Dave's comments about the extent of inflation we've endured over the past 2 years, we have incurred aggregate cost increases in Q2 '23 versus Q2 '21 of over $2 per share or $8 per share on an annualized basis. We had increased inventory over $170 million in the past fiscal year, $34 million of which came in the second quarter due to our higher revenue, but even more so as a result of our intentional decision to create targeted inventory buffers against potential supply chain disruptions, as well as the impact on inventory from longer lead times and higher raw material, manufacturing and freight costs. These include: over 60% of our business follows GDP independent cycles that are fueled by large mega trends, including 5G that are expected to continue regardless of the macro environment; we have a near record backlog and strong orders in all of our lines of business; stable costs should drive further price recovery catch-up improvements with potentially lower cost creating tailwinds from lagging price/cost dynamics; the continued easing of supply chain disruptions should help drive profits through volume and mix benefits; and finally, because primary working capital historically has been a significant cash generator in slowdown, it should serve as a very effective natural hedge on our balance sheet and even more so now, due to our current elevated levels. Our CapEx expectation for the full fiscal '23 remains at approximately $100 million, reflecting investments in new products including lithium production lines, continued expansion of our TPPL capacity and cost improvement and automation initiatives. U.S. government replacement spend for Ukraine support isn't flowing through yet, but we expect that's going to start coming in strong, which leaves us with Motive Power, probably the area you're focused on the most, $200 million backlog versus 2 years ago and $100 million from a year ago."
}