{
    "symbol": "CAAP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 11:59:05",
    "content": " Total revenues excluding IFRIC were up 10.6% against fourth quarter of 2019, supported by a strong growth in commercial revenues and continued recovery in passenger traffic. This, along with our ongoing focus on cost control allowed us to report an adjusted EBITDA of $123 million in the quarter, increasing 27% against the comparable period in the fourth quarter of 2019, while passenger traffic in 2022 stood at 88% of pre-pandemic levels. As shown on the left-chart on slide four, we are encouraged by the continued recovery in travel demand, with passenger traffic in the fourth quarter reaching 88% of fourth quarter of 2019 level, compared with the 82% in the third quarter. Entrance of new airlines and increased flight frequencies contributed to the third consecutive quarter beating pre-pandemic traffic levels, and leading to the recovery with passenger traffic, up 37% above fourth quarter of 2019. Domestic traffic, which accounts for 70% of the total traffic, has almost fully recovered, reaching nearly 98% of pre-COVID levels, while international traffic improved to 82% of fourth quarter of 2019 traffic. In Uruguay, passenger traffic, which is mainly international, also continued to recovery, reaching 83% of fourth quarter of 2019 levels, up from 68% in the prior quarter. Starting with our top line on slide six, total revenue ex-IFRIC continue to deliver strong growth, surpassing pre-pandemic levels by 11% in fourth quarter 2022, and by 2% for the full-year of 2022, reaching $1.2 billion. Aeronautical revenues increased 79% year-on-year, mainly driven by continued recovery in passenger traffic across geographies, reaching over 95% of fourth quarter 2019 levels. Compared to 2019 and excluding the impairment charge recorded in the fourth quarter 2019, total cost on expenses ex-IFRIC for the quarter increased by 8%, which is mainly explained by higher fuel cost in Armenia due to the strong increase in fuel sales in the quarter and to a lesser extent by higher salaries in Argentina as the local inflation rate was significantly above currency depreciation."
}