{
    "symbol": "HTGC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 20:39:01",
    "content": " The momentum that we experienced in our business throughout 2021 continued in Q1, where we originated record Q1 gross new debt and equity commitments of over $615 million and gross fundings of over $351 million. More importantly with early payoffs abating even more than expected, we achieved record net debt investment portfolio growth of over $190 million during the first quarter. Based on the record $2.64 billion of new debt and equity commitments that we delivered in 2021, we expect this trend of increased follow on fundings and the unlocking of milestone based committed tranches to existing portfolio companies to continue to accelerate in 2022 and drive strong gross funding levels for the remainder of the year. As we indicated on our last call in February, while the continued equity market volatility for certain growth stage companies may negatively impact net asset value short-term, as it did in Q4 and in Q1, we expected to be a long-term net benefit to our business in terms of increased investment opportunities and net debt portfolio growth. In Q1, the number of loans on non-accrual decreased to one debt investment with an investment cost and fair value of approximately $13,097,000 respectively or 0.5% and 0.0% as a percentage of the company’s total investment portfolio at cost and value respectively. Turning our attention to the income statement performance and highlights, net investment income was $35.8 million or $0.30 per share in Q1, a decrease compared to the prior quarter, driven by a reduction in early repayments. Although very difficult to predict as communicated by Scott, we expect $100 million to $200 million in prepayment activity in the second quarter, consistent with prior guidance, we expect quarterly prepayment to result in a lower acceleration of fee recognition rate of 2.5% to 3% due to the average vintage of the payments. Your line is open. Your line is open. Your line is open. Your line is open. Whereas last year refinancings were sort of a priority for a lot of these companies and as liquidity built up, they were using that excess liquidity to pay off debt and that’s why we saw nearly – actually over $1 billion of prepayments last year. Your line is open."
}