{
    "symbol": "HTGC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 20:15:29",
    "content": " Our gross fundings continued to be strong during the quarter with over $307 million, which once again led to strong net debt investment portfolio growth of over $105 million during the third quarter and a record $465 million for the first three quarters of 2022. With four corporate investment grade credit ratings, 100 plus full-time employees, over $700 million of liquidity, a very strong balance sheet and the ability to continue to raise new capital if needed, we believe that Hercules is best positioned in the asset class for continued and sustained success. This level of early loan prepayments allowed us to once again deliver strong net debt investment portfolio growth in the quarter, which positions us well for continued strong earnings growth in the last quarter of 2022 and into 2023. In Q3, we generated record total investment income of $84.2 million and net investment income of $50 million or $0.39 per share providing 108% coverage of our recently increased base distribution. As of the end of Q3, we had only one debt investment on non-accrual with an investment cost and fair value of approximately $13.3 million and $0.7 million respectively, or 0.5% and 0.0% as a percentage of the companyâ\u0080\u0099s total investment portfolio at cost and value respectively. Capital raising across our own portfolio remains strong in Q3 with our active portfolio companies, once again, raising nearly $1.5 billion of new capital during the quarter. This combination of events increase net investment income to $50 million, a 25% quarter-over-quarter increase or $0.39 per share in Q3. As previously mentioned, net investment income was $50 million or 25% more quarter-over-quarter or $0.39 per share in Q3, total investment income was $84.2 million as guided in the second quarter earnings call driven by 21% growth in the debt portfolio year-to-date on strong new business, lower prepayments and an increase in benchmark rates. So in comparison to last year, which was a record year, thereâ\u0080\u0099s been a significant slowdown in pullback, but we continue to look at the data that weâ\u0080\u0099re seeing with an optimistic lens because it does reflect very strong investment activity, just not on a year-over-year basis, because youâ\u0080\u0099re comparing it to record levels of investment activity of $344 billion in 2021."
}