{
    "symbol": "OPFI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 17:58:09",
    "content": " We achieved a 57% year-over-year increase in originations to $226 million, while lowering our marketing costs per new funded loan by   or $39 to $206 compared to the prior year period. Turning to expenses, operating expenses for the second quarter, excluding interest expense, as well as add backs and one-time items increased 30% to 49 million or 45% of total revenue from $38 million or 48% of total revenue in the prior year period. Adjusted EBITDA totaled $20 million for the quarter, down from $32 million versus the prior year quarter as higher revenues were more than offset by elevated charge-offs and increased operating expenses. Interest expense for the second quarter totaled $8 million or 7% of total revenue, compared to $6 million or 8% of total revenue in the year ago period. Turning to our full-year outlook, given limited visibility and uncertainty considering the current macroeconomic environment, we are reiterating total revenue guidance of 20% to 25% growth year-over-year, maintaining guidance for operating expenses as a percentage of total revenue of 43% to 47%, excluding interest expense, add backs and one-time items, and the revising adjusted net income expectations downward. And then in July, we made another significant â\u0080\u0093 we actually made some tightening to our refinance population, which is pretty conservative to do considering those customers are definitely the lowest delinquency set of customers and the pay rates are much higher, but we just wanted to be conservative and make sure that this was not going to be something that we had to deal with in the second half of the year, and be conservative and kind of wait and see and be cautiously optimistic, but I think we're making all the right steps, as far as dealing with the spike in delinquency. So, when we evaluate new customers, we feel really good about the weighted average risk score is down 1.5 points or even higher, 1.6 points from last year, which is like a totally â\u0080\u0093 is a huge significant shift and quality of new loans, kind of being added to the book right now."
}