{
    "symbol": "OPFI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 15:52:04",
    "content": " The robust demand environment we experienced in Q4 continued to accelerate through Q1, resulting in a 63% growth in origination volume year-over-year, a first quarter record for originations for us. With a more normalized credit demand environment in the absence of federal stimulus dollars, in addition, our receivables ended the quarter at $338 million, up 38% year-over-year and remaining flat since the beginning of the year. As Todd mentioned, we achieved a 63% year-over-year increase in originations while lowering our marketing cost per new funded loan by 17% or $45 to $221 compared to the prior year period. Total net originations of new loans as a percentage of total loans increased to 53%, up nearly 20 percentage points from the first quarter last year. However, to reiterate what Todd said earlier, the higher quality level of originations from the first quarter are already leading to early delinquency rates that are 20% less than for originations in the second half of last year. Operating expenses for the first quarter, excluding interest expense as well as add backs and onetime items increased 34% to $43 million or 43% of total revenue from $32 million or 38% of total revenue in the year ago period. Adjusted EBITDA totaled $11 million for the quarter, down $21 million versus the prior year quarter, as higher revenues were more than offset by elevated charge-offs and increased operating expenses. Interest expenses, excluding debt amortization for the first quarter totaled $7 million or 7% of total revenue compared to $4 million or 5% of total revenue in the year ago period. Total revenue and ending receivables growth of 20% to 25%, net revenue margin defined as gross revenues less change in fair value between 60% and 65%, adjusted operating expenses, excluding interest expense, add-backs and onetime items, as a percentage of revenue between 43% and 47%, adjusted EBITDA margin between 20% to 25% and adjusted net income margin between 8% and 12%. In addition to that, though, we took the opportunity with increased demand to also just look holistically at our underwriting model and find some higher risk borrowers that we thought that with inflation coming and with the macroeconomic environment, would be -- would not be a good fit for us and have -- that was early in the first quarter, like in January, so first thing in January. We're still on the market-based offer approach, like being very thoughtful about it and keep holding it to a percentage that we feel really comfortable with, learning from kind of last year and that -- it's more definitely driven by kind of the stuff that flowed through in the first quarter."
}