{
    "symbol": "MKTW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 18:55:27",
    "content": " Our high value and ultra-high-value conversion rates this quarter remained right in line with our averages over the past year, indicating that our most valuable subscribers continue to purchase additional content and in fact, our cumulative high-value and ultra-high-value conversion rates rose to all-time highs as we disclosed in our 10-Q filing today. Slashing marketing spend probably isn't the right answer, it probably needs to be a more measured approach to that, that spend, because now is the time going back to Devin's first point around peak volatility like this is ultimately going to create massive amounts of investment opportunities. They just haven't stepped up to higher price points at rates that we're accustomed to seeing and some others are essentially visiting, engaging from the platform, and that's resulted in the churn from the year ago cohorts that Dale was mentioning. We're trying to see based on the editorial conviction around the ideas, what messages will resonate with the readers and that's why I described the behavior that we're seeing amongst the readership like I am, which is there's a little bit of hesitancy amongst the lower-priced subscribers that we've got as they assess what they want to do around the investing strategies and as the editorial teams do too. That's why we've let the spend go a little longer than we ordinarily would because we think the market environment requires it, and we want to test around it to make sure we're optimizing our marketing metrics. If I am trying to parse the effect between sort of what I would call a post-COVID engagement dynamic, right, that's been going on for a whole year as contrasted to now this new first quarter '22 development, which is just all the market volatility, interest rates inflation war and all that. In terms of marketing ROI, our marketing teams are doing what they typically do, which is -- we're testing those themes around different investment strategies and different products, and they're trying to see what's going to resonate with the subscriber base depending on what's going on in the markets."
}