{
    "symbol": "MKTW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 17:47:05",
    "content": " We believe this combination of factors continues to impact our current financial performance as can be seen in our second quarter results, where our revenues declined 9.9% year-over-year to $128 million. Our billings declined 36.5% year-over-year to $117.5 million and our adjusted cash flow from operations was $26.8 million, down from $59.4 million in the second quarter of 2021. During the quarter, Altimetry marketed their product to stage researchers' audience, resulting in $3.4 million in build, its highest billings for an individual optometry campaign in almost two years. Additionally, in light of the sustained high cost of marketing and hesitancy on the part of investors, we have tightened our marketing metrics and are expecting an approximate $37 million reduction to direct marketing expenditures in the second half of the year. Revenue was $128 million this quarter compared to $142.1 million in the year-ago quarter, a decrease of $1.1 million or 9.9%. Punctually, our $117.5 million and second quarter billings declined $18.5 million or 14% from the first quarter's level, driven by a decline in the average card value or average expenditure repurchased in the second quarter. Sales and marketing costs were $65.1 million this quarter compared to $56.9 million in the year-ago for, an increase of $8.1 million. Excluding stock-based compensation costs, our G&A costs declined to $9.6 million from second quarter 2021. And finally, net income in the second quarter 2022 was $34.0 million compared to $8.4 million loss in the year-ago quarter. Adjusted cash flow from operations was $26.8 million in second quarter 2022 compared to $59.4 million in the year-ago quarter, with the decline primarily due to the decrease in billings. Adjusted cash flow from operations this quarter was impacted by net gains in working capital, excluding changes in deferred revenue and changes in deferred tax which increased cash by $13.5 million. We saw our free subscriber base continued to grow from $12 million a year ago to 15 million subscribers this quarter, a 25% increase. ARPU declined to $580 this quarter from $823 last year, driven by a 3% increase in average trailing four quarter paid subscribers, combined with a 27% decrease in average trailing four quarter billings. Once the second phase is completed over the next couple of months, this will take our total month fleet reduction to overhead and expenses to approximately $2.5 million per month in aggregate and this should begin roughly in the fourth quarter. Additionally and led to sustain high cost of marketing, we're targeting an approximate $37 million reduction to direct marketing expenditures in the second half of the year as compared to the first half of 2022. And then we've given you some proxies in our press release and in our conference call script today of how you might expect to see that run rate decline as you go through the third quarter and then through the fourth quarter, the $1.7 million and the $2.5 million you referenced, those are decent proxies but I wouldn't just use the second quarter's run rate."
}