{
    "symbol": "CIO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 12:34:02",
    "content": "  Operator: Good morning, and welcome to the City Office REIT, Inc. Fourth Quarter 2022 Earnings Conference Call. It is now my pleasure to introduce you to Tony Maretic, the company's Chief Financial Officer, Treasurer and Corporate Secretary. Before we begin, I would like to direct you to our website at cioreit.com where you can view our fourth quarter earnings press release and supplemental information package. The earnings release and supplemental package, both include a reconciliation of non-GAAP measures that will be discussed today to their most directly comparable GAAP financial measures. While the company believes that these expectations are reflected in such forward-looking statements, are based upon reasonable assumptions. I will review our financial results, after, Jamie Farrar, our Chief Executive Officer discusses some of the quarter's operational highlights. To start our call, I'll provide a brief summary of our 2022 key accomplishments and then focus on where the company is headed in 2023. In 2022, we achieved the highest annual core FFO per share in the company's history. The main driver of this increase was integrating and stabilizing the 975,000 square feet of acquisitions in Raleigh, Phoenix and Dallas that we completed in December 2021. These three newly constructed highly amenitized properties are performing very well, are 90% occupied and have a weighted average lease term remaining of approximately 10 years. We invested $50 million at an average price of $12.48 per share, which was accretive to both earnings per share and net asset value per share. On the operational side, we completed approximately 800,000 square feet of new and renewal leases throughout the year with 108,000 square feet of that amount occurring in the fourth quarter. During 2022, we signed new leases for 93,000 square feet of spec suites. We also signed new leases for 82,000 square feet of space where we had completed vacancy conditionally. We started to benefit from the investment in this program, but the full extent will be realized over time as suites are leased and free rent burns off. John's contributions to our company, extensive industry knowledge base and his prior leadership of a public company board make him an excellent fit as our Chairman. Mike is highly experienced with 30 years as a private equity investor, investment banker and management consultant. And last, we announced Will Flatt has stepped down from the board after nearly 10 years of service, dating back to our IPO. Now moving to 2023 and beyond, we continue to benefit from the tailwinds associated with our Sunbelt focus portfolio, where population, employment and office occupancy trends are outperforming. Counter balancing this are the challenges our industry has been facing, including rapidly rising interest rates, volatile conditions in the capital markets and headwinds across the office industry. To that end, I'll lay out our focus areas for 2023 and how we expect that these steps will position us. We intend to achieve this primarily by completing select renovations and building ready to lease spec suites, both of which we believe optimize our leasing potential and have long term cash flow benefits. Specifically, we currently have 18,000 square feet of spec suites in our inventory and over 150,000 square feet of spec suites under construction or planned for 2023. We're also advancing significant renovations at our San Tan and Pima Center properties in Phoenix, as we believe these investments will drive leasing. On a related note, our Pima Center buildings in Scottsdale are set to benefit from a new $80 million entertainment development called  which is directly adjacent to our property. This development recently broke ground and is slated to provide a number of walkable restaurants, bars, and entertainment venues that will greatly enhance Pima Center's amenity offering. It's an ideal time for us to launch the Pima Center renovation and we've already experienced the pickup in leasing activity with approximately 17,000 square feet leased so far in 2023. We've identified approximately 900,000 square feet of our portfolio that we are targeting to divest over the next few years. Given our outlook on our portfolio and strategy, we are not at all satisfied with our current stock price, which we believe is a major discount to the inherent value of our company. As one data point, recall in December of 2021, we sold our life science portfolio in San Diego for $576 million, which generated a $429 million gain. We have reinvested those proceeds into $614 million of best-in-class properties in the top submarkets of Raleigh, Phoenix and Dallas. As we look forward, we believe that we carved out an attractive niche of premium Sunbelt properties and that the proactive steps outlined earlier will help unlock value and close the share price gap. Our net operating income in the fourth quarter was $27.6 million, which is $500,000 lower than the amount we reported in the third quarter. While operating expenses have increased as a result of inflation in various categories, the impact on net operating income has been muted as recoveries mostly offset this impact. We reported core FFO of $15.4 million or $0.38 per share, which was $1.1 million lower than in the third quarter. The drivers of that decrease were primarily lower net operating income at our San Tan property due to Toyota's vacate, along with higher interest rates on our floating rate credit facility. Our fourth quarter AFFO was $5 million or $0.12 per share The largest single item to impact AFFO was $700,000 of tenant improvement expenses related to a 13,000 square foot new tenant at our Circle Point property in Denver, whose lease commenced in January 2023. As Janie mentioned, we also continue to invest in building out ready to lease spec suites and implementing vacancy conditioning, which is a key part of our business plan. During the quarter, we recorded a non cash impairment of real estate charge of $13.4 million. The combined 430,000 square feet of these two properties represents approximately half of the anticipated selective pruning of non-core assets that Jamie described. We are considering all of our options at those two properties, both of which advantageously have property level non-recourse debt. For 190 Office Center in particular, our best strategic option maybe to transfer the property to the lender, given our view of the value of the asset relative to its loan balance. That would eliminate approximately $39 million of debt and we anticipate it would also have a positive impact on near term core FFO as interest costs for that property are expected to exceed the property's NOI. Our fourth quarter same store cash NOI change was in line with our expectations at negative 1.2% or $200,000 lower as compared to the fourth quarter of 2021. As far as our liquidity, as of December 31, we had over $95 million of undrawn availability on our credit facility. Subsequent to quarter end, we executed two debt related transactions, which enhance liquidity, reduce our exposure to interest rate fluctuations and give us better visibility into our future earnings. First, we expanded our credit facility by $25 million by entering to a new three year term loan. Second, we fixed the majority of our floating rate credit facility at 5.6% by executing a $140 million interest rate swap. After the swap transactions, over 90% of our total debt is effectively fixed as of today. At the midpoint, that would represent a $0.16 per share decline as compared to our 2022 results. The balance of the decrease is primarily attributable to expected net dispositions during the year, which will result in operating with lower leverage. The three acquisitions, which we closed in December 2021, will be added to the pool beginning in 2023. Tony, just on that last point when you said that AFFO could be impacted by $10 million. I mean, we spent about $1.3 million in Q4 and that was pretty typical, when we're spending weâ\u0080\u0099re ramping up the program. So I guess in aggregate, I mean, you guys between -- on the AFFO line between the tenant improvements, incentives, leasing commissions and recurring CapEx did about $35 million in 2022. But what I can say is that we are spending more on spec suites and vacancy conditioning ramping up that program as we just talked about capital expenditures are going to be really in line with what we've been spending in the last couple of quarters, maybe even a little bit more as we add amenities at the properties. And then what's the -- how are you guys thinking about the sort of ebbs and flows of occupancy throughout the year given the expirations, known move outs, et cetera. If you look at -- we've discussed there's a number of move outs that we have coming in the year, but we also have 167,000 square feet of new leases at December 31, which will be taking occupancy over the year. I mean, a lot of the gain will be coming from the acquisitions that we did in December of 2021, those three properties are being added to the same store pool and that number is a cash basis. Jamie, how is the Board thinking about the common dividend today given the 100% plus AFFO payout ratio but a 60% FFO payout ratio. But the Board is reflecting on challenging operating conditions and we are having a thoughtful dividend discussion each quarter and assessing a number of things, the impact of interest rates, overall conditions on the business. So I think to repeat, we're comfortable with the dividend level today, but we don't have a crystal ball on future operating conditions and we're going to pragmatically look at it each quarter until we're at a point of being fully covered. There's quite a few calls going on right now, but I just want to go back to your CapEx kind of budget and expectations for 2023. Tony, I think you thought you were or Jamie, I should say I think you thought you maybe would spend $5 million to $10 million at San Tan and a couple million dollars at Pima. So if we look at 2023, Pima, as you mentioned, that property is in line with a number that you just threw out there that we're expecting to play in 2023. San Tan is a little larger, but one thing about San Tan is, we have -- what we're doing there is, there's two buildings and one has been completely gutted. So really the biggest impacts that we're looking at to AFFO for 2023 is Pima, as you mentioned. CapEx, we're going to continue to sort of add amenities at some of the other properties in addition to Pima. If you're looking at premium type assets across our markets, the one transaction that did close, which is public is Highwoods in mid-December bought McKinney and all of an Uptown, Dallas and metrics there you can get from their release, but effectively 5.5% cash cap rate and just over  (ph). Tony, you've got the third, fourth quarter debt maturities. Today, you're looking at probably refinancing those, I would say, in the low 6s, if you're looking at a rate, probably 250 basis points whatever the index that you choose. But given both of those assets are pretty buttoned up in terms of occupancy and significant lease term, not anticipating any problems with refinancing those two properties."
}