{
    "symbol": "DCTH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 14:56:05",
    "content": "  Operator: Good morning, and welcome to the Delcath Systems Second Quarter Fiscal 2022 Financial Results Conference Call. With me on the call are Gerard Michel, Chief Executive Officer; Dr. Johnny John, Senior Vice President of Medical Affairs and Clinical Development; Kevin Muir, Vice President of Commercial Operations; John Purpura, Chief Operating Officer, and Anthony Dias, Vice President of Finance. All statements made on this call, with the exception of historical facts, may be considered forward-looking statements within the meaning of Section 27(a) of the Securities Act of 1933 and Section 21(e) of the Securities Exchange Act of 1934. Although the company believes that expectations and assumptions reflected in these forward-looking statements are reasonable, it makes no assurance that such expectations will prove to have been correct. For a discussion of such risks and uncertainties which could cause actual results to differ from those expressed or implied in the forward-looking statements, please see Risk Factors detailed in the companyâ\u0080\u0099s annual report on Form 10-K, those contained in subsequently filed quarterly reports on Form 10-Q, as well as in other reports that the company files from time-to-time with the Securities and Exchange Commission. We do not undertake any obligation to update or supplement any forward-looking statements to reflect subsequent knowledge, events or circumstances. Delcath has had a very productive second quarter of 2022 and year-to-date, for both the HEPZATO KIT, the company's investigational product candidate in the United States; and CHEMOSAT, the company's marketed product in Europe. In the U.S., we continue to move forward towards the resubmission of a new drug application for the HEPZATO KIT late this quarter. As previously reported, in late April, we completed a pre-NDA meeting with FDA, and based on that interaction and subsequent meeting minutes provided by FDA, which incorporated feedback and recommendations, we see no barriers to a resubmission of the NDA with the current data in hand. For purposes of the NDA submission, all queries have been resolved and are considered complete, and the FOCUS Trial database has been locked. While the database is locked for purposes of the submission, I want to remind listeners that certain times and event endpoints such as overall survival will continue to mature through mid-2023. Within 30-days after the resubmission, we expect the FDA will confirm receipt of the submission, and if they agree the submission is sufficiently complete to warrant review, which we fully expect they will, establish a PDUFA date six months from the submission date. While we do not know whether the FDA will convene an Advisory Committee, we are preparing for one and look forward to the opportunity to highlight HEPZATOâ\u0080\u0099s efficacy and safety. The foundation of the NDA resubmission is the FOCUS Trial results, for which Dr. Jonathan Zeiger, Global Lead Investigator, provided an update during ASCO's Annual Meeting in June. Taken together, we believe the data supports a very positive benefit risk profile for patients. In an effort to ensure suitable patients have access to the HEPZATO KIT during the NDA preparation and FDA review, we have started opening expanded access program or EAP sites. The second site has started to screen patients, but may not start treating until October due to clinical trial coordinator staffing issues. Although investigators of clinical trial sites are interested in participating, clinical staffing turnover and shortages that have occurred over the last year at many of the clinical sites make it imperative that we are certain that a well-trained team is in place before we elaborate to go forward. To this end, we have recently hired a dedicated medical device procedural trainer, who will work with potential EAP site treatments. Based on the ongoing usage of CHEMOSAT in Europe, during the second quarter, additional European audit publications supported of CHEMOSAT and  HEPZATO KIT were published. At ASCO, researchers from the Leiden University of Medical Center in the Netherlands presented additional data on the ongoing CHOPIN trial. The goal of this investigator issue is combined Phase 1b -- randomized Phase 2 trial is to study the safety and potential synergistic effects of systemic immunotherapy, ipilimumab plus nivolumab, or IPI+NIVO, when combined with Delcath proprietary liver-targeted treatment in metastatic uveal melanoma patients. And last summer at the 2021 Cardiovascular Interventional Radiological Society of Europe Conference, the investigators reported that there were no dose lending toxicities and that the Phase 2 randomized course of the trial comparing PHP alone to PHP with IPI+NIVO hectormenous. In total, 79 to 88 patients will be treated in Phase 1b and 2 combined, and we understand that to-date 28 patients have been enrolled. While the primary purpose of the first phase to file was safety, efficacy results on seven patients treated with combination PHP with IPI+NIVO were reported this past quarter at ASCO and the results were noteworthy. At a median follow-up time of 20.2 months, four patients have an ongoing response according to RECIST criteria. The presentation reported a median progression-free survival of 22.4 months, and all patients were still alive. If similar results are seen in the current larger randomized Phase 2 portion of the trial and the combination continues to be well tolerated, it could represent a significant improvement of the current standard-of-care, including PHP alone. Combination therapy is a radical approach since while liver failure due to hepatic medicines is the leading direct cost of death for metastatic ocular melanoma patients as many as other types of cancers such as colorectal, extrahepatic mets do occur in treatment with PHP alone can not effectively treating, while systemic immunotherapy has very limited efficacy on liver mets. Logically, combining therapies may lead to better control of both hepatic and extrahepatic disease. First, tumor license induced by PHP treatment could provoke antigen release that may lead to enhanced antigen presentation and increased efficacy of immunotherapy. Secondly, a related but distinct possible synergic effect is based on the unique role of liver placement systemic immune system. An extensive value of published literature support the deliveries in immune-privileged environment and functions as a systemic immune modulating organ, possibly enhancing tolerant to its tumor antigens outside of the liver. In preclinical models, the elimination of hepatic -- of immune cells resident in the liver has been shown to reverse immunosuppressive effect of hepatic metastases. We look forward to further data coming out of Leiden, both in terms of patient outcomes, as well as other analyses which may help elucidate whether CHEMOSAT is actually improving the efficacy of immunotherapy by the elimination or reduction of the immunosuppression effect of hepatic metastases. While the results will be important in terms of treatment of metastatic ocular melanoma patients, it could have relevance across multiple tumor types where hepatic metastases are present and immunotherapy is an accepted treatment. Last week, a retrospective analysis of patients treated with PHP at three European centers was published in the Journal, Cardiovascular Interventional Radiology. The study included 101 patients, who were treated with a total of 212 PHP procedures between 2014 and 2019. After a median follow-up time of 15-months, a complete response was reported in five patients, partial response is 55 and stable disease and third, resulting in an overall response rate of 59.4% and a disease control rate of 89.1%. The study also found statistically significant differences in overall survival between patients who had complete response, partial response or stable disease and progressive disease. For example, patients with complete response or partial response, the median overall survival was 27-months. The patients with stable disease, the median overall survival was 21-months, and for patients with progressieve disease, the median overall survival was six months. As overall response rate is the primary endpoint of the FOCUS trial, from a regulatory perspective, any supportive data is shown in a correlation between overall response rate and survival is helpful. As we have previously reported, we did see the same correlation of the FOCUS trial, and we intend to share the details of that specific analysis at an upcoming medical conference. The second quarter was the first full quarter since we resumed direct responsibility on March 1 for sales, marketing and distribution activities. Q2 unit volumes were down approximately 10% from Q2 of 2021, but essentially flat if one takes into account that as almost all patients being treated with CHEMOSAT in the Netherlands are being enrolled and treated the CHOPIN trial. In terms of unit performances over Q1 2022, growth was over 75%, but the first quarter and second quarter unit volumes may have been impacted due to the business transition from Medac back to Delcath on March 1. While we expect meaningful growth going forward, I would not expect that level of quarter-on-quarter growth on a regular basis. Clearly, the current business is primarily being driven by investigator word of mouth, and we are confident we can drive uptake as we build our commercial infrastructure. Our primary focus in Europe at the moment is hiring an account representative in Germany to increase referrals, utilizing our medical affairs personnel to foster increased support in larger markets such as Italy and France, where we do not yet have much active commercial business, and developing the submission packages for national coverage in major markets. We anticipate submitting for national coverage in the United Kingdom, Austria and the Netherlands by the end of this year. In 2023, we'll submit for national coverage in France, Italy, the Scandinavian markets and other select smaller markets in the EU. We already have reimbursement Germany under the  (ph) scheme, but we need to work to increase awareness and subsequent referrals to the treating centers. While it will likely take several years to obtain national coverage in the majority of major markets, we are confident that Europe will become a meaningful revenue contributor to the business with EU revenues likely growing along with U.S. commercial launch of HEPZATO, if approved next year. I want to note that given the difficult capital market situation, we have decided to manage the European business on a cash flow neutral basis to maintain adequate capital for the U.S. submission and launch. At the moment, the European business is self-sustaining and we continue to be so as revenues grow and are reinvested in the European business. While we continue to plan on expanding the PHP platform to other indications, like many companies in this difficult capital markets environment, we need to prioritize the shorter-term, higher-return activities, which is clearly submission of the NDA and preparations for a potential U.S. launch. We continue to hold advisory boards to obtain feedback on and review the post clinical trial protocols, including intrahepatic cholangiocarcinoma and colorectal as well as discuss IPs in various areas, including other combination immunotherapy trials. Although we believe, based on feedback and protocol proposals, that there is real interest from the investigators to expand the usage of HEPZATO and CHEMOSAT, the timing of the trials may be delayed to ensure the activities most critical to the success of the business are adequately funded. Hence, our decision last month to raise $5 million to what was effectively a straight common deal priced at market which is a larger raise, which may have involved much less favorable terms. But first, we'll turn the call over to Tony to review the financials. Product revenues for the three months ended June 30th, 2022, was approximately $797,000, compared to $398,000 for the prior year quarter from the sales of CHEMOSAT in Europe. Since the second quarter of 2022 was the first full quarter of direct sales, it is not comparable to the second quarter of 2021, in which we generated product revenues with a European -- on a revenue share arrangement. Research and development expenses for the quarter increased to $5.5 million, compared to $3.5 million in the prior year quarter, primarily due to higher professional service costs, relating to the preparation for our NDA submission by the end of the third quarter of 2022. Selling, general and administrative expenses for the quarter was approximately $4.1 million compared to $3.3 million in the prior year quarter. Interest expense increased to $665,000 from $40,000 a year ago, due to the interest expense and amortization related to the debt finance that we entered into on August 6th, 2021 with Avenue. On June 30th, 2022, the company had cash, cash equivalents and restricted cash totaling $14.4 million, as compared to cash, cash equivalents and restricted cash totaling $27 million on December 31st, 2021. During the six months ended June 30th, 2022 and 2021, we used $12.4 million and $11.7 million, respectively, of cash in our operating activities. On July 20th, 2022, we've closed a private placement of $5 million issuance and sale of 690,954 shares of common stock at 566,751 fee fund warrants to purchase common stock to certain investors. Each share of common stock was sold at a price of $3.98, and the prefunded warrants have sold at a price of $3.97 per funded warrant. In terms of gross margin, yes, we just look at that as kind of couple percentage going forward. So that -- it really is, in many ways, a simple story for them to go through. We all know that pushed back with  (ph) So I really can't comment on whether this division is more likely than not, et cetera, to do that. But again, it's a single trial they have to review, which really helps us dramatically in terms of workload they have to go through. And there are certain ways to do that just to make that lease together well in terms of story, et cetera. So I would say it's a very good chance -- as reviews go, it's just a very light one for them. But I can't -- on their behalf, I can't say I guarantee they'd get through it in six months. Yes, I think one way to -- I mean, I can give you the inputs to a model. The headwinds to that are: one, frankly, this expanded access protocol cost about as much as the Phase 3 does in terms of individual sites and cost base and costs. So again, the capital market situation we kind of pull that back a bit, I'd like to strive to get to 5%. And we have always been -- but it's really brought a finer point to it, we want to be very careful to make these sites, make sure everyone on the team is well trained. We're not just saying, hey, you were part of the trial. Again, we're going to target five. The -- in terms of how to use it for commercial kind of mindset, I mean, I think one way to think of it and, let's say, a site could do on average one to two patients a week, let's say, they got an one IR suite a week or so. And if you thought of six to 10 patients at a site by week -- or by month, excuse me, based on that. And then you've got through pricing -- if you wanted to price it comparable to IPI+NIVO to , you're looking at a price of at least $75,000. And again, that's really dependent on the EAP sites we have up and running when we get launch. So hopefully, that framework will allow you to kind of put together a spreadsheet, but I'll let you come up with your own assumptions in terms of number of patients a month, how many EAPs, pricing. I don't want to be nailed out precisely on those things, aside to say we try to target to get five, and we'll see if we can do that. As you go through this, you're occasionally just additional analyses that you want to run. In terms of documents, there's a variety of documents that go into the different modules, and they're all being worked on concurrently as we go week-by-week, and this includes a clinical summary report, the summary of clinical efficacy, some ray of clinical safety. We have a PK manual and a PK analysis, POP PK analysis that we're also conducting. And I want to hear how you'll be using that sort of commercially in the U.S. with your direct sales team, as well as whether it will be part of any of your submissions to support reimbursement in those various countries you discussed? So it's certainly -- if published, we'll be able to use it in detail as such, which is helpful as long as it's consistent with the label, which it will be. So yes, we'll leverage any literature we can, but consistent with the label that's published. And if not consistent with the label and the doctors are interested, of course, the medical affairs teams can talk about it as well. Any data we have will be -- it's just supportive, but we'll also put it in front of the FDA. And then lastly, in terms of national coverage submissions, again, all of that data that's published is very helpful and supportive. It was one of those came out of, I think, it was a journal I didn't mention on this call. But then we have another one, I think, it's based predominantly on patients at a live that we're going to use to support the U.K. submission, natural coverage submission, as well as a variety of others. So all the literature is helpful for national coverage, and then we have some specialized quality of life retrospective analyses or prospects that we will conclude in the national coverage submissions. But given this is such a focus of prescribing population, it doesn't have much of an impact. Currently, we are working on our branding from a marketing aspect, as well as our market access. We are putting together a patient access assistance program, and those will be kicked off in Q4, at the end of Q4 and should be in place by the time for any -- for approval, and in the April time frame. So they should be ready for approval, considering the six month time frame we've been talking about. They may end up using miscellaneous codes, which was helpful with the codes that are most similar to what we're doing now to reimburse well for the procedure. So we're going through those necessary mapping processes, as well so that we have a full kind of reimbursed to get -- to assist the hospitals with when we launch. And I know you said you're in the final writing stages of the NDA, but just to be a little more specific. I think the POP PK model is not in hand based away from being here, so that's good. I should be on top of that, but that's one where I don't know exactly to pass that. But there's no data gaps or anything like that, that we need. Really what it is now is just taking this all and getting all the writings done, which we are relying through tremendous degree on outside medical providers. I can't hazard a guess on how many are involved, but it's probably over -- well over a dozen people writing in the various modules assisting us. But in terms of data becoming gating, that's not going to occur. What we found out in -- well, first of all, I think a lot of the treating centers haven't seen anyone, any representative for a very, very long time for the product. The second thing is where we have run surveys, for example, we ran one in Germany, the docs who are aware of the treatments and using it we're very, very favorable. The issue really is, it's not broad enough knowledge to different referring centers about the effectiveness of the treatment, the process to do referrals, et cetera, and that's what we really need to increase in Germany. In the U.K., there are opportunities to get regional funding while we're waiting for NICE. So we've heard nothing that gives us pause to say, there really is negativity about this product. It really has either been crickets or alternatively just not a lot of support since I got it, got the product. So we are really confident we can drive uptake and that there's only a limit of how much you can do with it when the patients are primarily paying out a pocket in much of Europe when they use it, but lacks this regional funding in the short-term and then try to get national coverage in the long-term drive uptake. So inventory preparations, as you know, we have -- this is a sterile product. We see no issues with pulling together inventory for initial launch, both on the drug and component side. So given the supply chain isuse that we've sort of been working through during the conduct of the FOCUS Trial, we have certainly monitored all of the supply chain issues that could become a rate-limiting factor and have built that into our inventory builds and calculation. So as of this moment, we don't see that to be any rate limiting issues on any components. So yes, we have -- we're not getting a clear indication if we will be in front of an Advisory Committee, but we have started the preparations for that. And in turn, we will, as Gerard said, be interacting with a third-party vendor that is a specialist in preparing sponsors for this type of event. Internally, we will put together different slide decks thinking about our data and efficacy and specifically about addressing any concerns that we think may come up during the FDA review and then highlight the safety and efficacy, of course, that we saw in our analysis, and that will be part of the submission. This is going to occur over several months, starting as soon as possible and going into the early part of next year. I don't -- I mean, John, before timing, if I may correct you, but I don't think they're really going to give us much of a hint until the end of the year at the earliest, January more likely. But once FDA starts the substantive review, we could potentially be in receipt of any information request that they so desire from that point forward. I generally you don't know until they give you a notification, I believe. But again, they have to cut through certain amounts of data and a certain amount of time has to pass while it's not actually defined. So the next readout they have scheduled is approximately after 40 patients, as we have mentioned during our remarks that we're currently at around 28 -- that 28 patients has been treated. With the 40th patient just treated, we need about 12 additional patients that have to be treated. I know you said that in earnest, the program may not have patients enrolled until October. So if that's the case and then when you are about to commercialize HEPZATO in the U.S., will there be enough data from the program so that you can use it -- use the data for commercialization process? Yes, I think, I mean, at that moment from that particular study, it probably wouldn't be much, but it's -- any amount is helpful that eventually gets published. But I think if you look at the steady stream of data that's coming out of Europe, the CHEMOSAT which is effectively the same product, I think that will be very supportive in terms of the U.S. as well. This is really an exciting time for the company after a very long journey for around the clock submitting and resubmitting the NDA, confirming a PDUFA dates 30-days after that, participating in a possible and possibly Drug Advisory Committee, and if the NDA is approved, commencing a U.S. launch. And in parallel, we're building a commercial team in Europe while submitting for natural coverage in major markets. Importantly, more clinical data will likely be generated by the Japan trial, the relevance of which could extend well beyond the metastatic ocular melanoma. Thank you for attending today's presentation, and you may now disconnect."
}