{
    "symbol": "DCTH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 15:13:09",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to the Delcath’s First Quarter 2022 Earnings Call. With me on the call are Gerard Michel, Chief Executive Officer; Dr. Johnny John, Senior Vice President of Medical Affairs and Clinical Development; Kevin Muir, Vice President of Commercial Operations; John Purpura, Chief Operating Officer, and Anthony Dias, Vice President of Finance. All statements made on this call, with the exception of historical facts, may be considered forward-looking statements within the meaning of Section 27(a) of the Securities Act of 1933 and Section 21(e) of the Securities Exchange Act of 1934. Although the company believes that expectations and assumptions reflected in these forward-looking statements are reasonable, it makes no assurance that such expectations will prove to have been correct. For a discussion of such risks and uncertainties which could cause actual results to differ from those expressed or implied in the forward-looking statements, please see Risk Factors detailed in the company’s annual report on Form 10-K, those contained in subsequently filed quarterly reports on Form 10-Q, as well as in other reports that the company files from time to time with the Securities and Exchange Commission. Delcath has had a very productive first quarter of 2022 and year-to-date for both HEPZATO, the company's product development candidate in the United States and CHEMOSAT the company's marketed product in Europe. In the US,  forward towards the re-submission of a new drug application for HEPZATO, we have completed the pre-NDA meeting with FDA and based on that interaction we see no barriers to a resubmission of HEPZATO’s NDA, which we now plan to file in the third quarter. In addition, an update on the Phase III FOCUS trial results were accepted for a poster presentation at the American Society of Clinical Oncology or ASCO’s Annual Meeting in June. Regarding CHEMOSAT, single center safety and efficacy data from the University Hospital Southampton in England was published in the Journal of melanoma research and data from patients treated at the Hanover Medical School were presented at the European Conference on Interventional Oncology or ECIO. In addition, we achieved medical device regulation certification under our CE mark and most notably we resumed direct responsibility for sales, marketing and distribution activities of CHEMOSAT in all of Europe. While we wait for the final official meeting minutes from FDA, we do not believe that any additional preclinical or clinical studies will be required in order to file the NDA, whether the FDA will convene an advisory committee is an open question. As a company, we are planning for one and would look forward to the opportunity to highlight HEPZATO’s efficacy and safety. While we commercially manufacture product for the European market, we have undergone a third party FDA mock audit and a review of the company's manufacturing processes. Over the course of the year at various conferences, we will look to share additional data analysis from the FOCUS trial that we believe further supports clinical efficacy and safety. The poster to be presented on June 6 by Dr. Jonathan Zager, global investigator of the FOCUS study will provide an updated results from the FOCUS III trial, updated efficacy parameters will include the time based endpoints of overall survival and duration of response, which continue to mature. Turning to commercialization of HEPZATO, ocular melanoma is a niche high value market for us with attractive attributes, including a focused set of treating physicians and a significant unmet need. At the moment two sites will be in a position to start accepting patients by the end of this month, with another three have been agreed to participate. We are actively developing key documentation to support reimbursement, such as a value dossier, as well as advisory boards with treating physicians to better understand the patient journey. We have initiated recruiting for key physicians required for commercialization, such as training and have engaged a hub service to assist sites with reimbursement for standard of care expenses associated with the EAP. In February, we were pleased to see results from University Hospital Southampton's retrospective study published in the Journal of Melanoma Research. Recall, that at the 2021 Cardiovascular and Interventional Radiological Society of Europe, or CIRSE conference, they presented an abstract which included data from seven patients treated during the first phase of the trial, which is investigating the combination of CHEMOSAT with ipilimumab and nivolumab in patients with metastatic ocular melanoma. The trial has completed a dose escalation phase and the observed responses in the seven patients were complete response in one patient and partial response in four patients, for an overall response rate of 71.4%. Given the 10 months since the last report we eagerly await updated efficacy data, both response rates and duration of response from this first trial investigating combination immunotherapy with CHEMOSAT. Achieving MDR certification tells that detailed evaluation for designated EU notified body, including an audit of quality systems and a review of documentation supporting safety and performance claims for the device. MDR greatly expands upon existing MDD requirements, including the level of clinical evidence supporting claims, post-marketing surveillance, database traceability, unique device identification and increased supply chain oversold. Delcath is using direct responsibility for sales, marketing and distribution activities of CHEMOSAT in all of Europe on March 1. We currently have four customer facing employees in sales, marketing and medical affairs, working with health care providers in the UK, Germany and Netherlands. And anticipate hiring several more this year to further support healthcare providers and patients in those markets, as well as expand use throughout Europe. Given the multi-year process to obtain national coverage approval and then to be incorporated in the NHS budget, we have also initiated efforts to obtain regional reimbursement in the UK in the interim. While it will likely take several years to obtain national coverage in most major markets, we are confident that Europe will become a meaningful revenue contributor to the business with EU revenues likely growing with our US commercial launch next year. Given our first priority remains submitting the NDA and launching in the US, Delcath is primarily focused on those regulatory and commercial goals. He brings over 20 years of industry experience, and has considerable expertise in pharmaceutical law and regulation, business development, commercial business transaction and compliance. He also brings over 20 years of industry experience and will oversee all financial aspects of the company, including financial planning, reporting, accounting and control. In summary, during and since the first quarter we've taken significant steps towards commercial revenues in the US and increased our activities in Europe. I look forward to taking questions, but first I'll turn the call over to Tony to review the financials. Product revenues for the three months ended March 31, 2022 was approximately $207,000 compared to $261,000 from the prior year quarter from sales of CHEMOSAT in Europe as we resumed direct sales during March 2022. Other income for the quarter was $171,000 compared to $127,000 in the prior year quarter. Research and development expenses for the quarter increased to $4.2 million compared to $3.7 million in the prior year quarter, primarily due to higher professional service costs related to our pre-NDA meeting with the FDA and preparation for our NDA submission in the third quarter of 2022. Selling, general and administrative expenses for the quarter were approximately $3.6 million compared to $3.3 million in the prior year quarter. On March 31, 2022, the company had cash, cash equivalents and restricted cash totaling $20.5 million as compared to cash, cash equivalents and restricted cash totaling $27 million on December 31, 2021. During the three months ended March 31, 2022 and March 31, 2021, we used $6.4 million and $4.6 million, respectively, our cash in operating activities. I wanted to start here with what you learned from the pre-NDA meeting, with the FDA, as well as any more detail you can give us on that one, that vendor who had those unforeseen delays. So as you well know, pre-NDA meeting usually there is not a lot of upside and there is potential for some downside out of those. In this particular case there was some modest upside in that -- in discussions with the FDA, they did tell us that they would prefer us to use, actually. And as you may recall, the efficacy parameters were a bit higher in the treated as would be expected. In terms of any downside, there really wasn't that, we got some clarification from the FDA in terms of how they wanted to look at some of the data. As an example, was there a question as to whether or not they want us to prove our safety data for purposes of an integrated summary of safety, and they agreed that the data and the devices were distinct enough from the prior pivotal trial that we no need to do that. So that was excellent, they told us that they kind of at the same mindset as we did in that, this is a step change in terms of the safety of the product and it made no sense to pull the two. But overall, I mean it was a very positive meeting, there are always some certifications on how they want to see some of the data, but nothing dramatic one way or another. We don't expect there'll be anything in there that would surprise us, but we still have to get those in hand. We have a kind of the unique product, in that a lot of our components that we utilize are off the shelf components that we package together, not all of which do we have quality supply agreements with the vendors, because frankly we're such a small player for them to do that, it's not worth their time. And that means we have to redo a number of, I'll call, it quality tests, whether it's stability, distractible the whole host of things such as that trying to revalidate these off the shelf components. We had most of these things done, we had one vendor that slips considerably by a matter of quarters as a matter of fact, in terms of getting this data, there was another slippage recently. I'll just say that really what has happened is that, the -- really what has happened is, we've kind of come down hard in the vendor, to be honest. We've seen the draft data, but it's going through QC. But once we have that data, it does take several months to kind of do the analysis of the data, right it up and get it into the NDA. And then, I guess I'll ask on the EAP expecting to have sites accepting patients by end of month, three more coming online pretty soon. Yeah, the thing we're facing with the EAP that I think a lot of other probably companies are facing is really frankly, the nursing shortage is impacting the ability to supply clinical coordinators in the hospital for clinical trials. EAPs are not always the easiest thing to entice people to hospitals or investigators to join, they are considered not the sexiest thing we put it that way in terms of trials. I am thrilled that pretty sure we have -- we have two that either have been trained or one of those pieces training to be done, so they can start enrolling patients, three others have committed, there are quite a few, more than five others have talked to us and they're kind of circling the basket, we just need to see we can get five more over the finish line. I think we can get there, but it really has mostly to do with the sites having adequate resources to put on trials right now. So, maturity in terms of duration of response and overall survival, that will continue to recur over the next year. In our protocol, we said we would follow those patients for two years post the last treatment and that last treatment was May at last year, but OS is not the primary exploratory endpoint of the trial. Yeah, in terms of R&D, I think we'll have another quarter probably at the high level as we continue to pay the typical army of consultants that gets involved when you're pulling an NDA together. In terms of how do we adjust the dial given the current market situation, there isn't a lot left to do interim -- there is a lot of spending at the moment on those new indications. It's primarily advisory boards and we have already slowed that down, we started doing that probably three months ago and sort of really pushing hard. But what we're trying to do is the low cost names in the interim, which is advisory boards to get interest with investigators, make sure we have the protocol fine-tuned. In terms of restricted cash, there is a target amount of money to raise that would release it. Quite a few of my questions have been asked, but just thinking of CHEMOSAT and Europe. So right now we are reintroducing ourselves to a lot of the clinicians, some of which we kept tabs on because we were doing clinical development in Europe. But right now, it's really is, for example, in Germany, trying to better understand the lay of the land, but the near-term priorities in those markets -- the markets we currently exist in is the following, in the UK we try to increase referral patterns to the existing sites. I think we have enough sites in the country, so we're trying to increase referral patterns, whether or not it's from Ireland, which has an agreement with the NHS or whether it's within the UK itself. Our goal is to get that in this year, but it's a good year and a half process between EU and then getting budgeted in the NHS budget. So we've hired a consultant to help try to get regional funding in parallel, again we couldn't do this before we have the rights back. In Germany, we will likely want to open another site somewhere in Germany, but also importantly it is again once again trying to get referrals of two hospitals and working more closely with the hospitals from a budgetary perspective, because those hospitals do have the ability to get reimbursed via something called  scheme, but they have to do it every year, they have to request the funds. Now that we have rights back, it will be a lot easier to work directly with those hospitals and make sure we assist them in terms of making those requests giving them the data they need. And again, as I mentioned before, another important factor there will be trying to increase the referrals through the treating centers, which is really key to generating revenue. In the Netherlands, we're going to work towards doing a submission in terms of -- a submission in terms of our reimbursement there as well, national reimbursement. We're going to try to get started in Austria and Switzerland, primarily it's a lot easier to get started when we have German speaking or hires of German speaking personnel in Germany, it's easier to cover Austria and Switzerland with those personnel. And then longer term, we're going to look towards expanding to Italy and other markets in Europe. So that's kind of the near-term 18 month plan I just outlined in terms of Germany, the UK, the Netherlands expanding totally into the DACH region and trying to get those humming and then looking towards other regions in Europe."
}