{
    "symbol": "DCTH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:33:04",
    "content": "  Operator: Good day, and welcome to the Delcath Systems Third Quarter 2022 Financial Results Conference Call. After todayâ\u0080\u0099s presentation, there will be an opportunity to ask questions. I would now like to turn the conference over to David Hoffman, Delcathâ\u0080\u0099s General Counsel. With me on the call are Gerard Michel, Chief Executive Officer; Dr. Johnny John, Senior Vice President of Medical Affairs and Clinical Development; Kevin Muir, Vice President of Commercial Operations; and Anthony Dias, Vice President of Finance. All statements made on this call, with the exception of historical facts, may be considered forward-looking statements within the meaning of Section 27(a) of the Securities Act of 1933 and Section 21(e) of the Securities Exchange Act of 1934. Although the company believes that expectations and assumptions reflected in these forward-looking statements are reasonable, it makes no assurance that such expectations will prove to have been correct. For a discussion of such risks and uncertainties which could cause actual results to differ from those expressed or implied in the forward-looking statements, please see Risk Factors detailed in the companyâ\u0080\u0099s annual report on Form 10-K, those contained in subsequently filed quarterly reports on Form 10-Q, as well as in other reports that the company files from time-to-time with the Securities and Exchange Commission. We do not undertake any obligation to update or supplement any forward-looking statements to reflect subsequent knowledge, events or circumstances. Now, I would like to turn the call over to Gerard Michel. Delcath has had a productive third quarter of 2022 for both HEPZATO KIT, the company's product development candidate in the United States; and CHEMOSAT, the company's marketed product in Europe. In the U.S., we have two centers enrolled and currently treating patients under the Expanded Access Program, or EAP, with a third center enrolled and pending training. In addition, four other sites are in various stages of the startup process and these include sites that were not involved in the FOCUS trial. We expect that within 30 days after the submission, the FDA will confirm receipt of the submission and, if they agree the resubmission is sufficiently complete to warrant review, establish a PDUFA date six months from the submission date. As we previously reported, in the third quarter, a retrospective analysis of patients treated with CHEMOSAT at three European centers, one in the Netherlands and two in Germany between February 2014 to December 2019, was published. This continues to add a path to the growing body of published research, documenting the efficacy and safety of our CHEMOSAT system in the European commercial center. Recall the goal of this combined Phase 1b/randomized Phase 2 trial is to study the safety and potential synergistic effects of systemic immunotherapy ipilimumab and nivolumab, or IPI+NIVO, when combined with Delcathâ\u0080\u0099s proprietary liver-targeted treatment in metastatic uveal melanoma patients. We look forward to the completion of enrollment into this trial possibly as early as late next year given the pace of recruitment, and to provide updates on the progress of the seven patients who completed the Phase 1b portion of the trial. At ASCO earlier this year, investigators reported an OR of 85.7% and a DCR of 100%. If similar results are seen in the current larger randomized Phase 2 portion of the trial and the combination continues to be well tolerated, it could represent a significant improvement over current standard of care, including PHP alone. While the results will be important in terms of the treatment of metastatic uveal melanoma patients, they could have relevance across multiple tumor types where hepatic metastases are present and immunotherapy is an accepted treatment. Turning to the commercial progress of CHEMOSAT in Europe, the third quarter was the second full quarter after we resumed direct responsibility for sales, marketing and distribution activities, which occurred on March 1, 2022. Excluding the Netherlands where most patients are now being treated in the CHOPIN trial, our units increased 41% over the same quarter last year and increased 26% versus the second quarter. These submissions are reliant on the publication of the FOCUS trial results, which will now occur early next year. In late October, we agreed with medac, the previous distributor of CHEMOSAT in UK and EU, on terms to settle the party's ongoing dispute over the termination of a distribution agreement. And with this dispute behind us and the planned upcoming publication of FOCUS trial results, we are confident that Europe will become a meaningful revenue contributor to the business with EU revenues likely growing along with U.S. commercial launch of HEPZATO if approved next year. Also in October, we successfully completed a Notified Body audit to recertify our Queensbury, New York manufacturing facility for CHEMOSAT under the European Medical Device Regulation, or MDR. While recertification even under the new MDR regulation has become routine for the company, it is important to keep in mind that our team in Queensbury has been undergoing audits for years, and I'm confident that we are well prepared for a preapproval inspection from the FDA. During the third quarter, we held an advisory board in the United States with interventional radiologists and  to gain further insight into the way treating facilities were utilized with HEPZATO, if approved within their continuum of care. We have solidified our market access plans and are confident that for Medicare patients, HEPZATO will primarily be reimbursed using pass-through status, initially with a miscellaneous ZE code before being assigned our unique ZE code. We are carefully watching Immunocoreâ\u0080\u0099s progress and noticed that in their first full quarter, they obtained a unique ZE code and booked $20 million in revenue from U.S. KIMMTRAK sales, despite being restricted to less than 50% of the patient population given their mechanism of action. Based on publicly available information, in the U.S., KIMMTRAK is priced at a level which equates to approximately $925,000 per patient based on the average duration of therapy reported for their pivotal trial. An equivalent price for the HEPZATO KIT would be somewhere between $150,000 to $225,000 per kit, depending upon whether the price is based on a nine-month duration of therapy or six kits, or four HEPZATO treatments over six months, the mean number of treatments from the FOCUS trial. While it is premature to finalize the price, this dynamic is important for investors to understand as we approach commercialization next year. We believe that the ultra-orphan pricing dynamic combined with a very focused set of treating centers we will support and the growing number of EAP sites will translate into rapid revenue growth, a short runway to becoming cash flow positive and very strong operating margins. Obviously, there is much to get done between now and launch, the commercial potential for this first indication, and the value it represents is clear. But first, we'll turn the call over to Tony to review the financials. Product revenues for the three months ended September 30, 2022 was approximately $906,000 compared to $395,000 for the prior quarter from the sales of CHEMOSAT in Europe. Revenues increased 129% over the same period last year, primarily because we're now booking all European revenue after the termination of the medac distribution agreement versus a royalty and a revenue share. Research and development expenses for the quarter increased to $4 million compared to $3 million in the prior quarter, primarily due to higher professional service costs relating to the preparation for our NDA submission by the end of this year. Selling, general and administrative expenses for the quarter were approximately 4.5 million compared to 4 million in the prior year quarter. The increase was primarily due to recording an estimated 1.2 million for the settlement of the medac litigation, offset by lower share-based compensation expense of $800,000. Other expenses increased $730,000 from $420,000 due to a full quarter of interest expense and amortization related to our debt financing during the third quarter of 2022. The company recorded a net loss for the three months ended September 30, 2022 of 8.5 million, $0.92 per share basic and diluted compared to a net loss of 7.1 million, $0.94 per share basic and diluted for the same period in 2021. On September 30, 2022, the company had cash, cash equivalents and restricted cash totaling 14 million as compared to cash, cash equivalents and restricted cash totaling 27 million on December 31, 2021. During the three months ended September 30, 2022 and September 30, 2021, we used 5.2 million and 4.9 million, respectively, of cash in our operating activities. On July 20, 2022, we closed a private placement for $5 million issuance and sale of 690,954 shares of common stock and 566,751 pre-funded warrants to purchase common stock to certain investors. We have about 98% of the data from our key CRO, a little bit more to get out of them. But I'm confident we're very close to getting it filed, and I don't see any major issues in getting it done at this point. There is actually a treatment occurring today at the Moffitt Cancer Center, so that would be the eighth. In terms of your question on learnings, we're using the learnings from our European experience and the FOCUS trial in the training and the conduct of PHP. Kevin, it might be worth you noting what you've noticed some really interesting referral patterns going into market I think. So it's an interesting dynamic that we've seen here of kind of sequencing these treatments in combination to extend, better preserve the liver function in anticipation of treating with KIMMTRAK or tebentafusp. Sam, whatâ\u0080\u0099s interesting with this concept, although obvious, it's not something that we've driven at this point, because obviously we're not approved. But this seems to be -- it's one specific doctor, but he was a very active -- I believe active in the trial and he is now steering his  too at this point, if I have it correct. But he's steering his HLA -- the patients with the appropriate HLA phenotype to Moffitt to get treated first, and then move on to KIMMTRAK. In terms of risk of it being a six-month review, we're trying to make sure the package is as complete as possible. And quite frankly, we've been focused on making it very easy to navigate. The drug has a long history behind it admittedly, but it's not a very large filing being a single trial that we're submitting. In terms of any meetings scheduled with them, none at this particular time. And in terms of advisory, I think it's probably as likely as not, but we will, of course, be prepping for it as if we have 100% certainty that it will happen. And then with regards to the European revenue trends, itâ\u0080\u0099s certainly good sequential growth from 2Q to 3Q. In the UK, we have a rep. We hired one little bit before getting the product back, actually converted an MSL to a rep. And in Germany actually, it's all referrals on their own. As I mentioned a second ago, it's all kind of on autopilot. Weâ\u0080\u0099ll probably focus on France at some point as the next market, given that the burden of disease when the CHOPIN trial winds down, we'll get that back online. When that gets published, I think that will help a tremendous amount. But as is always the case, it's a matter of getting reimbursement in each individual market. That will take a number of years, so steady growth but we need to get those reimbursement submissions in. And final question just with regards to the EAP sites, eight procedures seems like a pretty good number. I guess, one, does it go -- I imagine it goes up, volume goes up significantly once the product is approved. Yes, that's a great question and we've been obviously focused on that ourselves. And I think it will vary, not surprisingly, dramatically by sites. In terms of getting the sites to that level prior to launch, the EAP, we have to make an effort with our MSL. We have one right now to drive patients, inform clinicians about the sites and referral patterns in a compliant manner, of course. That probably would be a reach, given our current resources. I think I've said this before, just trying to harbinger our resources at the moment. But I think post launch, I think one a week is feasible. But we're hopeful that we'll have seven sites up and running at launch and probably well under one a week at that point, but moving towards that. I remember that there's a -- for the FOCUS study in terms of the final survival data, that potentially could be available I believe by May of next year. And in regular filings if there's an abstract or something that we publish with a further update that will go into the FDA, so they would be informed. But I would expect four to six weeks prior to the PDUFA date, then scheduling a preapproval inspection. That's very helpful and congrats on all the progress, and look forward you guys filing the things before end of the year. So after a recent FDA advisory committee for another oncology product in a small orphan population, there's a little bit more of a renewed focus on what the FDA is expecting to prove efficacy in a single arm trial in a small population. I think the first thing, it is a single arm trial and what the FDA stated to us when we were discussing with them turning this into a single arm trial is they wanted to see a clinically meaningful objective response, right, that had a clinically meaningful duration of response. Picking up that second one, duration response, because that's the simplest, they asked us to do a follow up for at least six months to demonstrate that the duration of the response was meaningful. In terms of objective response rate, that's a little harder to point to something specific, the FDA has said to us. So obviously, we're well over that hurdle. Our OS is fairly similar to what the  showed, and we had sicker patients in terms of we had first, second, third line patients. We have writing parameters that we can compare to and will, based on their published data that demonstrates that our patients were further along in the disease process, yet we came in within spitting distance of their overall OS. And then if we look at one year OS, they were I believe 77% -- we were at 77%, excuse me, survival for a year. We look at our older survival data, pre-KIMMTRAK, HEPZATO publication, weâ\u0080\u0099re well, well over. So I think with our overall OS, we said 19.25 last time we gave an update, but that was versus the BAC that  now we have 14.5 months. We have the meta-analysis in terms of ORR, objective response rate, and our response rates are head to shoulders above anything else out there. Most response rates are single digit, and then the duration 14 months. So taken in totality, I think we're in great shape. I think the last thing I would mention is although we haven't published this, I have stated qualitatively our response rates or category of response rates, whether or not you are complete responder, a partial response or progressive disease, that all correlates with survival quite cleanly. So therefore, we can show that the response rate, the ORR is meaningful in terms of relapse, which isn't always the case for all classes of therapy. And ladies and gentlemen, this concludes our question-and-answer session and today's conference call."
}