{
    "symbol": "PGRU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-21 09:47:02",
    "content": " Thirdly, we will be making forward-looking statements within the meaning of U.S. securities laws, including, but not limited to, statements regarding our future financial results and management's expectations for the business. This new economic reality is challenging, but we believe in the underlying long term market fundamentals of Southeast Asia. As we often discuss, expanding middle classes, increasing digitalization and continued urbanization will help to grow and sustain our property markets over the next decade and beyond. As our customers reassess their investments, we are ensuring that our products and services not only deliver the most value today, but that our future innovation delivers that value in future time periods. This quarter, we launched new products and enhancements aimed at delivering further improvements to user experience for our customers. In Singapore, we are currently able to uniquely target 85% of our property acquirers in our marketplace. We also launched a beta product, agent ratings and reviews that helps customers rate their experiences with agents and builds the credibility of our agent partners. In data services, we launched several new modules in Malaysia within the data sense intelligence platform to provide better insights into the supply and demand of properties, the timing of rental contract expiration and information on unsold new units. In our commitment to invest in data and software solutions for our business brands, we introduced a new enterprise brand, PropertyGuru for business. The new brand unifies PropertyGuru's B2B offerings and is designed to guide all enterprise slabs, property developers, agencies, banks, valuers and city planners to achieve their goals. In FinTech, as of the end of September, our mortgage business had broker over S$3 billion of home loans. That said, we now intend to work even harder for our customers and further enhance the PropertyGuru value proposition. In the short term, government fiscal measures to help dampen demand and slow inflation can add to the property market flux. For PropertyGuru, this has the potential to impact the wallets of our agent and developer partners, and therefore, the money they spend. With that in mind, we will continue to manage our business to maximize near term efficiency without sacrificing our long term growth goals. At this stage, I did want to briefly touch on each of our larger markets to share highlights from our proprietary property market reports, as well as relevant GDP data. In Singapore, although rising rates and government pulling measures can slow real estate sales activity, we are seeing continued resilience. In Vietnam, the government has signaled it will be proactive in combating inflation by further limiting available credit to homeowners and the real estate industry resulting in slowing transaction volumes. Finally, the Malaysian economy is showing continued strength with third quarter GDP up over 14% after single digit growth in the first half of the year. Now that the election's process is complete, we look forward to confidence gradually returning to the Malaysian market. PropertyGuru delivered another solid quarter with revenues in the third quarter of 2022 with S$35 million, up 47% from the third quarter of 2021 and an adjusted EBITDA of S$5.7 million. In Singapore, our largest market, we grew the number of agents to S$50,351 over 300 more than last quarter. Underscoring the strong value we are bringing our customers, our renewal rate was 87% up from an already high 82% in the second quarter while our average revenue per agent or ARPA was up 24% from last year. For the quarter, Singapore adjusted EBITDA was S$13.6 million representing a 75% margin. For Vietnam, revenues were up 161% and the number of listings were up 165% as the corresponding quarter in 2021 was impacted by ongoing COVID lockdowns. Meanwhile, the average revenue per listing grew 2.5% and increased adoption of premium services. Vietnam adjusted EBITDA of almost S$2 million in the quarter, reflected a margin of over 30%. In Malaysia, revenues were S$6.5 million as we continue to leverage our dual brand strategy. Finally, FinTech and data services combined revenue was up 28% year-over-year and their adjusted EBITDA was a loss of S$1.9 million. We ended the quarter with S$340 million in cash, up from S$70 million at the end of 2021, primarily reflecting the proceeds of the listing. As we mentioned in our press release, the result of the uncertainty, especially related to Vietnam and Malaysia, is to take a more cautious view of the market in the near term. I would just note our forecasted numbers for the remainder of 2022 do not include the impact of Sendhelper, our acquisition, although those numbers are expected not to be material. We report our fourth quarter earnings results in early March, and we'll provide our outlook for 2023. Lastly, even with the short term macro headwinds we discussed, we remain bullish on the long term prospects for PropertyGuru. In addition, we have begun to see valuations and acquisition opportunities increase as private market M&A activity begins to normalize following the events of the past year. While navigating the current environment, we've also remained laser-focused on continuing to invest in technology, automation and the PropertyGuru brand. This was another solid quarter of the PropertyGuru as we continue to grow and deliver improved adjusted EBITDA, another stepping stone to our long-term success. I understand some of your markets, regional markets may see some macro headwinds. I understand it's a bit early, but any color you could provide in terms of forward, I think, in terms of the determined headwind, that would be helpful. I think in terms of our outlook into Q4 for this year, I think as you've seen this year, some parts of our business are performing better than we hoped, better than our expectations. Traditionally when you have an election, there's a period of sort of caution comes into the market for both agents and particularly developers. So I think they're sort of holding off, waiting to see the outcome of that before they can get back to normal business. And I think overarching also, we do have inflation and interest rates, and these have been sort of shorter-term dampeners. I think we do intend to come back in March next year when we do our full year results, and at that point, we'll be able to take stock of all of the latest macro factors in our markets reflect other things such as ForEx and also impact of Sendhelper and any other acquisitions to better inform. But overarchingly, a lot of the factors we're seeing a relatively short to medium term in nature. We've always got these really strong macro tailwinds that we've touched on before, and we'll start to see those coming back to the floor, and then we can continue our sort of accelerated growth pathway. Look, just to that, I think one of the characteristics of our business is we're very well managed on the cost side. We're very prudent, and I think here is a good example of where that comes to the 4%. We obviously have a few headwinds and revenue is a little lower than expectations, but we've managed to make up sort of a substantial amount of that in terms of efficiencies and cost savings, et cetera. I think in terms of our seasonality of our costs, Q4 was one big quarter. So notice that across the globe, with increasing the inflation pressure and the potential slowdown top line, a lot of these corporates have adopted cost savings, at least on the corporate level. So as a result, I think just refer back to the COVID period, obviously, one of the greatest shocks the business has seen in some time. So, you know, I think we've whether that storm sort of very well. I mean, just to give you a sense, they're - an exciting start-up based here in Singapore. They are focus on the market here and really focused on providing more transparency, more, you know, quality guarantees, I guess, for tenants and for homeowners when it comes to home services, like moving air conditioning, maintenance a handyman services and such. We as - Joe noted, I think we don't expect material contribution from a revenue perspective within this fiscal year. For next year, I think right now what we are focused on is investing our - high quality technology into the entrepreneurs. And I think we're investing to that business for growth and focusing on building out what we've referred to as the trust platform for property, trying to make sure that all transactions and all engagements through the property sector are sort of founded on trusted interactions between stakeholders. To be honest, when it comes to home, for now, we've got - our strength and our track record around acquisitions has been in successfully integrating these businesses. So we're very focused on integrating this business, making it successful in Singapore. We would look to see whether it makes sense to extend these offerings to other markets either by us, Sendhelper by offerings that already exist in some of those markets. These are different markets upfront, and we are experts have been in this region for 15 years now. But I think right now, we are pretty much laser focused on home services in Singapore and driving that. With regards to our M&A strategy, we've sort of talked about that in the past, the adjacencies around data solutions, software products for enterprise clients Fintech and home services. We are mapping the markets as Joe mentioned, valuations have corrected a bit. Our core business that used to grow extremely well as, you've seen. So I think it's much more about being patient, finding the right opportunities, the right teams, finding a good culture fit, and then buying and integrating those businesses. Yes and just to - I mean, in terms of seasonality of costs, we do have sort of different drivers in different quarters. Q4 is a high revenue period for us, but also coincides with our awards business, the peak of that business and that is - that carries a fair amount of cost of actually sort of delivering those awards. So hence, there is a higher - it's a lower margin, but a higher sort of cost push into that - into Q4. And as mentioned earlier, we also have sort of like - we tend to advertise quite heavily into Q4 and we've had a lot of sort of brand activity that's also driving additional cost sort of into Q4. In terms of the profitability, I mean I think Vietnam is operating sort of pretty well. Obviously, we have - some challenge on the revenue side, but I think costs are under control and would look as revenue improves into next year margins increasing. I think for Malaysia, the merger has been between the two brands between keeping the two brands, by merging the back office has been really successful and probably sort of more successful than we'd hope from a cost perspective. So we've - very pleased with the level of profitability that we see and with the high level of market share, the really, really strong organic position and fantastic synergies on the people and technology side, we look forward to really strong margins in that business going forward. I just want to understand the potential dynamics if we're heading to somewhat like say, short, medium-term down cycle, in other markets, typically in a down cycle, you see agency are more conscious about their ROI. I think in any sort of down cycle, people do consolidate their, spends that's not unique to the real estate sector. And I think, in each of them, to Joe's point, we've continued to invest in technology, automation, superior products for our customers, and they have sort of rewarded us by increasing our market share at times like that. I think to be candid, when you look at our market share positions in these markets, we're not focused as much on market share as customer satisfaction and driving superior innovation and technology and quality of solutions, quality of trust, those kind, of parameters. So we're really focused on customer success and customer satisfaction, more - so than market share. The other thing I'd say is, as we mentioned in our three core markets, Singapore, despite the challenges of increasing interest rates and inflation, the real estate market remains resilient. In Vietnam, the demand remains very strong in our marketplace. And if anything, you see the cooling measures that the government put in is actually meant to make sure that there isn't an overhead in the market, people don't get to indented, real estate developers don't get know their heads. They have been tracking real estate markets across Asia and North America, larger markets where the real estate sector has overheated. And obviously, as an emerging economy, they're trying to make sure that prudent decisions are made by both real estate developers as well as consumers. But what they're also noting through these actions is that fundamentally, the market is hot, the real estate market, and they're not to make sure it doesn't overheat. So I think  lost upon us is despite the overall circumstances, global circumstances of interest rates and inflation, Singapore and Malaysia, Vietnam, all look strong real estate markets. Now the question on the short-term, there might be some impact of these cooling measures as we have noted. And I think for that, the market share position helps, but it's not sort of on the critical path to satisfy those plans. Given recently repositioning and we brand our 2B business, wondering if there's any new growth opportunity coming up that will be exciting into next year. So, just to clarify is the question around the brand repositioning and whether that creates opportunities. Yes, that's about the PropertyGuru for business. We have a variety of offerings now, our marketplace products events and awards, software product, data products, and we thought it's important when we're talking to real estate developers or banks, urban planners, et cetera. That we have some consistency of our solutions that the vast range of products and services we have are delivered in a consistent manner to our customers, making sure that we are sort of lowering with our customers, learning from our customers and developing our products consistent with that. So I think there is nothing new in terms of the product offerings - sorry, in terms of the business lines rather. But the business lines will be organized around marketplaces, data services and Fintech, as we mentioned in the past. As we also mentioned - as I mentioned rather in my opening remarks, the master brand itself has gone to this repositioning of guided by Guru. And so this aspect of this aspect of guidance that we want to be your trusted adviser and guiding you through decisions, whether you're a consumer or a B2B client is consistent with our brand."
}