{
    "symbol": "EDUC",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-05 20:28:06",
    "content": " I would now like to turn the conference over to your host, Steven Hooser, Investor Relations. On the call with me today are Craig White, President and Chief Executive Officer; Heather Cobb, Chief Sales and Marketing Officer; and Dan O'Keefe, Chief Financial Officer. After the market closed this afternoon, the company issued a press release announcing its results for the third quarter and fiscal 2023 year-to-date. Before turning to the prepared remarks, I would like to remind you that some of the statements made today will be forward-looking and are protected under the Private Securities Litigation Reform Act of 1995. With that, I would now like to turn the call over to Craig White, the company's President and Chief Executive Officer. Thank you, Steven, and welcome everyone to the call. Finally, I will wrap up the call with some comments and strategy and 2023 outlook. We are pleased with our sales for the third quarter, especially when compared to the previous quarter. We continue to face macroeconomic pressures from record inflation resulting in high food and fuel costs that have hit the pockets of our target customers, which are families with young children. To combat these continued pressures like many retailers, we offer additional discounts to support our customers and additional incentives to energize our sales force. Having said that, I am pleased by our ability to remain profitable for the quarter. With that, I will turn the call over to Dan O'Keefe to provide a brief overview of the financials. Turning to the third quarter, net revenues were 30.3 million, a decrease of 14.8 million or 32.8% compared to 45.1 million in the third quarter last year, or an increase of 56.2% as compared to 19.4 million during the previous quarter. Average active UBAM sales consultants totaled 27,100 compared to 41,500 in the same period a year ago, and 26,800 in the previous quarter of this year. During the third quarter, we saw stabilization in the average active number of consultants. The decline was primarily due to lower active consultant count coupled with rising inflation, especially during the first and second quarters this year. Average active UBAM sales consultants totaled 28,700 compared to 47,300 for the first three quarters of 2022. Last year, we saw inflated numbers continuing from the pandemic when school closures continued, and many family members worked from home. This year as schools remained open and families returned to work, we've seen our sales consultant levels start to normalize. Year-to-date loss for income taxes was $800,000, a decrease of 11.7 million compared to 10.9 million during the same time last year. Net year-to-date loss totaled 600,000, compared to 8.6 million for the first half of last year -- for the first three quarters of last year, a decrease of 8.6 million. To update everyone on our working capital levels, inventory levels decreased from 67.6 million at the end of the second quarter to 64.3 million as of November 30, 2022. Cash generated from our reduced inventory was primarily used to pay down our working capital line, which ended the quarter at $9 million. Lastly, our longstanding dividend program remains paused as part of the strategic decision to preserve cash, which improves cash flows by approximately 1 million per quarter. As Craig mentioned earlier, we continue to evaluate market conditions and make changes we feel are needed to motivate our sales force and engage our customers. These market decisions not only helped us normalize our working capital, but also keep our commission-based sales force engaged. During the second and third quarters, our sales and marketing teams internally spent significant efforts executing a rebranding directive for our direct sales division. Kane Miller Books, Usborne Books, SmartLab Toys and Learning Wrap-Ups. Our rebranding process was completed earlier this week, when we transitioned our customer facing ecommerce, and brand partner facing back office to the new paperpie.com. We are extremely excited about our new name PaperPie, as it does allow us to build a recognizable brand and encompassing all of our wonderful products and people. But overall, we wanted our brand to represent our mission of gathering for good around literacy and learning. Whether it's a board book, game pieces, a series of chapter books or creative activity. As the world continues to fight for our children's attention through screens and devices, it has never felt more important for tangible literacy and learning tools that will feed the imagination, grow the emotions and nourish the mind of our children. And when you think of pie, you think of something to be gathered around something to be shared an experience worth savoring. That's exactly what we believe our products are made for, literacy and learning as a lifestyle. PaperPie is for memory making, creative learning and unlimited possibilities, all within the context of togetherness. Along with this strategic rebranding, starting this week, we rolled out our SmartLab Toys product line. These award-winning theme-based products, including squishy human body, laboratory toys, science lab toys, and our tiny series offer children ages eight and up hands-on learning opportunities. During this past year, our product costs and sales commissions have remained unchanged, but other costs have increased, especially in the areas of inbound and outbound freight. As our earnings have been impacted, we have made recent changes to improve profitability, including increasing the freight we charge our customers. We have also made changes to reduce our operating expenses, and we are seeing inbound freight rates come down and are taking advantage of better spot rates. As we return to higher profitability, we plan to reinstate our longstanding practice of paying quarterly dividends to our shareholders. Turning to future expectations, I want to highlight some exciting changes happening at EDC. First, I want to thank Heather and our sales and marketing team for the successful rebranding. I expect not only short-term benefits from the excitement surrounding our new name, but a positive momentum building trend in our PaperPie brand partner count as we rally around our new names or improving and diversified line of products in our improved IT systems. He has taken the lead on several IT projects, and we have new products and system enhancements that will not only make our existing PaperPie sales brand partners more successful but offered new brand partners or shorter path to financial success selling our products. Lastly, I'd like to talk about our new product line SmartLab Toys. This product line has a long history of sales success but has never had a marketing and sales engine like PaperPie, where we have a much broader reach. Also, our trade retail division has outside sales groups who have represented the product line in the past and are ecstatic to get the line back. Now that we have provided a summary of some of our recent activity, I'll now turn the call back over to the operator for question-and-answer. So how about -- I'll ask my three questions, and then I'll hang up and listen to your response. First, UBAMs net sales per average consultantsâ\u0080\u0099 quarter was 941 down 6% from the same quarter last year and down 17% from the same quarter just before COVID. In fact, this is the fourth year in a row that Q3 sales per consultant fell. Secondly, this past June, Usborne Publishing Limited in U.K. applied with the U.S. Patent and Trademark Office to register the UBAM trademark and expressly stated that it intends on using this trademark in commerce. And finally, your Usborne distribution agreement specifies minimum revenue targets that you must order from Usborne. I won't say we're necessarily on a downward trend, I think there's a great deal of excitement around the new brand. It's very exciting that PaperPie, as Heather mentioned, is in a very clean URL and social media space. And so I don't anticipate that trend will continue, but that remains to be seen. Also, with as Usborne trademarking, the myubam.com, UBM, they are not launching their own MLM division. And that's what caused us to need to rebrand, as you know, Usborne Books more has the word Usborne in it, and they want us to rebrand. I'm just hoping you could quantify that or put it in a range of how much inflation contributed to the quarter-over-quarter growth for the year, excuse me for the quarter. I don't think we can quantify inflation's impact, it's just that whether we like to believe it or not, children's educational products are a discretionary purchase for young families. No, I mean, so the key thing we look at, and as we said in the call, we make market decisions based upon sales activities, and we are constantly looking at what we need to do to capture sales and grow sales. And so, we ran some promotions this quarter and offered some additional incentives just to make sure that we were capturing as much of the business as we could. Like Dan just said, we always try to react to sales and marketing conditions at the time. We don't expect it's not a company-wide decision to discount or do any of those kind of things, but we kind of spur and try to ignite the sales force whenever we see it's necessary. And some of them have been discontinued, but we're looking at bringing back any or all or any combination thereof. So they had several basic category groups, I would say that a circuits group of products, they have the Chinese, they have the squishies, which there's a squishy brain, and they have a new product that they actually never sold before we acquired them, which is the ultimate squishy human body, which is much more integrated with electronics. But like I said, and then there's science labs and some of those things. So we're kind of spacing those releases out but yes, there are further products. As Craig mentioned, they have a catalogue of products for us to continue to pull from. But in addition to that, we also kept on staff, one of their creators and developers who is responsible for the creation of these products. We can pull from the back list of their catalogue, and we also are planning to create some of our own things to follow up with. Well, I'm just wondering, that if you question those in the consultant line and get their feedback of any interest about certain products from their downline or whatever the people that are having at their parties and whatever, and kind of query them as to what's going on or that might give you a better idea of what the public wants, so to speak. And so that's what we've already been doing with our product lines, is taking the temperature of our field as well as the customers watching trends and seeing where we can fill gaps that we currently aren't offering or isn't available in the market otherwise. Following our call today, we will get a recording and put it on our Investor page of our edcpub.com website. You can find them under investors, in corporate filings and then there's earnings calls. There's nothing under corporate filings at this point, right. Okay, with the press releases -- what I've been able to get the phone number to call in online because I couldn't find it. If you go to that SEC filings and open up that first 8-K, and then you can walk through that 8-K announcement. And at the bottom, there's a third quarter earnings call information. I can't but I got to EDGAR search results from but that's all right, if I can get a recording later someplace. And then if you click on that 8-K, under the EDGAR search results, it'll open up our press release. Thanks, everyone, for joining us on our call today. Ladies and gentlemen, this concludes your conference call for today."
}