{
    "symbol": "DLB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-03 18:34:09",
    "content": " Let’s talk about our developer platform Dolby.io, where we are focused on enabling developers to create the most compelling experiences in target markets where we can offer the most differentiation, virtual live performances, online and hybrid events, social audio, premium education, gaming, and content production, which we estimate to represent a market opportunity of about $5 billion in growing. On a year-over-year basis, first quarter revenue was about $38 million below last year’s Q1 as we benefited from a $21 million true-up in Q1 2021 versus the $6 million negative true-up in Q1 2022 and the prior year also benefited from timing of revenues under contract. Mobile decreased by $31 million or 29% compared to Q1 of last year, as our foundational audio revenues last year benefited from both higher recoveries and timing of revenues under contract, partially offset by new imaging patent licensees. On a year-over-year basis, Q1 CE licensing increased by approximately $6 million or 11%, driven by higher foundational audio revenues for DMAs and soundbars, as well as higher recoveries. Beyond licensing, our products and services revenue in Q1 was $19 million compared to $17 million in last year’s Q1. Operating income in the first quarter on a non-GAAP basis was $126 million, or 35.8% of revenue, compared to $189.7 million or 48.7% of revenue in Q1 of last year. Net income on a GAAP basis in the first quarter was $80 million or $0.77 per share – per diluted share, compared to $135.2 million or $1.30 per diluted share in last year’s Q1. Net income on a non-GAAP basis in the first quarter was $104.5 million, or $1.01 per diluted share, compared to $153.3 million or $1.48 per diluted share in Q1 of last year. During the first quarter, we generated $32 million in cash from operations compared to $82 million generated in last year’s fiscal Q1. Products and services revenue are expected to range from $75 million to $90 million for fiscal year 2022, with improvements in cinema products and growth in Dolby.io."
}