{
    "symbol": "DLB",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-17 21:52:02",
    "content": " We're hard at work to bring the Dolby experience to all the ways consumers experience that content, whether it's movies, TV, gaming, sports, music, user-generated content and all the devices that those experiences are enjoyed on. We're -- we've laid the foundation for new ways to experience Dolby and laying the foundation for new growth in areas like music and automotive, user-generated content with Dolby Vision Capture. This was partially offset by growth in Dolby Atmos, Dolby Vision, and imaging patents as well as an increase in products and services revenue, driven by improvements in the cinema industry. This portion of our licensing revenue grew roughly 30% in fiscal year 2022 compared to nearly 20% growth in fiscal 2021, driven by higher adoption and new licensees as well as increased box office, which positively impacted Dolby Cinema. Full year broadcast revenues declined by $42 million or negative 9% on a year-over-year basis, driven by lower TV unit shipments and lower recoveries, both impacting primarily foundational audio. In Q4, broadcast revenues declined year-over-year, driven by lower unit shipments, partially offset by increases in Dolby Vision and Dolby Atmos. Full year mobile revenues declined by $22 million or negative 9% on a year-over-year basis as the prior year benefited from timing of deals, including recoveries, partially offset by increases in Dolby Atmos, Dolby Vision, and imaging patents. Full year CE revenues increased by $4 million or 2% on a year-over-year basis, driven by growth in Dolby Atmos, Dolby Vision, partially offset by lower units. Q4 CE revenues were down year-over-year, driven by lower recoveries and lower unit shipments, partially offset by growth from Dolby Vision, Dolby Atmos, and imaging patents. Full year PC revenues increased by $9 million or 6%, driven by Dolby Atmos, Dolby Vision, and imaging patents and higher recoveries compared to fiscal year 2021. Q4 PC revenues are down year-over-year, driven by lower unit shipments, partially offset by growth in Dolby Vision, Dolby Atmos, and imaging patents. And so we're really confident that those are going to become big contributors to Dolby Atmos, Dolby Vision, and imaging patent growth over the long-term where we see the opportunity to double it. And so clearly, I've said for the mid-term, we expect Dolby Atmos, Dolby Vision and imaging patents to be in that growth mode, and we see that opportunity to double them over that period of time, growing 15% to 25% annually."
}