{
    "symbol": "DLB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-09 22:02:19",
    "content": " Dolby Atmos, Dolby Vision, imaging patents, while not immune to the macro environment, are much less sensitive, and we're expecting strong growth through the year, roughly 35%, and we're happy with the progress we're making there. And so that's why we've been focused on extending our presence into areas like music, mobile media content, gaming, live sports because it's becoming a part of the experiences that creators and consumers care about the most and that they engage with most frequently, that's what increases demand for Dolby experiences. So that's another ecosystem that we see coming together really nicely, and that's what fuels the opportunity to increase Dolby Atmos adoption across all the ways that consumers enjoy their music, which could be a car or a mobile device or in living room. I think that's a consistent theme across all companies, but we are focused on the things that we control and that means continuing to grow the Dolby experience to more types of content to more people around the world and staying focused on those top priorities because that's what drives our long-term success. Q3 total revenue was up 1% year-over-year, driven by increased adoption to Dolby Atmos and Dolby Vision, new licensees and imaging patents and improved results for Dolby Cinema and our Cinema products business. Licensing revenue was $269 million, down 1% year-over-year, driven by lower broadcast and PC unit shipments, lower recoveries and a lower true-up, offset by increased adoption of Dolby Atmos and Dolby Vision and new licensees and imaging patents. Broadcast revenue was down 20% year-over-year, driven by lower recoveries and lower estimated shipments for TVs and set-top boxes, partially offset by growth of Dolby Atmos, Dolby Vision and imaging patents. Mobile revenue was up 27% year-over-year, driven in part by timing of revenue associated with minimum volume contracts as well as higher adoption and new licenses for Dolby Atmos, Dolby Vision and imaging patents. PC revenue was up 8% year-over-year, driven by higher recoveries and growth at Dolby Atmos, Dolby Vision and imaging patents, partially offset by lower PC unit shipments. So on one hand, when we're demoing and engaging about the potential for the future, whether it's with cars or Dolby Vision capture or live sport, that continues to be full steam ahead on focused on our long-term priorities. Well, the reason we're excited about the win with Xiaomi and Dolby Vision capture is, we do think it's a very compelling experience on mobile devices, and it's a -- it addresses a use case that is primary to the mobile device, whether it's applying that to social media, to live shopping like Naver is or just to your own video. And what that does for us is 2 things: one, spreading the -- making Dolby Atmos more available, whether it's live at Dolby Live, whether it's -- we've had concerts that have been streamed live in Dolby Atmos, whether it's in the car or in the cinema, that just contributes to the awareness and passion for the ecosystem around Dolby Atmos Music."
}