{
    "symbol": "FRST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-31 10:24:10",
    "content": "  Operator: Good day, and welcome to the Primis Financial Corp. 2022 Second Quarter Earnings Call. Good morning, and thank you for joining us for Primis Financial Corp.'s second quarter webcast and conference call. Further discussion of the company's risk factors and other important information regarding our forward-looking statements are part of our recent filings with the Securities and Exchange Commission, including our recently filed earnings release, which has also been posted to the Investor Relations section of our corporate website, primisbank.com. We undertake no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events or changes to future operating results over time. We strengthened our commercial banker team with new hires first, and then we were crafted with some strategies that we believe will cement our reputation as a growth-oriented company. On the loan side, we've seen four quarters now of loan growth, each with a little more momentum and from all areas of the bank. And while that toward pace of growth, it may not be our long-term pace, it does set us up nicely for the rest of this year. On the funding side, we've transitioned away from CDs as our main focus in funding source, and we work to build momentum in checking accounts and other low-cost deposits. We've moved our cost of deposits down aggressively, very close to our peers, but in a zone that supports the growth we need for our ISS  strategies. This quarter, checking balances moved nicely to about 24% of total deposits. And while we know there's more work to do here, this extends to date and the momentum we are building is very encouraging about the future. And while the market activity is slowing because of higher rates, I've been around this business long enough to know that volumes will return. Right now, large mortgage companies are shedding support, eliminating marketing resources, trimming assistant positions and looking to reset for today's reality. Simply could the market for mortgages have slowed, but the market for originators and good teams is noticeably better. So while I want the operating performance at our company to be wow, right now, I am confident that we are doing what is necessary and that we are just a few quarters away from putting that value overhang to bed as well. Our growth rates, our credit quality, our profitability, they're not designed or meant to guide t it or replace it. I mean, an honest review of this industry would say that the industry has changed, any its still changing. Since then, we've done everything that good community banks are supposed to do. But right now, a review of all of our customer data and relationships shows that we're banking 50% more doctors than depth and dense  in our footprint through the Panacea franchise than we do in our core bank after 17 years. They're fairly breakeven right now, and we're investing hard in that business with the founders to continue harvesting this easy opportunity. As a reminder, a full description of our second quarter results can be found in our earnings release and second quarter earnings presentation, both of which can be found on our website. Excluding onetime items, earnings in the second quarter were $6 million or $0.24 per diluted versus $4.7 million or $0.19 per diluted share in the first quarter. Total assets were $3.24 billion at June 30, up slightly from March 31, excluding PPP loans and loans held for sale, total loan balances grew 10.5% linked quarter or approximately 42% annualized. Growth came from all parts of the organization in the second quarter, including almost 20% annualized growth in the core bank, while Panacea and Life premium finance both had growth accelerating from Q1. Non-interest-bearing deposits were 24.3% at quarter end and continue to be a focus, while CDs have declined to 12.3% of total deposits. Net interest income saw strong growth in the quarter, increasing to $24.6 million from $22.9 million in Q1 or 7.7% linked quarter. Our reported margin was 3.33% for the second quarter or 3.35%, excluding the effects of PPP, up 37 basis points and 39 basis points, respectively, from the first quarter, driven by strong loan growth and a better earning asset mix. Primis originated $27 million in June, down slightly from May as the company transitioned to Primis. As previously discussed, our goals for Primis Mortgage in '22 are to grow production and invest in talent versus a meaningful contribution to earnings this year. Non-interest expense included a number of items this quarter, including branch closure costs, merger-related expenses and the addition of one month of expenses from Primis Mortgage. Excluding these items and recovery or expense for unfunded commitments, non-interest expense was down slightly to $18.5 million from $18.6 million last quarter. The provision for credit losses was $422,000 in Q2 versus $99,000 in Q1, combined with net recoveries of $408,000 in Q2, the allowance increased by $830,000 for the quarter. While economic outlook weakened, loan growth in the quarter was concentrated in categories with lower model reserve requirements. As a result, the allowance for credit losses to gross loans, excluding PPP balances and loans held for sale decreased to 1.16% at June 30 versus 1.24% at March 31. Non-performing assets net of SBA guarantees increased $5 million in Q2, primarily due to one $8.5 million relationship on a residential property that has struggled to service the debt, but offset by the payoff of a non-accrual development loan of $4.6 million. As mentioned previously, we had net recoveries in the quarter and have now had recoveries in four of the last five quarters. Combined with continued revenue growth, we believe we could drive the operating efficiency ratio to the low 60s as we finish 2022. If you exclude PPP fee income, which was a temporary source of revenue, pretax pre-provision ROA is at the highest level since Q3 of 2020. Over that time period, we've invested heavily in new business lines and offerings and are starting to see the returns from those investments. Similar to the efficiency ratio discussion, we are confident pretax pre-provision ROA will continue to see meaningful improvement in the near future. Maybe just to start, I think it was really good to see the deposit growth come in this quarter. Now I mean is that that's probably of all the goals we have around here, the ratios that we measure and sort of answer to the board on, that's clearly the hardest. And I think especially in the current environment it's not going to be easy, but I think I mean, its critical. As far as the strategies to get there, I mean, I would tell you, yes, the digital bank no question about it, is something we're hoping is going to move us there. The digital bank is named Primis Bank, it offers the exact same products and services that the core bank offers, so there's really no differentiation there. But when we market it in our core footprint and really beyond, it's easy to market it as the most convenient solution out there. The - outside of that, I think we're - internally, we're focused on changing incentives or enhancing incentives, were already paying the biggest incentive we pay here is still on a checking account. I think on the deposit pricing, you know, we have, like I said, we've moved cost of funds, our cost of deposits down aggressively. But just knowing what the pipelines look like on the asset side and the opportunity, we've sort of stayed a little aggressive, and I think we would continue to stay aggressive there. So that will be call it $300 million of growth, we're going to need to have on the other side. Maybe just Matt, I think it was good to see in the release, and then I think you discussed it briefly in the commentary the $3 million to $4 million of potential cost savings that you discussed, that was really good to see. So additional ones above what we've talked about would be in that number, some back office restructuring and consolidation of some positions that we can have some visibility to and then some other operating efficiencies contracts and stuff that we can renegotiate that we see some opportunities to reduce costs. In terms run rate, I would say, so this is going to be excluding any onetime costs related to branch closures, et cetera, and excluding Primis Mortgage. That should be probably closer to $18 million in Q3, give or take. And then for this $3 million to $4 million kind of saves that you've identified, kind of once we were to past through the back half of this year, do you think there's kind of any more potential cost-cutting efforts as you look into 2023 or is it more just going to be on kind of tweaking things here and there and reinvesting in the franchise? I think it's going to be - I mean we're always looking for efficiencies, but I think it will be more tweaking things here and there. I think the 30-year mortgage is now kind of 6%, maybe come off that just a touch. Right now, there's just so many mortgage companies, and I'm not faulting anybody. I mean the volumes were mine blowing, and you just had to step up and now that reset is sort of changing the day-to-day for a lot of originators. I remember when we started looking at this and we were looking at some other strategies, I mean, we talked to some DCI  teams that wanted $1 million to make the move. And you could probably - I mean, back then, you probably could have justified it. I mean we're doing enough volume, a couple of hundred million dollars of volume, you're maybe paying them six months of bottom line profitability. So that's - I mean, again, for us, that's good because I think even bags in. I don't think, Matt and I wanted to be cutting a lot of million-dollar checks for new teams given you really only have one month of sight  on what mortgage will do. There are definitely things out there that maybe the culture where they are isn't good, the enthusiasm for mortgage to feel different in their company. And the enthusiasm for mortgage here is very hard, steeper pitch  Its - Matt and I both know this business. I think as far as what we can expect, I'd say probably, I think comfortably, I would say maybe $500 million, just what I know now. I'd say comfortably, I can say $500 million knowing that there is kind of - even at these levels, there will be a reset. I think if we can get, I probably wont say lucky, I don't know what the word is, but if we can be successful on some of the recruiting that we're doing, if we can get some reasonably priced teams and negotiate well and exploit our position here being kind of one of the few offensive mortgage companies, maybe we can get that to $1 billion. And then we highlighted in the release of a gentleman that joined us as a regional executive, came from a much larger shop and ran a very large region and he is excited about the team that Primis Mortgage is building, and he's already hit the ground running on the recruiting side. Dennis and Matt, I wanted to kind of start with credit. I mean early warning signs, weaknesses in credit or underwriting terms coming through that I don't think we're seeing that. I mean I think the values, this is one thing I would say, the values of anything that shows up a little weak. The collateral values are strong and resolvable, I think they're at resolvable levels. You know, where we are right now people want to know what's different now than back in 2007 and '08, I think that is a big difference. I think the one loan that Matt was talking about that went no-accrual, I mean we're - we're at like a 40-something percent loan-to-value. It kind of contaminates your asset quality story, but there's just no loss there, its just a cash flow problem person, and this is a famous person, has just - they just don't have the cash flow to support the mortgage. And I think we probably could have worked with them like this or worked with them like that or - but I just think right now it's not in our best interest to push off any kind of credit problem, especially right now when asset values are resolvable. I mean we see stuff moving around, but nothing that we would characterize as systemic, just kind of you know, its here in the businesses, allocating risk, some stuffs going to go bad. And then I had a related question on Tennessee, just to sort of remind us on kind of how the business is being built from a guardrail perspective and just how you sort of think of credit as you expand and as they continue to have success/\n I mean, their offerings are - each quarter, the offerings are a little more varied. I mean in commercial right now, 60% to 70% of the volume productionâ\u0080¦\n 85â\u0080¦\n 85, okay. I mean, the commercial production what we're doing in the bank underwriting style if it were to come to the bank versus coming through Panacea, there's really no difference there, not at all. In fact, our commercial production, the people doing our commercial production - that are doing the commercial production, reviewing the commercial production, approving it, are all Wells Fargo, TD Bank, big bank. On the consumer side, which is what really got us started here and I think what differentiates us I mean, we're banking fourth â\u0080\u0093 were year medical students, residents fellows. I mean the fact is, I think a lot of those don't have the proven credit background as you look. I mean, if you're trying to bank those doctors on a 750 beacon, you're probably going to - or a beacon, you're probably going to - that's just not how you bank those doctors. And that doesn't mean - absolutely, it does not mean that we're swinging consumer credit to unqualified borrowers period. We've got 2,000 doctors and I would tell you the past due ratios, the charge-off ratios, the losses, the credit problem indicators there are fine ph and maybe as good is what we expected or better. I mean on the consumer side, we're not - what I know is there's a focus right now, given the economic outlook. I mean we're not offering consumer loans to technicians for nurses or its doctors, you know, thatâ\u0080\u0099s Dennis  These are folks that or are at the upper end of the income bracket when they get out of school. So these are bridge loans basically to very high earning people, and that's how they're underwritten. I mean like Life Premium Finance, it's immaterial at this point, they only have, I think, less than 3 million deposits tied to like premium demand . And then for Panacea, I think it's $10 million or $11 million and a lot of that's coming on the commercial side. Some of its consumer for our consumer borrowers, but I think most of the dollars are tied to those operating accounts. On the price side, pricing those deposits and probably sort of move the deposit flows up in those businesses, soâ\u0080¦\n Right. And I presume you can Matt, you can do that within kind of how you want your betas data's to look as you bring in new money, if that all makes sense. The ROA â\u0080\u0093 our ROA that Matt and I won't - probably 135 range and moving higher, but 135 probably short term, I mean, efficiency ratio in the low 60s and moving lower and margin being driven by good yields and good deposits is critical as well. So I think the first goal I would tell you, Chris, is to see low 60s. And then as we do that, let these lines of business that I think both are going to operate with, I mean, I didn't say in my comments, but I think both of these lines of business are going to ultimately operate probably 20s and 30s in the efficiency ratio, sort of let them pull us down a little lower into the 50s."
}