{
    "symbol": "CULP",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-02 14:45:04",
    "content": " Importantly, our estimated cash income tax payments for this fiscal year are management's current projections only And can be affected over the year by actual earnings from our foreign subsidiaries located in China and Canada versus annual projections, changes in the foreign exchange rates associated with our China operations, in relation to the U.S. dollar, as well as the timing of when significant capital projects will be placed in the service, which determines the deductibility of accelerated depreciation. For mattress fabric segment sales were $40.9 million, up 2.1% compared with last year's second quarter. As we continue to invest in our business, our cash flow from operations and free cash flow during the first half of this fiscal year were affected by the following uses of cash: Increased inventory purchases to support our valued customers, to get ahead of rising material -- rising raw material costs, and to strategically improve our in-stock position ahead of the Chinese New Year holiday. Based on our current expected uses of cash and our business outlook for the second half of this fiscal year, we expect total cash and investments to be lower at the end of the third quarter as compared to the end of the second quarter, but to increase by the end of the fourth quarter. Although we are well-positioned over the long term with our product-driven strategy and flexible global platform, the current headwinds are expected to continue pressure results throughout the second half of this fiscal year especially during the third quarter. Due to the uncertain and rapidly changing inflationary environment, the lack of visibility relating to the duration and magnitude of customers supply chain disruptions and uncertainly related to the impact of the new Omicron environment of the coronavirus, we have withdrawn our previously issued annual guidance for this fiscal year and have only provided a limited outlook for the third and fourth quarters until the current volatility stabilizes. We expect our net sales and consolidated operating income for the third quarter this fiscal year to be sequentially comparable to the second quarter of this fiscal year, we expect a strong improvement in net sales and operating income for the fourth quarter of this fiscal year, as compared to both the sequential third quarter this fiscal year, and as compared to the fourth quarter of last fiscal year. Notably, our expectations for the third and fourth quarters of this fiscal year are based on information available at the time of this call and reflects certain assumptions by management regarding the Company's business and trends in the projected impact of the ongoing headwinds."
}