{
    "symbol": "CULP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-30 16:08:04",
    "content": " As previously announced, our results for the fourth quarter were significantly challenged by the unexpected shutdown of our China facilities due to COVID related restrictions affecting both of our businesses and by further weakening in domestic mattress industry sales. Although these shutdowns dramatically affected sales for our residential upholstery fabrics business and our mattress cover business during the fourth quarter of fiscal 2022 and to a lesser extent, the first month of fiscal 2023, this has notably been the first instance of any material COVID related disruption for our China operations since the pandemic began. Our overall operating performance for the fourth quarter was significantly pressured by lower sales, operating inefficiencies at our US and Canadian locations due to the rapid and material decline in revenues, unfavorable foreign exchange rate fluctuations in China and additional employee training costs and operating inefficiencies at our new Haiti upholstery cut and sewn facility, as it continues scale capacity to its full planned output level. Other pressures affecting the year were start-up costs for the new Haiti upholstery cut and sewn facility, operating inefficiencies in our mattress fabric segment related to the product mix within the segment's global platform and labor shortages in the US and Canada among other factors. Sales for the upholstery fabric products were significantly expected during the fourth quarter, primarily due to COVID related shutdowns of our facilities in China and to a lesser extent, a slowdown in new business for the residential home furnishings industry. However, top line performance in our hospitality business continue to recover from pandemic related impacts during the quarter with higher sales in both our hospitality contract business and our windows products business compared to the fourth quarter of last fiscal year. Our operating performance for the fourth quarter of this fiscal year was primarily pressured by lower sales, as well as unfavorable foreign currency fluctuations in China and additional employee training costs and operating inefficiencies at our new Haiti cut and sewn facility, as they continue to scale capacity to its full plan output level."
}