{
    "symbol": "RADI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 17:42:10",
    "content": " These assets generated record quarterly GAAP revenue of $32.6 million, up 30% year-over-year, which is net of the impact of recent volatile foreign exchange rates. As you will hear shortly, our rent portfolio had net organic annualized growth of approximately 3.7% in the second quarter, and we expect that organic growth to continue to rise to an annualized run rate of approximately 4% by next quarter as contractual inflation adjustments in our leases continue to kick in over time. During the quarter, we invested approximately $180 million to acquire $12 million additional rent -- annualized rent increasing our total annualized in-place rents to a run rate of approximately $132 million, representing a 29% year-over-year increase. After making these investments, we now have over $600 million of cash on the balance sheet to be used for incremental value-accretive acquisitions and investments, which was raised both from equity issued as well as from debt facilities that are 100% fixed rate or capped interest only and with no near-term maturities. With respect to our $131.7 million of annualized in-place rents, as of June 30, 49% are denominated in euros, 15% in British pounds, 16% in U.S. dollars, 3% in Australian dollars, 1% in Canadian dollars and the remaining 15% in other global currencies. Cap revenues were up 30% year-over-year to $32.6 million in the quarter, and gross profit or what we refer to as ground cash flow rose 25% to $30.5 million, resulting in a gross profit margin of approximately 94%. We anticipate that these new lease streams will generate a fully burdened initial cash yield of approximately 6.4% on a total gross spend basis, which includes approximately $13.4 million of origination SG&A that we spent in the quarter. In the second quarter, our existing portfolio rents on a constant currency basis, excluding rents we acquired in the quarter, generated 4.7% revenue growth from the combination of our contractual escalators and organic revenue enhancements, which was partially offset by approximately 1% of gross churn, resulting in net organic revenue growth of 3.7% on a year-over-year basis."
}