{
    "symbol": "PNM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 19:39:05",
    "content": " I would now like to turn the conference over to Lisa Goodman, Executive Director of Investor Relations. Thank you, Joe and thank you everyone for joining us this morning for the PNM Resources fourth quarter and 2022 earnings call. Joining me today are PNM Resources' Chairman and CEO, Pat Vincent-Collawn; President and Chief Operating Officer; Don Tarry; and Senior Vice President and Chief Financial Officer, and Treasurer, Lisa Eden. Before I turn the call over to Pat, I need to remind you that some of the information provided this morning should be considered forward-looking statements pursuant to the Private Securities Litigation Reform Act of 1995. For a detailed discussion of factors affecting PNM Resources results, please refer to our current and future annual reports on Form 10-K, quarterly reports on Form 10-Q, as well as reports on Form 8-K filed with SEC. Good morning, everyone and thank you for joining us today on this beautiful setting New Mexico Friday morning. Today, we will cover our year-end results for 2022 to provide an update on our pending merger with AVANGRID, review operational highlights, and share more details on our earnings guidance for 2023. For 2023, we are narrowing our guidance range to $2.65 to $2.75. In December, our Board increased the common dividend to $1.47 per share on an annual basis. Over the last month, we have been pleased to see the commission post notice of three closed sessions with the case on the agenda. In New Mexico, the newly appointed commission took their seats in January and we're confirmed by the New Mexico Senate earlier this month. In December, PNM filed its 2024 Rate Change as planned. We deferred our plans to file earlier because it was not the right thing to do during the pandemic, and we remain committed to the stay out agreements we made with our parties during the merger negotiations. We moved forward with funding needed infrastructure projects and now in an environment of rising costs, we are able to propose a 2024 bill impact of less than 1% partially because of our exit from the San Juan Generating Station. In Texas, we made our first transmission cost of service filing for 2023 in January, reflecting another strong year of investments in Texas to support growing customer demand. In a year of supply chain and labor challenges, our teams planned ahead and remained agile while expanding our system and interconnecting energy storage systems, chemical plants, crypto mines and datacenters. I will cover our ESG highlights for the year, on Slide 5. We continue to add more electric vehicles to our fleet, we continue to work to expand customer energy efficiency programs, collaborate with industry experts to address physical climate risks and partner with stakeholders to bring awareness to environmental concerns impacting our communities. We developed a greenhouse gas emissions inventory for Scope 1, 2 and 3 emissions to address the evolving disclosure needs of investors and other stakeholders. In 2022, our percentage of minorities and women increased to 53% and 28% respectively. One of the biggest priorities for our teams was to support the employees at San Juan through the plant closure and to ensure these team members left with dignity, pride and resources for their future. We've provided career counseling and transition training, benefit reviews and retirement planning. Ultimately, half the employees in the last years of the plant receive severance payment at around 75% of those were also retirement eligible. At the same time, we continue to expand upon our educational support for the native American population in the state, funding and endowment specific to Pueblo students looking to continue their education at the next level. Both of these programs serve to strengthen New Mexico, those future workforce and then also provide a fresh perspective and contribute to the diversity of thought. I'll start on Slide 7 with our load growth by service area, with PNM first. For most of 2022, we saw residential and commercial load growth above our expectations, while industrial customer expansions were delayed by supply chain and related market issues. Our operations in North Central Texas and the Gulf Coast, provides strong geographic and economic diversity to TNMP, and each of those areas support a mix of business operations and growing residential and commercial communities surrounding the nearby larger cities. For 2023, volumetric growth is expected at 2% to 3% consistent with the full-year results of 2022. The closure of San Juan Generating Station this year was a significant step in achieving these goals, reducing the amount of coal in our portfolio and advancing us to 55% carbon free capacity. Our next big step is exit of our ownership stake in Four Corners Power Plant and completely eliminate coal generation from our portfolio, which we are still pursuing for the end of 2024. As you can see in the pie charts, we are replacing these resources with renewable and batteries storage after working through the 2022 delays for PPA developers, we expect 350 megawatts of solar and 170 megawatts of battery storage coming online in 2023. And with our continued ownership of Palo Verde, we will hit 61% carbon free capacity. These changes provide significant benefits for the environment and our communities and also financial benefits for customers, which I'll cover in a minute. The peak demand on our system has been growing at a faster rate than our total load and we hit a new system peak in 2022, our first since 2013. Our focus has been on strengthening the infrastructure that directly serves customers, substations in lines are being reconfigured to accommodate new customers along with customer owned resources. When we look ahead, we see the need for expansion of our system, our change in generation resources, means that transmission capacity tied to existing plants can be used for the replacement options. But as the resource needs grow beyond these replacements, new transmission capacity will be needed to facilitate additional resources across the state. As Pat mentioned, in December, we filed our first PNM rate review in six years. PNM customers already benefit from having lower bills and much of the country and we worked to balance the need for investments in our system with the impacts on customers, The Energy Transition Act was designed to facilitate the transition to clean energy while reducing cost to customers and this rate filing showed that it is working as intended. The filing in -- the filing is a 2024 future test year, so it rolls forward our rate base for the full six years and incorporates current cost trends. The retirement of San Juan and the return of the Palo Verde leases reduces the requested recovery in base rates and also reduces the cost recovered through our fuel cost, as replacement resources come online. The procedural schedule in this case calls for intervener testimony, seller settlement filing by May 12 and hearings scheduled in June. Remember that we have asked for approval of our project plan by July 1 of this year, but we delayed our requested implementation date of the rate rider until September 1, so that it would not be added to summer bills this summer, when the usage is typically higher. We also prioritized low income customers and communities in our filing, these are the customers most in need of tools to manage their usage and bills and it also makes sense to bring improvements to these areas first. Also in March, the New Mexico Supreme Court has scheduled oral arguments and our proposed exit from Four Corners Power Plant in December of 2021, the commission rejected our filing to exit our ownership share of the plant and securitize our undepreciated investments. In January, we made our first transmission filing for 2023 requesting over 150 million of project cleared by December of last year, We would expect to recovery to be approved and implemented by March of this year. I'll start on Slide 12, with a summary of the changes in 2022 earnings compared to 2021. Earnings per share grew $2.45 in 2021 to $2.69 in 2022, as we have also been taking care of business on the financial side. Usage was up at both PNM and TNMP due to both load growth and weather, particularly as TNMP as crypto currency mining enter the market in West Texas. These increases served to offset expenses at the utilities for depreciation, property tax and interest associated with our rate base investments along with increases to our planned O&M spending. To be clear, the decommissioning trust along with our pension plans remain well funded, despite the challenging market conditions in 2022 and we don't anticipate making any cash contributions to these trust in the near future. As Pat mentioned, we have narrowed our guidance range to $2.65 to $2.75 per share. Given the growth we've seen in Texas and New Mexico in 2022, we brought up the bottom end of the range to $2.65. In terms of our load, our guidance assumes a return to more normal weather conditions, which is partially offset by load growth at both PNM and TNMP. At PNM cost reductions from the retirement of the San Juan Generating Station and return of the Palo Verde leases, net of replacement power costs offsets depreciation, property tax and interest expenses associated with new investments. At TNMP, rate recovery through the TCOS and DCOS riders cover cost increases associated with new investments as we continue to expand our system for increasing demand and economic growth. At PNM, we don't expect the realized market losses on our decommissioning and reclamation trust to repeat in 2023. And at corporate, we have assumed higher interest expense to reflect the current interest rate environment, including $850 million of swaps we entered into last year to mitigate our exposure until we reduce our variable debt levels, either through successful merger or putting more permanent financing in place. We continue to assume we add up to $200 million of equity in 2023, which would have a dilution impact on EPS at each of our segments, shown in the appendix slides. Our full guidance range accounts for various timing assumptions with the potential impact of up to $0.08 for the year, translating into a $0.04 impact to the guidance midpoint. At PNM, investments and infrastructure support retail customer growth and replace the rate base that is removed as we transition out of coal. We've been able to defer rate increases for our customers, while continuing to earn our authorized returns. The details of our spending beyond 2025 will be provided later this year, but we're comfortable we can continue our growth target of 5%. Slide 15, shows our growth target and historical achievements. Growth isn't linear every year because of factors like weather, timing of regulatory filings or market conditions, but we remain focused on the long-term view. In December the Board of Directors raised our annual dividend to $1.47, a 5% -- 5.8% increase, with a payout ratio of 54% of our 2023 guidance midpoint. Before I open it up for questions, I would like to thank our team members in New Mexico and Texas for the great work they did in 2022 and continue to do in 2023 to take care of each other, our customers, our communities and the environment. The first one, I saw the comment about the additional equity potentially in the second half of '23. So we always target between 13 and 16% and,  2022 was just around 14%. I know you mentioned some actions you took with the fund managers in 2022, could you explain what are the assumptions that you embedded in the performance for 2023. So we just -- 2022 was really a bad year, we're 75% fixed income and 25% equity in that NDT trust. And correct me if Iâ\u0080\u0099m wrong, I think if it's just kind of flat market conditions. Wouldn't that just be like, unchanged year-over-year. So if you remember, regarding our NDT, so when we have realized gains or losses in the NDT Trust, it will flow through the income statement and unrealized will not be part of the ongoing. So as a result, last year we had a lot of realized losses because fixed income manager in particular changed their portfolio and so they realized losses during the year and we don't anticipate that in next year. No, we don't, Paul, but we do plan to issue like we said before, up to $200 million of equity. Not sure exactly what would trigger re-filing, so... And any color around dividend policy in the interim, pending -- pending this potential application being executed on -- there any ongoing conversations around any dividends changes? Jonathan, right now, we need to wait to see what the commission has done in their sessions, if anything. And so right now, we're going to holding pattern, looking forward to hearing about their deliberations and any outcomes and that will determine what next steps are. No, I mean they have -- if you've listened to the meetings, they have reported on the fact that they have had closed sessions and delivery over the following matters and in particular on the merger case that commissioner, excuse me -- Chairman O'Connell has accused himself and they have deliberated on that. So that is all we have heard, I would assume, at some point in time they would report out on an open meeting, but it is -- there is no timetable for them to do that. And then I guess just given the passage of time and everything, are there additional concessions that might need to be made. Should we expect you to file, like a new settlement agreement that at least encapsulates the commitments that AVANGRID made after the last settlement was filed. I think, it's a couple of things, we have not heard that any of the interveners are not on board, we have not been actively talking to them about this and start about the rate case and grid mod. With them, and I'm going to speculate on the new application until we hear what the commission has to say, I mean that, that's really what we need to hear from -- what we need to hear before we decide next steps. I guess, I was a little confused on Slide 15, is the 5% long-term growth target is that off the midpoint of the '23 guidance $2.70, like a five year target or are you just kind of reiterating the 5% through 2025 off the 20 base? So, Jonathan, we are very pleased with this slide, you can see 6.7% CAGR from 2013 to 2023 and what we have said is that we're comfortable with in our growth target of 5%. We set out the growth target of 2022 to 2025 and we will provide details later in the year, but at this point we're comfortable with the 5% growth. We are comfortable with 2020 to 2025 percent and then as we look forward 5% is, we are comfortable with that growth target. And...\n And Jonathan, we have and if you look at our capital slide, we haven't updated our capital past 2025. So when we do that, if we end up doing that, then we would -- we would go further on those numbers, but right now, 2025 is the furthest we have for our projections. And then last for me, expanding on the already to discuss financing needs in the merger scenario. But beyond 2023, we haven't exactly define what that's going to look like, but of course that will be something that we will do later in the year. So we really can't answer that one right now, because it requires a whole bunch of discussions with the Board and AVANGRID whether the appeal is still going on. Yes, you need with one commissioner recruiting himself, you need two of the two, if you get one on one at the tie-ins and it fails, so that's one thing. Next question is the Supreme Court remanding it back today, they haven't helped arguments, they haven't briefed, they haven't done anything. But what we would need to do is, before the consider it again, it's now in the Supreme Court, we would have to ask with the commission for it to come back, and the Supreme Court would have to consider that case, but we would need both parties or I should say all parties to ask for it back from the court."
}