{
    "symbol": "BX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 12:30:22",
    "content": " We raised a remarkable $88 billion of inflows, that's $88 billion of inflows in the quarter in the midst of the market chaos, our second highest quarter ever and equal ironically to Blackstone's total AUM at the time of our IPO in 2007. We launched fundraising for our new global real estate flagship in March, targeting $30.3 billion, which is 50% larger than its predecessor and would represent the largest private equity or real estate private equity drawdown fund ever raised. At our Investor Day in 2018, we first shared the message about a meaningful step-up in earnings power, driven by the combination of first the drawdown fundraising cycle, at the time consisting of five flagships targeting $60 billion; and second, the growing contribution of our perpetual capital platform. Combined with $347 million of fee-related performance revenues in the second quarter, generated by a variety of perpetual vehicles, total fee revenues exceeded $1.9 billion up 51% year-over-year. Distributable earnings increased 86% year-over-year, to $2.0 billion in the second quarter or $1.49 per share driven by strong growth in both FRE and net realizations. Indeed perpetual strategies now comprise 45% of the firm's total performance revenue eligible AUM in the ground or $219 billion, reflecting a model that is less and less dependent on asset sales. I know you called out the fundraising cycle adding maybe, I think, it was 20% alone to FRE from -- I'm assuming that's current run rates, but could you maybe break that down like, if you had -- how we should think of it from base fees versus fee-related performance revenues. And then, I would just -- without putting more numbers to it, go back to what I said in my remarks, which is, I think certainly qualitatively as we look at it and in terms of sort of the mix of it, there are parallels to the position we're in, which is very favorable as it relates to uplift from the cycle of fundraising and also perpetual capital, both in terms of growth and the base. And I guess I would just say there was -- we've talked generally about the environment and everybody's focused on this month quarter, I just cannot emphasize enough the strength of our brand and what it allows us to do to create new retail products to do things in insurance on a capital-light basis."
}