{
    "symbol": "HUN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 14:00:30",
    "content": " As we sit here today, we expect polyurethanes adjusted EBITDA for the fourth quarter to be in the range of $55 million to $85 million and below 10% margins due to European market conditions. We expect this year will include lower demand in Europe and above-average customer deinventorying in the U.S. As a result, we would expect Performance Products fourth quarter adjusted EBITDA to be in the range of $60 million to $80 million with around a 20% margin. Advanced Materials reported adjusted EBITDA of $58 million in the quarter, a 21% increase over last year's third quarter. In terms of our $240 million program, we expect approximately $65 million of cash costs in 2022 and we're expecting approximately $70 million of cash costs next year as we work through severance and restructuring. As we have said in the past, every dollar of movement per MMBtu of gas costs of our European business is a cost of around $10 million per year depending on utilization rates. And then you commented on under-absorption rates given the efforts that we're making to align inventory with end markets, you can assume about a $15 million to $20 million negative impact between Q3 and Q4 from what we're trying to achieve by matching production with the end market situation. And when I said in my comments, we're speaking with a lot of our customers, I think that over the course of the next year or two, you're going to see quite a few customers moving production, European production, particularly in areas of aerospace, automotive and so forth to either China or more likely to North America and then reexporting, if you will, that product back into North America. We would expect to see a fairly sizable net working capital inflow in the fourth quarter, particularly with everything that we're doing around production rates and given that end market conditions are deteriorating, both through some demand destruction and through some seasonality. But in terms of being able to deliver $100 million plus of free cash flow in the fourth quarter, we would certainly hope that we're on target for that."
}