{
    "symbol": "HUN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 19:03:01",
    "content": " Adjusted EBITDA for our Polyurethanes division in the second quarter was $229 million compared to $208 million of a year ago, a 10% increase. Huntsman Building Solutions platform recorded second quarter revenues of approximately $154 million, up 16% year-over-year, driven by pricing. As we sit here today, we expect polyurethanes additional EBITDA for the third quarter -- excuse me, polyurethanes adjusted EBITDA for the third quarter to be in the range of $170 million to $200 million. That said, we currently expect another strong quarter from Performance Products with third quarter adjusted EBITDA in the range of $130 million to $140 million, solidly above the prior year. Our Advanced Materials division reported adjusted EBITDA of $67 million in the quarter, significantly above last year's second quarter and equal to the strongest quarter in the division's history. Adjusted EBITDA increased by $98 million to $432 million, an increase of 29% compared to the second quarter of 2021. As Peter highlighted, during the second quarter, we did benefit from an insurance settlement within our Polyurethanes division, which increased our adjusted EBITDA by approximately $15 million. Through the first 6 months of the year, the impact from FX on our results was approximately $30 million, assuming a USD  to euro rate in quarter 3, the estimated FX impact on our quarter 3 adjusted EBITDA results would be approximately $20 million. During these past 2 weeks, European gas prices moved nearly 20% upwards costing us in excess of $100 million on an annualized basis of added cost. When we factor all of these things, which you rarely talked about in these calls, but when you start factoring all of those issues, even if you're earning the same margin in many of those markets as you are in, for example, in North America, your actual netback -- the natural value that's being created, in some cases, drops from what otherwise would be a 20% margin down to a mid- to low single-digit margin, I don't see this changing. But again, as I just look at the volatility of gas pricing over the last 2 weeks, we're seeing on an annualized basis far greater than $20 million, $30 million, $40 million of value movement just on natural gas. That would be one of the addition to make polyurethanes, obviously, has our largest exposure in Europe from a division perspective and with the euro having weakened even further, you've got an impact of about $5 million to $10 million between quarter 2 and quarter 3 to consider. And so as we look at the industry structure, as we look at the diversification of the downstream applications and as we look at the pricing over volume strategy that we have, yes, I think that we're going to -- I think that on average, over the course of the next 5 or 10 years versus the last 5 or 10 years, we would hope that there would be not just better margins, but more reliable and less volatile margins. I would hope that as we look at the improvements that we see in aerospace, let's remember that during the pandemic that we were down -- pushing about $50 million of EBITDA from where we were -- to the beginning of the pandemic to where we were at the depths of the pandemic."
}