{
    "symbol": "LGO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 16:26:08",
    "content": " I would now like to hand the conference over to your speaker today, Alex Guthrie, Senior Manager of External Relations. Good morning, everyone, and thanks for joining our fourth quarter and annual 2022 earnings conference call and webcast. On the call today is Daniel Tellechea, Largo's Interim CEO and Director; Ernest Cleave, Largo's Chief Financial Officer; and Paul Vollant, Largo's VP of Commercial. To accompany the call today, we've uploaded a supplemental webcast presentation, which is available on our website at largoinc.com. Before continuing the call, I would like to remind you all that some of the information you will hear during today's discussion will consist of forward-looking statements, including, without limitation, those regarding future business outlook. Daniel will provide an update on the company's Q4 and year-end progress with an outlook for the year ahead, followed by Ernest who will provide an overview of our fourth quarter and annual financial results, and Paul will close the call with an update on the Company's Sales and Trading progress the vanadium market and an update on Largo Physical Vanadium. As you know, we're going to be discussing our fourth quarter and year 2022 results today. In Q4 we produced just over 2,000 metric tonnes of V205 at a cash cost excluding royalties of $5.15 per pound. As we noted previously in our pre-reported operational update in January, Q4 production was heavily affected by abnormally high rainfall in December, which flooded the beat and made it difficult to access for ore.  With typical have sufficient stock piles to have assist with unexpected impacts to the various checkpoints along our operational route. This impacts when combined with preventive and corrective maintenance on the plant facility in Q1 â\u0080\u009922 and the plant kiln and cooler refractory refurbishment in Q3 â\u0080\u009922 made for a less and favorable annual production of just over 10,400 tonnes of V205 at an annual cash operating costs excluding royalties were $5.57 per pound. Unfortunately, down spills affect from the rainfall in December, continue to impact production in January and February. Despite these impacts, we expect to remain in line with the quarterly production guidance for Q1 2023, likely landing closer to the mid-point of 2050 tonnes or just under. Since, I start consuming the role of Interim CEO by mid-last month, I have spent a fair bit of time with our operations team in Maracas. We expect a 10% increase in production in 2023 over 2022, which includes an aggressive high-purity vanadium production plan to meet the increased demand and expect to sell over 25 of our production into this sector in 2023. To support this production growth, management changes have been implemented in Maracas, including the promotion of Mr. Alvaro Resende from Operations Director to COO of our Brazilian operations and projects. Cost management is a tough priority for Largo, and we expect cash cost, including royalties to decrease as the year progresses. Due to elevated operating costs and working capital requirements as well as growth CapEx related to our ilmenite plant, we secured additional working capital facilities in December and January to effectively manage our cash needs during this -- the first half of the year. However, we are in the process of implementing cost control procedures, including an analysis of productivity to identify areas of business where we can reduce costs and improve performance. Today, we're already seeing distribution costs ease and expect to recognize some additional cost savings on some of our key consumables this year. We also remain on track with the completion of our inaugural BRF deployment for Enel Green Power in Spain and shipped the remaining six of 12 electrolyte storage container in early 2023, provisional acceptance, which include the completion of our operational testing by Enel is expected to be completed by the end of May 2023. Also, as Largo Clean Energy and Ansaldo Green Tech continues to focus on the formation of a joint venture for the manufacture and commercial deployment of VRFBs in the Europe, Africa and Middle East power generation market, as noted in our operational update in January, the company previously announced MOU has been extended to March 31, 2023, to allow for the negotiation and enter into a joint venture and other ancillary agreements. As you are aware, we have encountered some delays with this deployment, but they were confident that with this battery -- first battery project will be a crucial step forward for our Clean Energy business. With one of our most advanced VRFB technologies and a technical team that is among the most knowledgeable in the industry, we are confident that we have one of the best loan duration solutions in the world. I think it is important to note that we continue to receive and address various inquiries of our product from significant players in the sector, both in the U.S. and in Europe. Lastly, I want to touch on Largo continues focus on ESG principles at the company. We continue to improve our overall ESG performance and public disclosure in 2022, and this is reflected in additional improved ratings and scores. This is most evident in our Standard & Poor's global CSA rating, having improved approximately by 38% placing the company in the top quartile of its mining peer group for 2022. This year, I believe Largo is an inflection point as our production began strengthening and more of our units are placed in the premium markets. Our Clean Energy division continued its focus on delivering our first VRFB in Spain, which will -- which we believe will unlock additional potential or additional deployments in the future. This time at an opportune time as vanadium demand remains quite strong the long-term market fundamentals for the commodity looks extremely attractive, driven by the recursion in demand from the aerospace sector and from new deployments and capacity addition for new deployment of VRFBs. As we embark on the next chapter of Largo, I am confident we have the right team in place, and I look forward to assisting the company in advancing our strategy, while the Board continues its search for a permanent CEO. Underpinned by significant growth in vanadium demand as we continue the execution on our two-pillar strategy as a Tier 1 vanadium supplier with an emerging clean energy business, I sincerely believe that the we will close the valuation gap for Largo and offer considerable upside opportunity for new and existing shareholders of the company. With that, let me turn the call over to our CFO, Ernest Cleave, to review our financial performance for the quarter and the year. The year was marked by favorable increases in vanadium prices, which led to top line growth of 16% in 2022 over 2021, particularly driven by revenues recognized in Q2 of last year. In 2022, revenues per pound sold were $9.38, and that represents a 19% increase over 2021. In Q4 of 2022, we generated $47.5 million in revenues from the sale of 2,772 tonnes of V205 equivalent or $7.77 per pound sold. Revenues decreased around 6% when compared with Q4 2021, while revenues per pound sold were largely in line with the same comparative period last year. I think last year can really be defined by costs, both from an inflationary perspective but also from increases and operational impacts and write-downs throughout the year. For 2022, operating costs increased 28% to approximately $170 million. The increase in direct mine and production costs were largely driven by increases in our critical consumables and including HFO ammonium sulfate and sodium carbonate, which was fairly compounded by the increased consumption of these critical consumables, due to operational impacts throughout the year. As Daniel mentioned earlier, as we move through the year and our unit costs should begin to decrease, ending closer to the lower range of our guidance by year end. For 2022, I think what's important to note is that the company's core mining business was profitable with net income of $23.5 million. The company incurred various non-reoccurring expenditures of around $15 million, including approximately $5.1 million in legal provisions and approximately $6.4 million, which related to an inventory write down at LCE. The increase in legal provisions relates to a supply agreement for the Maracas mentioned mine, which was filed with the court's way back in October, 2014, and the ruling requires the company to pay amounts due, plus interest in legal fees. Additionally, the company wrote down battery component inventory to the expected net realizable value, which relates to our first VRFP project at our Clean Energy Division. As Daniel mentioned, this is the case for most first-time endeavours and is not uncommon in this particular sector as these type of demonstration projects generally exhibits learning opportunities and development growth. Moving to Slide 11, we plan to invest approximately $50 million on capital expenditures in 2023, including $13 million to $14 million on sustaining CapEx, $12 million to $13 million on capitalized stripping, and $17.5 million to $18.5 million on completing the ilmenite plant. We've also allocated a few million dollars to purchase an additional dry magnetic separator, which will provide greater throughput and flexibility in the processing of ores. Cash at year-end was approximately $54 million, with debt of $40 million and a net working capital surplus of $116 million. Subsequent to year-end, we acquired additional debt of $25 million, as was described in the annual financial statements. At this time, we continue to explore alternative debt financing or strategic association options with advisers, and we will provide an update as things progress. Annual sales were within our revised guidance range and we sold 11,091 tonnes of V205 equivalent in 2022, which included 1,057 tonnes of purchase materials. Sales for the year are down slightly compared to 2021, largely due to production impact throughout the year. As Ernest mentioned, our purchased product sales increased this year quite significantly in order to meet contractual obligations. However, as we begin to normalize production level, and expect purchase product sales to be lower in 2023. And as of today, the benchmark price for V205 in Europe is trading just below $11 per pound. This compares to about $9.50 at the end of the previous year, and a 44% increase from the lows of 2022. We're in an advantageous position as a key supplier of both high-grade V205 and V203 and are able to place more units in this sector, so as to benefit from the associated price premiums. However, the most significant change in consumption and future expectations is coming from the energy storage industry, especially in China, where new BRP deployments could total around two-gigawatt hour or approximately 10% of global vanadium output in 2023. Additionally, recent announcements from China also indicate the potential for new VRFB manufacturing capacity of around 20-gigawatt hour over the coming years. As Daniel mentioned, Largo itself is at an inflection point, but I have to add that the vanadium industry is also at one as well. To supply this energy storage capacity and maintain the current level of consumption in our traditional markets, the vanadium industry would have to grow by over 100% over that period. Already, according to vanadium, a global vanadium organization, the VRFB sector was the second largest source of vanadium demand just after still in Q3 2022. From that point until the end of 2021, there have been approximately 400-megawatt hours of VRFB installed across the globe. In 2022 alone, there was another 400-megawatt hours of ERP deployment, essentially doubling deployments in one year than all other deployments over the last 40 to 50 years. But more importantly, it is estimated that another 2-gigawatt hours of VRFB will be installed in 2023, representing another 2.5 times increase from the previous installation month. Historically, VRFB has accounted for approximately 1% to 2% of global vanadium consumption. In 2022, that number is estimated to be around 6%. And in 2023, it could represent more than 10% of global consumption. At Largo, we're extremely excited about it, and it gives strong credence to the VRFB commercialization story, but also support our Vanadium supplier pillar with additional sources of demand. Largo Physical Vanadium, or LPV. As we see, it's a truly innovative tool for investors seeking exposures to a key metal and will be a cornerstone to assist Largo in advancing its clean energy strategy. The launch of LPV in September 2022 coincided with lower vanadium price, which allowed us to purchase vanadium units at favorable market prices. As of March 8th, LPV's NAV is now CAD2.56 per share a 35% above the closing share price of CAD1.9 on the same day. Keeping the LPV app on, we believe our extreme not to share price discount offers current and new investors an attractive investment case and closing this disconnect is now LPVs key focus. Before moving into Q&A, I want to highlight Slide 14 that summarizes our key priorities for 2023. As I mentioned at the beginning of this call, the return of a normalized production level, cost control in advancing our clean energy divisions remains front and center in the ensuing year. With that, let's go ahead and open it up for questions. So, I just wanted to ask about Ansaldo and the potential partnership there a little bit more, to the degree that you can talk about it before an actual agreement is concluded. Ansaldo brings a number of things to the table, but not least of which is their industrial capacity, they're technical now, the know-how in the energy industry. It would be a traditional JV type structure, basically 50-50, where Ansaldo would fund some of the early development costs and start-up costs to some degree and after that point share equally in the operations of the business and its outcome. So, we think that the ability of Ansaldo to engender and enable our European business is very significant. But being in the Vanadium market every day, I'm very confident looking at the number. We have to think back about two, three quarters ago. Six months later, I think everyone in the industry is convinced that we'll be back to pre-COVID level this year. So, we really accelerated that recovery by two to three years, which is an extremely good news for us, a challenge to adapt, but definitely a great opportunity in front of us. The other outlier, as I mentioned during my part of the call is the growth in deployment of vanadium redox flow battery and the growth in capacity to build this battery has just been nothing short of the mailing. So, it's truly amazing growth. So yes, we I think the current price level are justified that there is nothing in the market that is telling us that things will be slowing down. And as I said, it's hard to predict where it's going to go, but we feel very comfortable with the state of demand at this stage. Yes, it's a very good question. So, it's really by far the largest market globally. But unless there's a significant change in supply structure, which no one thing can happen in the short term. And if China becomes a net importer in the quarters to come, it's a possibility. China over the past few years has been either marginal exporter or marginal importer, they very balanced market. It could be that the China becomes and as important, but we will see what happens in the coming quarters. But yes, China has a lot of vanadium resources, but if they need an extra more than 10% units, the structure of the market will have to change. In 2022, the company's net loss included about $15 million of nonrecurring stuff. Well, Heiko, at every reporting period, end of period, we would do NRV analysis on inventories, et cetera. And since I got you, anyway, I mean you gave a little bit of color on the ilmenite project earlier on this call, then everything is on track, everything is fine. But last year on the ilmenite side, we spent just shy of $19 million. And then remaining to be spent this year, we're looking at another $17.5 million to $18.5 million to be spent this year, relatively even, I guess, ultimately, between Q1 and Q2 because we're supposed to be up and running and selling ilmenite by Q3 of this year. I think it's a function of stockpile material and the actual progression through the pit at the time because we couldn't access higher-grade magnitude at the bottom of the pit due terrains, it had some impact. So, I wouldn't overstate it, but I'll hand it over to Daniel that may have some additional Color on this. So, when you mix the blending between the disseminated and the massive material, that's when you have an effect in the recovery at -- So that is something that they were working right now in order to keep the right blending and you can keep the right blending when you have these stockpiles, from when you can reach that combination of different materials. But sometimes recoveries are being affected, when you don't have the right blending. We had lower production as everyone is aware, in Q1 from the leftover impacts of the rainfall, but we are back up and running. And so, we're not predicting any variation of deviance from our far vanadium production. We produced B2O5 and send that off for conversion at fair vanadium converters, but the amount of ferrovanadium, let's say, that we are anticipating selling for the year is still roughly the same, no change. When we acquired the assets of one back in the day, some of the assets we acquired with some inventories of electrolyte. And so, we've actually used some of it in this particular project, but largely it's coming from LCEs on production. But so that's coming from the stop pass, if I understood correctly. So, the first stage of electrolyte production, we would send to third parties to produce the electrolyte from vanadium that we provide to them. So again, it's a mixed bag answer. It's basically just a very simple chemical process, the first part of the process. So, we send it to toll-converters right now because it's very cheap to do that. But if we wanted to spend a couple of million to buy some tanks and do some mixing ourselves, we could do so. But I was hoping if you could just ask broadly, if you could provide any color on quantifying the high demand in the aerospace market. just as it relates to the overall production capacity for the company, just trying to size up the potential to recognize the premium for the high-purity market in the total products sold. As I say, the Aerospace industry is expected to get back to pre-Covid levels this year. So about -- I would say, 10,000 to 12,000 tons of B20 equivalent required by this industry this year. Largo's total capacity -- nameplate capacity is around 12,000 tonnes. So essentially, I think with our entire production, we could cover the whole demand. We have a competition in the market, but I'm very confident that this year, Largo will be the largest supplier to the aerospace industry. So, it's our target we have the capacity in-house to supply close to the entire market, and we will do our best to perform in this market. Just trying to size up as you move forward with the clean energy business and getting close to servicing one deal potentially establishing the JV for other opportunities given the potential for long contracting for new opportunities in the space, just trying to get a sense of how you look at the progress in the clean energy business in terms of when you might expect recognition from the market as you continue to execute on that plan. So, we're very hopeful and anticipatory around our ability to enter into contracts at some point this year, but you would not see those contracts being delivered until earliest next year, and some of them maybe even two years out. But during that time, obviously, you would be constructing and involved in any number of those projects. And we're talking with other parties in the U.S. as well on potential projects as well, which are all ongoing. So, we have to bring some good news to the market in the future. Hi, Jim, there's no clear definition of high purity, but essentially, it's a grade that is above what is required by the steel industry. To your question on premium, as you can imagine, it is extremely confidential, very key aspects of our negotiation with our customers. What I can share, though, is that different customers have different specification in terms of V2O5 purity and also contaminant allowance. So, there is a fairly wide range depending on specific application in the aerospace chemical and Vanadium results flow battery applications. And the second question pertains is back to the electrolyte issue, because it seems that -- But the way you describe it is that, you are not really producing any electrolyte, but you are actually taking your vape, your V2O5 and you produce it, the MaracÃ¡s facility in Brazil. So, this the while, let's say, volumes are low, you wouldn't expand the capital cost to create your own mixing for the first stage, which is just producing the electrolyte. Again, it's a simple chemical process. So, we currently have a facility in Boston to do that, that's correct. So, you would likely, in the absence of having your own first stage of the process probably use of toll converters in whichever region your project is in. So, you would not send it back to Massachusetts and then back to the project, let's say, if it was in Europe, you would actually do the purification close to the project. So, logistics super important, but it would not go back and forth to our Wilmington facility -- that's just where we have it right now. You will save a lot of money, Jim, by doing the conversion close to the -- where the site of the project is otherwise you're moving liquid from Boston or from Brazil to the different places where you are building batteries in order to save cost, it's much better to have all this conversion of the electrolyte, what the project is. Your -- the first question is for Paul, and it's kind of a 2-part question. And then as we look back a couple of quarters before that, your realized price was higher than youâ\u0080\u0099re -- the market price for each of the last two quarters, and then it was lower this quarter. So, at the end of the day, over a long period of time, we follow exactly the trend, but we're just training. The second answer that I'd like to make, and you've said it some quarters, we make slightly lower and sometimes slightly higher than the published price. But depending on supply and demand situation from time to time, they vary. So, for V2O5 sales, we're getting a better price on a unit basis compared to ferrovanadium sales. Last year, ferrovanadium was trading at a premium to V2O5. If you're only looking at one index, it's difficult to give the full picture. We sell products in Asia, we sell product in the U.S. and all these regions have different pricing from time to time, very correlated over a long period of time. So, if you're only looking at one index or one product in one region, you don't always get the full picture. The product acquisition costs, it's something that you don't provide guidance on. It was $24 million in 2022, and that's $24 million that you're not getting margin on -- and I guess my question has two parts to it again is what is the amount of purchased inventory that you have on hand at 12/31. And at this point in time, I think you'd have a good feel as to how much purchased inventory you'd have in Q1. So, there is a cost for it, but you're earning the revenue at the same time. The only time that we do that is -- for instance, when we've run into issues on logistics, where there are delivery time lines that are different from what -- was anticipated. So last year, we actually made money on purchase material, but that wasn't our plan. It wasn't our plan to trade -- it just -- it was pure happenstance at the time that we purchased the product and sold it later, we've gotten again. So, I would not focus on it, and we certainly don't plan for it or budget for it. And if there is some unforeseen or untoward event that requires us to go and purchase in the market, we will do so. In terms of what's at hand at year-end, it's about 400 -- just over 400 tonnes right now. So, in theory, we look forward when we're preparing the year-end financial statements, we already know what we would have made on the material. So, it's not something that I would have investors focus on. It's not there is trading mechanism or a way for us to make additional profits, even though we may have made some profits last year on that. Also, we didn't have any purchases in the fourth quarter of last year. What is happening is that right now, we are just selling and disposing of the inventory we have from last year, and most of that will disappear in the first quarter or first four months of 2023."
}