{
    "symbol": "BTU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 14:39:05",
    "content": " In the PRB, for 2023, we have approximately 6 million to 8 million tons priced at $13.28 a ton, with an average BTU of 8,600 and our remaining uncommitted volumes of the higher-quality 8,800 BTU coal while our other U.S. thermal segment has 16.6 million tons priced at $46.80 a ton for 2023 delivery. Second quarter revenue was $1.3 billion, an 83% increase from the prior year as our diversified products continue to realize substantially higher prices with premium Australian thermal coal doing particularly well, recently achieving prices more than double premium hard coking coal. Turning now to the second quarter segment results; Seaborne Thermal generated $177 million of EBITDA, nearly double first quarter results due to higher realized prices and additional export sales, resulting in 50% EBITDA margins. Wilpinjong realized an average sales price of $85 per ton, 70% higher than the prior quarter due to stronger international prices and a higher mix of export tons. The Seaborne Met segment generated $300 million of EBITDA, more than $100 million higher than the first quarter as average realized prices of $331 per ton compared favorably to cost of $145, resulting in 56% EBITDA margins. The segment sold 1.6 million tons, about 33% more than the prior quarter as higher volume from the CMJV offset lower-than-expected production at Shoal Creek. The other U.S. thermal mines shipped 4.4 million tons as the Midwest mines increased sales 400,000 tons compared to the first quarter, and the segment reported higher EBITDA margins of 28%. We expect strong second half results from the segment based on 2.3 million export tons priced on average at $140 and about 2.4 million unpriced tons, including 800,000 tons, which are expected to price at Newcastle benchmark levels and 1.6 million tons expected to price in line with API 5 coal due to current coal quality and market conditions. Other U.S. thermal volume was raised 500,000 tons to 18.5 million tons or 19.5 million tons, while costs were increased $4 to reflect higher fuel, maintenance and other costs to achieve higher volumes."
}