{
    "symbol": "BTU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 15:33:08",
    "content": " First quarter coal sales were over $1 billion, a 58% increase from the prior year, a result of substantially higher realized prices from each of our operating segments. The seaborne thermal segment generated EBITDA of $91 million, less than the fourth quarter due to lower volumes and higher costs, and the delivery of 264,000 metric tons of Wambo coal at $84 per ton under the hedge program and 215,000 metric tons priced in 2021 on average at $116. The seaborne met segment generated EBITDA of $181 million, higher than the prior quarter as average realized prices of $258 per ton compared favorably to cost of $113 million, resulting in 56% EBITDA margins. The segment delivered expected volumes for the quarter of 1.2 million tons, about 500,000 tons less than full year ratable production due to the start of a longwall move at Metropolitan and mine sequencing at the CMJV. In the seaborne thermal segment, costs per ton for the full year are anticipated to be at the higher end of the guidance range due to production challenges in the first quarter, continued inflationary pressures and increased royalties due to higher anticipated prices. Based on price volume and more than 5 million export tons exposed to currently much higher spot prices, including 2 million tons of Newcastle benchmark coal and 3 million tons of higher ash Wilpinjong coal, stronger margins are expected for the remainder of the year. Second quarter seaborne thermal export sales are expected to increase to 2.2 million tons with 1.2 million tons priced at an average of $95 and 700,000 tons of higher ash product from Wilpinjong and 300,000 tons of Newcastle benchmark coal unpriced. So, the $418 that you booked on the 200,000 tons, that would be -- in this market, could be -- even a conservative indication of where you’d sell the remaining 1.4 million, given where prices have been quarter-to-date?"
}