{
    "symbol": "SNAP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 20:33:06",
    "content": "  Operator: Good afternoon, everyone, and welcome to Snap Inc.'s Fourth Quarter 2022 Earnings Conference Call. Please refer to our Investor Relations website at investor.snap.com to find today's press release, slides, investor letter and investor presentation. For more information about factors that may cause actual results to differ materially from forward-looking statements, please refer to the press release we issued today as well as risks described in our most recent Form 10-Q, particularly in the section titled Risk Factors. Today's call will include both, GAAP and non-GAAP measures. 2022 was a challenging year for our business as we continue to be impacted by macroeconomic headwinds, platform policy changes and increased competition. We've taken action to refocus our investments to support our three strategic priorities of growing our community and deepening their engagement with our products, accelerating and diversifying our revenue growth and investing in the future of augmented reality. We are focused on the most important inputs that we can control, delivering engaging experiences to Snapchatters and improving business outcomes for our advertising partners. We continue to drive strong growth in our community, ending the year at 375 million daily active users in Q4, an increase of 17% year-over-year. For example, in Q4, we released communities to expand our content offering on-boarded several new media partners, double down on our progress with spotlight and launch new Snapchat Plus features each of which helps drive engagement across our service. For the full year, we generated $4.6 billion of revenue up 12% year-over-year and generated $1.3 billion in the quarter or flat year-over-year, reflecting the rapid deceleration in digital advertising growth. Direct response advertising is a critical way that many companies grow their businesses, as it is one of the most performant and measurable forms of advertising. We have made progress updating and improving our ad platform over the past year across three key areas, investing in observability and measurement, improving engagement and conversion quality, and increasing the volume of high-quality engagements and conversions. In the very near term, it will take time for these improvements to translate into improved top-line growth. Over the long term, we believe that delivering higher return on advertising spend and utilizing our inventory more efficiently are critical inputs to gaining share of wallet accelerating revenue growth and realizing the full ARPU potential of our business. Over the last decade, we have made significant advances to our AR software and hardware that have enabled the growth of the sophisticated AR platform that we have today. Over 250 million Snapchatters engage with augmented reality every day on average, and we are investing rapidly and thoughtfully in the future of AR to further expand our leadership position. We also generated $55 million of free cash flow in 2022, achieving our second consecutive year of positive free cash flow. 2022 brought significant challenges for our business and we have emerged with a highly engaged and growing community, a more focused team and cost structure a clear path to delivering sustained adjusted EBITDA profitability and positive free cash flow and a strong balance sheet with $3.9 billion in cash and marketable securities. We begin 2023 focused on executing against our three strategic priorities of growing our community and deepening their engagement with our products, accelerating and diversifying our revenue growth and investing in the future of augmented reality. Clearly, it's a tough environment for the digital economy overall. From our recent conversations with our partners, it seems like advertising demand hasn't really improved, but it hasn't gotten significantly worse, either. I mean, obviously, the brand spend is significantly reduced, like we saw in the quarter, but our direct response business continued to grow in Q4. And in general, it seems like our partners are just managing their spend very cautiously so that they can react quickly to any changes in the environment. I think as we look at Q1, the most significant impact thus far have really been the changes we're making to our ad platform. We shared a lot over the last year about our improvements to observability and measurability of conversions, things like our conversions API, or data cleanrooms, and multi-party computation, of course, our pixel implementation for e-commerce advertisers. I think we have made good progress there, conversion API adoption continues to grow nicely. And so some of the things we've shipped recently in Q1 at the beginning of the quarter are big changes to our in app UI, which we believe will help improve consideration because it aligns the ad UI with the more organic content experience. We've done a lot of work to improve our in-app Web View performance, which we believe can help contribute to improved conversions on the platform. We're also seeing stuff like higher dwell times, higher non-bounce rates, and higher third-party match rate. So overall, obviously, the results are early, but we're excited about these changes we are making. And then, what we're doing is, we're taking our machine learning models, and we're training them on these higher value conversions, which will hopefully help us scale the overall number of those conversions over time. But the net-net, the impact in the short-term is really, that advertisers are experiencing these higher value conversions, but there are fewer of them as our models retrain, and hopefully, as we progress through the quarter, we can improve and increase that volume overall. And obviously, in addition to larger advertisers, these changes really benefits smaller advertisers who are much more reliant on last click conversions for measurement, maybe because they haven't implemented our conversions API, or don't have a data cleanroom, for example. So, this I think, of course, is a near-term headwind to the business, but we're very excited about the long-term potential of these changes, and we're working really hard on it. So it looks like time spent on content globally was off, I think led by â\u0080\u0093\n My apologies, Mark has dropped. We're so excited about the opportunity around generative AI, it's a huge opportunity for us. I mean, some simple examples are like improving the resolution and clarity of a Snap after you capture it, or even much more extreme transformations or editing images or Snaps based on a text input. But, if we think longer term, five years, as you mentioned, this is going to be critical to the growth of augmented reality. So, today, if you look at AR, there's just a real limitation on what you can build an AR, because there's a limited number of 3D models that have been created by artists. And we can use generative AI to help build more of these 3D models very quickly, which can really unlock the full potential of AR and help people make their imagination real in the world. â\u0080\u009coh my gosh, there's a pirate ship and a big monster.â\u0080\u009d And we can bring those to life using generative art, which I think is really exciting. And then, of course, we're also thinking about how to integrate those tools into Lens Studio. One, I guess I want to just follow back on the initial topic of this, DR was up 4% in Q4, which is actually a pretty encouraging number. The changes you're making are going to drive that DR to go from, up forward to down something. I know you've heard a little bit about in the letter, but I think there's a lot of confusion of sort of why that inflection to the negative in DR as your sort of investing to improve it. And then, just on engagement, you made a comment that global time spent was up on content. Is that TikTok reels, Shorts, just any color on what's driving sort of the pressure on friends' stories in Q4 would be great. I think, at a high level on the DR business, as I mentioned, the key here is that we're really improving the overall value of those conversions. But, as a result of volume of those conversions has decreased as our models relearn on the conversions that were driving, and hopefully, obviously we can expand that volume over time. But it's also requiring advertisers to adapt, for example, so they need to see that increased volume show up, excuse me, that increased value show up in their third party measurement tools, for example. And so overall, that sort of disruption, and again, when you layer in, of course, the changes to the app UI, and even things like our sales reorg channel redesign this quarter, it's a lot all at once. But we know that that Q4 is critically important for our advertising partners, it's just vital to their businesses. And so we held a lot of those changes to Q1, and we're making them all at once. So they're disruptive, but I think the really exciting thing is that, it is having the intended impact in terms of value to advertisers. So, we're going to continue to work through it but again, the improvements we're seeing in terms of third-party match rates, dwell time, non-bounce rates that's all really exciting. And then, I think I said about content time spent so I'd say overall content viewers continue to grow content products, including Spotlight, friends' stories, creator stories, partner content. That's true in the U.S. as well where our content viewership is growing, and globally overall, time spent watching content on the platform continues to grow. So if you think about our investments here and what we're doing to re-accelerate time spent with content, the most important thing is really increasing Spotlight viewership and engagement. That was definitely a bright spot in the U.S. where time spent watching creator stories grew 10%, year-over-year in Q4. And then, we're making a lot of product improvements and innovations around friends' stories, including things like community stories, which we think are really valuable to our community. And then, lastly, obviously onboarding new media partners who are driving significant viewership and time spent as we shared in the letter. Over 5 billion Snaps created every day, and this network of close friends who really enjoy sharing videos across our platform. It's part of what's contributing to the great growth we're seeing, in spotlight. I guess one of the questions I have maybe I'm just not really understanding it, is the way to think about this, the value of the advertisers is going up, because in the near-term, you're sort of increasing the effective ad load. Just in terms of what we're seeing in terms of inventory and the experience there, what you're effectively seeing is we've had some growth of impressions just as we've invested in the creator stories product in particular, that's been very popular, both from posting, and from an engagement perspective. And you've seen that contribute, sounds fairly an ad load is driven by positive engagement with their product. And then in terms of, what we're seeing in sort of the overall ecosystem of the auction, what we're doing here is using our inventory significantly more efficiently. And all else being equal, we're seeing that do is translate into lower CPMs in the short-term. But the improvements that we're making to the DR platform and translating into longer dwell times, lower bounce rates, and some of the metrics that have been shared with you. Short earlier, really are improving the value of the auctions we're driving. So in the very near-term, this disruption comes through with the pressure on the supply and the disruption to the volumes that are being driven, but the value is clearly higher. So hopefully, that gives you a little bit more context on what's happening in the sort of supply demand environment there. It's like Evan talked about earlier, multi-party computation, scan and MMP. Add to that the changes that we made to the Web View and to the ad format, so we get better signal about how our customers are interacting with our product. We make changes in each of these products, as well as making changes -- customers make changes to their campaigns, and then we make changes to the ad format, we feed it into the ML and this sort of circle gives us better and better targeting over time, which we think still leads to better CPMs across the board and better ROAs for our customers. What's the -- I don't want to see, what's the holdup in monetizing spotlight, but I do kind of want to ask that, like -- what are the factors that you're looking for, that allow you to be a little bit more aggressive in monetizing what's clearly a really strong growth asset for you? I think for context, just to start, and I hinted at this a little earlier in the prior question. And just sort of put a finer point on that, we saw 8% impression growth in the most recent quarter, and that translated into a 9% decline in eCPM. And obviously, that's why so much focus is on improvement in the DR business so that we can utilize our inventory and monetize it, take share. In terms of Spotlight, though, to answer your question, specifically, we did share last quarter that we would be expanding the testing of Spotlight monetization. But in the testing, we've seen thus far, the yield we're getting on ad served in the Spotlight is equal to and in some cases, higher than the yield we're realizing currently for similar ads elsewhere in the app. But as I said earlier, given we are demand constrained, the urgency to ramp up monetization, there is limited and focusing on the advertiser and the customer experience is the most important thing in the very near-term. So it sounds like Evan earlier said, there's obviously some key areas to invest in, that will act as a headwind to margins, even as you exit '22 and go into '23. And then, there's elements of the business would improve on the back of the DR initiatives, as we move through 2023. I think to start off, when we approach the reprioritization, that we announced near the end of Q3, where we shared that we were going to be removing $500 million from the cash cost structure. I think it's important to just understand that we were very thoughtful in our approach about that, because we really wanted to achieve two goals. One is, we wanted to make sure that we were clearly building a path to adjusted EBITDA profitability and positive free cash flow, even at lower growth rates. So that we were fully funding the efforts to continue to grow our community and deepen engagement, the work that we're doing to improve our DR platform in order to accelerate revenue growth, as well as the efforts around diversifying our revenue growth just see with Snapchat plus. And then also, of course, being able to continue to invest in the long-term AR business. And so what you can see as we've been able to make sure that we have a cost structure that fully funds those three priorities, but we're still on track to deliver all of the $500 million in cost reduction. So then going forward, first, it's like, we remain long-term oriented when we're thinking about the investments in the business. And for example, we just made the investment in creator stories, obviously, a very compelling investment, immediately resulting in an 8% increase in inventory. What we have to do is remain one very disciplined on the aggregate cost structure, and very focused on prioritizing our investments to make sure that we maintain that path to adjusted EBITDA profitability and consistent free cash flow generation. It's now our third consecutive year of adjusted EBITDA profitability, second consecutive year of positive free cash flow. And that's important to controlling, our financial destiny going forward and making sure that we can fund the investments in the future of our business. So hopefully, that gives you a sense of like, where we are on the reprioritization of the cost structure and funding our priorities, but also how we're thinking about balancing that discipline going forward. Yes, we're incredibly excited about the momentum we're seeing around our messaging service, visual messaging is really core to the Snapchat experience, and what helps people connect with their friends and family, and of course, enhances their relationships. And of course, the work that we're doing in our camera, around augmented reality and helping our community express themselves with AR lenses and try and get new utility out of augmented reality with things like try on as well. And also things like the map, for example, as we mentioned, I believe in the letter, Q4 Snapchatters open places on the map more than twice as often as they did in Q4 of 2021. So, definitely a lot of strong growth engagement around the core product value of messaging and we're really optimistic about some of the new products we have come in around that as well. So at a high level, what we're seeing with friends' stories is that people still really want to watch stories from their close friends and their family. So some of that, for example, is creating entry points even in Discover, right, so that people can tap directly into Spotlight content from that four-tab content experience. And in addition, we're also helping drive folks to the Spotlight tab itself, especially. For example, if one of the creators they are following has posted a new Spotlight video, we can let folks know and bring them into spotlight that way. So that's, I think, kind of how we're thinking about driving more top of funnel to Spotlight at least in the near-term. As it pertains to revenue share with creators, we do a small amount of sort of content seating, for example, with sort of contests and things like that around Spotlight, but we have not yet rolled out sort of a large-scale revenue share. In fact, what we're seeing a lot of creators do is use Spotlight to get distribution for their stories, so to become discovered in Spotlight, drive people to subscribe to their creator stories where we then do revenue share with them. And that is actually, I think, quite beneficial both to our business and creators because that subscription model, it provides much more stable revenue for the creators. And I think that's something that they really value compared to Spotlight, which is a bit more hit driven. So if they've got a great hit video, they can use that to drive people to their story and then monetize that more durably over time and build that relationship with their audience."
}