{
    "symbol": "CL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 13:31:02",
    "content": " We talked obviously through the back half of this year, the need to continue to invest in Hillâ\u0080\u0099s business once we had more capacity coming online, and that has obviously started to happen in the fourth quarter, and we expect that to obviously continue as we move into 2023. And given the prolonged impact of COVID in China, particularly as it impacts travel retail, which were a significant portion of our businesses, we obviously then decided to rebase the outlook in years going forward and particularly 2023 in a much more conservative position to ensure that we can deliver on the growth aspects moving forward. Again, a double-digit growth in the quarter, thatâ\u0080\u0099s 27% growth on a two-year stack basis and we have delivered double-digit growth on the Hillâ\u0080\u0099s business 10 to 12 quarters and we feel with the capacity improvements that we have and obviously the continued increased investments that we feel we are in a very good position to deliver sustained profitable growth moving forward. Well, we didnâ\u0080\u0099t pull back on the advertising investment, obviously, that was down 20 basis on a percent to sales, but if you exclude Red Collar advertising was flat and on a local currency basis, Lauren, the advertising was up and that becomes fundamental to continue to build the momentum of the progress we have seen in 2022 to ensure that we deliver that continued momentum in 2023 and that was a very deliberate choice to sustain the investment moving through the quarter. Obviously, that was the higher -- that was some choices that we made, particularly around working capital investments, a little bit increase in inventories as we were dealing with some of the supply chain disruptions we saw from suppliers and our need to sustain the consumption growth that we had in the marketplace, particularly some of the stronger consumption growth, but obviously, inventory days came up as a consequence of that. CapEx was the other one, a deliberate choice for us, obviously, the growth that we have made -- the growth that we put into Hillâ\u0080\u0099s, and the investment and the significant increase in capital expenditures there and some of the increases that John mentioned earlier around sustainability, which we think are extremely important to position us for where the markets are moving forward."
}