{
    "symbol": "CL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 12:07:04",
    "content": " A lot of pricing as you can imagine going through, but if we come back to our overarching strategy and as we really laid out in the first quarter that we would be continuing to take pricing coupled with strong revenue growth management, but more importantly, accelerating our innovation cycle into those markets. We are very focused on executing our strategies in the marketplace and as we laid out again in early on the first quarter call that we would be taking a leading pricing in some of the markets, and ultimately, we expected given the inflation is impacting everyone, we would see competition follow as well and thatâ\u0080\u0099s been the case by and large around the world. Again, we highlighted that we were taking pricing and saw momentum build in the first quarter, and that continued as we mentioned in the first quarter call through April, and obviously, you see now with the performance of the North America business, a good performance overall. The pricing and innovation strategies and revenue growth management discipline that we have across the organization is clearly focused and tailored towards getting our teams equipped to find innovative ways to drive category growth, get value into the categories through pricing and other innovation initiatives and that will clearly be the roadmap moving forward. I call out China specifically where we are up as you saw in the prepared remarks, 600 basis points on our ecommerce share and thatâ\u0080\u0099s the largest ecommerce business we have in Oral Care across the world and thatâ\u0080\u0099s been driven through good premium innovation, a lot of good personalized marketing, getting into data driven decisions in terms of how we think about it. We talked about that in the first quarter call that we had a lot more focus against funding the growth given the unprecedented environment, and fortunately, the global productivity initiative that we put in place last year in anticipation of a more difficult marketplace, we are starting to see the benefits of that unfold this year. Science is inherent to all of our core categories, whether itâ\u0080\u0099s Oral Care, Skin Health and we use that platform to really drive innovation, drive superior consumer benefits and health benefits across the value chain and you are seeing that obviously translate into strong growth for that business. I mentioned earlier, Jason, that at least the last 13 weeks we have seen share growth in eight of our 1 categories, which again, I think, is the result of obviously the execution results we are getting in the marketplace, the innovation, working our promotions effectively in the marketplace and some of the new products that we put in place. Obviously an unprecedented environment around pricing, we will continue to be focused on revenue growth management, our funding the growth initiatives and our global productivity initiative as we go into the back half."
}