{
    "symbol": "EXK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 14:49:06",
    "content": " With us on today’s call we have Dan Dickson, Endeavour Silver’s CEO; Christine West, our CFO; and Don Gray, Endeavour’s Chief Operating Officer. Following Dan’s formal remarks, we will then open the call for questions. First, let’s talk about operations. Consolidated, Q1 production was up 4% year-over-year to 2 million silver equivalent ounces. And based on where we are mining this high grade ore, it’s expected to continue in the near-term. Ultimately, the first quarter puts us in great shape to achieve this year’s production guidance of between 6.7 to 7.6 million silver equivalent ounces. This bullion was sold throughout the first quarter at significantly higher prices than what we saw in December, which contributed to cash flow from operating activities of more than $22 million. As at March 31st, we had $151 million and no long-term debt aside from normal course equipment leases and working capital of $168 million. For the quarter, our all-in sustaining costs per ounce metrics were 5% higher than the previous year, just inside our guidance range of $20 to $21 per ounce. While this is an industry-wide issue that is expected to prevail throughout the course of the year, we are closely reviewing our purchasing practices to see where and how we can mitigate the impact. We are tracking two major milestones here in the second quarter, securing financing for Terronera and closing the Pitarrilla acquisition. In terms of our schedule, we are still expecting to complete commissioning in the first half of 2024, if we can secure the debt portion of the project financing by the end of this quarter. Last year, the Board approved $21 million to advance the Terronera project while we were working through this financing. We have another $9.5 million earmarked to spend at Terronera in the second quarter to complete earthworks, Phase 1 of detailed engineering and the commencement of the permanent camp construction. For us, Terronera is a game-changer, and it’s a very important part of our future. Situated in Durango State, Mexico, it’s one of the world’s largest undeveloped silver deposits and we believe has the potential to be a Tier 1 asset. We announced this acquisition in mid-January and expect it to close before the end of June, at which time work will immediately commence to define historical resources as a current resource, assess a number of targets and advance the project to an updated economic study. To close the transaction, we’re awaiting approval for the Mexican Federal Economic Competition Commission that’s expected imminently. To fund the cash portion, we completed a Bought Deal for $46 million in March. This equity raise, together with the strong operating cash flow this quarter, has really strengthened our balance sheet. I’m pleased to say that tomorrow, we will be releasing our 2021 sustainability report. I felt that quite interesting as a frustrated consumer who’s been trying to more or less do the same thing when I hire contractors and whatnot, obviously, on a much smaller scale. But, frankly, I’ve really had no or very little success because people have small show-up for jobs or just hold your stupid prices. I mean, I think some of the obvious areas where we can’t mitigate inflation pressures, and that’s on power costs, and we get most of our power from CFE, the Mexican Federal Commission of Electricity. The other -- our largest cost, and obviously, where it’s most difficult to get concessions is labor. And, at the end of the day, with our union contract at Bolañitos and Guanacevi are obviously you don’t never see wages come down. Where we can push is on contractors, but obviously, they’re seeing inflationary costs, but where we do have a little bit of power, it comes down to combining purchasing between Bolañitos and Guanacevi. And obviously, we’ve seen cost increases in cyanide and steel, and those are going to be prevalent because of the primary inputs. But we can get some purchasing power if we can combine that stuff, but we haven’t been overly successful to this date with much. And it’s obviously something that we’re looking at, and we’re going to build Terronera. And I think we’re very lucky on the Terronera front that we’ve sourced a lot of our equipment, a lot of our -- and we’ve gone through Sandvik and a lot of the equipment we purchased with regards to operating is actually already on site. But from an operations standpoint, again, it’s looking at purchasing more volumes that we can share between Bolañitos and Guanacevi and then hopefully, ultimately, Terronera when it comes on line. There is a fluctuation, and that’s from the mark-to-market on deferred share units that are paid to our Board. But ultimately, our G&A on a cash force and budgeted somewhere between $6 million and $8 million, so ultimately $7 million, and it’s pretty straight line. But in general, for the year, you kind of used $1.5 million to $2 million per quarter, it kind of gets you there. The biggest thing is COFECE, which is the commission against antitrust, and we’ve been going back and forth with them and submitting information on, ultimately, Endeavour Silver’s market share globally and in Mexico with regard to silver. And so, we’ve submitted all our documentation. So, it’s our belief we’ve completely answered all their questions. So, it’s now just getting through that process, which we actually think is quite imminent. But at this point, we’re just waiting for a regulatory approval. And I wondered if you could maybe distinguish a bit between the inflation rates you’re seeing in local currency versus on the U.S. dollar rate, and what percentage of your cost is approximately in local currency? So ultimately, we’re about 60% to 65% tied to the Mexican peso. Now last year, in 2021, the Mexican peso’s inflation rate was just shy of 6%. This year, it’s tracking a little bit higher than that, similar to what we’re seeing in Canada and the United States. But ultimately, it’s lining up to where the U.S. is. So, it’s not like the Mexican peso is running at a higher inflation rate impacting the Mexican peso, or given us less purchase with our peso. With oil prices being higher, Mexican peso generally does a little bit better because they are tied quite a bit. You’ve been shoring up financing, and congratulations on that. As I touched on, I mean, our working capital is $168 million as of March 31st. Of course, $35 million of that cash will be paid out to SSR when we close Pitarrilla. So, we’re still in a very strong cash position. Obviously, the big thing that’s coming down the pipe for us is a formal construction decision on Terronera. And right now, in our feasibility study, the Terronera initial CapEx is $175 million. But ultimately, you want to carry a float in the company and put in about $80 million to $90 million of debt on the book at a project loan financing ability. Carrying $80 million of debt on our balance sheet, I think, is very prudent for our shareholders. And ultimately, that’s where we’re going to go. So, as far as putting more powder on the balance sheet, it’s not at this time. I think, with the acquisition of Pitarrilla, with the construction coming of Terronera, we’re quite busy. Just a reminder that more is our Annual General Meeting of Shareholders, it’s being held at the Metropolitan Hotel in Vancouver at 10:00 a.m. We hope to see you there."
}