{
    "symbol": "VKTX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 19:35:02",
    "content": " We respect to our lead compounds, VK2809, we continued enrollment in the Phase 2b VOYAGE study, targeting patients with biopsy confirmed NASH and fibrosis and we expect to complete enrollment in this study in the second half of the year. The increase was primarily due to increased expenses related to legal services, stock based compensation and salaries and benefits. The increase in net loss and that loss per share for the three months ended June 30, 2022 was primarily due to the increase in research and development expenses, and general and administrative expenses noted previously, compared to the same period in 2021. The increase was primarily due to increased expenses related to legal services, stock based compensation and salaries and benefits. The results from the Phase 2a trial included data showing that dosing cohorts treated with VK2809 experienced up to 60% mean relative reductions in liver fat content and that 88% of patients receiving VK2809 experienced at least a 30% reduction in liver fat content, including all patients receiving five milligrams per day, the lowest dose in the study. Between now and year-end, we expect to announce the initial data from the Phase 1 study of our newest clinical compound VK2735, our internally developed program targeting dual activation of the GLP-1 and GIP receptors with potential applications in a range of metabolic disorders. We also expect to announce completion of enrollment in the voyage phase to be study evaluating VK2809 in patients with NASH and fibrosis, and we remain on track to announce in the first half of 2023 the results from our Phase 1b study evaluating VK0214 for the treatment of X-ALD. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. Assuming everything checks out in the Phase 1b study, as you kind of think about, mid stage or later stage programs, looking at the kinetics of charge appetite, you donâ\u0080\u0099t really see a plateau of weight loss until maybe six to nine months. You may now go ahead. You may now go ahead. You may now go ahead."
}