{
    "symbol": "VERU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-11 12:27:21",
    "content": " We conducted a successful Phase III COVID-19 clinical trial, which was a double-blind multicenter, multinational randomized two to one placebo-controlled study evaluating daily oral 9 milligram dose of Sabizabulin for up to 21 days versus placebo in 204 hospitalized moderate to severe COVID-19 patients with high risk for ARDS and death. On July 25, we announced that the United Kingdom's Medicines and Healthcare Products Regulatory Agency, the MHRA, considers that the currently available safety and efficacy data will support an expedited review of the marketing authorization application with the company's Sabizabulin treatment in the hospitalized COVID-19 patients and high risk for acute respiratory distress syndrome when the application is submitted. With Sabizabulin in U. S. commercial update, we have hired Joel Batten, as Executive Vice President, the General Manager of Veru's U.S. Infectious Disease Franchise effective May 23, 2022 and most recently Mr. Batten has been the head of the Respiratory Syncytial Virus, RSV franchise at Sobi North America, where he is responsible for Synagis business with revenue of approximately $600 million and a team of over 160 employees. Some of these planned clinical trials include a Phase III randomized placebo controlled efficacy and safety study of Sabizabulin for the treatment of severe -- for the treatment of COVID-19 hospitalized patients who are -- who threes, which means they're in the hospital at in trouble, but not on oxygen. For patients with greater than equal to 40% AR expression, we are actively enrolling a global Phase III ARTEST registration clinical trial in approximately 210 patients who evaluate the enobosarm monotherapy for third-line treatment of AR positive, ER positive, HER2-negative metastatic breast cancer. We are actively enrolling in a Phase III multicenter open label randomized active control registration ENABLAR-2 clinical study to evaluate the efficacy and safety of enobosarm and abemaciclib combination therapy versus an alternative estrogen blocking agent and subjects with AR positive, ER positive, HER2-negative metastatic breast cancer, who have failed first-line therapy with palbociclib, which is a CDK4s/6 inhibitor plus an estrogen blocking agent, who have greater than equal to 40% AR expression in their breast cancer tissue. So we're actively enrolling an open label randomized two to one multicenter Phase 3, VERACITY clinical study evaluating Sabizabulin 32 milligrams versus an alternative anti-receptor targeted agent for the treatment of chemotherapy naive man with metastatic castration resistant prostate cancer who have had tumor progression after previously receiving at least one androgen receptor targeted agent. Enrollment for the Phase 3 VERACITY clinical study is on track and we expect to enroll approximately 245 patients and 45 clinical centers in the U.S. Our second clinical study in prostate cancer is evaluating VERU-100, the GNRH antagonist three month depot formulation in a Phase 2 dose finding clinical study for the treatment of hormone sensitive advanced prostate cancer. The increase of $12.1 million is primarily due to research and development costs, which increased $6.9 million to $18.1 million compared to $11.2 million in the prior year quarter, and the increase in selling general and administrative expenses of $5.2 million from $5.6 million to $10.8 million in the current period. The bottom line results for the first nine months of fiscal 2022 was a net loss of $42.8 million or $0.53 per diluted common share, compared to net income in the prior year period, which included the gain on sales PREBOOST of $11.7 million or $0.14 per alluded common share. The expected future revenues from Sabizabulin for COVID-19, the continued revenue from sales in the U.S. FC2 prescription business and global public sector business coupled with the expected future revenue from the launch of ENTADFI and added to our strong balance sheet should continue to be the source of funds we use for commercial activities and to invest in our promising pharmaceutical clinical development programs as we continue to focus on developing novel medicines for COVID-19 in other viral and ARDS related diseases, and for the management of breast and prostate cancers. In summary, we continue to advance our core deep late clinical stage, breast cancer and prostate cancer programs with three actively enrolling Phase III clinical studies and we have significant revenue generated more base sexual health business and have authorized, we expect to have substantial future revenue, Sabizabulin, 9 milligrams for hospitalized COVID-19 patients at risk ARDS."
}