{
    "symbol": "VERU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-12 12:20:03",
    "content": " While there have been recent emergency use authorizations for antiviral drugs  from Pfizer for the treatment of un-hospitalized patients with COVID-19 with less than five days of symptoms who have relatively lower risk of dying, Sabizabulin in contrast is being developed for hospitalized moderate to severe COVID-19 patients who had high risk of acute respiratory distress syndrome and death. We conducted a Phase III COVID-19 clinical trial, which was a double-blind multicenter, multinational randomized two to one placebo-controlled study evaluating daily oral nine milligram dose of Sabizabulin for up to 21 days versus placebo in approximately 210 hospitalized moderate to severe COVID-19 patients with high risk for ARDS and death. Therefore, FDA agreed that the request for EUA is supported by efficacy and safety data from our positive Phase III COVID-19 study in hospitalized moderate to severe COVID-19 patients with high risk of ARDS and no additional clinical studies are required to support a NDA submission. We are actively enrolling the Phase III multicenter open label randomized one-to-one active control registration of ENABLAR-2 clinical study to evaluate the efficacy and safety of Enobosarm and Abemaciclib in combination therapy versus an alternative estrogen-blocking agent in subjects with AR positive ER positive HER2-negative metastatic breast cancer who have failed first-line therapy with palbociclib, a CDK4/6 inhibitor plus an estrogen-blocking agent who have greater than or equal to 40% AR expression in a breast cancer tissue. The expected future revenues from Sabizabulin for COVID-19, the continued revenue from sales in the US FC2 prescription business and the global public sector business, coupled with the expected future revenue from the launch of ENTADFI and added to our strong balance sheet should continue to be the source of funds we use to invest in our promising pharmaceutical clinical development program as we continue to transform our company into a premium biopharmaceutical company focused on developing novel medicines for COVID-19 and other viral and ARDS related diseases, and for the management of breast and prostate cancers. In summary, we continue to advance our deep late clinical stage breast cancer and prostate cancer programs with three actively enrolling Phase III clinical studies and we will continue to grow revenue from our base sexual health business and if authorized the future revenues from Sabizabulin for hospitalized COVID-19 patients at risk for ARDS. And if you go back and look they have supportive care just like we do for COVID-19 for other virally induced ARDS and you have other than that they've got some antivirals and we already know antivirals are weak  which is an antiviral that’s being used in the pre-hospitalized setting was -- they had an IDMC meeting, an Independent Data Monitoring Committee meeting and the conclusion in that group -- that committee was, they stoped the study because there's no efficacy. So in prostate cancer between the 80 patients in the Phase 1b2 and then in the Phase -- and then in the Phase III I think we are able to count something like 250 patients that have been exposed to nine milligrams or higher, and in some cases, particularly in the cancer products they are getting 32 milligrams a day for three years."
}