{
    "symbol": "VERU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-09 14:26:03",
    "content": " The patients with greater than or equal to 40% androgen receptor expression, we are actively enrolling a global Phase III ARTEST registration clinical study to evaluate enobosarm monotherapy with a third-line treatment of AR+, ER+, HER2- metastatic breast cancer. We are conducting a Phase III multicenter international open label, randomized 1:1 ARTEST registration clinical trial to evaluate the efficacy and safety of enobosarm monotherapy versus an active comparative either exemestane plus or minus everolimus or a selective androgen receptor modulator for the treatment of AR+, ER+, HER2- metastatic breast cancer in approximately 210 patients with greater than or equal to AR expression in a breast cancer tissue who have previously received a nonsteroidal aromatase inhibitor, fulvestrant and a CDK4/6 inhibitor. Patients who have found to have less than 40% AR expression in their breast cancer tissue, we have a planned sister study, which is an open-label, multicenter, randomized 1:1 Phase IIb study evaluating the efficacy and safety sabizabulin 32 milligrams monotherapy versus the active comparative either exemestane +/- everolimus or SERM, for the treatment of ER+, AR+ metastatic breast cancer in approximately 200 patients who have previously received a non-steroidal aromatase inhibitor fulvestrant and a CDK4/6 inhibitor. Based on the positive Phase II clinical data and the preclinical data supporting the use of enobosarm in combination with the CDK4/6 inhibitor in patients who are CDK4/6 inhibitor, an estrogen-blocking agent resistant, we plan to conduct a Phase III multicenter, open-label, randomized 1:1 active control registration clinical study named ENABLAR-2, evaluate the efficacy and safety for enobosarm and abemaciclib combination therapy versus an alternative estrogen-blocking agent in subjects with AR+, ER+, HER2- metastatic breast cancer who have failed first line therapy with palbociclib, which is a CDK4/6 inhibitor, plus an estrogen-blocking agent and have greater than equal to 40% AR expression in their breast cancer tissue."
}