{
    "symbol": "VERU",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-05 10:57:06",
    "content": " We reported positive results from the Phase 3 COVID-19 clinical trial, which was a double-blind, multicenter, multinational randomized, 2:1, placebo controlled study evaluating daily oral 9 milligram dose of sabizabulin for up to 21 days versus placebo in 204 hospitalized moderate to severe COVID-19 patients who had high risk for ARDS and death. In the full final data set of 204 randomized patients, the all-cause mortality benefit was similar to the positive clinical results observed in the interim efficacy analysis population with sabizabulin treatment resulting in a 51.6% relative reduction in deaths compared to placebo treatment and that P value 0.0046. We're proud that the Phase 3 clinical treatment, clinical trial interim efficacy, and full study safety results were published in the New England Journal of Medicine evidenced in July, which recognizes both the importance of a trial focused on COVID-19 treatment during the ongoing pandemic and the potential clinical benefit of sabizabulin in hospitalized moderate to severe COVID-19 patients. As it relates to our ex-U.S. regulatory update on July 27, 2022, we announced at the European Medicine Agency, which is also known as EMA's Emergency Task Force, had informed the company that it has initiated a review of sabizabulin for the treatment of hospitalized COVID-19 patients at high-risk acute respiratory distress syndrome. With respect to the United Kingdom, on July 25, 2022, we announced that the UK's Medicine and Healthcare Products Regulatory Agency, again, also known as MHRA considers that the currently available safety and efficacy data will support an expedited review of the marketing authorization application for the company's sabizabulin treatment in hospitalized COVID-19 patients at high-risk acute respiratory distress syndrome when the application is submitted. We received an emergency use authorization from the U.S., EU or in another large market, we plan to initiate in a post-emergency use authorization setting, any potential additional clinical studies at regulatory agencies request to evaluate sabizabulin for the treatment of hospitalized, moderate-to-severe COVID-19 adult patients in high risk ARDS and death. We also plan to conduct a Phase 3 clinical study of sabizabulin for the treatment of hospitalized adult patients with viral ARDS, kind of  , which would include Respiratory Syncytial Virus, which alone causes 14,000 deaths and 177 hospitalizations each year in the U.S. As outlined above, sabizabulin has a novel anti-viral and anti-inflammatory agent is positioned to potentially become a valuable treatment option for multiple infectious diseases that can lead to ARDS, a life threatening lung condition that has a high mortality rate."
}