{
    "symbol": "KOF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 15:17:05",
    "content": "  Operator: Good morning everyone, and welcome to Coca-Cola FEMSA's Second Quarter 2022 Conference Call. During this conference call, management may discuss certain forward-looking statements concerning Coca-Cola FEMSA's future performance and should be considered as good faith estimates made by the company. Actual results are subject to future events and uncertainties, which can materially impact the company's actual performance. At this time, I would now like to turn the conference over to Jorge Collazo, Coca-Cola Femsaâ\u0080\u0099s Investor Relations Director. Joining us today is Constantino Spas, our Chief Financial Officer who will conduct todayâ\u0080\u0099s call. As usual, following prepared remarks, we will open the call up to take your questions. This solid volume growth, coupled with our pricing initiatives and mix recovery resulted in an impressive 19.9% top-line growth, while our operating cash flow increased by 6%. Additionally, when adjusting for the extraordinary one-time effects we recognized in 2021 related to tax credits in Brazil, our operating cash flow margin remained virtually flat. As we will discuss, during the quarter, we continue to executing against our key strategic initiatives. We continue accelerating the rollout of our omni-channel digital platform and developing a consumer-centric winning portfolio, specially focused on innovation and affordability. Together with the Coca-Cola Company, we continue executing against ambitious growth plans bolstering execution and investments across our markets. Aligned with our vision, we continue exploring complementary revenue streams as exemplified by our recently announced distribution agreement with Grupo Perfetti Van Melle in Brazil, one of the worldâ\u0080\u0099s largest manufacturers of confectionery and chewing gum. With our acquisition of CVI in Brazil, included in our results as of February 2022, I will refer to certain figures as comparable, which in the year-on-year comparison excluding M&A and currency translation effects. The growth was driven mainly by double-digit volume growth in Brazil, Argentina, Colombia, Guatemala and most of our territories in Central America. This growth was also driven by our operations, strong performance in Mexico and Uruguay. Once again, all of our categories posted accelerated volume growth as compared with the previous year. Our core sparkling beverage category grew 9%, driven by 8.5% growth in Brand Coca-Cola and 10.9% growth in flavors. To give you a sense, in Mexico, we saw growth in all of our channels underscored by double-digit growth in both the on-premise and modern trade channels with resilient performance in the traditional trade. In Brazil, the on-premise and traditional trade primarily drove our channel growth outperforming supermarkets. Importantly, despite inflationary pressures on consumers across our markets, our affordability and mix initiatives continued to drive single-served mix growth. Year-to-date, our single served mix in Mexico have increased 1.8 percentage points, reaching 29.8%. In Brazil, we are on track to reach 24% single served mix this year reaching and matching our 2019 baseline. On a consolidated basis, our single served mix has increased 2.1 percentage points to reach 31%. Additionally, we continue accelerating the roll outs of our universal returnable model to boost affordability and strengthen our revenue growth management capabilities. For example, we launched limited editions from Coca-Cola Creations in key markets such as the gaming inspired Coca-Cola Bites and we are now launching the new Grammy nominated artist on Coca-Cola Marshmallow, both of which include zero sugar options and are new ways of generating consumer engagements. Also during the quarter, the Coca-Cola Company announced plans to debut a Jack Danielâ\u0080\u0099s and Coca-Cola Ready to Drink Cocktail, which will be launched in Mexico in late 2022. Importantly, the new visual identity and formula of Coca-Cola zero sugar continues growing across all of our territories. For example, in Mexico, during the first half of the year, it achieved 26% growth, while in Brazil, it achieved 20% growth and now represents approximately 10% of the Coca-Cola brand volume mix in that country. On our consolidated total revenue growth, we accelerated, increasing 19.9% and 16.4% on a comparable basis. This growth was driven by our solid volume performance, coupled with our pricing initiatives, revenue growth management and favorable currency translation effects. Notably, we achieved solid top-line performance despite the decline in beer revenues, resulting from the transition of Heinekenâ\u0080\u0099s beer portfolio in Brazil. However, we are to normalize the effect of extraordinary one-time income we recognized during the second quarter of 2021 our gross margin would have contracted by 80 basis points. Our pricing initiatives, revenue growth management and favorable raw material hedging strategies partially mitigated high raw material costs, mostly from PET and sweetener costs across our territories. But again, by normalizing the previously mentioned one-time effects, our operating income margin would have expanded by 60 basis points reflecting our ability to achieve expense efficiencies across our operations. On a comparable basis, excluding M&A and currency translation effects, our operating income increased 1.8%. Finally, our operating cash flow for the quarter increased 6% year-over-year resulting in a operating cash flow margin of 18.5%. Moving on, our comprehensive financial results recorded a decrease of 56.6% as compared with the previous year. In accordance with IFRS 9, as of the second quarter, we are recognizing the hedging gain or loss on the debt instruments that are being hedged using interest rate derivatives. As a result, we are now recording a one-off gain in market value â\u0080\u0093 gain or loss in financial instruments of 653 million pesos corresponding to the first value â\u0080\u0093 to the first quarter of 2022, sorry, and offsetting the loss recognized in the previous quarter. Including this effect, for the second quarter of 2022, we are reporting a gain of 355 million pesos in market value and financial instruments. Additionally, our comprehensive financial results recorded a foreign exchange gain of 80 million pesos and a decline in our interest expense net, driven mainly by an increase in interest income. Mainly the result of these effects to our comprehensive financial results are, controlling net income, increase a solid 39.5% to reach 4.6 billion Mexican pesos during the second quarter. In Mexico, our volume growth accelerated increasing 7.2%, while our total revenues increased 13.1%. This was driven by solid performance across channels, coupled with the pricing initiatives and revenue growth management capabilities. In Central America, our operations continued to deliver a strong performance with 15.7% volume growth and 18% revenue growth, compared with the second quarter of 2021. Guatemala, Costa Rica, Nicaragua achieved double-digit volume growth during the quarter. As a result, our quarterly revenues in the division increased a solid 13.9%. On the profitability front, our gross profit increased 8.7%, which resulted in a gross profit margin of 47.8%. This represents a margin decrease of 230 basis points, as compared to the previous year. Our raw material hedging strategy has partially mitigated this contraction, driven by relevant raw material inflation, mainly from PET and sweeteners and higher concentrate costs in Mexico. As part of our mutually beneficial relationship with the Coca-Cola Company, an increase in concentrate cost for sparking beverages in Mexico became effective this month of July. Together with the Coca-Cola Company, we will continue to invest behind the market to continue driving growth. As was the case, during the first quarter, our focus on savings and efficiencies enabled us to mitigate the effect of higher freight and labor costs. As a result, our operating income in the division increased 11.6%. This was driven mainly by 15.6% growth in Brazil, which includes the consolidation of CVI, 25% growth in both Argentina and Colombia, while Uruguay delivered high-single-digit growth. On a comparable basis, excluding CVI in Brazil, volume in the division increased a solid 15.9%. Our revenue growth management capabilities, the affordability of our portfolio and a favorable translation effect of the Brazilian real into Mexican peso enabled us to increase our revenues in the division by 30.3%. If we exclude currency translation and M&A effects, our top-line would have increased 20% during the quarter. On the profitability front, our gross profit in South America increased 18.8%, while our gross margin contracted 370 basis points. However, excluding the effect of the extraordinary one-time recognition of tax effects in Brazil, our gross margin would have expanded, reflecting the positive effect of volume growth, favorable price mix effects and raw material hedging strategies. Finally, in the phase of the challenging comparison base, that includes the previously described one-time effects, our operating income for the division decreased 9%, mainly driven by higher freight and labor costs. Finally, our operating cash flow decreased 3.5% for the quarter. As John described during the previous earnings call, we have renewed our strategy under a new concept that we call Reevolution. This is based on six strategic corridors, building an omni-channel multi-category platform â\u0080\u0093 commercial platform, developing a consumer-centric winning portfolio, faster and agile digital savvy and people-centric culture, place sustainability at the heart of our organization, digitize our core and actively pursue value-enhancing acquisitions. Let me now provide you with an update on the first pillar, the build out and roll out of our omni-channel multi-category digital commercial platform. In Mexico, we reached approximately 290,000 active monthly buyers by the end of second quarter. So now more than 40%, four zero, of our total client base in Mexico is an active monthly buyer. Additionally, our direct-to-home platform in Mexico is progressing according to plan focusing on accelerating our digital transformation and continuing to increase order fulfillment to better serve our customers. Notably, during the quarter, we added more than 200 new home delivery routes to reach 320 routes added year-to-date. We move to Brazil, we now have more than 180,000 monthly digital buyers, which is close to 60% of our total client base and the percentage of digital orders has reached 40% of our total client base. In other markets, such Colombia, Costa Rica and Panama, we have also accelerated the roll out, notably, Colombia has reached an impressive 60% of monthly active digital buyers from our total client base, while Costa Rica and Panama are already close to 20%. In summary, on a consolidated level, we have reached more than 645,000 active digital monthly buyers, up 245,000 from 400,000 at the end of the first quarter of this year. Our digital revenues in June amounted to more than $90 million, more than a 50% increase from at the beginning of 2022. Second, we will continue leveraging our capabilities to increase our single served mix by leveraging multi-packs, increased cooler coverage and execution across our markets, we are confident that we will continue growing our single served mix. Third, we will continue leveraging our disciplined hedging strategies and our capabilities to generate savings and efficiencies across our territories. As we previously mentioned, we have hedged approximately 75% of our PET needs for 2022 in Mexico and more than 90% of our high fructose corn syrup needs. We have also hedged more than 35% of our aluminum needs, while in Brazil, we have hedged more than 75% of our sugar needs for the year. We remain confident that these hedges, coupled with our ability to segment our consumers and our revenue growth management capabilities will continue to enable us to substantially mitigate margin pressures and protect the profitability as we enter the second half of 2022. We are also investing to digitize our core thatâ\u0080\u0099s fundamental for the future of our platform and bringing a tremendous amount of transformation to our supply chain, which allows us to complement revenue growth management capabilities. As an example of these initiatives is dynamic routing, which provides us with the ability of flexible dispatching and has two important effects; an increase in productivity, and a reduction of our cost of deliveries. To this end, we are working to improve end-to-end last mile distribution focused on omni-channel customer experience and profit effectiveness. Building on the sustainability update, we provided during our previous earnings calls, we are proud to be recognized for the seventh consecutive as members of the FTSE4GOOD Latin American Emerging Markets index in recognition of Coca-Cola Femsaâ\u0080\u0099s leading sustainability practices. According to this index methodology, Coca-Cola Femsa ranks ahead of our other industry participants due to its environmental and social initiatives. This recognition not only reaffirms our sustainability commitments, but also provides us with a positive reinforcement to accelerate towards our long-term sustainability ambitions as we place sustainability at the heart of our organization. Finally, I want to underscore once again our solid financial position and the acceleration of investments in our company with a positive trend of results. Year-to-date, we have increased our CapEx by more than 65% as compared to the previous year, all this while returning cash to shareholders and maintaining a solid cash position of more than 45 billion Mexican pesos. Notably, during the quarter, both S&P and Moodyâ\u0080\u0099s rated Coca-Cola Femsaâ\u0080\u0099s credit rating above Mexico sovereign reflecting Coca-Cola Femsaâ\u0080\u0099s track record of outperformance during economic cycle downturns. Our ability to protect our profitability, as well as the marketsâ\u0080\u0099 trust in our prudent financial policies. As we enter the second half of the year, we remain confident that our capabilities to continue growing, accelerating and delivering results across all of our strategic fronts, and Coca-Cola Femsaâ\u0080\u0099s transformation is gaining speed and despite the economic environment I am very encouraged by Coca-Cola Femsaâ\u0080\u0099s capabilities to achieve our short-term and long-term objectives. Now operator, I would like to open the call for questions that both Jorge Collazo and myself will address. Thank you so much. First of all, volumes in Mexico were definitely benefited by a series of variables, right. At the same time, as we have mentioned during our remarks in previous calls, we are taking a very adequate, we believe revenue management growth strategy and pricing steps. All of our channels are growing, that is something that we also are starting to see. At the same time, there is some disrates, Fernando, in the market is about focusing on the strategy and executing it consistently over time. Itâ\u0080\u0099s also the compounding effect of great execution, great revenue growth management strategies and a focus on the long-term. But as of today, we continue to be positive on the consumer environment in Mexico and the category. No, Constantino, I think maybe adding to that no, the strong performance was very consistent throughout the quarter and even in May we achieved a record month for our Mexican operations. And also that consistency across regions in Mexico and as you know, itâ\u0080\u0099s something that in the past, sometimes we were seeing certain regions of Mexico outperforming others. What we saw in the quarter was very consistent across the board, across the regions in where we operate in Mexico, and from the center to also the south and southeast. So, that definitely, I think itâ\u0080\u0099s a proof of what you just mentioned, Constantino. Thank you so much. Thank you so much. I think that in our case, our operation continues to focus on driving growth and winning in the market that is the operations mandate. Definitely, we continue to be at early stages, not most of these pilots have not been scaled to a national level in most of the geographies where we are operating in. So, from that angle, we are extremely optimistic about our commercial platform and the ability to continue pushing at that front to be able to fulfill our ambition of becoming the worldâ\u0080\u0099s preferred commercial ecosystem in the future. Thank you so much. In terms of beer in Brazil, this is a recurring question quarter-after-quarter. After a decline of approximately 30% in beer revenues in 2021 due to the transition, the effect of this transition for 2022 as our portfolio gains traction, we expect beer revenues to decline somewhere between 15% to 20% in 2022 versus 2021. Now this is very important to highlight that when we put together, when we built this new portfolio with our partners, which by the way we are continuing to do. Now, building great brands doesnâ\u0080\u0099t happen overnight and in the case of beer in Brazil, it requires great brand building on one side and a fantastic commercial platform with great coverage and great execution at the same time. So, some of these brands will definitely behave more in an S curved shape and that is what we are seeing today. So we believe that in the two to three year timeframe, itâ\u0080\u0099s feasible to recover the volumes that we had before. We are building on brands that have very solid brand equity that just need expansion such as Eisenbahn, which is having great traction in Brazil and at the same time, brands that are totally new to the market such as Tiger, that we need to build, that needs to build in conjunction with the Heineken. The other one is all the alcoholic ready to drinks such as the Schweppes, alcoholic ready to drink sales in Brazil and Topo Chico Hard Seltzer in other markets. And finally, and to complement this, we are also starting to make interesting partnerships like the ones in Brazil and in Mexico so far with Yajo and with Campari in the case of Brazil and we are seeing interesting outcomes of the partnership in both markets so far and this is something that we will continue to push in the different geographies and channels where we think this is relevant and it is value-generating, not only to us, to the Coca-Cola portfolio, to the partners, but evidently and very importantly to the customers, right? So, itâ\u0080\u0099s a very holistic approach to alcoholic beverages with these three very different approaches and we will continue to push in that front. Yes, first of all, Alan, the â\u0080\u0093 itâ\u0080\u0099s a great, Iâ\u0080\u0099d say appreciation of what we are doing in our strategic thinking and thank you so much for the comments. In terms of our capital structure and cash position, I mean, first of all, as we mentioned in the remarks, we are heavily investing behind growth in the business. So far this year, we have invested 65% more CapEx behind the business and that is something that we believe is necessary as we have jointly looked at the market with the Coca-Cola Companies for the next five to ten years and we believe investing behind our core capabilities and the brands and our execution capabilities in the market is fundamental. Now evidently, when you look at inorganic growth and M&A options for the future, we are now seeing it also through the lens of the platform and this might entail not only continuing at the right price, with the right value, with the right strategic alignment to continue growing geographically by more consolidation of bottling capabilities in the system, but also at the same time looking at capabilities such as technological investments that we can do to enhance our platform for the future. And also, we are looking at different types of partnerships, right. We use to see the world as a 100% acquisitions, we are also looking at possibilities of different types of investments, right. So there is a lots going on, on that front and at the same time, we continue to review our capital structure and we will provide recommendations for our Board and for our shareholders whenever we think itâ\u0080\u0099s appropriate. One on Brazil, as we sort of defend the growth story here, Iâ\u0080\u0099d love to hear sort of more color on what you are seeing from clients very strong pricing over 20%, clearly the consumers willing to take it. What are you seeing from, sort of these on-premise clients and if you get to sort of paint a picture of the growth you are seeing there thatâ\u0080\u0099d be very, very helpful. Hey, Alvaro, so just to give you some color on channels, as I mentioned, there is strong pricing. In the case of Brazil, just to give you a sense of the growth, year-to-date versus the previous year, it has gained increase of 26%. So we are definitely seeing in the case of Brazil, these external factors with a defensive labor market, social programs combined with more mobility, recovery on these channels, so, but those has been its external factors. Now we continue to see very strong performance from CSBs coming from our affordability initiatives such as multi-packs, dual packs Coca-Cola zero sugar, also very interestingly not only in Brazil but across our markets. So itâ\u0080\u0099s a combination of, I would say, both internal and also the macro  \n Great. And then just a follow-up on Marcellaâ\u0080\u0099s question on unit economics around these complementary revenue streams or multi-category â\u0080\u0093 the new multi-category, I would say, strategy, I mean, you donâ\u0080\u0099t call it anymore. Yeah, so far, Alan, to be honest, the incremental cost is marginal, right, because we are leveraging on current capacity and capabilities. So on the on-trade channel we are adding capacity and capabilities for execution for developing the brand, with the proper net brand narratives and executions at the on-trade, but at the same time thatâ\u0080\u0099s incremental field sales force capacity and the ability to serve those customers with a broader portfolio are also driving incremental sales on our core business too. So, itâ\u0080\u0099s an equation that needs to be looked at, I would say, outlet-by-outlet, thatâ\u0080\u0099s how we are seeing it. For example, when you look at a set of outlets from a non-alcoholic beverage portfolio view only, they might be outlets then in our segmentation we might call them silver accounts, right. Now, when you lay your alcoholic beverages, then there is a series of possibilities that actually provide for a re-segmenting and re-categorizing of those outlets to a higher tier which allows them to invest heavier behind that outlet which creates a virtue circle that benefits the Coca-Cola Femsa and Coca-Cola Company core portfolio too, right. But I would like to pivot on your question because, we get a lot of questions on alcoholic beverages than on beer in Brazil which is fantastic and itâ\u0080\u0099s part of our strategy and it also delineates our thinking for the future in terms of some of the focuses on multi-category. We get the opportunity to provide for more color in these calls and a great example of that, I would like to â\u0080\u0093 call it with more on Coca-Cola no sugar. Mexico, as we pointed out is growing 26% year-to-date, 40% in transactions. In Costa Rica, the brand is the second brand in our portfolio already and continuing to grow. In Uruguay, it continues to grow despite the fact that itâ\u0080\u0099s already no sugar offerings are 38% of the mix. So, this is a great example of great things that are happening inside our core portfolio and that in contrast to some of these other initiatives that are fantastic in part of the strategy for the future, as of today, they have different levels of match the reality and they are impacting our business quite positively. Constantino, just to stay with this same exact theme, you seem to be getting great traction on Coca-Cola and flavor multi-packs in Brazil and in the rest of Latin America now. And thatâ\u0080\u0099s also seems to be driving an awful lot of activity when we go to the supermarkets and we look around, your approach to this has changed and your insights have changed. First of all, everything begins by recognizing that we have one of the best consumer brands in the world, basically, which is the Coca-Cola brand, right. And when we look at some channels, when we look at consumer insights, and we understand the power of the Coca-Cola brand then you can start â\u0080\u0093 first of all you need to recognize that and once you are recognized and you connect the dots, then you can start developing consumer programs that can leverage of Coca-Cola. We have bundled Coca-Cola with our flavor portfolio which is a great portfolio of brands that in some occasions when the shoppers go to buy for stocking â\u0080\u0093 for some occasions, they want to get the best out of the brand assortment that there is in the supermarket and thatâ\u0080\u0099s where the multi-packs come into play. But having said that, the underlying big driver of this is being able to connect the dots to use data, consumer and shopper and retailer data in the proper way and from there, develop and execute your portfolio offerings and your promotional offerings for the point of sale in the relevant markets. So I think that I wanted to stress that final point, because at Coca-Cola Femsa, we believe that we are brand builders. We are not only executers of great brands, we do great brand building in conjunction with the Coca-Cola Company and in conjunction with our multi-category partners and thatâ\u0080\u0099s the way we approach it by connecting the dots and by using relevant consumer and shopper and market insights to develop our solutions. Most of my questions were asked, but I see a little bit of a decreased focus on Whatsapp ordering on the calls and I just wanted to ask you if there is a little bit of a change in strategy maybe towards a platform that is not in Whatsapp and that was more the other B2B platforms that we are seeing throughout the world. I mean, on our omni-channel strategy, first of all, I would like to stress what omni-channel means for us, right. And for us, omni-channel means a myriad of touchpoints for our customers to interact with Coca-Cola Femsa and be able to have a seamless experience no matter what touchpoints you use, right. Secondly, we believe that the anchor points in our omni-channel strategy remains in the pre-seller, right. Having said that, our customers have primarily three interaction points, right. Our URL system laptop based, then have our Whatsapp based chat box and we have and we are developing and continue to roll out and enhance our mobile App. We are definitely seeing as we deploy our mobile App in the different countries, we are seeing a significant shift to the Apps as the means of being the preferred choice of interacting with Coca-Cola Femsa, but at the same time Whatsapp remains a core interaction tool, particularly for smaller customers and because that it is extremely organic to the way a consumer and a shopper and a retailer behaves on an everyday basis. So itâ\u0080\u0099s extremely organic to everyone in Latin America, basically that is interacting with Coca-Cola Femsa. So, mobile devices are by far the largest in terms of the focus where that remains relevant for larger customers because of the complexity of the portfolio which is difficult to scroll on an mobile application or in Whatsapp due to its limitations. But as much as most of our customer base is on the traditional trade and their small stores, they tend to interact more on our mobile App and the Whatsapp chat box solution that we have in our different markets. So, for example, in December 2021, from all of our omni-channel clients, basically around 93% of these clients were using Whatsapp. If we look at it today, June 2022, Whatsapp is around 45%. So we have seen that migration that Constantino is talking about towards Whatsapp, itâ\u0080\u0099s very good for us recruit customers into the omni-channel platform and so far what we have seen in the first six months of this year has been an important adoption of clients using the App and also the web-based application and also Brazil has been very advancing these migration to all the omni-channel platforms. But when we look at Colombia, which is a little bit behind in that sense and Constantino mentioned that during the prepared remarks, he mentioned an impressive 60% of the clients in Colombia being monthly active purchasers. Most of it today in Colombia are Whatsapp based, as we continue to roll out we will complement this with the broad omni-channel strategy. Wanted to follow up on your prepared remarks, you talked about the level of hedging youâ\u0080\u0099ve put in place into 2022, but I wanted to kind of zoom out and look into 2023 if youâ\u0080\u0099ve done anything yet, because and some of the core ingredients if we think about aluminum but also corn, corn-related high fructose could have potentially come down a little bit. The way we look at our hedging for raw materials and FX, we go through a very disciplined process every month thatâ\u0080\u0099s called the commodity and risk management process where we have a 12 month rolling outlook and we start taking based on some operational guidelines and based on the analysis on the information that we have available, hedging positions and hedging decisions with the 12 month rolling outlook. So, we definitely have hedged some of our materials for 2023 and some of the FX needs for 2023, but itâ\u0080\u0099s same fits the tale of that 12 months outlook we donâ\u0080\u0099t like to provide for that information that far ahead. But we are definitely starting to take opportunities and the most important thing that I want to stress out, this is not a subjective view of management, if I may. This is â\u0080\u0093 this follows a very rigorous and disciplined, a multi-disciplinary process where both corporate, finance and the operations take part of. Due to time constraint, since we will now â\u0080\u0093 that will conclude todayâ\u0080\u0099s question and answer session."
}