{
    "symbol": "LOV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 22:20:22",
    "content": "  Operator: Good afternoon, and welcome to the Spark Networks Fourth Quarter and Full Year 2022 Conference Call. Good afternoon everyone, and welcome to Spark Networks' fiscal 2022 fourth quarter and year-end conference call. With me on today's call are Spark's CEO, Chelsea Grayson; and Chief Financial Officer, David Clark. This afternoon, Spark Networks issued a press release announcing its fiscal 2022 fourth quarter and full year financial results. Additionally, this call is being broadcast live over the Internet for all interested parties, and the webcast will be archived on the Investor Relations page of the company's website. I want to remind everyone that on today's call, management will discuss certain factors that are likely to influence the business going forward. Any factors discussed today that are not historical facts, particularly comments regarding our long-term prospects and market opportunities, should be considered forward-looking statements. These forward-looking statements may include comments about the company's plans and expectations of future performance, including comments regarding our review of strategic alternatives. Our statements on this call are made as of today, March 30, and the company undertakes no obligation to revise or update publicly any of the forward-looking statements contained herein, whether as a result of new information, future events, changes in expectations or otherwise. With that said, I'll now turn the call over to Chelsea Grayson, CEO of Spark Networks. To begin, I'm delighted to tell you today that I've accepted the Board's request to become the Company's permanent CEO. Over the past four months, I've had the opportunity as interim-CEO to learn extensively about Spark's operations, and its great brands, and the many opportunities that exist to improve this great company. But before I talk about those opportunities and our plans moving forward, I'd like to take a few minutes to update everyone on the status of this strategic review process. We do believe the company is in a solid position with a portfolio of well-known brands that drive meaningful relationships in key well defined vertical niches, including the 40-plus demographic, busy and discerning professionals, faith based affiliations and people who are looking for long term committed relationships and well positioned to meet our customers where they're most comfortable and to capitalize on the continued embrace of online dating in the marketplace. While 2022 was a disappointing year for Spark, it's clear to me that Spark is far more than just Zoosk. While this cold strategic value is a large mass market dating site, we also have a base of quality affinity brands, including EliteSingles, SilverSingles, eDarling, Christian Mingle and Jdate that are in demand by a large global paying subscriber base. Going forward, we have identified several areas where we believe the Company can substantially increase cost efficiency and solidify around a lower revenue base with a well-diversified collection of key meaningful brands, with the goal of substantially improving adjusted EBITDA margins. As such, we plan to continue to modernize our technologies to improve our marketing engagements and to improve how we collect and act on data to produce superior products and experiences for every one of our customers and to do all of that in a much more cost effective way. Our goal is to create an environment through a combination of social media engagement that positions our brands as welcoming communities for like-minded users coupled with contemporary mobile app engagement, and supportive technology to generate a perpetually expanding circle of customers. To achieve this, we must improve our product offerings and embrace more effective and modern marketing approaches, both on the marketing technologies and the brand marketing side. Even as our customers have transitioned away from the desktop model, we plan to solidify around a diversified core of key meaningful brands and with the goal of achieving a trough revenue base in 2023. As I mentioned on my call in January, Spark is dependent on increasingly dated modes of performance marketing, such as the increasingly less effective and expensive affiliate marketing strategy that it's used since the day it was founded. In fact, it's at the core of our focus and on leveraging what we consider the broadest reaching three marketing platforms. Doing so significantly increases our ability to direct the content we create to reach the audience with whom we want it to resonate, and to repurpose it as much as possible, as we focus on increasing our social media presence and brand marketing initiatives. We believe the best way to build and sustain shareholder value is to target higher annual adjusted EBITDA margins by right sizing our cost structure, investing in our brands that are at the highest ROI, reallocating capital to customer acquisition channels with the highest returns, and strengthening our defined and diverse brands. We believe we can improve our products and operations, while at the same time increasing our adjusted EBITDA with the initiatives we plan to implement this year, not the least of which is driving additional free cash flow and then deploying that smartly, including by paying down debt. With that, I'll ask David Clark, our Chief Financial Officer to add more color around our financial performance for the quarter and the full year. On a constant currency basis revenue for the fourth quarter and full year '22 would have been $43.7 million and $197.1 million, respectively. For the fourth quarter end-of-period paying subscribers were 713,000, down sequentially from 804,000 in the third quarter. For the full year, net loss was $44.2 million compared to net loss of $68.2 million in 2021. Adjusted EBITDA was $11 million for the fourth quarter, a 26% adjusted EBITDA margin compared to adjusted EBITDA of $14.3 million in the fourth quarter of 2021. Shifting to the balance sheet, the company ended the fourth quarter of $11.4 million in cash and a GAAP debt balance of $94.8 million or net debt of a $83.4 million. So as Chelsea noted with several changes underway aimed at a stronger product offering and a much improved marketing engine and most important of all, doing all it in a much more cost effective way. Having said that, we do believe we can significantly improve our operations and drive at least a 50% increase in adjusted EBITDA or $28 million in adjusted EBITDA for the full year with the initiatives we will implement this year. If I can kind of delve in a little deeper on subscriber growth with Zoosk and non- Zoosk and since you have just kind of realized that non-Zoosk is, you know, incredibly high ROI brands. Yes, and I'll turn this over to David, since I know he's probably eager to answer this question. But you know, generally the way that we'll get there spending our money more efficiently with the non-Zoosk brands, because the money just grows legs over there much more efficiently. So once you get people because they're affinity based sites/apps, and the way the tech has developed and the updated apps that we've launched and are in the process of launching now, it's much easier to get people to not just subscribe, but also renew their subscriptions. Yes, I'd say, you know, as Chelsea just touched on going forward this year we are prioritizing profitability and free cash flow. Now we're going to be focused on really payback from customer lifetime value and therefore, place more emphasis on the non-Zoosk brands, as opposed to as opposed to Zoosk to maximize profitability, free cash flow this year. Yes, I mean, there's a bottom below which we can't decline, right, because we've got, you know, we've got agreements with our lender, covenants with our lender. Right, so it's about spending differently with an intensely increased emphasis over on the non-Zoosk side of the house. And I don't actually think - I don't think that to the extent we were able to spend less on UAC, that it would, that that at all presumes a direct correlation with a drop in revenue. I think that the more intelligently you spend those dollars, the better you weaponize the content you've got with more modernized performance marketing and other marketing technologies. Yes, the direct marketing costs for fourth quarter and when you kind of see that. Yes, just under $15 million in the fourth quarter. Yes, we're - I think it's not moving away necessarily to the point of abandonment, it's just rebalancing where we think the dollar square legs, like I said, you know. David has tend to work with his group, and shown that it's the - it's a shorter and more predictable payback period on the non-Zoosk side of things and the LTV over there is you just get better bang for your buck. And so after taking a look at what he tested out with his group, it was - it felt to us like the move to go with and we've talked to other experts that have started to preliminarily, again, you know, as both David and I have said, we're still in the process of assessing but it looks preliminarily that third party neutrals agree with us as well. No, usually that probably falls out of - there probably was higher spend in the third quarter - there was higher spend the third quarter and the fourth quarter and we were just had had a use of cash to pay off those payables."
}