{
    "symbol": "SCI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 16:07:06",
    "content": " Although, comparable core funeral volume declined about 10% compared to the prior year quarter, the 2022 third quarter volume is still over 15% higher than the pre-COVID 2019 third quarter, resulting in an impressive 5% compounded annual growth rate over the three-year period. Based on what we've seen over the last five or six months for 2022, we now believe with higher than we anticipated levels of non-COVID funeral services in atneed cemetery revenues that our original base assumption of $3.18 would be more like $3.50. In determining our preliminary guidance for 2023, we utilize the $3.30 earning per share base, applied our historical earnings for share growth assumptions, factoring in slightly higher interest expense, as well as slightly lower trust fund income results in determining our 2023 earnings per share guidance range of $3.45 to $3.75 per share. The declining cash flow quarter-over-quarter aligned with the $107 million decline in operating income, which excludes gains on divestitures and was somewhat offset by $22 million of lower cash taxes as a result of the lower earnings as well as about $41 million of favorable working capital in the quarter. This decline in our trust finance balances is expected to result in about a $35 million to $40 million cash flow headwind for the full year of 2022, all of which is considered in our increase in our 2022 earnings and cash flow guidance that we talked about this morning and in the press release. So, with that, next, I'd like to shift gears and touch on corporate G&A expenses, which were $42 million in the current quarter and slightly higher than our expectations due to inflationary salary and wage pressures as well as some workers' compensation and general liability insurance cost increases. Looking forward to 2023, we expect corporate G&A to trend a little bit higher due to these inflationary labor pressures and be in the ballpark of $38 million to $40 million per quarter. So, first, when we think about the adjusted EPS guidance of 2023, which was $3.60 at the midpoint of the range that Tom just mentioned, this $0.10 difference from 2022 levels is expected to result in about a $20 million net decrease in cash flows for 2023. But the other $20 million really relates to preneed cemetery, and it really has to do with some of the things that Steve Tidwell and Jerry and their teams really did to drive sales at the lower end portion of the spectrum, kind of the entry level price point and the entry level customer that we talked about last quarter. So, there's like this onetime timing difference where we're going to have a little bit of a source of working capital at the end of this year and that will flip to a use of working capital as the revenue recognition comes, where a lot of the cash may have come late this year as well."
}