{
    "symbol": "SCI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 12:53:10",
    "content": " While this is below our prior year, that was meaningfully impacted by COVID-19, it's an incredible 26% earnings per share compounded annual growth rate from a pre-COVID 2019 base year of $1.90. Total comparable funeral revenues declined $30 million or about 5% over the prior year quarter, primarily due to a decline in comparable core funeral revenues. In terms of breakdown, core revenues increased $3 million compared to the prior year as recognized preneed revenue growth of about $18 million, which absorbed the $6 million merchandise and service trust fund income decline. So during the quarter, we generated adjusted operating cash flow of $170 million, which is at the high end of our guidance range we talked about last quarter by $20 million lower than the prior year. So as we sit back and look at the full-year of 2022, we generated $826 million in adjusted operating cash flow, which is almost $200 million or 30% higher than our 2019 pre-COVID results. On the acquisition front, we are excited today to report that we had a very active fourth quarter, invested almost $90 million in acquiring three combination operations and 11 standalone funeral homes and four separate transactions, bringing our full-year spend to just under $105 million. After adjusted for the $64 million pretax estimated charge for certain legal matters, Corporate G&A of $43 million in the current quarter was about $2 million higher than the prior year and slightly higher than our expectation, primarily due to workers' compensation and general liability insurance costs that were a little bit higher than what we expected. As I mentioned on our last call, as we look forward in 2023, we continue to expect corporate G&A to be lower than we experienced in 2022 at approximately $38 million to $40 million per quarter as incentive compensation is expected to be lower than our COVID impact 2022. In our press release, our guidance for adjusted operating cash flow for full-year of 2023 is a range of $740 million to $800 million with a midpoint of $770 million. Last quarter, we mentioned it could be a headwind of about $50 million, but I now think it'll be closer to about $55 million, primarily on higher expected rates and somewhat higher balances. From a working capital perspective, we are expecting $20 million to $25 million incremental use of working capital as usage from strong preneed cemetery sales and strong incentive compensation cash payments are partially offset having the no CARES Act payments in 2023 that I mentioned before is now behind us."
}