{
    "symbol": "AMBP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 11:39:24",
    "content": " Total beverage can shipments in the quarter were 1% higher than the prior year with growth in Europe and North America, offsetting a decline in the softer Brazil market. Fourth quarter adjusted EBITDA in Europe fell by 2% on a constant currency basis to $45 million as the contribution from higher shipments was offset by higher overhead costs and input cost headwinds, including a short-term pass-through cost headwinds created by the sharp fall in metal premiums in the quarter while holding elevated inventory levels. For 2023, we expect shipment growth at the order of low single-digit percentage with a more significant increase in adjusted EBITDA arising from Q2 onwards as a result of a more effective part of our energy costs, inflationary input cost recovery through our PPI mechanisms and the non-recurrence of metal valuation timing issues. And we had another, I don't know, say, $20 million of FX out of that and then I think that the two big FX in the year were the European energy situation with some addition from metal mismatches in Europe, and then the volume is, particularly in North America, that are also -- I mean, to be clear, volume mix miss because the Hard Seltzer and some of those innovation categories were a higher margin for us. And when that happens, the margin profile will ease between returnable and one-way packaging and beverage cans, and therefore, we'll see a switch back into cans, and we'll see the return to the sort of growth rates we had in Brazil, which are more 5% to 10%, if not higher in the second half of the 2010. So yes, overall, that we remain very confident in the growth prospects of the can in all our markets, there's no question that the last 12, 18 months, we've been hit by some extraordinary and unexpected particularly inflation-related shocks to our growth, and we're just being cautious in the short term around that. As I set out in the prepared remarks, we're looking for at least $100 million of working capital inflow this year and operating cash flow conversions at around about 80% of EBITDA on our modeling for '23. So look, I think in a way, the North America market has normalized to what we've seen in Europe for years in terms of mix of drink types, mix of SKUs and we have a lot of experience of that, therefore, in our operations, and we're bringing that experience in North America."
}