{
    "symbol": "VINP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 23:38:13",
    "content": " On top of fundraising for private equity and credit that have impacted us over the second quarter, Vinci has been selected by BNDES for seed investments of up to BRL500 million each in two of our products across credit and infrastructure. Our AUM was impacted by depreciation of BRL1.7 billion in the second quarter, coming from the mark-to-market effect of liquid funds, tied to the Ibovespa index, which dropped almost 20% intra-quarter. Performance fee receivable increase to BRL146.1 million in the second quarter, a 40% increase quarter-over-quarter driven primarily by appreciation in our VCP III strategy that currently totals BRL126 million in performance fees or 86% of total fees. Since these are charged over funds NAVs we had a significant impact over management fee revenues in our liquid funds when we compare to the fees charged over the same quarter of last year with the IBOVESPA trading at around 130,000 points, almost 30% higher than the closing levels of this year's second quarter. As previously mentioned, we should expect the majority of the impact in management fees from the recent fundraisings to translate into our FRE results starting the third quarter, as most of the AUM was activated at the end of the second quarter. FRE margin was 49% in the quarter, down 6 percentage points when compare to the same period of last year impacted partially by higher fixed cost following the rising inflation rate and previous dimension investments behind Vinci Retirement Service combined with capital return and mark-to-market effects on revenues. Segment distributable earning were BRL57.3 million over the year-to-date, an increase of 6% compared to the same period last year, boosted by higher contributions from dividend distribution in our proprietary position across listed REITs totaling around was BRL24 billion at the end of the quarter, up 16% year-over-year, driven by strong fundraising in Private Market strategies. I have two on my side, please. I have two on my side, please."
}