{
    "symbol": "VINP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 17:57:03",
    "content": " Vinci ended the third quarter with BRL63.4 billion in assets under management, up 9% year-over-year, driven by our fundraising across private market funds in the second and third quarters of 2022 and the recently closed acquisition of SPS. At the end of the quarter, Vinci had BRL10 billion in performance eligible AUM coming from private market funds still in investment period that can further contribute to our accrued performance fees as these funds enter their divestment periods. Additionally, to the full quarter impact of Vinci SPS, which is the activation of fees following capital deployment as we currently have about $1.7 billion in AUM coming primarily from the Vinci Credit Infra fund and Vinci SPS third vintage that will contribute with higher fees as these funds deploy capital. FRE margin was 48% in the quarter, down 5 percentage points when compared to the same period last year, mainly a result of higher advisory fees last year and the fixed cost deleverage we have for that vertical, addition to higher fixed costs following the rising inflation rate and previously mentioned investments behind Vinci Retirement Services. We had BRL37.5 million in realized GP and Financial Income this quarter, up more than 2,000% on a year-over-year basis coming from gains in our liquid funds portfolio and dividend distributions from the company's proprietary position in listed REITs. Adjusted distributable earnings totaled BRL73.2 million or BRL1.32, up 19% on a year-over-year basis, boosted by growth in management fees and financial income in the quarter. Total AUM was BRL27.6 billion for the end of the quarter, up 27% year-over-year, driven by strong fundraising private equity, credit and real estate and the additional AUM from the acquisition of SPS. We should see some increase in AUM over the next few quarters as we expect to hold the first closing for VICC, the second close for Vinci Credit Infra and new capital subscriptions for our fourth vintage in our flagship Private Equity strategies."
}