{
    "symbol": "INTZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 02:29:30",
    "content": " Joining me today are Tony Scott, Chief Executive Officer; and Kimberly Pinson, Chief Financial Officer. Before I turn the call over to Tony, I'd like to remind everyone that statements made during this conference call relating to the company's expected future performance, future business prospects, future events or plans may include forward-looking statements as defined under the Private Securities Litigation Reform Act of 1995. In addition to U.S. GAAP reporting, we report certain financial measures that do not conform to generally accepted accounting principles. During the call, we may use non-GAAP measures if we believe it is useful to investors or if we believe it will help investors better understand our performance or business trends. With that, let me now turn the call over to Tony for a few opening remarks. These priorities include expanding and strengthening our product offerings, realigning our sales and marketing resources and focusing on channel enabled sales model as well as strengthening our strategic partnerships and improving our financial discipline. As we announced at the end of September, we've achieved the commercial release of our Shield Cloud and Endpoint products. Notably, as we released these new products, we identified some important patentable characteristics on our path to general availability. Now that we have patent coverage in place, these product additions strengthen our strategic vision for Intrusion as we continue to serve the growing demands of customers seeking advanced and highly effective cybersecurity solutions globally. So first, let me talk about our Shield Cloud product. Shield Endpoint enables safe web browsing outside of the corporate enclave and data center allowing users to work remotely with confidence that authorized device connections are known, monitored and protected. With this product, users can safely view content on sites that would otherwise be blocked through our Shield Renderer, which transparently redirects users to a safe cloud-based browsing environment. Our qualified leads have more than doubled, we've doubled our proof of concepts and proof of values, our quotes are 10x in terms of quotes that we have outstanding and all of those give me confidence in the future for these new products. Finally, we continue to invest in our Shield On-Prem appliance. The demand remains strong for this hardware and we had several deals that didn't close in this quarter, but are in our qualified pipeline. On the sales and marketing front, we've revamped our messaging around Shield with the launch of our new company website, new product branding and a new company logo as a part of this makeover effort. Finally, as we announced in October, we are partnering with vTech Solutions, an IT services firm based in Washington, D.C. that provides end-to-end managed solutions for its customers. vTech currently operates in 40 U.S. states and 3 additional countries, which will help expand the reach of our Shield products as they see greater penetration into those markets. We have positive momentum resulting from these new partnerships, which expands our reach as we provide INTRUSION Shield protection to a greater number of customers. Our discussions have continued with other major technology partners on the strategic partnerships front, but we have nothing more to announce at this particular time. As I indicated last quarter, I was hoping to have something further to announce during the third quarter, but there's been a bit of a slowdown in these discussions mainly due to the macroeconomic environment that we're all currently experiencing. That said, no potential partner has left the discussion and we detect genuine enthusiasm for our IP and I remain optimistic that we will have something to announce on this front in due time and our strategic direction remains on course. Before wrapping up, let me also address our legacy consulting business. As you know, the federal government's fiscal year started on October 1 and there currently is a continuing resolution or CR as it's commonly known to temporarily extend the fiscal year 2022 spending levels. As can be typical in these situations, we expect that the appropriators and congressional leaders will reengage in negotiations to finalize federal spending for fiscal 2023 following the November midterm elections. As we navigate the terrain of conducting federal government business, we are continuing to make investments and are exploring additional opportunities within the space in support of our growth strategy. As many of you know, I have a background with the federal government, which ultimately led to Intrusion's participation in Cyberworld within the AUSA conference, the largest trade show for the U.S. military with over 60,000 attendees. I personally participated as a keynote speaker this year where I emphasized the technological capabilities of Shield in protecting critical information assets, which was well received by those in attendance. During the quarter, we also participated in GRR Con, an information technology, security and hacking conference. What I continue to hear and confirm is that while forecast for technology and software spending are projected to be markedly lower, cybersecurity remains a top priority as we head into 2023. For example in a recent Gartner study published in the Wall Street Journal, 66% of CIOs indicated that they plan to increase investment in cybersecurity. Long term the demand backdrop for our solutions continues to grow, specifically in the market sub-segments we serve. While bad actors never cease, I'm excited about the ways in which our new and existing products can stand up to the most intelligent threats today and I remain steadfast in my belief that we are well on our way to sustainable Intrusion growth in this high growth exciting space. Before I turn the call over to Kim, I'd like to comment on our efforts to improve the company's financial discipline and stability as we continue to pursue our strategic initiatives. In September, we completed a registered direct offering of approximately $6 million along our goal of $15 million to $20 million in the coming year. Overall, I'm proud of how our teams executed during the quarter. With that said, I'd now like to turn the call over to Kim for a detailed review of our third quarter financials. We are encouraged by the ongoing progress being made within our business as we continue to strengthen our balance sheet, bolster our financial flexibility and support our strategic growth initiatives to capture the growing customer demand for our sophisticated cybersecurity solutions. Revenues for the third quarter of 2022 were $2.2 million, an increase of $0.1 million or 6.5% sequentially and $0.4 million or 20.5% year-over-year. As you know, due to the CR, no new contracts can be awarded until either the CR ends or a new budget is approved. During the quarter, we signed a number of new customers, which was offset by a nonrenewal of a contract. On a year-over-year basis, Shield third quarter revenues increased $0.1 million or 70.3%. As Tony stated, we are pleased with the launch and progress of our 2 new Shield products and are encouraged by the prospects in the pipeline, particularly for the Endpoint solution that we expect to be a large contributor to revenues in the future. The gross profit margin was 54.6% for third quarter of 2022, which is significantly below the gross margin that has been reported in prior periods. During the quarter, we identified amounts recorded in operating expense that should be included in cost of sales. This reclassification resulted in a reduced gross margin of approximately 12% and 14% for each of the 3-month periods ended September 30, 2022 and 2021. When comparing our current quarter gross margin to the same period in 2021 after reclassification, our gross margin increased 6.2%. Research and development totaled $1.5 million, a decrease of $0.4 million from the prior year period. As you may recall, we began capitalizing internally developed software costs in the second quarter of this year. When adjusted for amounts capitalized, the R&D expense would be $2 million, an increase of $0.1 million or 5% year-over-year. During the quarter, we finalized the calculation of our employee tax credit related to 2020 and 2021 and we recognized $2 million in other income net of expenses. Our losses have improved significantly compared to the same period of the prior year, which reflects our responsible fiscal management as we grow revenues and manage our costs. As of September 30, 2022 we had cash and cash equivalents of $6.9 million, up from $4.1 million on December 31, 2021. On September 12, we entered into a securities purchase agreement to issue and sell shares in a registered direct offering of common stock and warrants totaling $5.9 million. We closed on 959,057 shares and warrants or $4 million in the September quarter. With that financial overview, I'd like to turn the call back over to Tony for a few closing comments. To conclude, we're continuing to execute on our strategic initiatives through the launch of our new products and the partnerships that we've announced. Just starting off, I mean with Shield revenue I think essentially flat quarter-over-quarter. On the first day of school when all the students logged in, our box crashed and they got kind of jittery and basically refused to turn it back on again. So it was one of those things that when I got there, we spent the first couple of months on the hardware stabilizing our software and making sure things like that wouldn't happen again. And we just couldn't resurrect that 1 customer out of the trashbin, if you will. So I felt real bad about it, but I do understand in that particular case why a customer would feel burned and would not want to renew. And Kim, I think you mentioned around kind of the lower gross margin that we saw in this quarter. In reviewing the cost of sales and it was primarily as we were getting ready for the planning phase of the remainder of this year and 2023, I noticed some contractor expense. And it did not have an impact on our operating income, gross margin or earnings per share. And Tony, final question for me is really around the launch of your new Cloud and Endpoint solutions. So we've been working for the last several months getting our partners and resellers and so on ready for this launch, getting our collateral material together and all the things that you would expect at that particular time. And so the metrics I was talking about has to do with our proof of values, proof of concepts and things like that. So these are leads that we know there's a budget, we understand what the demand is, there's been at least an initial conversation and a desire to learn more about our product and so on. In most cases, they've already put some considerable time into it. So those have doubled. So once we get through the initial sales pipeline, then we actually get our hardware or software as the case may be installed at the customer site and we begin a defined period of time where the customer experiences what our product can do in order to make a determination whether they ultimately want to buy it or not. So those have doubled. So these are cases where in dialog with the customer, we have a specific request to provide a quote and our goal is to turn those quotes into actual sales. Well, congrats on the continued progress here in Q3 and then best of luck with the rest of the year. What happened there is, we were ready to go, and we realized there was some additional patent coverage that we really wanted to have and needed to have before we went GA with these products. So I'd call it a good delay for 2 reasons, but it was a little bit later in the quarter than I had originally been hoping for, but we did get it out at the end of the quarter, hope for them. No, because neither were GA at the end of the very end of the quarter, so. And most of them are commission kind of basis or a discount basis, but they sell our products, they build the customer, we build them is kind of the nature of the relationship. In most cases, they'll provide first-line support. They'll have technical teams that help with the install, answer any Tier 1, helped us kind of calls and so on. But we're focused on around 8 to 10 at this particular point or, I'll say, more active than the others and it's probably double that in total that I'd say are active partners, but we're really focused on the top 8 or so that are really delivering leads and really engaging in direct customers. So, there will be a period here where that feedback will be critically important as we try to do a better job. Well, I'll let Kim comment, but our main goal is to improve sales. But our goal for the next 2 quarters, in particular, and I think forever, will be grow sales and then grow cost at a slower rate. So we do plan on responsible fiscal management and really not getting ahead of ourselves in terms of expense spend, and we'll continue to spend responsibly, we'll continue to invest in new features and functionality and new products, but we will moderate that with our product adoption as in at the rate at which our top line growth. And on that same basis, to a lower expenses, we will continue to invest in sales and marketing, but due to the go-to-market structure, it will be at a lesser extent than what otherwise we would have seen once the new products launched. My question is, you mentioned about the weakening macro environment, challenges of IT budget, at the same time, cybersecurity remains a priority. But there's a couple of other things I would mention here, too. One of them is that they're , having 52 vendors in the cybersecurity space, and they're sort of looking for better coverage from a fewer number of vendors than what they have today. But I also hear and I think this helps Intrusion, they're looking at solutions that are focused on the coming threats and the threats that are -- that seem to be growing today versus yesterday's problems. And I think our forward facing cybersecurity solutions play well in that dynamic, so. And as we all know, cybersecurity attacks are still successful. Well, I wish you guys good luck. I'm sorry, I had a problem, technical difficulty getting on the call. Well, I think the bottom line of this is, I've hoped to announce a major strategic partnership by the end of the third quarter. And in my comments, I said I think the macroeconomic conditions are creating an environment where those conversations have slowed down a little bit. So I think it means that in major tech companies, and you're seeing this in the market broadly, most of them are not having a great time right now, and that puts a lot of pressure on internal teams and I think also limits the kinds of relationships that they're willing to engage them. That said, nobody has said, go away, we don't want to talk to you anymore and our conversations will continue. Well, it was good on the positive note, I guess, it's good to hear about the deepening of the relationship with Super Micro. I mean, I just -- specifically, I guess, from the perspective, I know they do a lot of white box offerings. And increasingly, as there's cost pressure on IT budgets and so on, they're going to be a great alternative to some of the higher priced solutions that are there in the market. And so our ability to partner with them and be a part of the portfolio they can offer their customers, I think is good for us, and I think good for them as well. And they wanted to broaden their offerings, and I think we're a very good partner for them in that respect. And we'll go on initially as a sub to other offerings, not directly, but we are working on also being on directly as well. Tony, real quick, just to pick up on an answer you gave to Aaron. Yes, the normal process would be a proposal goes in and the prime time director lists, the subs that they want to use or could participate in that particular contract. And once it's awarded, then the prime becomes responsible for the relationship. So as we mentioned, there's a CR right now, so we're not expecting any new contracts until after the CRs get ended and normal funding occurs. But as in every year, where there's been CRs, there ends up building a lot of demand behind the dam, if you will. And as soon as the CR ends, then contracts start to flow. So I read that as you're saying that those -- since they're in that process and are being held up by the CR, which I guess we've had 15 at the mid last '20 budget years. You already have the prime that has put the contracts in and you've already basically worked with the prime, the prime is intending to include you in that. Yes, we have some, and we're working on a whole heck of a bunch more. We're in a handful today, and I want to be in multiple handfuls within the next year. So these -- when they get -- when we get out of the CR and these get approved, this could be a fairly significant revenue ramp and quite honestly, proof point, although I think it's becoming less of a concern for many investors as to whether or not the shield works, it will be a massive proof point as you get these contracts out. I think the one caveat I would say is that in most of these cases, there's competitive bidding going on. So if our prime, the one we selected doesn't win the contract, and neither do we. But our goal is to have more of that than we've historically had, and I think we're well positioned to do that. How -- in the past, it was said this is a fairly unique thing. Well, I think it's a question of 2 things. There's nobody that comes close, we think we're at least 10x bigger than the next closest guys. There are others who claim that their solutions are effective because they use things and these are all great buzzwords in the industry today, machine learning, AI, behavior-based analytics, the list kind of goes on and on and on. And the fact that we don't rely on strictly on signatures or fingerprints or some known set of behavior that we've seen before is, I think, unique in the marketplace. Right now, we're still a little known company. And while there are some companies that are starting to gather the kind of data that we have, they can't get the 30-year history that we already have. Put a different way, by the time they have a 30-year history, you'll have a 60-year. One of the ways that an investor like me, judges companies like you, where it's hard to truly understand the nature of the dynamics of the product is by finding who you ally with. Well, impressed, I hope so, but you'll know the names for sure. That's our goal, yes. Well, there -- we picked ones in -- each in different spaces. So we're -- at the moment, we were not talking to multiple versions of each of those. I will say that if things stay slow, I will probably broaden our conversation to more companies than we're currently talking to. It would seem that if you do have this truly unique product, it would make a great deal of sense to effectively kind of create -- you're going to play with one player in each space, it would make sense to actually create a little bit of a race or a hustle for it because if people start to recognize that, this is what it appears to be, there should be a landslide pushing towards it. My only comment, Ross, would be, I chose one because of the impact on resources. These conversations take people, engineers, blah blah, and I didn't want to dilute our resources broadly. I chose a more focused approach, and we'll see what happens as time marches on here, but that was a deliberate choice initially. But by the same measure, the people who are partnering you with these potential deals with the government have also committed resources and decided after putting those resources that they want to include you in their package. Actually, quite a lot of years ago, I made a lot of money on a company called Albany International, which developed a new way to make fan blades for jet engine when Boeing said that they were going to use the  engine, people thought that was crazy, but they actually -- there are leading-edge technologies, the companies who never think could happen. Well, congratulations, I heard there's a lot more going on here than you're letting on. It's pretty exciting, I think, just picking up some of the stuff that some of the following -- going through some of these doors aren't open. So thank you very much. And with that, I'll turn the conference back over to management for any closing remarks. Well, again, I would just like to say thank you to our investors and analysts and all those who are paying attention to us. For me, it's coming up on 1-year anniversary of joining the company, and I'm quite proud of the team. Stay tuned, we'll have, I think, more exciting news for you in the coming weeks and months. So thank you very much. Ladies and gentlemen, that will conclude today's call."
}