{
    "symbol": "INTZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 23:31:06",
    "content": " For those of each participating in the conference call, there will be an opportunity for your questions at the end of today's prepared comments. Before I turn the call over to Tony, I'd like to remind everyone that statements made during this conference call relating to the company's expected future performance, future business prospects, or future events or plans may include forward-looking statements as defined under the Private Securities Litigation Reform Act of 1995. Any forward-looking statements that we make on this call are based upon information that we believe as today, and we undertake no obligation to update these statements as a result of new information or future events. During the call, we may use non-GAAP measures as we believe it is useful to investors, or we believe it will help investors better understand our performance and business trends. As you'll recall from our previous calls, I outlined several operational and strategic initiatives we have undertaken that are critical to the long-term success of Intrusion. Those initiatives included expanding and strengthening our product offerings, realigning our sales and marketing resources, as well as focusing on the channel-enabled sales model, and strengthening our strategic partnerships. And finally, improving our financial discipline, including making sure we have sufficient operating capital to support our research and development, marketing, and operating needs for FY 2022 and beyond. And by executing on these initiatives, we believe that we can, and will, create a bright future for Intrusion, its customers and its shareholders. During our last call, we talked a bit about the current market for the INTRUSION Shield appliance. We spent much of the last quarter making product improvements, including performance enhancements, and adding several customer requested features and capabilities. And I'm pleased to announce that the cloud-based shield product will be available for demo in the next few weeks, and full general availability release of the product remains on-schedule for the second half of 2022. I also briefly mentioned the second new product, INTRUSION Shield Endpoint. Again, our product development efforts are on-track, and like INTRUSION Shield Cloud, we expect to have customer demo capabilities in a few weeks, with GA in the second half of the year as well. I've been personally using early beta versions of this product, and I'm excited about it’s potential. We are seeing continued chip shortages and longer lead times across the industry, and many are predicting that this will continue for some time to come, and may even become worse in the short run. The release of these new products in the second half of the year, will pave the way for INTRUSION Shield to become our main source of revenue growth in the future. As we've communicated, we're in the middle of a significant transition period for Intrusion. We've hired a new Channel Director, and made needed improvements to our sales force operations. As promised, we're clarifying our value proposition and have energized our channel partners with a renewed focus on making sure we can support their efforts as a force multiplier for our sales efforts; these actions are leading to more meaningful and fruitful customer discussions, POCs and pipeline development. And we're already starting to see the results of these efforts with several new deals now being closed in Q2, already doubled of what we did in Q1, and a significant increase in our qualified pipeline, which is three times greater than our ending Q1 pipeline. To further aid these efforts, we’ve strengthened our team in the quarter by bringing on Ross Mandel Chief Strategy Officer; and Christopher Duzich, Chief Operating Officer. And while the CR ended late in the first quarter of this year, creating a tailwind for this business segment, it occurred too late in the quarter to yield any meaningful revenue for the period. Because of this, our revenue in Q1 in this piece of the business was flat compared to the prior quarter. That said, this is a net positive event and with the CR behind us, we can expect to generate revenue growth moving forward. Finally, while historically we've been focused on the Department of Defense side of this business, we're now making investments and exploring opportunities on the civilian side of the federal government to market INTRUSION Shield, not only to our long-standing customer base, but to expand our efforts, to include more traditional, administrative and civilian government entities. In conclusion, as we continue to set the stage for Intrusions bright future, the demand for our solutions remain strong, and the core tenants  of our strategy remain intact, with long-term growth drivers in the markets we serve. This global conflict has increased the focus and the intensity of advanced cybersecurity solutions, and cybersecurity concerns increasingly spillover into daily life, and with the increasing sophistication of security breaches, the need for our network solutions is more critical than ever before. Our products are tested and proven to provide a critical protection layer in organizations zero trust architecture, combining over 25 years of IP reputational behavior, with advanced real-time network monitoring to protect entities from these very real threats. Overall, we feel Intrusion is only getting stronger in our ability to meet this growing demand as we expand our sales channels and partnerships, launch new high demand products, and improve our overall financial position. With that said, I'd now like to turn the call over to Franklin for a detailed review of our first quarter financials. Revenue for the first quarter of 2022 was $1.8 million, which is in line with the first quarter of 2021. As you would have expected, 2022 first quarter revenue for INTRUSION Shield was significantly higher than the first quarter of 2021. However, Shield revenue increases were offset by lower revenues from our legacy consulting business, largely due to the timing of the continuing resolution, which expired March 11 of this year. First quarter operating expenses were $5.2 million, which are also in line with the first quarter of 2021 results. In the first quarter of 2022, we experienced large decreases in sales and marketing expenses, compared to the prior year quarter that resulted from previously announced headcount reductions and fewer trade shows. Net loss for the first quarter was $4.1 million or minus $0.21 per share, compared to a net loss of $3.99 or minus $0.22 a share for the first quarter of 2021. As of March 31 2022, working capital was $1.39 million, down from $2.1 million in the prior quarter. As of March 31, 2022, we had cash and cash equivalents of $6.1 million, up from $4.1 million in the prior quarter. This includes approximately $4.7 million in net proceeds received from the first note with Streeterville Capital , which was put in place in March. As we've mentioned previously, the closing of the second note is contingent on certain conditions being met, one of which is being voted on at our annual shareholders meeting later this month. Additionally, our ATM or aftermarket sales program, remains in place and we will utilize it in the future to finance operational activities, invest in Shield, as well as for potential note repayments, which may depend on current market prices. Lastly, we are continuing to work on additional financing transaction to meet our previously announced capital raise goal of $15 million to $20 million this year. In Q2, we currently in the quarter isn't over yet, obviously, we're seeing 3x, the pipeline that we had at the end of Q1, which to me, and this is qualified pipeline. And then we've also, as I mentioned, sign double into terms of revenue, the deals that we did in Q1, and already, we're not even, we're halfway through the second quarter. And when we actually release the new products, you'll see, increased levels of marketing and demand gen, and, and all of that. I'll also tell you just one anecdote, we had a managed service provider, start with us this quarter, and that customer deployed to one of their customers. And we got a very enthusiastic call from both the customer and from the managed service provider, telling us how much they liked and appreciated shield. So I'm pleased with the direction obviously, the volume needs to ramp up pretty significantly, which we think it will with, with the new products in particular honors. at any scale, we have a couple of insight the 10 customers that, know where we're going with this and who understand what we're doing for from a technology standpoint. That will happen in Q2 here, as we have demo capability, and the products just a little bit more baked than they are currently at the moment. So I mentioned on the call, I've been using the endpoint internally here. Once we move closer to general availability, I mean, what sort of additional training is going to be required for your channel partners, and also, it seems like you're going to put some incremental dollars that works to marketing programs for this. So there will be some incremental training required for both of the new products, but it's not a 100%, read duplicative effort. And in particular, one of the things that we're focused on is making both of these new products much easier to demo, much easier to try and do a POC. Today, as we've talked before, you know, deploying a hardware appliance behind the firewall requires usually some heavy lifting, that we hope to avoid, at least for demo and POC purposes going forward. Only the supply chain issues, as I mentioned, briefly on the call really only are impacting this high throughput failover solution that we've had under development, and it's unclear at this particular point, we're trying to get more clarity from our suppliers on if they're impacted and what that impact might be. So stay tuned, we'll let you know and when we know, but so far, you know knock wood, I think we're in better shape than many others, apparently are on both runs. And my last question is, obviously, cybersecurity and hacking is you know, gaining a lot of press, have you noticed any change of competition if either new entrants are coming into the market. So, we have seen an increase in an inbound interest and I do find that people are taking these kinds of conversation's far more seriously than they might have, you know, without that external stimulus. Hey, I really appreciate the questions today and the interest in Intrusion. Ladies and gentlemen, that would conclude Intruder’s Incorporated First Quarter 2022 Earnings Conference Call."
}