{
    "symbol": "INTZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 18:21:02",
    "content": " Good afternoon, ladies and gentlemen, and welcome to the Intrusion Q2 2022 Financial Results Conference Call. And at this time, I'd like to turn the call over to Mr. Sam Cohen with Alpha Investor Relations. Joining me today are Tony Scott, Chief Executive Officer; and Kimberly Pinson, Chief Financial Officer. Before I turn the call over to Tony, I'd like to remind everyone that statements made during this conference call relating to the company's expected future performance, future business prospects, future events or plans may include forward-looking statements as defined under the Private Securities Litigation Reform Act of 1995. Any forward-looking statements that we make on this call are based upon information that we believe as of today, and we undertake no obligation to update these statements as a result of new information or future events. During the call, we may use non-GAAP measures if we believe it is useful to investors or we believe it will help investors better understand our performance or business trends. Before I dive into some of our strategic updates, I would like to take a moment to welcome Kim Pinson, our newly appointed CFO, to her first quarterly earnings call with Intrusion. As you read in our press release, Kim brings extensive financial and technological experience to Intrusion. We are excited to have Kim at this pivotal time for Intrusion, and she is already playing an integral role in ensuring our long-term success. Now over the year, I've outlined and provided updates on our strategic priorities to reposition the company for long-term growth. These initiatives include expanding and strengthening our product offerings, realigning our sales and marketing resources and focusing on the channel enabled sales model, strengthening our strategic partnerships and improving our financial discipline. The newest version of the Intrusion Shield continues to gain traction, representing a more significant portion of our total revenue. We've made several enhancements to this hardware-based solution, including the ability to handle higher network throughput and improvements in overall performance and reporting. Our new product development efforts remain on track as we are progressing on schedule with the planned rollout of our two new, innovative Shield branded products. First, let me talk about our new Shield cloud product. We reached full demo capabilities in late Q2 and we are now finalizing our product launch activities, and the full general availability release of the product is on schedule for this current quarter. When released, this will allow cloud workloads to be protected by our Intrusion Shield technology without the requirement for dedicated hardware. Next, let me talk about our Intrusion Shield end-point solution. We also achieved demo capabilities during the second quarter as well, and this product supports Windows, iOS, macOS and Android clients. First, Supermicro helps us improve the performance of our existing technology through its excellent engineering capabilities. Second, it serves as a reliable hardware partner, with the ability to get us products promptly as we strive to satisfy global customer demand. Third, Supermicro has a global presence with operations in over 100 countries, which will accelerate our hardware deployment and provide international technical support to our global customers at a local level. In summary, I'm very encouraged that the release of these new products in Q3 will pave the way for Intrusion Shield in all forms to become a significant source of revenue growth in the future. On the sales and marketing front, we've transitioned to a distribution and partnership model, clarified our value proposition and enhanced our channel support and training. The results of these efforts are showing in our qualified pipeline, and we're continuing to expand our customer base domestically and internationally, as evidenced by some of our recent partnerships. This quarter, we announced publicly a partnership with InnerCore Technologies, a U.S.-based MSSP that deals directly with leading resorts and vacation destinations. In addition, we signed an agreement with One Smart Laboratory, an MSSP that sells into an extensive, diversified global healthcare network. One Smart Laboratory acted swiftly to formalize our relationship, which has already resulted in the installation of Intrusion Shield into several labs with more to come. Finally, we also signed an agreement with InfiniVAN, a fully licensed broadband-centric telecommunications company in the Philippines, focused on the enterprise market, with hundreds of thousands of customers in its distribution network. We have positive momentum resulting from these new partnerships, which expand our reach across the U.S. and now internationally, and provide Intrusion Shield protection to a greater number of customers. Our discussions have continued with a couple of major technology partners on the strategic partnership front, but I do not have anything definitive to announce at this time. In addition, I also want to share the news that we have revamped our messaging around Shield and we'll launch a new company website, product branding and a new company logo as a part of this makeover effort. As we continue to invest in the development of Shield, we do so with a commitment to maintain financial stability and discipline. In June, we closed on the second round of financing from Streeterville Capital with the sale of approximately $5 million in unsecured notes. And as a reminder, we intend to raise an additional $15 million to $20 million in the second half of this year. We have outlined and started to execute along our multiyear product road map in support of that growing future demand, with several planned near-term releases. As we discussed last quarter, the continuing resolution, or CR as it's commonly known, ended late in the first quarter of this year, creating a tailwind for this piece of the business. Now while the CR can be a lingering reality of conducting federal government business, we continue to make prudent investments and our exploring opportunities on the civilian side of the federal government to market Intrusion Shield to our long-standing customer base and expand our efforts to include more traditional administrative and civilian government entities. In conclusion, as we continue to get early and insightful feedback from our beta users, we're converting leads into customers building further relationships with channel partners and preparing for the upcoming launch of our new products. We remain encouraged by how the demand backdrop for our solutions continues to grow, specifically in the market subsegments we serve. With over 25 years of IP reputational behavior, which includes a database of over 8.5 billion domain names and IP addresses, our products are tested and proven to provide a critical layer of protection to organizations' zero trust architecture. Overall, I'm proud of how our team executed during the quarter. We are building momentum as we near the general availability of our new and innovative products, and we continue to realize the benefits of our revamped strategic channel relationships. We are happy with the positive trajectory in our new business wins, paired to a strong sales pipeline, as more companies look to leverage our advanced threat-hunting capabilities. With that, I'd now like to turn the call over to Kim for a detailed review of our second quarter financials. I'm extremely pleased to be joining Intrusion at such a pivotal time for the company as the team has made great strides with its strategic transformation, and we continue to execute on our operational plans. This is an exciting time for Intrusion, and I'm confident that the product set we will be going to market with and the leadership team that we have in place will set the stage for prolonged profitable growth. I look forward to meeting many of you, and we appreciate your interest in Intrusion. With that, I would like to discuss the company's financial performance for the second quarter. Revenues for the second quarter of 2022 were $2.1 million, an increase of $0.2 million or 12% sequentially, and $0.1 million or 5% compared with the prior year period. Our second quarter results demonstrate an increased adoption of our Shield appliance as revenues for Intrusion Shield in 2022 were significantly higher, both sequentially and as compared with the second quarter of 2021, and now represent 16% of our total company revenue. In the second quarter of this year, we adopted the agile framework for software development which allows us to now accurately track and quantify costs that are subject to capitalization pursuant to the U.S. GAAP requirements. Looking closer at our operating expenses, sales and marketing expense of $1.8 million was down $1.8 million or 50% year-over-year as a result of realigning our go-to-market strategy. Research and development, inclusive of amounts capitalized, totaled $1.8 million representing a $0.3 million increase over the prior year period. As of June of this year, we had cash and cash equivalents of $7.0 million, up from $4.1 million in the prior quarter. This includes approximately $4.7 million in net proceeds received from the second note with Streeterville Capital, which was put in place in June. With that financial overview, I'd like to now turn the call back over to Tony for a few closing comments. To conclude, the actions taken today are laying the foundation for the remainder of 2022 as we right-sized the organization and worked to unveil compelling products and innovative strategies. We look forward to sharing the next steps in our journey with all of you, and we thank our investors for your continued support and patience as we execute our strategy. Thank you, Mr. Scott. I talked to a group of CIOs that I've known for some period of time, and we have casual conversation regularly on that topic. Each of the CIOs I talked to are getting increased pressure from their boards and their executive team, with more angst around ransomware and zero-day attacks and those kinds of things. Now in some cases, they're being asked to offset an increase in cybersecurity spending with reduced costs in other places. And maybe not at the pace it's been over the last several years, but still definitely on the rise. Well, that's all the questions I have. Well, I think as we've talked in prior sessions, we see the managed service supplier and managed security service supplier customers as a key partner for us. Typically, these providers themselves service any number of customers. Another benefit that comes from this, and it's maybe not lost in this audience, but they're happy to talk about the products that they offer and the successes that they've had because it helps bring them more customers and more business. They often don't want to declare publicly what cybersecurity solutions they're using for fear of putting a target on their backs, among other things. So there's a couple of, I would call it, double benefits to working with these MSPs. The other reality of those is, though, that when we sign a deal like this, they'll typically deploy in a couple of customers, see how it goes, then expand to a larger number and then ultimately make it available to their entire portfolio. And if we do that, I think we'll be very successful in those -- with those customers. We really need to see once we get our new products into GA, which we anticipate is going to be this quarter. Part of the reason for those new products was not only is it a needed solution in the marketplace, but also our theory of the case is that it's going to make it easier to do demos and easier to prove value than convincing somebody to put a piece of hardware behind their firewall. Then having been exposed to and liking our capabilities, an enterprise that is in a hybrid environment where they've got both data centers and cloud workloads and, obviously, employees and what have you running around with client devices, we think we've got all the bases covered in terms of the places where you'd want to have cybersecurity protection. But for getting a foot in the door, obviously, we think cloud and client are a faster way to get the foot in the door. And I think in Q4, a, are we able to get a foot in the door with these; and then b, does it lead to successful contracts and recurring revenue. I guess, first for me, Tony, if we could just get a little bit more color on the Shield sales during the quarter. And then any color on contract duration, whether it's month-to-month or an annual contract, would be helpful as well. As I said before, I can't really see a big pattern yet because we're just too early in the cycle. And while we've increased sales there, once -- if I were to compare these to dogs, one is Poodle, one's a Weimaraner, one's Collie, they just don't look the same and there's no discernible pattern that I can pick out at this particular point. So we'll see where that goes. And again, I think in Q3 and Q4, we'll know a lot more about that. But right now, it's hard for me to pick out a pattern. We have customers in the hospitality industry, financial services, manufacturing, you name it, it's a bit of a hodgepodge at this particular point. No, we did see the increase in the gross profit as it relates to the increased Shield revenues. As you may recall, we had a very expanded sales -- direct sales force at that time. Obviously, we will continue to invest in sales and marketing as we grow and expand our channel and referral channel and reseller channel network, but it will be a scaled increase in spend. So I'm -- it's sooner rather than later, let's just say that. Well, a lot of the growth in cloud in general has been for organizations to move applications that used to be on-prem in their own data centers, they've migrated them into various cloud platforms in Microsoft Azure or to DCP or into Amazon. And just because you move to the cloud, doesn't mean you don't need cybersecurity protection for those workloads. So many organizations today are in what we refer to as a hybrid mode, where they've got some portion of their workloads in the cloud, some portion still in data centers. So with those three bases covered, we think we've got the most important spaces covered that any institution would be concerned about. But as I mentioned earlier, another good attribute of the cloud is that it's something we can demo very easily. With the cloud product and with the client product, we can do a very simple sign-up demo and let them experience our capabilities without all of the change management and everything else that is associated with installing hardware. I mean, there are any new company that's starting out today probably isn't going to build a data center. That's what I would do if I were starting a brand new company today, I'd resist having a data center like crazy. But on the other hand, data centers aren't going to go away anytime soon. So we need to protect everywhere we are, everywhere we're doing business. I think in the past, you've mentioned they come from a variety of different segments of the industry. So we picked these people to talk to because after looking at the space, we realized there were some gaps in the offerings in the marketplace. People have installed many layers of cybersecurity technology in their companies, and they're still getting hacked. And so if you ask yourself why and what the weaknesses are in those architectures generically, you can see that there's still ways that the bad guys are getting in and doing bad things. And so we approach these strategic partners with the notion of saying Intrusion technology can fill a gap in your existing offering, whether it's a hardware product, a service or, in one case, a business that sort of does custom cybersecurity configurations for hire. So -- and the last thing I'll say is those could change over time, but we tried to be very strategic in the selection of potential partners originally. Is the process -- is what's working the process at a pace then -- I know some investors are impatient with it, you probably find to be normal. Well, I think there's a couple of phases to these conversations. But at first, everybody wants to call it just another firewall or just another Intrusion prevention detection device or just another, you name it, because they interpret what we say we do into something that they already know and are familiar with. And then once we get beyond that, then it is a conversation around what the potential business relationship could be and the economics and deal terms, and all of those kinds of things. Wait, that's kind of normal for these kinds of discussions. And so while I'm optimistic, I'm also a realist to know that these things take their own time, their own pace, and you just have to be persistent. And then your resume says you didn't come to Intrusion to run a company of its size or, quite honestly, even 10x the revenue base it currently has. So, I came to Intrusion because I was super impressed with the technology. And I've spent the last four years in particular, but even when I was a full-time CIO role evaluating technology and trying to figure out what was unique and what was different and what could really add value. And when I understood what Intrusion did, that kind of told me over the wall and said I got to go do this. And I'm counting on it being the right strategy, but there's always the market reality. One, it strikes me as the natural investor in this company, given where we are, kind of not just from a standpoint of the company but from a shareholder analyst standpoint, a strategic player, someone who comes in and says, I don't want to -- I don't need to be sold stock at a discount. I know that they are like -- I can show up and by showing up, I can effectively double my money in a day type of thing. Well, I would say broadly, we aspire to do a couple of things. I think we have a good story to tell, and I think we can earn a broader set of investors than probably where we're at today. Not that there's anything wrong with the ones that we have, but I think we're fairly narrowly held at this particular point. In terms of the strategics, there's always the possibility that one would come along and say, they want to marry us or acquire us or whatever. So we'll see where that goes. But the primary thing is to grow this company, expand our product portfolio and really bring value into the market with the technology that we have. And again, it's sooner rather than later. It's -- I'll say, again, it's my strong desire to be able to do that. Obviously, I'm very excited about the next couple of months in terms of getting our products into the marketplace and getting reaction from what I hope is a expanding customer base. And I think as a group, we're very excited about the potential for where all of this can go. These things always take a little longer than anyone hope they would be, but I think we're on the right track and I'm really looking forward to what we can bring to the table in the next couple of months. Thank you, Mr. Scott. Ladies and gentlemen, I will conclude today's Intrusion Q2 2022 financial results conference call."
}