{
    "symbol": "UBS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 10:28:06",
    "content": " I think going through, you will see that the second quarter has been one of the most challenging periods for investors in the last 10 years. This gain aside, our underlying performance reflected good result in a more challenging environment with lower asset levels, higher volatility and increasing rates. And we're navigating this environment staying close to our clients, keeping strong risk and credit discipline and our continued focus on cost. Going to the next slide, basically, you see that the market sell-off accelerated in the second quarter, and that was the case in both equities as well as fixed income. Net new fee-generating assets were flat for the group, but positive for Asia Pacific and also positive for Switzerland. We also saw â\u0082¬12 billion of net outflows in asset management, mostly out of equities. We also focus on deposit offering and optimize our net interest income, where we saw 15% growth across our deposit-taking businesses and deposits were flat against last year. Our markets business had another good quarter, traded well on increased activity. But in times like this, it's where our clients need us most and need our advice modes as well, and that's what we're focused on. Then looking at some of the particular performances that we showed, our investment ecosystem continue to allow our clients with unique insights, opportunities to get through this volatility. We're working with our partners to offer our unique, our clients' unique investment opportunities. For example, private markets where we saw new commitments at â\u0082¬3.9 billion for the quarter or â\u0082¬5 billion on a gross basis. Our CIO recommends that clients with a balanced risk portfolio, risk profile allocated to 10% of their portfolios to private markets. Sustainable investing is embedded in our purpose and our strategy, as you know, and that's why we report on this as well. And that's why we're partnering to create these in many different platforms, subscriber to many different methodologies but also by contributing to the newly developed Swiss climate scores. Last quarter, we saw â\u0082¬0.5 billion of positive inflows in the investment products and that's also representing 8% annualized growth. So as you can see, we're delivering on our promise to offer the clients the right opportunities at the right time. We target the mobile-only retail segment here, which grows at 30% year-on-year. Of course, Q4 clients also have access to the classic UBS offering for more specific services and the platform will be a feeder to those. So basically an app with very snackable content, and people can watch videos, get educated on specific trends, investment opportunities and as the next step also executing those. Thanks to the agile development that we actually apply here and we will have continuous feedback from our clients to ensure that we stay ahead in our developments, both in terms of the offering as well as the user experience. As an example, in the next phase, clients will be able to connect with each other and to experts in interest groups that focus on very specific topics. And you can see that also in this slide where we are executing our cloud strategy, to gain further flexibility to gain further efficiency as well. And we now have around 60% of our computing power fully delivered on cloud, half on the public cloud, half on the private cloud. Within these teams now, we see that technology teams are consisting of 65% of engineers. These are just a couple of proof points how we're making technology differentiator, both in user experience as well as in how we manage technology flexibly and efficiently. And as a result of the combination, our net interest income was up 37% versus last year. In Switzerland, we're building a strong foundation on the technology side, which contributes to being named Best Bank in Switzerland for the eighth time since 2012. In EMEA, as you know, our strategy is very much to improve profitability with a very selective investments in our areas of focus, more towards the entrepreneurial wealth creation, families with large companies and the build-out of our banking proposition to that segment. Specifically on the cost side, where costs were down 9% against last year. Lastly, Asia Pacific, and that's also as a result of our continued focus and discussion with clients to show them our mandate offerings. And overall, you see basically, given the fact that we're talking about 4 regions with selective with a selective update here you see that region diversification is really a competitive advantage for us. This resulted in â\u0082¬2.1 billion in net profit, 18.9% return on CET1 and 70.6% of cost-income ratio, all within target levels. In the second quarter, we bought back another 1.6 billion of shares while maintaining capital ratios well above the requirements. Now heading into the second half of the year, we're well positioned for an operating environment, which remains uncertain, certainly in the next couple of months. I see that so but we're very well positioned to work through that, that's thanks to our strategy, thanks to our business model at values global diversification, operation and financial resilience strict risk management, capital efficiency and a strong capital base. On Slide 10, our net profit in the quarter was $2.1 billion, up 5% year-on-year with a return on CET1 capital of 19%, a return on tangible equity of 16% and a cost income ratio of 71%. First of all, in revenues in the first part, $810 million from net gain on sales. This was partially offset by $147 million real estate related revenue impacts, including a loss of $46 million this quarter. We had $158 million higher litigation including $221 million this quarter, net FX movements were over $200 million each for revenue and expense and netted to a headwind of around $50 million. The revenue story reflected the impact of market levels on recurring and transaction fees as well as lower global banking revenues, mostly offset by higher combined net interest income in GWM and P&C and continued strength in global markets. On the revenue side, Americas represented 40% of our business, followed by Switzerland at 23%; EMEA, at 20% and APAC at 17%. On the right, given the strong efficiencies of Switzerland and APAC and the level of investments in the U.S. On a pretax basis, ex-litigation, Switzerland represented 1/3 of our business, followed by Americas at 23%; APAC at 22%; and EMEA at 21%. GWM profit before tax in the quarter was $1.2 billion, down 2% year-on-year excluding litigation. NII overall was up 24% year-on-year and 11% sequentially, with deposit volumes up 1% year-on-year, including 19% up in Americas and down 6% Q-on-Q. We were able to increase our deposit margins in GWM by over 60% versus a year ago, while providing our funds with very competitive and stable pricing in savings rates, which they appreciated. While we've stayed close to our clients, macro and geopolitical uncertainties and lower asset pricing have kept them on the sidelines. Net new fee-generating assets were $0.4 billion in the quarter, with positive flows into SMAs, alternatives, self-directed mandates and UBS My Way, which more than offset pressure in discretionary mandates and investment funds. We also continue to see high demand in the private market space where, as was already mentioned, we saw $3.9 billion of net new commitments."
}