{
    "symbol": "UBS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 07:14:06",
    "content": " Before we start, I would like to draw your attention to our cautionary statement slide at the back of today's results presentation. Please also refer to the risk factors in our 2021 annual report, together with additional disclosures in our SEC filings. And during these turbulent times, we've remained focused on three key priorities: executing our strategic plans, serving our clients and managing risk. At the same time, we prudently manage our own risk by working together across the businesses and the control functions, we further reduced our exposure to Russia. Our focus on clients and risk management resulted in another strong quarter financially, and it highlighted the resilience of our diversified business. On Slide four, you can see some of the milestones that we have achieved so far this year and in an environment of higher rates, higher inflation, higher volatility, it's more important than ever to ensure that portfolios are well diversified, including exposure to alternatives. And during the last quarter, our wealth management clients committed $8 billion to private markets. Sustainability, as you can well imagine, remains important for our clients, for us as well. And in Switzerland, we now also offer mortgages with preferential interest rates if the proceeds are used to improve energy efficiency of buildings. Our clients are at the center of our strategy, so we're particularly proud to have been named number one in client satisfaction across U.S. wealth management firms in the JD Power survey. But also in the latest Euromoney Private Banking survey, we received 192 awards, including Best Wealth Management in Asia Pacific, Best Wealth Manager in Western Europe as well as the Best Wealth Manager in sustainable investing globally. We're also continuously evolving our mobile applications, making it even easier for our clients to stay connected with us. For example, in the U.S., we launched an industry-leading approach to flexible working that will provide employees in eligible roles with the opportunity to work 100% remotely. Now in short, we're continuing to focus on our strategic imperatives, as you can see. One of those is also sustainability core to our ecosystem, part of our purpose, a strategic focus as well, especially in these volatile times, we should not forget about this. So far, a total amount of around $30 million is raised. So still going to a higher number here, but we have $30 million raised till now. For example, we introduced an inclusive investing group in the U.S., and that team specialized in helping clients promote diversity and inclusive growth through their investments. On the planet side, as you may well remember, we had our AGM earlier this month, our shareholders voted in favor of our client road map across the different scopes. One way in which will evolve our climate reporting is by disclosing emissions based on the Partnership for Carbon Accounting Financials, PCAF in short, this standard should also help us expand our Scope 3 disclosures over time. We also became a founding member of carbon place an innovative trading platform being developed to create a truly scalable voluntary carbon market, and we joined the Green Software Foundation as a steering member to help us achieve net zero emissions from our own operations. And just to give you a bit of an idea as to how close we stay to our clients, our CIO hosted over 1,000 dedicated events, reaching more than 100,000 clients and prospects advising as to how to deal with the currency situation. The fastest products, separately managed accounts and sustainable investments with net new money, excluding money market at $14 billion. Inflows were $1 billion in the quarter, and that's a 16% annualized growth rate. And the majority of these inflows were also into mandates, where sustainable investing is a major driver of growth. Our clients were particularly active in equity derivatives and foreign exchange, where we were able to facilitate high volumes, manage risk, provide access to liquidity, and all this resulted in the highest global markets revenues on record. So to conclude, throughout these complex times, our clients continue to keep their trust in us. And one of the reasons is that the value is being a source of stability, seeing our strong capital position and our strong control environment, they see that as important assets to work with us. And as you can see on the right-hand side here, we significantly reduced our already low exposure to Russia during this quarter. Our clients churned, as indicated, for advice through these challenging times, these times gives challenges but also opportunities. Operating income was up 8% and versus a year ago, making this the seventh consecutive quarter of year-on-year growth. Positive operating leverage meant pretax profit was up 19%, and net profit was up 17%. We also repurchased $1.7 billion of shares in the quarter, and we're well on track to buy back around $5 billion by the end of the year. At $2.1 billion, we delivered the best net profit for first quarter since 2007. PBT was $2.7 billion, up 19%. We made some updates to our scenarios and weightings to reflect the current environment, and we continue to imply - apply a management overlay given ongoing macroeconomic uncertainty. As of March, the total overlay was $204 million, a $20 million reduction from 4Q '21. We remain disciplined in the quarter, managing to keep our expenses, excluding variable and FA compensation, currency effects and litigation, in line with our full year guidance of increasing around 2%. This helped us to deliver a cost-to-income ratio of 70.7%, which we achieved while continuing to invest for growth and while absorbing some inflationary pressure, notably on salaries. Revenue growth in the U.S. led to higher financial advisory compensation, which, together with an increase in litigation provisions, drove costs higher by 5%. Net new fee-generating assets were $19 billion in the quarter, an annualized growth rate of more than 5%. We also continued strong momentum in private markets, where clients committed $8 billion in the first quarter, as Ralph mentioned earlier. Net new lending in the quarter was $0.5 billion as continued positive momentum in the Americas, Switzerland and Switzerland, partially offset by deleveraging in APAC and EMEA. Recurring net fee income grew 7% year-on-year, mostly driven by net new fee-generating asset momentum over the last year, notably from our SMA initiative in the U.S. and from discretionary mandates in other regions, along with inflows into alternatives. Sequentially, recurring fee income was down 3% as the effect of negative market performance and the lower day count more than offset revenue tailwind from FGA. These results were reflective of the challenging geopolitical and macro backdrop that Ralph already described which affected risk taking, especially in APAC, where transaction revenues decreased by around 40%. Despite these factors, we saw continued very strong momentum in alternatives in private markets. Entering the second quarter, clients have generally remained cautious with activity levels reflective of continuing geopolitical and macro uncertainty. Given that markets is now factoring in additional rate hikes in the U.S., we expect to more than offset these headwinds, assuming markets remain flattish with higher NII over the course of the year. For the remainder of 2022, we anticipate an increase of around $1 billion NII year-on-year based on current forward curves and quarter end balance sheet. In the second quarter, we could see around 15% growth sequentially. We continue to see very strong business momentum in P&C in good cost control, driving PBT up 10% to CHF 395 million. Operating income increased 3% with $112 million increase from transaction, recurring in net interest income. This was partly offset by a $16 million valuation loss compared with a $26 million gain in 1Q '21, along with credit loss expenses of $21 million compared with a $22 million credit loss release in 1Q '21. Costs were down 1% benefiting from branch closures in 1Q '21, partly offset by increased tech costs as we continue to execute our digital strategy. The cost to income ratio was 58%, a 5 percentage point improvement year-on-year. Transaction-based income increased 25% to a record level of higher revenues from credit card and foreign exchange transaction also reflected an increase in travel, leisure spending by clients. Recurring net fee income was up 15% to an all-time high, primarily on higher revenues from mandate custody, investment fund and account fees. NII increased by 5% year-on-year, mostly as a result of deposit optimization measures. For the quarter, Personal Banking net new investment product flows was a record $1 billion, an annualized growth rate of 16%. In Asset Management, PBT was down 23% from a particularly strong 1Q '21. Invested assets were 5% lower sequentially, reflecting lower market performance in adverse currency effects. Net new money, excluding money markets, was $14 billion for the quarter, including $2 billion in alternatives with inflows across all distribution channels. Costs were down 2%, helping to keep asset management's cost-to-income ratio just below 70% for the quarter. The IB's PBT increased to $929 million, delivering a return on attributed equity of 28%. Global Markets delivered its highest quarter on record, up 59% year-on-year. Excluding the loss on the default of a prime brokerage client in 1Q '21, Global Markets revenues increased by 4%, primarily driven by higher income from equity derivatives, rates and foreign exchange products. Global Banking revenues were down 30% to $550 million in the first quarter outperforming the global fee pools across advisories, ECM, DCM and LCM. Concerns about inflation in the monetary policy response, along with Russia's invasion of Ukraine, weighed on investor sentiment. Capital markets revenues decreased 41% on subdued issuance and deal flow, especially in equity capital markets. As of end March, our CET1 capital ratio was 14.3%, and our CET1 leverage ratio was 4.16%. Credit and counterparty credit risk increased due to higher client activity and market-driven movements and derivatives in the IB and GWM, as well as higher lending activities in GWM and P&C. Operational risk RWA increased by $2.1 billion in the quarter, reflecting the court decision in the French cross-border matter in December last year, a further $2 billion will be reflected in the second quarter of 2022, bringing the risk - RWA increase related to this matter to $4.1 billion. As of the 22nd of April, we had repurchased $2.1 billion in shares, of which $1.7 billion in the first quarter. Together with around $400 million of dividend accruals, this represents almost 100% of our 1Q net profit. Maybe I can add to that, Kirt, I think on behalf of all the colleagues here at UBS and also the audience here today, I think, still open for questions later, but I'd like to thank you for what you have done for UBS as a CFO, what you have done here in these quarterly result meetings as well making sure that we were all very well prepared. So I'm sure there's going to be - there is a smooth transition in place already with Sarah, but we'll miss you. And in that context, you clearly talk about the offsets to the $1 billion in NII. You mentioned second half, mainly, but also through the second quarter, if I may. There is some upward pressure that we see as well coming through more in the U.S., a bit in Asia and across the investment bank, we see cost pressure coming up around salaries. But I think the - one of the good things about UBS is that we are globally very well diversified with a large part of our cost base actually here in Switzerland, which for once helps us from that perspective. It's probably not the cheapest place to operate a bank from, but there's certainly a place where inflation is low and is manageable at this moment in time as well, and that's what we expect to continue. Secondly, as you know, we launched 1.5 years ago, already a cost savings program of $1 billion. So we feel comfortable with still guiding a 2% cost increase, ex litigation, ex foreign exchange and ex variable comp depending on the market, how the markets develop. What we see is actually, a similar sentiment with clients from last quarter. So basically, UBS as a firm, the stability, the quality of our advice does attract money also with Asian clients. We have seen certainly also continuous deleveraging as well, third quarter in a row. And also just recall that overall Asian markets, of course, have performed poorly relative to other regions. And we started to see, of course, declines, particularly in China equities last year in the third quarter with the launch of common prosperity. So also, we're seeing impacts on recurring revenue. And clearly, that's going to continue depending on movements that we see going forward overall in Asian markets. Regarding the $1 billion in NII progression in terms of the pattern of beta, wouldn't be surprising to you. What we expect is betas overall, our beta overall will be lower as we see the front end of the increases in interest rates. And we've obviously built that into the outlook, the - around the $1 billion that we mentioned that we expect in the upcoming three quarters. Clearly, we will see that benefit in Asia Pacific, although as well, that will be partly offset by the fact that we've now seen deleveraging three quarters in a row. And also I echo the comments to Kirt as well, best for the future. I know you talked about Asia Investors still being a bit in wait and see mode, but do you think the bulk of the deleveraging is now done. Previously, you gave guidance based on the NII uplift on the forward curve, forward curve obviously continues to steepen. So what we're seeing in deleveraging in Asia is basically actively managing together with our clients, the lending facilities that we have in order to support our investments. So how the market develops with the development of the markets, you may either see maybe more leverage again going forward or less leverage, it's more or less determined by the markets and how we ensure that the loan to values and there are facilities stay managed. On top of that, I do think that if you look at our strategy for growth in Asia, one of those initiatives called the Global Family and institutional wealth approach is one that is certainly also a focus on the real higher end of the wealth bank family offices in Asia. So you could expect some more leverage being extended in that segment, but in small steps because clearly, I think we should also make sure that we stay prudent in what we do. And clearly, there is - if the markets go back up, you could see the leverage going back up as well. But over time, we'll provide - is expected to provide more leverage also into the Asian region. I think as you know, that's the region where we have the highest leverage penetration. But also you see actually, therefore, sharper deleveraging when they turn negative, but you also see sharper pickup when they turn positive, and that's the pattern we would expect to see going forward. Overall, in interest - not sure I got completely your question, but just - we guided last quarter that we expected around 750, 700 actually pertaining to GWM, $50 million to P&C. So you also have seen, of course, an increase in the P&C effects as forward curves that moved on from when we last guided. So any movements you might see in terms of balance sheet inflows or outflows, both on the lending and the deposit side, of course, will have an impact overall on what we expect. But I think just if rates hold, obviously, what you would expect is quarter-on-quarter as we get into the first quarter next year in the second quarter, you should see increases just because of the pattern of rates and what we expect to see through the course of this year. I think, of course, before the questions, well, Kirt, also from us, thank you very much for our partnership over the years and for bearing with us at times and all the best of luck in whatever the future brings. One is about the net new money because, of course - sorry, sorry, net new fee generating assets. So on the net new fee-generating assets, I think that's - actually, it's more or less existing clients, where we do see a further demand for mandates. So you see that a large part of the net new fee-generating assets is moving into the managed business, which is what we advise. If you look at the more geographic developments, we still saw positive net new fee generating assets in Asia Pacific, but the largest growth is continues to be in the Americas there. And also in terms of some of the patterns like if you look at alternatives, there's been movement into credit as well as real estate. And as you might expect, there's also been movement more movement into fixed income versus equities overall, if you look at the patterns of investment across mandates funds and alternatives. I would just highlight, of course, you've seen that number come down, and that will continue to come down as interest rates go up because you do see a compression in the upside as we see higher interest rates. And so that should give you a little bit of an idea of incremental sensitivity if we were to see interest rates increase there, I think there's a couple of effects is the higher the interest rates, the more of the time. Of course, we generally see higher betas, but also, we also see outflows from deposits and movement into money markets and into other opportunities with at least some level of interest. When you see - because, of course, you've also kind of shown almost $8 billion of the commitments. But for more private equity-like businesses, we clearly also look at external partners. Thank you very much. And also from my side, Kirt, thank you very much for the help over the years and all the best going forward. I saw what you write on Page four of the Q1 report, the 0.7%, but I'm not sure if that captures all Russian clients are only a subset? So $2.7 billion, almost $2.7 billion of global markets revenue is obviously quite impressive. Thank you very much. And so we did - and you're right, Stefan, I think there's a lot of confusion around scope of Russian clients when people come out with disclosures. And so we wanted to ensure that we were very, very clear on how we drive this is firstly, what we did is we took the total clients that are in scope of the European and the Swiss ordinance regarding maximum overall deposit and outflows and inflows of $100,000. And on that basis, we looked at the total invested assets that those clients hold with us, and that led to the 0.7%. And of course, the conclusion there is well as the largest global wealth manager, naturally, we have a Russian business. But if you think about this in the context of our overall wealth management business, it is not significant at all. Then turning to the IB overall in the market's revenue, I would say that this quarter was a bit unusual, usually in a typical first quarter. And we saw some of that play in, but it was unusual because we - actually more broader geopolitical and market factors were in play as we went throughout the quarter. And as we've highlighted, certainly, equities, derivatives, in particular, along with rates and FX were what drove the very good quarter that we had. In fact, when you look at that population, and we would identify within that there still are certain client segments that might be susceptible to further sanctions, but also there's a large part of that population where we don't believe that there's any likely sanction exposure. So it's a small part of our term invested assets, and we've been pretty conservative at applying the definitions here and the EU and the Swiss are the most strict in their approach to this. And we've also been very proactive in how we've actually looked to reduce our overall business, not just with clients already sanctioned, but also we've looked at populations that have higher risk. Thank you very much. I just wanted to ask how some of those factors play forward, you've obviously told us that there's more op risk coming. I don't know how your models work, whether there's a lag effect and there's more inflation still to come through. And I guess sort of wrapping that up as well, whether you're, I guess, still comfortable with the $370 billion 2024 RWA guidance. Also for the remainder of the year for the additional three quarters, we do expect further increases that are known in terms of model changes that have been encouraged by FINMA, shall we say. Away from that, obviously, it's going to be driven by business volumes. If you look at the market risk RWA increase, we saw because of Reagan stress bar, certainly, if that market volatility subsides, we would expect to see a reduction in that $3 billion that I referenced. Now how - I wasn't sure about your 2024 question, but what we did, we updated our guidance in the fourth quarter. So perhaps you're referring to the impact of adopting Basel III finalization of $20 billion, there's no effect there that still would be our estimate at that $20 billion and still what we would expect subject, of course, very importantly to any FINMA discretion. So actually, the overall net new fee-generating asset flows over the three months where we're pretty well equally distributed. So the $100 million there, and this is a little bit of a line which you see with the $0.6 billion and the $0.4 billion, the $100 million overall is mostly related to derivative and settlements that were impacted and interfered with from the sanctions and where we have either taken wind down costs or we've taken provisions in terms of remaining exposure to receivables we might have, for example, with our nostro banks. I think in terms of the net new fee-generating assets, what we mentioned is our - that $19.4 billion excludes some outflow that we saw with Russian clients as a consequence of the sanctions. It really just depends on of course, the direction of any future new sanctions that we might see. Now regarding lending margins, our margins overall and our Wealth Management business have held up reasonably well. And I think as you see in Asia Pacific with the deleveraging, there's really not - there's not any pressure on margins just because of the supply-demand dynamics. And particularly from the Cantonal banks, where there's an awful lot of pressure to continue to lend and get exposure, particularly to long-duration interest rates, given the fact that deposits have grown quite a bit. And you've seen us in the past, we will actually give up market share and volume in favor of margin. And so we'll continue to manage that in a responsible way, but that's an area we're watching closely. The derivation I did was just the $68 billion AUM change, the $19.4 billion net new money and the $82.3 billion the other reduction which is how I got that is there potentially other changes as well? So I think in addition to that, you also have - you have market moves, you have foreign currency translation, which also was adverse during the quarter. And away from that, there's also a net new money impact, which you can assume was greater than net new fee generating. On the guidance, the $1 billion, I just want to make sure we've got apples with apples here. So are we saying that sensitivity is probably - or the beta on sensitivity to rates is probably slightly higher than the difference between the two numbers given and that the balance sheet is slightly smaller, and we have to adjust for that. And then on top of that $1 billion, do we then have to layer through any additional balance sheet growth. I think that's the level when in previous cycles, we saw a bit of turning out holding back NII sensitivity. So maybe just to restate what the $1 billion is, and this is exactly consistent with how we always guide. And we did the same when we mentioned the $750 million around fourth quarter, and we apply the forwards. And as I said, that's apples-to-apples to compare the $750 million that we guided at the end of $750 million. So it's for the remainder of the year, naturally, there was some positive impact that we saw in the first quarter. And as we said before, we expect, of course, the impact to continue to increase fairly significantly quarter-for-quarter, hence, the 15% guidance quarter-on-quarter in the second quarter, and then you can expect to see a larger impact as we go third and fourth quarter. And as we manage our overall book and, of course, noting that versus a very large consumer franchise, our clients do tend to be more rate sensitive. And as well, we will look at clients as I think about terming out and we will think about CD and term deposit programs accordingly. And also as I mentioned, there was some outflows into money markets, and we would expect that to continue as well. Well, I would just say as the interest rate increases is steepened, obviously, the - you would expect to see clients more prone to looking to term out. And then secondly, on the fee generating asset margin that hold up quite well and in Q1 versus Q4. In terms of the capital impact, so where that's derived from its high-quality liquid assets by and large that we're holding in the U.S. in our banking subsidiary, it's around $9 billion, and it's a mix of treasuries and mortgage-backed securities. Having said that, if we were to reduce that portfolio or we saw interest rates reverse, we actually would see that impact also reverse. Now in terms of fee generating assets margins overall, I think, as you observed, you have seen some stability in that margin over the last couple of quarters. But just to note that going forward, that margin is going to continue to be impacted by overall mix of products and investments that we place with our clients as well as the trends that we've talked about before in terms of and any further move into more ultra-mix versus high net worth. So for us, what's critical is we continue to see very positive run rate momentum from all the net new fee-generating asset inflows that we see. First of all, all the best, of course, to Kirt for the future from my side as well. So really focusing here on the U.S. and Europe, what you saw in April, whatever you can tell us whether you are seeing also some kind of slowdown in the willingness of your U.S. and European customers to invest, to borrow. Maybe I can start with the last one, Flora, which is - it's really hard to comment on a month that we're still running, honestly. So let's not get ahead of ourselves because that would only be kind of 2.5 weeks or 3 weeks in a month, which you can't extrapolate anyway. So I don't think there's a lot of value in commenting on what we have seen in the last 2, 3 weeks. And combined with the cautiousness around inflation news to see around the war, and that is basically muting the investor demand specifically, but that is not different from the numbers that we saw at the end of the fourth quarter. And that is basically - those are the recent numbers that we have, where we see actually in all regions, including Asia, by the way, similar sentiments around our clients and investors. But globally, it's the same numbers like a quarter ago. In terms of the RWA question, there's a combination of factors that I already highlighted. Obviously, all of that is positive for us and consistent with our strategy and also consistent with our plan when we referenced where we expect to be by 2024. And so when you reflect on our markets revenue and the fact that we were up and a lot of that increase was from our equities derivatives, our FX derivatives and our rates derivatives businesses. All of that resulted in higher overall asset levels that correspond, of course, with the very good performance we saw from the deployment of those assets. Then there's a bit there related to model updates, which we highlighted is $1.6 billion, and we referenced that we expect some more of that going forward. As to the increases or the reductions going forward, a lot of that will depend on the business environment and also the continued execution of our strategy. As you said, you reached 100% payout ratio for the quarter. Thank you very much. Nicolas, on the first one, nobody knows how the world will develop, but what we can say is that when we manage the situation, in the beginning, and we were pretty early in derisking even before the war actually started. Clearly, the risk costs are generally coming from as Kirt has already indicated, some counterparty risk as well as some failed settlements basically or block settlements or frozen settlements, whatever you want to call it, because counterparties can perform money-wise, but sanctions for bid us to collect the money or to pay the money. And as you've also seen that the direct risk exposure to Russia has decreased to $400 million, which basically now constitutes of a bit of ASTRO, some counterparty, but a lot of trade exposure which is basically exposure that will self-liquidate with trades being performing. We also indicated we're going to repurchase, we said before up to now we said around $5 billion. And so when you look at the remainder of the year, you can assume that we're going to stick with the progressive dividend and that we're going to follow through on repurchasing up to $5 billion and then the payout ratio will be what it will be. If we look regionally, the U.S. split sounds a bit in terms of having strong revenues like some of the other regions, except for Asia. And then secondly, on litigation, I know you can't talk about this in too much detail, but I was wondering if you could confirm or not whether U.S. regulators have made inquiries to yourself about your block trading activities? So in terms of the Americas and GWM, so what happened in the quarter, as you said, we had 6% top line growth. But then also, we highlighted the fact that we also had a litigation, of course, increase year-on-year, plus we had FA comp increase year-on-year. And also, I would note - last year in the first quarter, we had a onetime overall compensation effect that caused for lower levels of variable compensation. So it's not something that we would certainly expect going forward, except for obviously FA comp. But having said that, also I would note that - so if you think about increases in NII, in general, a payout ratio on NII is far lower than other revenue sources. At this moment, I just want to conclude saying that focusing on delivering our strategy, staying close to your clients, managing risk adequately led to a very strong quarter for us. Strong quarter in terms of continuous commercial momentum with clients, strong quarter in terms of P&L also a quarter in which we feel that the share buyback is showing confidence in terms of our capital position as well. Thanks a lot, Kirt, for all you've done, and let's close the call."
}