{
    "symbol": "UBS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 11:28:02",
    "content": " We also continue to actively manage our deposit offering and optimize net interest income, and thatâ\u0080\u0099s where we saw a 14% growth year-on-year in our deposit-taking businesses. Net new fee-generating assets were $17 million in the quarter a 5.5% annualized growth with positive flows into self-directed mandates, SMAs and alternatives. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Clearly, in the second quarter, we already indicated the shift from the market and specifically for our franchise, an important shift from what we would call micro, which is more the equities business that we are really, really leading in globally as well, as you know, to more the macro, which is the fixed income and the rates business that we have a very high exposure, we have a very strong position in the foreign exchange business, and thatâ\u0080\u0099s where we have profited from our institutional clients being very active on the back of the volatility there. Thank you very much. Thank you very much. Thank you very much. And then my second question would just be on the net new fee-generating assets, the demand you are seeing, both in asset management and wealth management, you talked about an increase in demand for CDs and money market products following the move-up in rates and the additional yield thatâ\u0080\u0099s providing. You do offer the guidance that 100 basis point higher rates will add $0.7 billion on the franc curve and $0.2 billion on the euro curve, do you think those could be substantially offset by deposit beta or mix effect because I see consensus has basically about a $200 million uplift on the Q4 run rate, and we might come to a higher number if we use that sensitivity. As indicated, given the market backdrop, I think we delivered a good quarter â\u0080\u0093 a good quarter, both in terms of staying close to our clients and the flows that are coming through both in the wealth management as well as the asset manager with $18 billion of net new money coming through on the asset manager. And on the other side, it shows the flexibility of our investment bank in terms of the allocation of resources to move quickly from in market that is more micro related to a market thatâ\u0080\u0099s more macro driven and being able to profit from that as well with an increase in our FRC revenues for 64% and P&C doing well over time, a very stable business growing both on the lending side as well as on the deposit side."
}