{
    "symbol": "SYNA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-03 21:57:07",
    "content": " For the December quarter, our GAAP gross margin was a company record at 53.5%, which includes $19.9 million of intangible asset amortization, $4.1 million of inventory fair value adjustment, and $1.3 million of share-based compensation costs. GAAP operating expenses in the December quarter were $147.5 million, which includes share-based compensation of $35.3 million, acquisition related costs of $10.4 million consisting of intangibles amortization and transaction costs, amortization of prepaid development costs of $2.5 million and restructuring-related costs of $5.1 million. Our December quarter non-GAAP gross margin of 59.5% was a new company record and at the high-end of our guidance range, reflecting a continued strong mix as we prioritize our highest value products while passing through changing input prices. December quarter non-GAAP operating expenses were at the low-end of our guidance at $94.2 million, and up $5.8 million from the preceding quarter due to the inclusion of DSP Group. We had record non-GAAP net income in the December quarter of $132.8 million, which is an increase of 22% from the prior quarter and an increase of 58% from the same quarter a year ago; non-GAAP EPS per diluted share was $3.26 as our focus on profitable growth continues to drive positive earnings for our shareholders. We ended the quarter with $574 million of cash, cash equivalents, and short-term investments on hand, an increase of $227 million from the preceding quarter as a result of strong cash flow from operations of $122 million and the inclusion of cash & investments which was acquired as part of the DSP Group transaction. We expect our GAAP operating expenses in the March quarter to be in the range of $159 million to $166 million, which includes acquisition-related charges for intangibles and transaction costs, prepaid development cost amortization, share-based compensation, and restructuring costs. We expect our non-GAAP operating expense in the March quarter to be in the range of $104 million to $108 million, an increase from the December quarter as we now add a full quarter of expenses related to DSP Group acquisition, while continuing to self-fund our organic growth opportunities. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}