{
    "symbol": "BK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-17 12:14:04",
    "content": " And assets under management of $1.8 trillion decreased by 23%, also reflecting lower market values and the unfavorable impact of the stronger U.S. dollar, partially offset by cumulative net inflows. Fee revenue was up 1% and net interest revenue increased by 54%, driven by higher interest rates, partially offset by lower deposit balances. In Asset Servicing, investment services fees were down 3% and as growth from abating money market fee labors, high client activity, and net new business was more than offset by the impact of lower market values and the strengthening of the U.S. dollar. In Issuer Services, Investment service fees were up 2%, primarily reflecting the reduction of money market fee waivers, partially offset by previously disclosed lost business in Corporate Trust in the prior year and lower fees from depository receipts programs for Russian issuers. Fee revenue increased 11% and net interest revenue was up 34%, reflecting higher interest rates and higher loan balances, partially offset by lower deposit balances. In Treasury Services, investment services fees were up 3% and driven by lower money market fee waivers, new business and slightly higher payment volumes, partially offset by higher earnings credits for our clients on the back of higher interest rates. Pending clearance and collateral management, investment services fees were up 5%, primarily reflecting higher U.S. government clearance volumes driven by continued demand for U.S. treasury securities due to elevated volatility amid a rapidly evolving monetary policy backdrop. In Investment Management, revenue was down 20%, primarily reflecting lower market values, the unfavorable impact of the stronger U.S. dollar as well as changes in the AUM mix, partially offset by lower fee waivers. In Wealth Management, revenue was down 7% as the decline in fee revenue resulting from lower market values was partially offset by higher net interest revenue, reflecting higher interest rates. Based on current market implied interest rates, we now expect net interest revenue for the full year to be up approximately 30% compared to 2021 as we expect another quarter of sequential NIR growth. Given the continued decline in equity and fixed income markets as well as the continued strengthening of the U.S. dollar, we now expect fee revenue for the full year to be down slightly compared to 2021, assuming equity and fixed income values as well as currency stay at the levels where they ended the third quarter. They've been focused actually on building collateral buffers throughout the year, and this prudence, I think, has been quite helpful in protecting client portfolios and Insight also been, over time, working on a strategy that they called integrated solutions, which is really encouraging pension funds to be able to look across all of the types of assets that they have so that they see the whole and not just the individual pieces. If you want to kind of drilldown a bit more in terms of Security Services and what you're seeing there about -- the 11% decline, about 13% of that was due to lower market values as well as the strengthening U.S. dollar, and that was partially offset by about 2% of net new business. You're correct, I did guide, I think it was around second quarter that we'd expect a decline of about 5% to 10% by -- well, average to average Q2 to Q4 in the third quarter, as you also rightfully pointed out, deposits down 7%."
}