{
    "symbol": "BK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-18 13:06:04",
    "content": "  Referring to Slide 2 of our financial highlights presentation, we continue to see healthy underlying momentum across most of our businesses and reported revenue of $3.9 billion, which was roughly flat year-over-year and it was up 2% if you exclude the impact of government sanctions and the additional actions that were taken related to Russia. The benefit of higher market values as well as continued momentum across many of our businesses was offset by the impact of lost business in Pershing and Corporate Trust in the prior year, lower FX revenue of elevated levels in the first quarter of last year and the unfavorable impact of a stronger U.S. dollar. While not on the page, firm-wide AUCA of $45.5 trillion increased by 9%, of which 8% is growth from new and existing clients and 1% is driven by the impact of higher market values, net of currency headwinds. AUM of $2.3 trillion increased by 2% year-over-year, reflecting cumulative net inflows and higher market values, partially offset by the unfavorable impact of the stronger U.S. dollar. Investment and other revenue was $70 million and net interest revenue increased by 7%, reflecting higher interest rates on interest-earning assets, change in mix and lower funding expense. Fee revenue was down 5% and up 1% excluding the impact of Russia and net interest revenue was up 6%, reflecting higher interest rates, partially offset by lower deposit balances. In Asset Servicing, investment services fees grew by 5%, primarily reflecting higher market values and net new business, partially offset by slightly lower transaction activity from existing clients. Higher market values were more than offset by lower capital results and lower equity income as well as the unfavorable impact of the stronger U.S. dollar, which is more impactful in investment management, given that approximately 50% of our revenue is earned in foreign currencies. as we still have that 130 basis points to Emily’s point and in our modeling, if things run the way we would expect them off of the forward curve those deposits are going to come down 10% or so, and that’s going to free up quite a bit of Tier 1 leverage."
}