{
    "symbol": "LVLU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 22:19:06",
    "content": " For new customers acquired in Q3, our event and cocktail dresses demand as a percent of total revenue slightly outpaced Q3 of 2021, with strong year-over-year outperformance in our event dressing, demonstrating that Lulu's remain successful in attracting new customers with our affordable luxury event and going out dressing. In Q3, the household income distribution of all active customers as well as newly acquired customers was similar to previous quarters and last year, which we see as a confirmation of our successful marketing efforts to generate broad Lulu's brand appeal across both Gen Z and millennial women across a wide income range. While we benefited in Q3 from the combination of new customers acquired and continued loyalty from our existing customer base, our net revenues decreased slightly to $105.3 million, representing a 1% or $1 million decrease over the same period in the prior year. Also, worth noting is our gains in the quarter in Lulu's branded product sales as a percent of total unit sales, coming in over 90% of our Q3 demand, reinforcing our customers' preference for our proprietary Lulu brand. Q3 selling and marketing expenses were $19.4 million, down about $1 million from the same period in the prior year, primarily due to shifting some performance marketing spend of the P&L to support higher promotional levels during the quarter, reflected in the increase in discounts captured in net revenue. Our inventory balance at quarter end was $49.4 million, up $26 million from last year's levels, and up $842,000 or 1.7% over Q2 of 2022. Please proceed with your question. Please proceed with your question. Please proceed with your question. And we crossed over the 90% threshold this year in Q3 with more than 90% of our product sales coming from the Lulu's brand and actually saw more of a deceleration in the third-party brands in favor of our own, which is just a testament to the quality of our product and our customers' appreciation for that quality. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}