{
    "symbol": "LVLU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 21:04:03",
    "content": " Our future expectations regarding financial results, references for the second quarter ending July 3, 2022, and outlook for the year ending January 1, 2023, market opportunities, product launches and other initiatives, and our growth, these statements, which are subject to various risks, uncertainties, assumptions, and other important factors could cause our actual results, performance or achievements to differ materially from results, performance, or achievements expressed or implied by these statements. We saw excellent growth and active customers in both new and repeat, reaching 3 million in the last 12 months ended April 3, 2022, compared to 1.9 million for the same period last year. We're very proud of our large diverse community of loyal customers and the 12 months ended April 3, 2022, we serve 3 million active customers, compared to 1.9 million active customers in the 12 months ended April 4, 2021, representing growth of 58% and up to 200,000 active customers compared to our 2021 year ending active customer count of 2.8 million. Moving down the P&L to give some insights into expense line items, Q1 selling and marketing expenses were 21.9 million, up 8.5 million from the same period in the prior year, due to the return of online performance marketing spend to a more normalized state modestly ahead of the increase in net revenue, as well as some increase spent on top of funnel brand awareness marketing. For inventory, while we continue to turn quickly at over an eight times on an annualized basis, we ended the quarter with 42.1 million on hand, an increase of 19.3 million compared to 22.8 million at the end of Q1 2021, setting us up well to meet our customer demand in Q2. Therefore, we're raising our 2022 full year net revenue expectations to a range of 490 million to 500 million, which represents a year-over-year growth rate of 30% to 33%, up from our previous guidance of 480 million to 490 million. Our adjusted EBITDA margin rate guidance continues to capture roughly 4.5 million of expected incremental expenses related to being a public company for the 2022 fiscal year, compared to the less than two months of public company expenses recognized in 2021. Our updated guidance also accounts for the potential for increasing return rates, which we've already experienced in Q1, as well as a higher mix of event based dressing as our customer returns to her social calendar, and we continue to meet pent up demand for weddings and wedding related events. Additionally, we expect adjusted EBITDA margins to be lower in the second and third quarters this year, compared to the second and third quarters of last year, primarily related to higher public company expenses, incremental marketing investments as well as timing of expenses for infrastructure investment initiatives, which will require some redundant operations. There's could be some operational inefficiencies as we're expanding our Southern California facility, but it's more so around being opportunistic around taking our upside to more awareness, marketing and driving more top of funnel as well as public company costing, fully burden this year versus last year, which is expected to be over $4.5 million."
}