{
    "symbol": "IDEX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 18:16:06",
    "content": "  Operator: Greetings, and welcome to the Ideanomics Third Quarter 2022 Earnings Call. Joining me today, I am pleased to have Mr. Alf Poor, the Chief Executive Officer; Mr. Stephen Johnston, Chief Financial Officer; and Mr. Robin Mackie, President of Ideanomics Mobility. During the call, we will make forward-looking statements such as dialogue regarding our revenue expectations or forecasts for the remaining quarter and the full fiscal year 2022 and 2023. Actual results may differ materially, and as a result of various risk factors that have been described in our periodic filings with the SEC. We assume no obligation to update any forward-looking statements as a result of any new information or future events, except as required by law. In addition, other risks are more fully described in the Ideanomics public filings with the US Securities and Exchange Commission, which can be found at www.sec.gov. Today, November 9, 2022, the company filed with the SEC its Form 10-Q for Q3 2022, and afterwards issued the press release announcing those financial results so participants of this call who may not have already done so, who may wish to look at those documents as we provide a summary of those results on this call. Mr. Stephen Johnston will speak to the company's operating and financial results for the third quarter 2022; Mr. Robin Mackie, President of Ideanomics Mobility will speak to the companyâ\u0080\u0099s operational activities in mobility and the progress made since our last earnings call. And then finally, Mr. Alf Poor will make management's closing remarks, which will be followed by our Q&A. I now hand the floor over to Mr. Alf Poor, Ideanomics CEO. Thank you, Tony, and thank you to everyone joining our Q3 earnings call today. On today's call, we will be introducing our new Chief Financial Officer, Stephen Johnston. But certainly, there is more work to be done at the government level in order to support the transition to zero-emission transportation. Despite these challenges, we have made progress in each of our businesses as Robin will speak to. Year-to-date, Energica sold 78% more motorcycles compared to the same period last year and Solectrac sold more tractors in Q3 than they did in all of 2021. Just one day after Hurricane Ian hit Florida, our WAVE wireless charging system in St. Petersburg was back up and running for the local transit authority. In previous quarters, our non-core fintech businesses and a China EV sales business made up the bulk of our revenues. By transitioning away from non-core businesses and market, we can place our focus on the areas where we anticipate the more meaningful market opportunity. Together, we offer a better product that meets customers' needs today and tomorrow. Ideanomics Energy and Ideanomics Capital will accelerate VIA sales with our as-a-service subscription model, and offer customers turnkey charging solutions to support the mass deployment of VIA vehicles. This is what our customers in the last mile delivery and logistics markets require, a simple, integrated and affordable way to electrify. To do this, we are focusing on the fundamentals of cost savings and execution, in conjunction with pursuing strategic financing from alternatives to dilutive equity-based plans. Put simply, this means winning more customer contracts and generating higher margin revenues, which will help demonstrate the path to profitability our investors expect. I will now hand you over to Stephen Johnston, who will take you through our financial results for the quarter. Thank you, Alf, and thank you to everyone joining this call. Since I joined Alf, Robin and the team at Ideanomics, I've emphasized a focus on disciplined capital investment that will underpin our financing activities. I'm focused on ensuring consistent on-time delivery of our financial filings, driving gross margin expansion and managing our cost structure, all of which will enable us to navigate the current economic environment. I'll talk more about this, but first, I'd like to present you with Ideanomics Q3 results. Revenue for the quarter was $24.3 million, 9% lower than the same time last year. This was primarily due to a decrease in revenue from Timios, our title and escrow services business and a decrease in revenue from our China-based EV resale business, which offset growth in our expanding EV businesses in US and Europe. In Q3, we generated $16.2 million in revenue from EV, charging and battery products and services, an increase of more than 50% year-over-year. $8.8 million of that EV charging and battery revenue came from the US and Europe, four times higher than the same time last year. This is down compared to the last quarter, and the decrease was primarily due to higher levels of fixed cost in our organization, which we have since begun to address and offset through cost reduction measures. As of quarter end, Ideanomics has cash of $25.2 million. Over the past nine months, we used more cash for operations compared to the same time last year as the macroeconomic conditions have temporarily slowed growth for our acquired businesses, who have customers with incentive dependencies. Cash used in investing activities over the last nine months was $90.8 million, which was primarily due to expenditures incurred for the acquisition of Energica. In response to market headwinds, Ideanomics is implementing a more focused capital investment process. We are also continuing our journey to create a leaner, more focused company, 100% committed to becoming a world-class provider of commercial EVs, charging products and related services. Looking ahead, Ideanomics will continue to raise capital. We are exploring attractive capitalization opportunities from diverse sources, we anticipate bringing in additional capital to the business before the end of this year with an emphasis on non-dilutive financing, as Alf mentioned earlier. As an example, we have agreements with two separate companies to finance dealer expansions for Energica and Solectrac. I'd like to now take the time to introduce Robin Mackie, President, Ideanomics Mobility, who will discuss mobility and energy verticals in more detail. As a reminder for everybody on the call, my focus continues to be on execution and performance improvement across the business. Building on Alf and Stephenâ\u0080\u0099s comments, we've initiated a number of cost-saving measures across the organization, with business reviews completed at both corporate and operational levels. These initiatives have enabled us to cut our operating costs, while retaining key talent and maintaining a focus on value-added projects with the highest returns. As Stephen mentioned earlier, Ideanomics generated $16.2 million in revenue last quarter from the sale of EVs and charging infrastructure. Firstly, our targeted investments in growing production and distribution capabilities, of which the clearest examples will be with Energica and Solectrac. Energica has doubled its production, launched Energica inside a business unit, introduced new models with a wider market appeal and secured its first fleet orders underpinning the success is a simple fact. For example, we delivered the first 88 Energica EsseEsse9 to the Indonesian police force, with our partner, UTOMO Corporation. This is an exciting new market segment for us, with recently expanded manufacturing capabilities and a growing global distribution network. Last quarter at Solectrac, we saw the assembly and sale of the first 44 e25 tractors from the Nolan manufacturing joint venture in Northern Carolina. On top of this, we recently completed a new high-level assembly line at the company's Windsor facility in North California. With each dealer, we typically see initial orders of up to six tractors for stock, generating immediate revenue. This dealer expansion will enable us to engage with larger opportunities in the feet and municipal markets, as reflected in our recent deal to supply multiple tractors to a California University. Additionally, US Hybrid completed in partnership with a major automotive group, a retrofit of a top stacker unit, a type of vehicle used to lift and move containers at ports and warehouses, hydrogen fuel cell hybrid power. In quarter three, Ideanomics Energy continued to grow its pipeline of opportunities, including additional opportunities unlocked by the direct funding provided under the Inflation Reduction Act. Additionally, we recently released an update to WareSmart, a free tool designed to help warehouse operators in Southern California become compliant with emissions reduction regulations. In just a few days, we saw an increased sign-up rate and began conversations with several high-quality leads. As a reminder, not every opportunity will translate into a contract but these are strong, positive leading indicators, showing that we are offering our customers exactly what they're looking for. At WAVE, we've begun producing wireless chargers for phase two of our collaboration with Antelope Valley Transit Authority located in Northern Los Angeles. We're progressing with previously mentioned project with a larger logistics and delivery customer, which is expected to be completed in the first half of 2023. PEA, our containerized DC fast charging investment with Peterbilt  Group is in the final stages of testing with the first systems expected to be delivered in the US in quarter one of 2023. And now finally, we have Alf Poor to give management's closing remarks. Before we open the floor to questions, I'd like to reiterate Ideanomics core value proposition. We make electrification, fast, simple and more affordable for the commercial EV fleet operator. We do this by combining EVs, charging and financing under one roof. On top of that, we partner with customers on front-end planning to ensure optimal EV and charging infrastructure deployment. The warehouse tool, Robin mentioned, is a great example of our customer value proposition in action. By making it simple and straightforward to understand and mitigate the fines, we've opened up some very promising doors for the Ideanomics Group. To close, as I mentioned in my last call, I want to remind you all that Ideanomics will continue to raise money. Looking ahead, we'll use this capital to thoughtfully scale our businesses, including VIA Motors, where we are well-positioned to win an increasing market share in the high-value last mile and local delivery space. This is one example of where we can focus our efforts as a first mover to generate meaningful revenues and in turn, shareholder value. So sorry, operator, I think that we'll take one of the questions, we're going to want people to get their hands up for sure within the telephone queue, but we did have some questions that came in on the Say platform and the top two questions that were voted on. So Alf, this is going to be for you to top say questions, the platform that was voted on for shareholders. And if you could speak to a reverse split, which seems to be a top voted one there. So watch this space is the best I can give you at this time on the VIA deal, but we are looking to finalize in the very near future. In terms of a reverse stock split, we don't believe that is a viable option for Ideanomics at this time. It's certainly, as I've previously mentioned, that have been even presented to our board as an option at this point. And the reason we're not considering a reverse stock split this time is a, it's typically a negative indicator to the market. So you'll see the stock kind of settle down below its split value after the transaction; and b, the commercial EV sector has been beaten up pretty badly. And I think the recent market pressure, the stock market coming down, in general has kind of piled on to the commercial EV sector. So for those reasons, we're not looking to hit the panic button and do a split. Tony and the team reported on social media or other platforms as they gather information and bring it to the management team, but not currently something on our â\u0080\u0093 on our agenda to take a look at. Thanks for taking our question and welcome, Stephen, looking forward to speaking and working with you going forward. For me, the focus primarily is on the growth organizations at the moment, and we're seeing on quarter-on-quarter improvement on the throughput of those businesses. Specifically, I'm talking about Energica and Solectrac, who are gaining more and more market traction every quarter. Also, the transition that's been made at US hybrid as we move forward to cash flow breakeven and into profitability through the last quarter of this year. And then WAVE, I think we'll see some traction through quarter one, quarter two. As it pertains to WAVE specifically, can you just give us an update on how you intend to apply for the projects that qualify under the Navy federal funding. Any color whether you can give us, I know the projects are still being -- are still being developed. Previously, we've used the Department of Energy and others to help us develop the technology. And I think that's the subtle difference, Andres, in the approach and where we sit at this time. There's tremendous interest in Ideanomics at this time, because we've actually got products on the road and in the ground, so to speak. So, there's really a few different types of conversations taking place. And there's two really interesting ones that are developing the debt market, which is an obvious place for a high investor returns. So we have ongoing conversations with debt providers, that's a longer path than an equity transaction, equity transaction. They look at Ideanomics share price, they look at the volatility, they look at the volume and the deal is struck in a matter of days to maybe a couple of weeks maximum. When you're dealing with a debt fund, we're talking about three to six months of due diligence, multiple management presentations, inspection of IP registries, the . A number of the private equity funds have stepped forward, those with -- some of them have got large ESG impact focused funds where they wouldn't normally approach a public company, they're seeing opportunity because of the lack of capital. And they could probably be -- which would be some relief to investors, they probably could be the cheapest capital we could access because their structures will be less like a debt or a mezzanine financing and more like a mix between debt and equity. But we're in some significant conversations, and we expect to include them before the end of the year. Ideanomics is a dynamic business, as you know, Andres. As you know, Andres, whether it's WAVE, whether it's Energica, whether it's VIA Motors, they're all differentiated and they're all strong from a technology perspective, unlike a lot of the products in the market, which is just a body design with somebody else's tack underneath. If we're going to do acquisitions in the future, they won't be so tech heavy, they'll be more focused on revenue generation and force multipliers for generating revenue within the group. So -- if we're going to access the acquisitions market again and take advantage of that, it would be for revenue-generating companies that can help multiply the revenues across the group. And it's just, I think, you've like mastered all this wording. We recently announced a very large deal with an emergent bus manufacturer, a small shuttle bus manufacturer who chose the platform over other competitors. To answer your second question, we expect to be in the market by quarter one, end of quarter 2024 and are currently looking at both facilities and contract manufacturing partners to enable that. We have delivered what I would call validation prototypes, which is a normal process within the automotive industry. Our next phase is building what we call alpha and those alpha vehicles will actually put into hands of end users who expressed an interest, and we expect that to be completed by the end of quarter one 2023. thank you so much. I think one of the things that's really important to understand here -- and I said this in some recent investor presentations I got from conferences, the commercial EV sector is only just starting to mature. We have a technology forward approach, which is paying dividends at this time to us, but the industry is immature, okay, which is why you see our subsidiaries like Energica and Solectrac racing ahead. They're raising ahead why because they're sold through dealer distributors, So, it's more like a consumer purchase. And you can see that when you look at any of our peers because most of them booked zero revenue, zero revenue, zero revenue. And then we've obviously got Via, which doesn't start production as Robin said until 2024. Many of the companies that they expect in our sector are struggling right now with $50 million, $100 million a month burn because they're maintaining manufacturing facilities when they don't have any customer orders. So, that's the answer to our lady's question is we've built a world-class company. The market has been slow to mature, but because we've stepped into this with a diverse approach we are actually making revenues, and we're not just purely losing money like many of the other folks in the space. Thank you so much, everybody, and that is all the time we have for today. We encourage our community to continue to reach out to us, and we can answer any of the questions that you may have individually. We'd like to thank our listeners and shareholders, analysts and others who have taken the time to listen to our earnings call today. To be alerted to news, events and other information in a timely model, we recommend you following us on our social media channels, sign up for our newsletter and explore our website at www.ideanomics.com. Thank you, everyone, for participating in the call today."
}