{
    "symbol": "IDEX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-09 12:50:27",
    "content": " Joining me today as well, I am pleased to have Mr. Alf Poor, the Chief Executive Officer; Mr. Robin Mackie, the President of Ideanomics Mobility; Mr. Conor McCarthy, Chief Financial Officer; and we've got some special guests for you today on today's call, Mr. Bob Purcell, CEO of VIA Motors; and of course, the greatness of Cevolini, Livia Cevolini, the CEO of Energica. Mr. Robin Mackie will speak to the company's operating activities in Mobility and the progress made since our last earnings call, including remarks from our special guests today on the call, which Ms. Livia Cevolini of Energica; and of course, Mr. Bob Purcell, CEO of VIA Motors. In just the first two quarters of this year, we've already surpassed our 2021 figure with just over $40 million in EV-related revenue and we're expecting further growth in 2023. So they'll grow probably more aggressively than Solectrac because they've got already a much larger footprint to expand into, whereas Solectracâ\u0080\u0099s expansion in the middle of this year into its new facility obviously, saw the Q2, Q3, Q4 revenues will jump and largely be in the $3.5 million to $4 million range per quarter. So although we've got a really strong order pipeline, I need our investors to understand that as those as-a-Service contracts get deployed and those revenues come in, we're going to be earning that revenue over a number of years rather than taking an upfront revenue as we typically have in the past with our operations like U.S. So I just want to set the expectations that they are different types of businesses, and that's why you're seeing the immediate revenue jumps in Solectrac and Energica because they sell more on a one-to-one basis, whereas when you're working with the WAVE or you're working with the U. S. Hybrid, for instance, those sales are more kind of project and larger scope in the way that they're implemented."
}