{
    "symbol": "ACA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 05:15:19",
    "content": " All segments contributed to this quarter's results led by our growth businesses within Construction Products and Engineered Structures, with each of our segments generating double-digit increases in revenue and adjusted EBITDA, we delivered record second quarter adjusted EBITDA and record adjusted EBITDA margins of 16.5%. Overall adjusted EBITDA margin increased 120 basis points to a record 16.5% in second quarter, led by Engineered Structures and supported by consistent year-over-year margins in construction and transportation despite inflationary pressures. Moving to Engineered Structures, on Slide 13, second quarter adjusted EBITDA increased 30% outpacing revenue growth and resulting in a 270 basis point increase in margin, although each business contributed to the better-than-anticipated quarterly results, utility structures was the primary driver of the significant outperformance during the quarter and versus the prior year. Moving to Slide 18, although we continue to face challenging environment in our cyclical businesses, we have seen early but promising signs of market recovery, most notably, our barge business secured $35 million in new orders in the second quarter adding to the $105 million new orders received in the first quarter. So as we think about the back half, like I said, a 16% or so margin for the first half, it may be, it may be a challenge to meet that level for the second half, we do have some slots to fill later in the year and often those come with big market orders, so there could be a potential those slots selling with lower margins, but all in all, our expectations for the segment is to continue to have a very strong second half, but it just may be hard to meet that really perfection level that we achieved in the first half. That's why we expect the second half to be a little lower in the cyclical businesses, which will be over-compensated by the growth businesses including now, the new acquisition, so I'll give you a little color on the three cyclical business, starting with barge as we've discussed before, this is a business driven specifically, it has several drivers."
}