{
    "symbol": "IBP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 16:55:05",
    "content": " For the quarter, within our Installation segment, we experienced a 28.3% increase in residential same-branch sales from the prior year period, which was driven by a 29.4% increase in installation single-family same-branch sales growth and a 23% -- 23.1% increase in installation multifamily same branch revenue. During the first 2022 first quarter and April, we acquired a North Carolina-based installer of spray foam insulation, fiberglass insulation and fireplaces in the Asheville, North Carolina market with annual revenue of approximately $8.5 million and a New Jersey-based distributor of gutter supplies and accessories to the U.S., Northeast and Mid-Atlantic markets with annual revenue of approximately $45 million. From a segment standpoint, installation revenue increased 30% to $561.6 million driven by strong growth across IBP's residential and new construction market and improvements in our commercial end market. On a same branch basis, installation net revenue improved to 22.2% from the prior year quarter, driven by single-family same-brand sales growth of 29.4%, multifamily same branch sales increased 23.1%, our residential first quarter same-brand sales growth of 28.3% significantly outpaced the total U.S. housing completions decline of 5.5% during the quarter. Installation, same-branch commercial sales increased 5.9% in the 2022 first quarter, while our commercial same-brand sales were roughly flat in the quarter relative to the same period last year. During the first quarter of 2022, the acquisition of new businesses drove an increase in our recorded amortization expense to $11.1 million compared to $8.4 million for the same period last year. Adjusted EBITDA as a percent of net revenue was 14.3% for the 2022 first quarter, a 180 basis point improvement from 12.5% for the same period last year. Some of the other products are even may be more difficult, certainly in terms of lead time and probably potentially even -- they're a little harder to manage in terms of price increases, too, because there's not the same degree in many cases of kind of forward notification that you get inside the fiberglass industry."
}