{
    "symbol": "IBP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 18:42:12",
    "content": " Any forward-looking statement made by management during this call is not a guarantee of future performance and actual results may differ materially as a result of various factors including without limitation the adverse impact of the COVID-19 crisis, general economic and industry conditions, inflation and interest rates, the material price and supply environment, the timing of increases in our selling prices and factors discussed in the Risk Factors section of the company's Annual Report on Form 10-K as may be updated from time to time in our SEC filings. During the 2022 second quarter and August, we acquired a New Jersey based distributor of better supplies and accessories to residential multi-family and commercial markets, primarily in existing or retrofit construction projects across the US, Northeast and Mid-Atlantic with annual revenue of approximately $45 million; a California based installer of fiberglass insulation, spray foam insulation and acoustical ceiling insulation into new residential multi-family and commercial projects in California with annual revenue of approximately $14 million. From a segment standpoint, installation revenue increased 32.1% to $638 million driven by strong growth across IBP's residential new construction market. Installation same-branch commercial sales increased 4.7% in the 2022 second quarter, while our heavy commercial same-branch sales remained roughly flat in the quarter relative to the same period last year. On a GAAP basis, our second quarter net income increased 61% from the prior-year quarter to $59.9 million or $2.07 per diluted share. During the second quarter of 2022, the acquisition of new businesses increased our recorded amortization expense to $11.3 million, compared to $9.2 million for the same period last year. Adjusted EBITDA as a percent of net revenue was 17.7% for the 2022 second quarter, a 170 basis point improvement from the same period last year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}