{
    "symbol": "IBP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 15:01:02",
    "content": " There should be for the industry some impact for that as we go into the back half of the second quarter as well as probably the third quarter of this year but as we were talking in the in the previous question to the extent that we have a solid spring selling season, which there are a lot of indications that that'll be the case, the cadence of completions versus permits and starts to be such that you're not going to see, assuming a strong spring selling season, you're not going to see that much of a delta or decline in our opinion on single family completions because builders in many conversations that we've had with both public and private builders, they are getting ready for this pickup in order and sales activity so that they can quickly start getting homestead. If we look at the growth trajectory, the details that you provided in terms of the underlying dynamics between installation and other, you do see more of that gap on margins where maybe a few years back, you would have been in the high 20's and now you're in the 34% range. On the single family side, in terms of what that backlog means for the industry, as we said again, in an answer to a previous question, a lot is going to depend upon the spring selling season, which is looking very encouraging right now, but given the decline that we've seen in the past a couple of months even longer, permits and stars, I think it's logical to assume that you would have an impact relative to single family completions as we go through the end of the second quarter and into the -- into the third quarter, potentially. it's been touched on a few times on the call so far, kind of the more recent optimism from the builders and I think late last year, coming into this year, the consensus was kind of we would need to see interest rates come down or at least stabilize or some progress on getting home prices at a more affordable level for these mortgage rate levels to really see a rebound in housing demand, but we haven't really seen significant progress on either of those. Yes, it's really more just the timing of when we're doing work, quite frankly, and as we said earlier, and I think if you -- looking at it on a full year basis, in terms of our volume growth of 5.5% versus total completions growth of 3.7% make sense and we will favor price over volume and we think that, that is the right decision and we have lots of experience where we give up volume in the short term, only to get it back because our competitors can't perform to the level that our customers want. We continue as we've said in our prepared comments to kind of target at least $100 million dollars a year in revenue acquisition, maybe straight down the fairway in terms of kind of what we're used to in normal -- in terms of products etcetera and acquisitions, but what I would say is, we basically for the most part, we're buying businesses obviously off of trailing earnings, right, and I don't think there's very many contractors out there at this point that are showing numbers that reflect a great deal of weakness. Well, again, we don't provide guidance, but as we said in an answer to an earlier question, if you look on average over the past five, six years, gross margin has then sort of in that 30% range, high 20%, 30% range and because we're going to value price over volume, we believe that the historical range should be consistent as we go through the next couple of years as well."
}