{
    "symbol": "FTHM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 23:22:02",
    "content": " Although our fourth quarter projections, which Marco will discuss momentarily are lower than originally hoped and planned, with market conditions in mind, we are working with each of our business heads to reduce companywide expenses by a total of $1.5 million per quarter by Q1 of next year. Expenses related to market activities were at $1.5 million for the 2022 third quarter versus $591,000 for last year's third quarter. Over the long term we continue to believe that we can generate adjusted EBITDA exceeding $40 million per year and $100,000 to $110,000 annual transactions and that we should be able to reach these levels in the next several years. So when we look for next year, what we're looking for is if you look at the two key things that we are doing; reducing expenses by $1.5 million a quarter, and then the increase in fees. And we do think that we're going to increase transactions next year as well, but we're making the assumption of no transaction growth, so assuming the worst if you will, but the combination of the increase â\u0080\u0093 the combination will continue to increase our agent count by hopefully over 30% a year, and then the combination with combined, with the increase in fees and the reduction in expense, we feel that we can reach the goal of breakeven cash flow by Q3 of next year. But just on the OpEx commentary, I think Josh you mentioned you guys are looking to maybe â\u0080\u0093 I think you said maybe by the first quarter have â\u0080\u0093 you know be like kind of $1.5 million less than kind of quarterly OpEx. So on the third quarter assumption of cash flow breakeven, if you do see the sort of $4 million to $5 million kind of annual benefit from the fee increase, if transactions are not flat, but they are actually worse, like where does that put your cash flow break even target. We actually have run all the models and even the combination â\u0080\u0093 we actually think the fee increase can generate more than $4 million to $5 million, so let's be conservative, and I think that if you do the math of 1.5 plus that, even if the units come down because of the shift, and again we also have â\u0080\u0093 we are adding more agents, we should have annual fees as well. But I think that your thesis is correct that if things continue the same, right, and we do the transactions next year that we did in this Q1 and Q2 of this year, combined with a decrease in expenses, combined with the increasing fees that we feel good about getting to adjusted EBITDA breakeven by Q2, and that's why we made the statement that we think that by Q2 we had adjusted EBITDA breakeven."
}