{
    "symbol": "LNT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:42:06",
    "content": " We issued a news release last night announcing Alliant Energy's third quarter and year-to-date financial results, narrowed and raised the midpoint of our 2022 earnings guidance range and announced the 2023 earnings guidance and common stock dividend target. And as we bring our planned solar projects into service, we expect production tax credits and lower fuel expenses to largely offset the impact of increases in renewables rate base, which makes these new investments very cost-effective for customers. And in September, we filed information with our two state commissions, announcing plans to move away from tax equity financing to full ownership of WPL and IPL's solar and battery projects to capture even more benefits for our customers. And our future financing plans anticipate utilizing the new transferability provisions within the Inflation Reduction Act to accelerate cash flows from future tax credits generated by wind, solar and battery projects, thereby reducing our future financing needs. You've executed our plan and kept our strategic projects on track, allowing us to share the financial and operational plans today from clearing supply chain hurdles to regulatory planning and communication, from preparing our tax equity financing to pivoting to full ownership to capture even greater customer benefits from the Inflation Reduction Act. But also the solar projects from 2022 through 2025, we're going to generate a significant amount of production tax credits and the monetization of those tax credits are going to significantly reduce the amount of financing needs we have in the future. So, we're not signaling the exact numbers of what the equity would be beyond 2023 as we're still working through the exact timing as well as the amounts of those monetization of tax credits, but we do think that's going to significantly reduce what previously we had expected with new common equity. So right now, we're generating a little over $100 million a year from those wind projects that we've put into service in 2019 and 2020, when you layer on the 1,500 megawatts of solar that we're planning on putting this service by the 2025 time period, that's also roughly another $100 million of production tax credit."
}