{
    "symbol": "LNT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 14:07:05",
    "content": " And then curious also what levers, you have to sort of mitigate the shifting out of that sort of solar capital to reiterate the 5% to 7%, or could we maybe see a situation where the profile of the 5% to 7% is slightly tweaked in the near term as we're thinking about capital being potentially pushed out. And then just one last one, John, if I may is it's terrific seeing sort of the flat O&M profile this year, but I'm just kind of curious if you're seeing some of the pressures in inflation I guess what's the level of confidence in maintaining that flat O&M profile. So, just to put in the context, there's about 500 megawats still in the latter half of 2023 that we haven't identified the sourcing yet still for sure if we're going to have any impacts from the tariffs. So, it's probably maybe not as big as maybe one might think when they first hear some of the megawat numbers and so when we think about how we're going to backfill that or take care of that, a lot of what John talked about, we tend to be a little more conservative with our sales forecast. So we did update back in July of last year, the commission and let them know that we did see some cost increases roughly in that call it 10% increase range, and that puts it likely in the call it 1400 per KW for those projects. When you look at our different mechanisms in Iowa right now, where we see probably some more near term impacts going directly back to customers is we've got a renewable energy rider, as you recall, with the 1,000 megawats of wind that we put in service in 2019 and 2020. And I don't know if that's part of the plan, because I think Julie kind of asked the question, but should we expect for whatever reason doesn't matter what the reason or what our views are that this can't be built till, I don't know, '25 because there's so much noise or the costs go up or whatever the case is that there is $500 million in incremental CapEx in '23, let's say '24 to substitute for that solar. So it sounds like you're to recover the solar if I'm not mistaken that if there is material delay, that there could be, I don't know if it kind of be rough math, $15 million to $20 million of like net income that would need to be made up in the interim, right through that kind of bridge year bridge being '23 first half '24 to offset any major relations. So just got to beat the dead horse after all Andy's questions, but just going back to the 1600 kilowatt cost target in the CA2 process and obviously you've let us know that you're filing with the commission for an increase of the cost cap."
}