{
    "symbol": "HESM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 16:22:06",
    "content": " Beginning with Hess Upstream's results, today Hess reported third quarter Bakken net production of 166,000 barrels of oil equivalent per day, which was above their guidance range of 155,000 to 160,000 barrels of oil equivalent per day, reflecting strong execution and recovery following challenging weather conditions in the first half of the year. Hess anticipates fourth quarter Bakken net production to be in the range of 165,000 to 170,000 barrels of oil equivalent per day and full year 2022 Bakken net production to average approximately 155,000 barrels of oil equivalent per day, which is at the high end of Hess' previous guidance range of 150,000 to 155,000 barrels of oil equivalent per day. Reflecting strong gas capture, third quarter gas processing volumes exceeded MVC levels, averaging 354 million cubic foot per day, contributing to third quarter adjusted EBITDA, up $254 million, which was above the top end of our guidance range. We've updated our volume guidance to reflect third quarter performance and now expect full year 2022 gas processing volumes to average approximately 330 million cubic foot per day, crude terminaling volumes to average approximately 105,000 barrels of oil per day and water gathering volumes to average approximately 75,000 barrels of water per day. As previously announced, we expect to initiate construction on a third compressor station in the fourth quarter, which would provide an additional 65 million cubic foot per day of capacity in 2023 to further support Hess and third-party production growth. Remediation expenses for a produced water release of approximately $6 billion, inclusive of both actual costs incurred to date and estimated total future expenses, higher operating and maintenance activity of approximately $2 million in our gathering segment that was seasonally higher compared to the second quarter the lower than anticipated as a result of the deferral of some maintenance activities, until the fourth quarter, resulting in adjusted EBITDA for the third quarter of $254 million, above the top end of our guidance range. Stable revenues for the majority of our systems with throughput below MVC levels, downtime from planned maintenance activity that was deferred from the third quarter driving expected lower throughput volumes and revenues at our gas gathering system operating above MVCs and lower total OpEx in the fourth quarter, with the produced water remediation expenses in the third quarter."
}