{
    "symbol": "HESM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 16:20:08",
    "content": " Fourth quarter crude terminaling and water gathering volumes averaged 101,000 barrels of oil per day, and 77,000 barrels of water per day respectively, resulting in full year adjusted EBITDA of $983 million, representing an increase of 8% compared to 2021. For full year 2023, we expect gas processing volumes to average between 350 million and 360 million cubic feet per day, representing growth of approximately 11% compared to 2022, primarily driven by Hess' development activity and our focus gas capture efforts. We project adjusted EBITDA for 2023 in the range of $990 million to $1,030 million, an increase of approximately 3% at the midpoint compared to full year 2022. Approximately $100 million of the 2023 expansion capital budget is allocated to gas compression, with activities focused on the completion of two Greenfield compressor stations and associated pipeline infrastructure, which are expected to provide in aggregate an additional 100 million cubic feet per day of gas compression capacity when brought online, further enhancing our gas capture capability. Looking forward, we have line of sight to at least 10% annual growth in net income, adjusted EBITDA and adjusted free cash flow in 2024 and 2025, driven by Hess' growth in the Bakken, and underpinned by our 2025 MVCs that provide visibility to approximately 10% annualized growth in physical volumes across gas, oil and water systems from 2023. As a result, over the past two years, we have completed $1.15 billion of unit repurchases and grown our distributions by approximately 27% on a per share basis, these shareholder returns as a percent of market capitalization represent differentiated and peer leading metrics. For example, looking at gas processing, Hessâ\u0080\u0099 nomination for expected volumes for 2025 was 429 million cubic feet per day, resulting in an MVC of 343 million cubic feet per day set at 80% of the nomination level, implying more than 30% growth in physical natural gas volumes from 2022 levels. For the full year 2023, we expect net income of $600 million to $640 million and adjusted EBITDA of $990 million to $1, 030 million, representing a 3% increase in adjusted EBITDA at the midpoint of our range. First quarter maintenance capital expenditures and net interest excluding amortization of deferred finance costs are expected to be approximately $45 million, resulting in expected distributable cash flow of approximately $185 million to $195 million delivering distribution coverage at the midpoint of the range of approximately 1.4x. With growing adjusted EBITDA and capital expenditures are expected to remain stable for 2023 levels, we expect growth and adjusted free cash flow of greater than 10% on an annualized basis in both 2024 and 2025. Second, we have financial flexibility for potential significant incremental shareholder returns beyond our growing base distribution, with expected adjusted EBITDA, and adjusted free cash flow growth of at least 10% annually in excess of our targeted annual distribution growth of 5%."
}