{
    "symbol": "HALO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 17:58:01",
    "content": " Focusing now on the financial performance highlights, we reported second quarter revenues, inclusive of Ontario's revenue post the May 24th acquisition close of $152.4 million, a 12% year-over-year increase. For full year 2022, we expect total revenues of $655 million to $685 million, an increase from our prior guidance range of $530 million to $560 million. Adjusting for acquisition-related costs and other adjustments, we expect non-GAAP earnings per share to be $2.10 to $2.25, an increase from our prior guidance range of $2.05 to $2.20, representing an increase of 5% to 12% over 2021, non-GAAP diluted earnings per share. In the second quarter, total royalty revenue was $85.3 million, representing 86% growth over the second quarter of 2021 and 23% sequential growth. Year-over-year growth is now projected to be greater than 65%, resulting in royalty revenue of $340 million to $350 million, an increase from our prior projection of 50% growth. Janssenâ\u0080\u0099s parent Johnson & Johnson reported second quarter worldwide sales of DARZALEX, including both the IV and subcutaneous forms of $2 billion, an increase of more than 46% year-over-year on an operational basis. Beginning on slide 12, total revenue for the second quarter was $152.4 million compared to $136.5 million in the prior year period. The year-over-year increase of 12% was primarily driven by an increase in royalty revenue and the addition of product sales as a result of Antares acquisition, partially offset by a decrease in revenues under collaboration agreements due to a $40 million upfront payment associated with entering into the beef collaboration in the prior year period. Royalty revenue for the second quarter was $85.3 million, an increase of 86% compared to $45.8 million in the prior year period. For the full year 2022, we expect total revenue of $655 million to $685 million, an increase from our prior guidance range of $530 million to $560 million, representing growth of 48% to 55% over 2021 total revenue. We expect operating income of $240 million to $265 million, a decrease from our prior guidance range of $350 million to $380 million, representing a decline of 4% to 13% over 2021 operating income. This includes onetime transaction costs related to the Antares acquisition, including amortization of intangible assets, as well as the planned incremental $20 million operating expense investment in 2022 to maximize ENHANZE and extend royalty revenue durability. We expect GAAP diluted earnings per share of $1.20 to $1.35, a decrease from our prior guidance of $1.90 to $2.05, mainly due to acquisition related costs in the current year. Adjusting for acquisition related costs and other adjustments, we expect non-GAAP diluted earnings per share to be $2.10 to $2.25, an increase from the prior guidance range of $2.05 to $2.20 and representing an increase of 5% to 12% over 2021 non-GAAP diluted earnings per share. Your line is open. Your line is open. Your line is open. Your line is open. And then I can say for full year as well, you'll see that we did update our guidance for the full year, including updating our non-GAAP diluted EPS and we've adjusted that range, we've increased it by $0.05 per share, and that is reflective of the accretion that we project for the full year related to the Antares acquisition and the contribution from that part of the business. Your line is open. I would say we continue to be focused across the board on our capital allocation priorities, specifically in regards to share repurchases, our plans remain intact with our existing $750 million plan that we initiated late last year a three-year plan."
}