{
    "symbol": "HALO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 20:56:06",
    "content": " Fourth quarter 2022 revenue was $181 million, an increase of 78% over the same period in the prior year, resulting from continued growth of ENHANZE royalty revenues, incremental product sales and royalties from our small volume auto-injectors and sales of XYOSTED, our commercial testosterone replacement therapy product. We project record revenues of $815 million to $845 million, growth of 23% to 28% over 2022 and we project EBITDA of $415 million to $440 million, growth of 30% year-over-year growth. For 2023, we project total royalty revenue, including ENHANZE and our auto-injector devices of $445 million to $455 million, growth of 23% to 26% from royalty revenue of $360 million in 2022. This guidance reflects continued projected growth from our strong fourth quarter performance, in which total royalty revenue was a record $106 million, which represented 69% growth over the fourth quarter of 2021. Janssenâ\u0080\u0099s parent Johnson & Johnson reported full year 2022 worldwide sales of DARZALEX, including both the IV and subcutaneous forms of $8 billion, an increase of almost 40% year-over-year on an operational basis. And the fourth key point is that the opportunity represented here in terms of analyst projections for total product sales is $30 billion in 2028, significantly higher than the opportunity for our Wave 2 products that are driving our strong royalty revenue growth to-date. In its preliminary results for the fourth quarter, argenx noted strong physician and patient demand for Vyvgart and reported total quarterly net product revenues of $175 million and full year 2022 revenue of $402 million. On its recent fourth quarter call, BMS noted OPDIVO IV sales of $8.2 billion for full year 2022, an increase of 10% year-over-year or 14% excluding FX. In 2022, this pipeline progress contributed strongly to recognition of the approximately $109 million in total collaboration revenue with notable milestones recognized for Phase 3 study initiations for amivantamab subcu and nivolumab+relatlimab subcu. As we start 2023, year-to-date, I am pleased to see that XYOSTED demand is off to an excellent start, with the growth over Q4 exit on track with our plan to deliver $100 million in revenues in 2023. For the full year 2023, we expect total revenues of $815 million to $845 million, representing growth of between 23% to 28% over 2022 total revenue. Highlights include the potential start of our Wave 3 product launches with two potential approvals in 2023 for subcutaneous efgartigimod and subcutaneous atezolizumab, continued progress in the development of our high-volume auto-injector with ENHANZE, the goal of signing new collaboration agreements across our platform and continued revenue growth resulting from our commercial products."
}