{
    "symbol": "NMTC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-14 06:12:52",
    "content": " Todayâ\u0080\u0099s call will be conducted by the companyâ\u0080\u0099s Chief Executive Officer, Dave Rosa; and Chief Financial Officer, Ron McClurg. Before I turn the call over to Mr. Rosa, Iâ\u0080\u0099d like to remind you that this conference call will include forward-looking statements within the meaning of U.S. Federal Securities laws with respect to future operations, financial results, events, trends, and performance, which are based on managementâ\u0080\u0099s beliefs and assumptions as of todayâ\u0080\u0099s call or other specified date. Forward-looking statements may involve known and unknown risks, uncertainties, and other factors, which may cause actual results to differ materially from those expressed or implied by such statements. Except as required by law, we undertake no obligation to update such forward-looking statements. During and since the third fiscal quarter, the company accomplished a great deal with respect to our sEEG electrode program, development of our OneRF ablation system, improvements to the balance sheet and cost reductions. First, letâ\u0080\u0099s address the progress we made with our sEEG product line. On our previous call, we discussed that we had appealed the FDA decision to deny clearance to increase the duration of use from less than 24 hours to less than 30 days use with recording, monitoring and stimulation equipment for the recording, monitoring and stimulation of electrical signals at the subsurface level of the brain. On May 16, the company issued a press release stating that the FDA had denied our appeal. The FDA also stated that the company may submit a new 510(k) with new evidence, specifically as it relates to the subacute toxicity endpoint, to support a finding of substantial equivalence. The company completed the process of collecting this data and submitted a special 510(k) on August 8, which was earlier than previously targeted. On July 12, we reached a major milestone with our Evo sEEG electrode as it was used for the first time clinically at Emory University for intraoperative brain mapping at the subsurface level of the brain. We made tremendous progress over the quarter, which allowed us to complete the full system prototypes 2 months earlier than anticipated, including the RF generator from RBC Medical. We accomplished another major milestone by successfully completing testing of the full system, including NeuroOneâ\u0080\u0099s electrode and other accessories. As mentioned in my opening comments, we are also excited to strengthen our balance sheet through an amendment to our existing agreement with Zimmer Biomet, providing the company with an accelerated $3.5 million payment relating to certain milestones. In exchange, Zimmer Biomet received a warrant to purchase 350,000 shares of NeuroOneâ\u0080\u0099s common stock at $3 per share. With respect to cost reduction initiatives and supply chain management, we successfully completed qualification of a second source to manufacture electrodes for both the Evo cortical and sEEG product lines, reducing supply risk for both of the product lines. In terms of cost reduction efforts, we successfully validated a new cable assembly manufacturer, which significantly reduces our cost for this component. We also completed the process to extend the shelf life for the Evo cortical product line to 3 years, which reduces the cost of expired product as well as supply chain risk. As we continue to develop the technology we remain focused on developing a system for the treatment of chronic back pain due to failed back surgeries that provides the capabilities of recording and stimulation, and a thin film electrode technology. Later this month, we will convene the group to begin to develop the framework of the feature set customized to the advantages of our electrode technology. We also established the Evo cortical electrode in partnership â\u0080\u0093 sorry, we also exhibited the Evo cortical electrode in partnership with Zimmer Biomet at the American Association of Neurological Surgeons Annual Scientific Meeting, and American Society for Stereotactic and Functional Neurosurgery Biennial Meeting. Also, we were recently informed that the Evo sEEG implantation accuracy study was accepted as a podium presentation at the Biennial Meeting of the World Society for Stereotactic & Functional Neurosurgery, to be held in South Korea September 4 through 7, 2022. Over the past quarter and early August, the company accomplished a number of major milestones. We remain pleased with the test results of the Evo sEEG product line, and we look forward to engaging with FDA in the near future to discuss our recent resubmission. In addition, the team also achieved a major milestone for the OneRF ablation system by successfully completing functional testing in July much earlier than expected. I would now like to turn the call over to Ron McClurg, our CFO for review of fiscal third quarter financial results. Product revenue was $32,000 in the third quarter of fiscal 2022 compared to product revenue of $40,000 in the third quarter of fiscal 2021. Collaboration revenue was delayed in the third quarter of fiscal 2022 due to the FDA decision compared to collaboration revenue of about $17,000 in the third quarter of fiscal 2021. Collaboration revenue is derived from the Zimmer Development Agreement and represents the portion of the upfront initial development fee payment that is eligible for revenue recognition as of June 30, 2022. SG&A expense in the third quarter of fiscal 2022 was $1.5 million, compared with $2.1 million in the prior year third quarter. Our net loss for the third quarter of fiscal 2022 was $2.8 million, compared with a net loss of $3.0 million in the third quarter of fiscal 2021. As of June 30 of 2022, the company had cash of approximately $10.2 million compared to $6.9 million as of September 30, 2021, which is the end of the companyâ\u0080\u0099s most recent fiscal year. So there was one study that we had to perform, and the FDA gave us an option of either redoing whatâ\u0080\u0099s called the exhaustive extraction test to meet this particular endpoint, or subacute toxicity. So the last time we performed the test, it was an exhaustive extraction. And this time we perform subacute toxicity, because subacute toxicity is really a pass/fail test. And obviously, the FDA didnâ\u0080\u0099t agree with our discussion on the exhaustive extraction. And then subacute toxicity, because there is no data analysis, it provides the opportunity to submit under a special 510(k). Whereas if thereâ\u0080\u0099s any data analysis that needs to be done, and in the case of exhaustive extraction are just the number of pages of analysis for that test was 144 from what my memory serves, so it obviously required a lot more analysis, and a lot more review by FDA, so thatâ\u0080\u0099s the test we did with subacute toxicity. In terms of other biocompatibility tests, weâ\u0080\u0099ve already met all the other requirements. So when you look at all the testing that weâ\u0080\u0099ve already done on the subdural electrodes, there isnâ\u0080\u0099t a need for us to do to meet any other requirements in terms of biocompatibility. So when the FDA â\u0080\u0093 so number one, obviously, the rationale for wanting to submit under a special is, is that itâ\u0080\u0099s a 30-day review period as opposed to a 90-day cycle under a traditional 510(k). But the FDA came back and said on the first one, thereâ\u0080\u0099s a substantial amount of analysis thatâ\u0080\u0099s required for exhaustive extraction. And we will not accept it under that, we need to submit it, or we need to transition it to a traditional 510(k). So technically the FDA has 15 days from the date of receipt, which the clock started today is the 11th August night . So the FDA is not under any obligation to accept it as special 510(k), but doing a subacute toxicity test, because there is no data analysis like there is under exhaustive extraction provides us with a solid argument as to why it should be accepted under a special 510(k). And, I guess, without going blow by blow, we wouldnâ\u0080\u0099t be submitting the 510(k), we wouldnâ\u0080\u0099t have submitted anything if we didnâ\u0080\u0099t pass the testing. But, ultimately, what youâ\u0080\u0099re looking for here is to make sure that none of the animals, I believe there were roughly about 300 in this testing, there when exposed to the device over the course of 29 days, that there isnâ\u0080\u0099t any toxicity associated with the device during that implantation period. So trying to â\u0080\u0093 I guess as to what the FDA might come back with, I havenâ\u0080\u0099t been successful doing that in any company Iâ\u0080\u0099ve ever been in, to be honest with you. I donâ\u0080\u0099t know what they could come back with, especially since its pass/fail, but weâ\u0080\u0099ll have to wait and see. And then maybe expand on the latest with the Zimmer relationship,   milestone payment from them. Obviously, theyâ\u0080\u0099re waiting on approval here, but I know, theyâ\u0080\u0099re also waiting on their own approval. So there wasnâ\u0080\u0099t anything else in the deal terms with Zimmer, it was just what we reported the $3.5 million payment in exchange for the warrants. It was helpful for us, and I think look theyâ\u0080\u0099re â\u0080\u0093 the way they look at it is theyâ\u0080\u0099re investing in a platform that they think could help develop growth. I know that theyâ\u0080\u0099re waiting for FDA feedback thatâ\u0080\u0099s supposed to come in the next few weeks, and I think weâ\u0080\u0099ll have a better idea, or they will have a better idea of when that might occur. And, if Zimmer was able to get this clearance around the same time or maybe early Q4, then we should be in good shape to launch the product this year. Good afternoon, gentlemen, thanks for taking the questions, and congrats on the revised  Zimmer agreement on the FDA submission. Just first off for me, can you â\u0080\u0093 and also congrats on getting the OneRF feasibility are developing  . Yeah, maybe Iâ\u0080\u0099ll take the second question first. We were recently at RBCâ\u0080\u0099s facility where they presented the finished prototypes to us, and then incorporated our electrode and our accessories to actually do benchtop testing. And what you do is, when youâ\u0080\u0099re connected to the generator that creates the ablation, you put the electrode in the solution, and you initiate the device, you initiate ablation. And but this was the first time we had finished prototypes of really the software and hardware as well as all the accessories and electrodes, and it really performed very, very well. So what type of testing are we going to be doing from here, weâ\u0080\u0099ve already done animal testing, not with the actual finished prototype. Weâ\u0080\u0099re going to be redoing animal studies, as a way of making sure everything is still performing the way it needs to. And again, what youâ\u0080\u0099re looking to do is demonstrate that you can create a lesion within a certain specified range that you want, as well as obviously safety data that youâ\u0080\u0099re not harming, the device itself isnâ\u0080\u0099t causing harm to the animal. And then what the other piece that weâ\u0080\u0099re waiting on is components, final components, which are on order, donâ\u0080\u0099t expect them in for another couple of months. But the good news here is that, weâ\u0080\u0099re building the units for design verification, final testing, and then submission to FDA. But the really hard work in terms of development, we feel very good is behind us. Itâ\u0080\u0099s now fine-tuning things, making sure the software is working, the way it need to thereâ\u0080\u0099s no glitches. So, I would say, itâ\u0080\u0099s more fine-tuning then development thatâ\u0080\u0099s left with the project. And, in addition, some parties have come to us just because of word of mouth of the system. But, yeah, we will be using the advisory board that we have, and some new physicians as well, to actually give feedback. I mean, theyâ\u0080\u0099ve already been working with us closely for quite a while now. So they already know, how the system functions, what the graphic user interface looks like. And really the feedback weâ\u0080\u0099ve been getting is that, this system is quite easy to use, because â\u0080\u0093 obviously, you donâ\u0080\u0099t want to develop a product thatâ\u0080\u0099s only going to apply to the top 1% customers. And in this case, at least early indications are that weâ\u0080\u0099ve developed something thatâ\u0080\u0099s pretty easy for everyone to use. So itâ\u0080\u0099s an application thatâ\u0080\u0099s different for all the things that weâ\u0080\u0099ve talked about meaning spinal cord stem, meaning tissue ablation, recording for epilepsy tumors. And the only reason why I donâ\u0080\u0099t mention the institutionâ\u0080\u0099s name, and really the application is, as you can probably appreciate, getting contract signed and the paperwork, the amount of time it takes to get paperwork signed in these institutions, itâ\u0080\u0099s not trivial. So weâ\u0080\u0099re still working through â\u0080\u0093 both groupsâ\u0080\u0099 lawyers to come to an agreement on what both parties are going to do, but itâ\u0080\u0099s going to be exciting. But, I think, we will be in the next quarter or two that are different from everything that Iâ\u0080\u0099ve talked to you about today. And then, we kind of moved on to other things, obviously, trying to get our sEEG cleared through FDA. But more recently, what weâ\u0080\u0099re seeing is â\u0080\u0093 and in this particular case, them coming to us to say, hey, weâ\u0080\u0099d like to work with you, hereâ\u0080\u0099s what weâ\u0080\u0099re trying to accomplish. And thatâ\u0080\u0099s kind of initially with us, but recently, itâ\u0080\u0099s been them and other parties as well. Yeah, thereâ\u0080\u0099s â\u0080\u0093 youâ\u0080\u0099re not going to get a lot of feedback other than the device is giving the images that high quality images, thereâ\u0080\u0099s no apparent issues with it. And the reason for that, Ben is, itâ\u0080\u0099s not being placed using a robot or any sort of stereotactic frame, because itâ\u0080\u0099s a craniotomy has already been done. So there â\u0080\u0093 in these cases, the neurosurgeons are using both cortical electrodes as well as 1 or 2 sEEG electrodes, so that theyâ\u0080\u0099re able to map deep within the brain, as well. But, one of the things I always worry about, especially when â\u0080\u0093 you have equipment that has connections thatâ\u0080\u0099s electrical base, is that youâ\u0080\u0099re not getting shorts, that youâ\u0080\u0099re getting the images, that you expect to get, and those are the boxes that weâ\u0080\u0099re checking now. But, the true test will be when the Zimmer robot is used to place these devices and youâ\u0080\u0099re going through the skull and youâ\u0080\u0099re using your anchor bolts, youâ\u0080\u0099re not having to do that. I just want to thank everyone for spending late afternoon, listening to our progress, look forward to really updating all of you as we continue to make progress really across all platforms."
}