{
    "symbol": "NMTC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-13 18:20:24",
    "content": " Before I turn the call over to Mr. Rosa, I'd like to remind you that this conference call will include forward-looking statements within the meaning of U.S. Federal securities laws with respect to future operations, financial results, events, trends, and performance, which are based on management's beliefs and assumptions as of today's call or other specified date. During our fiscal fourth quarter, we continued to make exciting strides towards commercializing our second diagnostic product line, the Evo sEEG Electrode. We received clearance for less than 30 days use from the FDA in October 2022 for similar indications as our Evo Cortical product line, and now expect to begin the commercial launch with Zimmer Biomet in the first quarter of 2023. sEEG Electrodes represent the bulk of diagnostic procedures performed today due to their less invasive placement by neurosurgeons. Moving to our OneRF therapeutic ablation electrode system, we had previously reported that we were targeting completion of animal feasibility studies in the fourth calendar quarter, with the potential to complete the product development by the end of calendar year 2022. I also previously disclosed that we signed a partnership agreement with RBC Medical Innovations, a recognized leader in the development and manufacturing of electromechanical therapeutic devices, to develop and manufacture our radiofrequency generator. We also successfully completed animal feasibility studies with the assistance of Dr. Robert Gross of Emory University in Atlanta, Georgia; and Dr. Jamie Van Gompel at the Mayo Clinic in Rochester, Minnesota. We continue to make progress on the testing of these electrodes that are being designed for use in indications such as Parkinson's disease, epilepsy, back pain due to failed back surgeries, and potentially mental health indications such as severe obsessive compulsive disorder, depression, peripheral pain, and other conditions requiring a permanently implanted electrode that can deliver both diagnostic and therapeutic functions. We are designing our devices to utilize percutaneous delivery systems meaning nonsurgical placements, while targeting designs that require less battery energy with expanded coverage of the tissue as compared to current competitive electrodes placed percutaneously. From a financial standpoint, we received an accelerated $3.5 million payment from Zimmer Biomet related to certain milestone events as part of an amendment to our distribution and development agreement. We successfully completed feasibility testing of our OneRF ablation system, facilitated by Dr. Robert Gross of Emory University and Dr. Jamie Van Gompel at the Mayo Clinic in Rochester, Minnesota. We received 510(k) clearance of our second product line, the Evo sEEG Electrode product family for less than 30 day use. We received and shipped the initial order from Zimmer Biomet for our Evo sEEG Electrodes, and we rang the NASDAQ Stock Market closing bell to commemorate our FDA clearance milestone for the Evo sEEG Electrode technology. In closing, the company made great progress in fiscal 2022 in a wide variety of areas, including commercialization, development, and capital raises, which will allow us to continue to execute our plan, with the intent to introduce meaningful advances in electrode technology for a wide variety of neurological applications."
}