{
    "symbol": "NMTC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-14 18:35:06",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to the NeuroOne Medical Technologies Corporation First Quarter of Fiscal 2022 Earnings Conference Call. Today's call will be conducted by the company’s Chief Executive Officer, Dave Rosa; and its Chief Financial Officer, Ron Mcclurg. Before I turn the call over to Mr. Rosa, I’d like to remind you that this conference call will include forward-looking statements within the meaning of U.S. Federal Securities laws with respect to future operations, financial results, events, trends, and performance, which are based on management's beliefs and assumptions as of today's call or other specified date. Forward-looking statements may involve known and unknown risks, uncertainties, and other factors, which may cause actual results to differ materially from those expressed or implied by such statements. With that said, I'll turn the call over to Dave Rosa, CEO of NeuroOne. During and since the first quarter, we continue to make progress in advancing our Thin Film Electrode Platform Technology with respect to both the diagnostic and therapeutic applications. As you may recall, in September 2021, our EVO sEEG Depth Electrodes received FDA clearance for us up to 24 hours. In fiscal Q1, we submitted to the FDA a request for clearance of the device for temporary use, that is less than 30 days use with recording, monitoring and stimulation equipment for the recording, monitoring and stimulation of electrical signals of the subsurface level of the brain. We submitted responses to questions from the FDA regarding our submission on February 9, 2022, and the FDA acknowledged receipt of our response on February 10, 2022. If and when FDA clearance for less than 30 day use is received, the company will begin to fulfill stocking orders that have already been placed by Zimmer Biomet, our distribution partner for the EVO family product line. As a reminder, the company may have the opportunity to receive additional milestone payments from Zimmer Biomet. In addition, we displayed our EVO cortical electrode product line in Zimmer Biomet's booth at the American Epilepsy Society meeting in December of 2021. We also presented a poster at the meeting titled first FDA-cleared thin film electrode for intracranial recording and monitoring of brain activity, device testing and initial clinical use. Shifting to our combined diagnostic and therapeutic ablation electrodes, we've continued to make progress on this program. And as a reminder, this system is expected to save time and money, and is intended to improve patient outcomes by combining both the diagnostic and therapeutic applications into one device. In addition to providing resources to the program, we continue to work closely with our hardware development partner RBC Medical Iinnovations towards the completion of prototypes of the RF generator, which we expect in calendar 3 -- Q3 of this year. Following the completion of the RF generator prototypes, we expect to submit a 510(k) application for FDA clearance in the first calendar quarter of 2023. Now, moving to our chronic use electrode development. During and since fiscal Q1, we continued to make progress with development of this technology. Most recently, we announced the successful completion of accelerated five year testing, which demonstrated reliable recording without any issues associated with fluid perviation. This could potentially expand utilization of these electrodes to long-term recording for patients suffering from Parkinson's disease, epilepsy, chronic back pain due to failed back surgeries, as well as the research markets. Our initial focus with our chronic stimulation program is to target the spinal cord stimulation market, which currently represents over $3 billion in the U.S. market alone. We also bolstered our management team in January of 2022 with the appointment of Chad Wilhelmy as Vice President of Quality Control and Regulatory Affairs, Mr. Wilhelmy joins NeuroOne from HLT Medical, a subsidiary of the Bracco Group, where he was Vice President of Quality Assurance. On the financial side, we also successfully completed an equity financing during fiscal Q1, with gross proceeds of $13.35 million, which Ron Mcclurg will touch on as well. In closing, the company made great progress in fiscal Q1 in a wide variety of areas, including commercialization, development and raising capital, which will allow us to continue to execute our plan to introduce meaningful advances in thin film electrode technology for a variety of neurological applications. Product revenue for the first quarter of fiscal 2022 was $34,000 compared to product revenue of $71,000 in the first quarter of fiscal 2021. Collaboration revenue was $6,000 in the first quarter of fiscal '22, compared to collaboration revenue of $22,000 in the first quarter of fiscal '21. Collaboration revenue was derived from our Zimmer Development Agreement and represented the portion of the upfront initial development fee payment that was eligible for revenue recognition as of December 31, 2021. Our total operating expenses in the first quarter of fiscal 2022 were $2.8 million, compared to approximately $2.1 million in the same period of the prior year. R&D expense in the first quarter was $1.1 million, compared with proximately $0.9 million in the same period of 2021. SG&A expense in the first quarter fiscal 2022 was $1.7 million, compared with $1.2 million in the prior year period. Our net loss for the first quarter of fiscal '22 was $2.8 million, or $0.18 per share, compared to a net loss of $2 million, or $0.26 per share in the first quarter of fiscal 2021. As of December 31 of 2021, the company had cash of approximately $16.2 million, compared to $6.9 million at September 30, 2021. The cash balance at December 31, 2021 includes proceeds from an underwritten registered public offering of 4,172,000 shares of common stock at a price of $3.20 a share, resulting in gross proceeds of approximately $13.35 million. One was just some basic questions about the compounds that were found and if we knew where they were coming from, so they wanted us to elaborate more on that, which we did. And I know, you've talked about this before, but -- and you just mentioned it again, but just on the bio-comp piece of it. Well, keep in mind, the only thing that the FDA is reviewing is the results of the biocompatibility testing. And yes, we firmly believe and our consultants that actually put the analysis together, agreed that we all fall within the required guidelines as it pertains to results for these testing. And if they have any additional clarifications, hopefully, we'll find that out in the next couple of weeks and get this done. Well, I think if the FDA -- it's hard to answer, because I'm always basing it off of a full submission. But if the FDA came back with questions, they would likely come to us and say, look, we consider this interactive, and we would do this over a phone call as opposed to emailing back and forth. But again, when you go back and look at the fact that they have placed orders, already multiple orders, this is not something that I think they wanted to lay too long. We don't or I should say, in our discussions with them, they've indicated they have not yet heard back from FDA. But hopefully, in the next week or so, I'm assuming that they should also expect to hear back from FDA on that. So I'll take the, I'll answer your first question first on, how confident are we. But in addition to that, I believe it was maybe about 30 days ago, we went to a second outside organization, consulting organization that has a lot of experience with this as well. And they also said, look, we think you should submit this as a 510(k), it's pretty black and white. So I don't know that, I would consider myself an expert with FDA, and what they would do, but I rely on companies, consulting companies that have been successful with this before. So I mean, there's -- there is clearly predicate devices that are out there that we've identified that do RF ablation, of brain tissue. So I was confident as my consultants are and the recommendations that they gave us actually, will earn them less money than if we were to do more work than what they're suggesting. Obviously, we've got to get the generator from RBC and do some testing on that, because all of our tests have been done with competitive generators. But where we are now, and even given some of the -- some of the challenges with COVID, and supply chain, everyone still feels good about that timeline. There's still some additional testing that we'll be doing with the electrodes but most of what we're working on now is outside of the electrode, its accessories and hardware. Yeah, so that's obviously a longer timeline. What I think really opens the door for us in terms of therapeutic applications is the set of data that we'll be releasing next, which is stimulation. It's a little bit harder to predict how much time it's going to take to what I'll say, perfect the manufacturing process, because there's still a fair amount of time associated with that. It's not something that you should expect to see in the next 12, up to 24 months in terms of a commercial product. So we think we can take some time, but I think probably the bigger question is going to be, how long is it going to take us to perfect the manufacturing process so that we can manufacture these in high volume with high yields. On the chronic side of things you mentioned in the press release a week or so ago, entering the research market. Not sure yet, but I can tell you that I've been with the company five years, and the research market has come up multiple times. And it seems, every time we put out a release, even much like the one that we recently put out, where we were able to do recording with the electrodes for five years, we start getting asked questions about, “Hey, can you design an electrode for me for research purposes.” So, there are some companies that literally only provide devices for research purposes. But I personally believe just from what I've heard from companies that are in the space, that it could be somewhere between $10 million and $20 million, so which to me is significant from just a recording standpoint. But we are likely to start a project regarding an indication that we're not in now, using these electrodes for research purposes. So stay tuned on the market, we're really trying to scour to see if there's any published information on what the size of that is. And then with respect to strategics, dating back to I think three years ago even before we were a NASDAQ Company, I publicly commented that we had had discussions with strategics. And the common response was, this is nice what you're doing, but for chronic applications we would like to see some data that the electrodes will be able to perform. So, the short answer to your question is, I think those discussions or any discussions will increase or I'll say, reappear once we release the results of the chronic testing, which again, expect to happen this quarter. And then just kind of on the R&D front, I think you get some devices for kind of high definition electrodes to -- I think it was Mayo and Carnegie Mellon. So we don't have that raw data yet, although the Mayo has said that they are going to analyze it and send it to us. But I'd really like to rerun some of those tests so that – we’re not taking these out only a week that we're really pushing these for 30, 60, 90 days. The problem is preventing these animals from getting an infection because keep in mind, these are all open wounds. The challenge that we've had that -- and this is the feedback from the Zimmer sales force is that, hospitals do not want to carry one company's cortical electrodes and another company's sEEG or DEF electrodes, they want one manufacturer and that's it. And until we release the sEEG electrode, until we have FDA clearance, it's more of a special order situation with the cortical electrodes. So, it's easy to kind of forget about that, but there's no question that the doctors get what the value of it is. And then when they hear a little bit about the brain friendly properties of the device that it has, it appears to have less inflammation than or cause less inflammation than traditional electrodes, they’re even more intrigued by it. But I can tell you that if you package the Zimmer sales force as well as the neurosurgeons that came by, there's a lot of excitement about the sEEG electrodes. And on one hand, it'll allow us to get on the shelf of these hospitals as opposed to a special order."
}