{
    "symbol": "GLYC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 11:10:04",
    "content": " The study's Independent Data Monitoring Committee is expected to meet by the end of Q1, 2023 to consider whether to continue to the original 100% OS events trigger or alternatively to recommend immediate and complete trial analysis if efficacy data from study treatment with uproleselan plus standard chemotherapy is observed to be compelling. Whether the DMC's recommendation enables us to expedite registrational filings or we continue the study as planned through the full survival event trigger, we remain excited by uproleselan's potential to improve outcomes in relapsed and refractory AML. The study's Independent Data Monitoring Committee is expected to meet by the end of Q1, 2023 to consider whether to continue to the original 100% OS events trigger or alternatively to recommend immediate and complete trial analysis if efficacy data from study treatment with uproleselan plus standard chemotherapy is observed to be compelling. Whether the DMC's recommendation enables us to expedite registrational filings or we continue the study as planned through the full survival event trigger, we remain excited by uproleselan's potential to improve outcomes in relapsed and refractory AML. The study's Independent Data Monitoring Committee is expected to meet by the end of Q1, 2023 to consider whether to continue to the original 100% OS events trigger or alternatively to recommend immediate and complete trial analysis if efficacy data from study treatment with uproleselan plus standard chemotherapy is observed to be compelling. Whether the DMC's recommendation enables us to expedite registrational filings or we continue the study as planned through the full survival event trigger, we remain excited by uproleselan's potential to improve outcomes in relapsed and refractory AML. The study's Independent Data Monitoring Committee is expected to meet by the end of Q1, 2023 to consider whether to continue to the original 100% OS events trigger or alternatively to recommend immediate and complete trial analysis if efficacy data from study treatment with uproleselan plus standard chemotherapy is observed to be compelling. Whether the DMC's recommendation enables us to expedite registrational filings or we continue the study as planned through the full survival event trigger, we remain excited by uproleselan's potential to improve outcomes in relapsed and refractory AML. The study's Independent Data Monitoring Committee is expected to meet by the end of Q1, 2023 to consider whether to continue to the original 100% OS events trigger or alternatively to recommend immediate and complete trial analysis if efficacy data from study treatment with uproleselan plus standard chemotherapy is observed to be compelling. Whether the DMC's recommendation enables us to expedite registrational filings or we continue the study as planned through the full survival event trigger, we remain excited by uproleselan's potential to improve outcomes in relapsed and refractory AML. The study's Independent Data Monitoring Committee is expected to meet by the end of Q1, 2023 to consider whether to continue to the original 100% OS events trigger or alternatively to recommend immediate and complete trial analysis if efficacy data from study treatment with uproleselan plus standard chemotherapy is observed to be compelling. Whether the DMC's recommendation enables us to expedite registrational filings or we continue the study as planned through the full survival event trigger, we remain excited by uproleselan's potential to improve outcomes in relapsed and refractory AML. The study's Independent Data Monitoring Committee is expected to meet by the end of Q1, 2023 to consider whether to continue to the original 100% OS events trigger or alternatively to recommend immediate and complete trial analysis if efficacy data from study treatment with uproleselan plus standard chemotherapy is observed to be compelling. Whether the DMC's recommendation enables us to expedite registrational filings or we continue the study as planned through the full survival event trigger, we remain excited by uproleselan's potential to improve outcomes in relapsed and refractory AML. The study's Independent Data Monitoring Committee is expected to meet by the end of Q1, 2023 to consider whether to continue to the original 100% OS events trigger or alternatively to recommend immediate and complete trial analysis if efficacy data from study treatment with uproleselan plus standard chemotherapy is observed to be compelling. Whether the DMC's recommendation enables us to expedite registrational filings or we continue the study as planned through the full survival event trigger, we remain excited by uproleselan's potential to improve outcomes in relapsed and refractory AML."
}