{
    "symbol": "TAP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 16:21:03",
    "content": " You will recall that pubs in the U.K. were closed the entire first quarter of 2021, but by the end of the first quarter of 2022, beer sales in pubs were adopting 98% of pre-corona virus levels and this was particularly beneficial to our Carling brand, the largest beer brand in the U.K. As a result, in the first quarter, the EMEA and APAC business unit substantially improved its earnings and nearly doubled its 2021 revenue. We have now grown our share of net sales revenue in above premium for five straight quarters and above premium net sales revenue now represents over 26% of our global portfolio on a trailing 12 month basis, a record for this business since the 2016 MillerCoors acquisition. In the U.S., both Blue Moon and Peroni saw double-digit net sales revenue growth in the first quarter as they benefited from the on-premise recovery, as well as strong results off-premise. Consolidated net sales revenue growth was driven by strong global net pricing, favorable sales mix from portfolio premiumization, positive channel mix, as we cycled significant on-premise restrictions in the prior year period, and we also delivered high financial volumes. Consolidated financial volumes increased 5.1%, largely driven by strong brand volume growth in EMEA and APAC, higher contract and factored volume and cycling of lower U.S. distributor inventory levels in the prior year. Net sales per hectoliter on a brand volume basis increased 10.2%, driven by global net pricing growth and positive brand and channel mix with premiumization delivered across both business units. Net sales per hectoliter on a brand volume basis, which is an important metric from which to measure our progress against our revitalization plan, increased 12.2% compared to the first quarter of 2019. Underlying COGS per hectoliter increased 8.6%, driven by cost inflation, including higher input and transportation costs, as well as the mix impact from premiumization and factor brands in Europe, partially offset by lower depreciation expense. Underlying MG&A in the quarter increased 15.7%, largely due to our planned increases in marketing investment, which surpassed first quarter 2021 and 2019 levels to provide strong commercial support behind our core brands and new innovations. In Canada, net sales revenue increased 4.1% as brand volume declines of 2.5% due to softer industry performance were more than offset by positive pricing and mix premiumization. U.S. net sales per hectoliter increased 11.1%, driven by net pricing growth, as we took pricing earlier than usual this year and positive brand mix led by above premium innovation brands. Underlying MG&A increased 14.7% as we increased marketing investments behind our core brands and innovations, including the national launch of Topo Chico Hard Seltzer, as well as in local sponsorship and events, as pandemic-related restrictions eased versus the same period last year. EMEA and APAC net sales per hectoliter on a brand volume basis was up 30.1% driven by positive sales mix with the on-premise reopenings and above premium brands reaching another record high portion of the portfolio, as well as net pricing growth. Recall, in the second quarter of last year, we had lower relative spending with when our inventories were low due to the first quarter 2021 cybersecurity incidents and severe Texas storm, and we were still experiencing on-premise restrictions across all of our major geographies. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much."
}