{
    "symbol": "CLDT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 16:12:02",
    "content": " And importantly, up approximately 1% over the 2019 third quarter strengthened by strong ADR growth of 6% and offset by lower relative occupancy though quarterly occupancy of 80% is still an impressive achievement. But some of the white hot leisure markets of the past couple of years will give some RevPAR back like we saw with our Destin Hotel, which saw RevPAR decline, a small 3.7% compared to the 2021 third quarter, but still a slight decline. As business travel was a bit stronger than the Valley, if you look at deployments there, domestic deployments improved from off 11% in the second quarter to off about 9% in the third quarter, international deployments were off 16% to 2019 in the quarter, which has improved from that 24% in the second quarter. It's new versus last year and this is relevant since Austin was an open market relative to COVID, RevPAR of both hotels was up almost 25% to $150. If you look at our portfolio for the quarter excluding Silicon Valley, or excluding Silicon Valley and in our Residence Inn in Bellevue, our third quarter RevPAR was up 4% versus 2019 with ADR growth of 11% offset by a decline in occupancy of about 7%. October ADR was slightly higher than our September ADR, our highest hotels with absolute RevPAR in the quarter were at the top are Hampton Inn Portland at $285 and then our Hilton Garden Inn Portsmouth at $221 followed by Foggy Bottom Residence Inn at $206. Our portfolio is significantly better than the industry with third quarter RevPAR growth more than double the industry performance with our performance in both occupancy and ADR, occupancy reached 80% compared to industry wide occupancy of 67%. Our top five absolute occupancy hotels in the quarter are Hampton Inn Portland with occupancy of 98% followed by Residence Inn in New Rochelle, our Hampton Inn Exeter, our Residence Inn in White Plains, New York, and then our Homewood Suites Inn Bloomington making its first appearance. Looking at our recent acquisitions and our development, all four hotels we're in the top 20 producers of GOP and as a group generated RevPAR of 153 in the quarter above our portfolio average of 150 and margins at the four hotels were encouraging with Austin, generating a mark with our two Austin hotels generating operating margins of 54% and our home2 to in Woodland Hills up 4% followed by our HGI estimate 39%."
}