{
    "symbol": "PATK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 22:23:02",
    "content": " Second quarter and first half 2022 production run rates in the RV, marine and power sports market which represents 77% of our revenues were strong, and RV OEMs continue to show their incredible agility and ability to scale to meet strong demand dealer inventory channel. On the RV side of our business, which represents 57% of second quarter consolidated sales, first half wholesale production run rates annualized at over 600,000 units. Alternatively, on the Marine and Power Sports side of our business, which represents 20% of our second quarter revenues, we believe dealer inventory levels are still depleted from historical and expected new norms, pointing towards a longer refill window and strong production levels expected to last through the remainder of 2022 and likely into and possibly through 2023 until the dealer inventory channels are appropriately restocked and backlogs are reduced. To encapsulate and summarize, while production levels in the RV market are expected to materially decline from first half run rates, approximately 43% of our business, which is in the marine, power sports and housing markets expected to be stable, if not strong for the second half of 2022, highlighting our diversified model. While wholesale shipments were flat in the quarter, our RV content per unit increased 34% on a TTM basis to $4,754 per unit driven by market share gains, acquisition and our investment in automation initiatives over the past 24 months. Revenues are in our industrial market sector, which rarely tied to single and multifamily residential housing were $148 million or 10% of our overall sales mix in the quarter, increasing 24% compared to the prior year. For the second quarter of 2022, our consolidated net sales increased by $456 million or 45% to $1.5 billion, driven by organic and market-driven growth and continued strong demand and customer order activity in each of our principal end markets. Gross margin in the second quarter was 22.2%, increasing 220 basis points compared to the prior year quarter, driven primarily by contributions of our fiscal year 2021 and 2022 acquisitions, a realization of production and labor efficiencies, our automation initiatives, higher production volumes and effective leveraging our fixed costs in a rising cost environment, while at the same time, we are beginning to see a deceleration of inbound freight costs. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. We're thinking that's probably more than the $350 million, $400 million range as we think about how fast we'll move through that monetization of inventory against the backdrop of probably a little more investment in inventory to support what's happening in the other 43% of our business as they continue the strong production activity. Please proceed with your question. To add a little bit to that, as we mentioned, some of that durable improvement we have to our gross margin, which currently those categories our direct labor falls into, is really been the benefit of the automation spend, which has helped, as Jeff mentioned, peel back a lot of the temporary labor force, as you can appreciate, is a very expensive piece of the direct labor line as well as we think about the continued kind of right-size the of the RV industry for the second half of this year, the ability to peel back that over time and think about how we can manage it. Thank you, ladies and gentlemen. Thank you, ladies and gentlemen."
}