{
    "symbol": "PATK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 12:54:03",
    "content": " From a financial perspective, our first quarter revenues increased 58% to $1.3 billion, and our net income increased 137% to approximately $113 million or $4.54 per diluted share. Revenues in our industrial market sector were $127 million or 10% of our overall sales mix in the first quarter, increasing 39% compared to the prior year. For the first quarter of 2022, our consolidated net sales increased by $492 million or 58% to $1.3 billion, driven by share growth and continued strong demand and customer order activity in each of our principal end markets. Gross margin in the first quarter was 22%, increasing 300 basis points compared to the prior year quarter, driven primarily by contributions of our fiscal year 2021 acquisitions, a realization of production and labor efficiencies, and higher production volumes, partially offset by the continued pressure of raw material pricing environment and inbound freight costs. Operating margin expanded by 400 basis points from 8.1% in the first quarter of 2021 to 12.1% for first quarter 2022, lifting operating income by 136% or over $93 million to $162 million. The previously mentioned strategic actions, labor management and realization of efficiencies drove 137% growth in our first quarter 2022 net income, increasing from $48 million in the first quarter of 2021 to $113 million. Looking at cash flows, we used approximately $23 million of operating cash flows for the first quarter of 2022 compared to a generation of $50 million in the prior year's quarter. And it's certainly something we've spoken quite a bit about in the last couple of quarters, particularly on the heels of 2021, where we spent about $65 million in CapEx and a lot of that geared towards productivity improvements, driving efficiency, taking some pressure off the labor force and so on and so forth. But as you transition through that and think through the components, I'd tell you that of that 300 basis points we think there's some absorption certainly across the remaining 15% of COGS that is relatively fixed and we've seen that pretty consistently over the past couple of quarters of strong production. We've been able to really leverage our -- these improvements, whether it's some of the automation we've done, the software we put in place, the planning for longer runs and everything else, leads me back around to probably -- we're planning on 100 basis points of that being good durable lift in our margins on a go-forward basis. But to break apart that 45%, I'd say we're up about 5% to 5.5% on share gains, and that's some opportunity that Jeff mentioned in his prepared remarks, where we were generally, if you think backwards, we talked a lot in fourth quarter this year and last -- 2021 and 2020 by the deliberate build in inventory to put us in a position to best serve the market, put us in a position where -- where availability really put us in a position to gain more share, and that led to a pretty nice share capture that we think have some real stickiness to it. But we think 100 to 125 basis points of that overall lift we see that resonates through both gross margin, operating margin is attributable to our productivity improvements which take a lot of different forms, but lend off the CapEx spending we made last year, which is why we're focused on continuing that trend this year as we mentioned, $100 million is our planning number for 2022."
}