{
    "symbol": "PATK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 15:39:06",
    "content": " We achieved year-over-year growth in revenue, gross profit and net income despite a 40% decline in RV wholesale production from both the 2021 third quarter and sequentially from the second quarter of 2022. Following the year-over-year production increases experienced through the first half of 2022 at an annualized run rate of more than 640,000 units, as we anticipated RV OEMs recalibrated production starting in June, leading the industry to a more optimal dealer inventory scenario that we see today, alongside post pandemic consumer demand. Our net income in the third quarter increased 2% to approximately $59 million or $2.43 per diluted share, and adjusting for the impact of the accounting treatment for our convertible notes, our adjusted diluted earnings per share was $2.63. RV wholesale unit shipments of 91,800 decreased 40% as the industry recalibrates inventory levels and retail wholesale velocity and demand slows from last year and the first half of this year's record basis. Q3 net sales increased 5% to $1.1 billion, a strong performance in our marine and housing businesses alongside solid industry shipments were partially offset by an anticipated reduction in RV OEM production. Operating income remained relatively flat despite a 50 basis point decrease in operating margin, driven principally by the revenue impact of a 40% decline in RV OEM unit production in the quarter. What we see today is a mix change kind of happening out in the marketplace as it relates to dealers fine tuning their mix balance that they prefer going into next year, and so as we look at things, we're anticipating and I think what we see, at least in our OE partners and Iâ\u0080\u0099m certainly don't want to speak for them, but what we're watching is we think that there's rebalancing of the mix as we take place through the back part of the year with very disciplined production, pullbacks, which we think is very, very rational and then kind of positioning for a strong kind of fiscal 2023 as it relates to one-to-one retail and wholesale. And if you just take a couple of seconds to think about over since beginning of 2019 to now we've put about $1 billion into acquisitions, about $840 million of revenue has come along with those at the time of acquisition, which we've grown about 40% to $1.2 billion contribution from those years of acquisitions. I think the other side of it is that you know our scalability and flexibility and then the ability to leverage brands over the course of the last, not only quarter, but really the last 18 months when supply chain has been so significant, you know weâ\u0080\u0099ve picked up between $125 million and $150 million in additional analyzed business in the RV side of the business."
}