{
    "symbol": "STZ",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-30 17:35:36",
    "content": " Depletion volume accelerated from fiscal 2021 year-end trends and achieved nearly 11% growth for the quarter despite overlapping the peak of last year's pandemic-related pantry loading behavior, driven by continued strong demand in both tracked and non-tracked off-premise channels, as well as the return to growth in the on-premise channel. Lastly, when adjusting for one extra selling day in the quarter, the beer business generated nearly 10% depletion volume growth, and in Q2 depletion selling days are flat year-over-year. For full year fiscal 2022, we continue to target net sales growth of 7% to 9% which includes 1 to 2 points of pricing within our Mexican product portfolio and operating income growth of 3% to 5%. Lastly, we continue to expect marketing as a percent of net sales to be in the 9% to 10% range for full year fiscal 2022 which is in line with fiscal 2021 spend of 9.7% of net sales. For full year fiscal 2022, the Wine & Spirits business continues to expect net sales and operating income to decline 22% to 24% and 23% to 25% respectively. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. I think the important thing from our perspective to look at is, while we've seen 250% growth in our depletions in the quarter versus prior year, the overall percentage of our business that the on-premise represents is still a bit less than it was in fiscal year wherein calendar -- excuse me, calendar year '19. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Our robust cash flow generation allowed us to make significant share repurchases in line with our commitment to return $5 billion to shareholders by fiscal '23 and we look forward to updating everyone throughout the fiscal year, as we expect to make continued progress during fiscal '22."
}