{
    "symbol": "STZ",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-07 14:56:08",
    "content": " Our beer portfolio led by our Modelo and Corona brand families posted net sales growth of 11% and added 30 million cases of high-end growth, extending its leadership position as the #1 high-end beer supplier and the #1 share gainer across the U.S. beer market. Second, our Wine & Spirits business delivered strong organic net sales growth of 9% and solid gross margin improvement for the fiscal year. As you can see, our beer portfolio is well positioned to capitalize on compelling category and consumer trends by leveraging our core brands' competitive advantages for existing and new platforms to deliver our medium-term net sales growth target of 7% to 9%. Despite the confluence of factors impacting this business in fiscal '22, including a major distributor transition, migration to SAP, inflationary headwinds and COVID related to logistics and supply chain challenges, this business delivered strong organic net sales growth of 9% and solid gross margin improvement for the year. Our innovation efforts also produced excellent results with growth contributions coming from Meiomi Cabernet Sauvignon, Kim Crawford Illuminate Sauvignon Blanch which together both held the top 2 slots among new high-end products introduced over the last 2 years as well as the Prisoner  extensions, High West ready-to-serve packed and Woodbridge's buttery chardonnay in 3-liter box. Net sales increased 11%, landing in the upper end of our previous guided range driven by shipment growth of approximately 9% and favorable price, which, as expected, landed slightly above our typical 1% to 2% range. The increase in COGS was driven by several headwinds that included the following: first, the previously announced obsolescence charge of approximately $80 million due to excess inventory of our hard seltzer SKUs resulting from a slowdown in the overall category; second, increased brewery costs driven by incremental head count, labor inflation in Mexico and increased spend related to capacity expansion; third, increased material costs due to rising commodity prices and inflationary headwinds that, on average, landed in the mid- to high single-digit increase range, predominantly driven by wood pallets, cartons, steel, corn and aluminum. Excluding the impact of the Wine & Spirits divestitures, organic net sales increased 9% mainly driven by shipment growth of nearly 3%, favorable mix, increased pricing and small tainted bulk wine sales related to the 2020 wildfires. Fiscal 2022 corporate expense came in slightly higher than our previous guidance, finishing at approximately $238 million, up 4% versus last fiscal year. For fiscal 2023, the beer business is targeting net sales growth of 7% to 9%, reflecting 1 to 2 points of pricing benefit within our Mexican product portfolio, which is in line with our typical pricing strategy and operating income growth of 2% to 4%. Second, similar to fiscal 2022, we are expecting incremental brewery costs driven by labor inflation in Mexico is estimated to range between 5% and 6% as well as incremental head count and training expenses to support our continued capacity expansion initiatives. Excluding these impacts, we expect an underlying Wine & Spirits business to return to its targeted goal of 2% to 4% net sales growth next fiscal year."
}