{
    "symbol": "CTO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 10:15:25",
    "content": " Total investments were a record $375 million, meaningfully derisk our balance sheet by match funding our fourth quarter acquisition activity, and extending all of our debt maturities out to $2.25 or beyond, grew our common cash dividend by 12% year-over-year and we delivered 2022 total shareholder return in the top quartile of the entire REIT industry, including outpacing most of our retail-focused peers. For the year, we completed five mixed-use or retail income acquisitions for $314 million at a weighted average going in cash cap rate of 7.5% and supplemented these acquisitions with our structured investments program, where we originated $59 million of funding towards the development or redevelopment of retail and mixed-use properties in submarkets of Atlanta, Dallas and Orlando had a blended initial yield of 8.2%. For the quarter, same-property NOI decreased by 6.9%, driven primarily by the increased bad debt expense related to the hall at Ashford Lane, one-time operational and CAM-related items at Crossroads Towne Center and the Shops at Legacy, and lower year-over-year percentage rent from the Daytona Beach Restaurants, which is largely due to the more active hurricane season. Full year core FFO and AFFO year-over-year comparisons benefited from 13% same-property NOI growth, increased interest income from structured investments, growth in time-related management fees and dividend income, and was partially offset by higher relative interest expense. Basically, as we're just talking about Regal theater with them rejecting that lease and maybe doing a short-term lease that is less than what they had, the â\u0080\u0093 probably, the highest and best value total return for the company and our shareholders would be to do an apartment deal, but that would mean bringing â\u0080\u0093 having income come off the property for a couple of years until that's built."
}