{
    "symbol": "HUBB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 15:37:04",
    "content": " While we anticipate the second half operating environment to remain dynamic, and we see uncertainty around macroeconomic conditions, we are confident in our ability to continue to execute effectively and deliver on the stronger outlook due to three key factors: the strength of our end markets; the strength of our position in those markets; and our continued operational execution, particularly proactively managing price/cost as well as supply chain constraints. And I'd say that the fact that we're able to get more volume out in the second quarter is a good sign, implies that our factories were able to improve their capacity slightly even though the headwinds inside the supply chain still persist with labor materials and transportation, all being a little bit inconsistent and continuing to cause inefficiencies on the part of our manufacturing operations. Relative to our prior guidance, this raised 2022 outlook is driven primarily by stronger first half performance, stronger volume and price material assumptions, and a modest contribution from acquisitions and partially offset by higher general inflationary pressures and targeted investments in the second half. And just help me if I'm missing something here, but looking at the typical seasonality, first half to second half, it would appear at first glance that even the revised outlook may be conservative for second half, just given that price material appears to be a positive now underlying demand, particularly on the utility side, where you called out great organic growth and backlog build. I mean I think we're anticipating that it's going to affect our Electrical segment first, that our Electrical segment will feel it with a little more severity, that our utility segment might have a 1 or 2 quarter lag versus our Electrical and that it would probably be shallower and shorter in duration. Gerben kind of also commented on, we feel like the balance sheet is poised to invest and it's a really good time to help support the utility business with some growth capital and support the Electrical segment with some productivity capital, and that's how -- that's kind of how we're operating going forward."
}