{
    "symbol": "AXL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 13:42:02",
    "content": " Thank you, David and good morning everyone. AAM is now targeting sales of $5.75 billion to $5.85 billion compared to what we had earlier communicated at $5.75 billion to $5.95 billion, adjusted EBITDA of approximately $745 million to $765 million compared to $790 million to $830 million previously, and adjusted free cash flow of approximately $300 million compared to $300 million to $350 million previously. Thank you, David and good morning everyone. While we continue to be significantly impacted by this issue, we did experience a year-over-year lower negative impact, which we estimate added approximately $136 million of sales in the quarter. In the quarter, the year-over-year change in semiconductor availability and volume mix and other added $43 million and $13 million respectively to adjusted EBITDA. Third quarter material, freight and utility inflation, net of customer recoveries, negatively impacted EBITDA by $12 million. With a full quarter of Tekfor in our third quarter 2022 results, the acquisition contributed approximately $9 million of EBITDA inside the quarter. SG&A expense, including R&D, in the third quarter of 2022 was $85.7 million or 5.6% of sales. In the third quarter of 2022, we recorded an income tax benefit of $5.7 million compared to a benefit of $13.6 million in the third quarter of 2021. Taking all of these sales and cost drivers into account, our GAAP net income was $26.5 million or $0.22 per share in the third quarter of 2022 compared to a net loss of $2.4 million or $0.02 per share in the third quarter of 2021. Adjusted earnings per share, which excludes the impacts of items noted in our earnings press release, was $0.27 per share in the third quarter of 2022 compared to $0.15 per share in the third quarter of 2021. Capital expenditures, net of the proceeds from the sale of property, plant and equipment for the third quarter of 2022 were $46.6 million. Cash payments for restructuring and acquisition-related activity for the third quarter of 2022 were $4.7 million and cash payments related to the Malvern fire we experienced in September of 2020, net of recoveries was $2.5 million in the quarter. Reflecting the impact of these activities, AAM generated adjusted free cash flow of $45.8 million in the third quarter of 2022. From a debt leverage perspective, we ended the quarter with a net debt of $2.5 billion and LTM adjusted EBITDA of $754.2 million, calculating a net leverage ratio of 3.3x at September 30. As you can see from our press release, we have updated our outlook to $5.75 billion to $5.8 billion of sales, $745 million to $765 million of adjusted EBITDA and adjusted free cash flow target of approximately $300 million. As for the new adjusted EBITDA targets, the midpoint change can be summarized as follows: Loss contribution margin of approximately $30 million on lower net sales, which reflects the weighting impact of a high concentration mix of lower full-size trucks, the impact of metal costs and related Q3 inventory absorption impact of $20 million and a net amount of inefficiency of $5 million to $10 million due to this volatility. I would refer you back to some of our previous commentary on this, where in the first quarter of this year, we were almost $30 million off from an inflation standpoint on that topic. And then Chris, you said there were some negatives on the contribution margin side or the EBITDA side of $30 million in contribution margin, $20 million on metals and then $5 million to $10 million on volatility that would kind of indicate all else equal, that youâ\u0080\u0099re looking for sort of $60 million lower on EBITDA versus, I think, the third quarter, right? And I wanted to ask just to clarify that I am seeing in Q4 year-over-year revenue growth from $1.2 billion last year to $1.4 billion this year and it looks like kind of similar, maybe just a tad lower revenue in the fourth quarter versus the third quarter, but you also had that $20 million inventory charge in the third quarter."
}