{
    "symbol": "ESE",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-08 21:30:21",
    "content": " On the call today, we have Bryan Sayler, President and CEO; Chris Tucker, Senior Vice President and CFO. And now I would like to hand the conference over to our first speaker today, Kate Lowrey, Vice President of Investor Relations. Due to risks and uncertainties that exist in the company's operations and business environment, including, but not limited to, the risk factors referenced in the company's press release issued today, which will be included as an exhibit to the company's Form 8-K to be filed. In addition, during this call, the company may discuss some non-GAAP financial measures in describing the company's operating results. Thanks, everyone, for joining today's call. It's really great to be on the call for the first time as CEO, here at ESCO. Our year is off to a great start, and I'm excited to talk about the financial results. So it's been a pretty busy start to the year, but an exciting one for me personally, and I'm really energized to be in the new role. The business has a lot of really cool things going on, and we have some really neat capabilities there. Due to the technical nature of ESCO's product portfolio, the labor shortage continues to be a drag on our overall growth, particularly at our A&D and Utility Solutions Group. So Chris will get into some of the financial details in a few minutes, but I did want to offer some top-level commentary about each of the business segments. Let's start with Aerospace &Defense, where we had another great quarter. The commercial aerospace business continues to see robust demand environment, while Navy and space business are really working on some important programs. These businesses are newer to me, but we're really fortunate to have strong management teams with deep knowledge about those industries, and they're really showing me the ropes as I get used to the new role. Next is the Utility Group, where we had a strong quarter. The core utility business continues to be solid as our customer base invests in their infrastructure, and we can continue to see backlogs grow. On the renewable side, the growth continues to exceed expectations. As most of you know, 2021 and '22 were both 20% plus years of growth for NRG, but the growth story remains intact as we look forward. I mentioned before, the component supply issues have been -- have improved a bit compared to prior year, but shortages do impact our operations, and this has been pretty noticeable overall on the utility side. Lastly, let's touch on the Test business, where we had a nice quarter of sales growth and EBIT margin expansion. As you saw in the press release, orders did decline in the Test segment compared to the first quarter of the prior year. Overall, we think the outlook here is still positive. And you should remember that we had outlined lower growth expectations for Test, and we gave our initial guidance back in November. For Q1 in particular, we had some exceptionally high orders in the prior year related to power filters as well as Test and measurement products in the U.S. and China. So to summarize across the overall business, it really is a great start for ESCO this year. As Bryan mentioned, we had a great quarter, and this chart illustrates that very well. We will get into those details in a moment, but we did see good growth in 2 of our 3 business segments on the orders line. Overall, the order trends have remained robust, and our December '22 backlog of $718 million is a record and demonstrates the strength of the overall business. Next on Chart 4, we'll get into the segment results, starting with Aerospace &Defense. Beyond that, we still saw good growth from other parts of the business with Defense& Aerospace, Navy and Space, all up more than 10%. Orders were also good with growth of 8%, driven by Navy and commercial Aerospace strength. The next business is on Chart 5, Utility Solutions Group, where we also had a very strong start to the year. Another strong quarter for this group, with sales up 19% and EBIT up 36%. Overall, the book-to-bill in Q1 of fiscal '23 was still at 1.0, and the orders were in line with projections at the beginning of the quarter. The next chart, Chart 7, is our first quarter cash flow highlights. Working capital was unfavorable in the quarter with inventory and accounts payable, driving an unfavorable impact compared to last year's first quarter. Capital spending was down just over $9 million in the quarter compared to last year, and acquisition spending dropped by nearly $16 million as there were no deals closed in Q1 this year and last year had the NEco acquisition in the A&D Group. On share repurchases, we completed just over $4 million in this quarter compared to $10 million in the prior year quarter. For the second quarter, we expect a range of $0.68 to $0.74 per share on an adjusted basis. And as mentioned above, we see the Test forecast for the full year is still intact. So obviously, a great start to the year for ESCO with strong financial performance. As I mentioned before, I've had a chance to visit all of our subsidiary locations since taking over, and everybody's really been welcoming I really appreciate that. But more importantly, everybody has been really busy, and they're working really hard. We're growing, and we're managing a number of challenges that could put a lot of strain on people, and I'm really grateful for their dedication and for their efforts. If I just go through the segments, for A&D, I think it was 10% to 13% year-on-year, USG 5% to 7%, Test 3% to 5%. But it's consistent with our overall plan that we're still going to get growth for the balance of the year, but the growth will moderate from those first quarter levels. If you look at last year, again, our growth was a little lower in the first half, and then we had really strong double-digit growth on an organic and reported basis last year in the third and fourth quarter. We still have, as you know, high levels of backlog and a good outlook. And I'm just curious what inning it feels like we're in, in this recovery, strong several good quarters together in a row here, you're going to start lapping over those. I would say honestly, Tommy, it's a little hard to say what we would say is that we feel like the recovery still has legs. As far as what inning we're in, if you look out a couple of years at kind of industry projections, they still have pretty robust double-digit growth expectations just kind of in the build rates. The industry is still struggling to kind of ramp up throughout '22 and now in '23, the build rates aren't quite where the OEMs want them. I'd say we're maybe not to the middle of the game yet, but we've got -- we do feel pretty good that the outlook is still pretty robust there. I think we feel pretty good about the overall growth, Tommy. Each of the major OEMs are ramping up I think there's some question as to how quickly and how effectively they're going to be able to ramp up because the commercial aerospace, there's still a fair amount of supply chain disruption across the board. And so they're struggling to get back to where they want to be, but there's certainly underlying strength in the overall segment. I'm showing no further questions at this time. I'd like to turn the call back over to management for any closing remarks. So I either jump in front of someone or we can just have a conversation with the 4 of us today, but...\n Well, there's more questions, looks like. While I'll just ask the one follow-up, I was going to wait until the end of the call for. But just on cash flow, and Chris, you called out some of the headwinds in the first quarter. This quarter, no doubt that will be the case for this year as well. I think we're trying to drive that into the 80%, 90% range, Tommy, to get quantitative on you. That's maybe a little below where we've been through the last couple of years, but we've had cash can kind of come in chunks a little bit. So that counts against that ratio, but that's -- hopefully, that kind of tells you where we're driving towards. Yes, we still feel pretty good about where the Test business is. We're not going to expect that, that's going to have a meaningful impact in FY '23. And so we do expect that over the 2- to 5-year time frame, that we're going to see substantial growth in that overall business. I don't think I have anything that's imminent for you, but we are constantly working on those things, and we're developing additional opportunities as we speak. I was wondering if you could talk a little bit more about the constraints that you're facing, both from a supply and labor perspective. So things like outside processing, pieces like that, where they're struggling to get ramped back up to the full speed. So we're able to kind of maintain our original plans, but we're having a hard time scaling up to some demand that were -- some increased demand we're seeing in the marketplace in a couple of places. But listen, it's still challenging and every day is a new adventure when it comes to supply chain. And just wondering what high level thoughts you have about the direction of the company and kind of what you may be thinking about changing I know we've spoken before about that, but if those costs evolve, I'd love to hear kind of what opportunities you should...\n Well, I won't be announcing any major strategic adjustments today. But I -- first of all, listen, I think we're in a great place. As I've said in my comments, this is a really nice business with great exposure to some growing end markets. I think obviously, Q1 is kind of typically our seasonal low point. We're driving kind of that full year free cash flow conversion, hopefully, in the 80%, 90% range. So that's driving the capital a little higher this year, but that's kind of the framework we're driving towards this year. I'm showing no further questions at this time. I'd like to turn the call back over to management for any closing remarks. We've had a good quarter, and we think we're going to have a good year. Ladies and gentlemen, this does conclude today's conference."
}