{
    "symbol": "ONTF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 22:25:22",
    "content": " Before we get into results, as a reminder, the ON24 core platform includes six products to create live, always on and personalized experiences that work together to drive deep engagement, generate first-party data and provide a unified set of customer insights that integrate with our customers business systems so that sales and marketing organizations can take the right actions to deliver pipeline and revenue growth. Revenue from our core platform, including services in Q4, 2022 was $44.2 million and total revenue, including virtual conference was $46.6 million. We ended 2022 with $152.6 million in ARR, related to our core platform, representing a sequential decrease from Q3 of $3 million, when excluding the impact of foreign currency, which is currently $400,000. Since our last call, the macro environment has become more challenging of the five verticals, which each account for 10% or more of our annual core platform ARR, we saw mid-single digit percentage reductions in ARR between Q3 and Q4 2022 in technology and manufacturing. Lastly, while the macroeconomic environment may continue to be bumpy, we're intensely focused on and confident as ever in delivering long-term shareholder value, which is evident in our commitment to the new $100 million capital return program that we expect to execute in 2023. Revenue from our core platform, including services in Q4, 2022 was $44.2 million, representing a decrease of 7% year-over-year. Total revenue for the fourth quarter, which includes revenue from our virtual conference product was $46.6 million, representing a decrease of 11% year-over-year. Total professional services revenue was $4.5 million, a decrease of 36% year-over-year, representing approximately 10% of total revenue compared to 14% in the year ago period. Our strong balance sheet has allowed us to return a total of $41 million under our existing share repurchase program to date, including approximately $7 million in Q4 2022, and an additional approximately $5 million in early Q1 2023. For Q1, we expect core platform revenue, including services in the range of $40.2 million to $41.2 million and total revenue, which includes our virtual conference product in the range of $42 million to $43 million. For the full year, we expect core platform revenue, including services to decline 10% to 7% and to be in the range of $160 million to $165 million. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}