{
    "symbol": "ONTF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 03:21:04",
    "content": " Despite this uncertainty, we believe we continue to have a strong market position and continue to land new customers and expand with existing customers, showcasing that our digital engagement platform, particularly the first-party data it generates, is becoming a key driver to the success of an organization's revenue growth strategy. Our vision is to help businesses unify their sales and marketing, digital engagement and first-party data with a platform that powers all digital experiences: live, always-on, personalized or hybrid. In listening to our customers, we heard a consistent pain point, the need for a new type of live experience solution in the market that had all the branding, audience engagement and first-party data of our flagship live experience product, ON24 Elite, but also enable the audience to participate and live to a video to video discussions. In Q1, we added a new business division in $100,000-plus deal that includes the entire suite of ON24 experiences, Forums, Elite, Breakouts, Go Live, Target and Engagement Hub, growing the account by 5x in ARR over 2 years. We believe that our new products, along with our VIBBIO acquisition, provide us new use cases and buying centers to address and further evolve our platform for a post-pandemic world by extending ON24's footprint and additional sales and marketing use cases. This quarter, we recently developed a more advanced integration with HubSpot that enables customers to fully leverage the first-party engagement data they generate from ON24 and providing more ways for sales and marketing to take action from our data. Our deep integration with Viva brought them to ON24 and resulted in a multiyear, multiproduct deal over $100,000, consisting of ON24 Elite, Breakouts, Engagement Hub and Target, to deliver an ongoing and differentiated set of first-party insights directly to the system that their sales reps use. As we evolved our platform for the post-pandemic world, the 2 new products that we launched, ON24 Forums and ON24 for go live, our focus really is to build this sales and marketing, digital engagement platform that helps our customers capture first-party data, drive continued pipeline and engage with prospects. And again, our focus is, John, is -- our focus is to consolidate all the different sales and marketing use cases for customers: webinar series, virtual events, customer advisory board, roundtables, partner enablement, one platform that a company can have with the right branding that drives their first-person engagement data. The other thing I also want to mention is it's not only these products, but what it does allow us to really now basically, listening from our customers, have run sales and marketing, digital engagement platform allows us to consolidate those sales and marketing use cases, allows us to elevate the conversation more to a CMO and CRO level even more so."
}