{
    "symbol": "PCTY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-05 07:48:02",
    "content": " On a dollar basis, our year-over-year investment in total R&D increased by 44.9% when compared to the first quarter of fiscal 2022, and we remain focused on making incremental investments in R&D throughout fiscal 2023 as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regards to our go-to-market activities, on a non-GAAP basis, sales and marketing expenses were 23.9% of revenue in the first quarter, and we remain focused on making incremental investments in this area of the business in fiscal 2023 to drive continued growth. One moment for our next question. One moment for our next question. One moment for our next question. And I think what you also saw from us was running the business fairly consistently with how we had been preceding the pandemic in terms of continuing to hire across the business, continuing to invest for future growth in product and sales and marketing and operations and really across the whole business. So I think as we step back and look at the quarterâ\u0080\u0099s results from a profitability standpoint, felt like we executed against our game plan of leverage in margin and G&A, and you saw the incremental investment in growth driving areas of business that primarily being sales and marketing and R&D. One moment for our next question. I think the way we like to think about that is if you take the total amount of product that we can sell, meaning if a customer bought everything, and you do the math based off of roughly our average client size, which we give you directionally, and you look at the total number of clients, youâ\u0080\u0099re going to get to a number thatâ\u0080\u0099s, call it, approaching 60%, up to two-thirds in that kind of range of all available product that we can sell to our clients. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question."
}