{
    "symbol": "WIRE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 21:18:06",
    "content": " In a minute, we will review Encore's financial results for the second quarter ended June 30, 2022. By continuing to execute on our core values of providing unbeatable customer service and high order fill rates, we were able to increase both copper and aluminum volumes shipped in the second quarter and year-to-date periods in 2022 over 2021 levels. Net sales for the second quarter ended June 30, 2022, were $838.2 million compared to $744.4 million for the second quarter of 2021. Copper unit volume measured in the pounds of copper contained in the wire sold increased 5.5% in the six months ended June 30, 2022, versus the six months ended June 30, 2021. The average selling price of wire per copper pound sold increased 15.6% in the first six months of 2022 versus the six months ended June 30, 2021, while the average cost of copper per pound purchased increased 10.2% for the same period comparison. Aluminum wire represented 15% and 13.4%, respectively, of our net sales in the quarter and six months ended June 30, 2022. Aluminum wire volumes and spreads have increased for both the quarter and six months ended June 30, 2022, compared -- comparative periods in the prior year. The favorable market conditions through the second quarter ended June 30, 2022, were driven by stable demand for our products, persistent tightness in the availability of certain raw materials, ongoing global uncertainties, and suppressed availability of skilled labor kept spreads strong through the second quarter of 2022. The strong performance in the second quarter ended June 30, 2022, further attests to the strength of our on-campus vertically integrated low-cost business model which continues to thrive under current market conditions. Gross profit 38.3% in the second quarter versus 33.7% in the first quarter and then go back to the underlying dynamic that we talked about, which is the volatility in the raw material and it highlighted, it's a lot more like we've been saying throughout this pandemic is just the metal, right? And it gets a little bit more into the markets we talked about, data centers, renewables; what commercial, industrial and residential looks like in today's world about the Infrastructure Bill, the $450 billion Infrastructure Bill."
}