{
    "symbol": "WIRE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 14:27:08",
    "content": " Our key suppliers continue to perform at a high level which positions us favorably in meeting customer demand in a timely manner by continuing to execute on our core values of providing unbeatable customer service and high order fill rates, we were able to increase both copper and aluminum volumes shipped in the fourth quarter and year-to-date periods in 2022 over 2021 levels. Copper unit volume measured in pounds of copper contained in the wires sold, increased 7.9% in the year ended December 31, 2022 versus the year ended December 31, 2021. The average selling price of wire per copper pound sold decreased 0.5% in the year ended December 31, 2022 versus the year ended December 31, 2021, while the average cost of copper per pound purchased decreased 2.7%. Net income for the year ended December 31, 2022 was $717.8 million versus $541.4 million in the same period of 2021. Fully diluted net earnings per common share was $36.91 for the year ended December 31, 2022 versus $26.22 in the same period in 2021. Net sales for the fourth quarter ended December 31, 2022 were $693.9 million compared to $687.9 million in the fourth quarter of 2021. The average selling price of wire per copper pound sold decreased 14.1% in the fourth quarter of 2022 versus the fourth quarter of 2021, while the average cost of copper per pound purchased decreased 14.4%. The gradual abatement of copper spreads in the quarter was more than offset by increased aluminum spreads and an overall increase in total volume shipped, resulting in increased gross profit margin in the fourth quarter of 2022 when compared to the fourth quarter of 2021. Aluminum wire represented 17.8% and 15.4% respectively of our net sales in the quarter and year ended December 31, 2022. Results through the fourth quarter ended December 31, 2022 were driven by stable demand for our products and the general inability of the sector to meet demand with the timely delivery of finished goods Persistent tightness and the availability of certain raw materials, ongoing global uncertainties, and suppressed availability of skilled labor kept overall spreads strong through the fourth quarter of 2022. All these factors have contributed to the general inability of the sector to meet the demand for the timely delivery of finished goods, which positioned us favorably to expand volumes shift for both the quarter and year ended December 31, 2022. Your line is open. I mean, itâ\u0080\u0099s also â\u0080\u0093 when you look at this, and itâ\u0080\u0099s not obviously just an aluminum story, it was a contributing factor, but copper volumes are up 7.9% for the year and 7.9% for that quarter. Your line is open. Your line is open. Your line is open. Your line is open."
}