{
    "symbol": "WIRE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 14:40:06",
    "content": " My name is Cheryl, and I will be your operator for today's call. In a minute, we will review Encore's financial results for the quarter ended December 31, 2022. Before we review the financials, let me indicate that throughout this conference call, we may be making certain statements that might be considered to be forward-looking. In order to comply with certain securities legislation and instead of attempting to identify each particular statement as forward-looking, we advise you that all such statements involve certain risks and uncertainties that could cause actual results to differ materially from those discussed today. Also reconciliations of non-GAAP financial measures discussed during this conference call to the most directly comparable financial measures presented in accordance with GAAP, including EBITDA, which we believe to be useful supplemental information for investors, are posted on our Web site. The continued strong results in the first quarter ended March 31st, 2022 marked the fourth consecutive quarter of elevated margins and spreads. Stable demand coupled with developing global uncertainties and persistent tightness in the availability of certain raw materials drove copper, aluminum and other key raw material prices higher in the quarter. Because of this trend, we were able to increase average sales price for our products, keeping spreads strong throughout the first quarter of 2022. We still believe our one campus model is a strategic competitive advantage in the market today, giving us unmatched flexibility to quickly pivot and adapt to dynamic external market forces. By continuing to execute upon our core values of providing unbeatable customer service and high order fill rates, we were able to increase both copper and aluminum volumes shift on a comparative quarter basis over 2021 levels. Copper unit volumes increased 8.6% on a comparative quarter basis, Comex copper prices increased steadily throughout the first quarter, along with increases in other key raw material cost. With the new capacity coming online this year, we believe Encore Wire remains well positioned to capture incremental market share and volume growth in the current economic environment. As we address the near-term challenges, we remain focused on the long-term opportunities for our business, including improving our position as a sustainable environmentally responsible leader in our industry. Net sales for the first quarter ended March 31, 2022 were $723.1 million compared to $444.1 million for the first quarter of 2021. Aluminum wire represented 11.5% of our net sales in the quarter ended March 31, ’22. Aluminum wire volumes increased for the quarter ended March 31, 2022 compared to the comparative period in the prior year. The favorable market conditions in the first quarter ended March 31, 2022 were driven by consistent demand for our products. Persistent tightness and the availability of certain raw materials, developing global uncertainties and suppressed availability of skilled labor drove copper, aluminum and other key raw material prices higher in the quarter. Because of these trends, we were able to increase average sale prices for our products, keeping spreads strong throughout the first quarter of 2022. However, we do believe the existing market conditions and the current outlook should support gross margin abatement continuing at a gradual pace. During the first quarter, we repurchased 500,917 share of our common stock at an average price of $116.55, for a total cash outlay of $58.4 million. The incremental investments announced in July of 2021 continue in earnest, focused on broadening our position as a low cost, sustainable manufacture in the sector and increasing manufacturing capacities to drive growth. Capital spending in 2022 through 2024 will expand vertical integration in our manufacturing processes to reduce costs, as well as modernize select wire manufacturing facilities to increase capacity and efficiency, and improve our position as a sustainable and environmentally responsible leader in our industry. We expect total capital expenditures to range from $150 million to $170 million in 2022, a $150 million to $170 million in 2023 and $80 million to $100 million in 2024. The strong performance in the first quarter ended March 31, 2022 further attest to the strength of our one campus vertically integrated low cost business model, which continues to thrive under current market conditions. Our deep relationships and strong internal management team, coupled with consistent execution, positions us favorably in the market, allowing us to maintain our overall low cost structure. Looking ahead, we remain solely committed to execute upon and the core values of the company, unbeatable customer service, nimble operations and quick deliveries coast to coast. Daniel, I think historically your unit volumes typically slow in the first quarter, but it sounds like they up from 4Q. The commercial side is strong and the industrial side is strong for us, the amount of quotes that we're seeing and the execution on the delivery side, our fill rate is significantly improved in the first quarter. But from a demand perspective, we're continuing to see each of the sectors to be pretty strong, including the aluminum piece. And Daniel, are you -- when I look at the that continued strong spread increase, are you seeing larger spreads or premiums, for certain maybe your products relative to the whole portfolio, just based on industry demand for those products or just a lack of availability. The sales team's done a real fantastic job of managing that intake so that we're able to execute, perform and the production team, operations team is really back to that. If you had to pick one for whatever reason it could be the aluminum push has been good, the residential push has been good, the commercial side has been really good and industrial is strong as well. So there's really not one that's just outpacing or outperforming the other, the overall market itself has been really good for us. And then Daniel, just beyond copper, which we can all is still pretty tight in the market. Aluminum is tight, copper is tight, some of the PVC raw materials are tight, pretty much across the board, freight’s tight. There's still that pressure, if you will, to really pay attention to what's happening. And we were really aggressive and able to perform real well in the first quarter on cost controls, material usage controls, maximizing the trucks that do show up on time. It's really not -- there's not one particular item that stands out as being a problem as far as the supply chain piece goes, it's all still relatively tight. Brent, it's just a real focused push, a lot of pressure on the people side here and everybody's responding the way that they should at this point. I still think throughout the supply chain, you're seeing the impact of underinvestment during the pandemic and reactionary terminations or layoffs that you're trying to build back your force and get that investment dollars flowing again. So when one thing gets a little better that's up for the month and three others go the other direction, but it's still a lot of effort, teams executing exceptionally well, our suppliers are executing exceptionally well. So it seems like when they fixed one link of the supply chain, it puts strain on three others and that's what’s consistent last year and that same pattern held through the first quarter. But from a residential standpoint for the quarter, it was about 31% that compares to 32% for the first quarter of last year. If you look at like the first quarter compared to the fourth quarter, you were at 31% residential in the first quarter and we were at like 29.5% residential on the fourth quarter. Well, on the commercial piece, overall, it's good categorically. Without getting too deep into the details, there's some changes on the demand side that are good. On the quotes side it’s changed a little bit, seems to be more driven toward the service side, which we drive with. The timing of the deliveries, which is one of our strengths, that has really paid off for us in the last quarter. The approach to the commercial quote side, the timing from the quote to delivery has shrunk dramatically, the volatility in raw materials, the volatility in finished good deliveries in the industry have helped to drive that. But when -- once the quote is given, purchase orders placed and the delivery, that whole timeframe is really compressed and causing a little bit of chaos. That’s a good chaos for us, because we're able to step in and make those deliveries. You've gotten much more aggressive with buybacks, which to me looks like you have good confidence in the underlying business. We announced that expanded buyback increasing the authorization to 2 million shares through March -- end of March, 2023. As you know we've now repurchased 500,000 of those in the first quarter. If you go back to the repurchases, even going back to when we started this buyback in March, April of 2020, we've purchased over 1.4 million shares over that period. And so we continue to see after CapEx and the growth and the CapEx focused on deep and inter vertical integration to take costs out to help us with our order fill and speed of shipment, and then environmental and things associated with that. So as you mentioned, you bought back a ton of shares in this last quarter at an average price of $116. A you navigate through our repurchases, you can go back in history and we've typically bought back the stock close to the book value, and that's really what you'd evidenced when you look at the buybacks in March of 2020 and April of 2020, when we got about 441,000 shares. If you look at our PE, we're sitting below four right now, so with the trailing 12 month earnings of $32, little over $32. And so we all feel, including the boar, confidence in the value of the stock and think that the buybacks at these levels are very much still warranted. And with the 500,000 we repurchased this quarter, again, I think that was a very good use of cash. Even with the $58 million that we spent in the first quarter on buybacks, the $32 million that we spent on CapEx, we still grew cash $27 million. So from a cash perspective, the balance sheet remains very, very strong with sufficient resources to fund all of our CapEx growth without leveraging the company and still have the opportunity to look to other uses. We've always said, you can tell me exactly what copper and all other raw material costs, my access to skilled labor, distribution and freight costs. And it's a difficult, this is a different world we're in today. And make the pandemic, and the shortages, and the tightness of supply chains really highlighted the significant component that each one plays in producing a finished good and a final product. We had I think gross margin of around 15% in 2020, and then you look at gross margin year-to-day basis last year of 33.5%. Obviously, as we look towards this, we really had said all last year that we thought that from a copper perspective, it probably peaked in June and we expected it to abate. Four quarters in now, we feel more comfortable with that gradual abatement. And if you look at the margins as to what they did for last year for the fourth quarter and then where we came out in the first quarter, it has shown it's debating at that slower pace. But there's still -- as you look at this, we look at the outlook, we look at the tightness that still exists and you look at the demand and those are the factors that we are considering as we kind of look out. We don't give guidance, Ron, but it's based on what we're seeing right now. And the -- I guess with the upgrading of the grid, I imagine there's some upgrading to the wiring of people's residential houses as well. As far as the residential piece, each house based on the square footage measurement would show that there's more copper going into a house definitely with the upgrades that we're having. As the grid is upgraded, there's service entrance cables, there's all kinds of products that will contribute to that. And with the increase in demand and increase in volume, categorically, we'll see demand coming from even as you'll see -- you might see some number of houses, the building permits, whatever it might be. And I'm trying to kind of not get too deep into it, and it's hard to answer that. But there should be demand coming from these quotes that we're already seeing, we will be able to participate at a higher volume and may be too vague."
}