{
    "symbol": "MGY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 16:18:04",
    "content": " We repurchased a total of 4.1 million shares, reducing our total diluted shares outstanding by 8% compared to last year's second quarter. We established quarterly records for many of our key operating financial metrics during the quarter, including production, net income, diluted earnings per share, free cash flow and most notably operating income margins or EBIT of 68% during the period. During the quarter, we have repurchased 4.1 million Magnolia shares for $102 million and ended the quarter with $502 million of cash in the balance sheet or about 10% of the company's equity market value. Our total adjusted cash operating costs including G&A were $14.04 per BOE in the second quarter of 2022, an increase of $2.64 per BOE compared to year ago levels. Including our DD&A rate of about $8.50 per BOE, which is generally in line with our F&D costs, our operating income margin for the second quarter was $48.62 per BOE or 68% of our total revenue and more than double compared to year ago levels. Looking at the third quarter of 2022, we expect our total production to be between 74,000 and 76,000 BOE per day and our D&C capital is estimated to be between $105 million and $115 million. And I guess maybe just on to follow up a little bit on the infrastructure, I mean, is that kind of a rough number where it's relatively small, I'll call it $20 million a year for the next couple years. But I think as the sort of progresses, you're going to find â\u0080\u0093 we're going to find some small, I mean, $25 million, $30 million, $40 million acquisitions to build the business as we get closer to $100,000 a day in production. We just look at â\u0080\u0093 we think it's all about money and so what we find is in the gas, we're drilling some gasier wells and some oilier wells, and it really isn't â\u0080\u0093 it's almost strategy free. So I think we're right now by sheer chance, we're sort of splitting between the oilier areas and the gasier areas, but it could shift to more oilier or more gassy, just, again not necessarily driven by product price, not the price of natural gas falls to $0.50 or $2 we probably have a different view, but with a $4 or better number pretty unlikely that will pass on any gas locations."
}