{
    "symbol": "HCP",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-02 21:13:03",
    "content": " And I think what we've seen is, it's a pretty consistent trend across customers regardless of region they’re continuing on their journey to cloud, continuing on their journeys to digital transformation. So yes, you can infer that I would expect those customers on board and get to their expansion and extension to cross product faster and that's certainly the design principle of why we've created HashiCorp cloud not as just a cloud version of one of our products but rather as a single common chassis towards all our products drop that allows us to then encourage that motion. And I think the operational reality of infrastructure products, it makes people slower to adopt but also once they start running them themselves realize how critical they are, and so I think we're certainly optimistic and harmonized travel certainly last quarter, you saw that expressed more often than I would have expected, hey, can you run the stuff for us and so we need that market as it comes super optimistic. I think in general, what we've seen is most of these large enterprises have embarked on their cloud journey several years ago and I think they see it as a transition that's going to take them five, 10 years to really complete. But then being able to tell a compelling story around, great, how can we extend that to service networking and really do bring a zero trust approach network segmentation with Consul, right and I think you saw that in our second $10 billion customer where they're really looking at great, how do we embrace those zero trust primitives and really extend that beyond just identity with Vault and application security into the networking aspect. And then a sort of another product and the topic I wanted to revisit again, I’ll get what we think is part of all of your earlier question which is around sort of monetization triggers, and it's a topic, but I think we get quite often with respect to Terraform, but also with respect to Vault, I think you sort of mentioned your strategic customer wins. Just one point I'll add because your question around the dynamics, I think we have learned that before you can tackle the Service Mesh problem, you have to generally solve the provisioning and security problem, right, because to the move to the notion of service-based identity, it's hard to move to service based orchestration just to double-click on it a little bit. And on your second question, if you think -- we think about the usage of our products in two phases, in which step one is around our focus on practitioner adoption and open source when people very much begin their cloud programs they use our products in open source, because that's what the practitioners use."
}