{
    "symbol": "FOX",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-03 22:15:35",
    "content": " Since launching last fall, News on Tubi viewership has grown over 130%, and Tubi continues to expand its linear offerings with our recent launch of Sports on Tubi, which further leverages Fox's content expertise with premium sports channels, including Fox Sports, the NFL Network, and the MLB network. Total Company's advertising revenues increased 17%, reflecting strength in the national and local marketplaces, return of normalized programming schedules following the COVID-related postponements and cancellations last year, and continued strong growth of Tubi. Quarterly adjusted EBITDA was $1.06 billion, down 9% against the comparative period in fiscal '21, reflecting higher operating expenses associated with the return of normalized sports and entertainment programming, and as we signaled on our fiscal '21 year-end call, increased digital investment at Fox News Media and Tubi. Cable advertising revenues increased 4% supported by the return of a full-slate of College Football games at the national sports networks, following the COVID -related disruptions that occurred last year, as well as the addition of international soccer matches, including the Gold Cup. Cable other revenues increased by $26 million primarily due to the return of sports sublicensing revenues and pay-per-view boxing following the COVID disruption last year, as well as continued subscription maintained at Fox Nation. EBITDA at our cable segment was down $7 million versus the prior-year period, as these healthy revenue growths was offset by higher programming costs, the National Sports Networks, primarily due to the sports scheduling changes I just mentioned, and the anticipated increase in digital investment at Fox News Media, including costs associated with last week's launch of Fox Weather. Finally, EBITDA at our Television segment was down $98 million against the prior year period, as this healthy revenue growth was offset by higher programming costs primarily associated with normalized sports and entertainment schedules at the Fox network, and increased digital investment at Tubi. Operator, we can go to the next question. Operator, we can go to the next question. Operator, we can go to the next question."
}