{
    "symbol": "FOX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-10 12:16:16",
    "content": " Over the year, we delivered 8% total company revenue growth, including 7% affiliate revenue growth, notably, without the benefit of any meaningful renewals and 9% advertising revenue growth, despite the record political revenues we saw in the prior fiscal. At the national level, we believe that we achieved the highest upfront pricing increases in cable news history at FOX News, which to a certain extent is to be expected, as the FOX News channel again closed the year, as cable's most watched network in prime time in total day and continues to generate audiences on par with those of the Big 4 broadcast networks. Even in a year that for us was light on major sports events and was an off-cycle political year, total company advertising revenues led this growth with a 9% increase over fiscal 2021. Television segment advertising revenues were up 8% on the back of increased engagement of Tubi, as well as higher pricing and the normalization of live event programming at the FOX Network, following COVID-related disruptions last year. Total company other revenues increased 15%, driven by higher sports sublicensing revenues as compared to prior year pandemic-related disruptions, growth in FOX Nation subscription revenues and the consolidation of TMZ MarVista and Studio Ramsay Global. This growth was led by a 7% increase in total company advertising revenues, highlighted by the strength of FOX News, record June quarter political revenues at FOX Television stations, and continued growth of TUBI. Total company other revenues increased 4% as the consolidation of our entertainment production companies and continued momentum at FOX Nation, were partially offset by the timing of sports sublicensing revenues, which were impacted by COVID in the prior year. Quarterly adjusted EBITDA was $770 million, up 7% over the comparative period in fiscal 2021, as our revenue growth was partially offset by higher expenses, including the impact of the anticipated digital investments of FOX News Media and TUBI, and the first year deficit associated with the launch of the USFL. This was led by a 14% increase in cable advertising revenues, driven by strong gains in both pricing and audience at FOX News, notwithstanding slightly higher levels of preemptions associated with our breaking news coverage. EBITDA at our Cable segment was down 7% against the prior year as these revenue increases were more than offset by increased expenses, including the planned digital investment and higher programming costs, including those associated with breaking news coverage at Fox News Media, as well as the launch of the USFL. Our Television segment delivered 4% growth in advertising revenues, driven by higher political advertising at the FOX Television stations, continued growth at TUBI, and the introduction of the USFL, partially offset by lower ratings of FOX Entertainment. Operator, we go to the next question, please. Operator, we go to the next question, please."
}