{
    "symbol": "WOLF",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-25 22:32:05",
    "content": " Your line is now open. Your line is now open. Thanks a lot, guys. Your line is now open. I know last quarter, there was the guidance about sort of exiting fiscal 2Q or the December quarter at roughly $1 billion run rate of revenue and based on sort of your commentary today, it seems more you are saying the scaling to that $1 billion sort of revenue run rate even when we think about fiscal 4Q, if you sort of put Mohawk aside, is maybe a bit difficult because RF demand has moderated and essentially your Durham has a bit more gap in terms of power devices. I think as we looked at this back in October and we were looking at this quarter, given the taller bull yield issues, the supply chain challenges and the Durham fab, our anticipation was to be maybe meeting that kind of $1 billion run rate, kind of $0.25 billion revenue number run rate sometime during Q3. Your line is now open. Your line is now open. Your line is now open. So right now, I think, what you see is kind of the peak start-up and underutilization number that will just start winding down over time and that should give people a really good view of what the fab capability is from a cost perspective, even at a relatively low level of utilization and what you see there is when we talk about the fab having die cost itâ\u0080\u0099s 50% lower than our current cost in Durham, thatâ\u0080\u0099s really based on the kind of lower utilization numbers. Your line is now open. Your line is now open. Your line is now open. But what I would say is, if it follows the pattern that we have seen over the last couple of quarters, itâ\u0080\u0099s going to be pretty heavily automotive related, kind of think of it as 70%, 75% automotive related and then 25% would be either industrial type applications, RF applications and so forth. Your line is now open. Thanks a lot, guys. And so if you capped at $100 million there, plus what we get out of RTP, then the real growth is just going to come out of materials, which I understand now that you have got the bull issue corrected could ramp, but until you get Siler City based on, I would expect and correct me if I am wrong, you are going to see rather limited ramp in revenue on materials, even though demand far exceed supply at this point. Your line is now open. And then as it relates to Mohawk Valley, as we ramp the fab, we will see -- that will be accretive to non-GAAP gross margins and we will make an adjustment for underutilization there just to make -- just to ensure we can get kind of an apples-to-apples view of what their fab will look like from a quarter perspective and then we will continue to give updates every quarter as to what that number is. Your line is now open. And I think from a timing perspective, like I said, it depends on how many -- how much -- how many wafer starts we can get into the fab and kind of ramp it up at volume and once we do that, you should see a pretty nice ramp-up in revenue."
}