{
    "symbol": "BKSY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 12:39:05",
    "content": " Highlights of the first quarter include: record revenues of $13.9 million, up 91% over the prior year period; new and expanded contracts with U.S. government customers; new and expanded contracts with international government customers in Europe, Asia Pacific and the Middle East; engagement with several new major companies spanning multiple vertical markets; expansion of our software platform to include new imagery, sensor and analytic capabilities; the successful launch and commissioning of two additional satellites in April, expanding our constellation’s revisit and imaging capacity; and the continued expansion and growth our sales force and global reseller network. Turning now to our commercial business, we’re seeing greater interest for BlackSky’s disruptive, on-demand imagery and analytics delivered through our AI-driven software platform across a number of vertical markets, including financial services, geospatial information systems, commodities, and natural resources. Going to outlook and guidance, as mentioned earlier, we are seeing strong demand for BlackSky’s imagery and analytical insights stemming from both U.S. and international governments, and we are starting to see diversification of revenue streams as foreign customers increasingly are signing up to leverage the services that we are able to provide them. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. It’s more the type of customers and the applications that we’re seeing emerge, so--and then as I’ve outlined, obviously U.S. government through EOCL, we’re seeing demand growing from NGA, as we’ve outlined through our work in our analytics as a service to the program we outlined, and then the tactical ISR market we see as early and expanding, but by far I think we see the biggest growth coming internationally both for imagery, geospatial analytics, and sovereign ISR capability. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}