{
    "symbol": "BKSY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 11:19:18",
    "content": " In addition to winning several large new customer agreements, we continue to see strong demand for our high frequency imagery, monitoring and analytics services from existing customers, such as the National Geospatial Intelligence Agency or NGA. Imagery and software analytical services revenue grew to $13.3 million, a 161% increase over the prior year period, primarily driven by new and existing government contracts. The revenue mix for imagery and software analytical services rose to approximately 88% of total revenues, demonstrating the value customers placed in our high frequency imagery and spectra AI platform capabilities. However, as a percent of revenue, adjusted EBITDA margin has improved significantly between Q2 of this year and Q2 of last year and is moving in the right direction, driven by greater volumes of high margin imagery and software analytical services revenue. Please proceed with your question. On gross margin or cost of sales, way we're looking at it is that $35.2 million is the combination of the -- it's the mix between the margin or the cost of sales of the software and analytical support services revenue, which comprises 88% of our revenue and the engineering services revenue. If you look on the financial statements, you will see the breakdown of those two revenue and the cost of sales and we also have that on the chart where the software and analytical services revenue, our cost of sales for this year for the second quarter, I should say was only about 40%, it was about 50 -- it was about a 100% -- 40 basis points reduction from where it was last time last year. Please proceed with your question. Please proceed with your question. And then on our operating expenses, as weâ\u0080\u0099ve discussed in the remarks, our kind of period costs, as I would call them, did increase from about $8.6 million from the second quarter of last year to $15.6 million in the second quarter of this year. Please proceed with your question. Please proceed with your question. So we're seeing interest across a broad number of verticals, but I would think the platform integrations that we're demonstrating with Palantir and Esri is a first time enabling in app types of tasking and access to on-demand imagery and analytics, which we think is going to be instrumental in driving our commercial growth and our go-to-market strategy."
}