{
    "symbol": "BKSY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 14:29:06",
    "content": " First, our third quarter revenues set quarterly revenue records, driven by a first full quarter of subscription imagery revenue from our recent $1 billion 10-year EOCL contract with the National Reconnaissance Office. These awards bring our total orders received to $14 million in just the first year of the 5-year $30 million contract, demonstrating growing demand from the NGA to procure BlackSky's commercial analytics services. And finally, all of these contract wins are behind the growth in our high-margin imagery and analytics revenue, which drove strong incremental contribution margins of 89% this year, demonstrating the strong operating leverage of our space and software platforms and the validation of our business model. We're pleased with the strong results from the quarter and our performance year-to-date and are excited with the growing momentum in our business, driven by increasing customer demand for BlackSky's high revisit imagery, dynamic monitoring and advanced analytics. Third quarter revenue grew to $16.9 million, a 113% revenue growth over last year's Q3 revenues, with both of these revenue metrics reaching new records for the company. We have been servicing this government customer for some time, and now received a 1-year $10 million contract to provide on-demand high-resolution imagery services. This contract represents a fivefold increase in capacity use over the last year and demonstrates the strong global demand we're seeing for BlackSky's high frequency, dawn-to-dusk imagery and analytics. Within the past year, our international revenues have more than doubled, which can be attributed to the strong demand in the market and the growth and expansion of our international sales team as we've been successful in converting customer demand into new and expanded contracts. Imagery and software analytical services revenue grew to $15 million, a 130% increase over the prior year period, primarily driven by the greater volume of imagery delivered to new and existing customers. As shown in Slide 13, year-to-date imagery and software analytical services cost of sales was $15.1 million compared to $12.9 million in the prior year period, excluding stock-based compensation and depreciation and amortization expenses in both years."
}