{
    "symbol": "BNS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-29 12:34:03",
    "content": " The bank delivered adjusted earnings of $10.8 billion in fiscal 2022 or $8.50 per share, a healthy 8% increase over 2021 and a strong 15.6% all-bank return on equity, both exceeding our medium-term financial targets. Canadian Banking delivered earnings of $4.8 billion, a very strong 15% increase over the prior year and more notable progress against strategic initiatives in support of future growth. Our Global Banking and Markets business had a solid finish to the year in Q4, resulting in earnings of $1.9 billion for the fiscal year, down a respectable 8% year-over-year in a very challenging period of market conditions. Our International business delivered significantly improved fiscal 2022 earnings of $2.4 billion, up 37% from the prior year, a result of stronger loan volumes, expanding margins and impressive expense management, while also benefiting from a lower tax rate. Our Caribbean businesses performed well delivering earnings in the quarter of $110 million, up 42% year-over-year and has been -- the Caribbean unit is back to a more normalized level of contribution. Global Wealth Management earnings of $1.6 billion were down a modest 1% year-over-year as higher net interest income and brokerage revenues were offset by lower mutual fund fees, driven primarily by market conditions and higher volume-related expenses. The bank's earnings in 2023 are expected to benefit from higher interest income and noninterest revenue, but be impacted by higher funding costs, higher expenses, normalizing provisions for credit losses relating to the end of performing along its releases and a higher tax rate in both Canada and certain international countries. Revenues were up 4% year-over-year as an increase in net interest income of 10% more than offset a decline in noninterest revenue of 3%, mainly driven by lower Wealth Management revenues lower unrealized gains on non-trading derivatives and lower income from associated corporations. Year-over-year adjusted expenses increased by 6%, driven by higher personnel costs and performance-based compensation and spend to support business growth. Canadian Banking reported earnings of $1.2 billion, a decrease of 5% year-over-year, while pre-tax pre-provision profit grew 10% year-over-year, driven by revenue growth of 11%. Net interest income increased 13%, as loan and deposit growth continued, while the net interest margin declined 3 basis points since Q3 as lower spreads, in particular the prime CDOR compression, the lag on fixed rate asset repricing and lower mortgage prepayments were partially offset by higher deposit spreads. Noninterest income increased by 3%, due primarily to higher banking revenue and foreign exchange fees, partially offset by lower mutual funds distribution fees. Expenses increased 12% year-over-year, driven by higher technology and personnel costs to support business growth. Revenue declined 4% due primarily to lower fee income driven by lower assets under management and iTRADE volumes, partially offset by higher interest income driven by strong loan growth and improved margins. Global Banking and Markets generated earnings of $484 million, down 4% compared to the prior year, but up 28% compared to the prior quarter. GBM and Latin America, which is reported as part of International Banking, reported record earnings of $232 million, up 29% year-over-year with particularly strong results from Chile and Brazil. Revenue was up 8% year-over-year, driven by higher net interest margin, strong Capital Markets and Banking fees and partially offset by lower gains in investment securities. Noninterest expenses increased 7% year-over-year, driven by business growth and inflationary impacts, partially offset by the benefit from efficiency initiatives executed last year."
}