{
    "symbol": "BNS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-01 11:29:05",
    "content": " The bank reported another strong quarter with earnings of $2.7 billion and diluted earnings per share of $2.15, an increase of 14% year-over-year and 2% quarter-over-quarter. Net interest income was also up 3% compared to last quarter, driven by strong loan growth across all the business lines. Quarter-over-quarter noninterest income was up a strong 7% driven by higher trading revenues, banking and wealth management fees and underwriting and advisory fees. Net interest income growth was driven by a strong year-over-year loan growth of 12%, including 15% growth in mortgages and 16% growth in business loans and acceptances. Earnings of $419 million were up 13%, excluding the seasonally elevated performance fees in the prior year and up a strong 7% quarter-over-quarter. Canadian Wealth Management earnings grew 14%, excluding the mentioned performance fees, driven by higher investment fund fees from AUM growth, double-digit balance sheet growth in private banking and strong fee-based asset growth. Revenue grew 6% quarter-over-quarter underpinned by higher investment fees, net interest income growth and higher fee-based revenues. Global Banking and Markets generated earnings of $561 million this quarter, up 3% year-over-year and a strong 12% quarter-over-quarter. Revenue increased 19% quarter-over-quarter and 5% year-over-year, driven by strong performance across most of GBM's business lines. GBM LatAm, which is reported as part of International Banking, had a record quarter with $200 million of earnings, an increase of 15% from last year and 11% over the prior quarter. International Banking reported net income of $552 million, up 50% over Q1 last year and 5% quarter-over-quarter. Net interest margin improved 7 basis points from the prior quarter to 3.76% driven by spread increases, offset slightly by business mix changes. Noninterest revenue was up 4% year-over-year and 5% over the prior quarter, mainly driven by strong capital markets results, banking and card fees across the Pacific Alliance and the Caribbean. Yes, it's really good to see Peru and Colombia recovering, had a strong recovery in the quarter, it is coming on the back of very strong GDP growth, over 10% in 2021 in both countries, and we are seeing that reflected in strong loan growth of 3% in Peru, 5% in Colombia, margin expansion. And what I'm very pleased is to see the overall performance of all geographies in International Banking this quarter because strong loan growth was 3% for the second consecutive quarter, which saw revenue acceleration of 5% Q-over-Q both in net interest income and net interest revenue NIM expansion, as you have lighted of 7 bps this quarter and strong PTPP growth in all geographies, improved credit quality and a positive operating leverage. We are seeing a very positive growth in the quarter in International Banking, very strong growth, 5% in mortgages, 2% in commercial."
}