{
    "symbol": "BNS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-25 11:23:11",
    "content": " Continued loan growth of 13% and improving net interest margin, strong customer balance sheets, combined with prudent expense management positions the bank very well to grow its earnings. Digital continues to drive customer experience and efficiencies across our international footprint with adoption reaching 55%, driven by a strong 20% growth in mobile banking users. Global Banking end markets experienced double-digit loan growth in the quarter as clients access capital to grow their businesses, financing larger inventories in face of supply chain challenges and strategically investing in nearshoring plant and equipment. The bank reported another strong quarter with earnings of $2.8 billion and diluted EPS of $2.18, an increase in EPS of 15% year-over-year. Net interest income was up 7% year-over-year and up 3% compared to the prior quarter, once again driven by strong loan growth. Year-over-year non-interest income was down 3% due to lower investment gains, trading revenues and underwriting and advisory fees, while banking and wealth management revenues grew a strong 7%. Year-over-year adjusted expenses were up a modest 3%, driven by higher personnel and share-based compensation, professional fees, advertising and technology-related costs to support business growth. The bank reported a common equity Tier 1 ratio of 11.6%, down from 12% last quarter, primarily related to strong organic growth and repurchase of shares. Pretax pre-provision earnings grew 13% year-over-year, driven by strong revenue growth. Net interest income growth of 11% was driven by another strong quarter of loan growth, up 14% year-over-year, including 16% growth in mortgages and 19% growth in business loans. The strong noninterest income year-over-year increase of 10% was driven by higher banking revenue, foreign exchange and mutual fund distribution fees. Expenses increased 8% year-over-year, driven by higher technology, personnel and advertising costs to support business growth. Revenue was in line with the prior year, with strong growth in business banking, driven by continued loan growth, while capital markets were down, reflecting challenging market conditions. GBM Latin America, which is reported as part of International Banking had another strong quarter with $185 million of earnings, up 9% year-over-year reflecting strong top line revenue growth of 13%. International Banking reported net income of $613 million, up 49% year-over-year and 10% quarter-over-quarter. Quarter-over-quarter net interest margin increased a healthy 10 basis points to 386 basis points, driven by changes in business mix and the positive impact of higher Central Bank lines. Strong loan growth, robust lending pipeline and expected growth in net interest margin, positions the business lines for higher net interest income in future quarters. Our key portfolios across our footprint are stronger than ever highlighted by the follow; Canadian consumer balance sheets have significantly improved, average customer loan balances have fallen by 3% since the start of the pandemic, while customer deposits and investable assets have grown by 13% over the same period. So, we will be unlikely at the 16% next quarter, but we do expect to see quarter-over-quarter Q3 and Q4 perhaps at the high single-digits loan growth rates versus prior quarter -- versus the prior year."
}