{
    "symbol": "JNPR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 22:06:05",
    "content": " We grew our Cloud business by more than 13% year-over-year, and we grew our Service Provider business by approximately 3% year-over-year with the revenue growth for each of these verticals, exceeding the high end of our long-term model. While revenue growth was healthy in Q4 and for the full year of 2022, as we expected, overall demand moderated in the December quarter, with total orders declining more than 20% year-over-year. While these investments have enabled us to accelerate our growth over the last several years, particularly in the enterprise vertical, they are also continuing to provide tailwinds with deal registration from the channel growing 18% year-over-year and order momentum in the commercial market growing 43% year-over-year in the Q4 time frame. While these efforts remain in the early innings, we experienced encouraging momentum in the Q4 time frame, which saw total software and related services revenue grew 26% year-over-year and accounts for 21% of our total sales. Based on our current backlog, customer demand and our assumptions regarding supply, we currently expect to deliver at least 8% revenue growth and at least a point of non-GAAP operating margin expansion in 2023. From a customer solutions perspective, AI-driven enterprise revenue increased 24% and Cloud-ready data center revenue grew 21% and automated WAN solutions revenue grew 12% on a full year basis. Given the ongoing customer demand for product, solid exiting backlog and improved supply, we're updating our revenue growth expectations for 2023 from at least 7% to at least 8%. We actually saw flattish type order momentum on a year-over-year basis in Q4, but that was off of a very difficult compare in the Enterprise segment, where a year ago period in Q4, this would be in '21, orders grew over 40% year-over-year. So looking forward to your question, I do think there will be for the next at least couple of quarters, a re-normalization of order patterns for Service Providers and Cloud providers as they consume orders that were placed a year ago period and in the Enterprise, I actually think that order momentum will continue. And so if you think about your order growth pattern over the last couple of years, it's been incredibly strong, but your backlog exiting 2020 was roughly about $400 million, and your business is about 20% bigger today. The only thing I would add is we've had a lot of momentum in Enterprise for the last several years, and we actually expect 2023 to be a growth year for Enterprise, both from a bookings, order perspective as well as a revenue perspective and I know we aren't naive to some of the macro conditions out there."
}