{
    "symbol": "MANH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 22:47:04",
    "content": " Manhattan delivered a record Q2 and record first half results generating Q2 total revenue of $192 million and adjusted earnings per share of $0.69, both exceeding our expectations. Specifically, 48% growth in cloud revenue and 19% growth in services revenue drove a topline outperformance and strong earnings leverage in the quarter. Now, despite FX headwinds in Q2, RPO, the leading indicator of our growth, increased 84% to $898 million. Excluding the FX impact due to the strong dollar, RPO totaled $928 million, up 90%. And while the mix of bookings will certainly vary on a quarterly basis, we believe that net new customers generating about 55% of our cloud bookings in the first half of the year exemplifies the unique value that we're delivering to the market and a large and growing opportunity. Q2 cloud revenue totaled $42 million, up 48%. As Eddie mentioned, excluding approximately $30 million in first half FX headwinds, RPO totaled $928 million up 90%. Q2 services revenue knocked it out of the park passing the century mark, recording $101 million up 19%, as cloud sales continue to fuel services revenue growth globally. Our Q2 operating profit totaled $53 million, with adjusted operating margin of 27.5%. As we discussed last quarter, our Q2 cash flow absorbed $13 million of incremental cash tax associated with the US Tax Cuts and Jobs Act, that did not impact us a year ago -- in the year-ago period. We are raising our total revenue range to $733 million to $741 million, with a $737 million midpoint, representing 11% growth as reported and 14% growth removing FX impacts. For Q3, we expect total revenue of $183 million to $187 million with $185 million midpoint, delivering 9% growth year-over-year. Further drilling down on revenue for the full year 2022, we are increasing our cloud revenue range to $170 million to $172 million, representing 40% growth at the midpoint. At the midpoint, this represents 15% growth and on a quarterly basis represents Q3 services revenue of $101 million and for Q4, $93 million accounting for traditional retail peak seasonality. We expect license revenue to be about 2.5% of total revenue, averaging about $3 million in license revenue per quarter for the remainder of the year."
}