{
    "symbol": "CGRN",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-11 22:49:11",
    "content": " Total revenue for the quarter was $16.1 million up 13% compared to $14.2 million in the first quarter last year, as orders and shipments have gradually started to rebound by continued negative impacts from the ongoing COVID-19 pandemic. Second is our new parts supplier, this is simply about better building part quality to improving reliability, lower warranty which I think you've seen in the quarter, higher FPP margins, which we'll see going forward, and simply put, getting repeat more customers. Turning to Slide 10, you'll see the financial results for the first quarter of fiscal 2022, which had revenue at $16.1 million up 13% compared to $14.2 million in the first quarter of fiscal 2021, as the prior year quarter was more heavily impacted by COVID-19 project delays. Our parts and service revenue which includes our FPP long-term service contracts, rentals, distributor support subscription fee was $7.7 million, up 1% from $7.6 million in the first quarter of fiscal 2021. So to get to 30% is challenging to get to 100% is a lot more challenging, I think, as everyone knows, but what we're trying to do is minimize the impact on our hardware and software, as well as enable our customers to be able to achieve 30% hydrogen without making any significant investments. And so I think I'm excited for the next few years and look like we spent a lot of our last 10-years trying to educate customers on energy efficiency, and the benefits of green energy and carbon reduction, now that I feel like the market is coming to us, and that customers truly have a problem they need to solve, and that the Board of Directors are putting out hardware reduction goals that they and the management and what we’ll have to execute against. But I think as we bring the direct sales organization online, and you start seeing the top-line growth that they're going to generate, and additional business they're going to generate, our distributors rebound from COVID and get back up to more normal product sales levels, that's going to be exciting for us."
}