{
    "symbol": "BDSX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 13:28:06",
    "content": " In our last call in May, we were excited to share that towards the end of the first quarter, we were experiencing strong sales growth in our core lung diagnostic testing, driven in part by sales access returning to pre-pandemic levels. We finished Q2 with total revenue of $11 million, which includes core long diagnostic testing revenue of $7.3 million, reflecting a very strong 52% year-over-year growth and 56% growth over the first quarter of this year. Stepping back for a moment, we believe we have one of the most comprehensive suites of diagnostic test with 5 blood-based tests available to support clinical decision-making across the lung cancer continuum from initial risk assessment of lung nodules with Nodify lung testing strategy to post-cancer diagnosis treatment guidance and monitoring with the IQ lung testing strategy. Overall, as physicians gain more experience with our Nodify lung testing strategy, we continue to receive positive feedback reflected in increased adoption, which we believe demonstrates the clinical relevance and utility of these tests, and validates that we are only beginning to realize the full potential for Nodify lung to change the standard of care in lung nodule risk assessment. With a comprehensive suite of tests, all with Medicare reimbursement and the ability to offer diagnostic solutions across the continuum of care, we believe weâ\u0080\u0099ve just begun to scratch the surface of this $29 billion market opportunity and that we have both the team and the products to drive growth in 2022 and beyond. Overall, total revenue was $11.0 million compared to $11.9 million for the second quarter of 2021 and represented an increase in revenue from our 5 core lung diagnostic tests and offset by an expected decrease in COVID testing as testing moved more towards at-home rapid antigen testing. Our second quarter core lung diagnostic testing revenue was $7.3 million from total volumes of approximately 5,600 tests versus $4.8 million from total volumes of approximately 4,000 tests for the second quarter of 2021. COVID testing revenue was $3.0 million in the second quarter of 2022 versus $6.1 million in the year ago quarter, an anticipated decrease, which we discussed in our May earnings call. We expect the overall gross margin as a percentage to remain approximately in the mid-60s, perhaps with a small increase over the course of the year as a result of several factors, including the decline in COVID testing revenue expectation, which has a lower margin than lung diagnostics, plus the benefit of Medicare coverage for Nodify CDT tests and the expanding scale of our GeneStrat NGS test. And turning to our overall liquidity, we ended the quarter with $28.7 million in cash and cash equivalents, inclusive of $5.1 million in restricted cash, an increase from prior quarter, primarily due to the net proceeds of $14.5 million from our private placement and at-the-market offerings and net proceeds of $12.8 million from the securities purchase agreement entered into  Capital LLC, partially offset by a partial repayment of our SBB 2021 term loan and Indi milestone payment of $3.0 million and $2.0 million, respectively."
}