{
    "symbol": "BDSX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 10:09:03",
    "content": " We announced several important reimbursement milestones, including Medicare coverage for our Nodify CDT lung nodule test and the signing of a Federal Supply Schedule Contract that expands coverage on all five of our tests to the approximately 9 million veterans in the U.S. Department of Veterans Affairs and Military Health System Medical Centers. Full-year 2022 total revenue was 38.2 million, a decrease of 30%, driven primarily by the expected decline in COVID testing offset by growth in our core lung diagnostic testing. Core lung diagnostic revenue in the fourth quarter was 8.2 million, compared to 5.4 million for the fourth quarter of 2021, an increase of 51%, and a decrease of 10% over the third quarter 2022. Third quarter 2022 included 1.5 million in cash revenue from tests performed in prior periods, largely as a result of the positive coverage decision by Medicare for Nodify CDT. Looking into 2023, we expect the overall gross margin percentage to continue to increase as a result of several factors, including the benefit of the Medicare coverage for Nodify CDT tests, the benefit of recently announced commercial payer coverage decisions for Nodify XL2, as well as additional commercial coverage as we move through the year, and the operational efficiencies resulting from the growth of our GeneStrat NGS test, which was fully launched in 2022. Our guidance assumes strong year-over-year growth in our core lung diagnostic testing business, driven by improved contribution from our larger commercial organization, broader reimbursement of our five on-market tests and expected increased utilization of all of our tests by physicians, as well as modest expected growth in our biopharmaceutical services business. In so doing: One, we've established an exceptionally strong double-digit growth trajectory post-pandemic, driven by our lung focused sales team; Two, we're expanding reimbursement on our on-market test with multiple coverage decisions from Medicare and private payers that we anticipate will contribute to our 2023 growth. Supporting this effort, we continue to successfully expand the growing body of clinical data to support the clinical utility of all five of our core lung diagnostic tests; Three, we've established strong gross margins, which continue to improve with the scaling of our core lung diagnostic testing and reimbursement; And four, we exited the year with a strong balance sheet to support our focus on near-term revenue drivers with a cost disciplined approach."
}