{
    "symbol": "BDSX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 11:48:04",
    "content": " The forward-looking statements discussed on this call are subject to other risks and uncertainties, including those discussed in the Risk Factors section and elsewhere in the company's annual report on Form 10-K for the year ending December 31, 2021, filed with the Securities and Exchange Commission on March 14, 2022, as well as in subsequent quarterly reports on Form 10-Q filed during 2022, if applicable. Beginning with our financial performance, we reported total revenue of $6.5 million and core lung diagnostic testing revenue of $4.6 million, which reflects 17% year-over-year growth. Like many of our peers, performance in the first half of the quarter was affected by the COVID-19 Omicron variant, which significantly impacted the month of January and February with practitioners, patients and many of our Biodesix team members getting COVID and staying home to recover, which resulted in an overall revenue decrease versus fourth quarter 2021. We saw sales access and activities rebound to pre-pandemic levels and April continued this trend with a higher number of core lung diagnostic tests per business day than March, giving us continued confidence in our current 2022 revenue guidance of $37.5 million to $39.5 million. We believe our commercial team is critical to continued growth and as such, in line with plans, we've added another 5 sales team members in the first quarter of 2022 to increase our coverage in promoting and selling the complete portfolio of core lung diagnostic test. First quarter total revenue of $6.5 million was in line with our expectations and compared to $28.9 million for the first quarter of 2021, represented an increase in revenue from our 5 core lung diagnostic tests and offset by an expected decrease driven entirely by the year-over-year change in COVID testing. Our first quarter core long diagnostic testing revenue was $4.6 million from total volumes of 4,300 tests versus $4.0 million from total volumes of 3,100 tests for the first quarter 2021. One patient, one trusted company, multiple test personalized results; three, discover and develop new diagnostic tests like a risk of recurrence and primary immune response test; four, lead the way with AI explainability and transparency; five, conduct numerous clinical studies to demonstrate and reinforce the real-world performance of our test; and six, grow and expand our biopharmaceutical partnerships to aid in their research, drug development, clinical trials and development of companion diagnostics. We -- as for second quarter and looking at gross margin, I would expect us to get close to that, but would anticipate, as we're continuing to ramp NGS, it will take us a little bit to ramp up to that number, but we are making great progress on -- with our NGS test and that growth."
}