{
    "symbol": "AVDX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 04:12:02",
    "content": " Joe Wilhite and I are excited to discuss AvidXchange's second quarter 2022 results and the continued momentum we are experiencing across our business, driven by our middle market focus in the four growth years of our AvidXchange business flywheel that drives our business. We experienced strong revenue performance of over $76 million which was up over 30% over the same period last year, coupled with increased operational efficiencies, as evidenced by our higher non-GAAP gross margin approaching 64% which led to a lower adjusted EBITDA loss of just $4.7 million in the quarter. And this quarter, we're happy to report that KRI, a multistate, multi-location, full-service real estate company based out of Ohio, that uses ResMan's property management software and was exploring accounts payable automation and payment solutions has selected AvidXchange over a competitor's offering as a result of the company's trusted relationship with our business. Taken together with our solid balance sheet and a large total addressable market exceeding $40 billion just in the U.S. alone, we are excited about our outlook as we exit the year and are well positioned to sustain our operating momentum given the pace of innovation across our platform and the strength of our product suite, as evidenced by the four years of our AvidXchange business flywheel. As a reminder, both FastPay and PayClearly are media advertising books of business but are disproportionately weighted toward both the midterm and presidential election cycles in the U.S. Our strong revenue growth also resulted in total transaction yield expanding to $4.42 in the quarter, up 15.1% from $3.84 in Q2 2021. Non-GAAP gross margin increased 270 basis points to 63.7% in Q2 of '22 over the same period last year, driven by a combination of increased total transaction yield in the quarter, continued operational efficiencies and the contribution of previously discussed acquisitions. On a GAAP basis, total operating expenses were $68.8 million, an increase of 33.4% in Q2 of '22 over Q2 of last year, driven by headcount additions to support our growth initiatives, increased expenses and our transition to become a public company and the recognition of noncash stock-based compensation costs. Non-GAAP sales and marketing costs increased by $4.7 million to $19.1 million in Q2 of 2022 over Q2 of last year, with the increase driven by the continued investment in our direct and channel strategies to acquire new buyers and suppliers as well as the consolidation of FastPay and PayClearly results. In light of Mike's cautiously optimistic commentary about the opportunities and initiatives we continue to see and execute across our business, we now expect total revenue for the year to be above what we previously provided and in a range of $308 million to $310 million. To pick up on what Joel said is I'd say, there's certainly a renewed mindset that we're having in the current environment related to just raising the bar related to our ROI and every investment that we're making, being laser-focused on those initiatives that matter in terms of our growth levers for the future and as well as on the people side to make sure we're prioritizing those important people to drive our business. So what I would say, I think there was historically kind of a pool of customers who really wanted to work with AvidXchange because of our payment network and payment monetization capabilities and certainly like the aspect of the payment network along with our AP automation feature set but they had a purchase order procurement requirement, of which we didn't have or we didn't have one that met their needs."
}