{
    "symbol": "AVDX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 12:06:03",
    "content": " We also kicked off key new product initiatives related to our next-generation Pay platform and Invoice Accelerator 2.0 offerings, which we believe will drive meaningful revenue growth in future years as well as address a growing demand from our small business suppliers to have access to cash flow management and supplier financing tools to better manage their cash flow and run their businesses. One of the key metrics that we focus on across our leadership team and that I believe is a good barometer of the strength of our business and demonstrates the power of our AvidXchange flywheel business model and the impact of our true two-sided AvidPay network is our transaction yield metric, which we've increased incrementally every quarter for the last two years from $3.52 to $4.51 per transaction. On today's call, I'd like to cover three topic areas which include; number one, our perspectives on our fourth quarter results; number two, review of our year end AvidXchange business flywheel metrics and our key initiatives for this calendar year; and number three, along with insights and trends we are seeing related to the macro impacts to our business and our middle market customers. Finally, macro uncertainty can also play to our competitive strength, as middle market customers gravitate even more towards proven market-leading, differentiated and well-capitalized providers, such as AvidXchange, thus bolstering and even accelerating our overall market-leading position across the middle market -- impact to both our buyer and supplier customers in 2023 along with reaching our profitability objectives for the year. Non-GAAP general and administrative costs increased by $1.9 million to $19.2 million in Q4 of 2022 over Q4 of last year, driven by a combination of higher expenses, as we transitioned to a public company and an increase in performance-based bonus accruals due to continued strong operating and financial results. Our GAAP net loss was $25 million for the quarter versus a GAAP net loss of $72.1 million in the prior year period, driven by the impact of IPO transaction expenses, a mark-to-market adjustment for convertible common stock liability upon our IPO, termination fees related to facilities development agreement and the recognition of non-cash stock-based compensation costs resulting from completing our IPO in Q4 2021. On a non-GAAP basis, our net loss in the fourth quarter of 2022 was $7.4 million, an improvement of $10.3 million compared to the year ago quarter on solid organic revenue growth as well as interest revenues combined with expense leverage. In light of Mike's commentary about the opportunities and initiatives we continue to execute across our business balanced with the macro crosscurrents and the potential for further volume impacts based on all information currently available, we expect total revenue for the year to be in the range of $359 million to $366 million."
}