{
    "symbol": "AVDX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 11:12:01",
    "content": " You may now go ahead. You may now go ahead. You may now go ahead. As it relates to kind of the performance of our â\u0080\u0093 across our eight verticals, first of all, the beauty of our business today is that we're super diversified across eight different verticals, plus we have the horizontal slice that's driven by some of our channel partners. You may now go ahead. You may now go ahead. Maybe in my last commentary, I kind of focused on some of the verticals and one of maybe, one other aspect of it is in our horizontal business that was another area that we saw some outperformance based on our internal expectations in the quarter and really driven by some of our bigger channel partners like the NetSuite, Acumaticaâ\u0080\u0099s of the world and others. So, those are some of the things that we're taking a look at and it's going to be interesting to see where some of those, kind of natural customer adds come from, but we expect certainly it's probably going to be driven by the horizontal market first, and then followed up by perhaps pursuing new vertical markets based on our customer trends that we're seeing. You may now go ahead. I think our team is, obviously we're still in the kind of the early days of ramping and going to market within that partnership, but I think it's very similar to some of the other verticals that we've seen with partners with similar customer sizes. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. As it relates to, I think your second half of your question related to, kind of across our eight verticals as theyâ\u0080\u0099re kind of waiting across some of those verticals, I would say that overall it's extremely diversified across our eight verticals plus the horizontal part of the market and the horizontal is actually one piece that's exceeding our expectations as well. You may now go ahead."
}