{
    "symbol": "NRZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 11:44:09",
    "content": " Financial results for the quarter, GAAP net income $661.9 million or $1.37 per diluted share; core earnings $177.4 million or $0.37 per diluted share; book value, $12.56 per common share; first quarter common stock dividend, $0.25; cash and liquidity, $1.7 billion; net equity, $7.1 billion. Our growth strategy also includes a focus in alignment with the FHFA, affordable housing targets and expansion in our local footprint, continued growth of our non-QM program throughout all channels, growth of our product set; and Michael talked about this in our partnership with Genesis Capital through fix-and-flip renovation and construction of firm, which will help our LOs referral partners succeed in their respective markets; and expansion of our ancillary and title businesses within our own platform and also adding a new third-party accounts. On Slide 21, the Servicing division ended the first quarter with approximately $762 million in pretax income, predominantly driven by the mark-to-market gain, and as Michael previously talked about, the size of our MSR portfolio, but our servicing platform will remain positioned to benefit from higher interest rates and lower amortization. If you go back a couple of years ago, if we deployed $1 billion of that $1.7 billion and just think about it this way, if we deployed that, let’s call it a, even use a 12% levered return, that would be an extra $120 million a year in earnings. I would like to see us become a real full-scale financial services company, roll out other types of products to our customers, which I think could offset the decline you’re going to see in gains in the origination business. If you think about it, if you put a hedge, if you get long an instrument against that and the 10-year goes to 4%, the Fed funds go to – I’m looking at some charts this morning, Fed funds – one of our economists see short this morning that shows Fed – their projection is that Fed funds rate goes to north of 4% in 2024. So, when we look at the volatility that we saw in the first quarter, and that’s why we called, I think $80 million in loans, when we think about volatility, we want to ensure that all of our financing is extremely buttoned up that if there is no capital markets, how do we protect our balance sheet. And how does that compare to, for example, when Charles Sorrentino  is looking at the broader NRZ investment universe, how does that compare to him deploying capital, for example, in a AAA security on a levered basis, that’s going to be 15?” So, it all depends on – and again, it goes back to the capital allocation thing, or is there an operating business that may be in the commercial real estate side or on the consumer side that we think we are going to generate 20%-plus outsized returns."
}