{
    "symbol": "OEG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 10:26:08",
    "content": " Most importantly, OEG achieved positive adjusted EBITDA, a non-GAAP measure of $3.8 million in the first quarter of 2022. Our Electric Power segment delivered a 70% increase in revenues in the first quarter of 2022, compared to the fourth quarter of last year. We are reconfirming our revenue and EBITDA guidance for the full year of 2022, which is a revenue range of $375 million to $425 million and an adjusted EBITDA range of $38 million to $43 million. Loss from continuing operations, net of income taxes was $36.7 million with an adjusted EBITDA of $3.8 million, which is a significant milestone as this is the first time since the company's transition to an infrastructure services provider and adjusted EBITDA has been positive and it is a significant indicator that we are successfully executing on our infrastructure strategy as we move toward profitability. In the first quarter of 2022, our consolidated revenues and adjusted EBITDA increased 71.5% and 425.3%, respectively, as compared sequentially to the fourth quarter of 2021. In the first quarter of 2022 the Electric Power segment increased revenue 70% to $39.7 million, compared to the fourth quarter of 2021. However, 12-month backlog increased 7.5% to $294.6 million in the fourth quarter of 2021, which we believe is an indicator of the robust business environment we are operating in today as total backlog can fluctuate due to the timing of multi-year master service agreement revenue burn versus contract renewals. This reflects year-over-year revenue growth of 3%, and an improvement of $67.5 million in adjusted EBITDA for the full year 2022, compared to 2021 for the midpoint of our guidance. As it relates to the Electric Power segment, we believe 2022 revenues will range between $115 million and $130 million with adjusted EBITDA margins to be in excess of 20%. Finally, in our Renewable segment, for the full year of 2022, we anticipate revenues in the range of $200 million to $225 million, with adjusted EBITDA margins for this segment in the mid-single digit."
}