{
    "symbol": "VEL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 13:21:05",
    "content": " In terms of loan production, we had our best quarter ever and generated a volume increase of approximately 150% in new originations over the prior year's quarter. The tremendous year-over-year growth in our portfolio led to a 43% increase in portfolio related net interest income versus Q1 2021, which in turn drove an impressive 14% ROE on a core earnings basis for the quarter. And in terms of applications, we saw $338 million in applications and that's right in line with the average level of applications that we've seen year-to-date, so really no impact on volume as we took rates up. In terms of core net income, we break out the costs here associated with the refinance of that corporate debt, and you can see on a core basis, $12.4 million of income for the quarter, so very strong, in terms of book value, up slightly from $10.84 to $10.90. It's a little bit over 8% and still sold $300 million of new applications coming in, in April, and that's pretty much what we average on a monthly basis, like $320 million, $330 million in the first quarter. You'd see at $2.9 billion was our total loan portfolio at the end of the first quarter, a little over 11% increase where we were at year-end. And then as Chris mentioned, as we see the interest rates starting to go back up again, starting at the end of March and into April, we've raised our coupons to kind of offset any increase that might come in on the securitization market to again maintain that spread and we've seen the consistent volumes still coming in the door. The rising interest rate environment, just wanted to show that our HFI, our loan portfolio, as you can see at the end of the quarter, of 70% of our loan portfolio is fully fixed rate loans. And you can see from December of 2020 now to end of the first quarter, we're down to 9.8%, back in line to kind of with – our normal run rate between, say, like 7% to 9%. So all in all, in terms of P&L, we're picking up about 2.25% on a go-forward basis over the next five years with no interest rate risk anymore since it's fully fixed rate."
}