{
    "symbol": "VEL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 21:57:05",
    "content": " In terms of the production and loan portfolio, you can see that we dramatically reduced originations by 44% from Q3 -- sorry, from fourth quarter of '21 and that was intentionally done, obviously, due to the conditions as I mentioned earlier in the securitization market. We have been presenting the economic value kind of embedded in our securitized loan portfolio, through the economic equity slide that Chris just went through previously, but it's not really reflected within the financial statements, because it comes in over time, as you know, as net interest margin over time. The fair value of the loan, the loans at amortized cost you see go on the books as UPB, now the underline at fair value, and that fair value -- the difference in fair value and the UPB will be in the other income section as unrealized gain or loss in the fair value loans. If we continue just to originate the loans, the new loans at fair value, and the existing amortized cost portfolio as of September 30, 2022 continues to pay down and pay off over around a four year timeframe. As Chris mentioned, we strategically decided to reduce and put the brakes a little bit, tighten up the credit on our loan production in Q4, because of the volatility that we saw on the securitization market and we wanted to wait till the 1st of the year and see if that securitization market comes back, which again, we did a securitization in January, the execution of security was better than the one we had done, say in October Q4, those are very smart decision to kind of pull back on that production. So the Q4 resolutions were low, you can see we resolved $25 million in total both long-term and short-term loans on our UPB compared to say, fourth quarter of $44 million, to give you an idea of the lower volume. And keep in mind on the loan loss reserve, a slight tick down, because just you had less loans, a smaller portfolio at the end of the year that we're subject to CECL because the fair value option loans that we put on in Q4, because they are at fair value, they are not subject to a loan loss CECL reserve."
}