{
    "symbol": "VEL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 01:07:05",
    "content": "  Operator: Good afternoon, and welcome to the Velocity Financial, Inc. Third Quarter 2022 Conference Call. Hello, everyone, and thank you for joining us today for the discussion of Velocity Financialâ\u0080\u0099s third quarter 2022 results. Iâ\u0080\u0099d like to remind everybody that todayâ\u0080\u0099s call may include forward-looking statements, which are uncertain and outside of the companyâ\u0080\u0099s control and actual results may differ materially. From a production perspective, as I mentioned, 34% increase over the prior yearâ\u0080\u0099s quarter, very healthy levels into a rising rate environment. From a non-performing loan perspective, you can see prior year, weâ\u0080\u0099ve had a nice improvement in the trend there and feel like weâ\u0080\u0099re stabilizing and settling into a more historical level of where we typically see NPLs. As Chris mentioned, we had a very good third quarter, a little over $457 million in UPB originations during the quarter, very consistent with second quarter of $445 million. The main positive takeaway is the WAC on our third quarter production was 8.89%, which was 114 basis points higher than the 7.75% WAC on our second quarter production. So weâ\u0080\u0099ve been very aggressive in raising our loan rates, kind of consistent with the Fed and with the bond market, trying to stay on top of that. On Page 6, for loan portfolio, again, adding the $445 million in UPB growth in the portfolio, we ended the quarter at a little over $3.4 billion. In terms of our loan portfolio, itâ\u0080\u0099s an 11% increase from the second quarter. Our weighted average WAC on the portfolio at the end of September was 7.71% on the entire $3.4 billion, and thatâ\u0080\u0099s up 18 basis points from the 7.53% WAC as of June 30. Again, the portfolio is starting to reflect that increase in loan rates that weâ\u0080\u0099ve been doing in second quarter and third quarter. And also consistent, at the bottom of the slide, you can see in the second and third quarter, weâ\u0080\u0099re still putting the volume on. Weâ\u0080\u0099re increasing the WACs, but weâ\u0080\u0099re keeping that loan-to-value ratio very consistent, right around 68%. At the end of the quarter, 20% of our portfolio was adjustable rate product. And weâ\u0080\u0099ve already seen those rates starting to adjust, weâ\u0080\u0099ll kind of talk about that. The weighted average coupon on new production on the ARMs was 7.75%, we had said â\u0080\u0093 I mean, on all productions. And in October, the weighted average coupon on our new production just in the month of October was 9.80%. And as the bond market adjusts, weâ\u0080\u0099re going to adjust accordingly to kind of stay consistent with the bond market. Chris mentioned, almost a 6% gain for resolutions in the third quarter. The nonperforming loan rates, you see itâ\u0080\u0099s come down now to 7.4%. And if you compare it year-over-year back to third quarter of last year, itâ\u0080\u0099s about a 42% decrease in our nonperforming rate. Weâ\u0080\u0099ve always said that we feel very comfortable anywhere between a 6% to, say, an 8% nonperforming range. And because of the strong resolutions, again, 90%, 95-plus-percent of all of our NPLs resolved with that 4 or 5 point gain that we feel very comfortable within a 6% to 8% NPL rate. So we think the 7.4% at the end of Q3, thatâ\u0080\u0099s probably going to start to stabilize. Itâ\u0080\u0099s in our normal kind of comfort band, and we kind of think thatâ\u0080\u0099s where itâ\u0080\u0099s going to stick around to. We ended the quarter at $5.3 million, and thatâ\u0080\u0099s compared to $4.9 million for Q2. Itâ\u0080\u0099s about a $400,000 increase in reserve, and thatâ\u0080\u0099s just mainly because of the portfolio growth. You can see in the lower-left chart, weâ\u0080\u0099re very consistent in terms of our bps, our basis points of reserve on our total HFI portfolio. And if you look at the last five quarters, our average dollar charge-offs per quarter have been $165,000 a quarter. In terms of overall funding and liquidity, see we had $3.2 billion on outstanding debt balances at the end of the quarter. And you kind of see the composition, the majority of that, of course, being the securitizations at just under $2.7 billion. It doesnâ\u0080\u0099t include any future earnings or future cash flows from new production, itâ\u0080\u0099s just what is on the balance sheet as of the end of the quarter and an additional premium for the platform value. Weâ\u0080\u0099re hopeful to see some stability and some clarity out of the Fed, maybe by the first quarter of next year, I donâ\u0080\u0099t know. You mentioned, I think, a 6% to 8% range. Iâ\u0080\u0099m sure Mark and every â\u0080\u0093 the teamâ\u0080\u0099s going to be working hard for every deal and every dollar, but it sounds like youâ\u0080\u0099re kind of where you think youâ\u0080\u0099ll be for the long run. Thatâ\u0080\u0099s where we kind of â\u0080\u0093 weâ\u0080\u0099ve always, historically, if you go back over 18 years, kind of been in that 6% to 8% range. And so I think now we feel confident that, thatâ\u0080\u0099s going to be somewhere and kind of stabilizing here. And it was funny, I was â\u0080\u0093 you mentioned COVID, thatâ\u0080\u0099s a great point because weâ\u0080\u0099re looking back to where kind of loan yields were early 2021. And itâ\u0080\u0099s easy to forget kind of where we were and then a lot of stimulus from the government, from the Fed, zero rates, putting in money, that we actually have come down despite the recent move in the bonds when we look back more like 12 to 18 months. And I guess there could be given your originations, but it almost sounds like with your warehouse lines that youâ\u0080\u0099ve got, you feel pretty good about those. So a lot of our bankers have told us that folks are wrapping up year-end and probably better just to wait until next quarter, which we have absolutely plenty of ability to do."
}