{
    "symbol": "SAH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 06:06:05",
    "content": " I'm just curious, particularly around EchoPark, how you think about this macro backdrop of what's going on in the used car market, where it's, it seems like it's going to be shrinking in supply for a number of years to come because we just sold few new vehicles, but it might be challenging to grow in absolute terms, and you're really going to have to go after market share pretty heavily there, just curious how you think about maybe tapping the brakes, a little bit on EchoPark growth or maybe not and this might be a great opportunity to go after some competitors that might be flailing and don't have the capital resources that you do? So these prices are going to drop, I think that by the middle of next year we'll be buying in the auction lanes, maybe in the 23,000 to 24,000 range and that's where the average monthly payment gets back down to where it was pre-COVID somewhere in that 450 range, last quarter, we - on average customer paid $630 with warranties and everything wrapped in, it's still too close to the new car payment. But we're cautiously optimistic, we're going to manage our capital properly and will tap the brakes here for a couple of quarters, not open any stores, and let's see what happens in the back half of next year, which will also include our thoughts on spending our branding - starting our branding campaign and really driving EchoPark. I think we did show that one of the big buckets is returning capital to shareholders, increased the dividend by 12%, and of course, as you mentioned the share repurchase is over 5 million for the year, and as we look at share repurchase, we always look at when it's undervalued and we still believe it's undervalued and so we looked at it from an opportunistic standpoint, balanced with the other priorities, there's not a regular scheduled cadence that will come from us on the share repurchase, it's more opportunistically as we compared to the other opportunities and the EchoPark expansion, as Jeff and David mentioned, it is slowing a little bit, maybe correlated with the market, so you won't have as much capital spend in the next quarter and the first two quarters of next year, so that's going to free up opportunities for other buckets. We're very confident in the model and you see a lot of other models flailing around and it's just the strict inventory management guidelines, sometimes you might miss out on a little volume, but at the end of the day our growth is there, we're going to get back to positive EBIT, that's going to happen in the calendar year' 23 and we think later half of the second quarter, first part of the third quarter is when that's going to happen."
}