{
    "symbol": "RSI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 23:34:03",
    "content": " Consistent with our goal to launch in new markets early, during the quarter, we launched our online Sportsbook app on the first possible day in both New York and Louisiana. In fact, we are excited to let you know that we already reached profitability for the first quarter in Michigan after only our fourth full quarter of operation, demonstrating once again the value of online casino markets and our ability to ramp up in new markets, while also achieving profitability quickly. The combination of improving profits in our now five profitable markets, our expectation that many newer markets will reach profitability by year-end and lower amounts of new market investments relative to our rapidly growing base of existing business gives us confidence that RSI will be profitable for the second half of next year, 2023 on an adjusted basis, I expect to get it comfortably with our current cash position. Given the four new online sportsbook launches since last fall, which includes New York, an aggressive level of marketing investment, a little lower sequentially at $265 for the quarter. As Richard mentioned earlier, and as we've discussed at length in prior calls, with this run of recent new state launches, we were in a heavy investment mode during the quarter, which we are comfortable doing, knowing that existing markets where we operate continue to perform and grow nicely. We expect marketing expense in New York to reduce significantly in the second quarter and going forward, but we'll also have increased costs in the second quarter in Ontario related to our exciting recent launch, a market where we're optimistic we'll see solid returns given that online casino is legal in this market. We expect our losses to continue to decline meaningfully as we move through 2022, improving profitability on a market-by-market basis and less investments in new market launches relative to our overall size gives us confidence in our ability to be adjusted EBITDA profitable for the back half of next year 2023. So this is a view of the industry given the gray market existing there and the fact that you have to have restrictions on inducing any inducements to attract a new player to play at a site is going to take longer to get those players in because you aren't promoting like you do in the other markets in North America to offer promotional offer, free spin offer, bonus codes, anything of that nature are prohibited. I think we've been pretty clear and probably evident from the markets where we have gotten profitable first is when it has both casino and sports, we're going to get to profitability sooner and it's going to take a little bit longer in a sports-only market. I think as long as the user experience is scalable and the scaling with the rest of the competition, for example, making sure that you have enough scale to invest in the proper data feeds, streaming fees, things of that nature, which we've been market-leading on as long as you're able to offer the players' experience by investing in those things and having the ability to justify those expenses, which we are able to do and plan to continue to expand our focus in those areas, we think the scale is less relevant than it is, for example, in a poker market, where often the inferior product sometimes wins because it's all about liquidity and the number of players you have, whereas in the casino category in sportsbooks as I mentioned it doesn't work that way."
}