{
    "symbol": "RSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:14:06",
    "content": " As for the remainder of the year, we are revising our revenue guidance range to between $580 million and $600 million, which reflects the impact of a third quarter's lower than normal iCasino hold, foreign exchange headwinds from Q3 and anticipated for Q4 and the impact of our disciplined marketing spend in the third quarter. Yeah, so we haven't given long term targets for profitability in each in particular, I think what I'd point you to is some of the trends we've talked about and the success we're seeing, and I think Richard pointed out that our loss this quarter from, from the sports book only markets was, was under $5 million. So real progress there and I think it's, it's notable that all but one of the markets that we've told everyone that we're profitable in I include casino and maybe one other data point I think is interesting is the last two markets that that got to profitability for us for Michigan and West Virginia, and they both got there in the matter of four quarters. So when, when we, when we have more opportunities, we're doing more and when in markets where it doesn't look as attractive at a given point we'll pull back and it's, it, it just goes to the kind of the dynamic nature of our marketing spend and being able to pivot pretty quickly. So it's why we've, we wanted to make sure that it was clear in Q4 that we'd be doing more in the casino areas and, and particularly in New Jersey but don't expect it to get as high as it was in the first quarter of this year or the fourth quarter last year. So I think there's ample markets where we have large populations where casino is attractive, but it also comes down to reactivation of existing customers and making sure that your existing players are treated well, your VIPs are allocated appropriate amounts of reinvestment to ensure they stay loyal with us. I think what's really important to note is that all of our peers, whether it's large land based casinos or maybe sports book first daily fantasy type of companies are all aligned around funding, not just supporting verbally, but really putting some money to work to lobby for eye gaming legislation for the first time really in the history of this industry in the US market. Well, it started with the launch of the football in q3 but due to it being a really casino first market for us and the cold weather months being the prime time for casino players we're really intensifying the marketing effort for New Jersey for the rebrand really in q4 because of the attractiveness of that seasonality for that opportunity."
}