{
    "symbol": "VVV",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-15 14:31:16",
    "content": " We have multiple levers to create value and drive strong growth, including continuing to focus on growing our core business through winning market share and improving service penetration, focusing on accelerating our franchise growth while continuing organic growth via new store development and M&A, leveraging our assets and core capabilities into incremental service offerings as the car park evolves and maintaining an enhanced capital structure and improved capital allocation policy by returning excess cash to shareholders. The mature stores have provided substantial growth in recent years with per store revenue growing from $1 million in fiscal 2018 to $1.5 million in fiscal 2022, while per store EBITDA has grown from nearly $330,000 to over $500,000 in the same time period. First, we're confident that we'll drive -- that we'll deliver 6% to 9% in same-store sales growth with growth in both transactions or the vehicles we serve and the average ticket. Looking at transaction growth for our mature company stores, we've delivered 4% compound annual growth rate over the past 5 years in the number of vehicles served per day, which is faster than the do-it-for-me oil change industry. So as these newer stores that we've added over the last 5 years become mature, there is a significant addition that they make to both bottom line profit, but also begin to enhance the EBITDA performance, overall margin performance for the business. And therefore, that's where you see the higher end of the range are delivering the same-store sales and starting to increase the focus of new unit growth more skewed to the franchise side. On Page 4, you show same-store sales growth for company-owned stores and franchisees, and the franchisees grew 15.5% in 2022, and the company-owned stores grew 11.5%. I think I'll just add, if you look at Page 15, you'll see what the mature stores -- you can break down what mature stores did on a vehicle served per day, which was about 5%, a little bit more than around 5% growth."
}