{
    "symbol": "YI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-25 13:01:08",
    "content": " Gang Yu, Co-Founder and Executive Chairman; Mr. Junling Liu, Co-Founder, Chairman and CEO; Mr. Luke Chen, CFO of 111's Major Subsidiary; Mr. Harvey Wangg, COO; and Ms. Monica Mu, Investor Relations Director. As a reminder, today's conference call is being broadcast live via webcast. The company's earnings press release was distributed earlier today, and together with the earnings presentation, are available on the company's IR website at ir.111.com.cn. Before the conference call gets started, let me remind you that this call may contain forward-looking statements made under the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements are based upon management's current expectations and current market and operating conditions and relate to events that involve known and unknown risks, uncertainties and other factors, all of which would cause actual results to differ materially. 111 does not undertake any obligation to update any forward-looking statements as a result of new information, future events, or otherwise, except as required under applicable law. With that, I will turn the call over to 111's CEO, Mr. Junling Liu. The information that we'll be discussing here, is also provided in the slides that have been posted earlier today on the company's website. In today's call, I will talk about the general economic situation and how the company rose to the challenge of meeting the impact of both the COVID pandemic and the economic uncertainties. Secondly, I will also provide some color on our strategies in the areas of building momentum for margin growth, improving operational efficiency, and strengthening of supply chain capabilities. Although we have been in the COVID pandemic for three years, 2022 proved to be the most challenging year in China. As many of you are aware, COVID infections broke out in Shanghai in the spring and the pandemic subsequently  cities in China. And as a result, our Shanghai headquarters and several of our fulfillment centers were shut. In many cities, our deliveries got stuck in transit, and we also experienced a severe shortage of medicinal supplies as our suppliers were not able to replenish inventories as usual. Through the team's tremendous efforts, our company was appointed by the Shanghai Government as a supply guarantee enterprise and opened a special green channel, which enabled our vehicles to deliver from Kunshan fulfillment center to Shanghai on a daily basis. We worked diligently and leveraged our online and offline digital platform capabilities to aid pandemic regions, and continuously provided medicine and online medical services for patients nationwide. We have provided free online consultations for customers in over 370 cities, and provided over 3000 medicinal products covering more than 400 diseases during the lockdown period. Despite economic downturn and material detrimental impact on the offline retail sector, our Q2 revenue reached RMB3.04 billion achieving slight growth under extremely difficult circumstances at this. However, our gross profit grew 43% year-over-year reaching RMB192 million. This achievement came from optimized product assortment and a smart pricing, as well as improved team efficiency and technical capabilities. Our B2B business remains the key contributor of our revenue, which reached RMB2.9 billion. Gross profit margin for our B2B segment rose to 5.8%, representing a growth rate of 53% year-over-year. I'm pleased to report the progress we have made on our private label initiative armed with its CRM, big data, and health management database, 111 cooperated with pharmaceutical manufacturers to build private label products, which include medicines, health supplements, medical devices, etcetera. So far, we have already developed three brands  and  targeting specific market segments. With our online and offline digital platform and nationwide distribution capabilities, this these proprietary products will improve gross profit and improve downstream customer stickiness significantly. Even during the pandemic, our service revenue reached RMB22 million. Our operational efficiency is trending very nicely due to the improvement in business scale, team efficiency and technology advancement. The total amount of sales and marketing, general and administrative and technology expenses  have been reduced by 24%, 25% and 36% respectively. Although the current environment has resulted in challenges to our business, we're still committed to executing our strategy to continue to grow our revenue and gross margin. As of Q2 2022, 111's virtual pharmacy network reached approximately 410,000 pharmacists covering about 70% of the total in China. As we deepened our relationship with upstream pharmaceutical companies, 111 has also strengthened its relationship with downstream pharmacy customers. As a result, we were able to help those pharmaceutical companies to improve their drug commercialization efforts and digital marketing efficiency. This quarter, we have also seen that our pharmaceutical coach  and logistic capability improving rapidly. As of July our coach and service is deployed in over 270 cities, over 80% of which orders can be completed within 48 hours. Through digital franchising, One Health has so far helped more than 11,000 pharmacies through AI technology, big data analysis technology and SaaS services such as CRM, O2O, et cetera. This digital service made our S2B2C business model possible, which already covers over 67 million consumers and has opened up the digital marketing link for upstream pharmaceutical companies. Meanwhile, the average gross profit contribution by One Health members was 1.6x for that of numbers. Cloud promotion is an innovative S2B2C management platform, which connects pharmaceutical companies with pharmacists, pharmacy managers, pharmacists, sales personnel, and the consumers, by facilitating the assignment, the specific tasks from pharmaceutical companies to the pharmacies. These parties include training, taking exams, product display, promotion, patients education, et cetera for pharmacy managers, pharmacists and sales personnel. At present, dozens of pharmaceutical companies over 7,000 pharmacists and close to 10,000 pharmacists and sales personnel have joined this platform. As a national high tech enterprise certified by the Chinese Ministry of Science and Technology and a specialized high end new technology Shanghai Enterprise selected by the Shanghai Municipal Commission of Economy and Information, 111 has proactively responded to the call for the three creations, i.e. innovation, invention, and the creativity, and the four news, i.e., new technology, new industry, new business formats, and new models, and are constantly devoted itself to scientific and technological innovation. Since its establishment, 111 has pursued continuous technological innovation advancement. In July this year, we won the 2021 to 2022 China Pharmaceutical Retail Leader Award with our innovative business model and the leading digital technology capabilities. As the national health digitization drive gathers pace and the state provides more support for the development of platform businesses, we will continue to invest in research and development, aiming to achieve continuous incremental improvements for our business. As a supply guarantee enterprise in Shanghai, we have proactively provided a timely boost to the ongoing fight against the pandemic. We collect purchase orders via proprietary purchasing channels and assigned special personnel to process them, thus ensuring timely delivery to patients. 1 Clinic, 111's online hospital launched free online service since the pandemic began and provided free online consultations, free prescription renewal for chronic disease sufferers and other medical services to the public. We will make  efforts to pursue call growth opportunities, further consolidate and enhance our leading position, and to bolster our competitiveness in the medical service industry. Driven by digital technology, we will continue to deepen the digital transformation of the healthcare industry and upgrade platform services so that patients at large could gain access to high quality medical services and drug purchasing services. Thank you, Junling and good morning or evening everyone. Moving to the financials, my prepared remarks will focus on a few key business and the financial highlights. You can refer to the details of the second quarter 2022 results from slides 13 to 16, section two of our presentation. Despite all the challenges from pandemic lockdown, and thanks to our team efforts, we have managed to keep our revenue stable by continued to fast grow our gross profit and margin. Our B2C segment revenue was negatively impacted by the lockdowns, which decreased 20% to RMB103 million with gross segment margin improved from 20.2% to 22.5%. As a percentage of net revenue, total operating expenses for the quarter was down to 8.9% from 10.7%, which reflected continuous improvement in our operation efficiency. Fulfillment expenses as a percentage of net revenue for the quarter was 2.9%, up from 2.8% in the same quarter of last year. General and administrative expenses as a percentage of net revenues accounted for 1.3%, down from 1.7% in the same quarter of last year, which was attributable to our continuous optimization of our supporting functions. Technology expenses accounted for 1.1% of net revenue, down from 1.7% in the same quarter of last year. As a result, non-GAAP loss from operations narrowed to RMB52.8 million compared to RMB147.9 million loss in the same quarter of last year. As a percentage of net revenues, non-GAAP loss from operations decreased to 1.7% in the quarter from 4.9% in the same quarter of last year. As a percentage of net revenue, non-GAAP net loss attributable to ordinary shareholders decreased to 2.2% in the quarter from 3.9% in the same quarter of last year. As you can see, we are improving our financial performance quarter-by-quarter, and we are very close to profitability. A quick note, our cash position as of June 30, 2022, we had cash and cash equivalent, restricted cash and short-term investment of RMB885.6 million. And so first of all, in our last quarter it was extremely difficult for majority, for the three months, our head office was under lockdown and even after the lockdown was over and our staff gradually returned to office starting from second week of June, still no one from our head office can travel out of Shanghai to conduct the badly needed business. And in the meantime, our pharmacy customers were also under tough challenges as you know, they were not allowed to sell fever and the cough related medicines. And, there were four type of medicines that they were not allowed to sell, which account for a substantial amount of their business. Given the extraordinary circumstances, we established a virtual command center with all the functional leaders dialing in every day to make decisions to deal with all kinds of issues popped up. And I'll give you an example, as you may know, once you leave your residential estate, it will be extremely difficult to re-enter as every estate is so strict on the inbound traffic. At that time, many customers placed orders online and they need to get the riders to collect those medicines from one of our collection centers. So, some of our staff used their own personal vehicle to dispatch some of the orders to customers who live far. So end of the day, I think it's the team's spirit and our execution capability that contributed to the business results. With your second question, about impact and also how we're going to deal with it in the second -- third and fourth quarter, it is quite obvious. Although we are able to work in the office now in Shanghai, many cities right now in China are going through what Shanghai went through. As we speak right now, we have thousands of orders stuck in transit right now due to the lockdown in many cities, including some of the major logistical hubs. This will add extra challenge to our business, but as you know, we have done in Q1 we will continue to operate with great vigilance and do the best we can. With regards to your third question Xipeng, future strategy, we always had a three-step strategy. With that we actually completed a -- closed the loop online and offline, and B2C to B2B, B2B2C model. As one can understand or one can appreciate in the Chinese market, scale matters a lot and without scale nobody takes you seriously. And today, as you can tell, we already covered about 70% of the overall market. And with that scale, you obviously we're in a much better position, either to deal with upstream suppliers or downstream pharmacy customers. As we have demonstrated the last few quarters, every single quarter we're making substantial progress. If we look at the bigger picture level, we wanted to use digital technology to transform this healthcare industry and we are the firm believer that technology will be the key driver. So, we will be pursuing both top line and bottom line growth and we believe that technology will be the best tool to give us that edge. I have also three questions, if you don't mind. Okay, Luke, you answer the last one. Yes, we have made a lot of progress in Smart, in Smart Supply Chain as well in technology. In terms of supply chain, our Smart Supply Chain, we made progress in both systems and in our infrastructure. Right now, our coach and coverage can fulfill to 270 some cities and it provides tremendous convenience to our patients. We through our own experience, we know that it's so difficult, takes long time to build this fulfillment center. So we had this idea beginning of this year and by now we already assigned 11 fulfillment centers, eight of them are already in operations. They are closer to customers so that they can shorten the delivery time and they also have a lower fulfillment cost, so really a tremendous help to us. Last example is about the inside our fulfillment center, we try to reduce our operational cost. So a lot of cutting boxes, we fit them like one SKU are directly shipped to our B customers. And by separating the bulk from the units we lowered our fulfillment costs, especially the picking and packaging costs by almost 20%. Regarding to our technology, as you know that we are continuing to invest in our technology development, Junling mentioned that we are recognized by Chinese Ministry of Science and Technology as specialized high end new technology enterprise. And also we receive award, China Pharmaceutical Retail Leader Award. These awards are for, especially based on our digital technology capabilities. And also, we built this patient lifetime management platform, which connect patients with doctors, pharmacists and medical assistants. Through usage of these platforms, patients gain tremendous convenience for accessing doctors, medication and disease education. The DOT duration of treatment, is a very -- measure for adherence of your patient medical adherence, that index has been improved by more than 30%. And also we provide a lot of tools, both for our marketplace vendors, help them improve product availability, timely fulfillment and post-sale customer services. So through the few examples again, I hope I can demonstrate that our investment, our Smart Supply Chain, our new technology has been achieving, what Iâ\u0080\u0099ve seen the fruits. On the company's cash reserve, as we disclosed as of June end 2022, we had cash and cash equivalents, restricted cash, and short term investment about RMB886 million. And you can also tell from our cash flow statements, the net cash outflow in the first half of this year is significantly lower than the first half year, last year. Thank you for taking my questions. I have two questions. Yes, we made a strategy to focus on margin delivery and in last few quarters we worked extremely hard on our product structure optimization, which is the main driver for better margin. We keep testing price elasticity, and we arrive at an optimized pricing for certain cohorts of SKUs. So this is really instrumental in helping us improving our margin and also project and image that you know, our selections has very competitive pricing. And also, our product mix included the so-called gold label products, which means high margin products, which maybe high return, I can elaborate on. The revenue for this category of products is not very high, but the margin contribution is very, very pleasing. It's early stage, but we are very excited by the potential for this line of business. So though, to conclude and I believe this is very sustainable, the second part of your question, and we should anticipate that our margin growth will continue to grow faster than revenue in the foreseeable future. Second question, for the second question regarding high margin products, actually, as Junling just mentioned, this is actually with our SaaS based digital marketing tools and our various platforms, like One Health, like cloud promotion platform that to promote those new products or special products from pharmaceutical companies. And margin is normally about 20% and average about 23%, 24%. And these products not only high margin products of, one, but also which is even more important, also those are high margin products for pharmacies. And we are pleased to see, we have successfully those rules and the transformation as we can see in quarter-by-quarter and the high margin product sales are increasing revenue. Hi, thanks management for taking my questions and congrats on your solid results. For One Health, One Health is becoming the first in the industry with the S2B2C model and our virtual franchise model enable over 10,000, those small or medium sized pharmacy chains to provide superior products and services to their customers. So for our next step also One Health actually currently I'm right now in Wuhan tomorrow, we will have a One Health member summit in for those members from Central China. On our next step of this program, that is to set up a closer connection on our marketing on this, all of our members and marketing about those exclusive SKUs and also about our private label, like One Health is designed for One Health members, which basically all those are very high margin ones, so we can expect the margin percentage of this program is going to increase. And for the next initiative, that is cloud promotion program and this is actually a SaaS based platform, connecting pharmaceutical companies with pharmacists in those pharmacies, and eventually with the end user or patients. Owning, we just launched in only a few months, and we have about, currently about 10,000 pharmacists and assistance in the pharmacies register in this platform. Thank you for taking my questions. I have two questions. Yes, our non-GAAP operating loss for the quarter is 1.7% of net revenue, which is significantly improved if you compared to 4.9% last -- in the same quarter of last year. If you zoom in, you will see that the improvement was contributed by first of all, the gross market improvement, which is 6.3% this quarter versus 4.5% in the second quarter of last year. And also the total operating -- reduction contributed the rest, but just now Junling and Harvey is talking about our plan on the revenue and the margin expansion, if you look at our OpEx, you will see that in Q2 we have made great efforts to optimize our organization structure, streamline our operation process, and make full utilization of automated digital tools to improve into operation effectiveness and efficiency. And as a result, all of the expensive line items, such as selling marketing expenses decreased by 24%, G&A expenses down by 25%. And so we would believe that we will be able to keep this spending level in the rest of the year, while continuing to grow our top line and gross profit. So overall we are optimistic, positive, that we will continue the trend to narrow the loss until profitable. I'll touch upon the supply guarantee enterprise and Steve, thank you for that question. And as you can imagine, during the lockdown, all the logistics were suspended with the exception of government approved companies, which you know, can deliver essential goods, such as food to residential compounds to keep the citizens fed. And eventually it made sense to the authorities, that in addition to food and water many chronic patients will need drugs to survive. To put the long story short, we got it sorted and eventually made it work and both governments gave us the green light. And as far as we knew, we were the only online company in Shanghai who were able to deliver this service to consumers. And what we did exactly was, we set up four collection centers across Shanghai and two in Puxi and two in Pudong, and the drugs will be delivered from our fulfillment center to those collection centers, where our people will have to work pretty hard to sort all the drugs out based on different suburbs and so on. As I said before, some customers were simply not able to get those riders because they lived little further away and some of our staff will have to use their own vehicle and leave their residential compound to deliver those drugs to consumers. We're very proud of the fact that our customers can receive such services, received so many letters from customers and are calling that really life-saving services. If you require any further information or have any interest in visiting 111 in Shanghai, China, please let the company know."
}