{
    "symbol": "IIPR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 16:48:10",
    "content": " Capital raising across the cannabis industry continues to be extremely challenged, with total capital raised in 2022 down over two-thirds compared to 2021 for U.S. regulated cannabis operators, and the beginning of this year is showing little improvement with capital availability remaining at multi year lows. As you may know, we also executed on our first property disposition in Q4 of last year, selling a Pennsylvania property that we originally acquired in 2019 and leased to Maitri, a private single state operator for $23.5 million, or approximately $461 per square foot, which is well above our operating portfolio average of $272 per square foot and above what we originally paid for the property including funded improvements. However, Parallelâ\u0080\u0099s Texas property has been under development and is yet to commence Vertical construction with only around $8 million funded to date, including the site acquisition, although they have been paying full rent on the full amount of committed capital to that project since October of 2021. The increase was driven primarily by the acquisition and leasing of new properties, and additional real estate infrastructure allowances at our existing properties, totaling $394 million in 2022, as well as contractual rent escalations at certain properties, offset by the previously disclosed non-collection of rents primarily associated with the defaulted tenants. In addition to the fact that we've, I think we've collected -- based on the structure of that transaction, where we committed over $27 million, but only have spent $8.7 million and have actually collected what around 81% of the asset value already in cash flow, not to mention the fact that we still have if we get control of the asset, we will have the value of the asset to be able to further enhance the return to our shareholders. Well, first of all, it's extremely unfair to put any sort of budget or any sort of commitment, given the fact that we've just spent a great deal of time describing how difficult to not only the industry is experiencing capital raising, but also the real estate industry and how interest rates have come -- have increased significantly, and our cost of capital has increased significantly."
}