{
    "symbol": "IIPR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 18:30:26",
    "content": " And that is where I would like to begin with our initial acquisition and leaseback of a property and Wimauma with Parallel, pricing approximately 373,000 square feet of industrial and greenhouse space for $35.3 million, or about $95 per square foot. We also evaluated their footprint with licenses in Florida, Massachusetts, Pennsylvania, and Texas, and their position as the second largest operator in Florida at the time in terms of operational dispensaries, which we believe provided them with a strong foothold on which to focus on growth and obtaining the appropriate market share commensurate with their dispensary count in one of the largest high growth cannabis markets in the U.S. At that time, they had 39 operating dispensaries and were second in terms of production of smokable flower in the state that well behind the leading company. In connection with the closing, we agreed to make up to $8 million available, for reimbursement for future costs, incurred with the connection with the completion of the build out of the property, which included reimbursement for Parallels improvements made in accordance with the three areas noted previously, but no reimbursement for costs incurred prior to our acquisition. Similar to the Wimauma property, Parallel purchased the property from a third-party for $2.4 million and proceeded to spend approximately $18.3 million on improvements to the buildings with the bulk of that spending going towards development of an industrial indoor cultivation facility. We next executed our Texas transaction in March of 2021 with our purchase price for the 12 acre property being $3.4 million where we expected Parallel to construct three buildings, one retail and two industrial, comprising an aggregate of 63,000 square feet on the property for which we agreed to provide reimbursement of up to $24 million. Under Pennsylvania, where we purchased the 239,000 square foot industrial facility in May of 2021, Parallel had been a tenant of the prior owner of the property since October of 2020, and executed a purchase agreement with the prior owner to acquire the property for $22 million, or about $92 per square foot. As a result, we acquired the property for approximately $41.8 million consisting of the original purchase price for the standard industrial building to the prior owner and the costs reimbursed to Parallel for build out of the facility for regulated cannabis cultivation and processing while Parallel was a tenant under the prior ownership. In addition to reimbursing Parallel for qualifying base building improvements, designing and permitting electrical and other improvements totaling approximately $20 million that Parallel had invested in the eight-months prior to our acquisition, while Parallel was a tenant of the prior owner. We made our initial investment with Kings Garden April 2019, acquiring a five property portfolio in Southern California, consisting of approximately 102,000 square feet of industrial space, all of which was operational at the time of our acquisition for approximately $27 million or roughly $266 per square foot. In May of 2020, we followed with the acquisition of a fully operational property comprised of approximately 70,000 square feet of industrial space for $17.5 million, or $250 per square foot. In November of 2020, we made another investment with Kings Garden agreeing to purchase 192,000 square foot building from a third-party in San Bernardino for approximately $25 million, or approximately $130 per square foot, and to provide reimbursement to Kings Garden for improvements at that facility of another $25 million for key infrastructure requirements for the regulated cannabis cultivation or another $130 per square foot, such that our total investment in that facility was expected to be $260 per square foot. Amending the lease for that property and providing for reimbursement to Kings Garden of up to 51.4 million for the construction of two brand new facilities totaling 180,000 square feet of space, or about $285 per square foot. For the 19th Street project has been mentioned, we acquired the land adjacent to our existing property and amended the existing lease with Kings Garden to incorporate that property and provide funding of up to $51.4 million for two brand new industrial cultivation buildings expected to comprise 180,000 square feet. I would also like to note with all of the property improvements, development projects and ground up construction that we have funded at our property since our inception, we do not provide funding to tenants for use to purchase FF&E, any other personal property or to fund any general corporate expenses, which is made clear in the Company's audited financial statements by the fact that none of the Company's leases have recorded lease incentives since inception. No, but let's think about in reality, so the person has a license is the license in order for them to utilize the license that they have just paid for that they have - they would have to buy a piece of land, build a building, or buy a piece of land with a building on it, improve it with $300 to $500 of square footage and improvements and get state approval for this new location and to be in the right zoning and have local approval for all this stuff or they could just pay the rent on the facility that the license is already licensed for."
}