{
    "symbol": "BBVA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 09:43:03",
    "content": " 2020, â\u0082¬6.6 billion of recurrent profits, 31% higher than the â\u0082¬5.1 billion that you recorded in 2021, which was already in again an exceptional level and these results, it brings our earn -- it bring our earnings per share up to â\u0082¬1.05 with an increase of 48% year-over-year, obviously significantly higher than the growth or the profit. In terms of the quarterly evolution, which is the second to last column in the table on the right, gross income and operating income, they increased 6.6% and 4.2% respectively, versus the third quarter, despite, obviously, as you know, being negatively affected by the once in a year deposit guarantee fund contribution in Spain. On the left hand side of the slide, you can see the strong loan growth for the group, which has accelerated obviously since last year; so, 13.3% versus the 5.6% of 2021, so, very good growth in activity. As a result of all of this, obviously, on the right hand side of the slide, you can see the strong NII growth, both quarter-over-quarter and also year-over-year in both countries; 26% in Spain, 35% in Mexico in constant Euros and quarter-over-quarter numbers, 17% in Spain and 8.5% in Mexico, very positive, very positive figures. This payout is equivalent to a total shareholder remuneration of â\u0082¬0.50 per share, and it's split among a total cash dividend of â\u0082¬0.43, which is 39% higher than last year in terms of the cash dividend, which again also implies that â\u0082¬0.31 to be paid in April, 2023, subject to the approval of the Annual General Meeting, obviously, and complimenting the â\u0082¬0.12 per share cash dividend that we have already distributed back in October. In terms of P&L, fantastic year in Mexico, the net profit reaches a record figure sitting â\u0082¬4 billion due to an impressive revenue growth close to 26% year-on-year, driven by a strong NII growth supported by long growth and higher customer experience, that has increased 71 basis points during the year, benefiting from an effective repricing of the asset sites, while the cost of the deposit remains well contained. On the quarterly basis, the net profit continue to improve in constant terms in the fourth quarter, driven by the increase in trends in growth income; thanks to higher core revenues, NII supported by activity growth in Turkey and free growth mainly for payment service and brokerage, and a lower quarterly high proliferation adjustment, impacted by the depreciation of the Turkish lira during the last month of the quarter. Your line is open. So around the 16% that you mentioned,\n Benjamin, maybe one addition to this cost number, when you would see it in the coming months and quarters, as you have seen also this year in 2022, in Mexico, we are slightly or we are above inflation in terms of costs. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}