{
    "symbol": "BBVA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 15:22:03",
    "content": " But in the nine months, the strong gross income growth of 21%, obviously, coupling with the positive jaws and the solid risk metrics, it led to an outstanding recurrent net attributable profit of more than â\u0082¬5 billion, more than â\u0082¬5 billion in the first nine months of 2022. The positive evolution of net fees and commissions across the board, increasing 17% year-on-year, consolidating the high figures of last quarter, despite as you all know, the negative evolution of the markets and obviously it's implication on the asset management business. And lastly on the right-hand side of the slide, you can see the resulting obviously the strong NII growth, year-over-year in both countries 6.8% in Spain and 29% in Mexico in constant euros. Slide number 11, we continue showing positive jaws at the group level, thanks to the good performance of gross income, growing 21.2% in the first nine months of the year versus the same period of 2021. In addition to some activity trends, I would like to highlight a strong trade provision profit evolution reaching double-digit growth to 10.2% year-on-year mainly driven by very solid dynamics on the NII. Despite lower contribution from TLTRO of minus â\u0082¬30 million in the quarter, NII grows by 3% quarter-on-quarter levered on activity and on improved customer spread of 1.85% increasing by 14 basis points versus previous quarters. NII increased close to 24% on the year above loan growth due to increased customer spreads plus 57 basis points year-on-year, benefiting from higher yield on loans while the cost of deposits remained well contained below 2%. Your line is open. Your line is open. In terms of the high-teens NII guidance for next year considering your sensitivity was -- I think it was 15% to 20% for 100 basis points and we've now seen 200 basis points rate hike it -- that seems I mean it's a good number, but it doesn't it looks like it could be higher. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}