{
    "symbol": "BBVA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 19:12:02",
    "content": " These excellent results brings our earnings per share, at the bottom of the page, earnings per share up to â\u0082¬0.28, 58% higher year-over-year, a higher growth rate than the net attributable profit due to the share buyback program that we are all -- we are implanting, as you all know. In my view, this was the highlight -- this has been the highlight, 30% versus the second quarter of 2021, supported by the strong loan growth across the board. I would highlight again the strength in core revenues, NII growth of 33% and the fee growth of 21%, which coupled with the positive jaws, coupled with the solid underlying risk indicators, led to our best quarter with a net attributable profit growth, as I mentioned, in constant basis of 45.7%. Again, as mentioned on the previous slide, the strong gross income growth of 16% coupled with the positive jaws, coupled with the solid underlying risk metrics, led to an outstanding recurrent net attributable profit of â\u0082¬3.2 billion. On the left hand side of the slide, you can see the strong loan growth, which has been accelerating quarter-over-quarter, reaching a 12.6% growth in activity versus the same period of last year at the group level. I mean, if you exclude Argentina and Turkey, the 2 very high inflation countries in our footprint, this 12% growth would have been -- on constant basis would have been 3.8%. The loan book is growing at 3.6% year-on-year with a strong performance of consumer lending, where we are almost delivering double digit growth, and commercial segments also growing above 10% mainly in short-term lending due to the recovery of the activity, leading us to gain market share in both segments during the quarter. Looking to the last 10 years of Mexico -- unfortunately, I would say, the last 10, 15 years of Mexico, the growth rate of the economy is around 2%. But the 12% growth in costs, if you isolate only 2 countries, which are relatively small in the grand scheme of things, but Turkey and Argentina with high inflation numbers -- if you isolate those 2 countries, 12% growth in costs would have been 3.8%. And clearly, today, when we have seen the initial increase in rates from the ECB and also how this is going to contribute to provide continuous -- providing value with the TLTRO and also the dynamics that we are seeing in activity and the customer spread that we saw on the presentation, clearly, are guiding us to improve the NII guidance to this mid-single digit."
}