{
    "symbol": "WETF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 13:15:31",
    "content": "  Operator: Hello and thank you for standing by, and welcome to the WisdomTree First Quarter Earnings Conference Call. After the speakers’ presentation, there will be a question-and-answer session. I would now like to hand the conference over to your speaker today, Jessica Zaloom, Head of Corporate Communications. Before we begin, I would like to reference our legal disclaimer available in today’s presentation. A number of factors could cause actual results to differ materially from the results discussed in forward-looking statements, including, but not limited to, the risks set forth in this presentation and in the Risk Factors section of the WisdomTree’s Annual Report on Form 10-K for the year ended December 31, 2021. Now, it is my pleasure to turn the call over to WisdomTree CFO, Bryan Edmiston. Our AUM at March 31 was 79.4 billion, which represents our second consecutive record quarter. Our average AUM for the quarter was 77.8 billion, our fifth consecutive record quarter. Our AUM is withstood a volatile market environment and it’s positioned to continue capturing market share as we experience a rotation towards the value, rising rates and inflation. We benefited from positive market movement and we generated $1.3 billion of inflows during the quarter, representing a 7% annualized organic growth rate. These flows, which mitigated outflows from certain commodity products highlight the breadth of our product lineup and demonstrate sustainable momentum. In the month of April, we have generated an additional 1.7 billion of flows continuing the positive trends witnessed over the course of the last 18 months. Revenues were 78.4 million, a decrease of 1% from the prior quarter. Our compensation guidance, which contemplates hiring for our core business and digital assets ranges from $92 million to $102 million and is unchanged from what was communicated last quarter. If our strong organic growth persists, we would anticipate full year compensation costs to be toward the high end of our guidance range. This range is influenced by our digital asset spend, which includes professional fees, marketing, product development, and other related expenses, and is dependent on the timing of the WisdomTree prime rollout and additional products and features to be launched. Guidance related to gross margins, third-party distribution fees, and our tax rate are also unchanged from what was communicated last quarter. Our contractual gold payments guidance is being adjusted upward to between 18 million and 19 million, given the recent increase in the price of gold. 175 million of our convertible notes are scheduled to mature in just over a year, while not committing to anything at this time, we anticipate reducing our debt levels and partially refinancing a portion of these notes sometime between the latter half of this year and early next year. However, that will need to be balanced with optimizing our debt and investing strategically in our growth. It is the result of many years of hard work behind the scenes to improve the diversification, resiliency and growth prospects of the company. If we were to go back in time five or six years to the height of DXJ and HEDJ, WisdomTree was a U.S. only ticker oriented ETF sponsor. Though the sell off of those two funds was painful, we deployed the excess earnings power from those funds into opportunities, which set the table for today’s resilient AUM base and strong organic growth. First, data and technology, second solutions, including models and digital tools, and third of vibrant complementary European business. First, we invested in our data and technology capabilities to improve operations and enhance distribution intelligence through CRM investments and strategic platform partnerships. We also modernized our technology platform, which enabled a seamless transition to a remote first environment for our employees while better serving our clients. Building off of our first investment in data in tech, we next built an advisor solutions program to support broader and deeper product adoption, including our best in class solutions for model creation and trading for RIA and independent broker dealer clients. We acquired two companies and injected WisdomTree’s innovative culture to create a European platform that is transformative, resilient, and more than the sum of its parts. It was a very strong quarter, as the U.S. had strong flows and the AUM diversity from the European acquisition, along with the strong organic growth in UCITS platform where each major reasons that our global AUM was up quarter-over-quarter, while so many indices were down. The outlook for ETF industry growth remains incredibly robust and WisdomTree has never in better position to capture it, because the strategy we have executed against for years now is powering our growth of today and tomorrow. Starting with Q1, not only did we generate over 1.3 billion of net inflows across the firm with nearly three times as many funds inflowing and outflowing, but our inflows outpaced negative markets and our AUM grew quarter-over-quarter to new record highs. And as Jono has already highlighted a large part of today’s success has been the work and investment that has taken place over the past several years, starting with Europe, back in early 2018, we closed the ETF securities transaction. With it, we acquired a commodities franchise and AUM diversity that even today remains largely uncorrelated to the rest of our global product suite. We also got distribution pipes into the relatively walled garden of European wealth management, which is a tough nut to crack from the outside. Post acquisition with 19 billion of AUM in Europe, we got to work. We improved product structures and pricing, and we purged over 200 subscale funds that were a drag on profitability. At the same time, we leveraged WisdomTree core competencies to launch new funds and to create new products like UCITS and crypto, which have accounted for all of the organic growth in the European franchise since. All told, we took what could have been merely an accretive deal, and we grew it to the over 30 billion in AUM it is today and turn it into a launchpad for future European and global growth. And at the same time, we were transforming the U.S. business into a broader and more diverse growth engine, making it stronger today than it has been at any other time in our history. We invested in our people to build a best in class team across sales, marketing, research, product, operations and corporate functions. Like our experience in Europe, hard work and investment are paying off with momentum increasing in 21  of the past 22 months, generating inflows. Taken all together, actions we have taken over the last several years have diversified the business and positioned us for long-term organic growth in both the U.S. and Europe. First, our product positioning and performance have never been better. Second, our managed models franchise is entering its third year and its impact on flows is growing. And third, we are first mover in digital assets, which is a natural extension of our core business and has a massive addressable market. First, our product positioning and performance is outstanding. Over two thirds of our AUM is currently levered to themes like inflation, hedging, rising rates and the rotation from growth to value. Second, our managed models franchise continues to gain significant traction. Today, and very early into our third year we have over 2 billion in managed model AUM with roughly 12% of our U.S. ETF flows being driven by managed model strategies, which is up from the 10% we reported last year. Here, we have momentum with big partners like Merrill Lynch and Morgan Stanley and we have won two material mandates already this year with others in the pipeline. On the other end of the spectrum, we also launched WisdomTree portfolio and growth solutions on April 18th, which includes customized model construction services in addition to model trading services that will help us grow model flows in the mid- and small RA market. Overall, we are very excited about the trajectory of our models franchise, and we see a long and lucrative growth runway ahead with the beauty of the model business being that once you win advisor mind share flows are recurring in nature and stackable on top of our current inflow profile. Finally, and before I turn it back to Jono, I want to discuss our digital assets opportunity. Jargon like Blockchain, Crypto. Neo Bank and Digital Wallets can sometimes be confusing, but our strategy is simple. First, it is to bring crypto exposures into the mainstream financial ecosystem through ETPs and separate accounts. Looked at this way digital assets are a natural extension of what we do, delivering to our clients best structured access to various asset classes. And the first part of our digital asset strategy, bringing crypto exposures to clients in the mainstream wealth ecosystem, we've launched several new crypto ETP in Europe, including both single exposures as well as baskets. Despite the challenging crypto market, we've continued to see very strong 40% annualized organic growth year-to-date. While the outlook for a Bitcoin ETF in the U.S. remains muted even though Bloomberg did recently called WisdomTree, the dark horse candidate to gain first approval in 2022, we've also successfully launched a separate account strategy for the U.S. wealth channel. Consider that there are 30 trillion in assets in just the U.S. wealth channel alone, so even a 1% allocation to crypto in just the U.S. would yield a 300 billion market opportunity for crypto exposures, and the realistic opportunity could be multiples of that. All in all our product positioning and performance have never been better, our model business is gaining traction and we have first mover advantage and opportunity in digital assets. I'm incredibly excited about the quarters and years ahead, but I've only scratched the surface of the future opportunity. CBS Radio way back in the day before the invention of television, CBS had a brilliant engineer who had the imagination to see the potential of TV. Today, not one newspaper group is relatively stronger since the development of the Internet. It's hard to see the future and significant change doesn't happen very often, but significant change is happening right now in financial services and WisdomTree is in the right place at the right time to see it and to execute against this massive opportunity. Think about Eastman Kodak, one of the truly great companies of early corporate America. Unfortunately for Kodak, they're taking those pictures with their mobile phone. Before I answer those very important questions, let me say this about WisdomTree's ETF business. ETFs will see trillions and trillions and trillions of growth for decades to come and WisdomTree has never been stronger, more competitive or better positioned to grow within ETFs. First, let me say we ask ourselves the right questions. 20 years later WisdomTree has $80 billion in AUM, 40 basis points of revenue capture, 300 plus million of revenue, $50 million to $60 million in net profits. Literally nobody is in a better position to answer that question than WisdomTree, that's our edge. Our culture, our creativity, that's our edge. Today WisdomTree's 250 people worldwide, 230 people in ETFs, and 20 people in digital assets. We see virtual actually all financial assets through tokenization eventually coming to the Blockchain, liquid and illiquid assets it's all coming, and there will be spectacular winners and many who get disrupted and dis-intermediated out. We see this as a once in a lifetime opportunity, significantly expanding our address market and aligning WisdomTree to the fastest growing segments within asset management. Something that we could not do in ETFs, because we simply got there too late. Last quarter, we announced WisdomTree Prime. WisdomTree Prime is a financial services mobile app, it a distribution channel. In the late 1990s when I first discovered ETFs when the rapper only had $40 billion in AUM worldwide, there were two observations or characteristics that gave me the conviction that ETFs were the future. First was the convenience of ETFs, and the second was the recognition of the better functionality that ETFs delivered. Regarding the second point functionality, WisdomTree Prime will be one of the easier and most approachable places for user to hold crypto, but also a place where crypto and traditional passive exposures will sit alongside each other. In my opinion, having a robust mobile financial app strategy is simply table stakes in 2023. Regardless of how different consumers use it, one thing is crystal clear, by being first in tokenizing the underlying exposures, and by being native to the Blockchain, in our design WisdomTree will deliver unique and better function and by being a first mover generate faster organic growth in 2023 and better economics for all wisdom tree shareholders. Operator, please turn the call over to Jeremy Campbell, our Head of Investor Relations so we can start answering questions. We're going to start off the Q&A, just look we have for the past couple quarters using some questions directly from investors through the Say Technologies platform. Well, first WisdomTree stance on beta is pretty known. Yet there's still a lot of opportunities for beta and I know the question was on equities, but I wanted to highlight a few – a few topics here. First is one of the beta products that we were first on floating rate treasuries, ticker is USFR, we were able to be first in line. And that was an amazing accomplishment to be first there, and this is still a vehicle that we have to educate clients on that they even exist and what they are. But this has been one of the most exciting stories this year and to the point on equities and having alpha, this is a ETF that with 2 billion of flows year-to-dates. Now we are second largest ETF, and it's really providing alpha for the bond market. You've got 500 fixed income ETFs here in the U.S. and if you look at them, basically all are showing negative of returns, some very negative returns with the aggregate bond market down 9% on the year. If you look at USFR, it's got small positive gains. Next week we're likely to get two hikes, 50 basis point hikes next week, and maybe a string of 50 basis point hikes. So the momentum in that could accelerate over the coming 18, 24 months with this fed cycle. But in equities, I think what you see is gross stocks were in favor for much of the last decade. The S&P 500 its been down about 10% on the year, and you have high dividend baskets like DHS, one of our original funds from 2006, up 7% on the year,  our $3 billion large cap dividend strategies only down 1% on the year. We've seen about $1.5 billion come into net in-flows across 30 separate dividend strategies approximately six of those dividend strategies have seen more than $100 million net on the year, 11 of those approximately 30 ETFs have taken more than $50 million on the year. So for this market regime of higher rates inflation, the fed, we like value quality as Jarrett and Bryan were talking about and the dividend orientation has been particularly well suited for this macro regime. And Jeremy, maybe I can pile on there as well as. As Jarrett saying, our product suite is incredibly well positioned. Anything that is good for our individual products is also good for our managed models initiative, which is essentially a collection of our individual products. And so basically another important growth initiative, what's good for our individual products, also very good for our managed models business. I just talked about USFR, the floating rate treasuries for ultra short duration and this new rising rates cycle. If you go to – into a recession, I think you would want longer duration assets and further quality screens. And I'd say seven years ago you saw us launch enhanced core bond strategy that we also now have launched in Europe that is again systematic, modern alpha tilt on core bonds. We have $1 billion in the U.S. strategy, tickered AGGY, Aggy. So if you were to have a declining rate cycle with a recession, I think we're very well positioned for that rotation to longer duration assets. We also had quality screened fixed income credit strategies, and so under the stress of recession, you would think we're also well positioned for a shift to higher quality in the fixed income market. And to get in equities we don't just have value seven, really nine years ago. We launched a quality tilt on top of dividends, and now it's our largest ETF DGRW in the U.S. that screening for quality holds up particularly well during recession. So I think across equities and bonds, you see our full product positioning has enhanced, but I guess one final point is we've been launching more in the mega trend and thematic area. You think about declining growth rates for the economy, things that have secular long-term growth behind it would be prized, and that's why we've been trying to diversify in this mega trend lineup. And I would just add on to that, as it relates to our expenses just keep in mind that our fund management costs and third party distribution fees are highly variable. That said our AUM and organic growth have been resilient in the wake of recent market volatility, and as we previously noted is more diversified than it ever has been in the past. You may proceed with your question. We're under contract with many of our providers and others were not and you may see rates go up at that point in time as well, or I'm sorry, fees. Hey, Jarrett maybe you could start and Jeremy, if he doesn't get everything maybe you want to add to it, but at least Jarrett you start. When you're looking to grow the business, there are really two victories you need to score. One is, the first victory is partnering with some of the major platforms. And so once you win that first victory, the second victory is now you've got to go out and win advisor mind share which takes time. But once you do those flows become recurring in nature as you'll see us adding more advisors per each platform, and then within each advisor you see them adding more of their clients to our models. Directly to your question, we've got others in the pipeline. On the other side of the market, this is one of the biggest trends in wealth management right now is centralized managed models. Because you might not want one off the shelf, you want to customize it and add your firm's sort of view to it. So I refer to that in the prepared earlier this month, we launched a new service, WisdomTree Portfolio Growth Solutions, where we're providing that kind of an easy button for managed models where we will help our clients customize their models, but then run the models. And so we really have a two pronged attack here going on the large end with major platforms, and then on the smaller end, and the mid-size end with RAAs with this portfolio and group solutions initiative. So more to come, you're seeing building momentum and we expect it to keep going. You may proceed with your question. We're going into beta for WisdomTree Prime in Q2, and that will be really the beta for some initial of these tokenized assets as well. We've filed with the SEC, no specific guidance on when that might get approved, but kind of overall guidance for the second half of this year. Maybe if I could just follow-up on the WisdomTree Prime, maybe you could just talk a little bit about the customer acquisition strategy. It would seem that this is a direct to consumer approach, if I'm not mistaken in terms of how you're thinking about it. I mean, as Jono has said on the last call, we're not having Matt Damon do a commercial on the super bowl anytime soon. But just using very cost effective, getting a lot of learnings from our digital marketing and growing from there. Certainly, there'll be business development deals as part of this over time that and scale distribution quickly. You may proceed with your question. A little surprising to see the weakness in the first quarter, just given what we saw in some of those commodity markets. Jeremy, maybe you would start Jeremy Schwartz. And certainly what you're seeing is performance has been very, very strong across commodities. And so some of the flow that you see out of Europe can be counterbalancing and cyclical there, where people are sure taking some of the gain, given that commodities have been the strongest performers. One of our broad commodity funds, WCOA, sort of enhanced broad commodities up 25% on the year. Some of the things like  beta where, where spiked in large ways, you did see people cash in on some of those gains. But I think in a lot of the ways we are believers in the longer-term trends, there's been a lack of investment in commodities, and this could be very early innings on part of the sort of shift to this inflation narrative and commodities generally. So this is the hardest year to show because we show, in our guidance, we ramped up expenses from the prior year, without yet really seeing any revenue. Next year, it will at least have the revenue contribution. But there's certainly some as we spoke about from an earlier question about marketing and lean marketing principles, there are two elements to marketing is going to be around your cost of acquisition, and you'll have learnings from users and understand better or a little bit over time. But again, all of this is we feel very manageable of so much of our expenses of our core business are the historical ETF business is of relevance to what we're doing. So though there, we're not prepared to give guidance on 2023, we're highly confident that it'll be well managed. I mean, I would just say if we're going to see meaningful expense growth going forward, it's going to be coupled with revenue growth that you'll also be able to see. So forgive me, but when you think about like what you would expect based on your current expectations for this platform. So I saw you on your UBS Digital Asset Day, and one of the things that's the company,  one of the things that we noticed, or I noticed when you were speaking was the frustration and siloed nature of crypto assets versus traditional all other services that these firms were following. So many of the firms that you had on your Digital Asset Day, so much of their investment is on the old rails. All of the neo banks, all – many of the mobile app firms, they are just playing really on yesterday's technology and it will impact them going forward. I think we have a truly exciting use case that will, that we can build off of before the end of the year and well and really drive users into next year. You may proceed with your question. with one of those guys that have concerns about the investment in WisdomTree Prime based on, I guess, our knowledge and we see in the world in terms of security and the hacking of digital wealth are out there. With the $9 million to $14 million, you guys are suggesting terms of expenses this year. Yes, I mean, I think a lot of the recent hacks you're seeing are for things that are totally unrelated to what we're doing for like smart contract bridges and things like that, where people see crypto hack in a headline and think it is something to do close to what we do, or like a Coinbase does. I mean, in terms of how we're securing WisdomTree Prime, we've got our own security team in-house. We've got great outside relationships, one with currency, one which we have not announced yet that are the best in the business in terms of securing digital aspects and the private keys associated with them. I mean, you always need to be vigilant, but I think that is something that we are going into eyes wide open and are very, very well set up to do that. In terms of this follow-up question, in terms of like the marketing expense. So if the rollout happens toward the end of the year, then the expenses may a bit lower if it happens sooner or sooner than we're anticipating, then the expenses may be a bit higher. Putting aside digital, we also are mindful of our sales related spending. There's a range there as well, and that all has to do with whether or not the pandemic cooperates with us or not. I just want to thank all of you for your time and attention, and we'll speak to you next quarter."
}