{
    "symbol": "AWRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:45:30",
    "content": " In the third quarter, we delivered $3 million of revenue, $2.6 million of net income and negative $2.5 million of adjusted EBITDA loss. Nevertheless, despite significant headwinds and the strategic realignment in our sales team, we are very encouraged by our ability to continually increase our recurring revenue which has increased $0.3 million in comparison to the first 9 months of last year to $7.1 million year-to-date. Our third quarter of 2022 operating expenses decreased to $0.6 million from $5.8 million in Q3 of last year, largely as a result of the onetime $5.7 million gain from the sale of our Bedford Building, which was partially offset by higher sales and marketing spend as we revamped the revenue team and launched AwareID coupled with additional general and administrative costs related to our relocation and an increased bad debt reserve. Operating expenses for the 9 months ended September 30, 2022, which includes the impact of the onetime $5.7 million gain from the sale of our Bedford Building were $12.1 million compared to $17.4 million in the prior year period. Operating income for the third quarter of 2022 was $2.4 million, which includes the impact of the onetime $5.7 million gain from the sale of our Bedford building compared to an operating loss of negative $1.6 million in the same year ago period. For the third quarter of 2022, GAAP net income totaled $2.6 million or $0.12 per diluted share compared to GAAP net loss of negative $1.6 million or negative $0.07 per diluted share in the same year ago period. GAAP net income for the 9 months ended September 30, 2022, totaled $31,000 or $0.00 per diluted share compared to a GAAP net loss of negative $4.6 million or negative $0.21 per diluted share in the same year ago period. For the 9 months ended September 30, 2022, adjusted EBITDA loss totaled $3.9 million compared to an adjusted EBITDA loss of $3 million in the prior year period. Looking at our balance sheet, with $31 million in cash, cash equivalents and marketable securities at the end of the quarter compared to $25 million at the end of the prior quarter, the increase in cash, cash equivalents and marketable securities was due to proceeds from the building sale and partially offset by cash used in operating activities. Through the further development of a team dedicated to customer success, we're applying intentional focus on 2 critical areas: one, helping first-time users or those using authentication technologies in a new way, deploy faster and drive adoption sooner; and two, cultivating value-based relationships with existing customers to ensure their continued success and to drive expansion revenue."
}