{
    "symbol": "VEEE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 08:26:05",
    "content": " Your speakers for today's program is Joseph Visconti, Chairman of the Board and CEO of Twin Vee Powercats Co., and Carrie Gunnerson, CFO of Twin Vee Powercats Co. Before I turn the call over to Joseph, please remember that certain statements made during this investor call are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements on this call, other than statements of historical facts, including statements regarding the company's future operations and financial position, business strategy, and plans and objectives of management’s future operations, are forward-looking statements. In some cases, forward-looking statements can be identified by terminology such as believes, may, estimates, continue, anticipates, intends, should, plan, expect, predict, potential, or the negative of these terms, or rather the similar expressions. The company has based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe can affect its financial conditions, results of operations, business strategy, and financial needs. These forward-looking statements are subject to a number of risks and uncertainties and presumptions described, including those set forth in our filings with the Securities and Exchange Commission, which are available on our website at www.twinvee.com. I'm Joseph Visconti, the CEO of Twin Vee Powercats. Thank you and good afternoon, and I thank you for taking the time to participate in our Q1 2022 financial results call. Twin Vee Powercats manufacturers and sells a variety of catamaran sport boats here in our Fort Pierce, Florida factory. Our backlog of orders remains around 200 boats, and the stocking inventory of our dealers remains at low levels, under 20 boats as of this week. As previously discussed, we are currently manufacturing and selling our GFX model line of Twin Vees. With the addition of our new 400 GFX and 260 GFX, Twin Vee will have a total of eight GFX models available through our dealer network. Twin Vee’s GFX models include the 240 Center Console, two 24-foot Dual Consoles, 26 - our new 26’ Center, two 28’ Center Consoles, our 34’ Center Console, and our new 40-foot Center Console. Prices of our boats range from $120,000 for a 24’, to over $800,000 for a fully equipped 40-foot GFX. Our team members are being proactive, chasing down parts, opening new vendor relationships for components and materials, making sure that our assembly line continues to hum. I can report that other than a dozen boats requiring a 350-horsepower motor, we have successfully shipped all completed and finished boats. As you can see, even supply - even with the supply chain challenges, our revenues were still up 83% for the Q. The supply of 350 horsepower motors from Suzuki that powers our 34’ and our new 40-foot boats, unfortunately is not enough to fill the orders we currently have. To make up for any loss of revenue with the 34-foot, we have increased production of our smaller boats. As we increase our unit production and add new models to our lineup, the expansion of our national dealer footprint is vital. With that, I would like to mention a recent key hire to team Twin Vee. To help lead our sales and marketing expansion, we've hired Mr. John Planty to be Twin Vee's new National Sales Director. John will be working hand-in-hand with Lolli Ball, our in-house dealer liaison, who has single-handedly led the charge of developing our existing dealer network from the time I became involved with this company over six years ago. John Planty was the COO of Freeman Boatworks, one of the top and leading offshore catamaran boat builders. We are super excited to bring on new dealers and begin shipping our Twin Vees into new markets, such as the Great Lakes, the Ozarks, and along the northeast seaboard. Our initiative into sustainable marine technologies includes the design, development, and sale of fully integrated affordable electric boats for the masses. We see a path forward that includes a dedicated factory that is being designed to manufacture up to 1,000 units annually. in a parallel path, the FX1 Center Console boat has begun the tooling process. Our goal is by Q3 of 2022, Forza should have a completed FX1 Center Console boat, fully rigged, in the water, and starting final testing phase before production. As you recall, in January, we announced a major five-year supply agreement with Michigan-based ABS for production-grade 52-kilowatt high powered lithium-ion batteries that will be used for to power Forza FX1 electric boats. As lithium-ion battery supplies remain roadblocked, bottlenecked across the entire EV industry, we are not familiar with any other electric boat manufacturers that have contractually secured access to production-level quantities of high-powered lithium-ion batteries for their electric boats. We have built a tremendous team of in-house engineers, and our laser focus mission is to lead the transition of electrification in the recreational sport boat industry. Now, let me turn it over to our CFO, Carrie Gunnerson, who will now give a more detailed review of our financial results from Q1. Beginning with the income statement, our revenue for the quarter was up 83% or approximately $2,678,000 from $3,208,000 in 2021, to $5,886,000 in 2022. Our gross profit for the quarter was up 64% or approximately $946,000 from $1,488,000 in 2021, to $2,434,000 in 2022. Our net loss for the quarter was approximately $1,191,000, compared to net income of $132,000 in 2021. Forza’s portion of our net loss was approximately $514,000. The net loss from our core business, gas-powered boats, was approximately $626,000. Further, when we look into our adjusted net loss for the quarter, which excludes non-cash charges, our adjusted net loss for our core business, gas-powered boats, was only approximately $152,000. Our short-term goal of one boat a day, will increase our annual production to over 200 boats in 2022, which will add to our financial strength. Turning to the balance sheet, we had cash, cash equivalents, and marketable securities of approximately $11,039,000 as of March 31, 2022. In conclusion, I believe Twin Vee is coming off a very strong first quarter. In addition, we're working on expanding our dealer footprint to allow our products to reach new customers across this country. Based on all this forward moment, we remain confident in our ability to deliver value to our shareholders, and believe the remainder of 2022 and beyond will be an exciting time for Twin Vee Powercats and our stakeholders. We could not thrive without the many skilled and experienced men and women that come to work every day, build our beautiful boats, and push a marine electrification forward. And finally, I want to thank our shareholders for their support and everyone on the call today for their time and interest in Twin Vee Powercats. I think it's really taking shape, and there's a lot more kind of onesie, twosie catamaran boat builders that are appearing at these boat shows on national level. And I think that when you're talking about any producer that's building over 100 units annually, there's only a couple - well, there's two companies, World Cat and Twin Vee. Twin Vee will build over 200 units this year, and this is under the 40-foot segment. So, with our new 26’ coming online this year and our 40-foot, our largest boat, I think in our current backlog and the excitement, people learning about multi-haul and ride quality and fuel efficiency and all the great attributes that multi-haul boats offer, I think that we're going continue to grow. So, the good news is that the SEC gave us a no-comment letter about two weeks ago. But as far as going through the SEC and NASDAQ with our S1, that's - we’re ready to roadshow. So, I think the good news is that with these higher gas prices, we see electrification happening all over the world in many different industries. So, Twin Vee, as you saw, is well capitalized and continues to fund the progress forward for Forza. I just want to thank everyone for their time, and I want to thank all of Twin Vee, and everyone, have a great day."
}