{
    "symbol": "VEEE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-29 11:54:06",
    "content": " Before I turn the call over to Joseph, please remember that certain statements made during this investor call are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements on this call, other than statements of historical facts, including statements regarding the company's future operations and financial position, business strategy, and plans and objectives of management for future operations are forward-looking statements. In some cases, forward-looking statements can be identified by terminologies such as beliefs, may, estimate, continue, anticipate, intend, should, plan, expect, predict, potential or the negative of these terms or other similar expressions. The company has based these forward-looking statements largely on our current expectations and projections about future events and financial trends that believes may affect its financial condition, results of operations, business strategy and financial needs. These forward-looking statements are subject to a number of risks and uncertainties and assumptions described, including those set forth in our filings with the Securities and Exchange Commission, which are available on our website at ir.twinvee.com. Today, I'd like to update you all on the significant progress that we have made this year and our plan as we move forward in 2023. I will start by providing fourth quarter updates including product development, expansion plans, facility developments, and the financials of our company, and then we will conclude with the Q&A. As an overview of our business, the name Twin Vee has been synonymous with offshore catamaran boats for almost 30 years and is considered by many to be the best riding boats on the water. Under the brand name Twin Vee PowerCats, our company designs manufacturers themselves a variety of catamaran sport boats here in Fort Pierce, Florida. We currently offer gas-powered GFX and STX model lineup consisting of boats from 24-feet to 40-feet in length, and we currently employ approximately 170 people. 2022 was an exciting breakout year for our company, and Twin Vee was hitting on all cylinders. We designed and produced many new models, including our largest Twin Vee ever our 400 GFX. We spun out our electric division and took Forza XI public on NASDAQ, raising an additional $17 million where Twin Vee maintains almost a 70% ownership of Forza. We opened many new dealers, including one of the largest retail boat dealers in the United States, OneWater Marine. We designed tooled and launched a new monohull boat brand named LFG Marine, with a large initial order from one of the best and largest boat clubs in the United States. And we are 90% through the site plan approval for our 30,000 square foot expansion that will give us over 100,000 square feet of manufacturing space here in Fort Pierce. We added key hires and senior management roles such as boat production, LEAN manufacturing, environmental health and safety, and our marketing department. We're 90% completed with adding a comprehensive ERP system, which would be a vital piece of financial and control accountability software that will manage many aspects of our business, including build of material costing more -- better and more efficient ordering systems, restocking and inventory controls that adds to the better margins and more efficient accounting and tracking. The current economy and steadily increasing interest rates have slowed the demand for most recreational based products, including ours. Number one, at peak demand over a year ago, the Twin Vee dealer network had less than 10 units in field inventory. Today we have approximately 80 units in the field, but we also have over 30 locations, plus-plus, as we continue to open new dealers. The 80 units is a manageable number and the most units that any dealer has on a single lot is seven units, which is not considered a lot for boat inventory for a boat dealer. While we find new avenues to increase revenue through new Twin Vee models and the launch of our new LFG brand, our goal is to keep our top line revenue strong while managing that field inventory. In addition to our current GFX model lineup, we've added three additional models named the STX for Sport Tournament. We are also currently working on a brand new 28-foot dual console boat, which will help us really broaden our customer base and compete in a segment that's pretty much dominated by a single competitor. LFG Marine is a bold new stylized monohull brand design to energize recreational boating with a unique, fresh and versatile boat models. Our goal is that we are starting with a 22-foot center console, and we will grow this brand and model lineup from 22, 24, 26, 28, 30, both in the center console and the dual console, and walk it and walk it up as the market permits. And it originated request from a boat club and these boat clubs buy these kind of lower price single engine boats in the ROI with rental rates usage, low maintenance, brand value, and the ability to resell the vessels to club members after a year or rental use. After the first LFG monohull was produced, we had the opportunity to showcase that first boat at several events where the boat performed incredibly. On a single weekend with our first 22 being showcased at this event, our sales team sold over 50 LFG boats, a 50 boat order just over that weekend. This boat was designed by our in-house Chief Marine Architect named Greg McLogan and Jim Leffew, who you know, who's the President and the CEO of Forza, who previously was the head of manufacturing for Maverick Boat Group. And of course, the rest of our team, including our Vice President, Preston Yarborough, were instrumental in getting this new 22 LFG from an idea to a boat in the water in less than three months. I mean, this is just like incredible that we worked that efficiently and effectively to get that product into the marketplace. We are currently developing several additional models under the LFG Marine name, 22 Dual Console, which should be in production by April 15th in a couple of weeks. We are also increasing the reach of our brand by working with new outboard motor companies, increasing our Twin Vee brand by working with new outboard motor brands. Our boats historically have utilized Suzuki outboard motors in the past and however, we've worked hard to become an OEM for Mercury and Yamaha. It was quite a process, but this achievement allows Twin Vee and LFG Marine to Hanks, Zuki, Yamaha and Mercury Motors. To support our sales and marketing team, Twin Vee launched its new website, which you can see at twinvee.com. So, this new website enhances the boat buying experience for Twin Vee customers and dealers. During the redesign, we wanted to craft an upgraded online experience offering customers engaging and easily digestible content about the boat we manufacture and providing interactive features to enrich the boat buying process. We are also progressing on a 30,000 foot extension at our Twin Vee facility here in Fort Pierce. The extension structure will connect the back and the front buildings, which will give us, like I mentioned, a 100,000 square feet when it's complete. We believe that this additional will help us go from 220 units, which we're currently manufacturing up to possibly 600 units out of this existing facility with this 30,000 foot extension. So, our net revenue for the year end of December 31st was up 103% to $31,988,000. Our gross profits for the year 2022 were up 70% to $10,657,000. Our cycle count adjustment for the year was 1,460,000 compared to 609,000 in the prior year. During the year, we discontinued our classic line of boats and we are working on structuring bills of material for new models. This coupled with us purging a lot of inventory for our new ERP system, which is coming online, resulted for this large inventory write-down. Our operating expenses for the year ending December 31st, 2022 increased approximately $8,772,000 to $16,679,000 compared to almost $8 million in 2021. Our operating expenses as a percent of sales for the year were 52% compared to 50% for the year ended December 31st, 2021. However, if we look at just gas-powered boat segment, our operating expenses as a percent of sales for the year were 41% compared to 47% in 2021. So, we're pleased with this improvement at a 6% year-over-year. Forza our electric boat segment, the loss was of the $5.7 million, the Forza loss was $3.5 million. Further, when we look at our adjusted net income for the year, which excluded non-cash charges, our adjusted net loss for our core business gas-powered boats was approximately $135,000, and our EBITDA was about $21,000. Our net loss is a reflection of the investment the company continues to make in our electric boat division Forza XI, as well as our continued investment in gas-powered boats, including the all new LFG Marine brand. We had cash and cash equivalents of marketable securities approximately $26,429,000 as of December 31st, 2022. Our inventory value, December 31st, 2022 is approximately $4 million compared to $1.8 million in the prior year. I can get into why that happened, but post-pandemic supply chain over ordering, trying to maintain units, kind of diversifying out into multiple different vendors, it was tough to get parts. So, as we sit now, our stocks -- our shelves are stocked, but we'll work hard to reduce that inventory over the coming months. On December 5th, 2022, we merged with Twin Vee PowerCats, the parent company. We picked up approximately a $7 million NOL with that merger, as we move into an income position. Have a similar question just about the expected cash burn going forward, first of all. So, we are not burning cash on Twin Vee. So, everything that we're doing on Twin Vee including development of new models, launching LFG Marine, tooling the 28 dual console, we are not burning cash. I mean -- so we're not showing a large profit and we're showing a loss, with depreciation and amortization, but Twin Vee is not burning cash. Like, so, you're trying to bring these motor companies and there were times that boats are sitting and quality control waiting for the motor to show up and motors were getting drop shipped. And it got to the point that we just -- we're trying to over-order motors because of, keeping the boats leaving on a regular basis. So, when the supply chain kind of started fixing itself and you have multiple parallel paths, you got the supply chain working itself out, you got rising interest rates, you got a slowing of the economy and now these manufacturers for components and motors and composites and everything else are all kind of getting online and getting back caught up. So, now instead of them parsing out, smaller percentages to each one of their vendors, they're fulfilling large orders. So, our inventory grew from less than $2 million to $4 million in a matter of like three months. So, we've been meeting daily to reduce the inventory and I think you're going to start to see that inventory number come back down over the next couple of months. So, we sit down once a year with every dealer or a dealer that comes online and we ask them for a forecasted amount of boats. Like, a year and a half ago we had almost probably a two year backlog. I mean, I could get a call tomorrow and a dealer could say, I'm not taking any more boats. And I can get a call tomorrow and have a dealer say, I need 20 more boats. So, it's not as predictable as it was a year ago. We're pulling every lever possible from sales incentives to broker competitions, to increased boat shows. We had five boats there with all pop-ups, full staff, all dressed really nicely, and our sales and marketing department is killing it. And if you go and look at Twin Vee, we're down about 20%. So, we're -- I feel like we're doing everything right. The larger boats are still selling briskly, so, we're focusing on our 34s and our 40s right now to maintain those top line numbers. But on the other hand, if the stock was going to get pushed way down below a dollar, I'd rather have that stock come back into treasury when we have almost $1.20 in cash on the books. So, obviously, they're a separate company in a sense now. So, we are still filing consolidated financial, because Twin Vee is almost a 70% owner of the company. And so, like we spoke yesterday, I'd like to kind of keep the questions on Twin Vee because we had the Forza call, but like we spoke a couple days ago, Forza's runway is 18 months based on our current cap position at Forza. At this point, I'd like to turn the call back over to Joseph Visconti for closing comments. And we've been working extremely hard to maintain our growth through various avenues, new models, new products, a new brand. We are having a owner's appreciation day, and a sales event over the next month. So, we have every investor, but if you do not, please send your email to Glenn, glenn@twinvee.com, and we will make sure that you get an invite for this really special event that we're going to have for our stakeholders, shareholders, and dealers."
}