{
    "symbol": "MNSO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-14 14:24:02",
    "content": " We continue to focus on driving the strong recovery of our overseas business, which has recorded 50% year-on-year revenue growth for two consecutive quarters and now accounts for 33% of our total revenue. Our directly operated overseas business turned profitable during the quarter as we continue to unleash operating leverage, combined with our continued progress in cost cutting, this helped us increase our adjusted net profit by 127% year-on-year to RMB 417 million in the September quarter. Revenue from MINISO China's offline business was RMB 1.54 billion, which represents a 9% year-on-year decrease, but a 20% quarter-over-quarter increase. We are delighted to see that overseas markets sustained good recovery momentum during the September quarter, with overall sales increasing by 41% year-on-year and nearly recovering to the 2019 recovery level for two consecutive quarters. Asian countries, which accounts for about 50% of our overseas stores and 30% of sales increased by 70% year-on-year, representing 65% of the level from the same period in 2019. Oceania, which accounts for 2% of both of our overseas stores and sales, saw year-on-year growth of more than 3 times, recovering to nearly 80% of the level from the same period in 2019. Revenue in September quarter reached RMB 2.77 billion, increasing by 5% year-on-year, primarily due to a 48% growth of our revenue from overseas market and partly offset by a 9% decrease of revenue from China. The year-on-year increase was primarily due to three reasons: Number one, the shift of revenue mix, revenue contribution from overseas market, which typically has higher gross margin than domestic operations increased to 33% from 24% a year ago. And second is that as we have open approaching the holiday season of overseas market, as I just mentioned, it's -- gross margin is relatively high, and we expect that its sales contribution in December quarter will still maintain above 30% or higher, and that will help increase the overall gross margin."
}