{
    "symbol": "MAIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 13:48:05",
    "content": " While our lower middle-market investments of $32 million in the quarter were offset by several repayments, resulting in a net decrease in our lower middle-market investments on a cost basis of $5 million for the quarter, we are very pleased that since quarter end, we have already executed over $85 million of follow-on investments in existing lower middle-market portfolio companies. Based upon our results for the second quarter and the positive performance of our existing portfolio of companies, combined with our favorable outlook in each of our primary investment strategies and for our asset management business and the benefits of our efficient operating structure, earlier this week, our Board declared a supplemental dividend of $0.10 per share payable in September and an increase in monthly dividends for the fourth quarter of 2022 to $0.22 per share payable in each of October, November and December. This quarter, due to the strong continued operating performance of our lower middle-market portfolio of companies, our lower middle-market equity investments experienced significant pretax net unrealized appreciation of over $25 million to partially offset an overall net decline in our debt investment valuations primarily in our private loan and middle-market portfolios, which were predominantly driven by increases in market spreads. Our investment activity in the second quarter included total investments in our lower middle-market portfolio of $32 million, which after aggregate repayments on debt investments and return of invested equity capital resulted in a net decrease in our lower middle-market portfolio of approximately $5 million on a cost basis. As Dwayne and David both mentioned, our lower middle-market equity portfolio offset a large part of the depreciation recorded in the quarter, recognizing unrealized appreciation of $25.2 million as a result of the continued strong performance of these portfolio of companies. As a result of the net unrealized depreciation and net realized loss recorded in the quarter, partially offset by the increased net investment income, net asset value or NAV decreased by $8.5 million or $0.52 per share during the quarter to end the second quarter with NAV at $25.37 per share."
}