{
    "symbol": "MAIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 13:36:03",
    "content": " Based upon our results for the third quarter, combined with our favorable outlook in each of our primary investment strategies and for our asset management business and the benefits of our efficient operating structure, earlier this week, our Board declared a supplemental dividend of $0.10 per share payable in December and an increase in monthly dividends for the first quarter of 2023 to $0.225 per share payable in each of January, February and March. Our investment activity in the third quarter included total investments in our lower middle market portfolio of $112 million, which after aggregate repayments on debt investments and return of invested equity capital resulted in a net increase in our lower middle market portfolio of approximately $85 million on a cost basis. Driven by the capabilities and relationships of our private credit team, we completed approximately $234 million in total private loan portfolio investments during the quarter which after aggregate repayments of debt resulted in a net increase in our private loan portfolio of approximately $174 million. At quarter end, our lower middle market portfolio included investments in 75 companies representing $1.9 billion of fair value, which is about 20% above our cost basis. Interest income increased by $24.6 million from a year ago and $11 million over the second quarter, which was a direct result of the continued growth in our portfolio of debt investments and the impact of higher market index interest rates on our floating rate debt investments. Further supporting the overall strength of our third quarter results, the combined impact of certain income items including dividends, accelerated OID and prepayment fees that are considered less consistent or non-recurring in the quarter decreased by $8 million or about $0.12 per share when compared to a year ago and was $3.9 million or $0.06 per share below the average of the prior four quarters. As a result, in this rising interest rate environment, our third quarter operating results included an estimated net benefit of $5 million or $0.07 per share to our net investment income when compared to a year ago and to the second quarter. Finally, as we look forward, given the strength of our underlying portfolio and the investment environment thus far in 2022, we expect another strong top line and earnings quarter in the fourth quarter with expected DNII per share in excess of $0.90, with the opportunity to meaningfully exceed this level based upon the amount of dividend income and portfolio investment activities during the quarter."
}