{
    "symbol": "SAR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-07 13:01:03",
    "content": " Our NAV per share this quarter were flat year-over-year decreased by 2.2% from Q4 to $28.69, which net of core portfolio valuation changes primarily reflects the volatility being experienced in the broadly syndicated CLO loan market. Generating a 6.9% on a trailing 12-month basis, despite recognizing an $8.6 million unrealized depreciation reflecting broadly syndicated loan market volatility in the CLO and JV, and registering a gross unlevered IRR of 12% on our total unrealized portfolio, with our current fair value 1.4% above the total cost of our portfolio, and a gross unlevered IRR of 16.3% on total realizations of $769 million. Second, our assets under management increased significantly to $895 million this quarter, a 9% increase from $818 million as of last quarter, and a 32% increase from $678 million, as of the same time last year. Our quarter end regulatory leverage of 179% substantially exceeded our 150% requirement and does not yet include the pending repayment next week of our $43 million SAK baby bond that has been called, and will reduce our non-SBIC debt to $393 million, while also reducing our cost of capital. We had $171 million of liquidity at quarter end available to support our portfolio companies, with $44 million of the total dedicated to new and follow-on opportunities in our SBIC II fund and $58 million cash, net of the upcoming SAK notes repayment that would be fully accretive to earnings when deployed. For this first quarter, we also experienced a net loss on investments of $9.5 million or $0.78 per weighted average share, resulting in a total decrease in net assets from operations of $1.5 million or $0.12 per share. The $9.3 million net unrealized depreciation primarily reflects, first, the $3.2 million and $5.4 million unrealized depreciation on the company's CLO and JV equity investments, respectively, resulting from the volatility and the broadly syndicated loan market as of quarter end, and second, the $5.0 million unrealized depreciation on the company's Pepper Palace investments, primarily due to company performance. Starting at the top, adjusted NII per share remained the same at $0.53 per share, a $0.17 increase in non-CLO net interest income from the partial impact of higher AUM was offset by a $0.11 decrease in other income due to lower structuring and prepayment fees as compared to last quarter and a $0.06 increase in base management fees. This quarter end level of available liquidity when adjusted for the repayment of our SAK baby bond that has already been called allows us to grow our assets by an additional 14% without the need for external financing, with $58 million of pro forma quarter end cash available and that's fully accretive to NII when deployed and $44 million of available SBA debentures with its low cost pricing, also very accretive. A new yellow investment this quarter is Pepper Palace, which has been moved to yellow with recognition this quarter of unrealized appreciation of $5 million on our first-lien term loan and preferred equity investments. Now excluding the Pepper Palace markdown, the remaining core non-CLO BDC portfolio had total unrealized appreciation of $4.3 million this quarter and total portfolio fair value is still 1.4% above total cost. Our differentiating characteristics include maintaining one of the highest levels of management ownership in the industry at 14, access to low cost and long term liquidity with which to support our portfolio and make accretive investments, recently increased with our new baby bond issued this quarter, a BBB plus investment grade rating and active public and private bond issuances, solid historic earnings per share and NII yield, strong and industry leading historic and long term ROE accompanied by growing NAV and NAV per share, putting for the top of the industry for both long term, high quality expansion of AUM and an attractive risk profile."
}