{
    "symbol": "CLPS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-04 13:44:04",
    "content": " All such statements attributable to us are expressly qualified in their entirety with this cautionary notice, including, without limitation, those risks and uncertainties related to the company’s financial and operational performance in the first half of fiscal 2022 and its expectations of the company’s future performance, its preliminary outlook and guidance offered in this presentation, the company's future -- as well as the risks and uncertainties described in the company’s most recently filed SEC reports and filings. In the first half of fiscal 2022, our revenues increased by $17.6 million or 30.2% to $75.9 million from $58.3 million. As for operating expenses, savings and marketing expenses increased 27.3% to $2.3 million from $1.8 million due to the increase of salary expenses as new staff were hired to improve the company's capability of service delivery to meet client demand. After excluding the impact of non-cash share-based compensation expenses, non-GAAP net income increased 39.1% to $8.9 million from $6.4 million. After excluding the impact of non-controlling interest, net income attributable to CLPS Incorporation shareholders was $6.3 million or $0.31 basic and diluted earnings per share compared to $4.9 million or $0.3 basic and diluted earnings per share in the prior year period. After excluding the impact of non-cash share-based compensation expenses, non-GAAP net income attributable to CLPS Incorporation shareholders was $8.7 million or $0.43 basic and diluted earnings per share. In addition, our goal for this year of 2022 is to attract more clients and create more business opportunity in the U.S. About the second question regarding the increase in G&A expense, since we hired new staff and strategies to further drive our business, the salary expense increased and also the share-based compensation also increased during this period as well as the year-on-year salary expense we paid to our staff."
}