{
    "symbol": "MTBC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 07:47:03",
    "content": " To start with some highlights of the quarter, annualized recurring bookings of the new contracts of $5.5 million, excluding onetime fees were the highest in the history of the company, almost double what we signed last year and compares to $1.6 million in the first quarter of 2022. Additionally, nonrecurring professional services bookings of $6.7 million increased more than 3 times that of second quarter of 2021, due largely to the acquisition of medSR that was completed late in the second quarter of last year. Okay, I got it. Okay, I got it. On your first question, if I just take as an example, if I talk about it, before the acquisition or before we acquired medSR, an year before the acquisition, their RCM-related revenue was, let's say, about $1 million recurring -- $1 million roughly revenue. And I think the really key question here is, what should we think that normalized churn is because as you talked -- I mean, if you did $5.5 million of bookings, if we think about that, if that's like $22 million a year, and let's say, you recognize half of that as revenue, $11 million and you divide that by like around $140 million of revenue, that's like 7% organic growth, but you haven't -- but that's before churn. So with this Wellness solution and the remote patient monitoring solution, first of all with that $5.5 million in bookings, over what time period is that going to get recognized, is that like -- can we think about that on an annual basis? For Wellness, though, we do not have much data with us right now because it's just hardly three months we are into this, but we already have made alive the clients who would generate about close to $600,000 plus in annualized recurring revenue out of one third of the bookings that we had in the last year -- I'm sorry, the last quarter. Great, thanks very much. Great, thanks very much. So I think the way I would look at it is, if we are able to hit that $5.5 million, $5.7 million in the annualized recurring revenue closing or the bookings for the quarter, the record quarter, and we believe that the third quarter based on the visibility that we have, we have good reasons to believe that third quarter is going to be either same or better than the second quarter."
}