{
    "symbol": "GLOB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 21:30:02",
    "content": "  Arturo Langa: Good day, and welcome to Globant's Third Quarter 2022 Earnings Conference Call. I'm Arturo Langa, Investor Relations Officer at Globant. If you have not, a copy is available on our website, investors.globant.com. Our speakers today are Martin Migoya, Co-Founder and Chief Executive Officer; Juan Urthiague, Chief Financial Officer; Patricia Pomies, Chief Operating Officer; and Diego Tartara Global Chief Technology Officer. Before we begin, I would like to remind you that some of the comments on our call today may be deemed forward-looking statements. During our call today, we will report non-IFRS or adjusted measures, which is how we track performance internally and the easiest way to compare Globant to our peers in the industry. I'd now like to turn the call over to Martin Migoya, our CEO. But first, let's begin with the financial results. In Q3, Globant brought in $458.9 million in revenue. We are delivering strong revenue growth, robust profitability and generating healthy free cash flow. Our end-to-end capabilities help them deliver innovative experiences for their customers, leading to better top line performance and stronger returns. As we look forward, we do anticipate some challenges caused by macroeconomic and geopolitical uncertainty affecting the global economy. In today's complex operating environment, we see a greater emphasis on high return on investment spending. According to Garner, 69% of CFOs aimed to increase their digital technology spending to be more efficient and resilient. Moving forward, we will be investing in our people, new markets, our brand and growth areas. We will keep growing, and our fundamentals remain strong. We also have a solid pipeline of projects in the near future, and we have become leaders in growth markets such as media, entertainment, health care and life sciences. Also, Frost & Sullivan recognized Globant as the Company of the Year for 2022 in the global digital transformation services industry. They credited this recognition to our unique studio model, the innovation hub of Globant X and our autonomous culture. Globant now has over 26,000 employees present in more than 20 countries. As we continue to execute on our main growth pillars, we deliver a deeper and broader array of services and products. As a new step in this endeavor, today, we have announced the acquisition of eWave iWeb. Born in Australia, eWave, is a digital commerce experience consultancy. They have offices in Australia, Hong Kong and Singapore, and they have delivery presence in 7 countries in the region. They implement end-to-end digital commerce transformations in many industries and service areas, including CX design, platform engineering, optimization and growth. Finally, we see eWave's passion for digital transformation and its culture with a global mindset as a great fit for our team. This quarter, we expanded our presence in Italy through our acquisition of Sysdata. Sysdata provides advisory capabilities and services to blue-chip companies in data analytics, business intelligence, mobile apps and other fields. They continue growing, evolving and adapting to the latest technology trends and market needs. In today's environment, companies need to accelerate their digitalization especially in the areas of cost optimization and process efficiency. This cluster we consolidate our alliance and efforts with Salesforce, SAP and Oracle. As you may remember, last August, we launched the Fast Code studio upon the incorporation of GeneXus. With the recent release of GeneXus 18, we now have the first enterprise-grade platform for low code development of native super and mini apps. We have trained over 5,000 Globers in relevant specialties of the space, including UX and business analysis. We are seeing growth in our visual testing platform, magnify. The Software-as-a-Service version of the product was launched in October, and we will expand the features in the months to come. Our platform, Augoor, which accelerates the way to create code also continues to grow. After a year of implementing this tool at Globant, software development has become faster and more efficient. After the exceptional digital adoption after the 2020 pandemic, we have seen the growing need for this transformation. In Q3, we scored major goals in turning this vision to life, landing some exciting new projects. In late September, my team and I went to Spain to publicly announce our joint venture with La Liga, Spain's top Soccer League and one of the largest in the world. Together, we will leverage Globant's experience in delivering industry transformation with La Liga's expertise in global sporting events. We're creating a new global technology company that will deliver digital reinventions to sport organizations by leveraging Web 3.0 technologies meters and gaming capabilities, among other fields. three weeks later, we announced a multiyear partnership with FIFA to become the global platform supporter of FIFA Plus, their signature content up. In addition to these exciting new projects, I'm happy to see Globant's vision of tech trends and our society share with our audiences. This year, we focus on the issue of reinventing connections to go over how technology is changing the way our society interacts. We had a great conversation about the future of technology, the constant pursuit of perfection and Disney's reinvention. Some of my colleagues had similar talks with thought leaders, including Ariana Huffington, Carli Claus and Refik Anadol. Closing out, I continue to believe that we are among the most dynamic innovative, talented and diverse organizations in the world. We're constantly reinventing the way we offer our services and products, also how we structure our teams to take advantage of every opportunity. It is a pleasure to work with our lovers, who broaden the horizon of digital transformation every day. As Martin mentioned, they will become part of the enterprise platform studio cluster together with sales force and process optimization studios. This cluster will help current and prospective clients increase productivity, reduce costs and maximize their business results. Our Healthcare and Life Sciences rementioned Studio is capitalizing on opportunities of each sector, now that technology and life sciences are completely intertwined. We're helping them to develop a virtual contact platform that expand the reach of doctors who today are not accessible due to geography, relocation of resources, among other reasons. In September, Quadrant Knowledge Solutions named Globant an industry leader in 2022 Park matrix for health care IT services. In Financial Services, business ecosystems are notoriously complex and undergoing a transformation through technology. This team is leading business transformation and advanced analytics with proprietary models, helping clients to optimize the use of their data and adapting their management models quickly. This studio is currently working with a top 10 European bank that offers a full range of financial services for 15 million individual customers, and for about 500,000 companies in several European countries. Through AI technology and advanced analytics, we are assisting reinventing these clients' credit and lending decisions, an issue of additional importance during times of higher interest rates and market volatility. This quarter, the studio performed a research initiative for Inmarsat, the world leader in satellite communications to explore the positive impact of the space technology towards the net 0 emissions goal. As leaders in technology, we recognize our own company can have multiplayer effect in the global effort to help the planet. Just as we had our entire company training both AI and blockchain in recent years, regardless of their focus area, they now will be encouraged to design and develop digital solutions according to low-carbon tools, processes and best practices. Sustainable coding practices for WebUX, mobile and back-end specialists and best practices to efficiently create a managed data and optimize cloud infrastructure in terms both of cost and energy consumption. By doing this, FIFA will be able to exponentially increase the viewership of its official content while allowing fans to share their preferred content with friends and family on bigger screens. As you heard earlier, we were selected as the official digital transformation partner of the Intuit Dome, the new home of the LA Clippers. When completed in 2024, it is expected to be one of the most technologically advanced smart venues in the world. We will apply our most disruptive technologies to bring to life a new user experience that includes seamless ticketing, personalized loyalty programs, touch and go payments point of sales among other features. Also in North America, known as partnering with Amazon Web Services to enable a large-scale cloud transformation for Stryker, one of the world's leading medical technology company. We are working on voice communication services for their nearly 2,000 institutions, which include hospitals and health care facilities throughout the world. In Latin America, we're working with Grupo Riquelme, a multinational retailer with operations in that region to carry out a major expansion plan. Our joint work includes a brand-new IT strategy, an organizational group led several quick win business cases and a road map that will help Grupo Riquelme transform their IT to support their business ambition. In Mexico, we're working with a leading retailer. This has enormous multiplayer potential in Mexico, where 60% of the population remains unmanned. Globant carefully designed workflows to meet the goal of creating a banking interface that offers the best user experience, understanding that many of the users will be using such technology for the first time. Within the first month, more than 5,000 digital accounts were opened and the growth has been exponential. By the end of the fourth month, 180,000 monetary transactions were carried out. Today, the one that is used by almost four million people. In 2019, Nissan chose Globant as partner to support its global customer experience vision based in London. Today, our teams work together in Europe and the Americas in support of the Nissan Ambition 2030 aimed to empower mobility and beyond for a cleaner, safer and more inclusive world. We're also working with them to reinvent the customer experience of buying a new car, enable them with technology to improve and add new touch points. In October, we hosted the global Nissan Customer Experience Summit, are our new flagship office in London. The LTC company continues to be our largest client, growing by 25% year-over-year and 8.6% quarter-over-quarter. Over the last 12 months, we have 13 accounts that brought in more than $20 million of revenue compared to $11 million from the same period the year before. Regarding our geographical distribution of our revenues, in Q3, 64.9% of revenue came from North America, 21.9% from Latin America, 10% from EMEA and 3.2% from Asia and Oceania. While fully committed to building relationships with new clients, we also see a strategic value in accessing the networks of our current clients as an effective way to grow. Over the last 12 months ending in Q3, Globant show a Net Promoter Score of 74. On a general basis, the Net Promoter Score is consistently above 75 and well above the industry benchmark of 41. Moving forward, we will continue to strengthen and foster our corporate culture of putting people first with an emphasis on kindness. In July, we surveyed our Globers in a periodic engagement pulse, over 80% responded that they were feeling really well physically mentally and emotionally. However, it also speak to the importance of talent as a strategic asset for Globant. In Latin America, home to 74.6% of our Globers, we recently received several recognitions. In Mexico, force rank us among the top 10 best employers in the country. Employers for youth recognized Globant among the best employers in Costa Rica, Peru, Brazil and Chile and number one in Ecuador. Over 6,000 Globers have applied to find new opportunities within the company. Additionally, Globant University is constantly growing to provide upskilling and career-long learning. During Q3, we launched an AI engine on our digital campus to intuitively suggest new content every day to our Globers and the social learning forum to boost educational exchange. And now to the pillars of our Big kind initiative, which continues to drive Globant's relationship with all of its communities. As I mentioned during the last earnings call, we mean that Bill awards Globant's recognition to support and promote the development of talented women leaders in technology is back for a third edition. More than 1,200 women from 50 countries were nominated in our five categories, Board Executive, Digital Leader, Tech Entrepreneur, Rising Star and Techfluenzer. The start-ups mission is to upgrade how people support and oppose opinion leaders, disrupting the echo chambers cultivated by traditional social media platforms by automatically showing as different viewpoints of their leaders opinion and financially rewarding the tractors who engage in a smart and civilize debate. As the funds mission continues and its network grows, we are happy to have more institutions joining forces with us. Their aim is to encourage them to develop ventures that tackle issues such as AI buyers, online harassment and abuse and polarization. This scholarship includes access to talks, booth cans and global courses to boost employability. In Colombia, currently Globant's largest talent market with nearly 5,700 Globers, we launched a special edition of this program called  in collaboration with the Bogota City government. Before the end of the year, aligned with our public commitment of granting 15,000 coding future scholarship by 2025, we will be offering at least grants for an 8-month training process to people from Latin America, 50% will be offered to women. In October, Fortune magazine included Globant for the first time among the top 50 companies with ideas that are changing the world due to the profound social impact of the Coding Future program. We managed to post another quarter of strong growth, profitability and cash generation. Also, we want to thank each and every one of our clients for the trust placed in Globant. On a sequential basis, our revenues for the third quarter of this year increased 6.9% and Q3 revenue growth was 36.7% year-over-year in constant currency, 2.5 percentage points above our headline figure. Inorganic contribution to growth, stood at three percentage points in the quarter. However, we continue to see our long-term growth drivers as unchanged, and we continue to believe that we are in the early stages of a multiyear secular growth trend. Under the current environment, we see a greater potential for our service offering because it is expensive and adaptable to client needs. Also, our focus on robust delivery and client satisfaction coupled with a global and diversified delivery model are all factors while our clients continues to choose to work with us. Our adjusted gross profit for the period increased to $179.6 million, representing a 39.1% adjusted gross margin unchanged quarter-over-quarter. As we manage both the demand and supply of the equation, FX hedges, wages and pricing, we target to deliver to our clients high value add and to our shareholders and stakeholders above industry average growth. Adjusted operating income for the quarter amounted to $73.7 million or 16.1% of revenues, flat quarter-over-quarter. Adjusted operating margin for the first 9 months of 2022 stood at 16.3%, relatively unchanged on an annual basis. After nearly tripling the company's revenues since year-end 2019, we have also managed to preserve profitability levels. We are excited in terms of building a warm famous brand executing on our 100 square strategy, enhancing our global delivery and our studio model and reinventing the industry through Globant X. Regarding below-the-line items, our IFRS effective tax rate for the quarter was 21.9%, largely in line with our guidance. Adjusted net income for the third quarter of the year totaled $54.7 million, representing 11.9% adjusted net income margin. Adjusted diluted EPS for this quarter was $1.27 based on 42.9 million average diluted shares for the quarter, $0.03 above our quarterly guidance of $1.24 per share. Our cash and cash equivalents and short-term investments as of September 30, 2022, amounted to $369.2 million. Currently, our credit facility of $350 million is fully undrawn. We continue to carry a net cash position in our balance sheet, which, coupled with our organic operating cash flow generation should provide ample and attractive funding to support our organic and inorganic growth strategies in the short term. Cash flow from operations for the Q3 2022 was $76 million, while capital expenditures in the quarter amounted to $30.1 million. From a free cash flow perspective, we generated $45.9 million, representing 84.1% of our adjusted net income for the quarter. At the end of Q3, DSO was 76 days, in line with the same quarter one year ago. All in, third quarter 2022 reflects the outsized growth and above average profitability of our company, a solid free cash flow generation continuing our commitment to deliver value to all our shareholders and key stakeholders. Despite the current macro uncertainties, we continue to be positive about the growth opportunity for Globant and our industry. Based on current visibility, we are increasing our full year guidance to $1.778 million or 37.1% year-over-year growth. Adjusted diluted EPS for the year is also increased, and it is now expected to be $5.06, assuming 42.8 million average diluted shares for the year and implying an adjusted EPS for Q4 of $1.38, assuming 43 million average diluted shares outstanding for the quarter. Thanks, everyone, for participating in the call, for your coverage and support. So with that in mind, I'd like to take the first question from our audience from Tien-Tsin Huang from JPMorgan. So the fourth quarter outlook was encouraging, nice sequential growth. Over the last couple of months, as you know, we have closed the acquisition of  and the acquisition of eWave. At the same time, we continue to expand organically our business around the world. And as you know, we updated our guidance both for the full year and for the fourth quarter. But overall, we continue to see growth ahead of us, and the Q4 guidance, I think, is pretty much it's a very solid number. But looking at clients two through five or two through 10 in general, any surprises there. You see actually two particular customers that, in one case, it's in the travel sector and the other one is in the financial sector, both of them in Latin America. In the case of the travel company, it's a very big project that we have been working for the last three, four years and expanding that relationship significantly. And while we continue to work with them on finding new investment ideas and new opportunities, the level of growth in that account came down a little bit. And the other one is, again, a financial institution in Latin America. All the rest of the customers in the top 10 have grown in line with the company and Disney, as you said. And as you can see in the numbers, had a very good quarter, something that we also, by the way, anticipated back in August when we had our previous quarter. No, it's all encouraging for that on that side. I mean obviously, the other factors that come in play with headcount include attrition and utilization. The level of hirings and the level of net additions is always a combination between higher attrition, utilization levels. What we have been doing, as we also anticipated in the last quarter was working on the utilization number, which went up more than two percentage points during this quarter, working also on the attrition level that came down from 19.9% to 18.5%. We still believe that attrition numbers can come down, and we will continue to monitor all the macroeconomic variables and how our customers continue to perform and be flexible and ready to accelerate hiring as soon as we have more clarity into the future. And then the other question was with regards to the new studio announcement, the Oracle SAP. Look, this is something that our customers are requesting to us. They love the way we work, when they love the way we do things, the way we in some way, we integrate our teams and how it's our culture. When you start working on the front end, then you need to work on the back end to be able to connect that from them with that back end. But then suddenly, the guys doing the back and say, \"Oh, wow, we are seeing like a new way of doing things, and we want more of this.\" And I think this is what is happening on client after another, and that is yielding to a new way of doing things that normally were doing -- were done in a different way. I think clients are pushing us more than us pursuing that in a in a proactive way, but we are very happy with what's going on. Platforms have become very robust, but also they allow you to go beyond what they used to. So nowadays, you have platform accelerators are great in terms of achieving great time to value, but also allowing companies such as loan, which specializes on implementations to create amazing experiences, and that's how we're aligning and partnering with these platforms on every specific sector. Just as an example of that, eWave got us a great amount of expertise within the Salesforce cloud commerce sector, as an example, reinforcing our expertise and knowledge. So this is -- again, I think what brings to loan here is more end-to-end capabilities, but always conserving the DNA of loan, which is reinventing industries, creating the best experiences connecting with clients. Do you have any preliminary kind of comments on how -- what should we expect from Disney in calendar I'm assuming you're having some discussions with the various units that you're dealing with, but any color here could be helpful. We believe and we are positive about the long-term relationship we have with them, and we see the relationship growing and we are ranked on the top of the partners that they have. So we feel that the relationship will keep on expanding in different areas, in different places. On the other side, on the direct-to-consumer the things are also very healthy in terms of amount of new things that are happening there. So overall, I believe that next year will be a positive year for Disney, too, and next quarter, of course. If you look at our growth with this in this quarter was very solid, 25% year-over-year. So all the rest of our customers, the level of growth was also very solid. So we go to top 10 accounts or just account for 34% of our revenues right now, coming down from almost 40% a year ago. So the point I'm trying to make here is that sometimes growth may be driven by some of the top accounts, including Disney. Other times, we have a great portfolio of customers that are maybe in the 11 to 40, 11 to 50, that also can contribute to that growth. The fact that now top 10 is a smaller number, also gives us the flexibility to grow in multiple parts of the organization. And I think that the fact that, for example, of our revenues is coming from public companies is also something that, in a way, it creates a great opportunity for us to keep expanding and growing our business. Just as a follow-up, Martin, at the beginning of your introduction, you spoke about some companies starting to focus more on return on investment or ROI. And is that -- and some of your peers are also talking about the fact that some of their clients kind of moving are moving away maybe from a growth mode, more focus on costs and ROI. I believe -- that focus is because we can provide at the same time, like an increase on the revenue and a lot of efficiencies when you talk about costs. And now we have a very efficient model of delivering technology from many different places in the world, but not just that, but also we have tools like Magnify or Augoor or all the -- or GeneXus to accelerate and put like very good multipliers in terms of efficiency to the same teams producing what we develop. It's not just about creating more revenue, now it's about being more efficient, too. So the first part of the question, I didn't get it. So I think that in terms of how it's impacting our human talent in the way we are approaching, I mean, it's not direct these days. We have invested in how we handle our talent in Global for the last couple of years in terms of putting the people in the center of the organization, and that is giving us a result in terms of the attrition. As you can see, we expect the attrition at the same levels for the next quarter to continue to be lower. Some companies in the tech industry are doing some layoffs, of course, I mean, Globant has been in a very a very good way in terms of keeping the talent as we have been doing all of these years in the middle of the pandemia. In terms of the -- how is this impacting in terms of the region, Latin America is still a very strong demand in tech profiles, and we have been able to be the best place to work in many countries this last couple of months. So I think that, that is a mix of things. We are keeping, of course, a very short -- our KPIs in terms of the utilization, in terms of the attrition in order to be seeing what is happening on everyday basis. But I think that at this point, this is not changing the way we are handling our talent these days. I mean this is -- at this stage, we keep on sending by our Globers and of course, engaging with them and trying to be closer now than ever. Well, of course, I mean, these days, I mean, the idea has been -- it's not that we are prioritizing now when skills are different from a month before. The demand is strong for us, and there is some kind of profile that we have been looking in the last couple of years that has to do with the correct talent for Globant. The last couple of months, we have been working very close with some of the specific countries that have been in crisis. We have been reorganizing some of the structure the last couple of months in terms of the way we approach our clients, and that has to do with the kind of management that we are putting leading in front of the clients being closer to them. So I think that is the kind of the skill set that we are looking people that are really curious that they want to learn, they were to keep growing in a company that is growing, as you can tell by the results this quarter, and we keep on this track. So some time ago, we decided that, that should change, and that should be one of the main areas of expansion. And also, they have operations in Singapore, in Hong Kong and other places, which will help us. Also when we acquired GeneXus, they had an operation in Japan, and they will complement those operations that we are acquiring right now with eWave. And I believe there's a big opportunity there when you add up all the Asia Pacific plus the Middle East countries plus some other countries in which we operate, but sometimes the market was not a take like India or some other countries over there. So I believe that overall, when you take all those things it represents a gigantic market where needs are pretty similar to what we serve to our customers in the U.S., in Europe, in Latin America. So as you kind of look forward here and scenario plan for which just may come, can you just talk about current levels of visibility in the business. Yes, over the last probably two quarters, the global economy has been under a little bit of pressure with different things happening in different regions. And yes, definitely, we are seeing some customers delaying their budget processes and some projects sometimes ramping up a little bit lower because of budgets yet not been approved for next year. At the same time, we continue to see good levels of growth, as you can see by our guidance for the rest of this year. We continue to see loan investing to be ready for when the macro comes back, as you can see by the investments we are doing, for example, on the marketing side with the World Cup, also in how we are getting ready on our teams in the different regions, how we are -- how we have been evolving our studio model. If by this time, visibility for next year in a normal scenario would be around 80%, probably we're a little bit down that number, maybe more like 70% or something around that number. And -- but we expect and we hopefully, when we have to guide for the full year, next February, the situation has stabilized a little bit. So we are optimistic because Globant continues to evolve, continues to adapt, continues to invest continues to get ready, as always, as if this was a normal year. On the margin side, like the same throughout this year. There, you have different things going on, some help on the maybe on the FX side in Latin America. At the same time, we continue to invest heavily to get ready for next year, investments in marketing, in sales and marketing teams in coverage in new studios, adding capabilities to our offering. So we continue to think that not just for this quarter but also for next year, that level of 16% to 17% operating income is a good target to have as a company. I would like to dig deeper in the sports segment in which you have announced this partnership and initiatives with Aleafia people's we to keep from you, how do you see this into medium-term in terms of -- I mean, the market must be huge in terms of number of potential clients and big wallets there. And the visibility on this is anyway that we could quantify this and if that could imply like a notch up in growth rate compared to the historical rate of Nova, I mean, looking forward. Look, I believe that what we are doing with all those sport initiatives and sports-related initiatives has to do a lot with to -- we have reached to a size come where we need to change dramatically the way we connect and the way we position our brand. And connected to that specific idea, this deal has like a like a dual objective. On the first hand, we are creating technology for all these institutions where we work with for FIFA, with FIFA+, with La Liga, with La Liga Tech, with LA Clippers we're creating the Intime technology for them. And on the other side, we are, in some way, positioning our brand as sponsors of those same brands. And that is one vector, but I think that the impact that we are not expecting for that change in numbers moving forward, so you cannot include it in the model, the impact moving forward will be the dramatic, just the World Cup and just the FIFA relationship is about the 2022 World Cup that will be watched by three billion people. And then when you go into the future, it's next year, women's World Cup in Australia and the sub-17 world championships and the esports championships from FIFA all those things, it will be sponsored or other things and at the same time, developing FIFA+. So our position is we love to be and to position our brand, but we want to position our brand in a way we connect and we explain to the world that we are changing the technology for sports and for the sports that you love. But I hope that this will unlock many new opportunities that we didn't imagine today that we don't imagine today, sorry. Mean we will need another planet, if you want us to keep on expanding. But in any case, just in the plan that we have, we are pretty much in every continent, except for Africa. But now the focus is being placed on Asia Pacific, on Europe, Latin America and North America. In particular, in Europe, we believe that expanding and having like much larger operations in countries like France or Germany, now we have a pretty decent operation in Italy after acquisition of at are extremely important things to make it happen. If you ask me, I think Europe should be larger in terms of revenue very soon and have like a larger share. And of course, in North America, now we open up Canada and we are expanding into Canada with many new things happening there. And again, Asia Pacific Asia Pacific, Australia and the Middle East countries, including Israel, in which we don't have operations yet. So I would say that we would focus on those four things: Asia Pacific and Middle East, the -- Europe, North America and Latin America. So in terms of Globant X, we continue to invest in a number of platforms some of which are already generating revenues. When we look at the level of -- when we look at the level of revenues that these platforms are generating, right now, we are -- it's around 2%, 2.5% of our revenues. It's still a small number in the total revenues of Global, but it's growing at a nice pace. Now in terms of margins, by definition, all these platforms have to improve our overall margins, right, especially when you look at the gross margin level. But at the gross margin level, they are -- they improve our margins overall. I would say that Magnify is like in a pretty mature situation where our customers that are using it are consuming more every day, and that's great. I would say that all the things connected to La Liga and delegate has like the technology we got from that agreement -- it's a lot of -- there are a lot of platforms for streaming for prevent piracy to many platforms that are generating revenue in a pretty clear way, and it's an important addition to the platforms. And of course, Augoor, which is generating revenues more allowing us to differentiate the offer that we do for our customers."
}