{
    "symbol": "NRDY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 22:32:05",
    "content": " Early data suggested our transitional learning memberships would lead to longer duration and higher lifetime value customer relationships, enhanced gross margins, better marketing efficiency, better forecasting visibility, and a more scalable and efficient operating model. This result reflects stronger than anticipated performance given our decision to shift to higher proportion of new customers to learning memberships, which decreases recognized revenue in the current quarter in order to be able to generate higher levels of revenue in subsequent quarters from those specific customers. In the third quarter, we recognized revenue of $31.8 million, results that were just above the midpoint of our guidance range of $30 million to $33 million, despite presenting a higher proportion of customers with Learning Memberships than originally targeted. Today, we are nearing our fourth quarter and full year revenue guidance ranges to reflect the significant momentum we are realizing in the transition to Learning Memberships as well as the longer lead times we're experiencing in our institutional business due to the previously discussed focus on opportunities with larger school districts. For the fourth quarter of 2022, we expect revenue in the range of $39 million to $41 million, and for the full year 2022, we are narrowing our expected revenue guidance in the range of $160 million to $162 million, within the guidance range we provided when we first introduced Learning Memberships in May. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And then on the marketing side, right now we're focused on driving profitable growth and efficiency, nailing execution on Learning Memberships and then our two new products on Varsity Tutors for Schools and the focus on larger school district contracts. Your line is now open. Your line is now open."
}