{
    "symbol": "NRDY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 22:49:03",
    "content": " So, the big idea here was that a school or other institution should be able to leverage our platform and deploy different product solutions across different segments of their student population in a way that’s seamless and allows for them to tailor experiences and meet the needs of individual student segments, recognizing that there are some segments like, for instance, high-dosage tutoring where schools are particularly interested in focusing on a subset of students. And then, because this relationship defaults to always-on, where it can recur over long periods of time, there’s an opportunity to build a membership base over the course of many years that accumulates and gives us higher levels of predictability in revenue, higher levels of profitability and also allows us to simplify our business a whole list of different ways. So, some examples would include reducing spend associated with speculative marketing activities as well as shipping resources from less important areas, as was the case with Veritas Prep, which we discontinued in Q4, so focusing on the membership model evolution as well as making sure we’re appropriate positioned for actually Tutors for Schools as we head into the key back to slow season. So, that certainly an environment where there’s macro pressures is helpful, but it’s also unrelated to that, I think, a function of just normalization of education, people wanting help across a wide variety of subjects potentially spanning many years of this whole GPA war concept where people are really focused on GPA, which of course, is the culmination of good grades and lots and lots and lots of classes as opposed to test prep where people would historically trim a little bit more in. So, while only 2% of the American Rescue Plan funds or $24 billion have been spent at the end of the year and we expect for that to drive growth for over the next several years in a really material fashion, we are also using this as an opportunity to really catalyze our entry into schools and then build products that provide so much value that there’s a lot of stickiness and recurrence that schools would never kind of want to get rid of them is our goal. And then, on a go-forward basis, we continue to believe 70% margins is the target and the expectation for the remainder of 2022. and similarly believe that the Varsity Tutors for Schools product offerings will be in line with what you’ve seen to date in the first quarter as we move through the course of the coming year."
}