{
    "symbol": "NRDY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:17:05",
    "content": " We created new subscription and recurring revenue products, including learning memberships for consumers and on-demand and teachers products for institutional customers that were built specifically to address the ongoing support we believe both types of customers desired. We expected that by the start of the second quarter in 2023 the cumulative build of recurring revenue from learning membership customers would cause us to return to growth in our consumer business, as well as for the total company. Revenue recognized in the fourth quarter from learning memberships grew to $20.8 million, a $15 million increase from the third quarter representing 50% of total company recognized revenue in the quarter, up from just 2% of total recognized revenue in the second quarter and 18% in the third quarter. In fact learning membership revenue has reached an annualized run rate of more than $87 million as of year-end, an increase from $50 million as of the end of the third quarter, providing us with increased forecasting visibility in the future revenues. Learning memberships also enabled further marketing yield optimization during the fourth quarter with marketing expenses as a percentage of revenue improving by approximately 370 basis points year-over-year, driving further efficiencies in our consumer business. Just 10 months ago, we laid out a vision for our stated goal to transition our business towards always on recurring revenue streams with the introduction of learning memberships and the new institutional products, including Teacher Assigned and on-demand. And as Chuck mentioned, the accelerated transition to recurring revenue streams, including learning memberships continued in the fourth quarter, reflecting the strong adoption we've seen from consumers during the back-to-school season and fall semester. In the fourth quarter, we delivered $41.8 million, results that were above our guidance range of $39 million to $41 million, reflecting stronger than anticipated active learning memberships, which totaled over 20,000 as of December 31 and continued strength in lifetime value performance from learning numbers. It also reflected the growth we're experiencing in our institutional business, which delivered revenue of $4.4 million, representing 10% of total revenue during the fourth quarter and record bookings of $11.3 million. We delivered on this promise with learning memberships representing 66% of consumer revenues in December, and as Chuck mentioned, 50% of consolidated revenues for the fourth quarter demonstrating the rapid transition to recurring revenue products. Full year revenue guidance reflects our decision to shift 100% of the Consumer business to Learning Memberships by the end of 2023, including the remaining Test Prep and Professional audiences. And so because of that during the first quarter, we transitioned all of our existing customers to learning memberships as well as our test prep audience to learning memberships, which we're really excited about as we evolve towards 100% of our consumer customers being on learning memberships by the end of 2023. Learning memberships, we were surprised to see $350 average revenue per learning -- per revenue per learning membership, which was higher than the six to 12 monthly plan listed on your guys' website and then the rough math off of the $87 million run rate and 20,000 learning members gets you to a number even higher than $350."
}