{
    "symbol": "MDT",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-22 12:55:06",
    "content": " Geoff and Karen will provide comments on the results of our second quarter, which ended on October 28, 2022 as well as our outlook for the remainder of the fiscal year. After our prepared remarks, the Executive VPs for each of our four segments will join us and we will take questions from the sell-side analysts that cover the company. During todayâ\u0080\u0099s program, many of the statements we make maybe considered forward-looking statements and actual results may differ materially from those projected in any forward-looking statement. Unless we say otherwise, all comparisons are on a year-over-year basis and revenue comparisons are made on an organic basis, which excludes the impact of foreign currency and revenue from our Q1 acquisition of Intersect ENT. References to sequential revenue changes compared to the first quarter of fiscal â\u0080\u009823 and are made on an as-reported basis and all references to share gains or losses refer to revenue share in the third calendar quarter of 2022 compared to the third calendar quarter of 2021, unless otherwise stated. And finally, our EPS guidance does not include any charges or gains that would be reported as non-GAAP adjustments to earnings during the fiscal year. Hello, everyone and thank you for joining us today as we discuss our Q2 results and outlook. In terms of reported revenue, the continued strength of the dollar over the course of the quarter drove over half the difference to expectations. Now despite the top line results, we were able to control expenses and deliver EPS at the high-end of our guidance range. We expect continued acceleration in organic revenue growth in the second half, although less than previously anticipated and this partially flows through to EPS. Now, this is something that I donâ\u0080\u0099t take lightly, delivering on our expectations is important to building and maintaining trust and credibility with you. Karen will walk you through the details, but some of our markets and some of our supply constraints recovered more slowly than we expected in the quarter, and that, along with incremental China volume-based procurements, led us to reduce our expectations. While the current operating environment remains challenging, we had strong growth in several businesses and geographies, where our strategy, our operating model and execution are yielding solid results. Now, diving deeper into our Q2 results, for reported revenue, as I said earlier, currency drove over half the miss to consensus. One, procedure volumes in some markets have been slower to return to normal levels and two, some of our supply challenges have persisted longer than we anticipated. With regard to procedural volumes, in addition to an incremental China VBP, we are still seeing lower volumes in elective coronary PCI, GI procedures, TAVR, spinal cord stim and some less emergent surgical procedures. Now with regard to supply, we have made meaningful recovery and many of the most acute issues are now behind us, including the acute packaging issues, which we highlighted last quarter. But some of the improvements did come later than we expected in Q2, and as a result, we missed cases in businesses like surgical innovations and it has delayed our expected momentum. Now focusing beyond challenges impacting our markets and product availability, we have a number of businesses where our strategy and execution are yielding results. Recall that we moved to the new operating model 2 years ago, we created highly focused, accountable and empowered operating units that can move with greater speed and decisiveness. And today, we are clearly seeing the benefit of this model across many of our businesses. Starting with cranial and spinal technologies, CST grew 5% and this is despite a large negative impact from China VBP. In fact, our U.S. core spine business grew 15%. Additionally, this quarter, we launched our spine technology ecosystem, which we call Aible at the NASS conference. And another highlight was our structural heart business, where our TAVR business grew 15% globally, including 17% in the United States. The launch of our Evolut FX valve drove 18% sequential revenue growth in our U.S. TAVR business, despite being at full market launch for only the last month of the quarter. So, we expect Evolut FX to drive momentum for us over the coming quarters. Our Cardiac Rhythm Management business continues to execute and win share, with 4% growth in this quarter. Within CRM, our pacing business grew 6%, well above the market, with 18% growth of our micro family of leadless pacemakers. Letâ\u0080\u0099s take cardiac ablation solutions, a business that we expect to be a strong future growth driver. Pulsed Field Ablation represents a large market opportunity and we are looking forward to seeing our PULSED AF pivotal trial results in the first half of the next calendar year, putting us on the path to be one of the first companies with the PFA catheter in the U.S. market, which we think is underappreciated. And as you know, we closed our acquisition of Affera in August and Afferaâ\u0080\u0099s differentiated mapping and navigation system gives us the breadth and differentiation that we need to win share in cardiac ablation. And outside the U.S., we continue to receive positive customer feedback on the performance of the 780G, which is now available in over 60 countries. In Q2, 780G drove mid-teens growth for our diabetes business in international markets. Turning to our Hugo surgical robot, now I am sure we are going to get into this in Q&A, but we saw a lot of positive momentum this quarter as we scale manufacturing production, expand regulatory approvals and ramp installations. Now, this allows us to start our U.S. urology clinical trial by the end of the calendar year and is a catalyst for continued progress with our international sales. Importantly, the current standard of care for reducing blood pressure, it just isnâ\u0080\u0099t working, which was evident in the long-term SPRINT trial results published just last month in JAMA Cardiology. In addition to advancing our pipeline, we are focused on decisively allocating capital and streamlining the company to deliver durable growth. We are freeing up resources to invest more in R&D, feeding our fast growing businesses in areas where we can see the strongest returns. Over the past two quarters, we have announced our intent to separate three businesses that we believe will thrive outside the company. With our Renal Care Solutions business, we are progressing on the separation, forming a new kidney health technology company together with DaVita. And last month, we announced our intention to separate our combined patient monitoring and respiratory interventions business. We remain focused on active portfolio management, evaluating both potential additions and subtractions to further accelerate our growth and create value for our shareholders. Now with that, I will turn it over to Karen to discuss our second quarter financial performance and our guidance. Our second quarter organic revenue increased 2.2%, up significantly from Q1, but below our guidance range, given the challenges Geoff mentioned. Yet with a focus on expenses, our adjusted EPS of $1.30 landed at the upper end of our guidance range. Looking at our results from a geographic perspective, our U.S. revenue grew 1%; our non-U.S. developed increased 3%; and emerging markets grew 4%. Our emerging markets growth continued to be affected by China, which declined 9%, given the impact of a national tender in our spine business and several provincial tenders in certain other businesses. However, we continue to see strong double-digit growth in our other markets, including mid-20s growth in Eastern Europe and mid-teens growth in Latin America. In fact, excluding China, our emerging markets grew 15%. Turning to our margins, our adjusted gross margin of 67.6% declined 120 basis points from inflationary pressures in materials, direct labor, freight and utilities. We expect these inflationary pressures to continue and to impact the back half of this fiscal year, more than what we experienced in the first half. Our adjusted operating margin of 26.6% declined 40 basis points, including a 120 basis point benefit from our currency hedging program. Compared to the first quarter, our operating margin improved 270 basis points, given accelerated revenue growth. Regarding our capital allocation, we continue to balance investing for the future with returning capital to shareholders and we remain committed to our dividend and to returning a minimum of 50% of our free cash flow to our shareholders. Now, turning to our guidance, today, we set our second half revenue guidance at 3.5% to 4% organic, which excludes currency movement and revenue from our Intersect ENT acquisition. If recent exchange rates hold, foreign currency would now have a negative impact on our back half revenue of $930 million to $1.03 billion. Our back half guidance translates into a reduction of our annual guidance, driven by a slower pace of market and supply recovery. On market, we are expecting incremental provincial tenders in China, particularly in stapling and cardiac ablation. So at this point, we are assuming no incremental improvement in the back half. On supply, while we have had a meaningful recovery, it came later than anticipated, particularly in SI and cardiac diagnostics and that simply delays our pace of recovery ahead. By segment in the back half, the majority of the reduction is in our Medical Surgical portfolio, which we now expect to be flat to up 0.5%. We expect cardiovascular to grow 5.25% to 5.75%, neuroscience to grow 6% to 6.5%, and diabetes to decline in the low single-digits, all on an organic basis. Our total company revenue guidance does assume continued revenue growth acceleration, which we saw in each month of the second quarter. We will have easing comparisons in ventilators, improving supply in certain businesses like cardiac diagnostics and SI and the benefit from product launches like Evolut FX and EV-ICD. In the third quarter, we expect organic revenue growth in the range of 2.5% to 3%, an acceleration from the second quarter. And assuming recent exchange rates hold, the third quarter would have a currency headwind between $460 million and $510 million. By segment and on an organic basis, we expect Medical Surgical to be down 2% to 2.5%, an improvement from the second quarter, given lesser event headwinds and the impact of the flu season. Cardiovascular to grow 4.75% to 5.25% on the continued rollout of Evolut FX and Linq 2, neuroscience to grow 5.75% to 6.25% improving from the prior quarter with less VBP impact in spine and diabetes to decline in the low single-digits. On the bottom line, we are driving significant expense reduction throughout the company to help offset the lower revenue and continued inflation impact and now expect fiscal â\u0080\u009823 non-GAAP diluted EPS in the range of $5.25 to $5.30. For the third quarter, we expect non-GAAP diluted EPS to be in the range of $1.25 to $1.27, including an FX headwind of about $0.05 at recent rates. Amidst the macro environmental headwinds we face from inflation, China VBP, softer procedure volumes in certain markets and currency, we are laser-focused on driving operational and expense efficiencies. We are also committed to invest appropriately for the long-term, allocating capital to our most promising growth drivers and executing tuck-in acquisitions designed to reach more patients and create value for our shareholders. As we approach Thanksgiving, I want to share my gratitude to our employees who have been committed, particularly during these challenging times to deliver on our mission to alleviate pain, restore health and extend life for millions of people around the world. Now before we open the lines for questions, I want you to know that our growth rate and our consistency are not where we want them to be. We brought in new leaders to inject new ways of thinking in the organization, and we implemented new capital allocation and portfolio management processes. Now these changes take time, and we face setbacks along the way that have slowed us down. Some are environmental like COVID recovery rates, raw material shortfalls and Chinese procurement policy, while other setbacks are of our own doing, like our quality and operational challenges and the pace of improvement we anticipated. Look, I know we have more work to do here, but we understand the root causes that led to the years of underperformance from this company. I know we will get this right, choosing the right markets, being more efficient and productive with our resources, empowering businesses and increasing accountability, improving our quality, our manufacturing and our supply chain and turning our size and scale into an advantage. We have experienced leaders, a compelling pipeline and positions of strength in some of the most attractive medtech markets, which address significant unmet needs for patients. We are going to try to get to as many analysts as possible, so we ask you to limit yourself to just one question and only if needed, a related follow-up. If you have additional questions, you can reach out to Ryan and the Investor Relations team after the call. For todayâ\u0080\u0099s session, Geoff, Karen and Ryan are joined by Que Dallara, EVP & President Diabetes Operating Unit; Sean Salmon, EVP and President of the Cardiovascular portfolio; Brett Wall, EVP and President of the Neuroscience portfolio; and Bob White, EVP and President of the Medical Surgical portfolio. We will take the first question from Robbie Marcus, JPMorgan. Thanks for taking the questions. The miss in the top line in the quarter, the guide down was pretty significant for the second half of the year. And then as we think out to next year and fiscal â\u0080\u009824, can you give some thoughts on the last call about FX and how we should be thinking about growth for next year. But on the miss, like we said in the commentary, the primary issue is the pace of the recovery and there is the two buckets. There is the pace of our supply recovery, which we did make quite a bit of progress there and they got over the most acute issues that were plaguing us, but happened a little â\u0080\u0093 it happened late in the quarter and pushed out our momentum, which gets to the second part of your question, which is the effects the guide down. Many of our businesses are back, the majority of them are back to the pre-COVID level of their markets. And Iâ\u0080\u0099ll let Karen walk through those and we were â\u0080\u0093 we just overstated what that market recovery would be, and we will walk you through those and how those impact the second quarter â\u0080\u0093 the second half. So let me talk about it more broadly than your question to, Robbie because I know you asked a specific question on procedure growth. First, on our markets, some of our markets have not returned to normal growth levels and this does account for about â\u0080\u0093 for over half of the reduction in our second half guide. And because these markets have not accelerated as quickly as we had anticipated, we decided to assume volumes in the back half remain at Q2 levels. If those volumes improve in those markets, that would be upside. And those were ones that we believed would occur next fiscal year and are occurring sooner, particularly in stapling and cardiac ablation. And then on the second bucket of supply that Geoff mentioned, we, obviously, did see meaningful improvement over the second quarter. But some of that happened late in the quarter, as we said, and that pushes out our assumptions for share recapture. Weâ\u0080\u0099re under long-term contracts with those customers, so we will gain our share back. But just to summarize, in addition to our assumptions on market growth, we assume incremental contribution from products that weâ\u0080\u0099ve recently launched and supply that has recently improved. On your question on FYâ\u0080\u009924, itâ\u0080\u0099s still early. We have two quarters to go, and weâ\u0080\u0099re at the beginning of our planning process. But I will say a few things, including currency because that was your question. First, on the top line, you can see that we expect to exit the year with mid-single-digit growth, and thatâ\u0080\u0099s a great place to start the following year. Second, down the P&L, weâ\u0080\u0099re still in a challenging operating environment with inflation, interest rates and currency, as you mentioned. And thatâ\u0080\u0099s, obviously, worse than the $0.18 that I mentioned for FYâ\u0080\u009923. And third, weâ\u0080\u0099re purposely driving significant expense reduction given these headwinds and given our focus on continuing to drive long-term investments for the company. So weâ\u0080\u0099ve got several puts and takes for next fiscal year, and we plan on giving you more on FYâ\u0080\u009924 as we move through the back half. We will take the next question please, Ryan. On the â\u0080\u0093 why donâ\u0080\u0099t we start with the TAVR one because we â\u0080\u0093 the market didnâ\u0080\u0099t grow quite as much as we had hoped, but it still was a strong growth driver for us, and we did do well from a share perspective. And why donâ\u0080\u0099t I Sean maybe comment on that, and then we will come back and help Karen talk about the VBP part of the question. Travis, we think we took about a 0.5 point of share for that for the full quarter, and it was really driven by the late â\u0080\u0093 the last month of the quarter where we picked up some of that momentum in October with the launch of the Evolut FX weâ\u0080\u0099re in about 400 accounts of that so far. So weâ\u0080\u0099ve got some room to run there for the back half of the year, but that is very strong. And I think that, thatâ\u0080\u0099s really, as you know, just conspired against by the resource intensity thatâ\u0080\u0099s required. You get this whole chain of events where you have to have a patient go through imaging prior to their eventual procedure, and there is a lot of hand us along the way. And we also had a problem where there was a sheet that we use for the procedure that we donâ\u0080\u0099t make that became unavailable because of supply challenges, and that led to some share loss in Japan. But overall, the TAVR is really strong for us with FX launching, and weâ\u0080\u0099re excited about back half to get to a full release of that product into all the accounts. And on your China VBP question, Travis, about 15% to 20% of our back half guide down is due to the incremental China VBP being pulled forward from next year from our perspective from what we had assumed. For the rest of this fiscal year, we donâ\u0080\u0099t expect China to be a material growth driver for us. And in fact, for the full year, weâ\u0080\u0099re expecting low single-digit declines in China. That said, as we look forward into FYâ\u0080\u009924, we will continue to have some VBP, but I think the vast majority will be behind us, and China should be a contributor of growth again next fiscal year. And to Karenâ\u0080\u0099s point, look, longer-term, we still think China is a growth market, but itâ\u0080\u0099s not right now, and we factored that into our guidance. Next question please, Ryan. Geoff, my first question was on the back half guidance. When you look at 2Q, second quarter organic slightly north of 2% and the back half guidance of 3.5% to 4%. Let me take the â\u0080\u0093 well, Iâ\u0080\u0099ll take the share loss question first and then Iâ\u0080\u0099ll get to the back half and maybe I have Karen talk to that one as well. But in SI, our surgical innovations, this â\u0080\u0093 first of all, this is a contracted business with health systems and mainly us and our main competitor in that space. And we did the same thing where we got picked up some incremental revenue and some share because the two big competitors are make-up the majority of what the hospitals are buying in the surgery space, but these hospitals do honor these contracts. So these are contracted â\u0080\u0093 like I said, contracted business for us. And based on our dialogue, with the health systems, weâ\u0080\u0099re confident this is going to come back as our supply, which we mentioned. We did get past the most acute part of our supply issues in the Surgical Innovations business, was this packaging issue. It did come later in the quarter and slower momentum, but we do have momentum now, and you should see that business recover. On the back half, Iâ\u0080\u0099ll ask Karen to... When we look at our back half ramp, we have new products. Weâ\u0080\u0099ve got TAVR with Evolut FX that Sean has mentioned, was only in the market for a month in Q2. So, all of those things really lead to the back half ramp. So I mean, beyond the supply returning, the back half, as Karen walked through a lot of it, is really powered by very tangible things beyond supply, product-related they are tangible and compelling. I didnâ\u0080\u0099t hear the very last part of it, does Medtronic â\u0080\u0093 but the answer to your question is yes. I mean, the mid-single-digit growth, we will exit the year at mid-single digits. You see throughout this year, youâ\u0080\u0099re seeing the acceleration from the first quarter, which was the depth of our supply issues. Then this past quarter, on an organic basis, up 2% and then Karen walked you through the back half guide. But we exited the year at mid-single digits, and we believe thatâ\u0080\u0099s durable. Like I said, based on these product launches that are here now immediate drivers and then we â\u0080\u0093 Karen brought up a list of things that are already kind of tangible in the back half, but there is a number of other things that are still coming. The Aurora EV-ICD, PFA and Afib and Inceptiv with ECAPs and our SCS business and then there is the whole diabetes discussion with those products coming on in the U.S. in the next year. Next question please, Ryan. So Que, just a multipart question here. And just lastly on 780G, do you expect it to have the same impact in the U.S. as youâ\u0080\u0099ve seen outside the U.S.? So on your first question, no, we did not ask for a variance. Iâ\u0080\u0099m pleased to say that we are 100% complete on the warning letter commitments, and we have welcomed the FDA back in to assess our current status. So I think thatâ\u0080\u0099s forward progress, and thatâ\u0080\u0099s the clearest path because, obviously, itâ\u0080\u0099s not just 780, but it is a whole pipeline of innovation that we care about from a growth perspective. On your question around 780G progress in international markets, weâ\u0080\u0099re very pleased with the double-digit performance there. And as you know, our customers have a free upgrade option with 780 once approved in the U.S. market. And sorry, Larry, I missed your third â\u0080\u0093 your second part of the question. I guess, why didnâ\u0080\u0099t you ask for variant in the U.S., it seems like a kind of no risk option here? Primarily because as weâ\u0080\u0099ve stated, weâ\u0080\u0099ve been focused on really the long-term lifting up the warning letters is critically important. Itâ\u0080\u0099s not just about 780G, but itâ\u0080\u0099s still about the pipeline. Next question please, Ryan. Matt, please go ahead. Maybe we will take the next question, Brad, and then we will try to come back to Matt. Just one maybe for Geoff and maybe Sean as well, just on the renal denervation program and understand, I think itâ\u0080\u0099s well understood that the totality of evidence can get the approval. I believe that your team has had preliminary discussions with payers and it might be helpful just in terms of under better understanding your optimism that not just approval could be in hand in the next 6 months to 12 months, but payer decisions will ultimately be positive. Thanks for taking the questions. Are the supply chain issues gone, not completely, but the biggest pain, or if you will, is behind us, especially in surgical innovations with the packaging, as I mentioned, issue. But the changes that we have made to our supply organization with the new leadership under Greg, the new structure, bringing in new people to help us with capabilities where we thought we werenâ\u0080\u0099t â\u0080\u0093 where we needed to be, implementing new systems and new processes. I mean like some issues that are outstanding like the semiconductors, but all thatâ\u0080\u0099s factored in, and we feel good about going forward, not just FYâ\u0080\u009924, but beyond that. But look, the â\u0080\u0093 as you look at the data, we believe itâ\u0080\u0099s very compelling. And when you â\u0080\u0093 when physicians look at it, they understand this and are excited about it and why we are optimistic with payers is because health systems and governments are really focused on â\u0080\u0093 and payers are focused on hypertension, which â\u0080\u0093 and like the current standard, as I mentioned in the commentary, just isnâ\u0080\u0099t working and more data came out to substantiate that in September a physician â\u0080\u0093 to substantiate what people already know. And I think payers are going to be compelled to take it seriously, especially with the public health epidemic that we are facing here. Itâ\u0080\u0099s over 3,000 patients in the real world data on top of the sham-controlled randomized studies. And importantly, we did a patient preference study, which is getting more and more considered by payers because they know that patients have a say in what they want to go do. But we do think that the novelty of this therapy, the desire of patients, and of course, the public health benefit that this can provide is going to be compelling to both public and private payers around the world. I guess just to follow-up a little bit on Joshâ\u0080\u0099s question, and I know how enthusiastic you still are about Ardian. Matt, I think if you just recall how that study was done the patients were witnessed taking their blood pressure medicine in the morning. And whether they were taking that for the full six months or not, or they just took it that day, you saw the change in blood pressure that was during the daytime not what we have seen before in these prior trials. So, I think the simple story here is that patients werenâ\u0080\u0099t taking their medications, except on the game day and their blood pressure drops. And as Geoff said, the changes increasing medication, decreasing medication, taking even medications for blood pressure that werenâ\u0080\u0099t even prescribed maybe from their medicine cabinet, maybe from their spouse or partners medicine cabinet. So, it is a robust measurement that was consistently performed throughout this trial and across the other trials that we have done. There is 1 billion people with blood pressure problems around the world, even if very small amount gets you to the kind of market growth that we think is going to be meaningful for the company. And then itâ\u0080\u0099s not a related follow-up, but turning over to cardiac rhythm for a second. And then what the expectation is with the EVICD, given the long-standing presence of another one of your competitors in that market. So, for Micra, we continue to grow, and you saw 18% globally, 40% of that was from international sales. And really Japan and China, in particular, really drove that growth and continued success. And we will see continued penetration in international markets and in the U.S. and a shift between single chamber to the AV device, which can pick up a larger proportion of patients. And in the next 12 months, we are going to refresh both the VR and the AV devices in the coming year around the world. You have got to put a lead underneath the breast bone, which takes some training to learn and we will be very meticulous in the way we roll that out. But make no mistake that is a product that really offers a huge benefit, getting leads out of the heart, having half the size in the can and twice the battery life compared to the other device that realm and being able to voice shock by pacing people out of their fatal arrhythmia as opposed to having to have a painful shock. Those are all really, really welcome improvements, and we are excited to roll that technology out first in Europe and then the United States next year. Cardiac Rhythm business has done well and we expect it to continue to do well with products like Micra and EVICD, but also pioneering conduction system pacing, and we have got a nice pipeline there and really a strong leadership team and strong position. Matt, please go ahead. So, I wanted to just explore you talked about the slower recovery of some of these elective and developed markets. So, I would say, through the quarter, we did see, particularly in the markets that we had mentioned not as robust recovery, but some recovery. But as we ended the quarter with less robust recovery, we are just assuming that in those areas, those procedures stay where they were in the back half. As we look at the first few weeks of our current quarter â\u0080\u0093 of the third quarter, we are seeing improvement from the second quarter. So, just to highlight what Karen is saying there, I mean we were disappointed that we missed the call on this one for the Q2. Like we said, many of the segments are back to pre-COVID, but there are a handful on those electives and developed markets that we have called out and Karen walked you through the assumption for the back half of the year. First of all, there is â\u0080\u0093 you take a therapy like TAVR, where there is multiple handoffs. So, there is â\u0080\u0093 you want to sure you schedule that in a way thatâ\u0080\u0099s okay, that they can get it all done in an efficient way. You have got â\u0080\u0093 with severe aortic stenosis, there is about an 80% mortality rate for 2 years from your diagnosed that. And I think the other thing we are seeing with staffing just in general is, there is a prioritization for patients that can get in and out relatively quickly so they can make downstream staffing available. So, whether itâ\u0080\u0099s ICU recovery or you have got even transport to kind of move. Cardiac surgeries have grown like a 5.5% for us, so very robust. I mentioned before, France and Germany seem to be some places that are really struggling with staffing in Europe, and we see it just in pockets around the United States and other places. So, it is a dynamic situation, and we think it has gotten better, certainly a lot of places, but not everywhere yet. I know that you donâ\u0080\u0099t have a ton of exposure here, but there has been a healthy debate around hospital demand for capital equipment this year. But it is â\u0080\u0093 it tends to be tied to profitable procedures, and we actually had a strong capital performance in last quarter. And especially in our Cranial & Spinal Technologyâ\u0080\u0099s business, CST, our capital there, we had a number of our â\u0080\u0093 whether it would be navigation, inter-operative imaging, had record capital quarters for us. So, we are â\u0080\u0093 we definitely see a bit of â\u0080\u0093 it takes a little longer to close a deal, but the demand as you are working with the hospital and how they are going to pay or finance this, but we are having strong demand in those areas. Hugo is still new for us, but we are very happy with the placements we have been able to make on Hugo here. We have got time for one more question, please, Brad. Could you give us a little bit of an update on how you feel about the market potential for the product, the timing of U.S. approval? Well, thanks for the question, Joanne. And like I just said to Pito, we are pleased with the system placements. First, on the overall market of 4Q go, we continued to be really excited about it. Remember, thereâ\u0080\u0099s â\u0080\u0093 around the world still 95% cases are not done. So, we are still really excited about the continued long-term health of the market and excited to be the number two player in this space. With respect to the timing of U.S. approval, as Geoff mentioned, we expect to begin our U.S. IDE by the end of this calendar year. And overall, with respect to the contribution, as you mentioned, I think itâ\u0080\u0099s early to call that, but given our system is now installed around the world in markets in APAC, EMEA, Lat-Am. We just received regulatory approvals and indication expansions in Japan, which is the third largest robotics market in the world. We have general surgery approval in the EU, Canada and Australia, which opens up the hernia market for us. And we have started to see really strong presence at some really key congresses in Europe where live stream cases, etcetera. So, a little early to call it contribution, Joanne, but we are starting to see the momentum and the acceleration that we talked about. Well, first of all, thank you everybody for the questions. And for those of you in the U.S., I would like to wish you and your families a very happy Thanksgiving."
}