{
    "symbol": "KEX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 12:57:06",
    "content": " In the first quarter of 2022, Marine Transportation revenues were $355.5 million with an operating income of $16.9 million and an operating margin of 4.8%. Compared to the first quarter of 2021, Marine revenues increased $54.6 million or 18% and operating income increased $15 million. Compared to the first quarter of 2021, inland revenues increased by 24% primarily due to increased barge utilization, higher term and spot contract pricing, and increased fuel rebuilds, as we saw the average cost of diesel increased by more than 50%. Compared to the fourth quarter of 2021, inland revenues were up by 2% driven by increased term and spot market pricing and higher fuel rebuilds, but partially offset by lower average barge utilization and lost revenue related to Omicron. Average coastal barge utilization improved to the low 90% range, which compares favorably to the 90% range in the fourth quarter of 2021 and the mid-70% range in the first quarter of 2021. During the quarter, coastal revenues increased 1% year on year with improved barge utilization and higher fuel rebuilds being mostly offset by reduced coal shipments in the dry cargo business, the company's exit from Hawaii, and loss revenue associated with the Omicron variant. Compared to the fourth quarter of 2021, coastal revenues declined 2% due to reduced coal shipments, the company's exit from Hawaii, and loss revenue related to Omicron. Compared to the first quarter of 2021, the Distribution and Services segment saw revenue increase by $59.3 million or 30% with operating income improving by $8.1 million. When compared to the fourth quarter of 2021, revenues increased by $14.5 million or 6%, and operating income increased by $3.5 million. On the commercial and industrial side, increased economic activity contributed to an 11% year-on-year increase in revenues, with improved demand for equipment, parts and service in our Marine repair and on-highway businesses. These factors should be partially offset by improving market dynamics, small rate gains in favorable barge utilization, overall, coastal operating margin are expected to improve relative to the first quarter and range between a low-single-digit loss to near breakeven as the year progresses."
}