{
    "symbol": "KEX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 14:27:06",
    "content": " The quarter's results reflected improved market fundamentals in both marine transportation and distribution and services, and were partially offset by higher fuel cost and inflationary pressures as well as continued supply chain challenges that delayed sales in distribution and services. Overall, second quarter inland revenues increased 14% sequentially and margins improved into the high single digit range. Overall, second quarter revenues increased 14% sequentially and operating margins were in the low single digits. In the second quarter of 2022, marine transportation revenues were $405.7 million with operating income of $30.8 million and an operating margin of 7.6%. Compared to the second quarter of 2021, marine revenues increased 72.8 million or 22% and operating income increased $12.3 million, or 66%. Compared to the first quarter of 2022, marine revenues increased $50.2 million or 14% and operating income increased $13.9 million or 82%. Compared to the second quarter of 2021, inland revenues increased by 25%, primarily due to increased barge utilization, higher term and spot contract pricing, and increased fuel rebuilds as we saw the average cost of diesel increase more than 93% year-over-year. Compared to the first quarter of 2022, inland revenues were up 14% driven by increased term and spot market pricing, higher average barge utilization and higher fuel rebuilds. During the quarter, coastal revenues increased 12% year-on-year with improved barge utilization, higher contract pricing and higher fuel rebuilds. Compared to the second quarter of 2021, the distribution and services segment saw revenue increase by $65.6 million, or 29%, with operating income improving by 10.5 million, or 169%. When compared to the first quarter of 2022, revenues increased by $37.1 million, or 15%, and operating income increased by $5.7 million, or 52%. On the commercial and industrial side, strong activity contributed to a 15% year-on-year increase in revenues with improved demand for equipment, parts and service in our marine repair and on-highway businesses. These favorable supply and demand dynamics are expected to drive further improvements in the spot market, which currently represents approximately 40% of inland revenues as well as continued improvement in term contract repricing as renewals occur. Full year coastal revenues are expected to be flat to up in the low single digits, driven primarily by improving fundamentals in our core liquid cargo business and higher coal shipments in our offshore dry cargo business, offset by the company's exit from Hawaii. While supply chain issues are expected to continue impacting new product and equipment deliveries and distribution and services, we continue to expect 2022 segment revenues will increase 25% to 30% year-over-year, with commercial and industrial representing approximately half of segment revenues and oil and gas representing the other half."
}