{
    "symbol": "MMSI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 00:00:21",
    "content": " We reported total GAAP revenues of $295 million in the second quarter, up 5.2% year-over-year. Our total revenue increased 7.4% year-over-year in the second quarter on an organic constant currency basis, excluding the headwind to our GAAP revenue growth related to changes in exchange rates compared to the prior year period. Sales of our peripheral interventional products increased 7%, representing the largest driver of total Cardiovascular segment growth in quarter two. Sales of our embolics, access and drainage products increased nearly 8% year-over-year in quarter two and together contributed roughly 1/2 of our total PI growth year-over-year. Within our cardiac intervention business, sales increased 7% in quarter two, representing the second largest contributor to total Cardiovascular segment growth year-over-year. We had standout contributions in total CI growth in quarter two from sales of our intervention products which increased 12% year-over-year, driven by sales of our Basix inflation device, continuing to deliver strong contributions to growth, increasing 14% in quarter two and a notable pickup in demand for our PhD hemostatic valve products. Sales of our OEM products were all stronger than expected in quarter two, increasing 15% year-over-year, driven by improving demand from larger customers in multiple categories, including cardiac intervention and access, fluid management, coatings and kits. Finally, sales in our Endoscopy segment increased 4% in quarter two, ahead of expectations, as we saw strong demand for our Elation esophageal balloon products which offset the expected business disruption related to issues with a third-party contract manufacturer discussed in our last earnings call. Our non-GAAP gross profit, non-GAAP operating income and non-GAAP net income increased 7%, 23% and 20% year-over-year, respectively, in quarter two. We remain committed to the financial targets that we outlined in the Foundations for Growth program for the 3-year period ending December 31, 2023 which call for our constant currency organic revenue to increase at a CAGR of at least 5%, non-GAAP operating margins of at least 18% and cumulative free cash flow generated of more than $300 million. Specifically, while our prior guidance assumed higher raw material costs compared to the second quarter of 2021, our second quarter results included an incremental headwind to our non-GAAP gross margins of approximately 50 basis points from higher than expected raw material expenses. Total operating income in the second quarter increased $10.7 million, or 23% year-over-year, to $56.4 million. We are very pleased with our profitability performance in the second quarter where we reported year-over-year growth in non-GAAP net income and diluted earnings per share of 20% and 19%, respectively, despite the incremental pressure on our gross margin and a higher than expected tax rate in the period. Total revenue for the six months ended June 30 was $570.4 million, up $41.2 million year-over-year or 9% growth on a constant currency basis. Gross profit increased 7% year-over-year to approximately $277 million, representing 48.6% of sales in the first half of 2022 compared to 48.9% of sales in the prior year period, a 36 basis point decrease year-over-year. Operating profit increased 14% year-over-year to $96.6 million, representing 16.9% of sales in the first half of 2022 compared to 16% of sales in the prior year period, a 95 basis point increase year-over-year. Net income increased 12% year-over-year to $72.7 million, or $1.26 per share, compared to $65.2 million, or $1.14 per share, in the prior year period. With respect to our cash flow generation in the second quarter, our strong profitability performance in the second quarter of 2022, combined with strategic working capital investments, resulted in strong free cash flow generation of $31.5 million in the second quarter. This GAAP net revenue range now assumes a headwind from the changes in foreign currency exchange rates in the range of approximately $18.6 million, representing a headwind of approximately 170 basis points to our forecasted GAAP growth rate this year. First, the midpoint of our third quarter growth expectations assume constant currency sales growth of approximately 3% year-over-year in the U.S. and approximately 7% year-over-year in OUS markets. Second, our third quarter guidance range assumes a notably wide range of sales of endoscopy devices, specifically a decline of 37% on the low end to an increase of approximately 12% on the high end as we continue to manage to business disruption related to issues with a third-party contract manufacturer. With respect to our profitability expectations for the third quarter, we expect to see flattish non-GAAP gross margin trends compared to last year and modest declines on a quarter-over-quarter basis, driven by previously mentioned inflationary pressures we are seeing in raw materials and incremental freight and logistics costs compared to the prior year. These margin expectations, combined with a notable increase in our non-GAAP tax rate compared to last year, are expected to drive a change in non-GAAP net income and EPS in the range of down 4% to 5% year-over-year on the low end to up 3% to 5% year-over-year on the high end."
}