{
    "symbol": "MMSI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 23:07:01",
    "content": " Our first quarter revenue exceeded the growth expectations that we discussed in our fourth quarter call, specifically, that our constant currency revenue would increase in the range of approximately 6% to 8% year-over-year. As I mentioned, our first quarter sales in the U.S. increased 7.4% year-over-year and our international sales increased 16.6% year-over-year both on a constant currency basis. We remain committed to the financial targets that we outlined in the foundations for growth program for the three-year period ending December 31, 2023, which call for our constant currency organic revenue to increase at a CAGR of at least 5% non-GAAP operating margins of at least 18% and cumulative cash flow generated of more than $300 million. Specifically, we estimate that the year-over-year increase in logistics expense represented a headwind to our non-GAAP gross margins of approximately 145 basis points in the first quarter. Total operating income in the first quarter increased $1.4 million, or 4% year-over-year to $40.2 million. We are very pleased with our profitability performance in the first quarter, where we reported year-over-year growth and non-GAAP net income and diluted earnings per share despite the incremental pressure on our gross margin and a higher than expected tax rate in the period. Turning to a review our fiscal year 2022 financial guidance which we reaffirmed in today's press release, for the 12 months ended December 31, 2022, we continue to expect GAAP net revenue growth of approximately 4% to 6% year-over-year. Specifically, we expect our total revenue to be in the range of approximately a 1% decrease to an approximate 1% increase year-over-year on a GAAP basis, and approximately flat to up to 2% increase year-over-year on a constant currency basis in the second quarter of 2022. First, our revenue increased 28% year-over-year in the second quarter of 2021 driven by 34% increase in the U.S. and 21% increase growth in international markets. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. I think you're saying the guide is $3 million to $3.5 million in the year based on the 1% hit to the second quarter, you're at $3.5 million through the first six months."
}