{
    "symbol": "MMSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 23:15:02",
    "content": " Beginning with a review of our second quarter revenue performance, we reported total GAAP revenues of $287 million in the third quarter, up 7.5% year-over-year. Our total revenue increased 10.5% year-over-year in the third quarter on an organic constant currency basis, excluding the headwind to our GAAP revenue growth related to changes in exchange rates compared to the prior year period. Specifically, we shared our expectation for constant currency revenue growth in the range of a 4% to 6% year-over-year in quarter 3. Within the PI category, sales of our embolics and access products, increased 18% and 24%, respectively, and together represented nearly half of total PI growth and sales of our SCOUT Radar Localization angiography and biopsy products each increase in the low double digits year-over-year and together represented roughly 1/3 of our total PI growth. OEM standout performance represent the largest contributor to the better than expected U.S. growth this quarter, PI, CI and endoscopy revenue all came in at the high end of our expectations, reflecting continued strong execution and overall improving trends in the U.S. Our third quarter international sales increased 16% year-over-year which is strong performance in light of the challenging global macro environment in quarter 3. All three of our major regions posted growth in the mid to high teens in the third quarter, specifically, sales in APAC, EMEA and the rest of the world regions increased 14%, 17% and 19% respectively year-over-year. We remain committed to the financial targets that we outlined in the foundationâ\u0080\u0099s for growth program for the three year period ending December 31, 2023 which by way of reminder call for constant currency organic revenue to increase at a CAGR of at least 5% non-GAAP operating margins of at least 18% and cumulative free cash flow generated of more than $300 million. Similar to what we experienced in Q2 while our guidance assumed higher raw material costs and freight logistics expense year-over-year our third quarter results included incremental headwinds from higher than expected raw materials, and freight and logistics expenses, each of which represented headwinds to our non-GAAP gross margins of roughly 30 basis points on a year-over-year basis. Third quarter other expense net was 800,000 compared to 1.6 million last year, the change in other expense net was primarily related to decreased expense from realized and unrealized foreign currency losses compared to the prior period, partially offset by increased interest expense due to a higher effective interest rate year-over-year. We are very pleased with our profitability performance in the third quarter, where we delivered year-over-year growth in both non GAAP net income and diluted earnings per share of 23% exceeded the high end of our guidance range, which calls for low single digit net income and EPS. Total revenue for the nine months ended September 30, was 856.6 million, up to 61.3 million year-over-year, or 10% growth on a constant currency basis. Gross profit increased 7% year-over-year to approximately 416 million representing 48.5% of sales compared to 49% of sales in the prior period, a 50 basis point decrease year-over-year. The GAAP net revenue guidance range now assumes net revenue growth of approximately 6.6% to 7.1% in our cardiovascular segment, compared to 5% to 6% in our prior guidance range and net revenue growth of approximately 3.8% to 5.4% in our industry segment compared to our prior guidance which assumed a range of a 5% decline to an increase of 8% year-over-year. These margin expectations combined with a notable increase in our non-GAAP tax rate compared to last year, specifically 23% versus 13% in Q4, â\u0080\u009821, are expected to drive a change in non-GAAP net income and EPs in the range of down high single digits year-over-year on a low end to flat year-over-year on the high end of the range. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. Your line is open. The midpoint of our fourth quarter constant currency sales growth, expectations assumes roughly approximately 5%, constant currency growth year-over-year in the U.S. markets, and approximately 10%, constant currency growth year-over-year our O-U.S. markets. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open."
}