{
    "symbol": "ABBV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 17:02:03",
    "content": " Total net revenues of more than $58 billion were up by 5.1% on an operational basis, driven by impressive growth from SKYRIZI and RINVOQ which generated nearly $7.7 billion of combined sales in 2022. Robust performance from SKYRIZI and RINVOQ which we expect will collectively generate $11.1 billion of revenue, reflecting year-over-year growth of nearly 45%. Global HUMIRA sales were approximately $5.6 billion, up 6% on an operational basis with 9.9% growth in the U.S. partially offset by international, where revenues were down 16.9% operationally due to biosimilar competition. Similarly, U.S. Juvederm saw strong growth in the first quarter of the year but filler market declines throughout the second half of the year resulted in full year sales being down approximately 17% versus a robust 2021. And in our aesthetics pipeline, we expect to see results this year from several toxin programs including data from our Phase III study for Botox in platysma prominence with regulatory submission in the U.S. expected near the end of 2023 as well as data from our Phase III study for BOTOX in masseter muscle prominence, where we expect to submit regulatory applications in certain international markets in the second half of the year, including China and Canada. We expect immunology sales of $24.8 billion, including SKYRIZI sales of $7.4 billion, reflecting growth of more than $2.2 billion due to strong market share performance across all approved indications. RINVOQ revenue of $3.7 billion, reflecting growth of more than 45% with continued indication expansion and HUMIRA sales of $13.7 billion, including U.S. erosion of 37% and following a loss of exclusivity in late January. For aesthetics, we expect sales of $5.2 billion, including $2.5 billion from Botox Cosmetic and $1.4 billion from Juvederm, with growth rates expected to improve when we lap the market slowdown in the middle of the year. In the second half, you'll see because we've contracted rebates, you'll see a step-up in the price erosion, although you also will see more volume with biosimilars coming in the market in the middle of the year, we would expect more volume erosion. it's in the second half, what you'll see is in the second half, the overall erosion will step up and think of it as equivalent between price and volume because you're going to have -- we know we'll have rebate rates in some cases, increasing as well as the biosimilars coming to market, we expect to see more volume erosion. So as you think about -- as you're trying to triangulate the price volume with the guidance you've given, 27% vast majority's price, second half of the year, you'll have some more volume kicking in. We continue to see these, again, safety, high exposures, good PK, things that with -- if you combine with our preclinical data, makes us think it will, it has a potential to be best-in-class -- and that's triplet again with -- is -- first of all, to being tested, we'll have data this year to actually show how they behave together. Maybe just give us some context for what you're seeing there broadly versus what we could expect for the U.S. And just to be clear, when you see next year the impact from all the HUMIRA biosimilars, how much do you think that biosimilar STELARA may play a role here when you look at your assumptions for HUMIRA erosion?"
}