{
    "symbol": "USAC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 19:19:13",
    "content": " This morning, we released our financial results for the quarter ended March 31, 2022. Please note that information provided on this call speaks only to management's views as of today, May 3rd, and may no longer be accurate at the time of a replay. I'll now turn the call over to Eric Long, President and CEO of USA Compression. As usual, today, I'll first briefly cover the operational results for the first quarter, which was a solid start to the year. But given the ever-changing world in which we find ourselves, especially within the energy industry, I plan to spend more of my time talking about the current state of the market and where we see our business going for the remainder of the year. So to give you a glimpse, I think the tailwinds that we've cautiously talked about over the last few quarters have finally arrived and begun to blow in earnest. We have a very supportive macro environment, under guarded by tight supply/demand dynamics and a growing need for natural gas, leading to attractive commodity pricing. And while the first quarter was a good start, we are excited about the remainder of 2022, and we believe we will continue to see opportunities to increase the utilization and pricing of our fleet, driving returns for our unitholders. To maintain the high service level to which our customers have grown accustomed, our employees are on call 24 hours a day, driving over 1 million miles every month, day and night, maintaining and repairing the large industrial equipment that makes up our fleet. And I'm proud to say we have recently achieved another milestone, 4.5 million man-hours worked without a lost-time injury. We continue to deploy horsepower for customers out of the field, bumping our average horsepower utilization 2 percentage points from the fourth quarter to 2021, to just below 85%. And when you look at where we actually ended the period, we were up above 86%, an increase of more than 3 percentage points from December 31. These levels represent meaningful increases, the likes of which we haven't seen in a while and are illustrative of the overall positive market environment in which we find ourselves. In addition to strong utilization gains, we saw revenues increase both in aggregate as well as on a per horsepower per month basis. As a reminder, we once again maintained our distribution at $0.525 per unit, and when accounting for the distribution being paid this Friday, we have now returned over $1.3 billion to our unitholders since our IPO in 2013. While it has only been a few short months, the market environment of 2022 feels far different than the COVID OPEC plus period during 2020 and 2021. 2021 was generally a recovery year for the broader energy industry as our customers buoyed by strengthening commodity prices generally focused on balance sheet repair, CapEx moderation and a wait-and-see approach to the myriad of regulatory uncertainties introduced by the new administration since the elections in 2020. To remind you, during Q4 2021, crude oil averaged about $77 per barrel and natural gas about $4.75 per MMBtu. Production levels overall were up, in part driven by drilled and uncompleted DUCs reduction, which helped keep a lid on further price increases. The ratio of drilled to completed wells for the year was approximately 0.7%, which was almost 23% below 2020's ratio and the loss ratio since the EIA has begun tracking this statistic. We did see a nominal increase in rig counts, which was fortunate because without new drilling activity, the country as a whole would have run out of DUC sometime in the fall of 2021. The drawdown in DUCs allowed the industry to keep production going, to offset both natural decline and the reduction in new drilling and completion activity, but there is a limit to how much the DUCs can provide. Overall, the cloud of regulatory uncertainty and mixed inconsistent signals from our current administration kept a lot of industry participants from making the necessary level of growth CapEx and new investments during the year. So leading into 2022, the overall supply/demand situation had tightened dramatically, which helps support the commodity price environment and set the stage for a more active 2022. Rig count and production levels were up, driven by a very supportive commodity price environment and continuing strong current and expected demand. On April 20th, JPMorgan analyst noted that a prevailing levels of global spending on energy by 2030, growth and supplies from renewables, oil, natural gas, LNG, and coal is projected to lag growth in demand by 20%. Further, to remedy the supply/demand imbalance, JPMorgan estimates $1.3 trillion of incremental CapEx is required, an average of $140 billion over the next 9 years. It seems to me that some of the fallacies of the view that the march towards a 100% electric everything world, driven by 100% renewables for everything are now being pointed out. Spurred on by the EU's goal to quickly wean itself off Russian gas imports, countries across Europe and beyond are competing to secure reliable and cleaner energy supplies. In the face of the growing realities around the timing, cost, and reliability of renewable fuels, natural gas has taken a front seat in the ongoing discussion about energy in the future and we've seen what was a constructive commodity market in 2021 explode into an environment where security of production and supply of energy are foremost in world leaders minds. With the supportive environment, our customers have begun to make investment decisions that a year ago would not have been considered that is partly reflected in our revised capital spending plan in which we recently committed to buy an additional 20 large horsepower units to meet specific customer needs, particularly in West Texas and the Delaware Basin. Given the lead times for new units, half of these units are expected to be delivered towards the end of the year with the remaining half in early 2023. From our perspective, the fact that our customers are once again making long-term investment commitments in natural gas infrastructure is encouraging for our business and the industry more broadly. As we look to the remainder of 2022 and beyond, there remains real uncertainty across the economy in general and our industry in particular. Meanwhile, the domestic demand for natural gas, which powers a significant amount of electricity generation as well as industrial and petrochemical manufacturing continues. As of early March, domestic natural gas consumption was up 10.3 Bcf per day year-over-year, driven largely by a substantial uptick of 25% in industrial demand. In a country and a world that is continuing to use large amounts of natural gas on a daily basis, many are looking to the U.S. as a key source of supply. But as we mentioned, these actions take time, and they also require the confidence by the producers and midstream operators that governmental policies will not change with the political wins of the day. Crude oil has also seen positive demand signals as the world's economies have grown post-pandemic and populations across the world demand higher quality of living standards, which petroleum products have uniquely provided over the course of history. The EIA currently estimates demand for 2022 to be 99.8 million barrels per day, an increase over 2021, which was up over 2020. Further, 2023 demand is expected to further increase by approximately 2 million barrels per day. Combine that with increasing demand, with shrinking storage and you've got a recipe for continued strong commodity prices. While there have been releases of the strategic petroleum reserve, the impact on crude oil and gasoline prices has been minimal. You've seen the impact of these dynamics in both crude prices as well as closer to home in gasoline prices, which are as high as many can remember. Crude oil and to a lesser but growing degree, natural gas are global commodities that are subject to global market forces, and the last few months have really made that exceedingly clear to consumers across the globe. Here in the U.S., we benefit from an abundant supply of natural gas, which in the current market can be economically produced. As an example, natural gas production volumes in the Permian Basin are up 12% in the last 12 months. And in the Haynesville Shale, which is favorably located near many of the country's LNG export terminals, production volumes are also up 12% in the last 12 months as well. So you can see that producers are responding to the demand signals, and we will continue to work with our customers, not just in those areas, but across our diversified footprint to help get that natural gas to the market. Close to home, we have been working with customers as they identify areas in their own operations where USA Compression can lend our technical expertise to highly engineered requirements. As our industry works through not only what is possible, but more importantly, what is economical, we expect more opportunities for USA Compression to play a role in ESG-focused applications. Whether it is the relative slower adoption of electric vehicles due to price and accessibility, the ongoing strategic and political challenges of sourcing adequate rare metals and other raw materials, or simply the overall growth by major population centers like China and India to higher living standards, the challenges are not going away. No one knows exactly how it will play out into the future, but we have seen in years past, continued during the first quarter, demand for energy of all types worldwide is up, supplies of conventional energy sources are down, and we know of no technology that exists at commercial scale to backdrop the intermittent nature of renewable energy supplies. As such, we believe that the need for USA Compression services will continue far into the future. So as USA Compression continues through 2022, we expect to take advantage of this global need for energy providing superior compression services to our customers, both large and small. Natural gas remains a clean-burning abundant fuel that is easily transported throughout our country as well as the world and our customers are doing everything they can to help get that gas to end-users, whether here in our country or across the globe. While renewable sources of energy and more importantly, ways to economically store that energy when the supplies are unavailable will continue to play a part in the supply of energy. When you layer on top of all this, the uncertainty caused by a war in Eastern Europe, the services that USA Compression provides become that much more critical. Lastly, I want to provide a brief update on our dual drive offering, which as we've explained before, is a compression unit able to be powered by either natural gas or electricity providing our customer not only redundancy as it regards to the fuel source, but also the opportunity for significant emissions reduction. During the first quarter, we continued to progress with a retrofit and deployment of the dual drive technology, recently entering into multi-year contracts for a series of large horsepower units with an existing USA Compression customer. This retrofit of USAC's large horsepower fleet is a logical, practical, and proven economic solution involving greenhouse gas mitigation. As our work on dual drive continues throughout 2022 and beyond, we expect an uptick in customer inquiries as further electric infrastructure begins to be built out. The field-proven dual drive compression system allows companies to decrease emissions and permit their sites for electrical compression while still having the flexibility and redundancy to switch to natural gas when extreme temperatures, both summer, and winter put a strain on the power grid and utilities charge steep demand fees during resulting power outages. As a result, customers will realize lower operating expenses, increased reliability, 99% run time, substantially lower emissions of CO2 and methane, the mitigation of interconnect delays and optimized fuel cost. This quarter's payment will be the 37th quarter of distributions, returning over $1.3 billion to unitholders since our IPO. I've often talked about the stability of this business and having now worked through 8 quarters since a pandemic through the world into a mess, we have proven our ability to power through downturns. The last several years have really highlighted the attractiveness of the large horsepower compression business model, and we expect those tailwinds to not only continue but improve over the course of 2022. Today, USA Compression reported first quarter results including quarterly revenue of $163 million, adjusted EBITDA of $98 million, and DCF to limited partners of $50 million, all of which were in line with the quarter. As Eric mentioned, we saw pricing for the fleet as a whole increase during the first quarter, up to $16.87 per horsepower per month, reflecting the strengthening market for our compression services and contractual price escalators. Our adjusted gross margin as a percentage of revenue was 67% in the first quarter, a slight decrease from the previous quarter, which had benefited from some one-time offsets to expense. We achieved adjusted EBITDA for the first quarter of approximately $98 million, consistent with previous quarters. Average utilization for the first quarter was up 2 percentage points from the fourth quarter to just under 85%, illustrating the strengthening market mentioned earlier. Utilization at the end of the first quarter, though, was up almost 3.5% from the end of Q4. For the quarter, we had total expansion capital spending of $20 million, consisting of some new unit payments and reconfiguration of idle units. As Eric mentioned, during the first quarter, we did place orders for an additional 20 new large horsepower units for delivery in late 2022 and early 2023, which brings the total commitment for new units to 30 new large horsepower units. Based on the first quarter's results, the Board decided to keep the distribution consistent at $0.525 per unit, which resulted in a distributable flow coverage ratio of 0.98x. While lower than we would normally expect, we expect that ratio will improve over the course of the year as we deploy additional horsepower and fleet utilization improves. Consistent with prior quarters, our Board of Directors determines the quarterly distribution on a quarterly basis, and the Board can opt to maintain, reduce, or suspend the distribution as it deems most appropriate. At this point in the year, we are keeping our full year 2022 guidance unchanged, expect adjusted EBITDA between $406 million and $426 million and distributable cash flow of between $213 million and $233 million. Also, you may have noticed that late last week, a tranche of warrants with the right to purchase 5 million common units was exercised in full by the holders. So there's a lot of discussion about takeaway constraints from different basins with natural gas, particularly in the Permian. I think one of the things that we are clearly seeing with the bottlenecks and supply chain issues for access to new equipment, those of us who during the last couple of years downturn had some new vintage modern assets returned and went idle. As we mentioned in our prepared thoughts there, topics that utilization for the first quarter averaged 2 percentage points higher run rate at 3% higher Q-over-Q. So I think one of the reasons we saw a little bit light or we were a little light on coverage and our leverage was a little up was that we kind of pre-funded some of this conversion CapEx, make ready CapEx to deploy the equipment. Some of the larger -- particularly when you look at big volume projects coming out of the Permian, some of the bigger diameter lines, the lead times for this mega equipment have lengthened excessively. So I think from a competitive perspective, those of us who have equipment, there's just a couple of us are going to be the beneficiaries of that. We're increasing the rates on units that come off a primary term and go month-to-month to the extent that a little bit of equipment is being returned to us, we quickly redeploy it to other places at significantly higher rates. Just one thing to add is when you think back to the last few downturns, kind of the '08, '09 downturn and then the '14, '15, '16 time frame, in both of those, and I'll just draw the difference between where we are now, both of those previous ones, you had more of a buildup of equipment kind of leading into those downturns, both in '08, '09 as well as kind of the '14, '15. What we've seen in the industry over the last, call it, 6, 7, 8 years now is there's been a lot more discipline on the capital spending. So I think that's in part what's caused what Eric was talking about, which is this longer lead time. And versus coming out of kind of the '08, '09 and '14, '15, there just isn't a whole lot of extra equipment out there. So as we've seen oil prices go from $30 a barrel to $100 a barrel, you've seen refined lube oil prices increase proportionately, 2.5, 3x, we're able to pass that along to our customers. And interestingly, we've had a large -- a significant percentage of those folks come back. But when folks end up working 80, 90, 100 hours a week, for 6 months in a row with literally 7 days a week with no downtime in a period of 6 months that catches up in quality of life. Again, because of some of the long-term relationships that we've had with these folks, we've been able to lock in some nominal price increases over the course of 2022 and even on into 2023 as well. So I think we've done a very good job of getting ahead of the curve and unlike some industries that may be seeing 20%, 30%, 40%, 50% increases. You look at the day rates for drilling rigs, you look at the cost of frac sand, you look at the cost of frac fluids, the various elements that go into support the energy infrastructure, we've been able to mitigate a bunch of these operating costs with some operating efficiencies and honestly, just aggressive contracting coming out of this downturn. Generally the terms that we're talking about, our industry with big horsepower, typically somewhere in the 2 to 5, every now and then we'll see a 7-plus-year contract. But yes, the -- when we're looking at these new bigger horsepower units, 5 years is kind of down the fairway. At the end of the 5-year primary term, these units don't automatically get repriced and come home. But at the end of the 5-year term, it just doesn't automatically come home. So we typically either coming into the -- prior to the exploration of the 5 years or right afterwards, we enter into another term contract that are in the kind of the 3- to 5-year horizon again and extend the operational deployment time of those assets. These -- we have always talked about barriers to entry, but our industry with big horsepower has very large barriers to exit. And as Matt points out, there's 4 to 8 of these units on a given pad site and these pads may be moving anywhere between 30,000 barrels of oil and 100 million cubic feet of gas a day. They've developed these big central facilities on a hub-and-spoke basis where they'll develop pad site 1, drill, develop, move to another pad site to and then interconnect that new pad site or multiple pad sites with gathering lines to provide the oil and the gas back to the central facilities. You got to paint the thing, you got to do some control valves, and do a little bit of work, site vessels and electronic gizmos and stuff to get it ready to go out in the field, but it's a small percentage of CapEx costs versus buying a brand new unit or even reconfiguring a unit. The first quarter of 2022 kicked off a year in which we expect continued growth in activity across the energy industry, starting with the upstream producers. The quarter reflected solid operations with some positive trends as we move through the quarter, including utilization and pricing gains and increased quoting activity. In order to be ready for demand that we see coming, we will continue to prepare our idle fleet for redeployment to the field as well as selectively make capital investments in new units earmarked for specific customers and infrastructure applications. Natural gas prices and production continue onward and upward for now, and the ever-important need for natural gas has only become more so, given the global political events currently taking place. One thing has not changed, the fundamental driver of our business is the demand for and the production of natural gas."
}