{
    "symbol": "WEST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 20:40:05",
    "content": " Finally, I want to thank the team at Westrock Coffee, who in spite of the unimaginable headwinds of quickly inflating cost and the attendance suppression of consumer demand brought about by this substantial rise and gas prices this summer, still manage to deliver adjusted EBITDA growth of roughly 30% year-over-year. Our beverage solution segment contributed $173.5 million in net sales, which represents year over year growth of 25% and adjusted EBITDA at $15.9 million, which represents year over year growth of 39%. Turning to our sustainable sourcing and traceability segment, our SS&T, sales net of inner segment revenues grew 34% to $56.8 million in the third quarter of 2022, primarily driven by higher average green coffee prices. During the quarter, we incurred approximately $7.8 million in capital expenditures, approximately $4 million with gross CapEx tied to single serve expansion in our Little Rock, Arkansas facility and extracts capacity expansion in our Concord, North Carolina facility with a balance being spent on customer beverage, equipment and maintenance,  Turning to our extract and ready-to-drink facility in Conway, Arkansas. While this represents year over year growth of 26% and net sales and 29% in adjusted EBITDA, it's approximately$ 69 million in net sales and $8.4 million in adjusted EBITDA behind where we previously planned to be at the end of the third quarter. Roughly half of our adjusted EBITDA shortfall is attributable to lower volumes in 2022, and roughly half of it is attributable to the natural lag that occurs as our higher material in production costs get pushed through to our customers pursuant to their respective pricing formulas over the next two to four quarters. Some of that will pick back up over the next four to six quarters as we reprice cost through people's contracts and all of which, if you're looking at it the way I do, and I don't mean this in any kind of grandiose way, but if you're looking at the business for what you think it can be over the next three to five years, it's kind of all immaterial because what we're talking about in Phase 1 is as big as an EBITDA generator as our whole business is today."
}