{
    "symbol": "WEST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 23:15:32",
    "content": " These advances, coupled with the recent arrival in on-boarding of our long-delayed manufacturing equipment have set us up for another record year in 2023, even as we continued to spend as needed to build the scaled platform necessary to monetize the value of our new Conway extracts and RTD plant, which when fully online is set to expand our EBITDA, not by percentage factors, but quite possibly by multiples. Total company net sales for the fourth quarter increased 20% year-over-year to $227.7 million, while gross profit excluding the impact of mark-to-market adjustments decreased $1 million to $37 million. Despite these headwinds, our consolidated adjusted EBITDA for the fourth quarter was $17.5 million, an increase of approximately 23% compared to the fourth quarter of 2021, driven by reductions in SG&A, primarily related to personnel cost savings. On a segment basis, our beverage solutions segment contributed $192.6 million in net sales for the fourth quarter of 2022, which represents year-over-year growth of 28%. For the full year, our beverage solutions segment generated $54 million adjusted EBITDA, a 30% increase over 2021, driven by 50% growth in our single-serve cut volumes and 8% growth in our flavors, extracts and ingredients products, which were partially offset by a 7% decrease in roast and ground coffee volumes. Turning towards our sustainable sourcing and traceability segment or SS&T, sales net of intersegment revenues were $35.1 million during the fourth quarter of 2022, a decrease of 12% compared to the fourth quarter 2021. For the full year, our SS&T segment contributed sales net of intersegment revenues of $182.6 million and adjusted EBITDA of $6.1 million growing 24% and 7%, respectively, compared to 2021. On a project basis, we continued to anticipate that the total CapEx cost of Phases 1 and 2 of our Conway extract and RTD facility will be $275 million and that once itâ\u0080\u0099s fully online, we will generate approximately $100 million in EBITDA per year. The other thing that I am excited about this year, is that we have got a number of new customer and new product wins and the lionâ\u0080\u0099s share of those wins are in our single-serve in our extracts out of the business, which as we talked about our growth algorithm and being able to move to the higher margin part of the business, being able to accelerate that into 2023 recognizing that thatâ\u0080\u0099s going to be a huge part of the story in 2024, is a huge plus, and I guess, tailwind for the business."
}