{
    "symbol": "MPAA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-14 18:31:04",
    "content": " As announced this morning, we delivered record net sales of $650.3 million for fiscal 2022, representing a year-over-year increase of 20.3%. We secured multi-year new business commitments and opportunities of more than $100 million, primarily across multiple brake-related products. All of these accomplishments enable us to resume annual guidance, which at the top range is estimated to reach $700 million in net sales this fiscal year, representing a year-over-year increase of $49.7 million based on our current visibility, notwithstanding potential quarter-to-quarter fluctuation due to timing of orders. Excluding $13.3 million of core revenue realized in our previous fiscal year, which the company does not expect to -- does not expect in fiscal 2023, net sales are expected to increase between 6.8% and 9.9% in fiscal year 2023. Operating income is expected to be between $57 million and $61 million before the non-economic, non-cash foreign exchange impact of lease liabilities and forward contracts, the non-economic non-cash impact of revaluation of cores on customer shelves and supply chain disruptions and costs related to COVID 19. We estimate other non-cash items will be approximately $21 million, including core and finished goods, premium amortization and share-based compensation and cash expenses will be approximately $2 million for special electric vehicle related research and development expenses, impacting operating income. In summary, operating income before the impact of the non-cash and cash items and before depreciation and amortization, as previously mentioned is expected to be between $93 million and $97 million. However, for the full fiscal year, net sales, as Selwyn mentioned increased 20.3% to a record $650.3 million from $540.8 million a year earlier. Before moving on, I should note that there were no ramp up and transition expenses related to our Mexico expansion this quarter, nor the third quarter, compared with $4.8 million in a prior year fourth quarter. This includes non-cash items totalling $1.9 million or $0.10 cents per share, and primarily transitory cost pressures related to supply chain disruptions, totaling $3.2 million or $0.17 per share. I should also note that reported net loss reflects $4 million in interest spent compared with a $3.7 million for last year, primarily due to higher interest rates on the accounts receivable discount programs offered by our customers and higher borrowings. This includes the non-cash items totaling $6.9 million or $0.35 per diluted share and cash items totalling $6.8 million or $0.35 per diluted share, primarily related to brake caliber or start-up costs and other product relocation expenses related to expansion in Mexico and corporate related expenses. EBITDA was impacted by $2.5 million of non-cash items as well as $4.3 million in cash items, primarily due to the transitory cost pressures related to supply chain disruptions. EBITDA was impacted by $9.2 million of non-cash items as well as $8.8 million of cash expenses, primarily related to brake caliber startup costs and another product relocation expenses related to the expansion in Mexico. Net sales included $13.3 million in core revenue compared with $12.8 million in the prior year period, due to a realignment of inventory at customer distribution centers with expected future sales benefits as product mix changes. Net income for fiscal '22 was $7.4 million or $0.38 per diluted share, compared with net income of $21.5 million or $1.11 per diluted share a year ago. For example, for the prior fiscal year 2021, the foreign exchange impact of lease liabilities and foreign contracts was a favorable pre-tax gain of $17.6 million, which resulted in a total non-cash favorable impact of only $80,000 or $0.00 per diluted share. In the current fiscal year '22, there was only a favorable pre-tax gain of $1.7 million from the foreign exchange impact of lease liabilities and forward contracts, which resulted in a total non-cash impact of $16.8 million or $0.86 per share as detailed in Exhibit 2 in this morning's earnings press release. EBITDA was impacted by $22.3 million of non-cash items as well as $18.5 million in cash items, primarily due to the transitory cost pressures related to supply chain disruptions. EBITDA was impacted by only $107,000 of non-cash net gains as well as $19.4 million in cash items, primarily related to brake caliper startup costs and other product relocation expenses related to the expansion in Mexico."
}