{
    "symbol": "MPAA",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-09 19:08:08",
    "content": " Net income before impacting items for the first half was $21.8 million or $1.11 per diluted share versus $15.1 million or $0.78 per diluted share for last year, and $14.5 million or $0.75 per diluted share for the pre-COVID fiscal 2020 period. Net sales for the fiscal '22 second quarter increased 13.5% to $175.5 million from $154.7 million a year ago, and 16.7% from the pre-COVID-19 fiscal second quarter two years ago. Net sales for the three months ended September 30, 2021 included $13.7 million in core revenue, compared with $12.8 million in the prior year second quarter period, due to a realignment of inventory at customer distribution centers with expected future sales benefits as product mix changes. The quarter's gross margin was negatively impacted by an aggregate of 5.1% comprised of the following, 3.1% due to higher freight costs and other expenses related to COVID, 0.5% for brake caliper startup costs and relocation transition expenses, and 1.8% non-cash core and finished goods premium amortization impacting sales, partially offset by net 0.3% favorable impact for non-cash revaluation of course and customer shelves and gain from core revenue. We also incurred higher freight and other costs of approximately $5.1 million for the fiscal '22 second quarter, due to a shortage of freight and supply chain inefficiencies caused by COVID as someone noted earlier. Net income for the fiscal '22 second quarter was $3.7 million or $0.19 per diluted share, compared with a net income of $15.2 million or $0.78 per share a year ago. In addition to the items impacting gross margin discussed previously, I should emphasize the non-cash non-economic foreign exchange impact of lease liabilities and forward contracts totaled $7.9 million on a pre-tax basis, or $0.30 per diluted share on a tax effective basis for the quarter compared to the prior-year. Net sales for the fiscal '22 six months period increased 29.8% to $324.6 million from $250.1 million a year earlier, and 25.1% from the pre COVID-19 fiscal six months period two years ago. Net sales for the six months ended September 30, 2021 included $13.7 million in core revenue, compared with $12.8 million for the prior-year period as I discussed. I should emphasize the non-cash non-economic foreign exchange impact of lease liabilities and forward contracts totaled $10.2 million on a pre-tax basis, or $0.39 per share on a tax effective basis for the six months period compared with the prior-year. Net cash used and operating activities during this fiscal year '22 second quarter was $19.6 million and during the fiscal year '22 six months period was $24.3 million, reflecting working capital requirements to support the company's record sales, and anticipated growth, while considering supply chain challenges due to COVID and the upcoming impact on the industry of the Chinese New Year holiday shutdown. In short, we take this metric, which was approximately $87.3 million for the 12 months ended September 30, 2021 and divided by the average equity and net debt balance of $414 million, resulting in a 21.1% pre-tax return on invested capital, compared with 17.5% a year earlier. It's all part of that $5.5 million, which impacted the quarter, 3.1% on the gross margin percentage. Yes, so I think you see the percentages of the total come down for rotating electrical, but rotating electrical is up, just that we have such fantastic growth in the brake related products, you can see that, the percentage of revenue has gone from 7% to 14%, but that's despite rotating electrical increases as well. There is probably $15 million to $20 million incremental revenue in demand for the quarter that we could have probably shipped, so and that's -- take it with a little bit of a grain of salt because some orders are shipped and canceled very hard to get the exact number of what gets deferred."
}