{
    "symbol": "MCS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 17:09:05",
    "content": " In theaters, our customers continue to come out of the home for the big screen theatrical viewing experience to see a slate of films that included some great quality blockbusters but was lighter on quantity than compared to the fourth quarter last year. Consolidated revenues were $163 million in the fourth quarter, a decrease of 3.6% compared to the prior year quarter as the growth in our Hotels and Resorts division could not overcome the revenue headwinds in our Theater division. For the full year fiscal 2022, consolidated revenues were $677 million, a decrease -- a nearly 48% increase from the prior year, and adjusted EBITDA was $85 million and over 142% increase from the prior year. Breaking out the fourth quarter numbers for the 8 comparable hotels more specifically, our overall RevPAR decrease during fiscal 2022 4th quarter compared to fiscal 2019 was due to a 15.3% increase in our average daily rate or ADR, offset by an overall occupancy rate decrease of approximately 11 percentage points. According to data received from Smith Travel Research for the fiscal 2022 and fiscal 2019 periods and compiled by us in order to evaluate our results, comparable competitive hotels in our markets experienced a decrease in RevPAR of 5% for the fiscal fourth quarter compared to the fourth quarter of fiscal 2019. For the full year fiscal 2022, comparable competitive hotels in our markets experienced a decrease in RevPAR of 7.8% compared to fiscal 2019, indicating that our RevPAR decrease of 3.5% during this period outperformed by approximately 4.3 percentage points for the year. Finally, as group business continued to return, our banquet and catering operations continue to drive growth in food and beverage revenues, which were up 34% in the fourth quarter of fiscal 2022 compared to the prior year. Our fourth quarter fiscal 2022 admission revenues decreased 19.6% compared to the fourth quarter of 2021, with an attendance decrease of 24% driven by a reduced number of wide release films debuting during the quarter with 22 wide releases in the fourth quarter of fiscal 2022 compared to 26 in the prior year quarter. The increase in average admission price in the quarter was significantly impacted by an increase in our 3D ticket sales, which accounted for half of the increase and were 12% of tickets sold in the fourth quarter of 2022 compared to less than 1% of tickets sold in the prior year quarter. Our average concession food and beverage revenues per person at our comparable theaters increased by 11.1% during the fourth quarter of fiscal 2022 compared to last year, driven by inflationary price increases implemented during the year, a higher food and beverage hit rate, which we define as the ratio of food and beverage transactions to box office transactions and due to higher check averages across our circuit. When compared to the fourth quarter of fiscal 2019, our per capita average concession food and beverage revenues increased by 33.4% which we believe is the result of several factors, including our industry-leading mix of nontraditional food and beverage options, the emphasis we are placing on ordering through our mobile app as well as pricing changes. While we invested in our businesses and reduced debt, we also returned $3 million in capital to shareholders in fiscal 2022 by reinstating our quarterly dividend in the third quarter of the year."
}