{
    "symbol": "C",
    "quarter": 1,
    "year": 2021,
    "date": "2021-04-15 15:50:10",
    "content": " And so as we look at the -- as we look at the investments we're making, I look at the ones that we're making in our infrastructure, in our data as very much linked into a strategic need, as well as what's being required and asked of us from the consent orders. And what I referenced was, I talked about in the last quarter, the normalization of the markets' wallets and what we're seeing just at the on start of this year and the strong start that Jane referenced is that while I do expect there'll be some normalization, I would expect at this point that the market wallets will be above the 2019 levels. But what I will say is, as you see what we shared on the page that it's roughly breakeven in 2020, and we all recognize in 2020 there were significant reserves established in light of the pandemic, what I'd say is if we would look at 2019, which would have been a more normalized year, the EBIT associated with the 13 markets would have been a little bit under $1 billion or so. I mean as we see a more normal -- when we see a normalized rate environment, we get the strategy there, a mid-tier range seems reasonable, but I would certainly add and let us do the work, because I want to make sure that we have a very thoughtful strategy and we've got clarity around it. The only thing I'd emphasize in terms of kind of what's different now as we go at this is -- or the last couple of points you made, which is that keen focus on making sure that you've got -- that we've got the right talent in the right places as we go through this strategy refresh and ensuring that the org structure supports that. On the corporate ICG side, similarly, we're certainly seeing good signs as it relates to the markets activity, we've talked about that, and that's continued since last year. And now as we sit here and see all the signs of recovery that you've heard us mention, it's about a responsible reopening, right, and ensuring that we're targeting the customers that we want longer term, the existing customers that we're opening line availability to them where that makes sense, in the case of our Retail Services that we are pursuing new account acquisitions both there as well as in Branded Cards."
}