{
    "symbol": "C",
    "quarter": 3,
    "year": 2021,
    "date": "2021-10-14 13:42:07",
    "content": " In the institutional client's group, we grew revenues by 4% year-over-year as we continue to see strong client engagement with momentum in Investment Banking, equity markets, and Securities Services more than offsetting the 16% decline in the fixed income market. Revenues declined 1% from the prior year, excluding the loss on the sale, revenues would have been up 3%, largely driven by Investment Banking fees, as well as strong growth in Equity Markets and Securities Services. Excluding this impact, loans would have been up 1% year-over-year, driven by active client engagement in TTS, Private Bank, and end-of-period of-period deposits were up 6% year-over-year, reflecting continued engagement with our consumer and corporate clients, as well as continued momentum in client acquisition and deepening across both corporate clients and consumers. On the banking side, revenues were up 11% and Treasury and Trade Solutions continued growth in fee revenues of 20% year-over-year, the highest quarter for fees in a decade reflected solid client engagement and client acquisition, as well as a recovery in commercial Card revenues. Investment Banking revenues were up 39% year-over-year, largely driven by M&A as we continue to see the benefits from our front office investments, which positioned us well to take advantage of increased deal activity. Finally, looking at year-to-date results in ICG, we've seen a strong contribution from Investment Banking and Equity Markets, as well as solid results in the Private Bank and Securities Services, which helped to offset the expected normalization and fixed income markets. Looking at International Consumer overall, we're seeing good momentum and investment management with 10% growth in assets under management, primarily driven by Asia, and the growth is meaningfully higher if you look specifically at the four international Wealth hubs. Our institutional client business around the world means that we've got top 2 platforms for our Private Banking clients, in particular, to take advantage of, but it's also ones that our consumer clients have as well, so the opportunity here is to bring all these different pieces together into a single integrated offering across the full spectrum of clients in the U.S. and in the global offshore Wealth centers."
}