{
    "symbol": "OSG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 15:35:04",
    "content": " Time charter equivalent earnings for the second quarter exceeded $100 million for the first time in two years, and adjusted EBITDA of $31.5 million represents the best quarterly performance on this metric in many years. With conventional tankers fixing in the mid 60s and our ATB fixtures concluded in the mid 40s, this book of new business should generate nearly $275 million of time charter equivalent revenues to be realized over the next 3.5 years. The combined vessel operating contribution of our niche market activities, ATBs and Alaskan crude oil tankers provided a vessel operating contribution in the current quarter of $29 million compared to $29.6 million in the first quarter, continuing their consistent performance. Compared to the second quarter of 2021 this represents a $21.3 million increase, reflecting improved market conditions and increased rates as well as the return of vessels to service. For the final two quarters of 2022 combined, we now expect to achieve time charter equivalent earnings of about $210 million and for adjusted EBITDA to approach $70 million for the six month period. Our current forecast has time charter equivalent earnings for 2023 approaching $400 million on a reduced fleet size due to redelivery of vessels with expiring bareboat contracts, factoring in some allowance for anticipated cost increases, attaining this top-line result to generate adjusted EBITDA of $130 million to $135 million across all of 2023. Thank you for the 3Q and 4Q, but also just love seeing that the debt is going down every quarter, your cash is going up, you alluded to ending the year at around $100 million you're going to generate another $50 million plus next year. But just talk to us, we did see that $5 million share buyback going place in June, but it really seems like things are going to change meaningfully from the balance sheet perspective, just fast forwarding towards the end of next year with that probably closer to something in the 300s, and cash in the $150 million\n Yes."
}