{
    "symbol": "CVLT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-03 12:55:28",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Commvault Fourth Quarter Fiscal Year 2022 Earnings Conference Call. And I'm joined by Sanjay Mirchandani, Commvault's CEO; and Brian Carolan, Commvault's CFO. Statements made on today's call will include forward-looking statements about Commvault future expectations, plans, and prospects. During this call, Commvault's financial results are presented on a non-GAAP basis. We closed the year on a high note, posting record quarterly revenue, EBIT, and EPS. Q4 software revenue of $101 million was a new milestone for the company, and we crossed $200 million in total revenue for the second consecutive quarter. Our growth was driven by the continued traction of our software and SaaS offerings, increased multi-product adoption, and through large deals. Additionally, Metallic continue to scale and contribute meaningfully to our revenue and customer growth. As we accelerate our recurring revenue journey, we are increasingly focused on ARR as a barometer of our future growth potential. Over 80% of our revenue is now recurring in nature, and growing. At March 31, subscription in SaaS ARR increased 46% year-on-year to $346 million, and now represents 59% of total ARR. And I'm pleased to report that I in just six quarters of commercial availability, Metallic has exceeded $50 million in ARR. Its growth is extraordinary, customers love it, and we love it. Brian will discuss the financial highlights in a moment, but let's first discuss the year ahead. Over the past three years, we've assembled a world-class leadership team with deep domain expertise in cloud and SaaS. And today's data protection market, especially data management as a service is at a tipping point. You see, it's rare to have three critical drivers converging at once. One, our heritage is grounded in solving very hard and complex data problems for customers. Two, we continuously innovate elegant and industry-leading solutions to these problems in software and SaaS. And three, our execution engine is humming as is proven by the results we're sharing today. They're contending with multiple generations of data, and new and different workloads. Well-funded bad actors are using ransomware and other threats to take organizations, infrastructures, and data hostage. All of which are creating what I call IT collision, putting more pressure on, often, siloed IT and security teams who are entrusted to protect data while moving to the cloud. For 26 years, Commvault has helped solve these hard problems, and provided customers' piece of mind, that their data is secure and readily available. That's why government agencies that demand the highest security and capabilities, like the U.S. Coast Guard, the U.S. Air Force, and Space Ministry of Justice, all chose Commvault for their data protection needs. We do this for any workload and any customer environment, one provider, one platform, for a multitude of data management needs. Additionally, as many of our customers straddle both on-prem and cloud environments, they need a solution that can flex and scale to meet their evolving needs. Having moved several   of customer data to the cloud over the past few years, we enable this transformation. For example, in Q4, we displaced the incumbent vendors, a legacy and an upstart, and welcomed Fincantieri, one of the world's largest shipbuilders to our roster. They chose us to protect their on-prem workloads and thousands of VMs, migrate their Office 365 mailbox to the cloud, and provide cloud-based immutable copies of their data against ransomware, all through our unified platform. And speaking of ransomware, when customers are staring down an unfortunate attack, our teams are there to help them get back to work. Not only did we save their data, but it opened the door to an expanded relationship as we were the only provider to meet the company's ransomware, multi-cloud automation, and integration needs. Over the past two years, we've delivered consistent revenue growth while accelerating our transition from perpetual to subscription software. Today, our software, combined with Metallic, offers customers the unified solutions they need to address the complexity and collision of systems, workloads, and competing IT and security priorities. For example, an existing Commvault customer, a multinational software and services provider, recently expanded their on-prem data management capabilities across their entire footprint, and added HyperScale X and Metallic to accelerate the cloud transition. This quarter we saw 80% year-on-year growth in the number of customers with more than one product, which drives higher ASP, higher lifetime value, and higher recurring revenue. We've put in the hard work and we are ready to lean into our future as the cloud management -- sorry, cloud data management company. Before I turn the call over to Brian to discuss our results, I want to recognize him and the announcement we made today. Gary has held several senior roles at Commvault including Chief Accounting Officer, and most recently, as Chief of Business Operations. Importantly, Gary has been leading our transformation initiatives that allow to build a modernized business platform and positioned us for accelerated growth. After more than 21 successful years with Commvault, I have decided that's the right time for me both professionally and personally to move on. Now, let's talk about the FY'22 results, the best year in our company's history. Subscription license sales represented 77% of total software revenue, an increase from 71% last quarter and 59% a year ago. Revenue from software transactions over $100,000 increased 19% year-over-year, and represented 73% of software revenue. And the average deal size increased 4% to approximately $327,000. As Sanjay noted earlier, Metallic ARR crossed the $50 million milestone during the quarter. On a constant currency basis, ARRR was up 14% year-over-year. Total recurring revenue, which includes subscription software, maintenance support services and SaaS, grew 19% year-over-year to $173 million. Recurring revenue represented 84% of total revenue in the quarter, an increase from 76% a year-ago. Consolidated gross margin reflects an increased mix of SaaS revenue, which expectedly carries a higher cost of sales than software. Non-GAAP EBIT increased 20% year-over-year to a record of approximately $47 million, and non-GAAP EBIT margins improved 230 basis points year-over-year to 22.6%. For the quarter, we generated approximately $87 million of free cash flow, growth in free cash flow was driven by strong Q3 performance, growth in deferred revenue related to Metallic, and timing of payrolls. We ended the quarter with no debt and approximately $268 million in cash on the balance sheet, of which, over 70% sits overseas. In Q4, we repurchased approximately 600,000 shares of our common stock for $40 million. We expect Q1 software revenue of approximately $89 million, and total revenue of approximately $195 million. Due to the ongoing geopolitical uncertainty, we are closely monitoring potential risks to our business, particularly customer's spending patterns in Europe. Also note, Russian operations previously contributed approximately 1% of total revenue, which is factored into near-term guidance. We expect total expenses, including cost of sales and operating expenses to up approximately 8% year-over-year. As we start the new fiscal year, I will take a moment to update you on our progress towards the targets we laid out during our January, 2021 Investor event. At that time, we outlined our plan to transition to a recurring revenue model, characterized by sustainable growth, improved profitability, strong free cash flow, and an attractive capital return policy. Our software and total revenue is currently tracking at or above the target, while ARR is currently tracking materially above target. This improvement was driven by accelerating revenue growth and significant margin expansion, all while scaling a hyper growth SaaS platform. While SaaS was not a major focal point of the Investor event, I'm pleased to report that Metallic is pacing well ahead of expectations. Factoring in the success and momentum of Metallic, we now believe that FY'23 non-GAAP EBIT margins should be in the low 20% range, currently reflected in consensus estimates. From a capital return perspective, since the time of the event through March 31, 2022, we repurchased approximately 5.2 million shares for $367 million. In FY'23, we expect to continue with our existing practice to return approximately 75% of free cash flow over time. To recap, fiscal year '22 was a record year for Commvault, and we intend to build on that momentum in fiscal year '23. Overall market demand is healthy, the power of and is resonating with customers and partners, and our team is executing. In fiscal year '23, we expect to accelerate our growth and lead the cloud data management wave. It is our year, it's our time. So, yes, I mean we've made great progress towards our targets that we laid out in January, 2021, and we're tracking at or above all the top line ones. And, obviously, you guys have moved the model more towards software, but there's still some hardware element with HyperScale, for example. Well, the past couple of quarters, we've been keeping a real eye on not just our piece of the deal, but the hardware that supports our software. And so, for the past couple of quarters, we've been able to successfully de-risk it. It's not a perfect science, but we're keeping a real eye on it. The flipside is if the workload lends itself to a SaaS-based delivery, we've got Metallic, and customers lean in on that. Looks like -- it sounds like Metallic is doing really well, going very nicely, you guys are executing on that. Well, customer growth was just shy of, I think, 500 new customers last quarter. We've also got a great consistent overlap of customers having more than -- having Metallic and software, over 50% of our customers have both. So, we're seeing, if my numbers are right, I think they are, we're seeing a great traction on size of customers, there's small, medium, large, we're seeing velocity, and we're seeing the power of and in action. At some point, we'll share more details about the deal size and other metrics that you'd be interested in, but we think sharing the $50 million ARR milestone was kind of important. It's our objective at this point, Jason. And we may see a balance that is more pronounced as a -- as we shipped more revenue growth than margin growth, but that's -- it's too early in time to change that. We'll update you another time during the year, at another investor event. So, our growth was somewhat dampened by foreign exchange, by 200 to 300 basis points with revenue. If we just sort of divide by four on the $50 million ARR, I know that's not exact, but it's sort of rough, let's just say, $10 million to $12 million kind of revenue for Metallic in Q4 …\n Yes, we'll -- yes, go ahead. I was just going say, and -- when I subtract that from the services line, so what I'm left is support and professional services, which would be kind of in the low 90s, which basically is flat with like two years ago. But we're seeing an accelerating SaaS growth in terms of the recognized revenue, and that's going to carry over the course of time. So, $50 million as an ARR, I don't know if you can exactly divide it by four if you take that accelerated. And on the rest of the services, what we're doing is we've been at this for several years now that we're programmatically and strategically converting many of our professional customers to new subscription in SaaS offerings. And as we build more automation, as we invest more into our channel, as we do more cloud-enabled delivery, our professional services continues to play an important for this rightsizing. You had a small acquisition in the quarter, wondering what the contribution was revenue-wise. So, that's on track as part of the -- yes, that was our primary focus. The revenue streams that they had, that the acquisition, the company we acquired had, continue. I would say if I have to use one word, I would say, it's increasing. If you see the number of deals we did in the past couple of quarters over $100,000 or over $1 million, we see those increasing. They -- I gave three examples in my prepared comments about how customers are leveraging the single unified platform for more complex ransomware protection, for cloud-based transformation, for broader digital transformation, data management. And if you -- some of the numbers you'll see, Eric, it's that for us productivity across the board in the company has been a massive priority over the past three years. Ladies and gentlemen, this concludes today's conference call."
}