{
    "symbol": "EVEX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 22:36:04",
    "content": " At this time, I'll now turn the conference over to Lucio Aldworth, Head of Investor Relations. I have here with me, Co-CEOs Jerry DeMuro, and Andre Stein, as well as our CFO, Eduardo Couto. We also have Luiz Valentini, our Chief Technology Officer, who's responsible for the development of our eVTOL. After the initial remarks, we're going to open the call for questions. We have prepared the deck with a few slides and additional information, which is available at our Investor Relations website at ir.eveairmobility.com. Let me first start by mentioning that this presentation includes forward-looking statements, or statements about events or circumstances that have not yet occurred. These forward-looking statements are subject to risks, uncertainties and assumptions, including, among other things, general economic, political, and business conditions, both in Brazil and in our market. The words believe, may, will, estimate, continuous, anticipates, intends, expects and similar words are intended to identify forward-looking statements. We take no obligations to update publicly or revise any forward looking statements because of new information, future events, or other factors. This is an exciting time Eve, and I'm proud to be part of the team that has achieved this important milestone. For those not familiar with our recent merger with Zanite Acquisition Corporation, the transaction includes a number of strategic and financial investors that raised a combined $377 million as shown on Slide 2. Our most notable and relevant strategic investor is Embraer, the third largest aircraft manufacturer, and a leader in the regional and executive jet market. Our long-term agreement with Embraer yields an unmatched position of development capabilities and cost advantages, it means we do not have to create this workforce from scratch, and then shape it into a cohesive team. When coupled with attractive labor costs in Brazil, this arrangement will substantially reduce our development costs. Lastly, our partnership with Embraer also gives us access to its global infrastructure. This is critical not only to our development and certification efforts, but also to service and support of aircraft on a global basis. The combination of Embraerâ\u0080\u0099s partnership and our holistic approach of Urban Air Mobility along with superior aircraft design, have translated into what we believe to be the largest and most diversified order book for eVTOLs globally. These are operators from around the globe, with different aviation backgrounds, including fixed wing and helicopter operators, rideshare providers, and more recently, a defense player with the potential to expand the applications of our UAM solutions. Now, I would like to invite my colleague and Co-CEO, Andre Stein to give us a bit more color on the development program and the aircraft itself. We have come a long way, and there is a lot more ground to cover, but you are clearly moving in the right direction. We have already kick started the certification process of our eVTOL with Brazil's Aviation Authority, ANACC, and initiated conversations with the FAA in U.S., EASA in Europe and other major certification authorities as well. It is important to highlight that we will receive undivided attention from ANACC, while the certification authorities in the U.S. and Europe will be busy dealing with multiple problems at the same time. The Brazilian authorities have a long history of collaboration and bilateral agreements with the FAA, whereby it affects and validates the work done by ANACC requiring only a few additional tests. We believe this puts Eve on a clear path to certification, especially when combined with our simpler design with fixed wings and lift-plus-cruise configuration. They too, for example received the simultaneous certification approval in Brazil, the U.S. and Europe on schedule within specs and budget And we also took important steps to optimize the plans for our manufacturing facilities and supply chain strategy by partnering with Porsche Consulting. They will bring expertise that will help us plan for future productions, supply chain logistics and to scale our business. In parallel, we are performing several tests in our Proof-Of-Concepts, Wind Tunnel Models, RIGs, Flight Simulators, and Mock-Ups. We collect important information to better address the needs of the passengers, partners and the community when it comes to the use of eVTOLs for urban mobility. We hosted last month our First Advisory Board in Europe, where we brought several of our customers to discuss the whole spectrum of our portfolio of Urban Air Mobility solutions, including aircraft characteristic such as performance and user experience. This cabin was later shown for the first time to the public at the Farnborough Airshow, and it showcased our approach to a human centered design and reflects market needs such as accessibility and safety perception, as well as our own emphasis on sustainability. Last but not least, we also disclosed at the Farnborough Airshow the current design of our aircraft that we can see on the left of the slide, featuring a conventional wing and tail. It's important to highlight that as a part of our development process and based on all the background work that has been done so far, we have been evaluating variations of our lift-plus-cruise configuration. The aircraft remains simple in design with eight lifters and pushers, allowing for a reliable and safe platform designed for vertical takeoff and landing and avoiding moving parts. Next on this Slide 5, Jerry will talk about our partners and how important they are to Eve. A number of these partners are also investors in our pipeline, so they do have skin in the game and their participation reflects the fact that they share our belief and vision for the UAM industry. These partners cover the full spectrum with the UAM ecosystem offering operational support, infrastructure design and build-out for technical expertise in the design of critical components of our aircraft such as motors, avionics, and propulsion systems. The list of aviation partners includes leading aircraft operators across the globe such as SkyWest and Republic, as well as important leasing companies like Azorra and Falko. In sum, we have partners involved in every aspect of UAM market. As I noted earlier, we have already received more than 2,009 binding orders from 22 different customers, which we believe to be the largest and most diversified order book for eVTOL in the world today. Not only do these customers include helicopters and fixed wing operators, and leasing companies as well as rideshare platforms, more recently, we signed an agreement with BAE Systems and Embraer, which will jointly pursue defense applications as well, while Eve can remain focused on Urban Air Mobility. Now, I'll turn it over to Edu and talk a bit about our financial position. This is a very exciting moment for us as we were able to secure significant funding for our program, while bringing strong partners to join our project. Turning to our financials on Slide 7, I would like to start with the income statement highlights. Weâ\u0080\u0099re the only eVTOL company with a complete solution, including the vehicle, service and support and air traffic control. In addition to the R&D expenses, we also had $6.5 million in SG&A expenses during the second quarter '22, and $7.3 million in the first six months this year. Given those expenses and considering we are still a nonoperational company, we reported a net loss of $11.8 million in the second quarter 2022 and $21.3 million in the first half of the year. I would like to call your attention to some of our competitive cost advantages, especially first, our full access to Embraer's engineers on a first priority basis and only as needed. That means we don't need to bring hundreds of engineers to our P&L, which makes our development much more cost efficient. Second, our ability to use Embraer's 50-year intellectual property on a relative free basis, that's another important source of cost savings. And third, access to Embraer's facilities which minor investments in only the sharing of facility fees. That said, moving to cash flow, I would like to highlight our cash burn of $13.2 million in the first six months of 2022. With that, we ended the second quarter with approximately $330 million in cash following our net capital raise of $329 million in May. Given the cost advantages I just mentioned, we feel extremely comfortable with our current cash position, as it gives Eve plenty of resources to maintain our eVTOL development for multiple years. At this point in time, Eve has no debt on its balance sheet, which provides another avenue for financing operations, as well as cash from customer progress payments once LOIs are definitized at firm orders. Now, on the balance sheet, I want to emphasize again, total accounts payable of $12.6 million at the end of the second quarter that reduced our cash burn. At the same time, we have no debt on our balance sheet and a cash or net cash position of more than $330 million. And now, we would like to open for questions. The quick answer is that there are multiple steps and as we have done in the past, we expect to move to a common structure with the FAA later this year. So the -- our strategy overall as Jerry mentioned, something that's done in other programs, which is use ANACC as our primary certification organization. So we have their undivided attention, but at the same time engage with all the other major regulatory authorities, including in particular, the FAA, where ANACC has bilateral agreements, weâ\u0080\u0099ve used that in previous problems to assure that there is not a new certification process in FAA, but rather a validation with ANACC has done. This one's for Eduardo, if that's possible. Eduardo, you guys raised a little bit of debt, I believe, on August 1st with a loan agreement with Embraer, for $81 million at about a 5% rate. Just to clarify, it's really the other way around. We didn't raise any debt with Embraer, we invested part of our cash with Embraer at the arms-length rate right of almost 5% a year. So that's $80 million, will give us almost $5 million in interest rates per year, so a very good investment for Eve. It's a one year, we can prepay that loan and get the money back anytime we want. We are approached by a lot of potential lenders, but at this time, we have no leverage in our balance sheet, which gives us flexibility to raise future debt to bring even more cash for Eve. There are a number of benefits, and Valentini, you're probably in the best position to talk about some of the specific trade-offs and what they resulted in. The placement of the rotors that we made allows us for sizing of the motors with less power, the motors of the lifters with less power, thinking of the controllability in case of the failure of one of them in flight. So we maintain controllability of the vehicle, but we can do that, and we did maintain also, in the previous configuration. It allows us to reduce the weight, which of course brings benefit in terms of energy efficiency and noise and other aspects. In addition to this, we find that this configuration with the conventional placement of wing and tail gives us a little bit more flexibility to adjust the stability and controllability of the vehicle in the future and make minor adjustments if we have to. So, Savi, that happens as the design matures, as you saw here or as Valentini talked about. So the best answer I can give to your question is, we're flying a variety of vehicles now, doing extensive simulation and modeling to test variations of key elements so that we can understand and verify the effects those variations have. And with respect to suppliers, you'll probably see us start on three of the key areas, really on the motors, propellers and batteries. Starting at the end of this year through the first half of next year, we will probably lock down each of those three categories. Jerry, just that, that timeline supports the development of the vehicle as we had planned originally. So that timeline of bringing the -- locking in with the suppliers as you mentioned, is part and again, as we had originally planned for the project. But before that, we have some great significant engagement with several potential suppliers for them to participate and us, even to learn about their products from the beginning of this year. So we mature the participation with them and then sign with that schedule, as you mentioned. And Savi, I would just add one more point. Final question, just -- I thought that the BAE announcement was interesting. It kind of gives you a new, maybe a vertical of defense kind of vertical to go into. But in terms of the specific applications, that'll be up to the joint venture between Embraer and BAE to determine. And actually, the beauty of the deal because of BAE and Embraer is exactly that Eve will remain focused on the Urban Mobility Market, and we'll provide them with our baseline aircrafts. So we can optimize our aircraft for Urban Air Mobility, and at the same time access to defense market. And particular applications where we could deploy technology for autonomous for example, that are regulatory environment, and these are in the defense applications, then it is for the civilian applications. As Jerry said, the final use will depend on the market development from both BAE and Embraer defense, but some of the applications we have heard during the discussions are things like search and rescue, disaster relief, ship to shore, things that will take advantage of both the different qualities we have on our vehicle, being it the fact that itâ\u0080\u0099s electric. And in ship to shore, for example, there is an access of electricity in the ship, so we don't need to carry fuel. I appreciate the color you provide on the redesign, that was one of my questions. But since potentially a lot of investors on the call are actually not familiar being tech investors, maybe it'd be helpful if you guys just kind of dug a little deeper into how much capital you think or working capital you can raise from pre-delivery payments and the timing relative to final delivery those payments will come in. But as Edu said, we've got substantial cash on the balance sheet. In terms of timing, we expect to start definitive sizing those LOIs over the next 24 months period. Yeah, it depends from product to product, but down payments or advances could be as big as 50% of the value of the vehicle. So if you look, our nonbinding backlog, right, it's over 2000 vehicles, over $6 billion. If you assume that some of the advances could be as high as 50%, you can figure out that a lot of cash inflow may come to the company as we transition those nonbinding orders into firm orders. In general, if that happens as Jerry mentioned, 24, 18 miles prior to the delivery, so there is a schedule. As you mentioned, we only pay the engineers as they work for us, we don't bring them to the balance sheet. So, we have a lot of advantages, but I would say we may spend around -- it depends on the year, but throughout the development around $100 million, maybe some years a little less, some years a little more. So I believe the cash we have today, the $330 million, it's a robust cash considering the pace of cash burn that we expect. Just some business development, you guys have built the largest unit backlog in the industry as far as I'm aware. I think Stein's in the best position to answer that, but as you look at the backlog, it really covers the first three or four years of our business plan. So, at this point we're not focused as much on numbers as the strategic positioning, et cetera. We, as Jerry brought it, we are very selective on the partners we accept to join us in a way. So it's not just a question of get the largest backlog for the sake of it, but really find the right partners. And the build of it, the way we're doing is that we don't have today no customer that has more than 10% of our backlog, for example. We have customers in all parts of the globe, in all continents that also helps to minimize the risk, as well as business models with leasing companies, helicopter operators, airlines coming on board. And to your point about competition, yes, competition's definitely always there. We raised very good money, right, in our capital raise, almost $400 million. Our cash burn is really, in our view, it's under control. There are ways to do that, leverage the company is one of them. We could always raise that, but we need to make sure that this rate -- that this debt comes at right maturity, it needs to be long-term, it needs maybe some grace period, and also it needs to come at the right cost. We are approaching by different players offering different opportunities, but we still don't have any anything secured. Another possibility, as we were discussing here, right, advances as we -- from customers, as we security orders, we expect to start to get bigger down payments, advances, and that could be a meaningful cash inflow. And considering our cash burn running rate, we feel -- we already feel comfortable with our cash, but there are ways to bring more cash flow. The second question is regarding the start of the levers, there were those changes on design, and everything's very fluid at this point in time as you guys are perfecting the model and get to the most efficient solution. I'll turn this over to Valentini and Stein, but the short answer is we're still looking at 2026. But as you know, things can happen like, for instance, you mentioned the certification process and major agencies, whether it's ANACC, FAA or EASA, we are still working our way through that. I think that's not so much an Eve specific issue, but that affects the industry as a whole. As well as the other community acceptance and the other regulatory factors associated with the operation, not just certification, I think they could be as much or more of an impact on 2026 for the industry than the internal factors. Just on the configuration, it's important to highlight that it is part of the development process, selecting the configuration was a planned part of it. So we have been particularly in the lift-plus-cruise solution, perceiving that as the best direction to go with 8 rotors to takeoff. That's what we have been evaluating, and we've selected the direction to go now. So wasn't a change in -- of course, was part of the development, a natural development and evolution of the product. So we are -- that was the way it was planned, and that there is no change on our target for instance, service for the first delivers. I wanted to ask about plans for autonomy, appreciating that it's still a ways out. Stein, you already alluded to that with the defense application, maybe giving us an early adopter there, but some things that we were already doing in CONOPS in Rio to advance the autonomous capabilities. And the idea for that was exactly to start the machine learning in a very literal sense, so starting acquiring the data in a real urban environment so we can apply that for the future that is autonomous. So we have been investing on that and investing in the development of the technology, but not counting on that as part of the critical path for eVTOL service. So, in addition to what Stein described, we have in the near-term advances that -- directions really that we are establishing for the vehicles still while piloted, that we believe will set the base for introducing then the autonomous flight. So one, for example, is having a modular architecture for the avionics in a way that we can evolve it to an autonomous flight taking advantage on what we will have already built in terms of fly-by-wire flight controls in terms of sensors and integration. So that also is connected to our vision of developing a simplified human machine interface for the pilot while the pilot is onboard the vehicle, and that also creates automation in the system, in the flight control system, for example, that will be already a step ahead when receiving the autonomous functions of the vehicle. So at the same time that we are executing these works that Stein alluded to with Embraer for example, we are also taking measures on the vehicle architecture and definitions that will pave the way for receiving the autonomous functions in the future. As I said, we're flying a number of different kinds of aircraft, you can define them as proof-of-concepts, prototypes, et cetera. But more importantly, we think is evolving the final design through the simulation modeling and testing. So, the later you apply any modifications then the harder it is, the more expensive it is, the more rework that you have, right, for changing the vehicle as you go along the project. So, with this in mind, these tests that we are performing, which include flying vehicles but also include for example, wind tunnel tests or RIGs and things like that, they help us understand these characteristics, the different effects of different system architectures and things like that. And with that, then -- with the modeling that we do, which then receives data from these tests, we are able to make sure that the choices that we are making for the vehicle are the right choices for us to move on. So, that's how the tests being proof-of-concepts again or not, that's how they contribute to the stage of the development that we are in right now. So Josh, the short answer is we generally don't publish a schedule, we let the engineering team move through this entire process of model as Embraer has proven is very effective in the past. And we expect to be flying more and more mature aircraft all the way up to the time that I said about two years out from entry into service, where we think we have a production ready or production representative specimen. At this time, we've reached the end of our question and answer session. And please, don't hesitate to reach out to us in case you have any additional questions."
}