{
    "symbol": "PLNT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 12:06:14",
    "content": " I mean I think we're starting to see -- with Cheryl's help, Digital Officer, I think with the perks page and the button on the website -- the app, the traction we've gotten from that and the data we're capturing so that we can show true click-throughs and conversion for other partners, that I think we're now on the cusp of now starting to not only just get the discounts, but actually even drive maybe some revenue from those discounts internally from share revenue or whatever for commission. I think the first thing I'd probably point to is just since you've been 2019, which, hard to believe, is 3 years ago now that the pace of what we've seen a Gen Z join, and mostly the older Gen Zs, their counterparts that are in that early 20 stage, deals Gen Zs is about 23, 24. I'd say one last comment I'd make is in terms of just the overall retail environment with respect to our franchisees, their development teams and then landlords across the U.S., I think most likely because we were a great kind of pre-COVID with the economics of the model and the traffic we drive to the centers, et cetera, et cetera, and then on where we're at today with landlords realizing we didn't close a single store. I think a lot of that with a 30 -- almost 35% of the clubs are pre-pandemic, it's just more, I think, back to Tom's point, a matter of time. I think a little bit to your question on Gen Zs, I think the one thing that's somewhat anecdotal, but I think a little bit from some of our manufacturers that, from the younger generations, we're not seeing them use probably cardio like the older generations do. But they're usage is pretty much a -- believe it or not, it's actually pretty much the same as a normal Gen X. I think it's not their usage patterns aren't really necessarily any more or less than a typical member that we normally have. But -- and even though the Gen Zs are way above what we've seen in prior years on a joining ratio, where millennial, the boomers, the Gen Xs aren't quite back to where they should be, at the same token, I think it's important to note that our penetration of those generations are also increasing. One thing that -- in the past, pre-COVID, we generally would never do would be to try to take the existing HVAC system that's there in that facility that we're taking over for new store and either try to do a bit of maintenance and have some extended life on that old system for our new club."
}