{
    "symbol": "JLL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 14:02:09",
    "content": " Our results highlight the competitive advantages we have across each of our business lines led by robust top and bottom line growth in our markets advisory, capital markets and work dynamics businesses, as well as strong fee revenue growth in our JLL technologies and LaSalle businesses. Adjusted EBITDA increased 47% compared to the first quarter of 2021, and we generated healthy margin expansion, driven in part by revenue growth and productivity improvement. Beginning in the first quarter 2022, we transition to reporting five business line segments comprising markets advisory, capital markets, work dynamics, JLL technologies and LaSalle. Higher volume across all deal sizes within investment sales, debt and equity advisory drove 67% fee revenue growth over the prior year and a 45% increase compared with the first quarter of 2020. Capital markets adjusted EBITDA margin increased 500 basis points from a year ago to 20% as a result of revenue growth, higher productivity and timing of incentive compensation accruals, which more than offset the continued return of T&E expense and the headwind from the release of a loan loss credit reserves in the prior year quarter. Considering LaSalle’s $9.1 million of capital raised over the trailing 12-month, including $1.9 million in the first quarter, we expect the strong LaSalle advisory fee revenue growth trends to continue. I think the biggest factor you always mentioned and I think this is both for leasing and capital markets is GDP and obviously that there's obviously a lot of question marks but I think Christian, you mentioned some of the other external factors that we should be considering so interest rates, availability of credit, or they -- can you touch upon what you're seeing there or any other things that we should consider outside of just GDP growth and obviously war in Europe, et cetera. But there is, as Christian mentioned, some really interesting trends, where we've seen an uptick and faster growth in both leasing and capital markets for the reasons that Christian described, and particularly in capital markets, we're seeing an uptick as investors are looking at the relative risk return profile, between retail and other property types out there and how they feel about return potential going forward. As you see with the overall revenue growth in the first quarter, again, what you were mentioning around capital markets, we have a broad portfolio of capital markets services and the ones you just mentioned, not only deriving from the HFF acquisition, we also have those types of services in Europe, within the JLL side, and they are growing very strongly."
}