{
    "symbol": "JLL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 13:33:04",
    "content": " Our fee revenue for the quarter grew 4% over a record third quarter 2021 and despite a 24% decline in our investment sales, debt and equity advisory fee revenue in the month of September. The margin decline was driven by lower capital markets revenue, typically our second highest margin segment, as well as investments in our people, product and growth initiatives over the past year. Moving to a detailed review of operating performance beginning with markets advisory, leasing fee revenue grew 3% on top of a 75% growth rate in the prior year quarter. Our third quarter office sector fee revenue growth outpaced the global office market volume by approximately 200 basis points and the industrial sector fee revenue growth declined 12% as anticipated given a tight supply and significant growth seen over the past several years, as well as a decrease in global industrial market activity from a year ago. Notably, Asia Pacific investment sales, debt and equity advisory fee revenue grew 5% driven by strength of the hotel sector, EMEA investment sales, debt and equity advisory declined 1% with strengthen in the UK, and much of continental Europe offset by softness in Germany and France. Considering the factors Christian described and a tougher growth comparison to a year ago, we expect the decrease in fourth quarter fee revenue in capital markets to be more pronounced than in the third quarter. Capital Markets adjusted EBITDA margin declined 740 basis points from a year ago to 14.3% on lower fee revenue, the impact of net changes and incentive compensation structure and incremental T&E and marketing expenses The change in our compensation mix to more commissions from cash bonus along with the strength in capital markets activity earlier in the year led to higher commission expense and earlier cash out flows than in prior years. Moving to JLL Technologies, fee revenue inclusive of M&A accelerated to 54% from 48% in the prior quarter, organic growth of 28% was driven largely by enterprise clients, which compared with 22% in the prior quarter. The increase in advisory fee revenue was more than offset by the lower equity earnings, lower incentive fees and expenses related to the loss of a client mandate in the UK, resulting in a decline in our sales adjusted EBITDA margin for the quarter."
}