{
    "symbol": "SIGA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 19:36:06",
    "content": " For a discussion of factors that could cause results to differ, please see the company's filings with the Securities and Exchange Commission including without limitation the company's annual report on Form 10-K for the year ended December 31st, 2022 and its subsequent reports on Form 10-Q and Form 8-K. On our prior year end investor call in March of 2022, we highlighted that 2022 would be a transition year with no significant expirations of oral TPOXX in the US Strategic National Stockpile or SNS. Overall, 2022 revenues included $71 million of sales took more than 10 international customers, the first sale of intravenous formulation of TPOXX to the US Government, and the first sales totaling approximately $7 million of oral TPOXX to the US Department of Defense. As a frame of reference prior to 2022 the company had only one international customer, cumulative international sales of approximately $15 million over the two-year time period of 2020 and 2021, and it only sold oral TPOXX to one buyer within the US Government. Additionally, it should be noted that 2022 was the first year since the start of TPOXX deliveries in 2013 in which the company had substantial positive cash flows without the benefit of any sales of oral TPOXX to the Strategic National Stockpile. With respect to the mpox outbreak, in which there have been approximately 86,000 global cases and 30,000 US cases since May of 2022, the outbreak has highlighted the importance of TPOXX, given that TPOXX was used to compassionately treat more than 6,500 mpox cases in the US and many cases internationally and approximately seven clinical trials have been launched, as well as another four scheduled to be launched to study the use of TPOXX for mpox, many of which are randomized placebo-controlled trials, that are sponsored by government agencies or NGOs. Additionally, we believe the US Government would need to exercise procurement options under the 19C contract in 2024 or make orders under a new procurement contract in order to at least maintain historical unexpired TPOXX levels, within the Strategic National Stockpile. For the 12 months ended December 31, 2022 SIGA's revenue was approximately $111 million, of which approximately $71 million of revenue relates to international oral TPOXX sales, another $7 million approximately of revenue related to sales of oral TPOXX to the US Department of Defense and a further $7 million approximately of revenue relates to the first sale of IV TPOXX to the US Government. To reiterate Phil's earlier comments, 2022 revenues represent a meaningful expansion of the TPOXX revenue base with more than 10 new international customers from a narrow base prior to 2022 and the first sales of oral TPOXX to the US Department of Defense and the first sale of IV TPOXX to the US Government. Furthermore, we will continue to work with the US Department of Defense on potential additional procurement orders and/or contracts to coordinate additional deliveries of IV TPOXX to the Strategic National Stockpile in connection with the 2022 IV option exercise under the 19C contract and to pursue a new contract with the US Government through the administration of strategic preparedness and response."
}