{
    "symbol": "SIGA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 18:17:01",
    "content": " For a discussion of factors that could cause results to differ, please see the companyâ\u0080\u0099s filings with the Securities and Exchange Commission, including, without limitation, the companyâ\u0080\u0099s annual report on Form 10-K for the year ended December 31, 2021 and its subsequent reports on Form 10-Q and Form 8-K. With $61 million of international sales this quarter, spread over 12 international customer, SIGAâ\u0080\u0099s third quarter financial results continue a trend of substantial financial diversification at SIGA. In combination with the first sales of the intravenous formulation of TPOXX, IV TPOXX in the first quarter of 2022 and the first sale of oral TPOXX to the U.S. Department of Defense in the second quarter of 2022, the sale of oral TPOXX or tecovirimat to 12 international customers in the third quarter of 2022 highlights the continuing and substantial diversification of SIGAâ\u0080\u0099s revenue base. Importantly, I would like to note that the new procurement order in August for approximately $26 million of IV TPOXX by BARDA and the new DoD procurement contract award in September for up to approximately $11 million of oral TPOXX highlight how diversification can lay the groundwork for future revenues. Overall, we believe the expanded number of customers and recent repeat order activity by the DoD emphasizes the growing recognition by government of the overall importance of health security preparedness and that by increasing both the scale and scope of TPOXX stockpiling, countries can better -- can be better prepared for the outbreak risks of smallpox, monkeypox and other viruses in the orthopoxvirus family. With respect to the monkeypox outbreak in which there have been approximately 77,000 global cases and 28,000 U.S. cases since May, the outbreak is shining a light on the importance of TPOXX given that TPOXX has been used to compassionately treat approximately 4,000 monkeypox cases in the U.S. and many cases internationally, and approximately 10 clinical trials have been launched or are planned to be launched in the near term, all of which will study the use of TPOXX for monkeypox and half of which are randomized placebo-controlled trials. For the third quarter, approximately $61 million of revenue relates to international sales of oral TPOXX to 12 customers, of which 10 are new customers. For the 9 months ended September 30, approximately $66 million of revenue relates to international oral TPOXX sales, approximately $7 million of revenue related to sales of oral TPOXX to the U.S. Department of Defense, approximately $7 million of revenue related to sales of IV TPOXX to the U.S. government and the remainder mostly relates to research and development activity. As stated on prior calls, we believe the current size of the stockpile of TPOXX in the U.S. would not be sufficient to treat all those who would need care in many outbreak scenarios, a lesson from the COVID pandemic, which is being reinforced by the monkeypox outbreak, is that governments need to be more proactive in addressing the health and societal risks associated with virus family. So weâ\u0080\u0099ll continue to work with the U.S. Department of Defense, and weâ\u0080\u0099ll continue to work with international customers because as we highlighted on the last call, the orders that we received internationally for the most part are focused on getting immediate product available to treat monkeypox patients in the current outbreak."
}