{
    "symbol": "SIGA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 01:17:21",
    "content": " Before we turn the call over to SIGA management, please note that any forward-looking statements made during this call are based on management's current expectations and observations and are subject to risks and uncertainties that could cause actual results to differ from the forward-looking statements. For a discussion of factors that could cause results to differ, please see the company's filings with the Securities and Exchange Commission, including, without limitation, the company's annual report on Form 10-K for the year ended December 13, 2021 -- excuse me, 2021 and its subsequent reports on Form 10-Q and Form 8-K. With that said, I'd like to turn the call over to Mr. Phil Gomez, your host. With the global monkeypox outbreak, we've been very busy over the last approximately 75 days, responding to inquiries from a broad multitude of people and entities across the public health ecosystem as well as building on existing governmental and public health relationships. Of the 10 international jurisdictions who have ordered oral TPOXX in 2022, 9 of the jurisdictions are first-time customers in 2022. Firstly, that is essential that governments across the world adopt a more proactive approach to addressing the health risk posed by families of viruses such as the orthopoxvirus family. And secondly, the TPOXX is a significant component to any robust public health program designated to protect against orthopoxvirus risks and threats. With respect to the Monkeypox outbreak, the sheer magnitude of inquiries and usage requests and the oftentimes frenetic manner of such inquiries highlight the seriousness of the outbreak, both currently and for what the outbreak could become. The number of global cases of monkeypox has quickly grown to more than 25,000 cases and there are anecdotal reports that the breadth of transmission appears to be expanding. At this early stage, we are in the same spot as the public health community in that we have much more to learn in order to get a better sense of what to expect with regard to the ultimate scale and scope of the monkeypox cases to come. First, monkeypox is a severe disease as case reports and patient stories have made clear an infection can have significant consequences. Third, although currently focused in the social networks of the men having sex with men or MSM community, most experts do not anticipate the outbreak will be limited to this population. Fourth, vaccines alone cannot mitigate this outbreak. Supply challenges, vaccine hesitancy and ongoing cases require both vaccination and treatment to address the impact. Fifth, the outbreak has highlighted the importance of stockpiling of TPOXX to mitigate the impact of orthopoxvirus outbreak. And sixth, the population needs better access to TPOXX. In the sum, we believe the monkeypox outbreak is a clearing call to governments to increase the pace of building stockpiles for smallpox and monkeypox where none exist and of resize and expanding stockpiles that do exist. As such, we will continue to pursue in coordination with international promotion partner, Meridian Medical Technologies, tangible procurement activity in regions and countries in which monkeypox continues to grow and/or become endemic. In addition to being a catalyst for international procurement orders, the Monkeypox outbreak has also been a catalyst for opportunities to enroll patients and trials being planned for oral TPOXX. This is important because collecting data from trials and from usage in the population is a key focus point for us as we pursue monkeypox approval with the FDA, which is one way to get better access to TPOXX for monkeypox patients. As background, the FDA has indicated that it wants efficacy data in the treatment of monkeypox for full approval of TPOXX in the U.S. for the monkeypox indication. Before I hand over the call to Dennis, I would like to touch on a few achievements over the past series of months. On the regulatory front, the IV formulation of TPOXX was approved by the FDA in May. And oral TPOXX was approved in July by the Medicines and Healthcare Products Regulatory Agency, MHRA, in the United Kingdom. With these approvals, we have now achieved 4 regulatory approvals for TPOXX in the approximate span of a little more than half a year. The other regulatory approvals being the oral TPOXX approval by the European Medicines Agency, EMA, in January and Health Canada approval in December 2021. I will note that the EMA and MHRA approvals include broad labeling for oral TPOXX indicating its use for the treatment of monkeypox, smallpox, cowpox and vaccinia complications following vaccination against smallpox. During an outbreak, whether smallpox or monkeypox, we always anticipated collecting confirmatory efficacy data in humans. On the procurement front, we signed our first procurement contract with the U.S. Department of Defense in May. The procurement contract is for approximately $7.5 million of oral TPOXX, of which approximately half was delivered in the second quarter and we expect the option for the other half to be likely exercised in 2022. As a reminder, our revenue base expanded in the first quarter when we made our first deliveries of intravenous TPOXX for the U.S. government. At this point, I'd like to hand the call over to Dennis Hruby, who will provide a regulatory and R&D update including details on the PEP clinical program. I will start my comments with an update on postexposure prophylaxis, or PEP clinical trials. With respect to PEP, as a reminder, we're working with our DoD colleagues on executing 2 clinical trials needed to support regulatory approval of TPOXX for post-exposure prophylaxis. For the expanded safety study, we have set up 9 clinical sites around the U.S., and these sites began dosing mid-quarter. For the TPOXX plus Jynneos immunogenicity trial, we have 2 sites recruiting and screening volunteers. Over the past series of weeks, even before the monkeypox outbreak gained a substantial foothold in the U.S., enrollment has begun to improve. With the monkeypox outbreak, we're continuing to work to further enhance enrollment in this trial. If the study showed the expected results, we would commence assembly activities for a package requesting regulatory approval of TPOXX for PEP. Shifting gears, I'd like to now discuss clinical activity in connection with oral TPOXX in monkeypox. We are currently supporting and assisting with launching up to 10 clinical trials in Africa, Europe and North America to formally assess the effectiveness of TPOXX to treat and/or prevent monkeypox in human patients. The first of these is launching as I speak, and we hope to quickly accrue data to support potential approval of a monkeypox indication here in the U.S. to facilitate getting drug to those who need it. Before I turn the call over to Dan, I'd like to highlight something that's been mentioned previously in investor calls and earlier today by Phil, which is that we think of TPOXX through the lens of being a treatment for the orthopox family of viruses. As such, we will continue to look for opportunities and work with our government partners in pursuit of broad label indications for TPOXX whenever possible. For the 3 and 6 months ended June 30, 2022, SIGA's revenue is approximately $17 million and $27 million, respectively. For the second quarter, approximately $5 million of revenue relates to international sales of oral TPOXX. In connection with the sales of oral TPOXX, both cases were first-time sales to a new customer. For the 6 months ended June 30, approximately $7 million of revenue related to sales of intravenous TPOXX to the U.S. government. Operating income, which excludes interest income, taxes and adjustments to the fair value of the warrant was approximately $3.1 million for the 3 months ended June 30, 2022. For the 6 months ended June 30, operating income was approximately $1.6 million. Net income for the 3 months ended June 30, 2022, was approximately $2 million. For the 6 months ended June 30, net income was approximately $1.7 million. In turn, fully diluted income per share for the 3 months ended June 30, 2022, was $0.03 per share. And for the 6 months ended June 30, fully diluted income per share was $0.02. At June 30, 2022, the cash balance for the company was approximately $115 million. During the second quarter, SIGA declared and paid a special cash dividend of $0.45 per share. Additionally, the company repurchased approximately 0.5 million shares of its common stock for approximately $3.6 million. As a quick reminder, please note that in addition to using cash for capital management activities such as the special cash dividend and share repurchases, we expect to use cash to proactively build work in process inventory for active pharmaceutical ingredient. With respect to the $60 million of international orders received this year as of July 31, approximately $5 million of these orders were delivered in the second quarter of 2022. Approximately $26 million is expected to be delivered in the third quarter of 2022 and the remaining orders are expected to be fulfilled between October 1, 2022, and July 31, 2023. Before we turn to Q&A, I would like to reiterate a few points, many of which have been made in the past in support of our view that SIGA offers an attractive combination of existing revenue streams that generate strong financial results when product is ordered and delivered complemented by organic growth initiatives that hold significant potential when viewed collectively. First, I'd like to reiterate that monkeypox outbreak has heightened the importance of TPOXX in connection with the treatment of monkeypox. It is our understanding that TPOXX is the leading and likely the only in many countries, therapeutic that is being used or expected to be used in the U.S., Europe, Canada, Asia Pacific region, Africa and other areas. Second, I would like to highlight that the ongoing international sales growth initiative is progressing in a value-creating manner. We now have more than 10 countries, including the U.S. that have ordered TPOXX, and we continue to work hard to expand that base. While as noted many times before, progress on this front is expected to be lumpy and uneven given a variety of factors, we believe that meaningful international market is gradually taking shape. Third, I want to reiterate that the PEP-based development program represents a growth initiative in that it would provide scientific and regulatory support for any stockpile expansion. As stated on earlier calls, we believe the current size of the stockpile of TPOXX would not be sufficient to treat all those who need care in many outbreak scenarios. A lesson from the COVID pandemic, which is being reinforced by the monkeypox outbreak is that governments need to be more proactive in addressing the health and social risk associated with virus family. Fourth, we continue to be focused on transitioning from our U.S. contract to a long-term SNS contract that focuses on appropriate size requirements for the TPOXX stockpile as well as smoothing the annual deliveries, which will be critical to supply chain planning and financial predictability. This year, we added the U.S. Department of Defense to our customer list as well as 9 international jurisdictions. Six, we continue to pursue and support oncology collaborations and other strategies that can open up new markets for TPOXX. As mentioned earlier, we believe these initiatives, when viewed collectively, have potential for significant value creation. The most interesting thing is your model is pretty -- the ability to predict your revenues is pretty easy in the U.S., mainly because of the stockpiles. As you highlight, in the U.S., there is a 1.7 million course stockpile. We have discussed and pointed out that, that would likely be inadequate in the case of a smallpox outbreak, and our post-exposure program is looking to add that label to increase the availability of that stockpile and the size of it. So I would say, there's 2 things that are driving our performance that we're reporting today, and it really will be the outbreak that goes forward. So the first part is, unfortunately, I think a lot of public health organizations around the world did not think of monkeypox as a serious threat even when the first cases came. For those governments that did pursue it, we also have to go through the procurement process. We have had people make initial orders, which are usually based on the number of cases they have in the immediate area. I think the public health emergency declaration in the U.S., along with the WHO's declaration will help public health officials focus on what is going to be needed for the delivery of product to mitigate this outbreak. We knew that in the U.S., there would be 363,000 courses expiring over the next few years. And for those that may not know, we have a U.S.-based supply chain that has been delivering product to the U.S. strategic national stockpile since 2013. So we have the ability with our existing network and their existing capacity to certainly get above the 363,000 courses, certainly above around the 500,000 course a year mark, but it is not a fixed ceiling. And so we feel like we're in a good position, at least at this point in the outbreak. Of course, that will depend on ultimately the number of courses and the number of cases that we see globally, but we're certainly looking at scenarios to plan for that. Where are we -- I think with the U.S. approval here for monkeypox, it seems like you're getting some positive news directionally, but I was curious if you had any idea of timing on that? Just to clarify, Soo, I think you're probably asking about efficacy data in patients. As you've probably seen, we are in the process of standing up a number of trials around the globe. Importantly, there's one in the U.S. in the clinical trials network. There's one in the U.K., and there is one in Canada. So as that data accumulates, I think we'll be in a position to apply for an approval for monkeypox here in the U.S. One is an ultimate approval by FDA, a full approval that provides label expansion for monkeypox. As we've seen, there's certainly been a challenge around the complexity of the expanded access IND. We've certainly been very supportive in trying to respond to any data request from FDA to help understand ongoing clinical studies, what's available for that. And certainly, that has been a call from folks in the public health community, physicians. As I said, we always knew we would go back and get efficacy data in humans, but that is confirmatory efficacy data that we know based on the animal data is likely to be positive. And clearly, with the declaration today and the work FDA and CDC doing, we're encouraged that we'll continue to make progress on that front -- at FDA and CDC. But can you give me an idea of the opportunity, I guess, in the next 6 to 12 months for smallpox sales versus monkeypox sales. I noticed in Q4, you did over 100 million with that contract with the federal government. Yes, it's a great question, Ben, and thank you for asking it. So in 2021 and 2022, we had 2 orders that would be delivered. As we've said on previous calls, we do not anticipate a high number of expiries this year. Obviously, the monkeypox outbreak and the use of the drug could impact that. We think it's important to forward manufacture and get those deliveries in as soon as possible, but that is ultimately up to the U.S. government. Ben, your question on monkeypox is an excellent one. And so what is important to remember is whether it's monkeypox, whether it's the Central African clade of monkeypox that has been shown to be up to 10% fatal, whether it's smallpox, whatever it might be, these types of antiviral drugs are critical to have available. Dennis, I don't know if you had anything in on your perspective on the outbreak. In 2023 and 2024, there are 2 essentially options or orders remaining on our existing contract that we anticipate will be executed in 2023 and 2024. Over the past several years, we've done over $60 million in share repurchases. We continue to look at all uses of cash, whether that be potential M&A to do accretive acquisitions that could bolt on our business, but we certainly focused on returning cash to shareholders. So we will continue to look at share repurchases, continue to look at dividends, continue to look at the best use of cash. But certainly, right now, we're still understanding the outbreak and ultimately where this goes. You guys are still awaiting FDA approval for the monkeypox vaccine, while they are already FDA approved. It was approved, I believe, in 2019 that approval included monkeypox and smallpox. We actually did apply to the U.S. FDA for a broader indication of smallpox, monkeypox, cowpox and vaccinia. And at the end of the day, the negotiation was to only get the approval for smallpox. In their reviews, they looked at that same data and gave us a monkeypox approval for treatment as well as smallpox. I -- from what I've read, it looks like it's $250 to $350 per dose and the dose, of course, I believe, is over several weeks. But in the U.S. government contracts and the Canadian contracts, the pricing and the volume is too slow. So I can, at a high level, say, in the U.S., we sell between $300 or $400 a course. In Canada, that number is between $900 and $1,000. They have a 1.7 million course stockpile in Canada, it was lower volume. We've commented in our filings around the margins associated with that, including the margin, including the fees that we paid in Meridian associated with international sales, so that is available in our filings. It will really depend on how large those orders come in as to whether we use current inventory, work in progress or product that's moving along. But right now, with the orders that we have and anticipated, we believe we'll be able to deliver that out of inventory. The first is, with respect to monkeypox, I've read a couple of articles, I think one recent one from New England Journal of Medicine that cited some FDA comments that they want to do some additional testing with regard to monkeypox for TPOXX to give a sort of a more formal approval. Thus far, our experience in our clinical studies is that TPOXX is a very safe drug. Yes, it's a great question. And certainly, we're examining that and working on the ability to be able to launch it commercially. As you said, the drug historically has been sold to be stockpiled in the event of an outbreak like this. And right now in the U.S., that's how it's being deployed. But as the outbreak progresses, one scenario would be that it would become endemic. And just like COVID therapies that initially were bought by the U.S. government, the expectation would be that ultimately, they might go through a commercial, more traditional sales channel to accent patients. There's also hybrids of that, that have been done over the years. Tamiflu was stockpiled by the U.S. government for an influenza pandemic, but it was also sold in the commercial market. We think that, that will be important to have that efficacy data in humans for the full FDA and ultimately, approvals around distribution. So they tend to be how do we get a small -- relatively small amount here, how do we get a contract vehicle in place, how do we understand the regulatory import, permanent supply chain and all that. We do anticipate after that, there then is a phase where they start to think about what could this outbreak do long term, how do we get the right amount for monkeypox. There are also ongoing conversations with pooled procurement agencies that's been reported the European Commission and HERA, which is the new organization in Europe that looks the due response, certainly has interest in tecovirimat. And just 1 other question and further to that is, you mentioned earlier that based on stockpile of what you've already got in warehouse, at what point do you need to look towards expanding or having secondary partners in order to procure. As I mentioned, with our current partners and their current kind of performance and scheduling of this, we think we can get up to 500,000 courses a year. So that would come online as time goes on, it's a little ways away, but that's another one that could be accelerated to bring that online. It really is a question of where ultimately the demand goes, but we're working through those scenarios. So I guess if I was looking to build out a model that captures both the international and U.S. TPOXX sales, how should I be thinking about the price per course? And then I would say on the future, we look at any customer as with the U.S. government as a long-term partner. So this is something that certainly in the long run, we want to be consistent partners on pricing and availability and be able to deliver. And then for IV, you can see that it's a slightly higher number around the $400 range. Internationally, as Phil mentioned previously, the pricing has been higher than the U.S. because of the series of factors. In Canada, it was disclosed those between the $900 and $1,000, I think you'd be safe to use that broadly. And on the other side, the small numbers might be north of $1,000. And I guess with the U.S. government federal emergency declaration, presumably asking to free up some additional federal funding. And then how should we think about, I guess, any expenses that the company may have to incur in order to ramp on production here with the CMOs that you're working with or any CapEx spend. How should we be thinking about, I guess, margins going forward in the event that this outbreak sort of continues to accelerate, and you have to meet a substantial amount of volume. So that frees up some funding, but it's more details of the response within the U.S. government. But if we think about them potentially ramping that up, accelerating them or thinking about a different stockpile size, that will likely come through some sort of a supplemental appropriation. Historically, when there's a outbreak, the Congress looks at the need, the administration provides an update. I believe that Biden administration has been reported, has talked about a number in a wide variety, including about a $7 billion appropriation. We're certainly supportive of that supplemental appropriation, but that's where any material change in the plans would show up. It's a very historically very -- historically, and we believe going forward, very scalable. As Phil mentioned, the U.S.-based supply chain. So if you look at our financials, our CapEx really has been minimal, given the outsourcing, and we anticipate going forward on the production side, that CapEx would continue to be on the low side. Granted, we continue to look at -- with the monkeypox outbreak, there are so many different scenarios. So I guess when you file presuming that the data will be positive for the clinical trial for the approval in the U.S. what would you anticipate would be the time line between when you'd be able to get the data, then when you'd be able to file for the supplemental label and then when you would be potentially reviewed. So I think the good news there is that NIAID, NIH, SIGA, the FDA and the AIDS Clinicals Trials Group, the ACTG, which is the clinical trials network. So we anticipate, as data is generated, it will certainly be rapidly made available to both us and sent to the FDA. And it is -- to your question, it is hard to predict because -- it could be based on the final data, if there was an acceleration of reviews under an EUA, whether it's before or middle or after that clinical trial, it's hard to predict the timing. But we do anticipate if the outbreak continues, the way its trajectory is going up, one, that will mean rapid enrollment of patients because of a large number of patients that can be enrolled and two, the criticality of getting the final approval and more expanded access to the drug will also drive a rapid review. So it's really hard to predict right now, given all those variables. But as Dennis said, we do expect those trials to start quite soon, and we think we'll start to see data as we get into the fall, at least coming out of the initial parts of those studies. The last thing I'd like to do is just thank all of my colleagues here at SIGA, people who have been working around the clock, responding to a lot of requests and making sure that this drug gets out there. And it's with great pride that we deliver this drug that we see some of the initial results that come out there, and we look forward to working with everybody to translate that impact on human health, into value creation for our shareholders. If you have any additional questions, you can find SIGA's investor contact information at the bottom of today's press release."
}