{
    "symbol": "CS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:52:06",
    "content": " In the fourth quarter, we've reduced risk-weighted assets and leveraged exposure by about $5 billion and around $15 billion, respectively, reflecting proactive deleveraging and derisking measures in the non-core unit, that's ahead of the target run rate we set in October. As I mentioned, we have acted decisively to address the impact of the outflows experienced in the fourth quarter and we have seen deposits inflows at the group level in Wealth Management and APAC, as well as net new assets in APAC and the Swiss Bank. Overall, fourth quarter reported net revenues for the group were 33% lower year-on-year at CHF3.1 billion and reported operating expenses were 31% lower at CHF4.3 billion. Revenues were directly impacted by: first, our restructuring actions, including the steps taken to de-risk and exit certain business lines; second, actions we took in response to the group's deposit outflows in the fourth quarter; and third, reduced client activity as capital market conditions remained challenging. Thank you very much. Thank you very much. Thank you very much. Thank you very much. As we simplify the balance sheet and as we execute on our strategy, and I hope you're seeing that now in the fourth quarter, certainly, as we've taken the size of the balance sheet down, the intentional pieces where we've delevered the SPG transaction, the early start of the noncore unit, you're starting to now see some of those funding efficiencies come through, and that's now reflected in this issuance plan. Thank you very much. Thank you very much. Thank you very much. And most importantly, the few initiatives that we've launched around restructuring the Investment Bank, derisking in the Capital Release Unit, getting the SPG transaction done, which, as you can see, we've moved really, really quickly on and with -- we're around two-thirds of the target reductions already having happened, all of those reduce our reliance on short-term wholesale funding and create more funding efficiencies as well."
}