{
    "symbol": "ATXS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 12:59:03",
    "content": " I would like to note that during today's call, as mentioned on Slide 2, we will make forward-looking statements related to our business based on current and future expectations that may be considered -- sorry, actual results may differ from those indicated including those discussed in our most recent annual report on Form 10-K as well as discussions of potential risks, uncertainties and other important factors in subsequent SEC filings, which will be available on our website. Currently, we are evaluating the safety and efficacy of STAR-0215 in HAE patients with our ongoing Phase 1b/2 ALPHA-STAR trial and expect proof-of-concept results in mid-2024. While there are several preventative treatments currently available and in development, we believe that the profile of STAR-0215 has an effective monoclonal antibody plasma kallikrein inhibitor dosed every 3 months or less frequently can address the unmet need in this market and become a leading treatment option for HAE patients. We've also conducted research with HAE prescribers who also expressed a very strong willingness to prescribe the treatment with STAR-0215's potential profile and suggest that STAR-0215 would gain strong patient share in a future HAE market, and that's what really excites us with bringing this treatment to the HAE community. So on Slide 13, you can see that we assess the pharmacodynamic activity of STAR-0215 by measuring the functional innovation of plasma kallikrein using assays that are similar to those used by Dyax due to Phase 1 trial of lanadelumab in healthy volunteers and which allowed them to predict doses that would be effective in reducing HAE attacks. As shown here, we are planning to amend the trial to add a new cohort labeled here as Cohort 3 that would assess the effects of a subcutaneous dose regimen that targets high initial concentrations of STAR-0215 and that we anticipate would maintain plasma kallikrein inhibitory concentrations consistent with clinical benefit for 6 months. In summary, on Slide 17, we are thrilled that STAR-0215 has shown early proof-of-concept in the Phase 1a trial for its target profile, a long-acting preventative therapy for HAE, a best-in-class PK profile and dosing every 3 months or less frequently. And what we would like to be able to show is that the profile is -- from a safety perspective, is favorable that there aren't any additional or unexpected safety findings that we have robust durable reduction in attacks, in this case, measured from baseline, change from baseline and attack frequency, that we have PK and PD that's supportive of the clinical and safety findings that we've been describing and that we have a meaningful and positive impact on quality of life."
}