{
    "symbol": "CLVS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 12:42:07",
    "content": " At this time, I would like to welcome everyone to the Clovis Oncology Second Quarter 2022 Operating Results Conference Call. Today's agenda includes the following: Patrick Mahaffy, our President and CEO, will discuss the second quarter and recent highlights; and then Dr. Lindsey Rolfe, our Chief Medical Officer, will provide a summary of the recently presented FAP-2286 data at SNMMI and ATHENA-MONO data at ASCO and the plans for Rubraca regulatory filings. Before we begin, please note that during today's conference call, we may make forward-looking statements within the meaning of the federal security laws, including statements concerning our financial outlook and expected business plans. The data, which were presented at the Society of Nuclear Medicine and Molecular Imaging Annual Conference, showed the first evidence of safety and clinical activity for our first peptide-targeted radionuclide therapy candidate, and importantly, further demonstrate that fibroblast activation protein, or FAP, is a promising theranostic target with expression across many types of solid tumors. Lindsey, our Chief Medical Officer, will discuss the data in greater detail shortly, but we are obviously encouraged by the initial results and look forward to presenting additional clinical data and initiating Phase II expansion cohorts in multiple tumor types later this year. Sales in Q2 2022 were $32.1 million, 6% lower than the prior quarter and 13% lower year-over-year compared to Q2 2021. While ovarian cancer doses appear to be reverting to pre-pandemic levels, the effect of this increase is almost wholly observed on front-line treatments and will not likely impact the second-line indication for several quarters. Despite the decline in sales, we remain confident in Rubraca's potential to address larger patient population in earlier lines of therapy for both ovarian and prostate cancer based on our ongoing and recently reported Phase III studies. Following ATHENA-MONO, two additional top line Phase III data readouts for Rubraca are expected in the next few quarters. Data from the ATHENA-COMBO trial with Rubraca, in combination with Opdivo in the front-line ovarian cancer maintenance treatment setting, is expected in the first quarter of 2023. Our efforts to raise additional capital also include entering into strategic partnerships or licensing arrangements, and we are currently in preliminary discussions related to partnering certain development and commercialization rights to FAP-2286 for an upfront payment with the potential for milestones, research and development support and royalties. As a quick reminder, FAP-2286 is the first peptide-targeted radionuclide therapy and imaging agent targeting fibroblast activation program -- protein, or FAP, to enter clinical development and is the lead candidate in our targeted radiotherapy development program. In the ongoing Phase I/II LuMIERE study, FAP-2286 is used both as an imaging agent and a therapeutic agent often known as a theranostic. In addition to the data from LuMIERE, additional data from a separate investigator-sponsored imaging study with FAP-2286 were also presented at ASCO and SNMMI. In this Phase I study, FAP-2286 labeled with gallium-68 is being studied as a novel imaging agent to identify metastatic cancer in patients with solid tumors. ATHENA is a Phase III 1,000-patient study in front-line, newly diagnosed advanced ovarian cancer maintenance. With ATHENA, we believe we are uniquely positioned to evaluate Rubraca in terms of two independent outcomes: monotherapy versus placebo in the front-line maintenance setting as well as any potential advantage of the combination of Rubraca and Opdivo over Rubraca alone in the same front-line maintenance setting. The ATHENA-MONO trial, which is evaluating Rubraca monotherapy versus placebo, met its primary endpoint, showing Rubraca monotherapy versus placebo improved progression-free survival, or PFS, by investigator assessment in both populations in the primary efficacy analysis: HRD-positive and all patients randomized or ITT. Looking ahead to other Phase III readouts for Rubraca, data from ATHENA-COMBO, the combination of Rubraca plus Opdivo versus Rubraca monotherapy, are expected in the first quarter of 2023. The only opportunity for Rubraca monotherapy in front-line maintenance treatment of ovarian cancer, the ATHENA-COMBO study represents the potential to introduce an anti-PD-1-containing regimen for the first time to a broad population of ovarian cancer patients. In addition, top line data from the TRITON3 trial are expected early in the fourth quarter of 2022. We reported net product revenues for Rubraca of $32.1 million for Q2 2022, which included U.S. product revenues of $22.7 million and ex U.S. product revenues of $9.4 million, respectively. This represents a 6% -- sequential 6% decrease from Q1 2022 and a 13% decrease year-over-year compared to Q2 2021 net product revenues of $36.8 million, which included U.S. product revenues of $27.7 million and ex U.S. net product revenues of $9.1 million. Research and development expenses totaled $36.4 million for Q2 2022, down 20% compared to $45.8 million for the comparable period in 2021 primarily due to lower spending on Rubraca clinical trials. Selling, general and administrative expenses totaled $32.6 million for Q2 2022, down 1% compared to $32.9 million for the comparable period in 2021 due to overall cost reduction efforts. Clovis had $94.6 million in cash and cash equivalents as of June 30, 2022. As of June 30, 2022, the company had drawn $165.2 million under the Sixth Street Partners, LLC, SSP, ATHENA clinical trial financing and had up to $9.8 million available to draw under the agreement to fund the expenses of the ATHENA trial. Based on our current cash, cash equivalents and liquidity available under the ATHENA clinical financing agreement, together with current estimates for revenues generated by Rubraca, the company will need to raise additional capital in the near term in order to fund our operating plan and continue as a going concern beyond February of 2023. Therefore, we are currently exploring alternatives and strategies to increase the number of shares that would be available for issuance to permit greater flexibility in raising capital through equity transactions, including the offer and sale of super-voting mirorred preferred stock that has been utilized by peers in similar situations to support approval of such proposals where the existing votes of shareholders or stockholders already indicate favorable support. As Pat mentioned, Clovis is also actively exploring sources of funding other than equity financing transactions, including through entering into strategic partnerships or licensing agreements for one or more of our products or product candidates, in order to raise sufficient capital to fund the company's operating plan and continue as a going concern beyond February of 2023. Net cash used in operating activities was $35.1 million for Q2 2022, down 25% from $46.8 million reported in Q2 2021. Cash burn in Q2 2022 was $26.4 million, down 21% from $33.4 million in Q2 2021 and down 46% from $49.3 million in Q1 2022. In summary, with the early but encouraging clinical activity and safety seen to date from the LuMIERE trial of FAP-2286, we look forward to presenting updated clinical data from the LuMIERE study in Barcelona in October and initiating Phase II expansion cohorts in multiple tumor types during the fourth quarter. Thought leader feedback on the ATHENA-MONO data has been enthusiastic and supportive, and we look forward to submitting the NDA and Type II variation based on the ATHENA-MONO data during the third quarter. We continue to look forward to the anticipated Phase III data readout of TRITON3 in the second-line prostate cancer treatment setting early in the fourth quarter this year and ATHENA-COMBO in combination with Opdivo in the front-line ovarian cancer maintenance treatment setting in the first quarter of 2023."
}