{
    "symbol": "MNMD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 14:35:02",
    "content": " Last week, on May 11, Dr. Frederike Holze and Prof. Dr. Matthias Liechti, MindMed collaborators at the University Hospital Basel, UHB, presented results from the LSD-Assist Study, a Phase 2 placebo-controlled investigator-initiated trial of LSD in the treatment of anxiety disorders at London's PSYCH Symposium. MSMS is a technological platform that provides the foundation in the development and implementation of a suite of products for use by clinicians and patients during treatment sessions that may also include the use of consciousness alternative medication.The launch of this study is an important milestone for our future development of regulated devices and software as a medical device, or SAMD, products that are designed to support novel analysis of multimodal data in the delivery of psychiatric care. The UHB study that you're mentioning, as we said during the call, was presented last week at PSYCH symposium in London and really the most modern and highest quality study of LSD ever conducted.I think it's really directly impactful on our program and does read through, does translate directly into the Phase 2 study that we have ongoing and anticipate dosing our first patient in the coming months. In terms of the adverse effects and adverse result that we saw in the UHB study, there really was nothing inconsistent with the drug class or with LSD when you look at the literature for both LSD and for all of psychedelics.And -- commonly, you see nausea, anxiety and headaches as with most drugs being higher up in the west, and that's really what we saw in terms of treatment-related events. That's not something that has really been reported extensively previously in the study and one that is critically important because it provides some level of a proxy that we can use to target acute activity that we can anticipate correlate with that longer clinical response.So very excited to see those data and we'll use that to inform certainly how we think about acute activity and targets in our treatment sessions, both in the Phase 2 study and beyond is to continue to build the data set. And with that said, I think it's critically important and to realize that the dose response study that we are conducting in Phase 2b will go a very long way to further that understanding, but also to give us the best opportunity to see this desired effect in the most patients possible, because of the incredible activity and incredible potency of LSD. So, it is a methodology that's used to -- in or in very commonly in dose optimization studies to both pick a or demonstrate a non-zero response curve and confirm what that dose response curve is prior to selecting an optimal course to bring forward in the Phase 3 study so, we are powered to detect differences that would be in line at a minimum in line with the historical standard of care and trying to improve on those standards, that is looking -- if you look at historical literature for psychedelics, the effect sizes are somewhere in the 0.3 to 0.4 Cohen's D range and we are anticipating or targeting to pick-up clinical response that would be slightly greater than that, so something around 0.5 range. We do not have that as a required entry criteria into the study and because this is a Phase 2b study, we feel it's important as with all drug development programs to take a rigorous approach to find the population but also gather data that can inform subsequent development. In terms of how outcome measures of our collected, there's also certainly methodological differences, nothing that -- I think as you look at a multicenter studying at approximately 20 studies we're targeting for Phase 2 study and 200 patients, honestly, that scale requires some additional support and infrastructure."
}