{
    "symbol": "CHT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-05 04:29:06",
    "content": " In the fourth quarter, our mobile revenue share and subscriber share climbed to 39.5% and 36.6%, respectively, achieving another solid period of growth on both year-over-year and quarter-over-quarter basis. In the fourth quarter, our total mobile service revenue was up by 5.8% year-over-year, maintaining its year-over-year growth for 20 consecutive months, attributable to the upsale resulting from 5G migration and outperforming subscriber number increase. In the fourth quarter, our fixed broadband revenue increased by 3.7% year-over-year, and the subscriber number continues to grow as well. In the fourth quarter, total revenue of CBG decreased by 2.1% year-over-year in spite of the strong growth of our core business. Other revenue also decreased by 34.9% year-over-year, owing to the higher base resulting from the government subsidies for accelerated 5G construction in the fourth quarter of 2021. The number of our video subscription that comprised of MOD and Hami Video, which are paid in monthly fees on an annual basis, rather than one time sign up, grew by 8.9% year-over-year in the fourth quarter, with growth mainly driven by Hami Video, thanks to the popular FIFA World Cup taking place in November. In the fourth quarter, EBG maintained its growth trajectory by demonstrating 2.9% revenue increase on a year-over-year basis, mainly attributable to the growth of our ICT business, particularly in IDC, service delivery, 5G networks and big data services. Additionally, we see the digital transformation trend and its opportunities continue to jump up data communication and broadband assets revenue to grow by 5.4% year-over-year, especially the speed upgrade demand from enterprise and schools although fixed line revenue kept flat year-over-year in the fourth quarter, affected by the decrease of revenue. In the fourth quarter, our total enterprise emerging application revenue increased by 8.8% year-over-year as most of our major applications demonstrated double digits year-over-year growth rate. For IDC, big data and cyber security services, we are delighted to see year-over-year revenue growth by 45%, 37% and 17%, respectively, owing to the increased demand of digital transformation and opportunities. In the fourth quarter, our international business group revenue decreased by 7.1% year-over-year, mainly due to the higher base of other revenue recognized in the fourth quarter of 2021 related to ST-2 compensation. Excluding the non-recurring impact, IBG revenue in the fourth quarter maintained its growth momentum and increased by 19.7% year-over-year, mainly driven by emerging business revenue and the fixed broadband revenue due to strong demand for IDC and the cloud services from global clients. For the fourth quarter of 2022, while revenue generated from our core business increased by 2.3%, total revenue decreased by 0.7% on a year-over-year basis, mainly attributable to decreased sales revenues resulting from the shortage of handsets."
}