{
    "symbol": "UPLD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 13:43:04",
    "content": " We should see strong free cash flow generation in Q4, keeping us on pace for the $30 million to $40 million of free cash flow generation for 2022 that we have expected. For the income statement, total revenue for the third quarter was $79.5 million, representing an increase of 5% year-over-year. And professional services revenue was $2.8 million for the quarter, an 11% year-over-year decline. Operating expenses, excluding acquisition-related expenses, depreciation, amortization and stock-based comp were $33.7 million for the quarter, or 42% of total revenue, all generally as expected. Our third quarter 2022 adjusted EBITDA was $24.9 million, or 31% of total revenue, compared to $25 million or 33% of total revenue for the third quarter of 2021. For cash flow, for the third quarter of 2022, GAAP operating cash flow was $1.9 million and free cash flow was $1.5 million, bringing year-to-date free cash flow to $23.4 million. We should see strong free cash flow generation in Q4, still keeping us on pace for the $30 million to $40 million of free cash flow generation for full year 2022, even after absorbing acquisition-related expenses. This ongoing free cash flow generation is in addition to our existing liquidity of approximately $302 million, comprised of the $242 million of cash in our balance sheet as of September 30 plus our $60 million undrawn revolver. For the fourth quarter ending December 31, 2022, Upland expects reported total revenue to be between $74.1 million and $80.1 million, including subscription and support revenue between $69.2 million and $74.6 million, for growth in total revenue of 2% at the mid-point over the quarter ended December 31, 2021. Fourth quarter 2022 adjusted EBITDA is expected to be between $22.9 million and $25.9 million, for an adjusted EBITDA margin of 32% at the mid-point. For the full year ending December 31, 2022, Upland expects reported total revenue to be between $312.6 million and $318.6 million, including subscription and support revenue between $292.9 million and $298.3 million, for growth in total revenue of 4% at the mid-point over the year ended December 31, 2021. Full year 2022 adjusted EBITDA is expected to be between $95.7 million and $98.7 million, for an adjusted EBITDA margin of 31% at the mid-point."
}