{
    "symbol": "UPLD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 20:51:12",
    "content": " We generated $8 million and free cash flow in the quarter, and that's after substantial acquisition expenses from the two acquisitions we announced in the quarter. On the income statement, total revenue for the first quarter was $78.7 million, representing an increase of 6% year-over-year. Operating expenses, excluding acquisition-related expenses, depreciation, amortization, and stock-based compensation, were $36.1 million for the first quarter or 46% of total revenue, all generally as expected. Our first quarter 2022 adjusted EBITDA was $23.4 million, or 30% of total revenue, up from $22.8 million, or 31% of total revenue for the first quarter of 2021. For the first quarter 2021 -- first quarter 2022 it is, GAAP operating cash flow was $8.2 million, and free cash flow was $8 million even with $10.4 million of acquisition-related expenses in the quarter. We are targeting $30 million to $40 million of free cash flow this year in 2022, but it will be back-end weighted given the transaction and transformation costs from our two recent acquisitions. For guidance, for the first -- for the quarter ending June 30, 2022, Upland expects reported total revenue to be between $77.5 million and $81.5 million, including subscription and support revenue between $72.7 million and $76.3 million, for growth in total revenue of 4% at the midpoint over the quarter ended June 30, 2021. Second Quarter 2022, adjusted EBITDA is expected to be between $23.4 million and $25.4 million for an adjusted EBITDA margin of 31% of the midpoint. For the full-year ending December 31, 2022, Upland expects reported total revenue to be between $313 million and $329 million, including subscription and support revenue between $293.1 million and $307.5 million for growth in total revenue of 6% at the midpoint over the year ended December 31, 2021. Full-year 2022, adjusted EBITDA is expected, to be between $95 million and $103 million for an adjusted EBITDA margin of 31% at the midpoint. Thank you for your question. The way to think about that team is if I'm a Global Account Manager and I have 10 customers that add up to $10 million in revenue, we challenge those guys to bring us back more revenue than they started with and so they have to make sure the customers are being retained and they have to make sure they're doing expansion or same-store sales, if you will. Thank you for your question. Thank you for your question. Thank you for your question. Thank you for your question."
}