{
    "symbol": "CGAU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 14:59:14",
    "content": " This change in operating practices means that the company has had to revise its consolidated 2022 outlook to reflect the suspension of stacking and leaching activities at Oksut, the continued suspension of gold room operations in the ADR plant as well as the impact of an assumed decline in copper prices and the impact that has on our Mount Milligan operation. As a result of a lack of access to activated carbon, mining and crushing are currently ongoing and the company's evaluating whether these activities should continue while we pursue an amendment to our Environmental Impact Assessment Permit to align permitted limits with current operational plans as at June 30 Oksut had stored golden carbon inventory totaling some 58,469 ounces. I would note that should copper prices stay at the current spot levels for the remainder of the year, the company's all-in sustaining costs as well as its cash flow outlook would see a positive impact versus this revised guidance. Due to the suspension of the ADR plant as noted earlier by Scott, the Oksut mine has no recorded sales or production in the quarter, however, stored gold-in-carbon inventory balance recognized 58,460 non-recoverable ounces at June 30. During the quarter, the Mount Milligan mine operations average gold price realized was $1,335 per ounce and $2.19 per pound of copper, this incorporates the existing streaming arrangements over the mine. As noted in the MD&A, the Mount Milligan mine generated $81 million in positive operating cash flow, this favorable variance compared to prior years was a result of the one sales shipment recognized in Q1 2022 of approximately $42 million, the cash only being received in Q2. Free cash flow deficit from continuing operations for the quarter was $31 million, primarily driven by the $55.4 million from the Oksut mine currently current operational status, together with a $6.1 million deficit at the Molybdenum business unit. The earnings in the quarter attributable to operations were at minimal $2.7 million contributed from the Mount Milligan mine as a result of the mark-to-market adjustments from a historical recorded provisional copper and gold concentrate sales together with the reduced gold level sold and lower copper prices realized, this included the mark-to-market adjustments."
}