{
    "symbol": "MPLN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 11:47:08",
    "content": " Also, we made progress on reducing our debt by repurchasing $136 million of face value of our 5.75% unsecured bonds in the open market at a greater than 25% discount to par and even after that repurchase still ended the quarter with over $300 million of cash that we can use for further debt reduction, accretive M&A or opportunistic share repurchases. Turning to our fourth quarter results, as shown on Page 3 of the supplemental deck, revenues of $241.1 million were at the midpoint of our guidance range and declined about $8 million from the prior quarter. In total, we expect our 2023 top line to decline about 10% to 14% from fiscal year 2022 and be flat to down 4% from the annualized Q4 2022 revenue run rate of $964 million. More specifically, we expect 2023 to be a low point for revenues and EBITDA as the contract renewals with our largest customers stabilize our core business over the next several years as health care utilization eventually recovers and as our new Growth Plan lifts our results and allows us to resume our growth in 2024 and beyond. As shown on Page 5 of the supplemental deck, fourth quarter revenue was $241.1 million, a decline of 19.2% over Q4 '21 and a decline of 3.7% from the prior quarter. Fourth quarter adjusted EBITDA expenses were $79.6 million, up $5.2 million from $74.4 million in the prior year quarter and up $1.3 million from Q3 2022. As shown on Page 14 of the supplemental deck, we ended the year with $334 million of unrestricted cash, which is net of the $100 million we used for debt repurchase in the fourth quarter. First, we are entering 2023 at a lower run rate of revenues versus full year '22, driven by the dynamics discussed in our third quarter earnings calls, including weaker utilization of health care services, unfavorable mix shift of claims volume and some customer shifts. Finally, we anticipate operating cash flow to be between $175 million and $215 million in 2023 versus $372 million for full year '22, driven primarily by lower adjusted EBITDA, higher interest expense and capital expenditures and a onetime shareholder litigation settlement of $24 million. As outlined on Page 13 of the supplemental deck and the press release this morning, for Q1 '23, we anticipate revenues of $225 million to $240 million and adjusted EBITDA of $145 million to $160 million."
}