{
    "symbol": "BILI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-29 11:31:04",
    "content": " In the third quarter, DAUs reached more than 90 million and MAUs nearly 333 million, both up 25% year-over-year. Average daily time spent per user was 96 minutes in the third quarter, up 8 minutes from the same period last year. With that, the total time spent on Bilibili grew by 37% year-over-year. DAUs not only represent the quality and the sustainability of our community, but also directly linked to our inferential power as a platform, as well as various commercial prospects, particularly in terms of revenue generation for our advertising and VAS business. With our improving product offerings and refined algorithms, we can continue to grow our DAU base and improve our DAU to MAU ratio with reduced sales and marketing spend. After a challenging first half of the year, revenues in the third quarter grew to RMB5.8 billion, up 18% quarter-over-quarter and 11% year-over-year. Sales and marketing expenses as a percentage of total revenues were 21%, down 3 percentage points sequentially. Accordingly, we expect our sales, marketing and R&D expenses to peak this year and start to decline in 2023 with net loss narrowing further accordingly. Starting with content, over the years, the young generations on Bilibili grow up and enter into new stages of life, their interest involved, driving greater passion as well as expansion of our content categories. In the third quarter, 3.8 million monthly active content creators on Bilibili readily accommodated these varied needs, creating near 15 million new videos on a monthly basis, up 14% and 54% year-over-year respectively. Total video views grew by 64% year-over-year, driven by both PUGV and Story Mode content, which grew by 34% and over 470% year-over-year respectively. Particularly with improving content distribution capabilities of Story Mode, content creators can build their fan base more easily, sharing their content with other contract spreads on Bilibili. In the third quarter, over 1.2 million content creators under income through multiple channels on Bilibili, up 74% year-over-year. As I mentioned earlier, the average daily user time spend reached a record high of 96 minutes, up 8 minutes from the same period last year. Furthermore, the number of official members on our site was up by 37% year-over-year to 183 million, maintaining a stable 12-month retention rate above 80%. Our VAS revenues was RMB2.2 billion, up 16% year-over-year in the third quarter. Looking at our advertising, despite softness in macro environment, net revenues were RMB1.4 billion, an increase of 16% year-over-year. Our top advertising verticals in the third quarter was against digital products and home appliance, skin care and cosmetics, automotive and food and beverage. And for games, our game revenues grew 6% year-over-year to RMB1.5 billion, largely driven by the new titles we launched in the domestic and overseas market in the third quarter. Total net revenues for the quarter were RMB5.8 billion, up 11% from the same period of 2021. Our total net revenue breakdown by revenue stream was approximately 25% mobile games, 38% VAS, 23% advertising, and 14% from the e-commerce and other business. Sales and marketing expenses as a percentage of total revenues, was also down to 21%, compared with 31% in the same period last year. G&A expenses was RMB543.4 million, up 14% year-over-year. R&D expenses was RMB1.1 billion, representing a 43% increase year-over-year. Net loss and adjusted net loss was RMB1.7 billion and RMB1.8 billion for the third quarter of 2022, respectively. Turning to our capital allocation and the liability management, we currently have three outstanding convertible bonds totaling $2.5 billion, among which the full  price of $746 million is accessible in June 2023, $429 million is accessible in April 2024 and $1.3 billion is accessible in December 2024. As of October 31, 2022, we had repurchased and retailed a total principal amount of $329 million of these notes for a total cash consideration of $247 million, generating $82 million net cash position. Well, if we are able to grow 3x in the past few years, which supported the thesis that the Bilibiliâ\u0080\u0099s business model, which is the community plus the content ecosystem works and is quite successful and shows our ability to maintain a high quality, highly sticky community while we deliver a very impressive user growth. Even in 3Q, we delivered a 25% year-on-year growth. Starting from 2022, we also put a lot of work in terms of the DAU growth, because we do believe that DAU compared to MAU can present the quality of the user growth as well as the sustainability of the user growth. And if you look at our DAU-MAU ratio, it has already improved from 26% in 2021 to 27% in 2022. The reason why weâ\u0080\u0099re putting more emphasis to DAU instead of MAU, we believe from one aspect, it can help us to increase the monetization efficiency help us to grow our revenue at the same time to reduce our sales marketing expenses and to achieve breakeven often as possible. We are very confident to the DAU growth next year, and we believe this will be more sustainable for the core company as well as be very beneficial to our commercialization efforts. And as for the outlook for next year, we hope to increase our DAU to MAU ratio to 30%. In Q3 this year, our sales and marketing expense already declined 25% year-over-year. As weâ\u0080\u0099re shifting our focus from MAU to DAU, we expect we can further reduce our sales and marketing expense and the magnitude of the decline will be even bigger in 2023 compared to 2022. We will now take our next question. And as I mentioned earlier, sales and marketing continued to decline year-on-year for three consecutive quarters. At the same time, we will also take actions to optimize our organizational structure to reduce the fat and increase the lean, and we expect this adjustment will be completed by end of this year and will start to show on P&L starting from first quarter next year. Sales and marketing expense in 2022 has already declined year-over-year, as mentioned by our Chairman and will continue to decline next year. In 2023 and the future period, we expect overall operating expenses in absolute dollar terms will decline year-over-year, and net loss will further narrow down until reach our breakeven target. Despite weaken macro environment of the ad revenue in third quarter reached RMB1.35 billion, an increased 16% year-over-year. This â\u0080\u0093 we consider this is a job well done and especially the ad revenue from performance-related formats increased by over 20% year-over-year, and we have continued to take market share in the ad market. And we intend to further combine our content ecosystem with our ad business, particularly in those â\u0080\u0093 in our drilling vertical increase our ad inventory and accelerate ad momentum in the consumption and transaction scenarios. And as we move forward, we expect verticals like automotive, baby and maternity and home decor and appliances will have great potential especially as the young generation continue to grow with Bilibili as they enter into different life stages. And in Q3, actually, the automotive sector grew over 80% year-on-year within Bilibili. In 2023, we plan to further connect the transaction scenario with the Bilibili community and with advertising business. We are already starting to explore the seating consumption and transaction model, including video and live broadcasting-based e-commerce as well as traffic acquisition within the Bilibili community. During this yearâ\u0080\u0099s Double 11 despite the weakened macro environment, we still recorded a 47% year-on-year growth for our advertising revenue, among which the performance-based format of advertising revenue grew over 80%. As for the pre-roll, which is an old fashion format of advertising, actually only takes about 3% to 5% of the overall advertising market in China, and itâ\u0080\u0099s declining rapidly, along with its unit price. For example, we can explore within the video player frame, such as metaverse, bullet-chat ads and other innovative formats within the player frame, or we can explore the model that combines performance-based ads with both app download conversion module and CPS, we call it a game partner model. Lastly, would be the content e-commerce plus user acquisition within the Bilibili model. All of above-mentioned formats of advertising, we believe will generate higher income as well as itâ\u0080\u0099s more sustainable to our overall community. We are still very, very confident that our app business in 2022, 2023 will continue to outperform the overall industry and we will continue to take on more market share. Operator, next question please. We will now take our next question. At the same time, we have lots of content offerings in terms of live broadcasting and video on our platform. In the past 2 years, the game business didnâ\u0080\u0099t perform as well as we planned, which I believe is mainly due to the slower-than-expected self-developed game progress. Because we have the perfect environment in game content, I am still very confident whether itâ\u0080\u0099s self-developed games or licensing games, we can deliver sustainable growth in the sector. Operator, next question please. We will now take our next question. In Q3, content creator/host, the number of those content creators/host has increased 73% year-over-year, which is a quite impressive growth. We are also exploring from the demand side to fine â\u0080\u0093 to discover the users that they might be both interested in the same vertical of content, whether itâ\u0080\u0099s in the format of video or itâ\u0080\u0099s in the format of live broadcasting. And in the third quarter, we have seen the DAU penetration of live broadcasting continued to increase and the MAU for live broadcasting also recorded a 79% year-on-year growth. Last quarter, we have combined the operation of live broadcasting with the PUGV. And from an organizational perspective, itâ\u0080\u0099s the same team thatâ\u0080\u0099s looking over the content creators operation as well as live broadcasting host operation. And itâ\u0080\u0099s also the same team thatâ\u0080\u0099s paying attention to user, which user is watching certain content category and what kind of live broadcasting content he or she might be interested in. And for example, in terms of the V-UP  content categories, now we are opening up the video materials for video inventory to both Vtubers as well as the virtual life â\u0080\u0093 virtual content creators. In the past, we might think that for the knowledge sector content creators, itâ\u0080\u0099s difficult for them to monetize through live broadcasting. However, we have discussed in the law area or in the relationship areas, itâ\u0080\u0099s very suitable for the live broadcasting host to connect directly with the participants and do a Q&A session. And actually, we have seen one live broadcasting host to gain their â\u0080\u0093 gain her 1 million follower milestone just through the live broadcasting services. As such, I am very confident as the integration further penetrates within the live broadcasting and PUGV, the live broadcasting revenue as well as its gross margin will continue to increase in 2023."
}