{
    "symbol": "RTX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 12:27:02",
    "content": " With all that as a backdrop, we still delivered $67.1 billion in sales for the full year, which was up 6% organically and adjusted EPS of $4.78, which was up 12% year-over-year. In 2022, we captured $86 billion in new bookings, resulting in backlog growth of 12%, a book-to-bill of 1.28 and a near record backlog at the end of the year of $175 billion. Adjusted earnings per share of $1.27 was in line with our expectations and up 18%, led by the commercial aftermarket at Pratt & Collins, which more than offset the impact of lower productivity in our defense businesses. At Collins sales were $5.7 billion in the quarter, up 15% on an adjusted basis and up 16% organically, driven primarily by the continued recovery in commercial aerospace end markets. So shifting to Pratt & Whitney on Slide 7, sales of $5.7 billion were up 10% on an adjusted basis and up 11% on an organic basis, with commercial OE sales growth in large commercial engines in Pratt Canada as well as higher commercial aftermarket volume. Adjusted operating profit of $321 million was up $159 million from the prior year, driven primarily by drop-through on higher commercial aftermarket, which included a favorable contract adjustment that was partially offset by higher SG&A and R&D. Sales of $3.5 billion were down 8% versus prior year on an adjusted basis, driven by the divestiture of the Global Training and Services business in the fourth quarter of 2021. R&D sales were $4.1 billion, up 6% on an adjusted basis and up 7% organically, primarily driven by higher volume in Naval Power programs including SPY-6 production, higher volume in Strategic Missile Defense, including Next Generation Interceptor development and higher volume and advanced technology programs. Adjusted operating profit of $418 million was $68 million lower than the prior year, driven by unfavorable program mix and lower net program efficiencies, partially offset by drop-through on higher volume. At the RTX level, we expect full year 2023 sales of between $72 billion and $73 billion, which represents organic growth of 7% to 9% year-over-year. We expect Collins adjusted operating profit to grow between $750 million and $825 million versus last year, and this is primarily driven by drop-through on commercial aftermarket, higher OE production ramp and increased defense volumes. At Pratt & Whitney, we expect full year sales to be up low to mid-teens versus prior year, principally driven by higher OE deliveries in both Pratt's large commercial engine and Pratt Canada businesses, as well as continued growth in legacy large commercial engines, GTF aftermarket and Pratt Canada shop visits. We expect Pratt's adjusted operating profit to grow between $200 million and $275 million versus last year, primarily on higher aftermarket volume, which is partially offset by a higher large commercial OE delivery impact. Turning to RI&S, we expect full year sales to be flat versus the prior year and adjusted operating profit to be up between $75 million and $125 million, driven by improved net program efficiencies. And in R&D, we expect sales to grow low-to-mid single digits versus 2022 as the effects of the supply chain constraints ease in the back half of the year and for adjusted operating profit to be up between $175 million and $225 million versus prior year, driven by improved net program efficiencies, which will be partially offset by continued mix headwinds."
}