{
    "symbol": "OXSQ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 12:58:04",
    "content": " At this point, please direct your attention to the customary disclosure in this morning's press release regarding forward-looking information. Today's conference call includes forward-looking statements and projections that reflect the company's current views with respect to, among other things, future events and financial performance. Oxford Square's net investment income was approximately $4.3 million or $0.09 per share, which was unchanged from prior quarter. For the second quarter, we recorded a total investment income of approximately $9.9 million, which was unchanged from the prior quarter. In the second quarter, we recorded net unrealized depreciation on investments of approximately $46.2 million or $0.93 per share, compared to net unrealized depreciation on investments of approximately $13.5 million or $0.27 per share for the prior quarter. In the second quarter, we recorded realized losses on investments of approximately $1.5 million or $0.03 per share, compared to realized gains of $1 million or $0.02 per share for the prior quarter. During the second quarter, our investment activity consisted of purchases of approximately $26.9 million and sales and repayments of approximately $9.6 million. As of June 30, we held cash and cash equivalents of approximately $23.2 million on July 21, our Board of Directors declared monthly distributions of $0.035 per share for each of the months ending October, November and December of 2022. With that, I'll turn the call over to our Portfolio Manager Kevin Yonon, to discuss the loan market. During the quarter ended June 30, 2022, the U.S. loan market exhibited weakness versus the quarter ended March 31, 2022. According to LCD, during the quarter, there was pricing dispersion related to credit quality with BB-rated loan prices decreasing 399 basis points, or 4.06% B-rated loan prices decreasing 596 basis points or 6.08% and CCC-rated loan prices decreasing 744 basis points, or 8.37% on average. Additionally, the distress ratio defined as the percentage of loans with a price below 80% of particular, ended the quarter at approximately 3.65% compared to 1.55% at the end of March 2022. During the quarter ended June 30, 2022 primary market issuance was approximately $56 billion representing a 48% decline versus the quarter ended June 30, 2021. At the same time, U.S. loan fund outflows as measured by Lipper were approximately $2.9 billion for the quarter ended June 30. As a permanent capital vehicle, we historically have been able to take a longer term view towards our investment strategy. Yes, so I think we've seen borrowers - poor earnings, I would say that, generally speaking, earnings have been stable. I think generally speaking, the expectation was that earnings were going to be a little bit weaker into the second quarter earnings that we're starting - that they're starting to kind of come out now. And specifically in our corporate loan portfolio, we haven't yet received Q2 results for our portfolio, that - those results are due in the next month or so. However, when you look at Q1 results, as well as the commentary that were provided by certain management teams, as people are saying, you know, through Q1, earnings and revenues, generally were flat, margins are generally holding in there. However, there has been commentary, which we've heard sort of across the market, just regarding inflation and the impact on wages, supply chain disruptions and potential, you know future impacts on margin. Sure, Mickey we don't haven't stated or published target for loan prices, default rates, CCC downgrades, or any of the other metrics that we focus on and think about in the context of direct loan investing and CLO equity tranche investing. The real issue from our perspective is to what greater or lesser extent, the loan market has already discounted some of these variables and some of this potential dislocation going into the latter part of the year. The loan market today, having rallied about 125 or 150 basis points off its recent low of circa 92. is clearly at a discount - trading at a discount to par. The CLO market is broadly I would say less liquid, generally speaking than the larger parts of the syndicated corporate loan market, that lack of liquidity can occasionally lead to through opportunity. At the same time, some of the less liquid syndicated corporate loan names have also shown some interesting price movements. So when you do that - if you're able to go back into the market and buy new loans in the secondary market at even cheaper prices than perhaps is justified that can actually be a benefit for you folks, right. I mean, we often hear that CLOs and loan investor, professional loan investors do better during turbulent times when secondary prices are down than they do in more normal times. I think the question very neatly encapsulates a great deal of the philosophy around investing in syndicated corporate loans, and CLO tranches in times of economic dislocation and price volatility across the loan market broadly. So yes, we're in fundamental agreement with what you've just said, which is that, to the extent that we don't see a dramatic increase in corporate loan defaults. We're not saying that we don't expect some increase inevitably, in what has been historically a very, very low corporate loan default rate. At the same time, we are expectant that the significant majority of syndicated loans will repay at par, and our hope and even our expectation is to benefit from that dynamic, just as you say."
}