{
    "symbol": "PRCH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 00:00:30",
    "content": " After factoring in slowing growth investments to drive faster near term profitability in a more conservative estimate of the housing market, we now expect vertical software revenues of $175 million in 2022, a 28% increase year-over-year. On the right, you can see we reporting average revenue per company of $821 per month, lower than the prior year given fewer consumers per company, due to shifts in the housing market, as well as new companies from recent M&A being smaller revenue on average, given they aren't yet integrated into the Porch platform and monetization engine. And so what we're seeing is that some markets are starting to normalize, while others are still pretty hard and competitive and thus fewer home inspections and so overall given our platform expansion, you know weâ\u0080\u0099re seeing good progress on the metrics, however you know it's certainly a tougher environment and that's reflected in our guidance, and so I think it kind of goes without saying, in a more normal market we would be growing faster. If you look back over the last couple of years in the quarter-over-quarter, I mean clearly it's growing and then to that question you'd asked, yes, we are able to continue to get access to more consumers and be able to help more of them with services, so continue to be able to increase conversion rates, you know certainly thatâ\u0080\u0099s happening. We have been really pleased that the filings we booked for â\u0080\u0093 the price increase filings for insurance businesses we put forward into important states have gotten approved, you know at the levels that have been requested, and â\u0080\u0093 but like Matthew noted, you know the cost impact to inflation, it's you know right away and then the price increase even as you have prices that you start selling at the higher price, we recognize revenue over that next 12 months, and so that will start showing up as we look forward that you know helps top line and bottom line as that flows through. I mean the good thing about that $100 million is its recurring revenue with sticky software products that have a very high NTS and so I think what you're seeing is, you know as we highlighted, there's less transactions happening in the housing market."
}