{
    "symbol": "PRCH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 22:02:02",
    "content": " One of the reasons we chose HOA as the company to acquire is that uniquely had the characteristics that we liked, both in MGA and carrier business, a great leadership team, greater capital efficiency and less volatility than most by seeding much of the premiums to reinsurance companies, strong historic underwriting results, 15 years of historic claims data and a healthy financial position. First, we expect to decrease the amount of  reinsurance in 2023 to approximately 50% seeding levels, given a substantial increase in the cost of reinsurance in the market broadly and in support of the transition to the reciprocal which really expect to seed less and operate its reinsurance purchasing more efficiently. Revenue, less cost of revenue was $43.9 million, resulting in a 69% revenue less cost of revenue margin lower than prior year, driven by higher CAT weather related insurance claims. Gross written premium for our Insurance segment was $131 million, a 30% increase over the prior year, driven by continued growth in policies and higher premium per policy starting to flow through. Revenue in our Insurance segment was $31.2 million, a 94% increase over the prior year, driven by growth in policies, premium per policy in strong growth and home warranty. Revenue in our Software segment was $33 million, which was a 7% decrease over the prior year due to our moving services group, which was directly impacted by a soft housing market that continued to face headwinds. Insurance segment revenue grew 119% in 2022, driven by growth in policies, increased premium per policy and strong execution in our warranty business, including improvement in retention rates due to an improved value proposition per consumers. Revenue less cost of revenue was $168 million, a 61% revenue less cost of revenue margin down from the prior year, primarily driven by CAT weather-related insurance claims as mentioned. Looking at insurance on Slide 27, the segment continues to grow and into the fourth quarter with gross written premiums of $132 million with 389,000 policies while generating an average of $347 of revenue per policy per year."
}