{
    "symbol": "KALU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 15:25:24",
    "content": " EBITDA declined to $31 million in the third quarter, predominantly reflecting the headwinds associated with the U.S. Mag and Alcoa supply chain challenges at Warrick, and the planned outage at Trentwood, in which we incurred incremental costs in the aggregate totaling approximately $24 million for the quarter. Value added revenue for the third quarter 2022 of $356 million increased $50 million or 16% compared to the prior year period, predominantly reflecting improved pricing across our end markets to mitigate the impact of inflationary costs. Our aero high strength business value add revenue increased $4 million or 5% year-over-year on 10% lower shipments, reflecting a higher mix of high value products, while shipments reflect the impact of the planned outage at our Trentwood facility. Packaging value add revenue improved year-over-year by $21 million or 17% on 15% lower shipments, reflecting the commodity surcharges and higher pricing, while lower shipments reflect the impact of the force majeure declared in July for our packaging products. General engineering products improved $19 million or 26% year-over-year, reflecting higher pricing on 8% lower shipments, which was driven by softness in demand for extruded rod and bar products shipped to service centers. Aero high strength value added revenue increased $45 million year-over-year on an 11% improvement in shipments, reflecting higher pricing and continued improvement in underlying commercial aerospace demand. Packaging value add revenue for the first nine months of 2022 was $447 million or $189 million higher, reflecting a full nine months of the Warrick acquisition, commodity surcharges and higher pricing. General engineering value added revenue improved year-over-year by $69 million, primarily driven by higher pricing with continued strong demand, while added value added revenue for automotive applications increased $3 million, relatively flat as compared to the prior year first nine months, reflecting the ongoing semiconductor and other automotive supply chain disruptions. The decrease reflects the higher value added revenue, as discussed, offset by higher major maintenance, manufacturing, energy and employee related costs, as well as the $54 million of supply chain disruptions and the incremental freight costs we have discussed in this and previous quarters, which have now been addressed as noted by Keith. Adjusting for $3 million of non-run rate charges, adjusted operating income was $6 million, down 78% from $26 million in the prior year third quarter, primarily due to the decrease in EBITDA as previously discussed. Adjusting for non-run rate items noted above, adjusted net income for the third quarter of 2022 was $10 million compared to adjusted net income of $9 million in the prior year quarter. Given the current outlook for our markets and our expected mix of shipments along with continued strong inflationary pressures and an expected higher incremental spend of approximately $5 million in major maintenance in the fourth quarter, we expect our fourth quarter EBITDA and margins to improve to levels similar to the results we delivered in the first half of this year now that our major supply chain issues have largely been resolved."
}