{
    "symbol": "KALU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 14:40:10",
    "content": " Adjusted EBITDA in the fourth quarter was relatively consistent with the prior quarter at approximately $30 million, primarily reflecting headwinds associated with our ability to increase prices to recover higher commodity and input costs, coupled with lower packaging shipments as we experienced some destocking, primarily by beverage customers at the end of the year. For the full year, total incremental cost of $73 million included those costs previously identified due to supply chain disruptions at Warrick, along with unusual freight and third quarter outage costs at our Trentwood facility. Aero high-strength conversion revenue totaled $103 million in the fourth quarter of 2022 after an $8 million adjustment for incremental alloyed metal, reflecting a 25% improvement on a 28% increase in shipments over the prior year quarter. For the full year 2022, aero high-strength conversion revenue totaled $356 million, up 13% over the prior year, after a $32 million adjustment for alloyed metals, reflecting a 15% increase in shipments driven by improving commercial aerospace demand and continuing strong demand for our biz jet and defense applications. Packaging conversion revenue was $134 million in the fourth quarter, up 2% year-over-year after a $23 million adjustment for alloyed metal. For the full year 2022, packaging conversion revenue was $555 million, up 42% after adjusting for $49 million for alloyed metal on a 21% increase in shipments over 2021. For the full year 2022, general engineering conversion revenue was $367 million, up 23% after a $22 million impact for alloyed metal, led by higher pricing and a modest 2% year-over-year increase in shipments, given the destocking of our extruded rod and bar products and the impact of the third quarter treatment planned outage. Auto conversion revenue was $25 million after a $2 million adjustment for alloyed metal, up 10% over the fourth quarter 2021, driven by a 6% increase in shipments and improved pricing. For the full year 2022, auto conversion revenue was $96 million after a $7 million adjustment for alloyed metal, relatively flat year-over-year on a modest 3% increase in shipments compared to 2021 as shipments remain stable amid persistent industry supply chain issues. After adjusting for $31 million of non-run-rate charges, including a $24 million noncash impairment of goodwill and other intangibles related to our Warrick acquisition, a $3 million adjustment to our environmental reserves related to historical PCB cleanup activity at our Trentwood facility and a $2 million restructuring charge related to our corporate office relocation, adjusted operating income was $35 million, down 62% year-over-year. Adjusted for non-run rate items noted above, adjusted net loss for the fourth quarter of 2022 was $7 million or $0.45 loss per adjusted diluted share compared to adjusted net income of $5 million or $0.33 per adjusted diluted share in the prior year quarter. If you roll back in that $73 million of incremental cost, and then if you look at this LIFO impact adjustment that we made, which was roughly a $22 million impact to EBITDA for the year, this business would have delivered roughly $237 million EBITDA which would equate to roughly a 17% margin."
}