{
    "symbol": "MRK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 12:08:06",
    "content": " In the U.S., KEYTRUDA continues to demonstrate strong growth across all key tumors and is benefiting from recent launches in earlier stage cancers, including triple-negative breast, renal cell carcinoma and melanoma. Lenvima alliance revenue also had very strong growth driven by uptake following the launches of KEYNOTE-581 in advanced renal cell carcinoma and KEYNOTE-775 in metastatic endometrial cancer, where we are seeing encouraging new patient share trends across each of these tumor types. At the European Society for Medical Oncology Virtual plenary session last month, data from the KEYNOTE-091 or PEARL trial, evaluating KEYTRUDA for the adjuvant treatment of patients with Stage Ib to IIIa non-small cell lung cancer following surgical resection were presented. Additional ongoing studies in earlier stages of non-small cell lung cancer include KEYNOTE-671, which is evaluating neoadjuvant adjuvant therapy for patients with resectable 2, 3A and 3B disease; KEYNOTE-867, which is studying stereotactic body radiotherapy with or without KEYTRUDA in adults with unreflected Stage 1 HER2 disease, and PLN12 where we are studying KEYTRUDA in combination with Lynparza in Stage 3 disease. Following the approval of KEYTRUDA for the adjuvant treatment of patients 12 years and older with Stage IIB or IIC melanoma following complete resection based on KEYNOTE-716, we announced that at a prespecified interim analysis, the study also met its secondary endpoint of distinct metastasis-free survival and showed continued improvement in recurrent free survival compared to placebo. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. The one thing I would just add in relationship to some of the comments that Caroline and Rob made is that I think it's very important to think about melanoma renal cell carcinoma and triple-negative breast cancer, where at least my experience being in the hospital, there's a concept of really looking at that earlier stage. Your line is open. Your line is open. Your line is open. Your line is open."
}