{
    "symbol": "ALT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 14:45:06",
    "content": " First and foremost, if you could lay out what you would hope to see in the MOMENTUM study just from a weight loss perspective that would be--you know, from your perspective, clinically relevant and likely successful as an obesity agent at 24 weeks, perhaps even generating strategic interest or potential partnership opportunities. Tirzepatide was at 12%, so the 8% to 10% is certainly within that range and is actually in excess of semaglutide, and we think that based on our Phase I data, we can have very, very good weight loss, but weâ\u0080\u0099ve constructed our target product profile to include not just a weight loss percentage number but the full spectrum of whatâ\u0080\u0099s going to differentiate drugs and get doctors to use them. Yes, and I would also point out that when we are comparing 15% to 20%, weâ\u0080\u0099re looking at 68 to 72 weeks for semaglutide and for tirzepatide versus what we are looking at here is a 48-week study, so thereâ\u0080\u0099s still a lot of runway left there to achieve additional weight loss beyond 48 weeks. One moment for our next question. One moment for our next question. Our projection for the percentage weight loss is actually greater than semaglutide at 24 weeks, but we think in terms of the target product profile, what will it include, it will include meaningful weight loss, meaning as Vipin pointed out, in that 15% to 20% range, although at the end of 48 weeks, although we think that based on our Phase I study results, we can achieve more than that. One moment for our next question. One moment for our next question. One moment for our next question. Weâ\u0080\u0099ve seen with the glucagon mechanism that you can move LDL cholesterol - we saw that in our first trial, so we would hope to achieve something above that 5% range, hypothetically maybe in that 10% range would be very nice to see, but again the number would have to be achieved at 48 weeks, and our first-in-human trial we were able to see a 20%, approximately 20% reduction in LDL and total cholesterol, and thatâ\u0080\u0099s directly attributable to the glucagon. One moment for our next question."
}