{
    "symbol": "VFC",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-26 18:13:02",
    "content": " Now to the North Face, which continues to deliver strong and broad-based performance and prove its undisputed leadership in the outdoor category, with revenue up 14% versus last year, reflecting double-digit growth across all regions and channels and leading to our biggest second quarter ever for the brand, bringing the year-to-date growth to 21%. As we have highlighted before, our intentionally built portfolio of brands is generating broad-based growth, excluding Vans, which is early in its work to reset, refocus and reaccelerate, the remainder of our portfolio grew revenue by 11% in the first half, with outdoor emerging brands continuing to gain scale and our PACs business recovering nicely and seeing an acceleration of growth to plus 25% across the same period. The North Face business continues to power forward, including and importantly, the North Face grew first half revenue by nearly 30% in Greater China, where most brands inside VF and across the broader market have been impacted by ongoing disruption. The Outdoor segment continues to experience favorable tailwinds, and the North Face delivered yet another quarter of strong double-digit growth across the region, highlighted by revenue growth of nearly 30% in the first half in Greater China. Those investments were up by 9% in the quarter, primarily reflecting initiatives in the digital and technology space and continued investment in demand and product creation in the brands; second, our revenue growth of plus 2% in the quarter is projected to be our lowest quarterly growth of the fiscal year; and finally, lower profit margins in our highly profitable Vans direct-to-consumer business, reflecting the brand's recent performance. Omar, for sure, Dickies is filling the impact here in the first half of the year of what's going on in the US market and obviously, particularly with our largest retail partner, and the exposure to that value and consumer, to your point, we've done really well from a growth standpoint over the last couple of years with Dickies. But now as we come into cold weather yesterday, you may have seen it, the cause drop highlighted some of the heritage Nuptse, Himalayan Parka, I think the Mountain Jacket that was in there and the Denali and really, I think what you see there is leveraging historical strong styles done in a very brand right way with a partner like COS , driving that halo impact that then cascades and across everything they're doing in that snow ski category, the commitment to climb, hike, active as you look at the online presentation and the remerchandising of that homepage."
}