{
    "symbol": "CHRS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 12:34:09",
    "content": " These statements include, but are not limited to, our ability to launch multiple new products, our ability to generate sufficient sales to achieve revenue growth and profitability, our SG&A and R&D expense guidance, our projected market share, our 2026 top line projections, our projections about market opportunities and our ability to advance our product candidates and successfully launch our products according to our projected time line. With an efficient operational structure in place, $275 million in cash at quarter end and access to an additional $100 million in nondilutive capital post approval of CIMERLI and toripalimab, the company is in a strong financial position going forward into the launches. To meet our expectations to achieve at least 10% unit market share peak, Coherus has invested more than $45 million in large-scale manufacturing and expects to be a high-volume, low-cost manufacturer, well positioned to compete on supply guarantees and price. The increase was primarily driven by higher commercialization expenses to support current UDENYCA sales and to prepare for multiple anticipated new product launches in 2022 and 2023, including CIMERLI, toripalimab, YUSIMRY and the on-body injector presentation of UDENYCA. With the approval of CIMERLI, we now have three FDA approved products with four product candidates in the final stage of FDA review, preparing for launch of 4 new products in 2022 and 2023 to generating sales, which will return the company to revenue growth and profitability. With $275 million in cash and cash equivalents, access to additional capital through existing agreements and the significant projected revenue growth, we believe we have the financial resources to launch and support these new products while judiciously continuing to invest in the oncology pipeline opportunities. And we think the interchangeability designation and exclusivity will provide yet another differentiating component as weâ\u0080\u0099re talking with payers because, quite frankly, retinal specialists, they want to stock multiple biosimilar products."
}