{
    "symbol": "HCSG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 10:31:03",
    "content": " After considering the estimated impact from the facility exits and one-time reduction related to the anticipated note restructuring, we estimate Q3 reported revenue base of $395 million, $400 million, and then a Q4 revenue base of $412 million to $417 million, absent any new business additions or facility assets. Your line is open. Since we started the year we knew it would be an all hands on deck exercise involving a bottoms up client-by-client, customer-by-customer approach and we've made significant progress, especially during the second quarter, but again, in terms of revenue and cost of services those ranges we provided are what we're most comfortable sharing. But to your point, Andy, the efforts and ultimately the results of the service agreement modification efforts are really more back-end loaded, meaning, they won't be realized in full until the first quarter of 2023, which is why we're framing it and orienting our strategies around exiting the year at that 86% cost of services run rate. Your line is open. Your line is open. Your line is open. We will keep an eye on the economics that persist in that specific facilities market and there's nothing that suggest that that client when faced with life without Healthcare Services Group doesn't get a fairly quick and significant reality check such that they're willing to come back to us to say, hey, yeah, I guess, trying to hire a manager wasn't as easy as we thought, trying to manage the line staff on budget or keep the department fully staffed for that matter is far more challenging. Your line is open. Your line is open. Your line is open. Whether that's an existing piece of business where we have the opportunity to upgrade perhaps an underperforming manager or if it's repurposing that manager into a new business opportunity, but from our perspective, if you think about SG&A, we've talked about 8.5% to 9.5% on a percentage basis as we're looking at exiting some of that business and the corresponding impact on revenue. In the quarter ahead we will continue to prioritize modifying our service agreements to adjust for the significant inflation experienced during the past year, as well as account for future inflation on a more real-time basis, with the goal of exiting the year with cost of services in line with our historical target of 86%."
}