{
    "symbol": "SSTK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 11:53:05",
    "content": " Please note that some of the information you will hear during our discussion today will consist of forward-looking statements, including without limitation, the long-term effects of investments in our business, the future success and financial impact of new and existing product offerings, our ability to consummate acquisitions and integrate the businesses we have acquired or may acquire into our existing operations, our future growth, margins and profitability, our long-term strategy and our performance targets including 2022 guidance. The key assets and capabilities that make Shutterstock so unique include, the leading content marketplace with superior depth and breadth across all categories, our recently introduced Creative Flow platform, a unique offering of content, data, and production solutions to large enterprises and small and medium sized businesses. For example, over the past several years we've acquired the world's largest 3D model marketplace in TurboSquid, the world's largest video first marketplace in Pond5 and we've been adding to our editorial and exclusive content most recently with the acquisition of Splash News. And last but not least we developed a strong muscle on our sales channel for end-to-end solution selling starting from our high-end differentiated creative content to our editorial offering in sports and entertainment and news including the Shutterstock archive, Real Time Splash Newsroom subscriptions to highly sophisticated local production services. Beyond integrating these two valuable acquisitions into our offering and the strong revenue synergy potential they offer, I strongly believe there's an opportunity to extend our lease by leveraging content as a key differentiator of our marketplace, delivering to our customers and enabling us to drive faster growth. Based on our year-to-date results, the return to strong growth in our e-commerce channel is taking longer than we initially expected and we attribute that to three drivers, notably weakness in Europe compounded by FX pressure and the roll off of the Russia business, ongoing product mix shift towards subscription products with higher LTV but with lower ALVs, and weakness in new customer acquisition. Itâ\u0080\u0099s the sales team that's executing strongly and firing on all cylinders, itâ\u0080\u0099s the SMB business that is growing rapidly on the back of some of the Flex family of solutions we introduced the middle of last year, and we're doing a phenomenal job of selling through our exclusive and editorial content as well as seeing a lot of success with our large enterprise clients with our Studios offering. And so there's a lot of pattern recognition that I see from a variety of industries that I bring to bear, but Shutterstock is so well positioned because of its balance sheet and because of its both human capital and assets and all of the assets that I talked about on the call from contributors to the actual content, to the marketplace itself, to the new tools that we're launching, to its editorial framework, and the scaling enterprise business again, there's a lot of opportunity for growth."
}