{
    "symbol": "SSTK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 11:16:06",
    "content": " As far as use cases, I think we can let our minds wander, but bringing the two together is the critical thought, and then you add in tools that we have and weâ\u0080\u0099re putting our customers in the way of continuing to do their job, whether itâ\u0080\u0099s on the advertising side, on the creative side, or just on whatever theyâ\u0080\u0099re trying to execute against, Shutterstock has got the tools, the content and now the generative images that will allow them to do even more than they could do yesterday. Itâ\u0080\u0099s a high velocity platform with almost a couple hundred million downloads per year, so weâ\u0080\u0099re the destination that they are coming to today to select content, and we think that by integrating generative AI into our Creative Flow platform, itâ\u0080\u0099s going to be a seamless experience for those users, so we hope this generates not only excitement but, again, experimentation and engagement, and we think weâ\u0080\u0099re going to be a great destination for that. In order to do that, we want to be able to bridge our existing content library with the OpenAI generative tools of DALL-E 2 so that we can know that the content that is created has a clean license and right to use, and in doing so, again, our contributors can feel great about that they will be compensated when they participate in something that is used going forward and our customers can then execute their project without worrying about not being able to use those assets. If we play it down the other side and accept anything that has been generated, weâ\u0080\u0099re not sure of the true ownership and therefore, by not knowing the true ownership, weâ\u0080\u0099re not able to actually pass that confidence to our customers, so we think this is a great way to create engagement for our customers, they can find what theyâ\u0080\u0099re looking for, our contributors can be as enthusiastic as theyâ\u0080\u0099ve always been about continuing to deliver content that will be monetized, and then as we go forward, there will be a fund created to make sure that as we educate AI models, our contributors will be compensated for that."
}