{
    "symbol": "ALRM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 19:10:03",
    "content": " Management's discussion during today's call will include forward-looking statements, which include among others projected financial performance, the impact of emerging market dynamics, trends and anticipated market demand, the impact of the COVID-19 pandemic, challenging global supply chain dynamics and adverse macroeconomic conditions, our business strategies, plans and objectives and integration of recent acquisitions, continued enhancements to our platform and offerings, opportunities for growth and expansion in our current and new markets. Our SaaS and license revenue in the second quarter was $129.5 million, up 14.4% over last year. This includes Connect software license revenue of approximately $6.9 million for the second quarter, down as expected from $8.3 million in the year ago quarter as our SaaS and license revenue visibility remains high with a revenue renewal rate of 94% in the second quarter. Hardware and other revenue in the second quarter was $83.4 million, up 10.2% over Q2, 2021. Turning to operating expenses, R&D expenses in the second quarter were $54.2 million compared to $43.5 million for the second quarter of 2021, mainly due to employee related expenses. Our G&A expenses in the second quarter were $29.3 million, up from $23.3 million in the same quarter last year, mainly due to increased legal fees, employee related costs, travel costs and rent as we expanded our facilities to accommodate our growth. Non-GAAP adjusted EBITDA in the second quarter was $37.1 million, down slightly from $38 million in Q2, 2021. Non-GAAP adjusted net income was $26.9 million or $0.49 per diluted share in the second quarter, compared to $27.7 million or $0.54 per diluted share for the second quarter of 2021. Turning to our financial outlook, for the third quarter of 2022, we expect SaaS and license revenue of $130.9 million to $131.1 million. Whereas, a year ago, their SaaS revenue was a $0.5 million and this quarter, their SaaS revenue was $1.5 million."
}