{
    "symbol": "ALRM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:31:06",
    "content": " These statements are subject to risks and uncertainties, including those contained in today's earnings press release and in the Risk Factors section of our most recent quarterly report on Form 10-Q filed with the Securities and Exchange Commission on November 9, 2022, and in subsequent reports that we file with the SEC from time to time, including our annual report on Form 10-K for the year ended December 31, 2022, that we intend to file with the SEC after this call that could cause actual results to differ materially from those contained in the forward-looking statements. Our full year 2022 SaaS and license revenue was $520.4 million, up 13% over the last year. SaaS and license revenue includes Connect software license revenue of approximately $6.3 million for the fourth quarter, down as expected from $7.4 million in the year ago quarter. For the full year of 2022, SaaS and license revenue of $520.4 million grew 13% over 2021. Hardware and other revenue grew 11.6% in 2022 to $322.2 million, mainly driven by sales of cameras. For the full year of 2022, total revenue grew 12.5% year-over-year to $842.6 million. Sales and marketing expenses in the fourth quarter were $23.6 million or 11.3% of total revenue compared to $24.6 million or 12.6% of revenue in the same quarter last year, mainly due to lower advertising costs in the fourth quarter of 2022. Our G&A expenses in the fourth quarter were $25.4 million compared to $22.6 million in the year ago quarter, mainly due to higher personnel-related costs, including stock compensation and consultant fees. Our free cash flow for 2022 was $28.3 million compared to $92.1 million for 2021, also due to our investment in inventory and our purchase of land for $22 million near our headquarters in Tysons, Virginia. For the first quarter of 2023, we expect SaaS and license revenue of $132.4 million to $132.6 million. For the year, the Other segment generated $42.2 million of SaaS revenue, 8.3% of hardware revenue, and that grew 26% year-over-year. Yes, the former was -- sorry, in Q4 '22, Connect software revenue was $6.3 million, in the year ago quarter in '21, Q4 '21 was $7.4 million. Can you remind me which businesses combined for, I think, in Steve Trundle's prepared remarks, approximately almost 30% of your fourth quarter SaaS revenue. And then just one other, I guess, topic to dive a little bit deeper in that, that was encouraging as Steve Valenzuela, you said the Other segment SaaS revenue was $13.4 million for the quarter, and that was 10% or more of the overall in the first time ever."
}