{
    "symbol": "ALRM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 21:33:02",
    "content": " Managementâ\u0080\u0099s discussion during today's call will include forward-looking statements, which include, among others, projected financial performance and key assumptions related thereto, including with respect to the Vivint dispute, potential legal spend and cost rationalization strategies; the impact of emerging market dynamics, trends and anticipated market demand; the impact of the COVID pandemic, challenging global supply chain dynamics and adverse macroeconomic conditions; our business strategies, plans and objectives; and integration of recent acquisitions and anticipated growth prospects of our Noonlight acquisition; continued enhancements to our platform and offerings; opportunities for growth and expansion in our current and new markets. These statements are subject to risks and uncertainties, including those contained in today's earnings press release and in the Risk Factors section of our most recent quarterly report on Form 10-Q filed with the Securities and Exchange Commission on August 9, 2022 and in subsequent reports that we file with the SEC from time to time, including our quarterly report on Form 10-Q for the quarter ended September 30, 2022 that we intend to file with the SEC shortly after this call, that could cause actual results to differ materially from those contained in the forward-looking statements. Our SaaS and license revenue in the third quarter was $133.1 million, up 12.8% over the same period last year. As we previously disclosed regarding the Vivint matter, Alarm.com believes that quarterly SaaS and license revenue and total revenue will be impacted by approximately $6 million per quarter beginning with the fourth quarter of 2022 and through 2023. R&D expenses in the third quarter were $55.6 million, compared to $44.1 million for the third quarter of 2021, mainly due to employee-related expenses. Our G&A expenses in the third quarter were $28 million, up from $18.7 million in the same quarter last year, mainly due to increased legal fees, employee-related expenses and travel costs. G&A expense in the third quarter includes non-ordinary course litigation expense of $3.1 million, compared to $1.6 million for Q3 2021. Non-GAAP adjusted EBITDA in the third quarter was $40.8 million, up from $37.6 million in Q3, 2021. Non-GAAP adjusted net income was $30.1 million, or $0.55 per diluted share in the third quarter, compared to $27.4 million, or $0.53 per diluted share for the third quarter of 2021. During the third quarter, we used $31.9 million to acquire an 85% controlling interest in Noonlight, which excludes $4.9 million in post-closing pullback provisions. As we indicated in our press release, we expect the impact on our SaaS and license revenue and our earnings and cash flow to be approximately $6 million per quarter. For the fourth quarter of 2022, we expect SaaS and license revenue of $130.5 million to $130.7 million. For the full year of 2022, we expect SaaS and license revenue to be between $516.3 million to $516.5 million compared to our prior guidance of $518.5 million to $519 million. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question. So if you take the -- you could take the $6 million less from Vivint right, that comes right off the bottom-line, plus there's some factor in the legal expenses that we're not assuming are adjusted out of adjusted EBITDA as well. And then, of course, there's, some costs in there for Noonlight as we talked about, it has less than $1 million that impact on our EBITDA for Q4 to our guidance in Q4."
}