{
    "symbol": "FFIE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-23 21:36:05",
    "content": " Today's call is being recorded, and we have allocated 1 hour for prepared remarks and Q&A. At this time, I would like to turn the conference over to Mark Connelly, Vice President of Investor Relations. We filed our first quarter earnings report on Form 10-Q with the SEC today, May 23, 2022, and issued a press release summarizing those results. Joining the call today from Faraday Future is our Global Chief Executive Officer, Dr. Carsten Breitfeld; and our Interim Chief Financial Officer, Becky Roof. On today's call, we will provide an update on current business conditions, the status of our FF 91 vehicle program and discuss our first quarter financial results. You can find a copy of the Form 10-Q and the Q1 2022 press release now, and a replay and transcript of this call later today in the Investor Relations section of our website at investors.ff.com. Please note that on this call, we will be making forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. For further discussion of the material risks and other important factors that could affect our financial results, please refer to our filings with the SEC. With that, I will turn the call over to Dr. Carsten Breitfeld, Global CEO of Faraday Future. I would like to start by thanking Faraday Future's shareholders, employees, advisors, and suppliers for their commitment and support. As of this morning, I'm happy to say, we are once again current with our quarterly financial filings, and we expect to file our S-1/A promptly. I'm also very happy to be able to introduce you to our Interim CFO, Becky Roof. Becky has extensive public and private company CFO experience, and we are delighted to have her here with us at Faraday Future. And our Board has a search for a permanent CFO underway, but our most critical finance priority right now is to strengthen our systems and processes and Becky is making this happen. To begin, I'm going to briefly discuss the Special Committee review, which was recently completed and the additional remediation actions that are being implemented. Then, I will review our first quarter progress and bring you up to date on our path to launching the FF 91 later this year. In the first quarter of 2021, our Board of Directors formed a Special Committee to investigate allegations of inaccurate company disclosures. That investigation resulted in a significant delay in the filing of our Q3 2021 financials, and our full year 2021 financials. The Special Committee concluded that except as described in the company's Form 8-K, which was filed in February 1, 2022, other substantive allegations of inaccurate disclosures that the Special Committee evaluated, including those made in the short seller report, were not supported by the evidence reviewed. However, the Special Committee did identify certain issues including inconsistencies in statements that were made to some investors, weaknesses in some internal controls and in our corporate compliance structure. The Special Committee looked at an exceptionally wide range of issues and recommended a number of remedial actions, which have been implemented or are being implemented right now. These remedial actions include certain employees being separated from the company, changes in the roles and responsibilities of certain other employees, disciplinary actions, changes in the way we collect and process information, and some organizational changes. The summary of the Special Committee investigation and its finding can be found in our 2021 10-K, which we filed on May 13, 2022. I want to thank Sue Swenson, our Executive Chairperson, who led the Special Committee for her leadership and the entire Board for their hard work and commitment to this important and necessary process. Now, let me turn to the first quarter and our business progress. I'm very pleased to say that thanks to the exceptional dedication of our team, we continue to make impressive progress with our business plan. I'm especially pleased by what I'm seeing going by visits to our Hanford manufacturing plant under the very capable leadership of Matt Tall, our Head of Manufacturing, and his excellent team. We recently announced that we marked our 4th and 5th milestones, the 4th being production-intent vehicles build for final engineering validation and certification; and the 5th, start of mechanical and electrical systems installation. Back in February, we celebrated the completion of the first production-intent vehicle built in Hanford. If you have been following us on social media, you will have seen that several more production-intent vehicles are being assembled now, and each new production-intent vehicle is built for a specific purpose and use and each one goes closer to the final product. We will be building many more over the next few months for use in testing, validation and also for marketing. As we build more production-intent cars, you will begin to see more of them at outside events and we are beginning already to ramp up our visibility. Currently, we are still dedicating most of our prototypes and production-intent vehicles to testing and validation. But by the end of the second quarter, we expect to have enough on hand to put them in front of potential buyers and investors more often. We will, of course, continue to welcome investors at our Hanford production facility and headquarters. About 80% of the equipment we need at Hanford is already on site, and the rest is on schedule to be delivered. As a reminder, completion of equipment installation is the  and final milestone before we start our production. I want to thank our vendors, our contractors, our employees, and everyone else who has helped keep us on the schedule during the very challenging period for the economy and for our team. The FF 91 program is on track and proceeding well, and we are also making important progress on our longer term business plans. During the first quarter in 2022, we announced that Myoung Shin, an automotive manufacturer based in South Korea has been contracted to manufacture the FF 81, which will be Faraday Future’s first high volume vehicle. Its plant in Gunsan where the FF 81 will be manufactured offers scale, flexibility, and an attractive port access. Under the agreement, Myoung Shin will maintain sufficient manufacturing capabilities and capacity to supply FF 81 vehicles in accordance with company forecast. We lease the Hanford plant, where we will build the FF 91 and Myoung Shin will provide the capital for the new plant in South Korea. In addition, I'm very happy to announce that we have signed our lease for our first flagship store in Beverly Hills, California. In our third quarter 2021 and full year 2021 filings, we announced that we had 401 preorders as of March 31, 2022. Preorders are fully refundable, non-binding, paid deposits for the FF 91 Futurist Alliance and/or the FF 91 Futurist vehicles, available initially for sales to customers in the U.S. and in China. FF 91 Futurist Alliance preorders require a $5,000 deposit for customers in the U.S. and RMB 50,000 deposit for customers in China. FF 91 Futurist preorders require a $1,500 deposit for customers in the U.S. and a RMB 20,000 deposit for customers in China. As of today, our preorder book is a reasonable match to our production expectations through 2022 year-end. As we begin to roll out our marketing program, I expect preorders to increase and keep pace with our production capacity. In 2023, for example, we expect to produce about 6,000 to 8,000 cars as we ramp production. Our marketing will be heavily online and rely on our branding campaign, our co-creation partners and our user community. Plan to show our car shows and high end consumer events, and we will be participating in a number of investor and consumer events to further showcase our production-intent vehicles. So now I'm going to turn over the call to our CFO, Becky Roof. It's great to be with you today, and I'm excited to be working with you and with the entire Faraday Future team. As Carsten explained earlier, I'm here as Interim CFO. I'm a Managing Director with AlixPartners, a financial advisory and consulting firm that provides short-term solutions to companies like Faraday Future. My mandate here is straightforward, get our filings up to date, put programs in place to address weaknesses in internal systems and controls, advance the capital raise process and help Carsten to identify a permanent CFO. In a relatively short time, I am happy to say that the team we have here has gotten our filings up to date and is making good progress on our other priorities. While the team here at Faraday Future is smaller than it needs to be, it is very high quality, and we are building on a very solid foundation. Our finance and accounting teams have been working exceptionally hard to get our filings up to date, and you should expect us to file our amended S-1/A shortly. Faraday Future reported an operating loss of approximately $149 million during the three months ended March 31, 2022 as compared to an operating loss of approximately $19 million for the three months ended March 31, 2021. Net loss increased to approximately $153 million during the three months ended March 31, 2022 as compared to an approximately $76 million loss for the three months ended March 31, 2021. Total assets on March 31, 2022 were $706 million compared to $907 million total assets on December 31, 2021. Total liabilities were approximately $271 million versus approximately $340 million on December 31, 2021. Since its inception, the company has incurred cumulative losses from operations and negative cash flows from operating activities, and the company's accumulated deficit was approximately $3 billion as of March 31, 2022. Cash as of March 31, 2022 was $276 million. The decrease in cash from December 31, 2021 to March 31, 2022 was about as expected given the pressure many companies in our industry are experiencing with logistics and materials costs and included the schedule and on time repayment of a $97 million note and accrued interest. The cash balance as of April 30, 2022 was $222 million. And while the delay in our financial filings delayed certain portions of our fundraising plans, we did make progress in the areas that were open to us. Now that we are current again, we are already ramping up our fundraising activities more broadly to ensure that we have access to and consider the widest range of opportunities. We have been working actively with our financial advisors through this period, and I’m pleased with where we are in that process. First, the changes we are making as a result of the Special Committee's work are already very clearly making us a stronger and better company. Second, our FF 91 program is on track and proceeding well in a difficult external environment. Testing, validation, and equipment installation are proceeding and we on track to launch the FF 91 in Q3 2022. Third, our agreement with Myoung Shin puts our high volume program for FF 81 production on track with an attractive asset-light strategy in an ideal manufacturing location to address the mass market. And most importantly, when we launch the FF 91 in the third quarter, Faraday Future will be the first truly high end luxury, intelligent EV manufacturer. This is more about word of mouth, strategic placements of the product and having key opinion leaders and influencers who are getting the word out of the brand, and this is something different, something new, something great. Next step is that people have our flagship store here in -- so the first one in Beverly Hills, like we just announced, which will open in the fourth quarter of this year, but this would be a touch point where people can really experience a brand and experience a product. And then recently, we got our product, we got production-intent cars in front of customers on a couple of events. So people are interested in the company, they sign up in the webpage, they come directly to us, give their business card. Then the next step, what we do is we convert part of these indications of interest into preorders and preorders needs down payment like I just said, $5,000, $1,500. And if you reflect what we have right now, we disclose this 401 paid preorders, this is basically the production, which is intent for this year. When it comes to the detailed pricing strategy, so we are not disclosing this right now, as you know, though price points are always announced just a couple of weeks before you launch a product into the market, because it takes a lot of let's say, competitive information of other competitors into account. So as we just said in 2023, so full year's production 2023, we expect something between 6,000 and 8,000 units. And to ramp up in 2022, it's a couple of hundred units we are going to build during our ramp up. Realizing that it never stops, but parts clearly slowed down dramatically. We have funding in place to cover our current ramp plans, but as we move further with the FF 81 and beyond, our funding needs will rise substantially and this was always the expectation. And then the next question, I guess kind of relates to the FF 81, as well, but I noticed you put out a release around the end of April about adding a brake supplier for the FF 91. The low volume production we have is not so much a challenge from a production standpoint or from logistics, but of course we need the right parts and the right quality at the right time. So we are talking about a couple of hundred -- a couple of hundred cars here, and a couple of thousand cars next year. So just from a volume perspective, it's not so much of a challenge to get all these parts. We have a very good team here, experienced people, from our colleagues I brought from BMW, which have great networks worldwide, and I feel quite comfortable that we get all -- we will get all the parts and the right quality we need. Just to start with another question on cash and liquidity, if I may. As planned, our spending ramps up quickly as we move towards launch, and with the completion of construction and paying for it and receiving parts. And as we've already noted, we've always expected that we will need to raise additional cash to build on production and launch the FF 81, the 71 and our Smart Last Mile Delivery vehicle. So that allows us to look at a range of capital raise options, different amounts, and at different times. Because I -- obviously the Q just hit so I'm still going through it, but it looks like maybe a free cash flow use of -- I don't know $170 million or so, which would be sort of like a quarter and a half of cash that you have currently. So I think I described, we believe we have sufficient cash to reach SOP but then raising additional funds to fully ramp up to production and go into the FF 81 was always part of our plans and we are accelerating our pace on fundraising. Yes, let me summarize first maybe to better understand, to see our manufacturing strategy. One is you definitely want to understand and own your manufacturing process because it's very important to be able to deliver quality, to manufacture, to cost, and then all these things. On the other hand, we don't want to invest billions of dollars into production sites right now. We need this capital to invest it into technology and product, and this is why we lease our Hanford plant here in California operated by our own. We ramp up the 91 and we were looking for a contract manufacturing partner to do the scale production for the FF 81, because this would be very capital intensive. So we talked of course to a couple of potential contract manufacturers and the one we found in South Korea, Myoung Shin, this deal has the big -- two big advantages. Well, the South Koreans, they are quite good friends with most of the economies in the world and you don't see tariffs with many countries at all and tariffs with other countries are very low compared to other parts in the world. So it's a great place to export from, and to partner who is bearing all the upfront investments. So it's basically, we announced 6 different milestones we have to achieve, and we just announced the achievement of milestone number 5, which is basically start to the implementation of machinery and the electric power and so as a supply for the different production units. And the way this works in the plant -- I don't know, you saw this before, so you prepare the plant from you put all the foundations and you have to put energy supply into it, and all the logistics around it, which can be challenging, and your equipment is preconfigured at your supplier. And so this milestone that we started to put the equipment in place and the electric supply, this is the one we just reached and the next one would then be start of our  production. I invite you and everybody to come to Hanford at any time, and see the real progress. It's a real car plant now, and it's very easier to see it and to talk about it. It's invested to 2 , maximum capacity 2,000 -- 10,000 units a year. It's now, right, planned for one shift operations, but of course we can scale this first. So we have very experienced VP, Matt Tall who's leading the plant. So you let's say start with a relatively low volume, very relatively low speed to make sure that the process is in place. And with every single quality issue, you learn, you implement it into your process and it gets better step by step. This is the reason why the ramp up is relatively slow, why I'm only talking about a couple of hundred cars a year. So you need two levels of quality, if you want to build quality cars. So Mathias is responsible for the supply chain quality and Matt Tall, who's running the plant is responsible for the quality of the build. And then there's a quality organization in place here, which controls and measures the quality against our trades."
}