{
    "symbol": "PIII",
    "quarter": 2,
    "year": 2022,
    "date": "2022-10-20 18:22:02",
    "content": " At the end of June 2022, we grew our at-risk Medicare Advantage membership to approximately 102,000, a 52% increase compared to 67,000 patients at the end of 2021. In summary, P3 is off to a great start in 2022. Our GAAP financials and reconciliation to non-GAAP financials have been included in our earnings press release, our annual report on Form 10-K and our quarterly reports on Form 10-Q for the first and second quarters of 2022 and filed with the SEC P3 is a population health management company delivering value-based care in the $350 billion Medicare Advantage space. Excluding the impairment charge, our net loss reflects costs associated with the on-boarding of roughly 35,000 new at-risk Medicare Advantage members to our platform during 2022, including adding new employees to support that growth. Adjusted EBITDA loss, a non-GAAP measure, was $48 million in the first half of 2022 compared to an adjusted EBITDA loss of $34 million in the same period of the prior year. On a per member per month basis, adjusted EBITDA loss for the first half of 2022 was $78, a solid improvement over a loss of $85 in the comparable prior year period, and $119 in the full year of 2021. I'd like to note that, our receivables have increased by $50 million in the second quarter of 2022 over the same period in the prior year, reflecting the delayed timing of payments from our health plan partners and the positive trajectory of our business. That compares to an adjusted EBITDA loss of $119 per member per month in the prior year, representing a 37% to 62% improvement, respectively, driven by continued improvements in our underlying operating performance, offset by incremental labor expenses related to investments to support our growth, including staffing and tools as well as continued expenses related to COVID-19. In summary, P3 is off to a great start in 2022. Right now, we're focused on absorbing a tremendous growth that we experienced in 2022, with our updated guidance we're now expecting year-over-year revenue growth of 61% to 69%. When I say current, now that we're current on our filings and as we think about our operating cash flow, certainly, we expect our operating cash flow losses to be much more modest in 2023, compared to 2022 for all the reasons that we've talked about, continued maturation of our members, growth in 2023, that's more in line with our long-term expectations."
}