{
    "symbol": "NAPA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-10 21:31:09",
    "content": " In spite of Omicron's short-term disruption to the economy, we were able to deliver continued strong performance in on-premise, while our off-premise business showed great resiliency and actually accelerated on top of solid positive growth observed earlier in the year. First, we generated 18% net sales growth on an organic basis, and our adjusted EBITDA also grew by approximately 12% when comparing against the prior year quarter, burdened by public company costs. In fact, according to IRI, the Duckhorn Portfolio was the fastest-growing wine supplier among the top 15 wine suppliers in the U.S. We are growing dollars by high teens and over -- and at over 3.5 times the rate of our closest competitor within the top 15; Third, our Duckhorn Vineyards and Decoy brands continue to lead our portfolio of high-growth luxury wines. These favorable demographics bode well for the brand and our continued effort to drive trade up into new price points as we've seen with the highly successful Decoy Limited blue label; third, as a result of these demographics, which are equally attractive to on-premise and off-premise retailers, we believe our partners will be further incentivized to offer our Decoy and Decoy Limited wines additional space on the wind list and the shelf. Volume growth was up 24.8% and was partially offset by negative 6.8% price mix contribution, which resulted primarily from the timing shift for select DTC volume out of the second quarter and into the first quarter, and from our leading Duckhorn Vineyards and Decoy winery brands, once again outpacing the other winery brands. Like I noted earlier, it's important to remember that results for our recent second quarter include approximately $1.4 million in public company costs that did not exist in the prior year quarter when we were a private company. We look at this on a comparative basis and burden fiscal 2021 second quarter results with a similar level of public company costs, adjusted EBITDA in the most recently completed quarter would reflect a growth rate of nearly 12%. In summary, we remain confident in our ability to continue to profitably outperform the high-growth luxury wine segment and are excited to meaningfully raise our fiscal year 2022 guidance following a very strong first half performance."
}