{
    "symbol": "NAPA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-02 21:22:01",
    "content": " When looking at three-year compound annual growth rates, which we believe is indicative of the underlying health of the business without pandemic-related noise, we continue to deliver double-digit growth supported by broad-based strength across all major metrics, cases, accounts sold and points of distribution. When looking at IRI consumption data as a proxy for certain types of off-premise sales, the Duckhorn portfolio remains the fastest-growing supplier of scale in the over $15 per bottle U.S. luxury wine segment having posted mid-teens growth in both dollars and units. When looking at results on a three-year CAGR basis, which we view as indicative of the underlying performance of the business without pandemic-related noise, our net sales growth was up double-digits. However, if we look at this on a normalized basis and burden third quarter fiscal 2021 results with a full quarter of public company costs, adjusted EBITDA reflects modest growth and approximately 60 basis points of margin expansion. We now expect net sales of $369 million to $373 million representing 10% to 11% growth year-over-year, adjusted EBITDA of $125 million to $128 million or 7% to 9% growth year-over-year, and adjusted EPS of $0.59 to $0.62 per share, which assumes a 25% effective tax rate and $114.5 million to $116.5 million diluted shares outstanding. As we celebrate a full year of being a public company, we are proud to report another quarter of strong financial results and out performance of the high-growth luxury wine industry. The combination of our high-quality, highly respected portfolio brands, differentiated one-stop luxury wine shop sales approach, scaled omnichannel platform, sustainable business model and strong execution delivered by an exceptional leadership team, put us in an advantageous position to build upon the momentum we have shown year-to-date and end the fiscal year on a high note."
}