{
    "symbol": "BOWL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-16 11:07:05",
    "content": " In fiscal year 2022, Bowlero generated record revenues of nearly $912 million and record adjusted EBITDA of over $316 million. Compared to our pre-pandemic trailing 12 month levels, as of December 2019 of $694 million and $174 million respectively, revenue was higher by $218 million or 31.4% and adjusted EBITDA expanded by $142 million or 82%. In the first nine weeks of Q1 of fiscal year '23, which takes you to September 4 of this year, revenue has remained extremely robust, with total revenue growing 53% versus pre-pandemic levels and same store revenue growing 33% on the same basis. As is true for the year, our performance in Q4 resulted in the highest level of revenue and adjusted EBITDA in any Q4 in the company's history. Driving this performance in the quarter was a very strong growth in revenue, which increased by 68.3% year-over-year and surpassed pre-pandemic levels by 72.2%. In Q4, even adjusting for the 14 week, revenue was $252.8 million, increasing 62.6% relative to pre-pandemic performance and 58.9% versus prior year. Adjusting for the 53 week and assessing the fiscal year, revenue was $896.8 million, which was an increase of 29.2% relative to pre-pandemic performance and 126.9% on a year-over-year basis. Adjusted EBITDA was $82.4 million in the quarter, which represents an increase of $40.1 million or 94.8% year-over-year, and an increase of $48.2 million or 140.9% relative to pre-pandemic performance. As Tom noted, Adjusted EBITDA for the year was $316.4 million and exceeded the pre-pandemic level by 81.9% and the prior year by $243.3 million or 332.7%. We now stand at $316.4 million or 81.9% higher than the pre-COVID adjusted EBITDA, as we grew adjusted EBITDA by $40.1 million in Q4 of FY '22 versus FY '21 alone. In summary, Bowlero's Q4 FY '22 performance continued to outpace the pre-pandemic levels, cementing an extremely solid annual performance and further demonstrating that the business continues to be very well-positioned to produce improved performance through a combination of organic growth and new center additions."
}