{
    "symbol": "STZ",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-06 16:00:06",
    "content": " Importantly, we believe our beer business remains well placed to continue to support the steady growth of our brands with inventories across the supply chain at historical norms and production continuing for our operating plans to meet volume expectations for the fiscal year and incremental capacity unlocked from our existing brewery operations in Mexico through optimization and productivity initiatives and the expansion of our breweries at Nava and Obergon, as well as the construction process of our new brewery in Veracruz are all advancing as planned. All in, the strong demand for our brands in the second quarter supported a net sales increase of 15% for our beer business and this in turn drove a 25% uplift in operating income, which also benefited from the lapping of higher obsolescence charges last year. Looking forward, we are also confident that over the medium-term, our beer business remains well positioned to deliver 7% to 9% net sales growth and 39% to 40% operating margin, supported by the sustained momentum of our core brands, the steady progress of our brewing capacity additions and the continued development of our innovation lineup, including the momentum of our Chelada brands, the recent launch of Fresca Mixed, the expansion of Modelo Oro from select test markets to the entire national market next year and the introduction of Corona non-alcoholic. As noted earlier, the largest premium and fine wine brands and craft spirits brands of our portfolio delivered solid depletion growth rates in the second quarter and relative to the market, the higher end portion of our wine portfolio which includes our premium and fine wine brands outperformed the corresponding category segments in U.S. tracked channels. Back to our Wine & Spirits business, International net sales grew 10% versus prior year showing the continued momentum of our brands in the select International markets that we are targeting, Going forward, we will continue to focus on growing our omnichannel and International footprint as we believe these channels will continue to grow as a portion of our mix over time and be an important opportunity for higher end growth. And number four, we continue to deliver on capital allocation priorities by maintaining our investment grade credit rating, delivering cash returns to shareholders through dividends and share buybacks, advancing the brewery capacity expansion and construction processes in our beer business to support its continued strong growth and executing on disciplined tuck-in M&A to fill gaps in our portfolio. Given the strong performance of our beer business, we are now targeting full year fiscal 2023 net sales growth of 8% to 10%, and operating income growth of 3% to 5% for that business. We anticipate second half operating income margins to be negatively affected as we expect the benefits from our pricing adjustments and cost saving actions will be more than offset by ongoing inflationary pressures across raw materials and packaging, particularly as more favorable hedges will continue to roll off, additional headcount and training, as well as increased depreciation from our brewery capacity expansions, and higher marketing spend as previously referenced. Now shifting to Wine & Spirits, Q2 fiscal 2023 net sales increased over 1% driven primarily by an increase in box sales and favorable pricing, and as Bill noted, Q2 depletion growth was solid for our largest premium wine brands Kim Crawford, Robert Mondavi Private Selection, Meiomi and Ruffino, our largest fine wine brand The Prisoner Wine Company and our largest craft spirits brand High West, Casa Noble and Mi CAMPO. The increase in COGS was mainly a result of higher supply chain costs, particularly container surcharges and warehousing, and higher material costs, including grapes and glass, partially offset by favorable fixed cost absorption as a result of the lapping of the New Zealand frost and the wildfires in the U.S. For full year fiscal 2023, we now expect Wine & Spirits net sales to come in flat to down 2% and operating income to increase 3% to 5%. As noted in our Q1 earnings call, we expect to achieve the uplift in operating margins in the second half through the following key drivers; consumer led premiumization and mix improvement mainly in our fine wine brands; incremental pricing actions executed in Q2 that will be fully reflected in the second half; a bountiful New Zealand harvest, which will drive volume and enhance margins for Kim Crawford; lowering marketing as a percent of net sales; and finally, continued benefits from our cost savings initiatives. We generated free cash flow of $1.2 billion for the first half of fiscal 2023, which is a 4% increase versus prior year, reflecting strong operating cash flow, partially offset by 23% increase in CapEx investments, as we continue to make good progress on our brewery capacity expansion plans to support the robust growth of our beer business. Your line is now live. Your line is now live. And I think, just kind of taking a step back, just given the change here, and I think, itâ\u0080\u0099s sort of been in some state of transition for a period of time, it sort of begs the broader question, whether the wine portfolio albeit a narrowed down one and more focused on premium -- the premium end of the category, whether you think it still makes sense within the broader portfolio relative to a beer business, much higher growth margins and return on capital. As you probably noted, most of the tuck-in work that we have done in our Wine & Spirits business has been focused on craft spirits, as well as higher end wine brands that fill portfolio gaps, all of which focus on the high end, where we believe the growth and margin profile are significantly improved. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}