{
    "symbol": "DOYU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 02:49:10",
    "content": " First, as we execute on our selective copyright procurement strategy, we have seized acquiring overpriced content rights for eSports tournament starting in the fourth quarter, which led to a year-over-year decline in MAUs caused by traffic loss from users who primarily on our platform. However, thanks to our high-quality streamers segmented and refined content such as self-produced tournaments, we retained old users and attracting new users during the quarter. Second, we collaborated with game developers to launch promotional activities to attract new platform users, partially offsetting a portion of the decrease in MAUs that resulted from our no longer purchasing certain copyright content. Based on users differentiating preferences and game features, we collaborated with well-known streamers, game developers and distributors to customize high-quality IP content shows, further enriching our content ecosystem by integrating livestreaming, video graphics and interactive communities. In the second quarter, we continued to enhance the diversified content system for our self-produced tournaments and increased investment in self-produced content with a focus on refining content and operations based on game categories. Operator, we are ready for next question. On the other hand, our long-term continuous stable users who came towards streamersâ\u0080\u0099 content, this large quantity of high-quality users are characterized by their high retention rates, longer viewing hours and stickiness to high-quality livestreaming content, leveraging our stable streamer structure we work with streamers of different characteristics to launch creative content and diversified our promotional activities based on the different collaboration with game developers. Since we have successfully stabilized our core user base and been able to attract new users to combine operations of utilizing streamer sources and self-produced content, we believe the negative impact from the absence of certain tournamentsâ\u0080\u0099 copyrights has fully absorbed. Operator, we are ready for next question."
}