{
    "symbol": "MPLN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 10:47:04",
    "content": " As shown on Page 4 of the supplemental deck, third quarter revenues of $250.5 million declined about $40 million from the prior quarter and fell about $30 million short of our third quarter guidance provided in August. As shown on Page 4 of the supplemental deck, Q3 revenue was $250.5 million, down 13.1% from Q3 '21 and down 13.7% from the prior quarter. These consisted of a $6 million impact from above-trend revenue yield in analytics based services during the first half of 2022 which subsided in Q3 and created a negative comparison, a $4 million impact related to customer contract adjustments and approximately $3 million of non-recurring one-time customer credits that were true-ups from prior periods. Our net COVID-related impact in the quarter was approximately $4 million to 6 million, a small percentage of revenues and similar to last quarter and down from approximately $8 million to $10 million in the prior year quarter as detailed on Page 17 of the supplemental deck. Network-based services declined 12.1% year-over-year driven by lower patient utilization, lower COVID-related volumes, substitution of analytics-based services and some attrition of smaller clients that we had called out with our second quarter results. Analytics-based services declined about 11.8% versus the prior quarter and 15% sequentially driven by lower patient utilization, the aforementioned partial program loss at one of our customers and the customer revenue adjustments, all of which were recognized in the service line. Turning to expenses, third quarter 2022 adjusted EBITDA expenses were $78.3 million, up from $69.9 million in the prior year quarter and down slightly from $80.5 million in Q2 '22. Adjusted EBITDA was $172.2 million in Q3 '22, down about 21.2% from $218.4 million in the prior year quarter and down about 17.9% sequentially. But the downward trend in EBITDA, let's call it $650 million annualized run rate, if you just take the fourth quarter guidance times divide by four, does that put the company in jeopardy of chipping any debt covenants in the next year."
}