{
    "symbol": "MPLN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 10:58:10",
    "content": " First quarter revenues were $298 million, up nearly 17% from the prior-year quarter, and basically in line with fourth quarter 2021. Adjusted EBITDA was $225.4 million, up nearly 18% from the prior-year quarter, and up just under 1% from the fourth quarter 2021. In the first quarter, we generated $5.6 billion in potential identified savings, a growth rate of over 9% from the prior-year on build charges of $31.7 billion as shown on Page 7 -- on Page 8 of our supplemental deck. As shown on Page 5 of the supplemental deck, excluding the revenue contributions from our acquisition of Discovery and normalizing for the decline in the impact of the COVID-19 pandemic during the quarter, revenues in Q1 2022 were up $21 million or nearly 8% over Q1 2021 and down $3 million or about 1% sequentially. At Page 7 of -- as detailed on Page 7 of the supplemental deck, we estimate the COVID-related revenue impact in Q1 2022 was approximately $3 million to $5 million, down from an estimated $5 million to $7 million in Q4 2021 down $18 million to $22 million from the prior-year quarter and slightly lower than what we were anticipating for this first quarter of 2022. First quarter 2022 adjusted EBITDA expenses were $72.6 million, up from $63.8 million in the prior-year quarter and down slightly from $74.7 million in Q4 2021 and consistent with our guidance for the quarter. Adjusted EBITDA was $225.4 million in Q1 2022, up 17.9% from $191.1 million in the prior-year quarter and up just 1% from $223.6 million in Q4. As shown on Page 5 excluding the adjusted EBITDA contribution from the DHP acquisition and normalizing for the impact of the COVID-19 pandemic, adjusted EBITDA for Q1 2022 was up 8.7% over prior-year quarter and up 1.6% sequentially. With first quarter revenues and adjusted EBITDA both exceeding our expectations, adjusted EBITDA margin came in at 75.6% in Q1 2022 60 basis points above the high-end of the range implied by our guidance and also up 60 basis points from a margin of 75.0% in both prior-year quarter and sequential quarters. Given stronger than anticipated first quarter results, and as I'll discuss momentarily, a smaller full-year COVID impact than initially anticipated, we are tracking towards the higher end of the guidance ranges of $1.16 billion to $1.20 billion for revenue and $850 million to $875 million for adjusted EBITDA. As we look towards our Q2 2022 results, we expect the COVID-related impact on revenues to increase slightly and look more like the $5 million to $7 million range we experienced in the fourth quarter of last year, as the quarter will reflect healthcare utilization in February, March and April, which we expected to be modestly suppressed due to the Omicron surge in the early part of the quarter and as we experienced a smaller offset from COVID testing and other COVID-related claims. We continue to expect adjusted EBITDA margins of around 73% for the full-year 2022, which compares with our first quarter margin of 75.6% and 200 basis points below our full-year 2021 margin of 75.0%. Reflecting these factors and as outlined by Page 12 of our supplemental deck, for the second quarter, we are guiding to $285 million to $295 million in revenues, and $205 million to $215 million in adjusted EBITDA. As noted earlier, we continue to generate strong cash flow and ended the first quarter with $350 million of cash on the balance sheet up from about $185 million in the fourth quarter."
}