{
    "symbol": "MPLN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 11:04:03",
    "content": " Second quarter revenues were $290.1 million, growing 5% from the prior year quarter, driven by an 8% increase in savings identified for health care systems stakeholders to $5.5 billion. Adjusted EBITDA was $209.6 million, up 2.1% from the prior year quarter and down 7% from the first quarter. In the second quarter, we generated $40.7 million in cash flow from operations and free cash flow of $21.8 million  provide to our payer customers, the more than 100,000 employers and other health plan sponsors that use our services either through these payers or directly and the more than 60 million health plan members, those payers and plan sponsors serve. In the second quarter, we generated $5.5 billion in potential identified savings, up 3.5% from the prior year on bill charges of $32 billion as shown on Page 8 of our supplemental deck. As shown on Page 4 of the supplemental deck, Q2 revenue was $290.1 million, up 5% over Q2 2021, and down 2.7% from a normally strong first quarter, which, as Dale mentioned, benefited from a variety of factors, including strong claims activity related to Q4 dates of service, tightened COVID testing and treatment-related revenues and very little impact related to The No Surprises Act. As shown on Page 5 of the supplemental deck, excluding the net impact of COVID-19 on our results, revenues in Q2 â\u0080\u009822 were up $9 million or 3.1% over Q1 2021 and down  or 2.4% sequentially. As shown on Page 6 of the supplemental deck, Q2 â\u0080\u009822 growth over prior year quarter was attributable to 13.2% growth in analytics-based services, while Payment and Revenue Integrity Services was flat and network-based services declined 12%. As detailed on Page 7 of the supplemental deck, we estimate the COVID-related revenue impact in Q2 â\u0080\u009822 was approximately $4 million to $6 million, up from an estimated $3 million to $5 million in Q1 2022 and down from $9 million to $11 million in the prior year quarter. Turning to expenses, second quarter â\u0080\u009822 adjusted EBITDA expenses were $80.5 million, up from $78.9 million in the prior year quarter and up from $72.6 million in Q1 â\u0080\u009822 and in line with our guidance. Adjusted EBITDA was $209.6 million in Q2 â\u0080\u009822, up 2.1% from $205.3 million in the prior year quarter and down 7.0% from $225.4 million in Q1 â\u0080\u009822. As shown on Page 5 of the supplemental deck, normalizing for the impact of the COVID-19 pandemic, adjusted EBITDA for Q2 â\u0080\u009822 was essentially flat versus the prior year quarter and down 6.3% sequentially. With second quarter revenues and adjusted EBITDA both in line with our expectations, adjusted EBITDA margin came in at 72.3% in Q2 â\u0080\u009822, down from 74.3% in Q2 â\u0080\u009821 and down from 75.6% sequentially, reflecting the revenue and adjusted EBITDA expense trends discussed previously."
}