{
    "symbol": "EARN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 23:53:07",
    "content": " We estimate that EARN's book value per share at the end of July was approximately $9.49, which translates into an economic term of about 5.5% for the month, but even with the better market tone and even with the recent drop in interest rates since their mid-June highs, it's clear that we've entered a new market paradigm with extension risk having taken center stage over prepayment risk. Then it's rallied back to 275 and you slowed off a little bit from there, but those fully extended securities now don't have a lot of difference in duration as a function of, sort of interest rates moving around where they are right now because if the regular mortgage rate is 5%, and maybe it got up to a high of   for someone sitting there with the Fannie 2, maybe they have a  , they're not getting in the money or out of the money. I think it's really hard, Crispin to give guidance on that because it really depends if â\u0080\u0093 as you said, we're going to sort of wait for our spots in terms of selling the discount pools that we've held, pretty much this year, so â\u0080\u0093 and it's really early in the quarter. So, if we're hedging let's say a Fannie 3 and we're hedging that interest rate by paying fixed on 5-years SOFR and we're getting SOFR on the floating rig, what we've seen from mortgage repo is it's been SOFR plus about 5 basis points. So, even if the short-term rates bounce around a lot, it's really not going to affect our durations that much, because durations of mortgages are more dictated by where the market thinks the future rates are going and that's going to be more based upon longer-term rates. So, if the market, kind of settles down and it thinks all right, the Fed â\u0080\u0093 you're starting to see inflation respond to the Fed's blunt instrument of raising short rates and shrinking the balance sheet. So, I think that's one kind of thing you will see from money managers that if they think that we're more of in a rate range, you think they're going to be less surprised with fewer surprises from this Fed and they're going to have vol come down, they tend to favor Agency MBS over corporates."
}