{
    "symbol": "CEQP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 14:10:10",
    "content": " As a result, we have solid visibility to the fourth quarter and 2023 activity levels but are revising our full year 2022 adjusted EBITDA guidance range to $780 million to $800 million to fully reflect some of these timing shifts. For the third quarter, Crestwood generated adjusted EBITDA of $209 million and distributable cash flow of $131 million, year-over-year increases of 50% and 53%, respectively, driven by our M&A activity over the past 18 months. In the Gathering and Processing North segment, third quarter 2022 EBITDA totaled $157 million, an increase of 48% over the third quarter of 2021, driven by higher natural gas gathering, natural gas processing and water gathering volumes from the expanded operations of the Oasis Midstream assets. In the Gathering and Processing South segment, third quarter 2022 segment EBITDA totaled $53 million, more than double year-over-year. O&M and G&A expenses totaled $79 million for the quarter and increased over the third quarter of 2021, primarily due to the Permian and Williston Basin acquisition this year. During the third quarter, we invested approximately $59 million in growth capital, primarily related to the continued build-out of the multiproduct gathering system for Chord energy and other recently contracted third-party producers in the Williston Basin, expansions of our gas gathering and compression system in the Delaware Basin as well as the build-out of our Panther crude oil and water gathering system for Percussion Petroleum in the Delaware Basin. Based on the deferral of well connects in the Williston Basin, as previously mentioned from earlier this year to later in 2022 and into 2023, and the exceptional job executing projects below cost targets in an inflationary environment, we have been able to optimize our capital spend throughout the year and are, therefore, reducing our growth capital guidance range for this year to $200 million to $220 million, a $20 million reduction at the midpoint of the range, and we are reducing our maintenance capital guidance range to $25 million to $30 million, representing a $5 million reduction at the midpoint of the range."
}