{
    "symbol": "RSSS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-11 21:12:02",
    "content": " Looking at the total average number of monthly transactions in a calendar year or in 2020, and in year to date 2021, corporate and academic platform customers grew total transaction volume or count by 14% year-over-year and that same period, those customers grew transaction revenue 6% year-over-year. After Bill provides a bit more detail, I'll be back to discuss what investments we're making this year to accelerate future revenue growth, which are reflected in the first quarter's results, particularly in our EBITDA. Platform revenue increased 32% to $1.5 million primarily driven by a net increase of platform deployments over the past year, including 37 in net new deployments in the first quarter. Annual recurring revenue at the end of the quarter, stood at $6.3 million up 7% sequentially and 33% year-over-year, reflecting our continued sales and upselling efforts and low churn of existing platform customers. Transaction revenue for the quarter was $6.2 million compared to $6.6 million from the prior year quarter, while we are down from Q1 of last year for many of the reasons Roy discussed, I will also note that transaction revenue can also fluctuate and we experienced similar levels of transaction revenue back in the second quarter of fiscal year, 2021 before seeing a rebound in transactions for the remainder of that fiscal year. The first cohort where customers that went live with the platform on or about January 1, 2020, and had been non platform customers for at least a year before the switch, before implementing the platform, those customers were paying for about 90% of the articles or transactions they acquired after implementing the platform that percentage dropped on average to 73% in the first year and 65% in the second year, this was due to the platform, helping them leverage free content options, like open access, tokens, subscriptions and reuse rights. Many of these investments have been underway and although they did negatively impact our EBITDA in Q1, these investments will start to pay off in additional sales growth in late fiscal year, 2022 and fully in fiscal year 2023 and beyond some of those investments include first, we are investing in additional salespeople, a new sales tools to help our prospecting teams generate more leads to the entire sales team. This product is related to our core article galaxy product, and we're excited about what we think it can generate in terms of revenues starting in fiscal year 2023, we're also investing about 160,000 and our business development team to identify and acquire companies that we think are creative to our business and product strategy. So I think at some point in the next quarter or two, we'll hit trough of them churning out, and we'll only be dealing with platform customers, which means we'll only be dealing with a product mix issue in terms of how many articles they're obtaining for free versus how many articles they're paying for. In terms of your first question if you're, if you're referring to kind of, I think donate a comment, I made a comment, we would expect the platform growth rate to be relatively consistent with what it has been on a trailing 12 month basis, which has been, in that high twenties, low thirties on a quarterly basis. I don't think we're going to get there this year, but I think we have a pretty good plan to bring on additional head count drive more leads into the install base, and we're very comfortable with the number of platforms we would need to sell per year versus what our tan is to get to a 40% year over year growth rate in dollars. But the question I can answer today is if I bring in 150 new platform customers, how much transaction revenue really going to generate, I can do an average, but when you look at the, the 150, they're all over the board, we have some that come in that are only generating a few thousand dollars a quarter."
}