{
    "symbol": "RSSS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-13 13:53:12",
    "content": " And thank you for participating in today’s conference call to discuss Research Solutions Financial and Operating Results for its Fiscal Third Quarter ended March 31, 2022. After the market closed this afternoon, the company issued a press release announcing its results for the second quarter of fiscal 2022. Before turning the call over to Roy and Bill or before Roy and Bill begin their prepared remarks, I would like to remind you that some of the statements made today will be forward-looking and are made under the Private Securities Litigation Reform Act of 1995. Also on today’s call, management will reference certain non-GAAP financial measures, which we believe provide useful information for investors. Finally, I would like to remind everyone that this call will be recorded and made available for replay via a link on the company’s website. It was our second quarter of net ARR growth over 500,000 and a record in terms of quarterly recognized revenue. We had a strong up-sell quarter, which is a good sign that the product upgrades we’ve been investing in are valuable to our customers. The business also posted over 30% growth year-over-year and platform customer growth, ARR and platform revenue. Our net new customer deployments on a trailing 12 month basis was 168 and majority of these deployments are what we call new, new which means they are new customers to the company, not upgrades. Total revenue for the third quarter of fiscal 2022 was 8.8 million, a 5% increase compared to the third quarter of fiscal 2021 and as Roy previously noted a company record for quarterly revenue performance. Platform revenue increased 33% to 1.8 million, primarily driven by a net increase of platform deployments from last year, including 34 net new deployments in the third quarter, and strong up-selling of current platform customers. As a result of this and new customer bookings annual recurring revenue or ARR increased by 500,000 in the quarter and stood at 7.3 million as of March 31, 2022. Transaction revenue for the quarter was 7 million, essentially unchanged from the prior year quarter. I will note that Q3 is also seasonally a strong period for transactions as a result, while the year-over-year revenue was flat we were up sequentially about $700,000 or 11% over our performance in Q2 of this year. However, we continue to think that as we add more customers to the platform that over time transaction revenue will begin to grow again on a year-over-year basis. When this will happen, it’s hard to definitively predict. Transaction customer count for the quarter was 1,193 versus 1,179 in the second quarter of fiscal ‘22 and 1,108 in the year ago quarter. Gross margin for the first quarter was 37%, a 460 basis point improvement over the third quarter of fiscal 2021 and another corporate record performance. While a great deal of this is related to the revenue mix shift towards a higher margin platform business, it is important to know that we are also taking actions within both the platform and transaction product lines to expand the margins within each of those segments. The platform business record a gross margin of 87.7%, a 510 basis point increase from the prior quarter and above our target gross margin range of 80% to 85% due primarily to favorable leverage of labor costs related to servicing new platform customers. In addition, we reduced some platform app related costs in the quarter and those savings while less material will be permanent going forward. For this reason, I think it’s always important to focus a little more heavily on our overall corporate gross margin. Second, while we do not expect that we will continue to experience record gross margins each consecutive quarter, we do expect that the overall trend of corporate gross margin will continue to be up and to the right as we continue to increase platform revenue thus evidencing our ability to properly scale the business in the long term. Our product development costs include ongoing investment in a new product, which we have not announced yet, but are looking to release early next fiscal year. Net loss for the quarter was 341,000, or $0.01 per share compared to net income of 50,000 or breakeven on a diluted share basis in the prior year quarter. Given that adjusted EBITDA for the quarter was positive 94,000 compared to 238,000 in the year ago quarter the positive adjusted EBITDA result is the first of this fiscal year in which we are making a number of investments and as a consequence of the expanding gross margins, as well as some of the seasonal strength we experienced in Q3 which I noted earlier in the call. In conclusion, as we move forward and into our budgeting cycle for next fiscal year, we will continue to invest in a business with a bias towards growth in ARR, while at the same time tightly monitoring the success of those investments to optimize the mix between ARR growth and adjusted EBITDA. During the quarter, we released our new reference manager product, which helps researchers manage their research documents inside the platform. We continue to have a high level of activity in M&A, but I’m disappointed to have no immediate news to report. On a final note, I will also say that while the overall markets have suffered, we do not see anything in the present economic environment materially impacting the company’s fundamentals and outlook which remains strong. In addition to the immediate results, excuse me, in addition to the impressive results this quarter and this year, we monitor those results on a quarterly basis against the SaaS guardrails as defined by Bessemer Venture Partners. Additionally, we also monitor the software equity group’s SaaS public market update each quarter. In the Q1 report vertically focused SaaS companies are valued at 5x their median EV to TTM revenue, down from 9.4x during in the same quarter last year. We appreciate you taking the time to discuss our third quarter results, and we look forward to addressing any questions you may have. With that, I’d like to turn the call back over to the operator for Q&A. Your line is open. The one I mentioned that we recently released, and we’ll have a second release of it in July, is what we call references which is a reference manager application. We have a product that does a little bit of that, but we’re replacing that with the new references product. And as I mentioned, there’s two releases, one that’s already out, and then a more robust release that will come out in July. And we’re building out an analytics engine, which will allow those customers to run much more robust reporting, in terms of how much money the platform is saving for them, where they might need subscriptions, where they don’t have them, or the opposite, along with other analytical tools that will help them monitor they’re doing, let’s say battery technology research for a new electric car. And ultimately, we want to get the tie that in the world fees of grants, patents, apply for patents granted, or even press releases that mention similar technology to what they’re working on. So it’d be able to not only have an incredible analytics package on top of what they’re doing internally, but they’ll have a way to tie that to external news sources to monitor what’s happening in the world related to the research that they’re doing internally. That’s great, thank you. Article Galaxy Scholar is doing I would say, okay, but I would also tell you that the two critical quarters for the academic market are the quarter we’re in ending June 30, and the first quarter of our next fiscal year, which is the July through September quarter. We expect the majority of our annual revenue, not a majority, we expect a significant percentage of our annual revenue to come from those two quarters. Also could you give, this will be my last question, then I’ll get back and queue so other people can ask that. Not a majority of the progress but we feel like we’re on track with our plan, which was to hire most of those folks during this quarter. So we are making progress, but we’re not at the full headcount we want to be at. Your line is open. So I have kind of, I don’t know, if that’s a positive question, that’s probably not meaning for it to be negative. But I’m just kind of looking at the results and the operating expenses, kind of went pretty high in the last like six quarters. And that’s a pretty big expense given you are planning on acquiring somebody, I assume you will also acquire their SG&A and I’m not really sure, and your goal was for 20 million ARR which is probably 17 million in gross profit. I guess I’m just not really seeing the payback that you’re seeing given the marginal growth in gross profit, versus what you’ve already spent. So in the end, in G&A tech and product development, we’ve got some one time development costs going on related to a new product that was about 120,000 this quarter. And again, I think, while those are permanent, I don’t see us ramping that up, dramatically going forward. G&A similarly, there’s been a number of sorts of expenses, which we can tamper down if we want to relate it to both organic and inorganic initiatives. When you look at gross margin if you assume that transactions stay flat rate if you’re looking at 10 million of platform revenue, that’s going to push the margin closer to 40%. You push it, again up to sort of our longer term goal of 20 million, that’s going to push it to 50%. And again, I do think if you sort of model that out, you’ll start to see some of the profitability come into play, as well as we tamper down some of these investments that were somewhat unique to this year. The other thing I would comment on is as we have mentioned previously, the board and Bill and I are very focused on this rule of 40 concept, that organic sales rate of the platform which is currently 32 plus the EBITDA margin, which is currently negative need to add up to 40. So these investments we’re making are either going to accelerate that 32 number to a number of big enough to offset negative EBITDA to total 40 or we will start dialing back this investment, generating enough EBITDA so that we meet the rule of 40. So, we’re not going to be able to get all the way to rule 40 in FY ‘23, but we expect to see a material step up in performance in terms of rule of 40. It still kind of doesn’t like I’m just talking about just the platform’s business like I said, you gave guidance, a few looks at a few quarters ago for 20 million in ARR. So is that like, I know are all we’re talking about is like an extra 3 million in gross profit in the next three years. And on 930, your expenses were 2.4, which is approximately 9.2 million and right now they’re tracking, 14 and 5. So I don’t know, give or take 5 and 3 which is, maybe I’m rounding up a little bit. So, again, within the cost there of that 12.750 sort of run rate there’s over there’s 1.1 million of stock comp. So I do think, again we could sort of tally through some of these costs that we’re incurring on the product development  side. But there’s a material chunk of those that is either one time in nature, or can be tamp pulled back or tapered back, should we not see the resulting ARR growth that we want to see. Okay, maybe I’ll appreciate the color. Okay, well, look, I don’t mean to be like picking on you. Your line is open. In terms of the first question, I do think that obviously, the base gets bigger, it’s tougher to maintain 30 plus percent growth. We do have some new hires that will roll in on top of that, and we’re hiring additional sales resources now so that we can roll in next year with some additional heads. But most of the performance improvement we’ve seen this year has been some improvement of existing productivity plus, I’ve mentioned in previous call we hired a resource in Japan last year. We hired a German speaking resource last year, and they’ve started to come up to speed and contribute this year. Japan’s been slow going, Germany has come up to speed much quicker. In terms of the hiring environment for sales I think it’s, I have not seen anything that leads us to be concerned there. I’m more worried about filling the top of the pipeline with leads, because we have a very consistent close rate. It seems like your end clients are not necessarily famous for being shy about passing on price increases but that’s universities, pharma, tech whatever. So I can’t really comment that we’re going to see a 10% or 15% increase, but we are going to, frankly, take advantage of the current environment and materially raise prices on the base platform. And then these new releases that we’re doing, they’ll be 110%, 115% or 120%, of the base platform fee. Some of that’s going to come from these new features which if you want to turn them on is going to change your base fee from what it is today to what it is July plus the price increase times 110 or 120 or in some cases, even more than that. So in the current environment and current entity, you talk about sort of the challenges that you’re seeing now that you’re trying to bring that as another part of your growth engine. In terms of where we’ll be a year from now, I think we’ve made some adjustments to looking at smaller businesses where we think that technology is worth more bolted into our platform than that business might be worth as a standalone business to us. Your line is open. It’s my impression that when you join the company, Roy, it was moderately under managed and that there were some deficits in the technology and culture and other areas. I mean, that’s difficult to answer on a public call. So we actually, if you’d looked at the deployments, this quarter versus last quarter, we had less deployment, but they were much larger sales. And that pushed the ASP up this quarter over last where it had been running kind of in the 10, 6 range, it’s around 70."
}