{
    "symbol": "DOMO",
    "quarter": 1,
    "year": 2022,
    "date": "2021-05-27 20:43:09",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Domo Q1 Fiscal Year 2022 Earnings Call. I would now like to hand the conference over to your speaker today, Mr. Peter Lowry, Vice President of Investor Relations. On the call today, we have Josh James, our Founder and CEO; Bruce Felt, our CFO; and Julie Kehoe, our Chief Communications Officer. Our press release was issued after the market close and is posted on the Investor Relations section of our website, where this call is also being webcast. Statements made on this call include forward-looking statements related to our business under federal securities laws, including statements about financial projections, the plans and expectations for our go-to-market strategy, our expectations for our sales and new business initiatives, the impact of COVID-19 on our business and our financial condition. For a discussion of these risks and uncertainties, please refer to the documents we file with the SEC, in particular, today's press release, our most recently filed annual report on Form 10-K and our most recently filed quarterly report on Form 10-Q. In addition, during today's call, we will discuss non-GAAP financial measures, which we believe are useful as supplemental measures of Domo's performance. Other than revenue, unless otherwise stated, we will be discussing our results of operations on a non-GAAP basis. And what I've done today, it's going to be extremely difficult for the Bruce to not if use bullishness. You'll see us raise guidance today, and we see potential upside in our future. In Q1, we got off to a great start to our fiscal year 2022. We had a record Q1 across many important metrics, including new business and retention. We posted 25% billings growth, 23% subscription revenue growth, and 24% total revenue growth, with a 90% plus retention rate across both the enterprise and corporate segments of our business and in every geography. Now with a full recognition, it has been a humbling process and a ton of hard work from our people to create this great company and even get to this spot. I read all the reports, and despite the performance that we've been putting up, see how some people have characterized our growth profile. Now for those of you who know me, you know that I'm not generally known as an infinitely patient, unendingly understanding, not-demanding kind of guy. And obviously, I'm saying that a bit in just, but with what we have consistently been producing, I think it's important to do some math that calls out how strong and consistent our performance has actually been. We had another strong Q1, driven by a number of record key metrics, as Josh has highlighted. I'll review the details behind our performance, provide an update on some of our recent financial analyst session commentary, and then discuss second quarter and fiscal 2022 full year guidance. We delivered Q1 billings to $58.2 million, a strong year-over-year increase of 25%, driven once again by new customer count growth, upsells and expansions, record Q1 retention rates, strength across all geographies and improving sales force productivity. What is promising on net retention is the amount of growth we just experienced in new ACV from existing customers, providing the visibility to expect higher net retention rates as the revenue is recognized. We now have 61% of our customers on a dollar-weighted basis under multiyear contracts at the end of Q1, up from 54% a year ago. Our remaining performance obligations, or RPO, grew 24% compared to the same quarter last year. Q1 total revenue was $60.1 million, a year-over-year increase of 24%. Our subscription gross margin was a record 83%, up more than 4 percentage points from 79% in Q1 of last year and up over 1 percentage point from last quarter. Josh, just to start with you. Let's talk about this expansion deal, which hopefully is a harbinger of things to come. Or if you can't talk about dollars, users would be great. Because I know it was an existing customer, maybe, strike that. And thank you for calling us out in your in your reports as your number one choice for software in mid-market, we certainly appreciate that. And on this deal, it's a really exciting deal. It's one of our -- certainly, one of our 5 largest customers now. It's a transformational deal because of how it's happening, too. It's that -- really, it's that whole stack that we built, being able to provide all that BI leverage in the record time that we did, is really what gave them the confidence. And we think there's a -- even though this contract is a good contract as it is, there's a ton of upside for us with this customer. And so to know that the vast majority of all of our enterprise customers have this kind of potential, and then finally seeing that potential come through is really exciting. But the thing that I'm the most excited about is now even though we can't talk about, who they are yet, over time, I suspect that we will. And that's just going to give a lot of people confidence to move all their chips in on Domo, because they can see what we can do for them. You get to a point, and everybody asked about, look, here's my list of 12 concerns, and you just keep repeating blue-chip customers that are willing to talk to get rid of each one of those concerns that they have, and it gives them that confidence. Well, congrats on that and looking forward to see how that evolves for the broader opportunity at Domo, I guess my next question to -- and this is probably for Bruce, but Josh, feel free to chime in as well, which is really around the question around growth rates. We have billings growth of 25%, RPO growth of 21%, current RPO growth of 22%. And then if you look at your bookings growth, sort of revenue plus change in RPO, that was like, I think, by my calculations, a big, big number at 38%. Well, first, thanks for the question. I don't quite get your last number, but we can just talk about that separately. But yes, I mean, as Josh pointed out, you see directionally where we're headed. We posted, on average, 25% growth. We've had things come together during the quarter that have allowed us to achieve that, even if we didn't see all of that at the beginning of the quarter. We have visibility that allows us to give 20% guidance, but as I mentioned, we have a lot in the hopper that makes us feel very good about the 20%. And as things bounce the way we hope they do, we'll do better than that. I mean, we're trying to set up just strings of these in not just any one quarter. So they're all representative of what's possible, and I think we've been able to like move the numbers up into a much better Zip code than we ever had before. And as you can tell by our posture here, we still think that we have more room to bring these numbers up, as our execution -- as the machine kind of really gets cranked up here. My congratulations, great start to the year. I'll start with you, Josh. One of the things we keep hearing about is how differentiated your low-code, no-code capabilities are around building analytic apps and doing it quickly. Most of our customers, including the 1 we talked about today, the big deal that we -- the big upsell that we had, most of them have everything under the sun already installed somewhere in the organization. When we have this low-code no-code ability to create applications that are very specific business intelligence applications or applications that no one would consider to be business intelligence, but really, there's a function inside the organization, they're trying to do in a very specific way that they would have to go out to an outside vendor at great expense and impossibility to be able to continue to manage. Instead, they come to us. We have the ability to create this great BI leverage, and that includes building these low-code no-code apps. And so they see us relative to the other technologies they're using, and they see how much more effectively we can evolve with them by building these low-code no-code apps. We put together a couple of apps as part of the POC, and there's nothing else like it in the marketplace, period. But so nice marquee win, large sounds like multimillion-dollar deal. Actually, I'm going to have Ian Tickle, our Chief Revenue Officer, he's here with us. So I'll have him answer that question, great question. So doing a lot of great work with John Meller in marketing to make sure that we have a good mix of new logo across multiple revenue bands, also building out our upsell engine as well, which is going very well for us. And likewise, continuing from last quarter and Josh's comments with regards to strong partner network and contribution as well. So overall, we've got a very nice mix across recurring and nonrecurring as well. Great, and a really solid job there across the board. Because they've got to put consultants to work, strategy to work. I ask this question, I think, almost every quarter, but I'd love to get an update on how that's playing out. I think it really interested to say, hey, this Domo thing, I know we have a bunch of people extension doing this, but maybe we should be focusing on this domain because this is driving growth and will drive more growth for us. I think there's also this virtuous cycle when you get these big customers, that the big customers to create the priority with the large ecosystem partners, whether those are tech or whether those are systems integrators and where those conversations go pretty smooth at that point. I think, Ian, it's probably worth sharing without any names, but worth sharing the conversation. With regard to the -- so I mean, the SI side to it is really moving in a nice direction. So we've had, as I mentioned, partner ecosystems building out as we look at the new logos and the cross-sell logos, we deal with these organizations who have preferred partners and with the preferred partners sometimes the rules move together where we've got great traction. And 1 of the exciting things about the go-to-market from system integrators and partners and just the entire ecosystem there is that as we build out the messaging and the value proposition to the users, people recognize that this isn't just about technical capability. And we're getting lots of introductions into lots of new places, which also is very, very interesting for us as well. It's probably a little technical, I'd love to walk through it. So one of the value adds of derma was, if you think about it as a platform, I can bring data in, spend a lot of time building ingestion, connectors, ETL, whatever. Robot, et cetera, and then I've got kind of the storyboard, the ability to build these applications until a story. As technologies evolve, you couldn't do that with the old BI guys, and you can't do with just visualization. I mean, these customers are all so complex. They have everything under the sun, and sure they're trying to take components of data stores that they have and trying to allow other people they work with, do not have to move the data every single time they want to do something or every single time they want to interact with the new application to accomplish something. And so there'll certainly be more connectors, more APIS, more standard frameworks. And if someone like Snowflake plate comes along, it starts getting a lot of traction, great, we work with Snowflake. If they're doing something more with AWS, great, we have a great partnership with them as well. And I think we've been evolving spaces before, this space is going to continue to evolve, but the ability to create things like those low-code, no-code apps to take the data, put it into the fingertips of thousands of people across an organization, we are unparalleled and unmatched in the way that we do those things. And so I think that's still, at the end of the day, the value comes when there's something that's in the fingertips of the managers and the people that are making decisions and running the businesses. It's been a multiyear effort and most importantly, it's been the responsibility of the -- a big chunk of the folks at our company that are responsible for our customers and their happiness. So first and foremost, it's been them. They just said the client services, hey, there's a specific acknowledgment we all need to provide here that you guys are kicking ass, end of message. Just great people at our company, great people in Utah. They love getting upsells, and it's really fun to see those -- see that have a meaningful impact on our numbers. And then I'll let Ian touch a little bit more on some of the specifics, but first and foremost, this has been an awesome effort from our people. And I think it's a testament to either relationships to our client success team and everybody who helps support them with our support team, our education team, the training team, work together and the relationships that they build. We've also seen that over the last 12 to 18 months, people have doubled down on their use on Domo, and they recognize the fact that we can return information far quicker than maybe some of the other providers that they might have at this point in time. Tie that into the work we've been doing to try to help educate and develop and show the business value and deliver results, really, really impressive performance across the globe of our client success support and education team there. Josh, going back to the marquee customer you've been speaking about. You got to have the CIO, look at it like, yes, this thing makes sense. Yes, this looks like we work great. And so you got to get buy-in from a lot of different departments, because eventually, these different departments have to pay for it. CIO doesn't want to -- no CIO, and I know, wants to have every part of the budget come out of their budget. That means you need to have business leaders stand up and say, yes, I'm going to get value out of this. Where else have you done this at this scale, at this size. And we have plenty of customers where we've done this at this scale, at this size. But most of them kind of was one upsell here, another upsell there, another upsell here. It ended up in the right spot, but we want customers to be able to move more quickly, adopt more quickly. And that's what I think we're seeing here, because of all the work that we've done over the last several years. Because of the happy customers that we have, we now can get new -- relatively new customers that can come in and say, \"Oh, I want to replicate what those people who have done over there\". And so it was -- these big complex deals, they're big and complex, and it's finding all the right people internally to support the CIO's decision, and that's what we did, and it was not only on their side, but on our side as well."
}