{
    "symbol": "FPI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 13:29:02",
    "content": " The strong farmer profitability has and profitability of the whole sector is translated into strong pricing for farmland in general as an asset class which, of course, we have greatly benefited from, but also helped the company have a very strong renewal season for our rents in either specifically the rents that we rolled, especially in the fixed cash rents in row crops we have seen increases of 16% across the board . And we have seen very, very strong asset appreciation, certainly amongst our row crop properties and despite the drought, probably to some degree, even among the specialty crops, inflation drives Farmland values up without question. But, as I said, the volatility caused in the specialty crop side of the business and there's sort of no structure you can get set up to take that away or at least not very, very many structures that could take it away, is really hurting the underlying story that is so, so powerful and so successful on the row crop side. So on the row crop side, the high inflation, strong yields on the crops and high crop prices due to worldwide shortages of these key commodities is driving us to have an increasing positive returns and results, growing rents essentially and rapidly appreciating asset values on the row crop side. Because you've been with us, Dave, for many years now as an analyst on the company, and what happens on the row crop side, in the bad times, and we lived through them in your '15 through '19, basically, 2015 to 2019, you're talking about maybe you can't get a rent increase, but you're not talking about big rent decreases. And so I just don't think you're going to see asset values come off with high interest rates, and we certainly haven't seen it happen yet on the row crop side. On the row crop side, in particular, given what continues to happen with production around the world, and what's going on in Ukraine/Russia U.S. farmland and U.S. and demand for U.S. farm crops will remain elevated in our opinion for the next 12 months at least, and that will be positive for the rent rolls we do in the 2023 year, for example."
}