{
    "symbol": "EXAI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 13:09:03",
    "content": " We have also made exciting progress with GTAEXS-617 or 617, our CDK7 inhibitor new data we presented at the ENA Annual Symposium in October demonstrating the potential of our precision oncology platform to assess targeted therapies and defined patient populations that are more likely to respond to our therapy. We believe for our platform which combines deep learning, fusional models and multimodal-omic data from our experimental platform of relevant primary human samples not only helps us better understand the potency and activity of 617, but will also lead to improved patient selection and therefore better patient outcomes. When we use real patient samples in our precision medicine platform to guide molecular design, we are also defining our future clinical programs, the phenotypic, genotypic and transcriptional signatures that we identify with our development candidates are the same profiles that we will target in our clinical programs. We start with what we call ex vivo clinical trials using our precision medicine platform, we evaluate the drug in a multitude of heterogeneous patient samples with in-depth profiling to understand why some of the samples respond better than others. We'll now take a few minutes to walk through two of our ongoing programs and how we are doing a step-by-step perspective ex vivo analysis of patients trying to entering clinical trials, highlighted important work for our 546 A2A receptor antagonist; and 617 our CDK7 inhibitor. Finally, which is not shown here, but was presented on the EMA, from single-cell transcriptomic data collected after treatment of a samples of CDK7 inhibitor, we have validated existed and defining novel CDK7 specific pharmacodynamic biomarkers that may enable us to track 617s activity, potentially noninvasively during our planned clinical study. Today, we walked you through a few examples of how we are working to transform the industry, not just by bringing our AI-driven drug discovery platform into new modalities such as biologics, but also modernizing the way we select patient populations that may respond to new therapies, ultimately allowing us to design better clinical trials. So, what's important of our view, I think compared to maybe ever sort of biologics sort of discovery organizations that are out there is that for us now, it becomes a new modality that plugs into our end-to-end platform that can benefit from the target discovery engine that we're also using on the Sanofi platform. I think actually a proof points that we've already brought to the table, showing that we already have molecules moving forward, showing the kinds of patient selection strategies that we talked about today and the results we've seen in things like AI-driven sort of clinical trials of EXALT-1 and now coming together into a crescendo of showing potentially the direction of trial risk comes. Yes, it's really just like to highlight the experience that I've had coming from big pharma and joining Exscientia recently, what has struck me has been the interest and ability to connect the dots and to integrate AI expertise and experience in the discovery platform AI expertise and experience in the translational science platform and now the ambition of applying AI in a clinical development platform. But also -- but part of that experimental validation of kind of those kind of targets is that we can -- as well as doing kind of functional genomics, et cetera and working cell lines one of the beauties of the collaboration on behalf of Sanofi is that we can do further validation in primary human tissue settings on our precision medicine platform."
}