{
    "symbol": "EXAI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 13:14:11",
    "content": " That partnership uses a broad range of our capabilities, including our target identification, AI-based design, and Precision Medicine platforms resulting in per project economics of 343 million in potential milestones as well as royalty rates from the high single digits up to 21%. But at the same time, we do continue to invest in technology areas where we believe actually would give us a continuous advantage both for developing our own molecules and our own programs, particularly focusing now in the areas of Precision Oncology and also areas where we see that where the next generation of productivity enhance is going to come from, whether that is from investments in automation, investments in biologics, designed by AI as well. But as Andrew said, I think one of the beauties of kind of Mike Krams joining us we are experiencing  kind of, let's call it, creative kind of clinical trial design reminding that he was the first person ever to kind of lead an effort to use kind of -- statistics approach to running clinical trials. As I said, there'll be more details to come on that trial design, particularly how our trial design sits alongside how we're thinking about developing and validating translational efficacy biomarkers, which is also key and that's what we use in our human tissue patient-based platform for as well. The other thing as well, of course, is there's some important elements around our Precision Medicine platform, which we think actually opens up a really interesting possibility in this whole biologics space, which is we've already validated our Precision Medicine platform using human patient tissue for use in both small molecules and antibodies. And Chris, just one final point I just wanted to add to that, particularly around Ben's point on validation, which is as well as obviously running trials on our drug assets we continue to look to clinically validate our Precision Medicine platform, and those things. Just on CDK7, just a number of peer molecules and whether you've kind of synthesize those and whether -- where you think you could potentially have differentiation based upon whether the structure of those molecules or the way they're kind of targeting, any details around that CDK7 differentiation would be great. I'll lead this, a very interesting kind of I&I target but we -- again, just to kind of to link back to kind of one of the key themes of today's presentation is really around overlooking at the moment is again being very -- okay, what is the validation around that target, how does it fit with our Precision Medicine, is it a target that we feel either ourselves or a partner that may have a different kind of pharma partner or kind of technology that changes a view on a public success. So we're spending a lot of time looking at what -- kind of what are the right patients for that target, kind of what's the landscape, and then figuring out is this one for us to take on internally or one that's actually best within a partnership. As we build out new technologies, whether we build them ourselves or whether it's an acquisition, are we getting synergy, is it truly something that we can see could be plug and play that would also synergize with the rest of the platform, whether it's target identification, drug design, different types of modalities, design engines or downstream into sort of Precision Medicine and into clinical sort of innovation."
}