{
    "symbol": "EXAI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 15:24:01",
    "content": " For CDK7, we applied to a platform to assess our novel AI design development candidate GTAEXS-617 for the application of deep learning-driven image analysis, we detail the molecules effects on primary tumor samples from patients of single-cell resolution, a far more complex dynamic view than what's possible to patient-derived cell lines that are common in the industry. By contrast, here we show our approach to precision medicine based on deep understanding of the treatment effect in an individual patient-by-patient level further, we use the knowledge of how patients will likely respond or read to the preclinical drug discovery and development stage. It's important to note there is some precedence for using this platform in solid tumors as there has been some exploratory work for professor  at ETH Zurich, a small observational study of 14 patients with glioblastoma shows statistically significantly longer PFS and overall survival, or OS with patients whose tumor tissues were temozolomide sensitive as compared to insensitive ones. Your line is open. It's about how we actually bring in the patient tissue models into every aspect of what we do, from target identification work, using these models as part of our drug design process, particularly selecting our late stage drug candidates, and then moving that into preclinical studies for biomarker selection of patient stratification, doing sort of IND-enabling stage so that we ready to start our Phase I with actually a patient enrichment strategy, right from the beginning. And the other thing I just want to mention now before I open this up to date is the use of this precision medicine platform and bringing the patient into target selection and then into patients’ selection is actually a key part of work we do in Sanofi, it's actually one of the key reasons, I think why that, it's such an ambitious collaboration. What actually kind of means is that you need to generate kind of politically relevant data, so using our patient tissue platform kind of years ahead of actually before even think about going into a clinical study. Your line is open. Your line is open. And really we follow a very structured approach here of how we go about this coming really from assay development as a first kind of milestone, making sure that we can measure those dependent drug responses, then really gathering biological data, understanding whether mechanistically what we're seeing in these primary tissues makes sense all the way to going into clinical testing and really building on our kind of philosophies as a learning company. Your line is open. Your line is open. So these are certainly all things that we are exploring the way how the Vienna platform can really, or how we are using it at the moment is as we have shown that the AACR poster is, for example, for biomarker selection, for biomarker discovery patient selection, we are trying to understand in a close to patient setting, how patient tissues respond to drugs in a close to patient setting and then analyze all the genomics of these patient settings."
}