{
    "symbol": "DZSI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 00:33:03",
    "content": " Second quarter revenue of $91 million represented an increase of 18% sequentially and 10% year-over-year and was unfavorably impacted by approximately $5 million due to unforeseen foreign exchange rate fluctuations during the quarter, spanning the Euro, Korean Won, and Japanese Yen. I mean, it's hard for us to be disappointed when the team certainly executed to the top end of the revenue guidance that we provided as you pointed out, $96 million would have been our second best revenue quarter ever, so it's frustrating with the foreign exchange that hit us. We did see -- SoftBank drove a lot of our revenue over the last, let's call it five, six, seven years, and in the first half of this year, they're going through a reevaluation of their next-generation PON-based mobile transport platform that we're working on with them and so the pause that I think you're seeing in some of the mobile transport revenue has to do with where SoftBank is in sort of their Phase 4 of their 5G Mobile Transport Architecture with DZS, something that we anticipate we will contract on in the second half of this year and begin to ship the next phase of that which is a multi-year phase starting in â\u0080\u009823. Well, ironically, we were just talking about this before the call and I think it speaks volumes of the technology and the relationship and the dependency on our technology, I mean in the two years I've been here, we haven't had a D Book, so when we look at the historical backlog over the last two years and including the $293 million, which would have been $298 million if not for some of the foreign exchange impacts, we haven't seen any D books, and so, look, I mean, customers can do whatever they want, I mean, independent of contracts. So, we look at some low-margin projects that we have on the books that will flush out in Q3 and a little bit left in Q4, and then most everything is frankly based on new pricing and the current cost structure that we have, I mean with the only real variable being the foreign exchange fluctuations, which let's hope that that stabilizes and we're seeing less and less, I mean there was, the other thing that's important to appreciate is, the way expedite fees work, I mean, at least with DZS and I speak to a lot of my peers. So, if you back out the foreign exchange fluctuations, we didn't change our guidance for the year, all we did was incorporate what we believe to be the impacts of foreign exchange in the second half, obviously, if that changes and it becomes favorable then our ability to deliver on the higher end of the range is still there, I mean, we've got a range of $110 million in Q3, and we continue to struggle because the majority of our backlog is still with customer request ship dates of as soon as possible. We're not -- we're not a manufacturing company, we are a technology company and as we ship more and more of our emphasis towards software, obviously, software needs to reside on infrastructure, and so we're going to be on the -- in the Access Infrastructure business for a very, very long time, but as we -- as we're able to participate more in the intelligence side of the way these networks are being built, managed, and orchestrated, there's a great opportunity there, but we don't want to be in the manufacturing business long term to your point, there is large multi-billion dollar companies that should be doing that, and that means that they'll be buying, inventorying, and managing the cash differently and that to me frees up a lot of working capital for us in 2023 and it certainly we believe will help our margins as well. So, we're still very optimistic and are very aggressive on what we're doing on the mobile side, it's just for us we need Open RAN to continue to take hold and we are seeing Open RAN gain a lot of momentum around the world, it is new, and for our analyst partners and for shareholders, who are looking at DZS, I think everyone has to just appreciate the timeline around Open RAN and as that mobile network becomes much more open, it allows for us to participate differently than historically where you've got closed mobile networks, but we are seeing a lot of activity."
}