{
    "symbol": "SHC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-03 17:09:04",
    "content": " For the full year 2023, we expect total revenues in the range of $1.055 billion to $1.090 billion, which represents growth of approximately 5% to 9%. And adjusted EPS in the range of $0.78 to $0.86, representing a decline of 10% to 19%, which is driven by increased interest expense and expected increase in our adjusted net income tax rate. On a consolidated total company basis, fourth quarter revenues grew by 4.3% as compared to the same period last year to $252 million. In the fourth quarter, Sterigenics delivered another strong quarter with approximately 8% revenue growth to $162 million and 7% segment income growth to $89 million as compared to the fourth quarter of last year. On a constant currency basis, Sterigenics grew revenues over 10% compared to the fourth quarter of last year. Revenue growth drivers for the fourth quarter included favorable pricing of 5.6% and favorable volume and mix of almost 5%, partially offset by unfavorable changes in foreign currency exchange rates of 2.6%. Nordion's fourth quarter revenue declined by approximately 7% to $34 million compared to the fourth quarter of 2021, which is driven by the timing of cobalt-60 supply schedules. On a constant currency basis, Nordion's fourth quarter revenue declined by 3% versus the same period last year. Nordion's margins were 59.5%, a 130-basis-point improvement from fourth quarter 2021 margin levels, which is driven by pricing contributions, partially offset by mix. For Nelson Labs, the fourth quarter of 2022 revenue improved 2.7% to $56 million compared to the fourth quarter of 2021. On a constant currency basis, Nelson Labs grew revenues 5.3% compared to the fourth quarter of last year. Revenue growth for the fourth quarter of 2022 was impacted by a 5.5% benefit from pricing, partially offset by headwinds associated with changes in foreign currency exchange rates of 2.6%. For full year 2023, we expect total revenues will be in the range of $1.055 billion to $1.090 billion representing an annual growth rate of 5% to 9%. Fully diluted share count in the range of 283 million to 285 million shares on a weighted average basis, capital expenditures to be in the range of $185 million to $215 million, representing continued elevated investments for growth as we continue to fund capacity expansions at both Sterigenics and Nelson Labs as well as invest in EO emission enhancements in North America and cobalt development projects at Nordion."
}