{
    "symbol": "SHC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 14:52:09",
    "content": " We reported total revenue growth of 10% and adjusted EBITDA growth of 7.3%, compared to third quarter of 2021. On a consolidated total company basis, revenue grew by 10% as compared to the third quarter of last year to $249 million. Adjusted EBITDA margins were 50.3%, representing a 127-basis-point decline from the third quarter 2021 levels. In the third quarter, Sterigenics operationally delivered another strong quarter with 9% revenue growth to $158 million and an 8% segment income growth to $86 million, as compared to the third quarter of last year. On a constant currency basis, Sterigenics grew revenues 12%, and segment income 11%, compared to the third quarter of last year. Compared to the third quarter of 2021, segment income margins contracted by 30 basis points to 54.3%, driven by the timing of contractual pricing actions versus realized inflation. Nordion had strong third quarter with revenue growing by 22% to approximately $35 million, compared to the third quarter of 2021. On a constant currency basis, Nordion grew revenues 25% and segment income 27%, compared to the third quarter of last year. Nordion's revenue growth was driven by volume and mix growth of nearly 18%, pricing of 7%, which was offset by 2.8% foreign currency exchange headwinds for the quarter. For Nelson Labs, third quarter of 2022 revenue improved 7.3% to $56 million, compared to the third quarter of 2021. On a constant currency basis, Nelson Labs grew revenues 11%, while segment income declined by 4%, compared to the third quarter of last year. Our CapEx for third quarter of 2022 was $39 million, consistent with the increased levels of spend that we communicated for our full-year 2022. This guidance range incorporates an incremental 1% unfavorable foreign currency impact on top of what we communicated last quarter, as well as slower recovery in certain testing categories at Nelson Labs. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}