{
    "symbol": "KBH",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-22 23:03:05",
    "content": " In the first quarter, we generated nearly $52,000 per delivery in lot premium and studio revenues consistent with our quarterly average in 2022, representing about 11% of our housing revenues. In the first quarter, our housing revenues of $1.38 billion were basically the same as a year-ago, as a 3% decrease in the number of homes delivered was mostly offset by a 2% increase in the overall average selling price of those homes. We believe we are well positioned to achieve this topline performance supported by our first quarter ending backlog value of approximately $3.3 billion, our higher community count, and our assumption of current housing market conditions continuing for the remainder of the year along with expected improvement in supply chain performance and build times. In the first quarter, our overall average selling price of homes delivered increased 2% year-over-year to approximately $495,000 as increases of 10% to 12% across three of our regions were mostly offset by a 5% decrease in our West Coast region due to a community mix shift in our Southern California business where several communities with $1 million plus selling prices delivered out in 2022. Our homebuilding operating income margin decreased to 11.4% compared to 12.2% for the 2022 first quarter, reflecting a lower gross margin, partly offset by a slight improvement in the SG&A expense ratio. Due to the soft market conditions in our healthy existing land pipeline, we continued to moderate our investments in land acquisitions and development during the first quarter with our total expenditures down 48% to $367 million. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. The final point I guess I'd make is, as we progressed through last year, we did see some costs coming down and as we started those homes, those homes on the lower cost basis, will be hitting in the second, third quarters, fourth quarters a little bit up in here because of some of the starts, we haven't quite finalized for the fourth quarter, but for the most part we're seeing some of the cost savings already flowing through, but the bulk of what Rob talked about earlier will actually flow through in the early part of next year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}