{
    "symbol": "TSN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-14 13:38:17",
    "content": " Our operating income performance translated to adjusted earnings per share of $1.63 for the fourth quarter and a record $8.73 for the full year, up 5% from last year. In International, volumes continue to grow, up 7.3% compared to the prior year quarter driven by our investments in capacity, innovation and brands that support market share growth. With our iconic retail brands, Tyson, Jimmy Dean, Hillshire Farm and Ball Park, Tyson core business lines outpaced total food and beverage and our peers in growth up 18% in volume sales in the last 13 weeks compared to pre-pandemic levels per Nielsen data. While the foodservice industry has yet to recover to pre-pandemic traffic levels, the Tyson Focus 6 group is outpacing both total broadline and respective categories and volume sales, up 18.9% and 0.9 share points in the last 52 weeks compared to last year according to NPD supply track data. To facilitate this growth, an additional $80 million in SG&A expenses compared to last fiscal year was invested in team members, marketing, advertising and promotional spend to support our brand and digitalization initiatives, among other things. While SG&A expenses increased, SG&A as a percentage of total sales was down to 4.2% from 4.5% in the prior fiscal year, reflecting our continued focus on assessing all expenses across the business to identify non-value-added spend and continuing to build leverage across the scale of our business. Sales were approximately $4.9 billion for the fourth quarter, down 3% versus the same period last year, but up 10% for the fiscal year at nearly $20 billion. We delivered segment operating income of $2.5 billion for the year, and our fiscal year operating margin of 12.5% was a very strong performance by historical standards. For the fiscal year, sales increased 9.4%, driven by the higher average sales price increase of 13.5%, partially offset by the volume decline of 4.1%, in which 0.9% of the decline was due to the sale of our pet treats business. To address projected demand growth over the next decade, we invested $1.9 billion in our business in the past fiscal year, focused primarily on new capacity and automation objectives. We anticipate total company sales between $55 billion and $57 billion, and also expect volume growth compared to the prior fiscal year. Both total company sales and volume growth in fiscal '23 will largely be driven by our Chicken, Prepared Foods and International businesses as we work to run our plants full, optimizing our existing footprint and utilizing new capacity expansions. Now, as we touched on earlier, our productivity program is expected to deliver an additional $300 million to $400 million of savings during fiscal 2023 as we build upon the foundation laid across the enterprise this year with focus on operational and functional excellence, digital solutions and programmatic automation initiatives. We expect to deliver full year margins of 6% to 8%, driven primarily by progressively growing volume and sales revenue while at the same time realizing additional operational improvements."
}