{
    "symbol": "TSN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-08 13:21:03",
    "content": " In the third quarter versus last year, we delivered substantially improved earnings in our Chicken segment as well as higher earnings in Prepared Foods, which partially offset a decline in Beef and Pork earnings and we continue to accelerate our productivity actions to improve efficiency across all segments. I was also pleased to see continued growth in our e-commerce channel, where approximately 1 in 5 U.S. households bought a Tyson product during the past quarter with e-commerce sales growing 15% versus last year. In Beef, volumes were down year-to-date but were up 1.3% versus the same quarter last year, and we continued to increase quarter-over-quarter due to higher head throughput and carcass weight. Sales were approximately $5 billion for the third quarter, flat versus the same period last year, but up 15% year-to-date at nearly $15 billion. On expenses, we incurred greater costs during the third quarter versus the comparable prior year period as live cattle costs increased approximately $480 million in the quarter. We delivered segment operating income of $506 million in the quarter, down 55% versus the prior year comparable period. Sales were approximately $1.6 billion for the quarter, down 6% versus the same period last year, but up 4% year-to-date at $4.8 billion. Sales were approximately $2.4 billion for the quarter, up 5% relative to the same period last year and up 9% year-to-date at $7.2 billion. Operating margin for the segment was 7.6% or $186 million for the quarter, up versus last year. For the third quarter, we experienced $145 million in higher feed ingredient costs versus prior year, and we recognized $23 million in net derivative losses compared to $56 million of net derivative gains in the prior year. And then over time, letâ\u0080\u0099s talk â\u0080\u009823, weâ\u0080\u0099ve been saying for a couple of quarters now that we see that being a 5% to 7%, which is lower than where weâ\u0080\u0099ve been over the last couple of years, but versus the historical level, what we would be seeing there is very much in line with what weâ\u0080\u0099ve built into our modeling and what we would anticipate. I guess, my first question, and maybe going back to Prepared Foods, and Stewart, I think I heard you say, at the low end of the 8% to 10% range for the full fiscal year, which I guess for the fourth quarter would get you something below 8%."
}