{
    "symbol": "TSN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-07 12:59:06",
    "content": "  Operator: Good morning, and welcome to the Tyson Foods First Quarter 2022 Earnings Conference Call. Hello, and welcome to the first quarter fiscal 2022 earnings conference call for Tyson Foods. Prepared remarks today will be provided by Donnie King, President and Chief Executive Officer; and Stewart Glendinning, EVP and Chief Financial Officer. Additionally, David Bray, Group President, Poultry; Noelle O'Mara, Group President, Prepared Foods; Shane Miller, Group President, Fresh Meat; and Chris Langholz, Group President, International, will join the live Q&A session. We have prepared presentation slides to supplement our remarks, and these are available on the Investor Relations section of the Tyson website and through the link to our webcast. During this call, we'll make forward-looking statements regarding our expectations for the future. These statements are subject to risks, uncertainties and assumptions, which may cause actual results to differ materially from our current projections. Please note that references to earnings per share, operating income and operating margin in our remarks are on an adjusted basis unless otherwise noted. Earlier today, we announced our first quarter fiscal 2022 results. At our Investor Day, I shared our plan to grow our top and bottom lines aggressively over the next 3 years. We achieved double-digit sales and earnings growth, both of which were driven by ongoing demand strength, productivity savings and improving execution across our segments. Our diverse protein portfolio, omnichannel capabilities, leading brands and value-added products contributed to our results. Strong performance in our Beef segment, earlier-than-expected recovery in Prepared Foods and improvement in Chicken and Pork, all supported strong earning results. Our retail core business lines, which include our iconic brands, Tyson, Jimmy Dean, Hillshire Farm and Ball Park maintain their volume share position even as we work through price increases to address inflationary pressure. This growth was driven in large part by value-added chicken, which outperformed industry recovery and breakfast sausage where we were seeing improved fill rates. Importantly, and despite the continued impact of COVID-19, our volumes improved slightly across the company relative to the same quarter last year. Chicken was a bright spot, where we saw our volumes improved 3.6%. These actions include investing in our team members, in additional capacity and in brands and product innovation. As discussed at Investor Day, we are also in the process of building 12 new plants. Bottom line, we're committed to improving our total company volumes during the year. In the quarter, our cost of goods sold was up 18% relative to the same period last year. We are seeing higher costs across our supply chain, including higher input costs, such as feed and ingredients. We're also managing higher cost of labor, transportation due to strong demand and limited availability. With these higher costs, we work closely with our customers to achieve a fair value for our products. As a result, our average sales price for the quarter increased 19.6% relative to the same period last year. Finally, our balance sheet and overall liquidity position are strong, providing optionality to pursue strategic growth priorities and invest in growth across our portfolio. Our first quarter results clearly demonstrate that we are making progress on our growth objectives, that we remain focused on outpacing the overall market, improving operating margins and driving strong returns for our shareholders. While we're growing our business, we are mindful of our corporate responsibilities around environment, social and governance goals. Last year, Tyson Foods donated more than 16 million pounds of protein, the equivalent of 64 million meals to fight hunger. Tyson is a great company with a great team doing great things, and I'm pleased that this was recognized just last week by Fortune Magazine, who announced that for the sixth year in a row, Tyson Foods was #1 in our sector in their rankings of the world's most admired companies. We delivered solid operating income performance, up 40% for the quarter. And while we're working to achieve optimal throughput across our segments, labor challenges are still impacting our volumes and the ability to achieve optimal mix across our network. In retail, despite substantial market pressures, core business lines held share in the first quarter, led by strong performance in lunch meat, hotdogs, snacking and bacon. Still, customer demand continues to outpace our ability to supply products. To realize our volume goals, we must be able to fully staff our plants across the company. For example, we provided our hourly team members with more than $50 million in bonuses during the first quarter. And while we have seen some labor challenges during the Omicron surge, we are generally seeing lower turnover in absenteeism. We saw Chicken volumes grow 3.6% in the quarter, driven by strong fundamental demand and improved live production. In Prepared Foods, volumes were down 2.6% in the first quarter. In Beef, volumes were down 6.2%, driven by labor shortages previously mentioned. In addition, port congestion has also dipped in export volumes in the segment. In International/Other, while we are starting from a relatively small base, our investment in capacity, innovation and brands are supporting our market share growth objective. Overall, we expect to grow our total company volumes by 2% to 3% in FY '22, outpacing protein consumption growth. In the first quarter, we've started to see profitability improvement resulting from our actions. For example, we're investing aggressively in automation and technology to help us address some of the most hard to fill roles. This is not a series of projects, but is a well-planned program with automation, designed to use common designs and equipment across our plants to optimize cost, maintenance and asset utilization. Since September, we've seen an improvement in our hatch rate ahead of our expectations. We will staff our plants, service our customers, grow our volumes and be the best in the business. The plan we have continues to be the right plan and our commitment to winning with our team members, winning with our customers and consumers and winning with operational excellence is delivering results. Last year, we announced the launch of a new productivity program designed to drive a better, faster, more agile organization that is supported by a culture of continuous improvement and faster decision-making. The program aims to deliver $1 billion in recurring productivity savings by the end of fiscal '24 relative to a fiscal 2021 cost baseline and has 3 critical focus areas, which are operational and functional excellence, digital solutions and automation. I spoke just a minute ago about our investments in automation, but we've also attacked other issues. In Prepared Foods, we're making use of supply chain, digitization and advanced analytics. Our digital manufacturing platform allows us to analyze real-time data to take actions to optimize process conditions that drive better yields, lower costs, consistent quality and increased output. In transportation and logistics, we have established ongoing optimization of the mix and allocation of our private fleet, dedicated fleet and third-party fleet, mitigating inflationary pressures and supporting better on-time deliveries to our customers. In addition, we continued the expansion of our direct shipment program, reducing miles driven and product touches in our supply chain. As a result of projects like these, we're on track to deliver $300 million to $400 million of savings in fiscal 2022. This starts first with our commitment to our team members with a focus on ensuring their health, safety and well-being as well as ensuring an inclusive and equitable work environment. We are proud of our COVID-19 vaccine policy implemented last year in the U.S. and of the broader investments that we have made to keep our team members, their families and our communities safe. Because of our policy, our team members are better protected and the cases we do see have been mild or asymptomatic, resulting in an extremely low number of hospitalizations. Second, we are working to enhance our portfolio and capacity to better address demand. Fourth, we're driving operational and functional excellence and investing in digital and automation initiatives. We're working diligently to drive out waste, minimize bureaucracy and enhance decision-making speed across the organization. Fifth, to address projected demand growth over the next decade, we are using our financial strength to invest in our business. On capital alone, we're expected to invest $2 billion in fiscal year '22 with a disproportionate share focused on new capacity and automation objectives. During the quarter, we returned over $500 million in dividends and share repurchases. To wrap it up, we are committed to winning with our team members, customers and consumers as well as winning with operational excellence. Our sales were up approximately 24% in the first quarter, largely a function of our pricing initiatives to offset inflationary pressures. Volumes were also up slightly, although impacted by continued labor challenges. Looking at our sales results by channel, retail drove almost $350 million of top line improvements versus last year. First quarter operating income of $1.4 billion was up 40% relative to the same quarter last year due to increased earnings in Beef, Pork and Chicken. Driven by the strength in operating income, first quarter earnings per share grew 48% to $2.87. Slide 10 bridges year-to-date operating income, which was $407 million higher than fiscal 2021. Volumes were up slightly during the year, primarily a result of improvement in Chicken, Pork and International/Other, offset by declines in Beef and Prepared Foods. Our pricing actions led to approximately $2.1 billion in sales and price/mix benefit during the quarter, which offset the higher cost of goods sold of $1.6 billion. We saw continued inflation across the business, in some instances, up 20% to 30%. Notable examples were labor, grain costs, live cattle and hog costs and freight costs. And finally, SG&A was $88 million unfavorable to the same period last year, which was largely a result of cycling a $55 million benefit recorded last year for the recovery of cattle. Segment sales were more than $5 billion for the quarter, up 25% versus the same period last year. Sales growth was driven by continued strong demand for beef products, which has supported higher average sales price. We delivered segment operating income of $956 million, up 81% versus the prior comparable period. This improvement was driven by strong global demand for beef products and a higher cut out, which were partially offset by higher operating costs. Segment sales were over $1.6 billion for the quarter, up 13% versus the same period last year. Key sales drivers for the segment included higher average sales price due to strong demand and increased hog costs, partially offset by a challenging labor environment. Segment operating income was $164 million for the quarter, up 41% versus the comparable period. Overall, operating margins for the segment improved to 10.1% for the quarter. Sales were $2.3 billion for the quarter, up 10% relative to the same period last year. During the quarter, retail core business mines maintained share, driven by consumer demand for our brands and continued strong execution by our team. In addition to pricing, we've executed productivity, revenue management and commercial spend optimization initiatives while ensuring the continued development of brand equity through marketing and trade support. Sales were $3.9 billion for the quarter, up 37%. Our teams have been focused on streamlining our plants to deliver higher volumes and we expect to deliver substantial volume improvements in fiscal 2022 as hatch recovers, and we continue to look for ways to operate our plant more efficiently. On pricing, we made tremendous progress toward driving our pricing mechanisms toward more variable structures and are now seeing those benefits. Chicken delivered adjusted operating income of $117 million in the first quarter of fiscal 2022, representing an operating margin of 3%. As part of our capital allocation approach, we focused on building financial strength, investing in our business and returning cash to shareholders. In pursuit of our priority to build financial strength and flexibility, we used improved earnings to retire debt in fiscal year 2021 and expect to do the same this year. Finally, as our track record has demonstrated, we are committed to returning cash to shareholders through both dividends and share buybacks. We are maintaining our total company sales guidance of $49 billion to $51 billion, although we expect to perform at the upper end of the range. In support of our sales growth, we still expect a 2% to 3% volume growth on a year-over-year basis as we work to optimize our existing footprint and run our plants full. Looking at AOI margin target ranges for our segments, in Chicken, our operational turnaround is working and we still expect to achieve a run rate profitability of 5% to 7% by the middle of the year. Based on our first quarter performance, we now expect the full year margin performance in Prepared Foods to be at the upper end of the range. In Beef, we are maintaining our AOI margin at 9% to 11%, but we expect to perform at the upper end of the range. Also, we expect the front half of the year to be meaningfully stronger than the back half as industry and labor conditions are expected to normalize partway through the year. In Pork, we expect similar performance during fiscal '22 to what we accomplished during fiscal '21, equating to a margin of between 5% and 7%. As is normal seasonality for pork, we expect the first quarter to be the strongest. In International/Other, we expect margins of 2% to 3% as capacity expansions and strong global demand support volume growth and improved profitability. Consistent with our expectation for a meaningful increase in CapEx spending to pursue a healthy pipeline of projects with strong return profiles, we anticipate CapEx spending of approximately $2 billion during fiscal 2022. Our net leverage is expected to remain well below 2x net debt-to-adjusted EBITDA, providing optionality for inorganic investment and additional return of cash to shareholders over the course of the year. In summary, we've had a strong start to the fiscal year. We have a great team, growing demand for our products, strong portfolio diversity and the differentiated asset footprint needed to win in the marketplace. We set out ambitious calls at our Investor Day, and we expect to achieve them. So I guess my first question, just maybe taking the quarter and the kind of updated kind of view of fiscal '22 kind of broadly. Well, let me start off with and tell you that we really got off to a good start in Q1. We've seen prior to elasticities, for example, in Prepared Foods being less or lower than what they have historically been, which is exciting there. We're anticipating $300 million, $400 million, and we're on track through Q1 relative to that. Just doing what we do better and we talk about becoming a more agile, faster decision-making organization. Essentially, that's all about process and being better, faster and making decision that with greater speed at lower levels within the organization. But because of our vaccination position, we've now moved past the surge of the Omicron spike, as we call it, which occurred predominantly in the first 3 weeks of January, and we're back to normal levels. We think labor will be available, will be much greater in the balance of the year. And we certainly have capacities coming online with head and harvest and Chicken and further processing capabilities, value-added capabilities in Prepared and Chicken. And we've got labor going back into beef and pork plants, and we'll be able to improve those mixes as well as increase the harvest capacity. On capital allocation, you stepped up the buyback in the fiscal first quarter. Just certainly have the balance sheet capacity to make it more ratable, but I'm just trying to think about how to bring that expectation going forward. If you go back to Investor Day, we were really focused on being able to point to the strong growth story that sits in front of our Tyson's future. Donnie, you've spoken in the past, and it's been helpful just on how buy versus grow gets put at a disadvantage, particularly when spot prices move, you've made some strides to lower kind of at meat purchases here on a sequential basis. But over the last year or so, we've been -- the recovery for our Chicken business has been a priority. Specifically, as it relates to buy versus growth, the fact of the matter is, we became too dependent on the buy portion of the model. And we forgot to grow Chicken, which hurt us from a capacity utilization perspective and those additional pounds flowing through our business really impacted our fixed cost leverage. And over the last year, as we been building the breeding stock and getting past the hatch issue that we talked about so much last year, we're now in a better position to get more head through our processing and harvest facilities and which will give us more breast meat at a much more attractive price point versus the buy in the marketplace right now. We have not totally abandoned the buy portion and do not anticipate totally abandoning that, but there's a smaller percentage of our overall needs that we will go to the market to secure. From our standpoint, we will continue to manage against what is right, as whether buy versus grow. But generally, outside meat purchases are going to be used to supplement what we're doing when it's the right financial decision. It's one of the big levers of what we are going to accomplish in FY '22 to grow the animals ourselves into processes, and that will make us much more efficient. And Donnie, in both your comments, prepared remarks and Stewart, you both commented on restructuring the pricing strategy to be more variable in nature, particularly in Chicken. So I would tell you, within Chicken specifically, I would tell you, we have restructured our pricing approach, and that's really in large part, thanks to our commercial organization as well as the great customer relationships that we have across both our retail and food service networks. I would tell you today, we are significantly more variable pricing versus fixed. Every contractor program that we have is either tied to grain, tied to market value and we will continue to use that. Pricing was up significantly in Chicken in the Q1 time frame of over 20%, and a large part of that was because of the variable programs that we put in place. I wanted to ask, it's obviously extremely early and this could lead to nothing, but there have been a couple of cases of avian influenza, obviously not in the poultry industry. I would tell you more specifically to what Tyson is doing versus what the industry is doing is, but we have a very robust biosecurity measures in place across all of our facilities, and that includes testing every flock for avian influenza. We're actually taking extra time and doing more cleaning of our vehicles that do go to the farms, but we are ahead of this and have been watching it very closely. I would add to this that we are -- we have in our biosecurity programs, we have green, which is just normal business; yellow, orange and red, which are progressive. I saw the case over the weekend in Florida, which I think now is 5 states, which we have seen avian influenza. And then I wanted to also ask, you had you obviously still have a plant-based alternative business, not obviously, the biggest part of your business at this point. Well, I mean, we're still in the plant-based protein business. But across retail and foodservice, we continue to see growth. But for us, with our presence outside the United States, in Europe and China, and also in Southeast Asia, we also have plant-based products in those markets that are doing really, really well also. So we're still excited about the plant-based business and when consumers prefer that, we want to have the opportunity to be able to provide that for them and are currently and are growing. Just as a build, we want to be leaders across all the proteins that consumers seek. We continue to have opportunities internationally, and we'll continue to ensure that we are participating with consumer interest and adoption growth. My question is regarding Prepared Foods, and you basically performed in line with guidance during this last quarter. And as you said, we're pleased with the market performance that we're seeing despite the price increases, which is really due to the strength of our brands and the strong partnership and relationships that we've built with our customers. Elasticity has been less than the historical models that Donnie has mentioned, but it's clearly something that we're watching closely. As you also heard in the comments, we're taking significant actions to transform our cost base and we're creating good momentum there. And so on the year, we continue to feel good about the 7% to 9% range that we've given, and we believe we have the right building blocks in place on our path to deliver sustainable double-digit margin. Well, automation is -- I've talked about it in a great deal in our productivity program, I talked about at Investor Day, that we anticipate over the next 3 years as that be worth about $450 million to us. We had a number of different projects, and we've moved from a -- have really moved from a project to project to more of a programmatic approach where we attack common things across our production footprint, for example, could be deboning across all chicken, could be like palletizing, for example, an automation that's available there across the entire enterprise, material handling-type things, but all of these are in terms of priority or the more difficult, harder to staff jobs. We will deliver $300 million to $400 million in productivity savings, and some of that is coming from the automation piece. To the best of my knowledge, we've not disclosed how much is coming from each sector, but we're moving as quickly as humanly possible as quickly as the supply chain will allow us to get new pieces of equipment and so forth. I think first and foremost, we do need to say that we are ahead of what we had expected from a Q1 stand point related to our overall hatch. I'll also share with you that -- and again, this is everything specific to Tyson. I would add this piece of context to that, Ken, that in '22, we have this -- we've -- where we intersect in publicly benchmark data. So I want to ask, in your presentation that you issued concurrent with the results this morning, you noted on the pork business that there's a continued opportunity around mix, I hope that you could elaborate a little bit on that. And then also to the extent that you think about that as a component of your Chicken business, I know repricing contracts, hatchability and plant productivity are all kind of the highlight items associated with improving that business. But for example, in the Pork business, the labor availability in pork and chicken has been the single biggest challenge that we've had over the last 2 years in the pandemic. Labor and capacity utilization is continuing, it has been good in pork and continues to get better. For example, in pork, maybe the inability to debone a ham versus selling a whole ham. But as we enter '22 in both businesses, we're in a much better position in terms of labor improving, and we still have some ways to go, but we see improving mix and capacity utilization across all businesses. But I think the other thing to add to this, too, is as we think globally here, Tyson is a global company and we're servicing a lot of companies and countries across the globe. We'll get in the animals through the facility, but it's the further processing we're doing on the back end of the plant that's been a bit of a challenge. And then for Chicken, I know that there's a mix challenges that perhaps weighed on leg quarters domestically. But with this very strong crude backdrop, I would think that would also benefit export demand for domestic leg quarters. So the U.S. is a leader in global beef production, and it's centered around our superior taste and quality. And the producers that we're partnering with in this country are doing a phenomenal job are increasingly preferring U.S.-produced beef, and we're seeing stronger global demand as a result of that. Port congestion on the West Coast, as you mentioned, has been an issue, and it's impacting not only the short-term international demand, but also fulfillment on orders that focused on is implemented strategies and options to not only diversify shipping ports, but also to mitigate our risk as we go forward. But we continue to see very good interest coming out of Asia, especially for our high-quality yield and beef. And Tyson has a competitive advantage with not only our direct business, but our international business unit that we have in in-country there in China. So significant resources in country, a lot of customers demand in beef, and we feel real good about 2022 and going forward. To answer your question relative to what we're seeing within poultry, very similar to his comments that Shane was making about the demand remains extremely strong. In addition to all the things that both Shane and David have said, I would remind us of the One Tyson approach, which is our international business unit that we have in China. When we export those commodity-based products outside the United States, in many cases today -- or in most cases today, we take them in and further process chicken leg quarters and the like into value-added branded products into China in an approach we call One Tyson. And then we're able to sell it and capture an additional margin on top of all that, eliminating a number of activities and hands touched in the middle of the process. One, I think easy to answer and maybe one that's not so easy. I talked about some of the technology we use to -- in my opening remarks, where we would intersect between our private fleet contract fleet outside carriers and try to optimize how we do that. But thus far, we have been successful in being able to get the transportation and we've asked our customers to pay us for that and pay us for freight, and we've been successful in doing so. Not -- as I look around the room and from all those leading the businesses, I don't think if you're a branded portfolio versus a more commodity-oriented business, I don't think that really matters. What we tried to do with our customers is say, freight is freight and the price of the product and the price of the product, and we don't -- we try not to blend the 2. But I think the fact of the matter is what -- this freight being up 32%, that's what it cost to get the product moved and delivered to a customer, and we're asking our customers to pay for that. In the past, I remember hearing that Tyson and others have found pockets of international immigrants, communities to source, to improve their labor utilization in certain facilities. And our approach has been to try to create a better place for people to work, a better work experience with less turnover and less absenteeism with just keeping team members safe. In our first quarter, we paid $50 million in bonuses to our team members for no reason other than to say thank you for choosing Tyson. And we've had to do a number of things like piloting childcare and subsidized child care, onsite clinics. Now our workforce, to be clear, is made up of a number of different immigrants and people from all over the world in different nationalities and so we've benefited through the years like many others have of having such a diverse workforce. We tried to be available with -- working with the government in terms of having availability and we've worked with communities in terms of trying to build or define housing to support that, to make it easier. I mean we're doing all kinds of things along that line to be able to make it easy to do business with Tyson, easy to go to work for Tyson and do it all the right way. You touched on elasticities a little bit, and I realize they've held up quite well. And especially just with pricing up as strongly as it is, that's a few multiples of what wage growth looks like. So as I mentioned, we're constantly reviewing pricing and revenue management strategies, and it is a dynamic environment. And so maybe the other aspects that I would point to is that we have a broad and diverse portfolio with a range of price points to ensure that we have offerings that meet a variety of consumer needs and price pack architecture also becomes critical in these inflationary times, and you see that focus for us across the business. I would add this to what Noelle said, we have seen a lot of inflation. But I would remind you that cost of food in the U.S., while it is higher, is relative to the balance of the world. Labor costs have been up 20%, cattle costs are up -- have been -- they're up 22%. Grain has been up 29% this year and freight, I mentioned earlier, is up 32%. But at Tyson, we play across the spectrum from the most value-added products to the most commodity of commodity products and we meet the consumer wherever they are on the value chain."
}