{
    "symbol": "S",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-08 22:11:04",
    "content": " And for us, it's really about, really stepping forward towards a more inclusive, open XDR approach and also kind of producing a more Zero Trust ecosystem around SentinelOne Singularity platform, really fusing together endpoint, which is kind of the edge of the network with the cloud and now identity and the user as well. We're now seeing, think about the White House Executive Order that mandates low collection, data retention, the ability to keep security data input telemetry for longer is actually fueling customers to procure more and more data retention and archiving directly from our platform. Even for the engine peers, I mean, we're seeing a lot of their customers and we've had a multi-million dollar displacement this quarter for a customer that grew increasingly frustrated with the multiple infections with inefficiency on protecting server environments. I think a lot of it is sometimes about relationships, but I think what's incredibly interesting about the customers that we've displaced is the reference they made to the amounts of infections they have to deal with, which to us is really why you're bringing in cyber security solution. And as more enterprises rip out their aging legacy solutions, so I'm just wondering if that's the right characterization of the strong demand that you're seeing or do you think the ransomware attacks that we've seen over the last nine months, maybe fueling part of the momentum. And now we're seeing I think, of just increasing – increase in accelerated attraction across the board, both in partners and with customers, with sales cycles and with competitive win rates. Today, I think we've shared that it's already about 10% contribution into our revenue is coming from the, cloud and server protection pieces that we sell, and we're seeing more and more traction in cloud security. So all in all, we feel well positioned to continue and capture market share in the cloud workload protection platform space into us, again if you coupled that with the platform approach with everything coming back to the same security data layer, then you really start unlocking synergies and you allow security teams really ask a question once and get an answer from every part of your enterprise network that spends from the endpoint or though the cloud. Great, thank you very much. And so that's the right way to think about our global field presence is adding all of those folks up and understanding that each time we're adding a partner behind that are hundreds of sales reps, doing 2000 plus accreditations to date, that's really building that flywheel, but we're absolutely going to continue to invest in our own SentinelOne personnel as it relates to go-to-market. Well, what we're finding and, this sort of goes back to a question before around some of the best benefits that we've seen with our IPO is that, that brand recognition doesn't just extend to channel partners and customers, it importantly extends to the best talent in the market. Great, thank you very much."
}