{
    "symbol": "DBD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 12:52:19",
    "content": " Total revenue was $846 million, an increase of approximately 3% sequentially and a decrease over second quarter 2021 of approximately 10% as reported and a decrease of approximately 1% excluding a foreign currency impact of $58 million and a $28 million impact from divested businesses, inclusive of Russia and Ukraine. Adjusted for foreign currency and divestitures, Banking revenue increased 5% sequentially and decreased approximately 1% on a year-over-year basis, excluding a foreign currency impact of $29 million and divestitures of $11 million. Retail revenue decreased 2% sequentially and remained flat to the second quarter of 2021, excluding the foreign currency impact of $28 million and divestitures of $17 million. Unlevered free cash flow for the second quarter of 2022 was a $61 million usage, compared to a $176 million usage last quarter and a $52 million usage in the second quarter of 2021. We have executed approximately 80% of our cost savings plan, with approximately $120 million of annualized costs either removed or in a transition period, equating to roughly $12 million of non-GAAP savings in the second quarter. For 2022 to 2024, as noted in our shareholder letter, we are targeting the following as well as providing additional detail: revenue growth of 3% annually; gross margin growth of 200 to 250 basis points as a percentage of revenue by 2024; SG&A to decline 150 basis points as a percentage of revenue; and R&D to trend downward 50 basis points as a percentage of revenue; adjusted EBITDA margin of 13% as a percentage of revenue by 2024; and additionally, from 2022 to 2024, unlevered free cash flow margin is modeled to expand from approximately 50% in 2022 to approximately 70% in 2024. That $70 million to $90 million is really related to the management of working capital and expectation of an inventory reduction in the back half of the year, continued good progress relative to deferred revenue and then other balance sheet items being managed to get back to free cash flow of 0. So it's going to be around $100 million through the end of the year, and as I said, cash-wise, it will be approximately $85 million in the first quarter. Now as far as what goes into next year, we haven't given any guidance on that yet for next year, but I would say that the P&L GAAP to non-GAAP adjustment will be approximately $100 million for 2022, with $85 million of cash payment."
}