{
    "symbol": "DBD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 12:50:23",
    "content": " At this time, I would like to welcome everybody to the Diebold Nixdorf Fourth Quarter 2022 Conference Call. These statements reflect the expectations and beliefs of our management team at the time of this call, but they are subject to risks and uncertainties that could cause actual results to differ materially from these statements. Before I start, as we announced this morning, I want to thank my colleague and friend, Jeff Rutherford, for his leadership over the past four years and his significant contributions to our company. I look forward to working with him over the next few weeks as he transitions his CFO role to Jim Barna, our Head of Treasury and Tax, who has been part of our succession planning for the CFO role, has been instrumental in refinancing our debt and improving our operating model. Over the last four years, we have accomplished a lot here at Diebold Nixdorf, and I'm confident in the path you are taking the company to success. We also want to say thanks to Gary Greenfield, who stepped down as Board Chair after five years' role for his service to the company. Our refreshed Board and leadership team are excited and unified about our priorities as a company, which include operational execution and now that our refinancing is behind us, a strong focus on deleveraging. With that, let's now discuss our quarterly results. From key customer wins to important milestones that are improving our operational rigor, the steps we took in 2022 to position our company for a stronger future will be a springboard for our success. As I reflect on the past 11 months as CEO of Diebold Nixdorf, I couldn't be prouder of our employees for helping me navigate an ever changing environment and to our customers for the support they provided and their continued trust on DN solutions. Last year, a significant amount of effort and time were spent on improving operations and completing our refinancing transactions. I am happy to say we ended 2022 on a positive note, both with the closing of our Transaction Support Agreement and finishing the year with a record high backlog. Closing the TSA was an important milestone that provides us with the capital we need to normalize our operations, meet supplier commitments and fully execute on our value generating model. As we continue to shift our customers and installed base to the new DN Series recycling ATMs and rolled out our self checkout family, including our new retail EASY ONE solution. Closing out 2022 with backlog and financial stability has allowed us to enter 2023 focused on clear priorities for our customers, employees and shareholders. Our focus is straightforward, deleveraging, free cash flow generation and evaluating all strategic opportunities, based on the following three goals. First and foremost, we plan to deliver our products to our customers and maintain operational excellence. In the operational plan we presented in our last call, we are committed to delivering 60,000 ATMs, 35,000 SCOs and 134 EPOS in 20 23. And importantly for the leadership team and I, we will reinvigorate our culture after a year of so much change. These priorities plus starting the deleveraging process are the foundation for our 2023 model, and we are committed to building and delivering our core solutions with a strong focus on unit conversion and unit economics. As I mentioned previously, in 2023, we plan to recognize revenue for 60,000 ATMs, 35,000 self checkout solutions and 134 point of sale devices. Stabilizing our business around our core expertise to drive growth and execute around our contract base will also expand our recurring revenue opportunity, creating longer term value. And finally, we continue to optimize our pricing strategy and we will see the benefit of these actions throughout the year. As the multiple pieces of our global supply chain continue to stabilize, we will see some variability quarter-over-quarter through 2023. However, with the significant work done in 2022, such as getting our Ohio manufacturing facility fully operational and setting up contract manufacturing for the India market, we are building resiliency in our operations. Now, I would like to turn it over to Jim to cover our Q4 2022 financial performance. My prepared remarks will include references to certain non-GAAP metrics, such as adjusted EBITDA, Today, I will spend my time discussing the fourth quarter results relative to the full year 2022 operating model, included in our last earnings report on November 8th. For a discussion of our fourth quarter and full year performance relative to prior periods, please see the financial summary included in our earnings release. We revenue the following units in Q4; 17,000 ATMs, approximately 6,000 SCOs and approximately 33,000 EPOS. We recognize revenue on the following units and full year 2022; approximately 49,000 ATMs, approximately '21,000 SCOs and approximately 126,000 EPOS. With respect to liquidity, we are modeling to have adequate liquidity throughout 2023 to run our business and execute on our plan, and weâ\u0080\u0099ll vigilantly manage liquidity through increased operational rigor. Now, Octavia will walk you through our banking and retail business and financial highlights. In banking, the shift from legacy ATM devices continued as our new DN Series cash recyclers comprised approximately 80% of total new banking orders in North America in the fourth quarter. In terms of financial performance, banking revenue came in at $689 million and segment operating profit was $102 million. In retail, we saw contract based growth in self service solutions, including self checkout as the vast majority of SCO shipments represent new placements in the market and have generally a strong service attachment rate. Coming up -- of strong National Retail Federation show better known as NRF in New York City in January, our retail solutions remained in high demand and our self checkout business continues to grow faster than the market, especially as we have started the rollout at a major grocer in the US. Increasingly, more US based retailers are seeing the difference of the DN SCO experience in these stores. In addition, we are also very excited about our new DN Series EASY ONE product, which received great feedback from over 160 customers who attended the launch during the NRF show. We believe this product is the game changer, because it allows retailer to easily and economically move from a traditional checkout to a self checkout to stay ahead of consumer preferences. Retail revenue was approximately $276 million in the fourth quarter, while segment operating profit was $44 million. Sequentially, revenue growth was largely product driven, which was a function of improved self checkout volumes and a rebound in third party solution business. Despite significant supply chain challenges, retail managed to grow low single digits, excluding currency and divestitures in fiscal year 2022. Now, I would like to provide you an update on the cost savings plan we implemented last year. We continue to target the midpoint of 2023 for completion of the restructuring and expect to see some cost savings benefits in the first half of the year, offset by the reinstatement of our annual incentive compensation and merit pay increases. In closing, as we look ahead in 2023, we are well positioned for success with a strong order pipeline and a straightforward focus, converting our backlog into revenue. I'd like to recognize our incredible employees for their hard work and dedication, especially during a year of considerable change, their hard work, discipline and unwavering commitment to our customers are making a real difference in our efforts to strengthen our business and our competitive position. We look forward to continuing to make important strides to deliver world class products and services that meet the demands of our banking and retail customers, while sustaining our market competitiveness. Couple of questions, maybe first let's talk about pricing versus input costs. Clearly, as inflationary pressures, you know, accelerated through 2022, we needed to take pricing action. And with extended supply chain lead times, we were always a little bit behind the curve and our cost to price ratio. We made significant changes to improve supply chain velocity, which we will start seeing. And I am confident that we've worked through most of the backlogs that was, I would say, incorrectly priced or priced not considering some of the inflationary pressures. So as we stated in our operating plan, you can see the walkthrough and we expect to get to go to our historical margins by the end of the year. The frequency, the monitoring of input costs that in this changing environment needs to be done almost on a daily basis is one of the changes. Another big input cost has been global logistics, where we now see container pricing trending favorably. It started trending favorably at the beginning of the quarter, and we continue to see that trending favorably. So I would say that both the new pricing discipline, the new pricing actions that we've taken, plus a step stabilization on the component input, I think it's still too early to call that it's a significant reduction. But at least we see that it has stabilized and now starting to trend in the right direction, will clearly be beneficial as we go through the year. And then just as a follow-up, Octavio, now taking on the role as Chairman, I'm wondering if this maybe allows the company to think differently strategically about the business. So Matt, the first thing I'm very excited about the way the company has structured itself, I think it's part of a broader plan that the Board of Directors has. So we will clearly evaluate all options and that is something that we asked, the Board is very conscious about, and we will look at all possibilities. We will use every tool at our disposal to really look at how we change the trajectory of the debt that the company has, the debt burden that the company has. So just on ATM shipments, you recognized I think 49 for the year. As you saw, we have north of 70% plus in ATM, 60% in SCOs. These are orders that are now scheduled in our manufacturing, are clear to build based on the customer schedule. And clear to build to us means that, we either have all the components we needed or we have commitment from our suppliers to deliver those components in the time that we need those components to complete those units. So as far as how does that compare to history, and again, I'm always a little reluctant to talk about history because the world has changed so much over the past year, at least over the past two years. But if we look historically, we have never started the year with more than 30% of our backlog in this position. Our backlog, even though, our revenue group didn't reduce as much as we were expecting to be, because we had strong order entry, that, again, that surpassed our expectations. So to make a long story short, Paul, we feel very confident on delivering on those units. And we feel very confident that with the demand and rescheduling backlog, we will get to the stated goals that align to our plan. And then on the plan revenue unit of 60k, that would suggest 20% increase in units. So Paul, we will start disclosing as we go into Q1, the revenue -- the units we manufacture. And remember, we don't manufacture neither ATM nor a SCO or EPOS device without a firm customer order. In the ideal world, we plan to deliver 60,000 ATMs for cash flow reasons and linearity, it would be great if we could manufacture 15,000 ATMs every quarter and then revenue 15,000 ATMs every quarter. What you will see us doing is probably Q1 and a portion of Q2, our manufacturing will exceed our revenue as we're shipping ATMs across the globe. But starting the second half of Q2 and forward, you'll start seeing our manufacturing be lower than the units that we start revenue. Remember, depending on the type of unit, whether it's a recycler or a cash dispenser, whether it's being sold to a large national bank in the US or a small credit union or a global bank or Asian customer, the ASPs have rate variations, but we will start giving you more color around that into the future. For now -- because in any given quarter, there can be some variation based on geographic mix and product mix. And so you can appreciate that within there is positive free cash flow generation, and the improvement absent all of the one time items that we have in 2022, to your point, is going to come from a fair amount of working capital efficiency. And as it relates to how we see that sequencing throughout the year, to Octavia's point, I mean, that's something that we continue to work through as we layer in where those efficiencies kind of mark themselves throughout the year. Octavio, as the company has refinanced its debt, seems like it's in a better liquidity position. So Kartik, and I think it's in our presentation slides and I probably should have touched on that, because it's a very promising statistic for the future and the proof of the relationships we have with customers. Clearly, delivery delays and little bit of uncertainty around the financial situation was always in customersâ\u0080\u0099 minds. So as I started my remarks, when I say I thank our customers for their support, I mean that wholeheartedly, because we continue to receive orders for both our recyclers, for our self checkout devices. And again, I think that the demand is there, the quality of the solutions is there, and our customers remain very committed to continuing doing business with us. We really didn't see any significant -- or we didn't see any cancellations based on delivery times, and we don't expect to see any. So we're -- I think we enter the year with better operational rigor, better financial position and enviable customer base, both in banking and retail that is rooting for us to be successful. Yes, I would say that we're generally in line. I think when we talked at the third quarter and we put this out in unlevered terms, I would say that we're materially in line with that as we think about where we expect â\u0080\u009823 to ultimately land or how we're modeling it now. There are some things, as I mentioned previously, that we're working through in terms of working capital and related efficiencies. The model that we put forward that's predicated on the unit conversion and unit economics that we put forward, that is our guiding post. That's why we're so focused on talking about these units, because these units support the model that we put forward and that's the model that we're driving for. So as Jim said, there's always still a year there will be little movements, but we are committed to our model and are executing to that end. With the shortfall in unit shipments on the ATM side versus your prior 2022 guide, and Octavio, I think, you've talked a bit about orders being better than expected in Q4, driving revenue backlog higher. We still -- I would say that my first priority is deliver what we committed to delivering, that's the first priority. So we have -- weâ\u0080\u0099re in the middle of our first quarter, weâ\u0080\u0099re working hard to deliver our first quarter, then weâ\u0080\u0099ll work hard to deliver our second, third and fourth quarters. And yes, if demand remains strong, if -- we clearly would, if the markets change, I think we know there is possibility. But right now, our focus is let's deliver what we promised and not over rotate on what we can do. And I guess my follow-up is given the high backlog levels, does that shift how we should think about revenue linearity all throughout the year in a sense that, I know from a manufacturing perspective you are trying to even out your manufacturing, so you produce a bit more in the first half, a bit more in the second half. Our plan, Matt -- and remember, we don't discuss guidance based on quarters. In the perfect world, we would manufacture, as I said, 15,000 ATMs. I can't do the math on the SCO, because we are divided by 8,000, so 9,000 -- whatever the math that we ends up being, that would be the perfect. Clearly, based on where our manufacturing is, based on those shipment times, I would encourage you to think that we will be very stable in manufacturing throughout the year, trying to build as much as we can in the first half of the year. And that revenue will probably be lower than the ship, we will revenue less units than we ship in Q1 and as we move into Q2 and you will start seeing that kind of start to match up. And then as we move through latter half of the year, where you will see that revenue starts exceeding manufacturing capacity, as we close the year. So we -- and you will see us, as I said, you will see us disclosing that and it'll be very clear you will be able to very clearly track how much we manufacture, how much became revenue that quarter, how much is carrying over to the next quarter, how much is being manufactured, how much is being revenued. And it becomes -- that's why I'm so passionate about our unit economics model, because every unit that we manufacture, and I think Paul asked this question earlier and I didn't answer, but I'll. I would say in ATMs it's almost 95% plus, same as with SCO. And so again, you will be able to start modeling those things very clearly as we move forward. That means, suppliers that couldn't deliver to us for any reason and us having to go up into the open market at usually higher prices. Right now, I would tell you the plan we put forward as a company, that's what we're aiming for. That's why we're so focused on talking about the units, because the units get us to our plans and then currencies might fluctuate a little bit, but we will just deal with that as it happens. And speaking of your plan, usually EBITDA is specified during these calls. And remember, we're in a strange situation where I wouldn't call 470 -- 470 is our operating plan. We put out our operating plan, that is the plan that we're operating against, that is the plan that our team is committed on hitting. But since we've already shared our operating plan, that is our operating plan, that is what we're driving to, and the units are key to that. So if we hit those units, we will be hitting our operating plan and that's how you should think about our business. Deleveraging the company is clearly an area of focus, and all options to deleverage the company are options that we will evaluate. That is something that myself, the Board of Directors take very seriously, and we're evaluating all options. And to the extent you can add regional color, maybe touch on North America, LATAM, EMEA and Asia-Pacific in terms of what you're seeing there. But I would say North America, as you know, itâ\u0080\u0099s a market that is embracing recycling technology as a good way to improve the cash efficiency in the branches and change the branch footprint service and the customers better. We have a very strong leadership position in some of those markets, and I would say all those markets with plus 60% share in some cases. So we continue to work hard to maintain that leadership in Latin America, and demand there continues to be strong. As you recall, we had exited the Indian market, which is one of the largest ATM markets in the world. Through contract manufacturing, we are entering the -- reentering the Indian market. And lastly, Europe, I would say that Europe looks like a stable market. And so it's a good opportunity, but we see that more as a stable market going forward. And importantly, as I described with different dynamics in the market, we are also working very hard to align our cost structure to those markets. So we have integrated that into retail, because we see a lot of synergies and it's a service that -- and we have a large organization that can help us to position that in different verticals. As you know, you follow that industry, those vertical very closely, there is still a lot of conforming and defining what the models need to look like. And as I said before, this is a longer term opportunity where we want to be on the starting point, and really adapt as that market continues to evolve. You and me being now Ohio resi -- long time me is Ohio resident, I am happy to walk you through our manufacturing facility anytime you want. And as far as India, we started setting that up early last year and we shipped the first couple of hundred units in December. So in both cases, we now feel we are fully operational and have met and have plans on what each of these factories will deliver for us throughout the year. No one have additional questions waiting at this time, so I'll turn the call back over to Octavio Marquez, CEO of Diebold Nixdorf."
}