{
    "symbol": "SEV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-08 13:04:05",
    "content": " After the speakers' presentation, there will be a question-and-answer session. I'd now like to turn the conference over to your speaker today, Kirill Bagachenko. On today's call, we have our CEO, Laurin Hahn; our Chief Operating Officer, Thomas Hausch; and our Chief Financial Officer, Torsten Kiedel. Before we continue, please be reminded that today's presentation will contain forward-looking statements made under the Safe Harbor provisions of the US Private Securities Litigation Reform Act of 1995. As such, the company's actual results may be materially different from the views expressed today. As you know, we are working very hard every single day to deliver on our mission, solar on every vehicle. The Sion in front of the Golden Gate Bridge, while being successfully shown in our US tour recently. Inflation, recession, energy crisis, Russian-Ukraine war, the COVID-19 pandemic and a very challenging capital market. And in these difficult times, people become more cost sensitive and look for affordable, yet still innovative solutions for the everyday life. Approximately â\u0082¬25,000, very affordable, solar charging, very convenient and reduces utility bills, bidirectional charging, a home storage on wheels. And I was thrilled to see how the Sion resonated in the US with the people we met, including press and media, potential strategic partners and other interested individuals who attended our event. Same as in Europe, people are looking for an affordable, sustainable and yet innovative car. And that's not for just another luxury EV, which the majority just can't afford. That said, let's talk about the recent milestone we have achieved. Within the last 12 months, we achieved 30% growth and are now looking at 21,000 B2C Sion reservation holders. This sums up to an incredible amount of approximately 43,000 Sion preorders and reservations, which would equal a potential backlog of over $1 billion. And lastly, we delivered on our IPO promise and built 17  of our series validation fleet. Let's start with our first business unit, Sono Solar, where we license and sell our solar technology to trucks, buses, van and more. 130% growth since our IPO, now at 23 customers. These are industry leaders like Mitsubishi, Scania or MAN. These are very renowned corporations, are now starting to integrate solar into their first product, still on a prototype basis, but with a massive potential once we achieve fuel integration. We now have solar customer in over 10 countries globally, running from Japan to the US. Scania operates in more than 100 countries and delivered roughly 90,000 vehicles in 2021 alone. So, our Solar Bus Kit is now applicable for diesel and electric buses. We have made great progress with our seamless solar integration, going from vehicle applied photovoltaic, VaPV, to now vehicle integrated photovoltaics, ViPV. And here, I'm not speaking about commercial vehicles, but passenger car OEM. So, let me share some exciting news with you today. Together with Sono Motors, this OEM wants to explore solar integration into their high volume vehicle production. We have worked with that OEM customer now for several months, and believe this partnership shows the potential that our technology and business have to move to the next level. On that note, let me answer the question why other car manufacturers should license our solar technology. And yes, it's because of three simple answers. First, they want to avoid a huge reengineering effort. Second, they don't want to lose time to come to the market. Or to say it in another famous words, if a trend becomes obvious, you are too late. So, our technology is an already developed technology, which they have time; ready for large scale production, it's industrialized; and it's protected with a very strong IP. Here you can actually see the Sion in Brooklyn, where we calculated an average yearly free range from solar powered vehicle of nearly 5,000 miles or 8,000 kilometers. Overall, we're making good progress on our Sion. We're testing in several locations around the world including aerodynamics and wind tunnel tests in Sweden, steering and other driving dynamics tests in the northern US and consumption and efficiency testing in Spain. On the development side, overall, we're progressing as planned. We've entered a release process for series, which marks the completion of a core stage of development work. Key functionalities, such as discharging, charging, solar yield, drivability, infotainment, were successfully tested. However, a reduced funding speed drives the delay of the SOP from the second half of 2023 into Q1 2024. Our definition of SOP continues to be handing over sellable product to customers, not just producing vehicles alone. This completes our three pronged approach to allow self-repair to the customer, empower independent workshops, but also create a Europewide dedicated partner network. In our case, for the Sion launch, we're starting with 50 Bosch Car Service locations in Germany to be trained and qualified. Bosch Automotive aftermarket gives us access to over 10,000 workshops in Europe as one of the world's largest grouping of repair locations. Conti, and formerly also Vitesco â\u0080\u0093 Conti in their former function also as head of Vitesco already supplied us with our electric drive unit for our SEV2 years ago. Here in our SEV3, our series validation vehicles, you can see many applications from Continental including ADAS function, vehicle control unit software, and many others, just to name a few. Let's give a corporate update and start that one with the Sion here in Los Angeles where we calculated an average yearly free range from solar of nearly 6,000 miles or 9,000 kilometers. The feedback we received on this tour from our Sion series rehabilitation vehicles, but also for our overall company and the solar business was quite rewarding. We had interviews with CNBC, Barron's, CNET, Axios, Boston Globe, among others. As an impression for you, we selected seven pictures representing our seven locations we serve. Feedback from the people we met, including press, potential investors and other interested attendees, was very positive. For example, many followers and interested parties perceived the Sion as being much bigger, more spacious in real life than in pictures. About 50% of our employees have an international background, with currently 45 nationalities represented at Sono Motors. Based on the aforementioned funding speed, we have implemented a hiring freeze since November to control our operational expenses. In the first nine months of this year, we significantly increased our revenues and achieved â\u0082¬180,000 from Sono Solar and Sono Digital compared to no revenues at all in the same timeframe in 2021. In parallel, we made substantial R&D investments with almost â\u0082¬90 million spent in the last nine months in comparison to â\u0082¬27 million year-to-date September 2021. We also started purchasing necessary machinery and tooling in preparation of the start of production and capitalized approximately â\u0082¬42 million as of September 30, 2022 versus â\u0082¬1.5 million one year ago. I'm also glad to highlight that despite the strong growth in our operations and headcount, we were able to keep SG&A costs well under control with approximately â\u0082¬16 million for the first nine months in comparison to â\u0082¬13 million in the same timeframe last year. The revenue growth accelerated particularly in Q3, with six times higher sales compared to the previous quarter, resulting in â\u0082¬138,000 in revenue. Since liquidity is essential in such a challenging market environment, let me also update you on our current and expected liquidity. It's approximately â\u0082¬55 million as of November 30, which consists of â\u0082¬25 million of cash and cash equivalents and the signed agreement for the sale and issuance of up to $30 million of convertible debenture, on which I'll provide more details on in a minute. The substantial investment, combined with the SG&A, resulted in approximately â\u0082¬56 million net cash outflow in Q3 of this year. Looking ahead, I'd like to share with you a helicopter view of where we stand on the development side and how this connects with outstanding needs. Overall, we've raised around  over the last couple of years. And on the solar side, we were able to develop the aforementioned sixth generation of solar panel integration and to deliver the first prototypes to many renowned vehicle manufacturers. We currently estimate that we need approximately â\u0082¬130 million until the next crucial milestone, the pre series vehicle release next summer. Thereafter, we estimate that we'll require only an additional â\u0082¬80 million to start delivering the first Sion to our customers in Q1 of 2024. Just this morning, we announced an agreement for the sale of convertible debentures with Yorkville Advisors. The first one upon signing, the second one upon filing a registration statement, and the third one upon effectiveness. We're quite happy with the favorable terms we received â\u0080\u0093 a 4% interest, no warrants, FX conversion price of $1.75, and if the stock price is below that level, then a variable conversion of 96.5%, the lowest daily EVOP during the seven prior days. What I'd like to highlight here is that while the debentures provide us with meaningful upfront capital, the conversions related to them would effectively replace our use of the existing committed equity facility or our new ATM going forward since both are now limited to 2% of daily trading volume, subject to exceptions for days with high trading volume. On December 7, Sono Group also entered into an at the market sales agreement with B. Riley, Berenberg, and Cantor Fitzgerald acting as sales agents. As mentioned before, once the debentures have been repaid, the ATM program will replace the existing committed equity facility that we have been using the last four and a half months and it's meant to enhance our access to capital. Given the same convertible debenture agreement, we don't plan to use the ATM extensively until the convertibles are redeemed. We started with a â\u0082¬33 million in cash at the end of Q3, secured an agreement for the convertible debentures with $30 million and already had inflows via the committed equity facility of approximately $7 million this quarter. Summed up, we have secured â\u0082¬70 million in total. Let me now share with you how we plan to close the remaining gap of approximately â\u0082¬130 million to finance the next big milestone, the pre-series vehicles that will already come from our â\u0080\u0093 at our production partner, Valmet Automotive, in Finland. With the support of our strong community, we are planning to raise â\u0082¬84 million net, which translates to 3,500 full Sion down payments. In a moment, Laurin will provide more details on why we strongly believe this is the right next step. Before I hand over to Laurin, I'd like to share some more thoughts about the funding in general. At the same time, high inflation and rising interest rates as central banks seek to curb inflation have resulted in negative sentiment in the financial markets since the second quarter of this year, with many tech companies losing between 50% to over 90% of their respective market cap. As a result, financing our CapEx program through equity has become challenging and dilutive for existing shareholders. We hear you, and we will be willing to streamline our business. However, we believe one aspect that makes Sion unique is our very strong and loyal community. We believe that, with our community, we can bridge that difficult market environment, reduce the overall funding need and prove to the capital market the strong demand for our solid technology and our affordable SEV design. I want to start with, we have an incredible â\u0082¬1 billion of potential backlog revenue, with over 40% with down payment. So, before we dare to decide to stop the Sion project, we want to give the approximately 21,000 reservation holders, our community, one last chance to prepay the car in full. These 21,000 reservations are an equivalent of approximately â\u0082¬460 million when converted into potential revenue, with almost â\u0082¬600 million worth of B2B preorders. Well, this is exactly what we plan to do by launching a special marketing campaign. With it, we will give our customers community the chance to prepay the equivalent of 3,500 Sion within 50 days. To make this clear, our community is an invaluable asset. So, the community engagement is planned like this. We ask customers for an upfront payment of their car reservations equivalent to 3,500 Sion full price payments. This would lead to â\u0082¬100 million cash in, including VAT. The good news for investors out there, it's a non-dilutive way of bridging the funding gap. So now, we ask them to give us some of the money 12 to 18 months earlier in order to start the production of their car. In order to support our message, we have planned a very intensive marketing campaign around it. Our planned activities are to start under the hashtag #SaveSion, an exceptional social media campaign, with transparency as a key factor of success. Additionally, we started a Sion tour from Germany, Austria, Switzerland, Netherlands, 12 cities, inviting 10,000 people. We give incentives for advance payment, up to 10% discount for full priced down payment. In 2019, we raised â\u0082¬63 million in payment commitments in 50 days through prepayment, loans, donations, but no dilution for equity. At that time, it was the largest of its kind for a hardware product in Europe. Now, with the Sion in its final production design in comparably higher brand awareness and a shorter distance tour towards the start of production, we are confident that we can work this out and that we can be successful with this campaign. If it doesn't go as expected, we will focus on the B2B solar only business case as a very attractive alternative, which is significantly less capital intensive. Moreover, we have had a number of promising negotiations with potential strategic partners interested in our solar technology. So, let us prove you and all investors out there that it's about a car that has massive potential, a community that has one belief, a belief that even a small group of people can make a difference. So, let's do it. Usually, this goes in three main steps. And that's the first step, series production. First of all, it's good to see that we have access to the â\u0082¬70 million I mentioned, as a starting point. And the additional capital, this is why we're kicking it off today. The sooner we have transparency, the sooner we can kick off purchase orders for some of the bigger machineries and toolings that we need to kick off as soon as possible. So the timing Laurin talked about is a 50-day campaign, and hope to see along, over the next couple of weeks, how we're progressing there. And then, as soon as we have more transparency on the potential success of the campaign to kick off the required or necessary purchase order for the machineries. You know better than us, we're a publicly traded company, so we only give you the information that we can give out. Fact is, however, we continue to â\u0080\u0093 are in discussions on the items you just mentioned with not only one passenger car OEM alone. So we continue on the business that we have started two years ago at CES at the beginning of 2021 to continue to talk about other opportunities, including the credits you just mentioned. Of course, as you know, they're effective in Europe only when you register the first cars. So, the priority for us is now to make sure that we are successful in the campaign we just presented to you. We will take our next question. So, on the 50-day campaign, it sounds like optimism on that front. As we inform the public, of course, we also inform our suppliers. And of course, as I mentioned earlier, with the funding that became more complicated, as Torsten described it over the last couple of months, we have made the decision that we presented today to move our SOP from the second half of 2023 into the first quarter of 2024. But specifically with Valmet Automotive, it's a very good partner. So, no, we do not expect from that campaign in the announcement today anything but the delay we just mentioned. Let's say at the end of the 50-day campaign, you realize that maybe you need to push that a little further. Is that something that â\u0080\u0093 I would assume you'll be kind of having conversations ongoing with your suppliers, so that they're aware of the situation. So we have been successful in the past with the 50 days, raising those â\u0082¬53 million in payment commitments. Just on the good news on the PO signed with the large OEM, just curious, with financing top of mind, any thought or any interest from some of those large partners potentially in some sort of strategic investment to kind of help alleviate that. I know you're probably limited as to what you can say, but anything along those lines might be helpful. But of course, we would be foolish not to speak to potential OEMs or to OEMs out there about a potential strategic investment. And of course, those who receive or are currently looking into our solar technology would be the ones most likely to invest. With big OEMs or big corporates, it does take time. So for us, it's great to see there's interest in technology. We take this as a first step and we believe, once we have proven the technology works, yeah, then, consequently, conversations will continue. We will take our next question. So, I see you've mentioned you've raised â\u0082¬70 million. And so, I just want to make sure I understand this correctly. I just want to get more color on the capital funding strategies, particularly in regards to ATM and to the community down payments. First of all, let's start with the ATM. As you probably saw, our daily average trading stock volume increased significantly ever since we went to the US in order to present our solar technology and the Sion. Prior to the US tour, the weeks prior to that, we averaged around 300,000 on a single day. And now, we're looking at more than a million. As I mentioned before, since we now signed the convertible debenture with Yorkville, we will limit the usage of the formerly committed equity facility, in the future ATM, in order not to put too much pressure on the stock. So, it's limited to 2%, and there's an exception for very high trading volume days where we can use it to a bigger extent. We spoke extensively about the community down payments, about the marketing campaign, and why we believe this is the right next step. And of course, as you can imagine, one of the feedbacks in the past was, you still need a lot of money. We know it's not a lot of money from an OEM perspective, it's not a lot of money in comparison to many of our peers. I think in the past, you had mentioned the operating and investment cash flow outflow of about â\u0082¬165 million for the second half of this year and a little bit north of â\u0082¬150 million in 2023. What has changed is, of course, we try to adapt to market environment as much as possible. And we did the hiring freeze that Thomas talked about, and started that in November, to be as efficient as possible with the money we have received. Of course, there are many tech companies right now laying off people. Looking forward, the internal burn rate is less than â\u0082¬5 million a month, mainly for salaries, the 400 plus employees we currently employ here in Munich, and then some other OpEx. Of course, what we need to do is continue to invest in CapEx. Majority of the use of funds, as indicated in the past, is for production machinery and toolings. We trigger the purchase orders, so we drive the â\u0080\u0093 when we need to pay for those orders. We will take our next question. So, like as you've probably seen, last month your competitor Lightyear announced that they've begun production and are planning to scale early next year. First of all, believe it or not, but we love every EV that gets produced and put online. If I'm not mistaken, the car is about 10 times our price. It's a low volume, high priced product. And with that kind of production, you actually do a lot of work by hand. While we have the first affordable solar electric vehicle, and that's why we're upfront investing into tools and machinery that makes this car sell at â\u0082¬25,000 or roughly $25,000 net. We're trying to be very transparent with our community, publishing biweekly â\u0080\u0093 every second week, a sprint report on our website. We're publishing even on our website, the exact time plan to production. And, yes, another delay is, of course, not a great news to our customers. But we are trying to be that very transparent OEM who delivers also the reason for it, the rationale behind it and we think our community can deal with it. If you need more information, please take a look at our website or reach out directly to our IR team."
}