{
    "symbol": "DLB",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-02 19:57:13",
    "content": " And so, we continue to be confident that we can double our revenues from Dolby Atmos, Dolby Vision and imaging patents over the next three to five years, which means we continue to target annual growth of 15% to 25%. Consumer electronics represented about 18% of total licensing in Q1 of '23, down $2 million or 4% on a year-over-year basis as the prior year benefited from higher recoveries, which is partially offset by increased adoption of Dolby Atmos and Dolby Vision. Compared to Q2 of last year, we expect growth in Dolby Atmos, Dolby Vision and imaging patents, particularly in broadcast and mobile to more than offset lower foundational revenue, driven by lower unit shipments estimates in consumer electronics, PC and TVs and lower recoveries. And it was -- as you know, it was one of the biggest drivers of the strong growth in Dolby Vision and Dolby Atmos last year and we continue to see it to be a big growth driver this year. So, as it relates to music, I think what was really fun about CES for us this year was the opportunity to really tangibly demonstrate the entire ecosystem, starting with the concert in Dolby Atmos, but having all of our partners there throughout the ecosystem, punctuated, of course, by the ability for people to actually experience Dolby Atmos Music in the Mercedes and at some of the partners Bose -- like what Bose had going on. I feel like -- I just remembered that I felt like I forgot part of it, which is to just say that our -- we've said our goal is for -- we would like Dolby Atmos Music to be the way everybody experiences music all the time everywhere and on every car. And I wouldn't go so far as saying there haven't been any changes, it's just that as far as our guidance goes, there have been some end markets and partners that have seen things a little -- that have been a little better than what we estimated coming into the year and some that have been a little to the downside, and net-net as a portfolio across all of these devices and ecosystems, we see the underlying business at about where we saw it coming into the year. And so, the fact that you can now get a Dolby Vision, Dolby Atmos experience for, I want to say, I think  (ph) probably at the low end that, you can -- I don't know if I'm exactly precise on that, so you can check the Dolby page on Amazon on that, but that's good for us."
}