{
    "symbol": "CRS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-28 22:43:03",
    "content": " Risk factors that could cause actual results to differ materially from these forward-looking statements can be found in Carpenter Technology's most recent SEC filings, including the company's report on Form 10-K for the year ended June 30, 2021, Form 10-Q for the quarters ended September 30, 2021, December 31, 2021 and March 31, 2022 and the exhibits attached to those filings. During the quarter, we generated $65 million of free cash flow and finished the year with $448 million in total liquidity. SG&A expenses were $47.4 million in our recent fourth quarter, largely in line with the same period a year ago and up $9 million sequentially. When excluding the impact of special items, adjusted operating income was $14.9 million in the current quarter compared to an adjusted operating loss of $12.5 million in the prior year period and an adjusted operating loss of $1.6 million in our recent third quarter. The same quarter a year ago, SAO's adjusted operating income was $2.7 million, and in the third quarter of this fiscal year, SAO reported adjusted operating income of $7.6 million. Based on current expectations, we anticipate SAO will generate similar sequential adjusted operating income in the range of $18 million to $20 million in the upcoming quarter. Net sales in the fourth quarter of fiscal year 2022 were $95.8 million or $92.9 million, excluding surcharge. In our Dynamet Titanium business, net sales increased by double-digits in both the aerospace and defense and medical end-use markets from the same quarter a year ago. The operating income improvement on both a year-over-year and sequential basis is primarily the result of increased net sales across each of the business units, driven by ongoing improving market demand conditions. In the fourth quarter of fiscal year 2022, we spent $33 million on capital expenditures. For clarity, about $10 million of the pension expense for next year will be included in operating income similar to fiscal year 2022. In terms of total company operating income, we project that we will be at a run rate equal to FY â\u0080\u009819 full year operating income in the fourth quarter of FY â\u0080\u009823. But then when you see these types of increases, if you just look at this fourth quarter SAO operating income and -- or I'd say, say, total Carpenter operating income and what we're saying it would be in the fourth quarter of FY â\u0080\u009823, you're more than 4 times higher."
}