{
    "symbol": "CRK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 18:04:02",
    "content": " The wells we put on sales had an average IP rate of 26 million cubic feet per day, and our drilling activity added 1.1 Tcfe approved reserve additions at a low finding cost of $0.95 per Mcfe. We generated $434 million of cash flow during the quarter an 86% increase over 2021's fourth quarter, and our cash flow per share during the quarter was $1.57, up $0.67 from the fourth quarter of '21. In 2022, our average lateral increased up to 9,989 feet based on the 66 wells that we turned to sales during the calendar year that is 14% longer than the previous year's average lateral length of 8,800 feet. Now we've worked with Trey Newell, who was our - he's the new VP of Marketing to provide takeaway for the wells that we will be drilling in 2023 and through 2024, but I think our greater takeaway and Dan can address this in a moment, is our Western Haynesville. So if you look at that and you model it forward and then you look at the amount of pretty stable production we're getting from Western Haynesville, we think we can have a 6% production growth within cash flow and give the dividend and have material reserve growth, at the same time, add material inventory without - having to go to the M&A market. It's out of free cash flow that we bought all that acreage and to kind of your Western Haynesville questions, because the Western Haynesville has performed so well, I think that's one reason why Jerry Jones and his family that own 66% of the company said, you know what, we're going to demonstrate our confidence in the future of the company and the great potential is the upside in the equity. And so kind of where we think we're going to end up on speed, that's also going to change the cadence of our activity down here in the Western Haynesville as we do speed up and drill these wells faster, then at some point, you can drill at a speed that's essentially like adding another rig to the place. And that's why given our large footprint, we actually move around areas, not because we're trying to - we don't drill our very Tier-1 area all the time because we only have room for maybe a couple of wells a year to put into it based on the existing infrastructure. I mean, again, I think we look at LNG build-out is going to run its course and this demand will pick up in the next several years, and we just want to be positioned to not oversupply the market to provide however much gas, the market needs we'd like to provide that in the Haynesville/Bossier."
}