{
    "symbol": "OGN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 11:19:03",
    "content": " The increase in volume came from our growth pillars, fertility, biosimilars, NEXPLANON outside the U.S. this quarter and China retail but also from volume growth in our base business and established brands, particularly demand in China for non-VBP brands, as well as for products in Europe and the LAMIRA region. Our Women's Health business was down 5% as reported and 3% at constant currency in the first quarter versus prior year, driven by a 5% constant currency decline in NEXPLANON and a 6% decline in NuvaRing. Established brands getting out of the gate this well in the first quarter is what underpins Kevin's comment that we now believe revenue growth in this franchise can get close to flat for 2022 at constant currency, which is better than our estimated longer-term trajectory of low single-digit erosion. Now, because these first 2 priorities are not big absorbers of capital, that leaves significant self-generated cash flow for our third capital allocation priority, which I would really say is a tie between execution of external growth plans to develop a new pipeline of new product opportunities, we'll balance that against discretionary debt reduction, just like we did in the fourth quarter of last year. With regard to adjusted EBITDA margins, looking forward in 2022, the margin favorability we saw in the first quarter will be absorbed and balanced downward over the remaining quarters of 2022, with expected increases in operating expenses related to execution of business development initiatives that will drive future revenue growth, as well as increased supply chain costs driven by higher energy costs, as well as inflation. Thanks for the question, David. Thanks for the question, David. Given the fact that we've had strong double-digit growth of established brands, 2/3 of our overall company in the first quarter, that I want to temper that, because of the fact that there was again some very favorable onetime events, but we see some headwinds coming over in the next -- in the second half of the year that we expected, we planned for, things like volume-based procurement around 7 round 8, Things like, for example, pricing for Atozet, our second biggest product in Europe."
}