{
    "symbol": "OGN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:04:10",
    "content": " Now, turning to Slide 6, revenue for the third quarter was approximately $1.6 billion, down 1% as reported, but up 5% at constant currency when compared to the second quarter of last year. And FX represented about 500 basis points of headwind for the quarter, which is not really surprising given the fluctuations in the global currency markets and the composition of our business, with approximately 80% of our revenues derived outside the United States during the second quarter. The infliximab market continues to grow and biosimilar adoption for infliximab also continues to grow with biosimilars now representing close to 40% of the infliximab market share in the U.S. ONTRUZANT was up 61%, driven by continued uptake in the United States since its launch in July 2020 as well as the timing of a government contract in Brazil that hit the second quarter this year compared with the third quarter of last year. In the second half of the year, we expect that we will see impact from next rounds of VBP in China, but still with minimal LOE risk expected until we see a generic entrant for DULERA, together with the strong performance year-to-date, we now expect that revenue for established brands will be flattish for full year 2022 at constant currency. Making these straightforward adjustments, the second quarter of 2022 non-GAAP adjusted gross profit was $1.047 billion on revenues of $1.585 billion, representing a gross margin of 66.1%, up from 65.6% in the second quarter of last year. SG&A costs were modestly higher in the second quarter of 2022 compared with prior year, primarily due to standing up Organon as an independent company as well as commercial expenses associated with business development transactions completed in the last year. Our goal is to construct a suitably sized portfolio of these longer-term pipeline projects to enable Organon to sustain attractive revenue growth well beyond the 5-year planning horizon, when we need to be launching new products that can more than offset any revenue declines we might see related to NEXPLANONâ\u0080\u0099s LOE. Operationally, the business is performing as we expected, and we believe Biosimilars and Womenâ\u0080\u0099s Health should deliver solid growth in 2022, paired with a revenue trajectory within Established Brands thatâ\u0080\u0099s meaningfully better than we expected prior to the start of the year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}