{
    "symbol": "HAYW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 16:10:05",
    "content": " For the full year 2023, we expect net sales to reduce approximately 18% to 22% and adjusted EBITDA of $265 million to $285 million. Net sales in the fourth quarter reduced 27% year-over-year to $259 million, largely due to lower volumes related to channel inventory movements and softer conditions in certain markets, especially Europe and Canada. For the full year 2022, net sales reduced 6% to $1.3 billion with adjusted EBITDA of $368 million, each consistent with our guidance. In addition, we expect to deliver structural SG&A savings of approximately 10% on an annual basis or $25 million to $30 million in 2023. Selling, general and administrative expenses during the fourth quarter were consistent with the prior year period at $60.5 million, representing 23% of net sales. Adjusted EPS in the quarter was $0.11, fully diluted share count has decreased 25 million shares or approximately 10% of shares outstanding, primarily the result of the share repurchases completed during the first 3 quarters of 2022. SG&A expenses for the year declined 7% and to $249 million, driven by lower discretionary and volume-based expenses plus the initial benefits of our cost reduction program. North America net sales for the fourth quarter declined 27% to $216.8 million, driven by 38% lower volumes, partially offset by 9% favorable price impact and 2% contribution from acquisitions. North America net sales declined 5% to $1.1 billion, driven by 21% lower volumes, partially offset by a 15% of favorable price impact and 2% contribution from acquisitions. Net sales for the full year decreased 15% to $205.3 million, benefiting from a net favorable pricing increase of approximately 8%, but adversely impacted by a 17% decline in volumes and a 6% headwind from unfavorable foreign currency translation. So I think importantly, we saw the need for some channel destock and reduction of days on hand, we got after that in the second half of the year and got to really where we were expecting, which was getting back to year-end 2019 levels which was, as you know, the last pre-pandemic. I mean, typically, when we think about a year -- if we go back pre-pandemic and look at the preceding 5 or 6 years, our first half was about 48% of the full year and second half, 52%. I think to be pragmatic, looking into 2023 with some of the inflationary concerns, I think it's wise for us to kind of look at that 50% or so, that is very resilient and just say that as we get into the fourth quarter of this year, I think people have the ability to maybe defer some of the maintenance or maybe not fully upgrade to the current version and maybe do more of a like-for-like depending upon what their discretionary income looks like at that point in time."
}