{
    "symbol": "SRTS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 09:23:11",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Sensus Healthcare 1Q 2022 Financial Results Conference Call. Joining me from Sensus Healthcare are Joe Sardano, Chairman and Chief Executive Officer; Michael Sardano, President and General Counsel and Javier Rampolla, Chief Financial Officer. As a reminder, some of the matters that will be discussed during today's call contain forward-looking statements within the meaning of federal securities laws. All statements other than historical facts that address activities Sensus Healthcare assumes, plans, expects, believes, intends or anticipates or other similar expressions will, should or may occur in the future are forward-looking statements. Sensus Healthcare undertakes no obligation to update or revise any forward-looking statements, except as required by law. All forward-looking statements are subject to risks and uncertainties, including the continuation and severity of the COVID-19 pandemic and its impact on sales and marketing as described in the Company's Forms 10-K and 10-Q. During today's call, there will also be reference to certain non-GAAP financial measures. Sensus believes these measures provide useful information for investors, yet should not be considered as a substitute for GAAP nor should they be viewed as a substitute for operating results determined in accordance with GAAP. I'm delighted once again to be reporting excellent quarterly financial results with revenues of $10.3 million, which is more than three times last year's Q1 revenues. In addition, we earned $0.20 a share from continuing operations compared with a loss of $0.07 last year. As you all know during the worst of the COVID-19 outbreak, we did everything we could to support our customers providing PPE leads on scarce medicines and continued educational programs via Zoom regarding the use of SRT in treating non-melanoma skin cancer and keloids during the pandemic. Recall that CMS reimbursement code for delivery of superficial radiation therapy, along with other codes associated with SRT were revalued upward effective January of 2021, while codes for Mohs surgery were revalued downwards. During Q1, we shipped 33 total units, 26 SRTs including one to China and seven TransDermal Infusion Systems, which I'll talk about in more detail shortly. We have continued to see growing patient volumes at customer sites in part, because SRT became so much more prominent during the pandemic while surgeries were kept to a minimum. During the first quarter, we continue to sharpen our focus on our core dermatology market. And in March, we sold a non-core asset for $15 million cash. We now have the strongest balance sheet in the history of the company, with $32.8 million in cash and equivalents and no debt as of March 31, 2022. Our Board of Directors approved a $3 million share repurchase program that we intend to deploy thoughtfully, and in the best interest of our stockholders. We will also utilize our cash to add to our product portfolio, as we continue to search for unique technologies that will expand our footprint in the dermatology space contributing to our profitability and bottom line. With a view toward adding product to serve our customers, recall that in December, we entered into an exclusive US distribution agreement, for a non-invasive drug delivery system. This system is cleared by the US FDA for local administration of ionic drug solutions into the body, for medical purchases and can be used as an alternative to injections offering patient treatments, with no pain, no needles and no downtime. We were delighted to highlight this system for non-invasive drug delivery for skin rejuvenation treatments, pre-laser treatments, pre and post plastic surgery at the Winter Clinical in Hawaii in January and at the American Academy of Dermatology Conference in Boston in March. Dr. Glynis Ablon, a key opinion-leading dermatologist with the Ablon Skin Institute and Research Center in Los Angeles, and associate clinical professor at UCLA is, studying the delivery of PRP with our transdermal system. We believe her work will validate the system's excellent utility for this hair restoration indication, and we are pleased to be working with the physician of her caliber and look forward to the results of our study. Additionally, Dr. Mark Nestor, Director of Cosmetic Enhancement Center for Clinical and Cosmetic Research in Aventura Florida, recently presented an abstract outlining the efficacy of utilizing transdermal infusion for subjects with axillary hyperhidrosis, which are for excessive sweat glands. We also featured our SRT systems at the AAD conference, where we continued to highlight SRT's impact on treating non-melanoma skin cancer and keloids, as well as the fair market value leasing program, I just mentioned. In addition, we have some marketing initiatives that we will be active – with we will be active in May in conjunction with the Skin Cancer Awareness Month. Turning to international markets, we delivered one SRT unit to China, which is as you know solid market for us, especially for the use of SRT in the prevention of keloids. On another note, we're very excited to announce that Sensus was given regulatory approval to treat non-melanoma skin cancer and keloids with SRT in Taiwan. I also want to mention that, during the first quarter, we hired nine sales representatives, returning our sales organization to pre-pandemic levels, plus two service engineers, and a clinical application specialist. We will continue to hire throughout the remainder of the year, to support sales and marketing and customer service, as we continue to expand our footprint. We continue to be confident in our sales and earnings trajectory, as supported by a robust organization, excellent products backed by rigorous research and creative methods of financing and a committed management team. Before I turn the call over to Javier to review our financial results, I want to emphasize, how pleased I am with our financial performance and just as important with the dedication of our staff. Notwithstanding, the geopolitical and financial turmoil that abounds and noting our usual seasonality, we're very much aware of the threats of inflation wars pandemics. As Joe mentioned, revenues for the first quarter of 2022 were $10.3 million, and this compares with revenues of $3.1 million for the first quarter of 2021, which was impacted by the COVID-19 pandemic. Revenues for the 2022 quarter, reflects the sale of 33 units, 26 SRT systems, including one SRT-100 systems shipped to China, and seven Transdermal Infusion Systems, as well as revenue from service contract, and our mobile laser business. The increases were primarily driven by the higher number of units sold in 2022, service revenue on installed units and the impact of COVID-19 on the 2021 quarter. Note, that the net income includes a gain on the sale of a non-core asset of $12.8 million, which is recorded as other income on the P&L, and which translate to $0.77. Adjusted EBITDA which we define as earnings before interest, taxes, depreciation, amortization and stock compensation expense was a positive $16.9 million for the 2022 first quarter compared with a negative $0.8 million for the first quarter of last year. Cash and investments were $32.8 million as of March 31, 2022 compared with $14.5 million as of December 31, 2021. The company had no outstanding borrowings under its revolving line of credit as of March 31, 2022 or December 31, 2021. As Joe mentioned, during the first quarter our Board of Directors authorized a $3 million share repurchase program. While we continue to place utmost attention on expense management, the recent cash infusion from the sale of the non-core assets plus the ability to access our revolving line of credit put Sensus in the strongest financial position in the company's history. As a final comment, please see that table in the news release we issued earlier today for a reconciliation of GAAP to non-GAAP financial measures. Our SRT systems are well-positioned in a large market consisting of some 14,000 dermatologists, 1,000 Mohs surgeons in the US representing more than 7,500 offices not to mention a further 6,500 plastic surgeons and 5,500 radiation oncologists. Before we open the call for questions, I want to mention that we'll be presenting at the H.C. Wainwright Global Investment Conference being held in Miami Beach, May 23 to 25 and will be available for one-on-one meetings. First of all, congrats on the great quarter. First of all, I think that all of the above has contributed to the overall results that we've seen. So it's a combination of increased reimbursement, better fair market value lease which lowers the monthly commitment that the doctors have to come up with which provides them with a much better ROI on their investments. And along those lines when your sales reps are entering dermatology practices, how many of them are aware of the reimbursement change now, or I guess what I'm trying to eke out is how much more greenfield opportunity is there for you guys to spread the news. Well, I think every one of our salespeople have been thoroughly trained on what this all means for them and their customers, and of course, this is their livelihood. So I think we're getting better and better at educating the doctors and teaching them about fair market value lease, because that's very new to them. So as we get more people in the field and as we talk to more people and as we go to more trade shows, I think we're going to see more excitement and more results. And then as you've expanded your reach here and continue to within the dermatology practices, any more additional color on what you could give for other products that you're looking to add maybe some verticals or what you think is a really nice tuck-in potentially. Well, I think the targets that we're looking at are all going to be something that we can put in the briefcase of every one of our salespeople and still talk to the same decision maker. Well, as we made -- as we stated, seven of the units that were shipped in the first quarter were transdermal units. And then of course, those units were placed pretty much with very key KOLs, so that we can establish a good base for the product in the market space. So it's very, very strategic in how we're bringing it to the market. We're going with the doctors who can provide us with a lot of data, a lot of feedback, and a lot of information and not just for us, but for the rest of the market regarding the indications and the use of the equipment. So as that continues to grow, I think, that the product will continue to grow and the fact that it's a very low cost effective type of product that can generate a lot of revenue for our doctors, I think, that it bodes well for volume sales in the future. Obviously, it's another strong quarter. Joe, I guess, just following up on the Transdermal System, and then I had a question about the two conferences AAD and ASLMS. And our selling price we're looking at around $35,000 -- $32,000 to $35,000 for the product. And then AAD in Boston and then the American Society for Laser Medicine and Surgery in San Diego, can you talk about -- obviously, those were in-person. Well, first of all for us, it was a thrill to get back to meetings to be in-person after two years of absence and doing everything on Zoom. And the dermatology community is a very welcoming community, it's a very small community in spite of the 14,000, 15,000 dermatologists that are involved. I can tell you that 100% of the customers that came to visit us, weren't coming to us to complain about anything. They were looking at buying second and third units, and they were genuinely interested in the well-being of the company and we were happy to see them as well. And to get to your point also, Anthony on the Transdermal piece, I think everybody was interested in the Transdermal piece. Right across the board with this product, you're eliminating the use of needles and therefore you're eliminating the use -- or the pain part of it. The ones that get in there sooner are going to expand their business very, very well. And then just lastly on the new hires, the seven sales reps, the two service engineers, the clinical specialists. I could tell you there was probably seven of the nine that happened in the first quarter, two extra service engineers and another applications person for clinical training and things like that all happened in the first quarter. So in closing, I want to thank you once again for your time this afternoon and for your interest in Sensus Healthcare."
}