{
    "symbol": "TNK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 13:27:16",
    "content": " In the tanker market, spot rates have been very strong through the fourth quarter and first quarter to date, with Aframax and Suezmax rates outperforming all other tanker sectors, as the midsize segment has been the primary beneficiaries of increased ton mile demand from the EU ban on Russian crude oil imports. Average first quarter-to-date rates, in particular driven by Aframax size vessels, have improved further from the very strong levels of the fourth quarter based on approximately 69% and 57% of revenue days booked, Teekay Tankers' first quarter-to-date, Suezmax and Aframax size vessel bookings have averaged approximately $50,600 per day and $67,600 per day, respectively. Throughout 2022, our focus has been on strengthening our financial position and creating equity value for TNK shareholders, generating $318 million of free cash flow in 2022 enabled us to reduce our net debt by 41% to $345 million, bringing our net debt to cap down to 24% at the end of 2022. For every $5,000 per day increase in spot rates above this level, the company is expected to generate approximately $90 million, or $2.60 per share in annual free cash flow. While this is not a projection of future rates, to illustrate this point, if fourth quarter spot rates were to be sustained throughout 2023, we would expect to generate approximately $20 per share of free cash flow for an annualized free cash flow yield of over 50% based on our closing share price yesterday. For example, when we last significantly increased our in-charters in anticipation of a strong spot market in 2015, our 11 in-charter tankers generated $44 million of incremental free cash flow in just one year. There's a similar dynamic playing out now for our in-chartered vessels generated $20 million of incremental free cash flow in the fourth quarter alone, and our current eight tanker in-charter portfolio has a mark-to-market value of approximately $60 million. In summary, the spot market for midsized tankers has remained exceptionally strong, and the combination of structural shifts in the global crude flows, a record low order book that is essentially capped through the medium term, and multiple drivers of demand growth are conditions supportive of a strong market for some time, even in the face of potential macroeconomic headwinds. If I just look at this chart you put on, on Slide 9 and not even having to extrapolate beyond, whatever, 40 days from now, that first quarter-to-date average rate free cash flow equivalent for the quarter, your net debt at $345 million would be cut by more than half just by March 31."
}