{
    "symbol": "GPK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 16:18:06",
    "content": " Your line is open. And really, it's all about, as I said in my prepared remarks, look, we're attacking this market differently with our new product innovation, the products that we have, focused on plastic substitution around the margin and we've been profiling a number of those different examples on our calls over the last couple of years. Your line is open. Your line is open. I mean, the part of that we really liked is simplified build structure, six, well capitalized, low cost high-quality mills and the substrates that we need driving towards 90% vertical integration between our organic growth and just kind of some additional growth that we anticipate that we'll see here over that time. Your line is open. I mean, I think we're just being prudent to, if you look back over the last two years, we've seen hundreds of millions of dollars of inflation come at the business in short order at times. Your line is open. So we always have said, Adam, that we want to have the ability to have leverage the full and different optionality and growing our global spend to the point now where we're buying a $1 million tons of paperboard, creates a situation where we can pull a lot of different levers that allow us to optimize our core and continue to have to buy on the outside as we grow our converting business both organically and with strategic M&A. Your line is open. And so looking at the project from that perspective, maybe the return potential is really $90 million from the cost saves that you'd be getting because you could have already gotten that growth with Middletown. Your line is open. And so there are certain things obviously we would take a look at, but it's going to have a really, really high bar, given the other priorities that we've got in front of us and the ability to really improve our EBITDA through our own actions over the next two to three years. Your line is open. Your line is open. I think, look, if you think about that, and I appreciate the question, we really take a look at that 1 million tons we buy as make versus buy and that calculus will change over time based on freight and other things that go into that around some of the places we purchase the paperboard around the globe, particularly if we want to optimize our mill network, which we'll be able to do once we're done here with this Waco investment."
}