{
    "symbol": "CHPT",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-08 00:20:03",
    "content": " My name is Heena, and I will be your coordinator -- conference operator for today’s call. At this time, I would like to welcome everyone to the ChargePoint Third Quarter Fiscal 2022 Earnings Conference Call and Webcast. After the speakers’ remarks, there’ll be a question-and-answer session. I would like to turn the call over to Patrick Hamer, ChargePoint’s Vice President of Capital Markets and Investor Relations. With me on today’s call are Pasquale Romano, our Chief Executive Officer; and Rex Jackson, our Chief Financial Officer. We would like to remind you that during this conference call, management will be making forward-looking statements, including our fiscal fourth quarter and full year 2022 outlook and our expected investment and growth initiatives. For a more detailed description of certain factors that could cause actual results to differ, please refer to our Form 10-Q filed with the SEC on September 10, 2021, and our earnings release posted today on our website and filed with the SEC on Form 8-K. Also, please note that we use certain non-GAAP financial measures on this call, which we reconcile to GAAP financial measures for the current quarter in our earnings release and for historical periods in our investor presentation posted on the Investors section of our website. And finally, we’ll be posting the transcript of our call to our Investor Relations website under the quarterly results section. And with that, I’ll turn it over to Pasquale. I’ll provide a business update, including details of our strong Q3 execution against plan before turning it over to Rex for financials. According to BloombergNEF, as many as 2.9 million electric vehicles are expected to be sold across North America and Europe this year, an increase of approximately 67% from 2020. Our strong financial performance throughout this year is the result of investments in a product and go-to-market strategy we have made over many years to be able to capture associated demand across commercial, fleet and residential verticals in both North America and Europe. First, we added more commercial and fleet customers in Q3 than any other quarter in the company’s history. I’ll remind you we acquired ViriCiti, a leading eBus and commercial vehicle management provider and we also announced the expansion of our partnership with WEX, a leading fleet payment solutions company. Third, consistent with our prior calls and as you can see in our earnings release, we report revenue along three lines, networked charging systems, subscriptions and other. Q3 revenue was $65 million, up 79% year-over-year at the high end of our previously announced guidance range of $60 million to $65 million and up 16% sequentially. Networked charging systems at $48 million was 73% of total revenue for the quarter, consistent with Q2 and grew 111% year-over-year and 16% sequentially. As I mentioned last quarter, the delta in growth rates between networked charging systems and subscription revenue as a function of two main factors, mix and time lag. Second, for most of our solutions, we began revenue for subscriptions at a fixed time after the associated hardware shipments to accommodate installations, using a time lag of at least a quarter. Our deferred revenue from subscriptions, representing recurring revenue from existing customer commitments and payments grew nicely finishing the quarter at over $120 million. Other revenue at $4 million, a 6% of total revenue increased 37% year-on-year and 30% sequentially as driver activity and associated credits picked up during the quarter. Turning to verticals, as you know, we look at verticals from a billing perspective, which approximates the revenue split, Billings by vertical for Q3, for commercial 69%, fleet 16%, residential 13% and other 2%, reflecting outperformance in both fleet and residential. From a geographic perspective, Q3 revenue from North America was 89% and Europe was 11%, representing a slight percentage gain in European contribution, driven by both organic growth and acquisition contributions. In the third quarter, our European business delivered $7 million in total revenue, almost tripling from last year’s third quarter and up 41% sequentially. Turning to gross margin, non-GAAP gross margin for Q3 was 27%, a 4-point improvement over Q2, reflecting continued improvements in our cost of goods sold and positive margin contribution from our European acquisitions. Of the $28 million of stock-based compensation in the second quarter, approximately $14 million was attributable to services performed prior to the second quarter and included grants to employees who join the company during the preceding 12 months, as well as incentive awards to key personnel in both cases delay, while the company executed SPAC transaction. In Q3 the revenue contribution from the acquisitions was approximately $2 million comprised of subscription, hardware and other, reflecting the fact that we own these assets for only a portion of Q3. Looking at cash, we finished the quarter with approximately $366 million, down from $618 million at the end of Q2, reflecting cash spent on operations and $210 million paid for acquisitions in the quarter. For fiscal Q4, we expect total revenue of $73 million to $78 million at midpoint an increase of 78% versus Q4 of last year and a sequential increase of over 16%. For the fiscal year, we’re taking our revenue guidance up from $225 million to $235 million to $235 million to $240 million at the new midpoint representing a 62% increase year-on-year. And with that, it concludes our prepared remarks and we’ll turn it over to Q&A. Just -- the first one, Pat, I think you had mentioned that, you expect to see the federal stimulus to more meaningful manifest in 2023. We may see some of the back half of the year, it’s hard to predict. And in terms of how much money is going to flow actually in that year versus subsequent years is, right now it’s too hard to call. I’m not trying to be evasive is this if you look at the, I will give you an example, the VW Appendix D program that was implemented in an analogous way, it was money that flew -- flowed from the Federal Government on the federal portion of the settlement anyway to all states but California, California had its own settlement carve out. The sum total of money, like I said, we don’t expect to be the next year. I also want to draw your attention to one other thing is that the budget reconciliation and other associated conversations about where the government is trying to generate stimulus in other areas for EV charging, that could have faster effects. But again, it’s too hard to pin that down right now. So in previous quarters, we’ve reported, it’s similar or analogous to a backlog number associated with kind of the sum total of approved utility programs that are running in the United States. I got a question in terms of what the programs are out there that’s available, because that’s how I heard the question. But in terms of total programs, it’s in the hundreds of millions of dollars. So, first of all that the OpEx number is a broad base number, because we’re investing heavily in sales, marketing, obviously, we’re a newly public company. As you may have seen, we had a big fleet announcement several months ago and that’s just a huge watershed event for the company. There’s a huge amount of energy that goes into what we see is one of our greatest differentiators, which is, of course, the software platform. So there’s a big, big push right now, and obviously, since we play in all verticals in both North America and Europe and we see that the time is now from an industry perspective, we’re really putting our shoulder to it. I can’t give you a number, obviously, because it’s learning yet, but I think we should see some steady leverage next year that I think you guys to be happy about. So as you -- if you do the math, you can tell that the hardware, you get back into the hardware number by just looking at the overall math, but one you can talk to the other. We’ve recently, over the last couple years made enormous progress in Europe and we’re not putting a ceiling on that. We’ve done two acquisitions in very different industries, one is targeted at expanding, consolidating customers, as well as extending functionality in a fleet space that was ViriCiti, one that you saw, and then has to be is in the center of the commercial business in Europe. And in -- with respect to inorganic versus organic growth, we’ll be intelligent that we obviously will evaluate opportunities as they present. But I don’t think it’s necessary to have an all inorganic strategy to gain market share, its early innings in the EV market in general. Early enough and we have strength that’s broad based with respect to our product portfolio and position where in our modular and we are in every vertical that we can think of in both continents, so there’s a tremendous amount of leverage there that we have. And with that said, if there’s an opportunity that presents itself like that has to be like ViriCiti and it has team, it has tech and it has customers that are aligned with our business model, we’d certainly looked at it, so would be very interesting products. And then for my next one more of a theoretical question around site owner’s decisions between Level 2 and Level 3 charging especially in places with like shorter visit times, like grocery stores, malls, parks, et cetera. Early conversations we’re having, I think, there’s some split opinions on what the preference may be for future EV drivers. So I’m just -- I’m curious, what are your conversations been like, with new site owners deciding which route to go with and if any existing Level 2 customers are looking to expand but with a DC solution. So, one point by the way of fact, it’s not an opinion. When you make the switch to electric drive, a depot is not your primary fuel anymore, meaning you don’t wait till the little yellow lights on, go drive somewhere fill up in the hall. That doesn’t happen, especially if you have access to charging it home or work or both or street side parking. This is -- we’ve seen these driver patterns kind of dominate how people behave, they’re always corner cases where people, certain percentages of the population don’t conform, but they usually have outlier reasons for not conforming. In fact, it’s actually matching the natural parking duration and how much energy is expected to be reloaded in that day. So if you’re going to the grocery store near your house, you’re not trying to show your tank or your battery, you’re not trying to do that. You’re trying to avail yourself of some convenience miles you may pick up as an amenity, buy a grocery store. Now, if you pulled off the highway and you’re on your way to a weekend holiday and you happen to pick a grocery store to stop it, because it had a fast charger, you’re doing that because you want to make an essentially a refueling stop. The average shopper doesn’t want to use a fast charger, if they’re in their local area. So it’s -- and I’m not talking down one or the other, it’s about matching it correctly. And if you don’t match it correctly, let’s say, you’re at that grocery store, if you don’t match it correctly, you’re very expensive utilization mistake of the total construction cost and equipment cost versus the number of parking spaces and customers you can serve. It’s a, I got a real problem, because I really made a massive mistake. Because you’re going to, if you plug in around town and you’re just topping up, you are a fast charger is such an expensive proposition for that use case and consumed so much electrical capacity for that use case that you’ve made a mistake. But if you’re well positioned to serve highway drivers as they’re going out of there, beyond the battery range, having a mix on your grocery store site between L2 for your local customers and fast for your long distance customers makes a whole lot of sense. So what we do is we consult with customers to try to help them understand how to allocate the right strength for the likely use cases that are going to present in the parking lot, because the number of parking spaces you can electrify with the electrical capacity and the cost of one fast charger is pretty significant on the LP, if you’re primarily serving local clientele. So that -- this is just some of the coloring and it’s so much different than putting gas stations up, it just has no relationship to that legacy market at all. I mean, I’ll give you generalities, because we’re not coming to the typical specifics. But in both acquisitions, we’re newer to the has to be and frankly in ViriCiti one, because it’s earlier innings, because that closed a couple months past one ViriCiti one did. But on both, we’re making good progress on integration. On the fleet side, we’re already co-selling. And we are -- we have customers that, like I said, we’ve done some customer consolidation and we’ve had customers that have used ViriCiti for different functionality from and had our charging solution and ViriCiti vehicle solution. And where that’s the case, we are already moving the ball down the field to integrate the two solutions. With that said, it’ll take some time to get things integrated in an orderly way. We are in earlier innings, would have to be, but we’ve already got some customers activity going on, where 1 plus 1 is already equaling 3, where we can bring additional functionality, either to their customer base or ours, vice versa. As you’ve seen, we turned in upside results now over several quarters. And if you can, when -- if you can imagine how hard that is in a supply chain constrained environment, because obviously, we’re laying forecasts into our supply chain, either under -- even under normal circumstances with significant percentage of a year’s worth of visibility that because that’s just what you need to do, especially as you’re scaling. Rex, first of all, I believe in your prepared remarks, you commented that, correct me if I’m wrong, it was about a 2-point -- the supply chain issues resulted in about a 2-point penalty and gross margin relative to what we could have turned in. Maybe just kind of back to the supply chain, can you give us a sense of how much visibility you have to -- into fulfilling orders over the next several quarters and maybe just any thoughts around or commentary around inventory that’s on hand currently? But in terms of visibility, it’s not so much visibility that’s -- visibility into supply chain that causes us many other companies say the same thing. Now there’s a bit of -- there’s not a bit, there’s quite a bit of preplanning going on there where we’re scrambling to multiple sources wherever possible on parts that we forecast is possibly being problematic. But our communication to supply chain, the firm orders that we’re placing into supply chains for product, et cetera are well out this year, well out into next year. Our inventory actually, like I said this last quarter, I keep wanting it to go up because it’s the spot supply chain challenges. So -- but I will just tell you, if we can build inventory going forward, we will, we just haven’t done that yet. And Gabe, that’s not weakness, that’s just continued upside materializing. But nonetheless, it’s a -- it’s on the good side of the problem balance sheet. …I mean, our bank, because it’s kind of odd to have a CFO say, hey, let’s increase our inventory level. So if you’re trying to ramp the business and you got supply chain challenges you’re trying to make, building the inventories as fast as it’s a smart thing to do. …Gabe where the modularity of the platform is, I know all the platforms that we ship is really coming into play, because we have a lot -- we drive a very broad set of use cases on the hardware side of the product line with very few skews or very few internal parts that we have to make. It may show up as different orderable part numbers, but that’s largely just configuration at the end. Architecturally the product line is not without its challenges in a supply chain constrained environment, but it’s better than most. And you saw the competition with another announcement today, VP making acquisitions, but could you maybe just give us a little bit of color on conversations, whether it’s here in the U.S. and Europe, and just generally our demand and -- is stemming from the fleet channel and how you expect that to progress over the next couple quarters? I mean, it’s coming at us from all sides, and again, in a good way. The comment though, I would say in our opinion, we think we have the most wholesome broad based software solution in that space, especially with the addition of ViriCiti, because now we’ve even ripped up the food chain on the vehicle side and remember, also full service provider with respect to the ability to add design, build, consultancy, and project management, help with utility infrastructure on the sides with respect to consultation there. I mentioned on a previous earnings call the one example of that is we’re seeing a lot of fleets that have a take-home components to parking operations and refueling operations, not refueling in the traditional sense, but with electricity, wanting to reimburse the contractor that is taking the vehicle home. So because we’re operating in those verticals naturally, in especially in Europe that develop solutions for lease codes that are providing both company cars and leasing services to commercial fleets. And we are -- as Rex mentioned on the R&D side, we’re piling a tremendous amount of R&D into that on a continuous basis, so we’re not stopping with the functionality that we have. And I think that, obviously, we’re going to continue to battle that a bit, as you look forward. But I would just tell you, what’s important is to understand that there was demand in the quarter little bit is big enough number that worth mentioning it. And it wasn’t a massive number, but it was a meaningful enough number that pushed us well above the high end of a range. And then in terms of the drivers of the revenue increase versus the plan that you guys laid out last quarter, sounds like momentum across the Board. It’s -- as we said earlier, as Pat said earlier, it is broad based across the three verticals. So superb performance from home even though that’s not any revenue number, relatively speaking, because it’s a fairly inexpensive product relative to our other products, we’ve seen really good performance from our CPE250, which is our DC products and then we’ve seen workplace do, okay, relative to what we think you should be doing once we get out of COVID. So it isn’t like, I wouldn’t say, there’s anything moving left or right. Let’s go...\n Hi, James. I think, I mean, I think, it’s pretty basic. What I would love to do is say, hey, we’re taking -- we’re having -- I think we are gaining share, but at that -- there was a -- relative to a couple years ago no share to gain, because there were limited vehicles. And when there aren’t vehicles shipping in volume for manufacturers and you’re limited the pilot level program sizes, just isn’t that meaningful. And if you remember some of the comments I’ve made in previous earnings calls, I pointed out that the revenue in fleet is not proportional to the opportunity that we’ve seized, because as we develop pilots and submit our relationship with our fleet customers, obviously, based on earning that trust, as they expand they will expand with us. So the challenge is, it’s an incredible from an OpEx perspective relative to money returned in the period, it’s an -- it’s certainly in the investment category, not the kind of run rate category, so to speak. And we are doing a ton of work and we -- if you look at the size of our business, the OpEx that we’re able to deploy, because of the size of our business, it is in our opinion a huge differentiation on a go forward basis, because we can afford, frankly, to do the work. We can afford that mode, because we have a commercial business that’s healthy. So they’re obviously getting the signals from the OEMs and we all know about all the models that are coming out and about to hit the next 12 months, 18 months. I think most any information that I know that isn’t perfect , I couldn’t say. If you just look at -- if you look at public announcements, in terms of, flip over points where the majority of auto manufacturers lines will be electric, you’re looking in your brands shooting for somewhere between depending on the brand that 25, I think, that’s a bit aggressive. But by 2030 or the early 2030s, you’re seeing most commit to being substantively full electrified. And we’re seeing the dealers respond to those OEM programs substantially and we think that especially it’s geographically broad based, it is not in the usual hotspots for EV. It is geographically much more broad based, not perfectly broad based, but much more broad based, that is a very good indicator that auto OEMs are communicating to dealers that get ready since that’s coming. It’s hard to say whether growth is going to eclipse seasonality or not and shift some of the usual trends around, it’s just hard to say, normally that we’ve seen seasonality in the business relative more to construction cycles in northern hemisphere. So normally has a deep winter construction cycle slowdown in some areas, but you got so much growth going on now, it’s hard to predict how much it’s going to get offset. And so in terms of mix, I’ll caution you on something revenue mix and unit volume mix are very different, because of the while price point differences between the residential business inclusive of multifamily and then the commercial and then the fleet business. So what that bodes for is a very challenging segment in fleet to reconcile unit volume even within the segment or vertical, it’s very difficult to match unit volume to revenue, especially in early innings where averages have not stabilized. Overall, I believe Rex correct me if I’m wrong, but I believe residential was 13% of our billings this past…\n Correct. We’ve actually seen here in the last few weeks The California Energy Commission, as well as The California Air Resources Board announced some pretty significant dollars over the next few years, $1.4 billion total plan, $1.1 billion in new money of which a big chunk of that is spent for charging infrastructure. So, I mean, we’ve got a lot of experience with this issue. CEC moves relatively quickly, as you said, relative to other programs, because it’s not specific to the Federal Infrastructure Bill, the bulk of the money has to flow to states and then states of design programs. So you get this inherent two tier cascade where the CEC doesn’t have that two tier cascade, it’s a very large state that already has a very large EV population and it’s been operating with significant EV programs for a lot of years. And so, it’s hard to call how much of that is going to flow again to us. It hasn’t -- it was not in any of our models, because we don’t put something into a model until we can count on. But remember, the customer’s initial buys usually a fraction of their ongoing buys and you have a lot of time over the life of that customer to mature and evolve the product they need to buy today, so if they buy a product today that’s under say supply chain pressure. Well, you want that customer anyway, because most of the products they’re going to buy is going to be well past when all of this clears. But we could or would want to engineer backwards or forwards and the fact that our mix has been consist -- fairly consistent Q2, Q3 and will probably be consist -- I think consistent in Q4, just means we -- we’re and we have demand is more than what we can meet, we are meeting demand as best we can. Just --we are and by the way, we have got the inventory coming backwards, we’re effectively flat. But we’re -- anyway the difference is so slight, it doesn’t really matter. But we are chasing a very, very strong demand level across our business and we’re meeting it as little as we can. So we don’t have big open holes anywhere, but we would expect that to continue at some level, but thus far we’re managing it, our team has done a great job. First, when you look at your opportunity in Europe, any sense how we should think about sort of relative growth rates in Europe over the next couple of years versus the U.S. market? But also, you think the European business grows at about the same rate as your U.S. operations or do you think it’s materially different based on sort of the maturity of the market and product lines? I don’t think it’s, the product lines aren’t substantively different between the two markets. There are some differences in some areas, but they’re not substantively in the long-term different. We’ve got some startup conditions in our business in Europe but we’re having with ourselves out of yet, but that’s process. So I actually think fundamentally the early -- the -- in the next few years, just because of the regulatory and the policy environment in Europe, you will -- you’re likely to see higher percentages of electrification of new car sales than you will in the United States and now own and lease out over time. I’ll remind you of an interesting stat that almost no one, everyone says I had, when I say that no one realizes it upfront. In terms of our business, we should acquire market share faster in Europe then we’re acquiring market share in the U.S., because the market share is already so high in U.S. And so by definition, we should be acquiring market share, and therefore, I will also point out something else. On the other side of the software -- of our software, it’s a much higher percentage in the U.S. It’s not 100%. But it’s much higher in the U.S, and therefore, the average, when you look at the ports under management and you try to equate that to revenue, it’s a little bit lower in the early days in Europe, because not 100% of the customers on our hardware or not an equivalent percentage on our hardware. And then just the other quick one for me and I -- you mentioned on the call, so the similar one quarter lag on subscriptions, just based on the time from installation. There’s -- so there’s a one quarter lag and then the other factor, when you look at hardware, sorry, networked solutions versus our subscription revenue is, you get a very different outcome on a percentage basis something and what you said, right? So if you’re selling a home unit that has lower percentage software content than a commercial unit, on a percentage basis and then in our DC line, the equipment itself is sufficiently expensive, that again, relative to that number, software is the smaller percentage, so mix can really bang the percentages for subscriptions around. I’d actually really enjoy your insights into when we’ll be returning to work-for-home, kidding. Rex, if you want to, one, the jest there is around -- it’s a difficult predictive environment for us in terms of return to work. So what we’re doing, but what I’ll point out is that the growth rate in the overall industry, the just the sheer volume of cars that have entered the market, while workplaces certainly not on a total, on a proportional basis, hasn’t returned to its previous levels, because there’s not as much utilization pressure work. So the only thing I would add is, if you look at our Q4 guide, the assumption that’s built into that is that workplace doesn’t come back in Q4 in a big way, because if you’re looking at all the things that are going on out there, even got updates today, it’s really hard to think that people are going to be back the office by the end of January. Philosophically whenever there’s doubt, we take a conservative stance in how we think about it, because that’s safe. And as Rex said, we’ll bill as much inventory as humanly possible, because right now there’s -- it’s not possible to over bill, it’s just not, especially with our limited scrap risk and obsolescence risk. So we’ll bill as much inventory as possible should things come out on the positive side either that -- via early onset of stimulus money, early retreated COVID, what have you, if we get surprised to the upside, awesome. Are you seeing any shift to more of a push model in the sense that a lot of companies are certainly focused on ESG metrics sustainability, where maybe there’s some offsetting impact where there -- the demand is going up regardless of kind of what the utilization is at the moment. So what that would, I’m sure there’s some of that, frankly, because all companies are turning their attention to making sure that they have the right posture with respect to supporting electric cars much fun transportation, which supports the climate goals will have. What I’ll point out, which I think is significant is that, early buys from a company just moving into electric vehicle charging tend to be small. But I bet you it’s in there, I just can’t quantify it. I don’t, I think, there’s a, it’s hard to call the build ahead, because we’re so close to the waves that hit us anytime, they’re hitting it now. What’s also happening, I’ll point this out as is, there is actually construction happening during COVID, because it’s an opportune time to do construction and remodeling of office space, because it’s unoccupied or lightly occupied. In fact, we’re seeing that being relatively strong on the construction side. So, first of all, I want to thank everyone for the questions and I want to welcome all the new folks that have asked questions that haven’t -- hadn’t participated in our earnings calls interactively before the family really good to have you all, wonderful questions today. And I want to just sum up again, as I said, last quarter’s remarks, I really want to thank the ChargePoint team. I think you’ve heard a lot of commentary around how much work it’s been for this team to manage to the upside and what has been a dynamic environment with respect to supply chain, and frankly, the market materializing to the upside, which has been a wonderful thing for our employees. So thanks guys for doing all the good work that you do and we’re very, very, very excited about what the future holds for all of us collectively as an industry and company and our investors. The broad base support that we’ve seen in our -- in the market for all verticals, here all verticals and then you’ve got the car showing up and we’ve always said that we’re sort of analogous to an index to the electrification and mobility because as cars come, we’ve been so attached to cars, light-duty trucks, et cetera, heavy-duty vehicles."
}