{
    "symbol": "STN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 13:45:18",
    "content": " While we still expect growth from infrastructure spending to be more heavily weighted toward the second half of this year, we're already delivering organic revenue growth from spending directed towards new healthcare facilities, public transit, and other infrastructure renewal and capacity expansion projects. We're pleased to have delivered organic growth across all of our U.S. business units this quarter, particularly after a year of organic retraction, the roughly 4% organic growth was bolstered by 13% acquisition growth for an overall net revenue increase of 17%. And we're seeing continued robust momentum in our buildings business, where major public projects in healthcare, as well as syndicate education sectors continue to drive growth. And as we said in the prepared remarks, we haven't really seen it, Jacob, that projects dropping off -- we're always chatting with our clients and as we mentioned, we have had a number of cases where our clients have asked us to value engineer -- to go in and look at the design of a building or a facility and are there ways that we could bring it in less expensively; if there is a supply chain shortage of a particular type of material, can we change up that material, and so on. So we see that once we're in with these clients, just that continued refreshment of work in -- certainly in good times, but even when times are a little tougher, we still see some of that great debt maintenance work that is ongoing. We're working with firms that want to be part of something bigger than what they were in and that's kind of always been our perspective is that we're looking for firms that have gotten to a certain size and then want to join a strategic like us to get better back-office support, to get better opportunities for their clients, to their employees and better services. So while the backlog is trending upwards, we're -- at this point, we're not concerned with our ability to deliver and that's something we talk about with our groups every day because we don't want to take work if we can't deliver it because that's not positive for us or our clients in the long run. So it does that broad mix we're not we're quite pleased with where sorry, I still call it gross margin, where that sits and expect that will be able to maintain the level that we're at through the opportunities available to us through a really I think I a heightened focus on pursuing higher-margin work and just continued discipline around how we're pricing drove margin and then delivering on it. But I think you're exactly right the U.S. was a little bit slower up the gate for us in 2021, but we're seeing that wave beginning to come here in Q1 of this year and we see continued strengthening for the rest of the year."
}