{
    "symbol": "WNC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 20:24:07",
    "content": "  Operator: Hello, and welcome to Wabash Second Quarter 2022 Earnings Call. I'd also like to point out that our earnings release, the slide presentation supplementing today's call and any non-GAAP reconciliations are available at our investor site at onewabash.com. We have a strong quarter and outlook to discuss, but I'd like to start by recapping the investor meeting we held on May 19 to reiterate our strategy, growth goals and financial targets. I believe our organization is now ideally designed to execute on our base business, while leveraging growth initiatives across cold chain, e-commerce and logistics disruption and parts and services. By 2025, we anticipate revenue of $3 billion, operating EBITDA margin of 11% and earnings per share of $3.50. One exciting update, I'd like to spend some time on today relates to our parts and service initiatives. We've previously spoken about how trailer pools and power-only offerings are eliminating waste from the transportation ecosystem, not only by using trailers to optimize drivers time, but also to allow trailer drop and hook operations to permeate much deeper into the fragmented ends of the carrier space. Our partners at FreightVana are efficiently connecting shippers with carriers utilizing drop trailers, and they expect to meaningfully scale this offering as their business continues to grow. Between increased volumes and improved pricing, revenue increased over 40% from the same quarter last year to an all-time record of 643 million. Profitability also continued to sequentially strengthen as we began shipping 2022 backlog, which recovers cost increases experienced during 2021. As pleased as we are with the second quarter, we still see opportunities to even better in the second half of the year and beyond. Supply shortages persist in the industrial sector, although industrial production and durable goods demand remains strong. That said, the reality that we have at the present is that we have seen no cancellations within our order backlog, and we are experiencing strong 2023 quote/demand and very productive 2023 demand discussions with our strategic customers, which has allowed us to open our 2023 order book. Just to tie a couple of things together here, I believe that there are a few different factors combining to create a less cyclical environment for our business, under any sort of impending economic stress. First, as we have covered in the discussion of power-only and the expanding use of larger truck, trailers are being used in new and interesting ways in order to create efficiencies in the transportation, logistics and distribution industries. Additionally, we're coming off with 2 solid years of constraints across the transportation equipment complex, which is fresh in the minds of equipment users. Even if overall consumer spending does pull back, the long-term trend on e-commerce is well established and has shown the ability to maintain and even continue expanding through economic uncertainty. And finally, let me reiterate that we showed in 2020 Wabash's capability of managing through significant cyclicality, and we have only improved that capability over the past 2 years. We will continue to closely monitor the economy, and I think it's important for the investment community to more fully understand the unique and secular demand environment, we see before us by looking beyond the traditional measures and headlines and more of what Wabash is creating in terms of strategic portfolio management and moves to capture the benefits of a change in logistics landscape. As a reminder, the trailer industry has a strong seasonal pattern of ordering activity in which OEM backlogs filled during the second half of the calendar year, then burn off in the first 2 calendar quarters. As such, the fact that our backlog remains flat at $2.3 billion from Q1 to Q2 is a purposeful outcome, we're very pleased with. Given our in-line Q2 results and the visibility provided by our strong backlog, we are comfortable maintaining our 2022 EPS outlook of $1.90. In closing, we're excited to have the opportunity to fully articulate our strategy, growth initiatives and updated financial targets at our May Investor Meeting. We continue to work on increasing recurring revenue through our parts and service business, with trailers as a service being another tangible example of how we can engage with the marketplace differently to capture more of the value that our products create for the transportation, logistics and distribution ecosystem. More immediately, I'm pleased that with our execution so far in 2022 and look forward to updating you on our early thoughts of 2023 as those figures come in sharper focus over the next 1 to 2 quarters. Consolidated second quarter revenue was $643 million with new trailer and truck body shipments of approximately 13,670 and 3,970 units, respectively. And as Brett mentioned, this helped us achieve record quarterly revenue during the second quarter. Gross margin was 12.1% of sales during the quarter, while operating margin came in at 5.6%. Finally, for the quarter, net income attributable to common stockholders was $22.6 million or $0.46 per diluted share. From a segment perspective, Transportation Solutions generated revenue of $596 million and operating income of $48 million. Year-to-date, operating cash flow was $83 million. We achieved a meaningful release of working capital during the second quarter, driven by a reduction in accounts receivable, while payables were higher. Our second quarter operating cash result, combined with CapEx equates to over $100 million of free cash flow generated during the second quarter. Our target for 2022 capital spending remains between $80 million and $90 million, as we remain on track with our strategic capacity expansion and the conversion of our Lafayatte-based South plant from reefer capacity to dry van capacity. Even with our increased growth CapEx budget, we expect to generate over $75 million of free cash flow in 2022. With regard to our balance sheet, our liquidity or cash plus available borrowings as of June 30 was $298 million with $138 million of cash and cash equivalents, and approximately $160 million of availability on our revolving credit facility. With regard to capital allocation during the second quarter, we invested $12 million of capital projects, utilized $5 million to repurchase shares and paid our quarterly dividend of $4 million. Through the first half of the year, we have executed our expected revenue and margin improvement, and we remain on track for financial performance to continue to step up into the second half. Given that our second quarter performance was in line with our expectations, we are pleased to maintain our guidance for 2022. Full year 2022 operating margins are expected to be approximately 6% at the midpoint, and we continue to believe that progress towards our 11% EBITDA margin goal will be evident relatively early in our journey to reach our 2025 financial targets. Relatedly, what item I'd like to call out is that we modified our long-term incentive plan to add an ROIC component in this year's proxy disclosure. In conclusion, I believe we show an excellent progress in the second quarter. As Brent mentioned at the offset, we were pleased to have the opportunity to tell our strategic story at our May investor meeting and having spoken with multiple investors during the second quarter, I was excited by the more strategic nature of our conversation following an update on our growth initiatives and financial targets. I believe we set an interesting juncture in the company's history, a time highlighted by the combination of ample near-term opportunities and the right long-term strategies and initiatives, all against a backdrop of share valuation that discounted Wabash of a bygone era. Being fully mindful of potential near-term economic uncertainty, I believe in the last few years have highlighted a couple of things. First, our ability to rapidly respond to changing market conditions and produce meaningfully positive free cash flow during a time of economic volatility. Second, the substantial demand for transportation equipment that can be created by short periods of uncertainty, resulting in the balloon-in a pent-up demand, which is still working its way through the system in 2020. We are strong believers on our 2022 and longer-term outlook, and we look forward to sharing more with you as we continue making progress on our strategy. Generally, I think in our implied guidance of $2.5 billion for the year, you would expect roughly a flattish delivery guide for Q3 and Q4 versus what we just delivered in Q2. Sequentially up, to 18%, which is the largest sequential increase that we've seen from -- during the COVID period, so -- post-COVID period. So I think that's a good testament to what we -- we're in a level now, we believe that we can now have good visibility to deliver those same levels in the second half of the year. Then you go into 2023, obviously, we've got our capacity switch out from reefer to dry at our South plant Lafayette campus coming online, which we've guided to roughly 10,000 units gross take out the 4 or 5 of the reefers. And I think if you put those together, you get a really nice view as to what can be some pretty strong EPS generating quarters in 2023 with the run rate we're delivering right now, plus the capacity that are somewhere. I would add just a little bit more color far from guidance, let me stress far from guidance. But if you think about relatively flat shipping levels coming off of Q2 for the remainder of the year, capacity continuing to shore up of the given capacity that we have, which will somewhat ramp all year from a production standpoint, we should be sitting at a decent finished goods level at the end of the year. And you can imagine that the jumping off point in the first quarter will be improved from the first quarter of 2022, but it's still generally lower shipping quarter of the year. And then you can think about Q2 between having a decent finished goods, a good production rate in the first quarter, right, jumping off of to the fourth and then starting to see the impact of surge, you get a feel for what will be happening from a flow-through in the first half and then that all flows through in the third and fourth quarter of 2023. And Brent, I wanted to circle back to some comments you made earlier in the call around trailer pools, obviously, seeing a lot of momentum and discussion on that topic. And that's one of the things we're finding as we talk to all the players, we'll call it traditional truckload that are moving into digital brokerage and then you move to the other extreme of the continuum where you've got truly innovative digital brokers really focused on power only, i.e., FreightVana, on the other end, there are different ways to answer that question. But if I take the full continuum, J.B. Hunt and everyone else, I would say, from a trailer shipment standpoint, you're roughly looking at 10% to 15% of what we do could be classified moving into some type of trailer pool application, the largest being J.B. Hunt at this point. And then there are some other smaller emerging players FreightVana being one of them that will pick up more in the second half of the year, and then we'll increase that a little bit more going into 2023. What I would say is that we say it this way, we've been successful in 2022, passing along an appropriate level of inflationary cost, cost increases with margin into the backlog so far. And I would say that you can take from the backlog increase that we've done, we've met our expectations and our ability to pass along pricing at an acceptable level. You continue to suggest that you've got a nice balance to the margin trend in 2023, given your long-term outlook and still kind of somewhere half way on the margin front. First, I mean, obviously, with the addition of surge, the ability to absorb overhead throughout not only 2023, but in the second half of 2022 is a margin tailwind as we continue to ramp the business. Two, as we reach the end of 2022, we'll be at the tail-end of the additional manpower that we generally have to add throughout the business. And those 2 things will be done with the efficiency curve for the most part as we enter 2022 -- I'm sorry, second quarter of 2023, and we'll be able to start pulling back from some of the overtime that we use right now to buffer that. The last one, I would say it really comes to play in the second and third quarter of '23, is that the workforce that we'll be moving to surge is an already multiyear experienced trailer building workforce. And then there's a whole host of initiatives inside the business, but we'll buffer that accordingly. And one of the big one that's in there is the -- we would expect to get better chassis flow in 2023, which should help the truck body product line be just an accretive initiative for us next year. And obviously, we're doing a big -- our implied guidance has a pretty nice step up in the second half of '23 versus first half '23, so where a lot of heavy lift at year end obviously will kick in. Clearly, your business is doing quite well, got great backlog, probably several to come. I would say this, I think the overall trailer and freight-related industries are going to have nice demand tailwinds going into '23, that are going to buffer us all significantly. And if we see generally a greater availability of labor in the market, that is going to dramatically help the overall extended supply chain, specifically for our industry. It just adds to the -- or it would subtract from the noise that we have, which would relate or translate into some level of labor and through the efficiency through the back. I guess I'd be curious -- as you look to your 2025 numbers, are you seem more confident now then when you first announce them. And our general One Wabash initiative we believe will allow us to be resilient if there is a economic pullback in the '23, '24 and still be able to maintain the '25 targets. So that the '25 targets are based on kind of mid-cycle level volumes, but we feel pretty good that we can maintain and be able to. And I'd say as long as we are able to maintain a healthy clip purposeful capital deployment, which we've laid out in '23 and '24, then we'll set the stage for '25 from a business enablement standpoint, couple that with the continuation of moving the portfolio to the appropriate strategic spot and then the internal work we do with digitization and the work with parts and service. There's nothing that says that even if there is a lull, even a moderate lull in between that we aren't in a position to execute the '25. I was hoping to start, Brent, I think in the beginning, you talked about starting to take 2023 orders. So we have -- I won't go into all the particulars Felix because that's somewhat proprietary in how we are doing this, it is different than the rest. What we are doing is feeding it with very core strategic indirect channel business as we try to make sure that we have a dealer first mentality, and those are very -- what I want to say, very specific inside of the indirect channel, won't say more than that. When we go to next year, that is the working at a handful of customers that we think are well positioned for the next half decade. And those are discussions that are multiyear in design, multifaceted and they go beyond just trailer -- access to trailer capacity but also move into advanced R&D development as well as parts and service linkages as to what that value proposition is. And then we'll move into the next grouping of strategic customers that should round out the backlog for 2023, very specific across the entire creation of the '23 backlog. First, on the -- we're rebranding is the  refrigerated van with EcoNex technology. We continue to have better-than-expected results in the validation of that product with our customers with over 50 million miles on the road, well above 50 million at this point. We are moving forward with capacity additions, the next phase that will be a 2023-2024. I would say, at this moment, demand far exceeds what our initial capacity add will be as we look to maintain a level of scarcity and controlled launch, right, as we scale this up, one, to maintain premium pricing two, to make sure that the physical manufacturing process meets a premium product expectation. And that is something that we firmly believe that we'll have prototypes, and we'll call extended small volume prototype production in '23 to meet initial market validation needs with possibly the chance of beginning to scale up in the second half of '23 and '24. But Mike, you mentioned next year you would expect better chassis low, which should be margin accretive on the truck body book. But any update maybe versus what you expect on 1H versus 2H, would be helpful. We have a pretty full backlog in that product line, and we'll be able to fulfill the orders in half of the year and continue to step up the profitability. As soon as we get the chassis flow, we'll see some nice profitability come through by '23. That also continues to go well, and we'll be looking to broaden that into additional points of revenue in the future, both within Kroger and then modifications to the product design to allow it to be applicable to other users, that continues to go well. And then our traditional truck body like product that use EcoNex technology, we are also adding capacity there because we've had better-than-expected customer reviews there, which will help us grow within our cold chain area. As we get more and more users starting to understand the role efficiency within that space, very much like our van customers would see."
}