{
    "symbol": "IMAX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 23:38:03",
    "content": " In the second quarter, IMAX delivered strong year-over-year growth and global box office total revenue, gross margin and our trailing 12 month adjusted EBITDA is nearing $100 million. Across the last two years, weâ\u0080\u0099ve been unwavering in our belief that when people feel safe and content is in supply audiences will return to the movies and any lingering doubt among this captive are quickly evaporating as we drive record-breaking results at the IMAX Global box office affirm IMAX as a critical launch platform for major entertainment franchises and help blockbuster releases reestablish the dominance of the cultural conversation. Today Iâ\u0080\u0099d like to discuss the growth trends IMAX is seeing at the global box office and a strategic outlook for China, how IMAX is driving growth across all our global networks and content portfolio and our strategic effort to drive long-term growth by expanding the IMAX platform. For the first time in IMAX history, we delivered three consecutive $25 million plus global openings with Dr. Top Gun Maverick has been an unbelievable success, which has nearly doubled our initial projection and will top $100 million in global box office for IMAX. Your line is open. Your line is open. I mean, China has been closed for six months and we were back out of over 200 theaters in China and typically they, as you know, the backlog churns in about a three year period of time and in the first quarter, actually until May or June, there really wasnâ\u0080\u0099t a film slate and then the third thing Iâ\u0080\u0099d say about this year is that exhibition was just coming out of the COVID period. In terms of signings, again itâ\u0080\u0099s a very Asian, on the answer to that one, Michael, which is again they didnâ\u0080\u0099t open the year and said, well I know Top Gun is going to do over $1 billion is going to and I know Dr. As you agree, I mean, I think there would be a little bit cautious and say letâ\u0080\u0099s see how it opens, letâ\u0080\u0099s see how IMAX does. Your line is open. There is no question about that and however if you look at our increase in local language films and you look at other kinds of events that we are trying to do, documentaries we would try and make up as much as that as we possibly could and again, when you look back in 2020 and 2021, when China came out of the pandemic without Hollywood films, we actually did really well since in part of your question, but in Japan in the past when there were no Hollywood films we did about $1.5 million per screen average using local language films and filming events. I mentioned in my remarks and itâ\u0080\u0099s in the press release, for the third quarter, weâ\u0080\u0099ve all read a lot of headlines about there are not being a lot of movies available and big movies, but for IMAX we have 15 foreign language films, local language films in the third quarter and for IMAX we are doing special releases of GMR, Jaws and ET and we will have a number of live events in those places. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}