{
    "symbol": "IMAX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 22:01:04",
    "content": " We continue to drive momentum in technology, sales and licensing with recent agreements across key markets including China, and the Middle East and we are accelerating the diversification of our global content portfolio, particularly with local language films, which comprise 30% of our global box office in the third quarter and buoyed in otherwise saw film slate. Today Iâ\u0080\u0099d like to discuss our near-term blockbuster film slate and momentum in our network growth, our strong positioning with the opening of Avatar The Way of Water, how we are accelerating our local language strategy to strengthen and diversify our content portfolio and how w are expanding our technological capabilities and future growth opportunities with the acquisition of SSIMWAVE and then, Iâ\u0080\u0099ll turn it over to Natasha to take you through our results for the third quarter. Four of our top ten highest grossing local language Indian films of all times have come this year and even through many theaters in India were closed through March due to the Omnicronâ\u0080\u0099s surge, our box office there is well above what it was in 2019, a record year through three quarters. Third quarter 2022 revenues increased 21% to $69 million from $57 million in 2021, primarily driven by our technology network and technology sales businesses. A few unique items to call out, first, the strengthening of the U.S. dollar had an approximate $11 million negative impact on gross box office, which resulted in an approximate $2 million or 8% impact on technology network revenue and gross margins. Total gross box office was $177 million, an increase of 25% over last year's third quarter box office of $142 million. IMAX Technology Sales and Maintenance revenue for the third quarter increased to $33 million from $28 million in last year's third quarter, primarily driven by one additional system installation, the impact of amendments to existing theater arrangements and higher revenues from aftermarket sales. While not at full potential, box office this quarter was in line with the $41 million experienced in Q3 2021, driven by the success of local language titles, including Moon Man which is second in Greater China box office this year, only behind the Chinese New Year title Battle at Lake Changjin 2. And finally, we look forward to the fourth quarter and 2023, which feature IMAX-friendly titles, a content model that allows us to maximize theater utilization with local languages and live events and the growing tech portfolio that positions us to further diversify our revenue base over time."
}