{
    "symbol": "BANC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-19 15:43:03",
    "content": " For the full year, our tangible book value per share increased by more than 2% notwithstanding the impact of higher interest rates on AOCI, and the significant capital actions we took, including the completion of our $75 million stock repurchase program, our $24 million acquisition of DeepStack Technologies, and the repositioning of a portion of our securities portfolio this quarter that will contribute to our future earnings. Today, we have over $9 billion in assets with 40% non-interest bearing deposits, a slightly asset sensitive balance sheet with a healthy net interest margin, growing earnings, plenty of capital, a very safe credit portfolio of which approximately 65% is secured by residential real estate at low loan to values and we are located at the heart of the fifth largest economy in the world. And what we've said last quarter and the prior quarter was, as the economy contracts, we expect there to be outflows of liquidity, but we don't expect our mix to change very much because it's -- the economy is moving downward overall and that's what we're seeing in our book and that's what's been holding up. So we're going to try to keep growing our non-interest bearing percentage and our deposit beta is really -- it's not something we track very much honestly, Matthew, because it's an outflow. I think the only thing I would add is, I think you were looking at it relative to prior cycle and the trend of us being lower beta from the numbers that you provided is I think a result of the fact that our non-interest bearing deposits are a higher% of our deposit base or our funding base. It's a lot more work and -- but it's I think protected our overall deposit base and that's one of the reasons why we've grown out to the brokered market or even the whole -- the non-core market to get funding so that when we want to buy it in bulk, so we don't have to reprice groups of deposits here by providing that rate to everybody, because a lot of people aren't asking for it, believe it or not."
}