{
    "symbol": "GSL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 16:38:06",
    "content": " Recently, we completed the U.S. private placement of $350 million of privately rated investment grade debt, priced at 5.69% which consists of 2.84% at 3.2 years interpolate U.S. Treasury yield plus a margin of 2.85% and use the funds to fully redeem our 8% senior unsecured notes due 2024 as of July 2022. We're paying a highly sustainable quarterly dividend equating to $1.50 per share per year, and have also spent almost $15 million on share buybacks within the last 12 months. It's also a little bit academic, because the cash that we're generating is we're beginning to harvest from the acquisitions we made last year and from the charters but it's only really going to start to accumulate towards the back end of this year. When you look at the EBITDA calculator you have, even if you guys factor in the low-end or the 15 year time charter rates, you basically have free cash flow after debt repayments of more than $100 million this year, and more than $200 million free cash flow next year. Yes, and I would think that Moody's and really all people involved, whether they're lenders or equity investors, but also understand that I mean, I mean for every 10 million of stock you buy back at these prices, you are saving almost a million dollars on dividends, which isn't the same as interest because it's can always be canceled. Can you remind us that the $181 million of cash that's there, I know when we talked back in January and February, some of that was tied up onâ\u0080¦\n No, no, no, the $180 million that you actually see in our cash and cash equivalent balance sheet right now, it also includes a portion that have been already used in order to eliminate the 2024 no exposure around $92 million, you will find that in the subsequent events. So there's yes, so until some more of that cash flow comes in, there's just some room to buy back stock, I would think within that $90 million remaining, knowing that you had to set aside 10 or 20 for one of those longer-term contracts."
}