{
    "symbol": "ABM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-13 19:28:08",
    "content": " Despite the expected decline in high margin disinfection related work orders, significant wage inflation, rising interest rates, and a historically tough labor market, the ABM team delivered strong full-year EBITDA growth of 9.5% with an adjusted EBITDA margin of 6.6%. Adjusted EBITDA margin for the quarter was 6.8%, flat with last year, largely reflecting tight cost controls and price escalation, which largely offset the anticipated decline in higher margin disinfection services, as well as higher operating costs, particularly for labor. Aviation revenue increased 9.1% to $214.4 million, marking the sixth consecutive quarter of robust year-over-year revenue growth. Technical Solutions grew revenue 21.5% to $179.6 million, largely driven by continued strong growth in our e-mobility service offering, strong growth in mission critical markets, and from the recent RavenVolt acquisition. Interest expense was $16 million in the fourth quarter, up nearly $10 million over the prior year period and about $5 million sequentially from Q3, reflecting significantly higher interest rates, as well as the year-over-year increase to total debt by  . Please proceed with your question. Please proceed with your question. However, Aviation because we're still, you know if you think about the first couple of quarters of FY 2022 where we weren't still back to, kind of like pre-pandemic levels, as we now have been emerging to pre-pandemic levels and we lap those periods, you will see, kind of like outpaced growth in aviation as well. Please proceed with your question. Please proceed with your question. I would say, just based on what I've seen from some of the consensus, I think the biggest outline is really the interest and I think based on what we put out in the script where we're suggesting that our interest is going to be anywhere between $72 million to $74 million, which is a significant increase year-over-year. Please proceed with your question."
}