{
    "symbol": "ABM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-09 12:11:05",
    "content": " Third quarter revenue increased 27.1% to $2 billion, largely driven by acquisitions, continued recovery from the pandemic, especially in aviation; and solid demand for our janitorial and engineering services as well as strong growth in e-mobility. Adjusted EBITDA margin for the quarter was in line with our expectations of 6.6% versus 7.7% last year, largely reflecting the anticipated decline in work orders, which included higher-margin disinfection services as well as higher operating costs, particularly labor. Education operating profit was $14.5 million, down from $18 million in last year's third quarter, due to lower EnhancedClean revenue as well as higher wage costs, including overtime expenses, especially in less populated areas, which tend to have shallower pools of available permanent labor. Technical Solutions grew 9.3% to $158.4 million, largely driven by continued strong growth in our e-mobility service offering in which sales tripled from the third quarter of last year. Please proceed with your question. Please proceed with your question. And then just your last question as far as the impact that it actually has on revenues, again, much like we modeled, we knew that we were going to have a reduction in this mix of our revenue, but it really is being offset by new business wins as well as just what we're seeing as far as the modest recovery in the office buildings and the economy in general. Please proceed with your question. And I would just add, Tim, just in addition to that, if you think about our emerging e-mobility business, and a lot of the fact that you're going to be looking at a significant electrification of vehicles over the next several years, the infrastructure needed to do that and the power augmentation that's going to make, that's really the sweet spot of RavenVolt, really helping clients understand how they can actually augment their power to facilitate the infrastructure for EV mobility. Please proceed with your question. Well, look, I think it's clear, we're off to a super-fast start, right, between Able acquisition, which was $1 billion of revenue and then Momentum and now RavenVolt, we're out of the gates really strong. Please proceed with your question. Please proceed with your question. And the way I think about it and the way I would give you context on it, picture a 20,000-foot tenant that's spending $1 million on rent and they're on a B building, maybe they only need 10,000 feet now, but they're still happy to spend $1 million on rent. Please proceed with your question. Please proceed with your question."
}