{
    "symbol": "KD",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-03 11:23:04",
    "content": " For instance, for a long time European based telecommunications services customer we've begun a multi-year project to migrate from private cloud to a hyperscaler, ensuring a secure and resilient hybrid IT environment with a European based media company who's been a customer for more than a decade, we've expanded our scope of work to modernize this digital experience and ensure a seamless migration to Microsoft Azure and a multinational consumer goods company were implementing an automation platform with the hyperscaler. Exogenous factors impacted margins by more than 4 points year over year, and includes some software licenses being treated as a subscription rather than an amortized expense and asset sale gain and accrual reversal in last year's September quarter, a dilutive impact from IBM related pass throughs and revenue timing, higher energy costs and currency. Our game plan is to continue to serve our customers seamlessly and to deliver solid results even as we go through the three year process of transforming our business, preparing to return to sustained top line growth and positioning Kyndryl for stronger margins and higher returns on invested capital. In constant currency, we've increased our revenue growth projection by three points compared to when we started the year and our outlook for adjusted pretax margin is down a half point from the start of the year, solely due to higher energy costs. Other than the impacts of currency movements and higher energy costs, we're delivering on the fiscal 2023 earnings targets we laid out in May and we're executing on the strategies and initiatives that will drive longer term progress, future growth and stronger earnings in our business. Your line is open. Your line is open. So on the headwind side, the way we're focused on gross profit, which is good for us, it's good for the hardware and software provider as well, allows us to really drive gross profit dollar growth, but it is -- it could be a headwind to revenue, it could be a headwind to the signings number. Your line is open. Your line is open. Your line is open."
}