{
    "symbol": "T",
    "quarter": 4,
    "year": 2021,
    "date": "2022-01-26 12:15:20",
    "content": " Together, these and other asset monetizations will generate more than $50 billion, and AT&T shareholders will own 71% of one of the world's foremost media companies in the new Warner Bros. We also continue to generate meaningful levels of free cash flow, nearly $27 billion in 2021, a number we feel good about when looking at our business after the WarnerMedia transaction. We expect WarnerMedia's full year contributions when including Xandr to be: revenues in the $37 billion to $39 billion range, EBITDA in the $6 billion to $7 billion range and free cash flow contribution of approximately $3 billion as we expect 2022 to be the peak investment year for HBO Max. And I think typically, when we've looked at an air interface change, it's been an $8 billion-ish round number to kind of get through that transition over a number of years. And I don't want to take away anybody's thunder, but I think you should expect after we close the WarnerMedia Discovery transaction that you will see us maybe start to refine a little bit of the messaging around the brand moving forward in the market that will carry forward the kind of characteristics in a little bit more pointed fashion that we want to carry forward. I can't disclose a couple of the larger customers we've signed with yet at this point, but you're starting to see that combined fixed wireless converged networking that I think is going to be relevant in the upper part of the business space. When I talk about transformation and shutting down products and thinking about how we become a company that offers products on fiber, what's going on behind the scenes on that is actually backing away and moving deliberately through a process of taking products that served us incredibly well, that have been the mainstay of this company for a period of time and doing in a very, very smart and tactical way this shutdown and sunset of those. And Pascal, I guess I was a little surprised to see the $4 billion growth capital investment premium over CapEx because I think over most of the year, we've been talking about maybe weaning ourselves off of that number. And if you think about the growth internationally where that's going to be a large part of the growth moving forward, given the new markets we're opening up and the natural penetration that occurs, given the product is sized differently and starts from a different place, you're going to see that have an impact."
}