{
    "symbol": "FAST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-13 13:14:06",
    "content": " You've seen many locations where we either have reduced dollars or we don't have an open front door anymore because we've really morphed into more and more of a supply chain partner and more product that's going out the back door than ever before in markets where we have a larger construction presence or we have a meaningful walk-in business and the local team sees that as their means to serve the market, they might be open. I think part of what we did, obviously, the COVID period pushed everybody to abruptly change what they are doing and I think that the strength you see in our e-commerce sales growing north of 50% is a testament to the marketplace -- I don't know if the marketplace is reacting to what we're doing or we're reacting to what the marketplace is doing. And so as we've moved -- as more and more of our growth comes from the fact we're engaging deeper with customers and they're seeing the ability for us to help them in more ways than maybe they would have 5 and 10 years ago, it changed the footprint we needed. And we think we're doing a nice job keeping a lot of that business as, again, if you look at our increase in web sales because a lot of that business would go to the web sales that's growing at 50%. And then the deleveraging, obviously, of the trucking network -- because if we're driving a truck from Winona, Minnesota to Minneapolis to deliver to branches, and that truck has 10% -- is running full or it's running at 80%, the cost of the truck and the cost of the driver and the cost of the fuel going in, that is what the market is that day and you deleverage that network. And so I believe that there's a -- the reoccurring component of inventory is much higher than the reoccurring component of sales by the nature of our business, and I think that's the difference that you're seeing between the 2. We're selling product a disproportionate piece of our inventory that's sitting on the shelf is a product that has -- that we've decided over time because of the length of the supply chain and the nature of the supply chain, we're going to stack that ourselves. When I talk to our regional leaders, when I talk to our national comp sales leaders and I get the tone of what they are seeing from their customers, I don't think there's a customer they talk to that doesn't have as strong a backlog as they've ever had in their business. But there's a lot of -- if you think about what you see, we were down -- our transportation folks were at the rail yards in Chicago recently, really trying to -- we're always trying to figure out ways to streamline our supply chain. But over the last 3 to 5 months, a lot of the feedback that's come back from the Regional Vice Presidents in their commentary to me that they give me each month, each quarter, there's been many of them that have said that the lessons that were learned from the period you just came out of was that -- our customers are not supply chain managers, and they're looking for someone to bring that expertise into them. My follow-up question, I'll turn it over, is just -- I think maybe it was asked a few quarters ago, but anything you're hearing from your customers on reshoring manufacturing capacity back to the U.S. domestically? But I'll tell you that in my view, I think that that's sort of a long cycle thing that we're going to look back 10 years from now and say it happened or it didn't happen. And so I think what really changed in 2022 for us that move the numbers was all of a sudden, this young person who's going to college somewhere or going to a tech college somewhere, they're now 6 months into, hey, I'm a college -- they haven't kicked me out and sent me home to my parents. Because in this environment, there's a lot of times business is shut down on different days of the week because it just doesn't -- if they only have 300 hours of work or 1,000 hours of work this week, they're going to put it in the point that it's most useful for the employee and for the employer and their market."
}