{
    "symbol": "OCC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-22 12:27:04",
    "content": " Specifically, we delivered double-digit percentage growth in net sales and gross profit, the highest gross profit margin of any quarter of fiscal 2022, and net income of $1.2 million or $0.15 a share. We delivered net sales growth year-over-year during every quarter of fiscal year 2022 and ended fiscal year 2022 with net sales of $20.1 million during the fourth quarter, an increase of 26.3% compared to the fourth quarter of fiscal year 2021. The team achieved gross profit of $20.5 million for fiscal year 2022, an increase of 26% compared to the prior year. SG&A expenses as a percentage of net sales were 28.9% during fiscal year 2022, down from 30.8% during fiscal year 2021 and were 25.9% during the fourth quarter of fiscal year 2022. Consolidated net sales for fiscal 2022 increased 16.8% to $69.1 million compared to net sales of $59.1 million for fiscal year 2021. Consolidated net sales for the fourth quarter of fiscal 2022 increased 26.3% to $20.1 million compared to net sales of $15.9 million for the same period last year. We experienced an increase in net sales in both the enterprise and specialty markets, including the wireless carrier market during the fourth quarter and fiscal year 2022 compared to the same periods last year. Gross profit increased 31% to $6.6 million in the fourth quarter of fiscal 2022 compared to gross profit of $5.1 million for the same period last year. Gross profit margins during fiscal year 2022 were impacted by increases in production labor and material costs, offset by necessary prospective price increases on new sales orders for many of our products. This operating leverage, which is beneficial at higher sales levels, positively impacted our gross profit margins in both the fourth quarter and fiscal year 2022. SG&A expenses increased to $5.2 million during the fourth quarter of fiscal 2022 compared to $4.8 million for the same period last year. Our recorded net income of $1.2 million or $0.15 per basic and diluted share for the fourth quarter of fiscal 2022 compared to a net loss of $6,000 or no cents per basic and diluted share for the fourth quarter of fiscal 2021."
}