{
    "symbol": "OTEX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-04 00:06:07",
    "content": " By bringing together Carbonite, Webroot, Zix and Cloud  plus our strategic relationship with the most important endpoint company on the planet Microsoft, we’re able to offer the industry’s most complete total protection and security platform to RMMs and to 23,000 MSPs direct from OpenText. We expect adjusted EBITDA margin percentage to be down 450 basis points to 500 basis points due to higher investments in talent and continued support of our growth ambitions, Zix’s acquisitions and typical calendar year reset of higher benefits expense. For full year fiscal 2022, we’re increasing our cloud revenue growth outlook from 1% to 2% to a range of 3% to 4% and our cloud revenue growth from 3% to 4% to a range of 8% to 10%. Our fiscal 2022 Cloud growth at 8% to 10% includes the Zix’s acquisition, we expect to grow Cloud organically both in reported and constant currency in fiscal ‘22 despite the Q3 FX headwind and where we sit today, we expect FX headwinds in Q4 as well. Setting FX aside, as I said earlier, we saw the strongest booking growth in our enterprise cloud bookings during the first half and along with our expanding hyper scale of relationships, Carbonite and Zix’s acquisition, we expect cloud to continue to drive our future organic growth aspirations. Moving to adjusted EBITDA margin, we now expect our fiscal ‘22 adjusted EBITDA margin to be in the range of 35.5% to 36.5% reflecting the integration of Zix’s and internal investments to support growth initiatives. Yes, Paul, thank you for the question and good to hear from you. So this doesn’t sort of discount the totality of the efforts that goes into the business did what emphasize that financial reporting, we will be recording on a net revenue basis, all in Zix revenues goes in as part of cloud and gross margin is in the low 80s. Yes, Paul, thank you for the question and good to hear from you."
}