{
    "symbol": "GOLF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 15:02:07",
    "content": " For the fourth quarter, revenues were up 14% to $447 million as Titleist golf clubs, gear and golf balls all grew double-digits. Starting with our Q4 results on Slide 10, consolidated net sales were $447 million, up 6% reported and up 14% level FX versus 2021. Gross profit for the fourth quarter was $224 million, up $19 million or 9% versus the prior year, and gross margins were 50% up 140 basis points. SG&A expense in Q4 was $196 million, down $13 million or 6% and R&D expense was $14 million, down $2 million or 10% compared to the prior year. Net loss income attributable to Acushnet Holdings was up $26 million compared to 2021 and adjusted EBITDA was $25 million, up $30 million from the prior year. Consolidated net sales for the year were $2.27 billion, up $122 million or 6% on a reported basis compared to a record 2021. Gross profit was $1.18 billion, up $61 million or 5% and gross margins were 51.9%, down 20 basis points from the prior year despite higher sales volume and higher ASPs in many product categories primarily as a result of higher inbound freight, the negative impact of currency and higher input costs. Net income attributable to Acushnet Holdings was $199 million, up $20 million and adjusted EBITDA was $338 million, up $10 million or 3% compared to 2021. Once we are running the business internally, we would expect initial annual Club Glove branded product sales to be under $20 million and for EBITDA to be accretive. In December, we paid our previously announced Q4 dividend, which increased our total dividends paid for the year to $52 million, up 6% compared to 2021. During the fourth quarter, we repurchased about 1.1 million shares of our common stock for approximately $51 million, bringing our full-year repurchases to just over 4 million shares for a total of $191 million. Taking these factors into consideration, we expect our full-year 2023 consolidated net sales to be in the range of $2.325 billion to $2.375 billion up 3.5% on a reported basis at the midpoint. On a constant currency basis, consolidated net sales are expected to be up between 5% and 7.2%, and we expect full-year adjusted EBITDA to be in the range of $345 million to $365 million, up 5% compared to 2022 at the midpoint. Operator, next question please. Operator, next question please. Operator, next question please."
}