{
    "symbol": "ICAD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 20:00:09",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to the iCAD, Inc. First Quarter 2022, Earnings Call. Before turning the call over to Stacey, I would like to remind everyone that we will be making forward-looking statements on the call today. These forward-looking statements are based on iCAD's, current expectations, and are subject to uncertainty and changes in circumstances. I will begin with some high-level comments on our first-quarter results and then provide additional granularity around the current business environment and key areas of focus for the company, for the rest of 2022. On behalf of the Board of Directors and our entire management team, I would like to thank Mike for his contributions as Chairman of the Board over the past three years. And we're excited to welcome Tim as he offers tremendous insight and decades of relevant experience in corporate leadership and health technologies, along with a proven track record of leading innovation and strategic change. With a robust portfolio of world-leading differentiated solutions in large under-penetrated markets in the detection segment, and the expansion of Xoft in promising applications such as the treatment of brain tumors in the cancer therapy segment, our team has been laying the foundation for a path to continued success this year. We plan to continue to leverage the strength of our robust portfolio of powerful solutions in 2022 and beyond by expanding access to the technologies in our existing portfolio, aggressively targeting broader market opportunities and offering more flexible ways for our technologies to meet customer needs. Based on what the team accomplished in Q1, I believe that we have the right plans and the right team in place to successfully execute our strategic vision and elevate the company and our technologies to new heights. Although the global pandemic continued to present challenges in the earlier part of Q1, we are thankfully beginning to return to a more normal environment as COVID -related restrictions are beginning to loosen in many areas around the globe. From a supply side perspective, we proactively took a number of steps, starting last year and continuing into Q1, to reduce the potential for supply chain disruption. While this resulted in higher-than-anticipated cash burn, we believe it was prudent to establish an inventory cushion to protect against component shortages and inflationary price increases, and we believe we're now well-positioned to weather any potential short-term disruption that may come the rest of the year. Moving forward in 2022, we plan to burn substantially less cash in the subsequent quarters, and we have developed plans for a range of scenarios that should allow us to conserve and ultimately generate cash in 2023. Taking a closer look at Q1, iCAD's total revenue was $7.52 million. This is on track with the expected trajectory we previously laid out, and is a particularly encouraging result given continued COVID headwinds early in the quarter, and the fact that we were simultaneously overhauling our commercial infrastructure to position the company for long-term success. Overall, our Q1 results provide a solid foundation to build on for 2022, and I would like to express my sincere gratitude to our hard working and dedicated teams for their laser-focus and execution in achieving these results. Looking at the Detection business, the key aspects of our plan, are to increase our penetration of the broader available market and to better address the needs of the emerging enterprise-level customers. As a result, we have worked diligently to adjust our sales motion and have made great progress in enhancing our commercial infrastructure with new and highly successful sales personnel in key territories across the U.S. In Q1, we saw continued positive momentum in our goal to further penetrate the broader available market. Some of these customers have been and we'll share their experiences using ProFound AI, and our new ProFound insights, profound impact Webinar Series, which we recently launched and will run through the rest of the year. As expected, our sales force with skill sets and relationships are proving to be a key element that is enabling us to successfully reach new customers. For example, in Q1, our team solidified an enterprise deal with one of the largest world renowned academic research institutions with multiple locations throughout the U.S., as well as several other key contracts with high-profile facilities across the country and worldwide. We are pleased with the early success we're seeing, and excited by what we can accomplish moving forward. As mentioned on the last call, we began testing a subscription model in Q1 for some customers who prefer the operational expense approach due to budget constraints. Historically, the purchasing model in the detection business has been a capital investment decision and a perpetual software license purchase, but we have learned that some customers may prefer a more flexible payment plan. The subscription model allows the segment of our customers the ability to acquire our technology when capital budget is not available, and also begins to build an install base that we believe will generate long-term recurring revenue for the company. While there is growing customer interest for this model, we still expect it to be a small percentage of our overall revenue in 2022, and we continue to lead with a capital model. We believe that this first-in-kind technology, not only has the potential to change the landscape of breast cancer screening, and also that short-term personalized risk assessment should become the standard of care for women. We look forward to seeing research presented from some of these studies at upcoming tradeshows in Q2, including the International Workshop on Breast Imaging, which will take place in Belgium later this month, and the European Congress of Radiology, which will take place in Vienna this July. While we are proud to report that we have a growing number of early adopters of this technology, we expect that the additional clinical data will make the use of ProFound AI Risk even more compelling for clinicians working to improve breast cancer screening outcomes. In addition, we are exploring various product and pricing combinations that could help drive adoption of this capability moving forward, including a bundled pricing model, where all of our breast AI technologies can be adopted together as a premium package. Revenue in the therapy segment fell short of our expectations due primarily to a restructuring of one of our dermatology partners who is presently positioning itself to go after the derm opportunity in a more accelerated fashion, including adding additional sales resources on their end. We fully expect this segment to rebound considerably in Q2, and expect our U.S. dermatology business to continue to be the primary growth driver for Xoft in 2022. We are currently installing our first Xoft System for skin in Florida in Q2 with our partner, Derma Therapies and expect to convert several more new customers in this key market in the months ahead. We also have successfully on-boarded our west coast partner, DermaCure RT, and expect to see several more key placements in Q2 as a result of this strategic relationship. With the COVID restrictions beginning to lift in many areas earlier this year, I'm happy to report that we were able to attend multiple in-person trade shows in Q1 that have stimulated are already growing pipeline of dermatology prospects. Additionally, we continue to advance the GLIOX trial, our multinational clinical study examining the use of intra -operative radiation therapy with the Xoft System for the treatment of recurrent glioblastoma. Researchers have now treated five patients under GLIOX protocol to date at Providence St. John's, and we expect to have at least ten patients treated with Xoft Brain IORT by the end of Q2, while concurrently adding multiple new sites in both the U.S.. and global markets. For example, recently, doctors at Caceres University in Caceres, Spain have successfully treated multiple cases of recurrent glioblastoma with the Xoft system in preparation for beginning with GLIOX trial. This facility has also used Xoft eBx to treat patients with brain metastases, rectal cancer, and head and neck tumors. We're also encouraged to see more facilities, adding new indications for the Xoft system as it provides a practical solution that offers the potential to optimize treatment times and reduce side effects, which ultimately enhances patient care. Notably, this facility has been using the Xoft system for the treatment of breast and gynecological cancers for years, with now more than 700 breast cancers and 200 gynecological cancers treated today. Now looking at our international AI business, as noted earlier, we continue to see improvement in the selling environment, especially in the EU. We remain optimistic as we look ahead, as we believe we now have a stronger commercial infrastructure in place and a solid and growing pipeline to ensure the trajectory we are on will continue to position the organization for success and bring our world-leading portfolio of innovative solutions into the hands of more clinicians worldwide. I'll now summarize our financial results for the quarter ended March 31st, 2022. Total revenues for the quarter were $7.5 million, a decline of $1.1 million, or 13% from the first quarter of 2021. The detection segment revenue was $5.5 million, down 3.5% from last year. Within detection, first quarter '22 product revenue was $3.9 million versus a strong comparable first quarter of 2021 that was up 34% over the prior year. Product revenue declined year-over-year, largely due to lingering COVID-19 impact in early Q1 '22, causing access to decision-makers to be challenging, especially for large deals, and the restructuring of our commercial team in the United States. The therapy segment revenue was $2 million down $923,000 or 32% versus the first quarter of 2021. Therapy product revenue was $696,000 down 50% year-over-year against a very tough comp from last. As Stacey mentioned, the decrease is primarily due to a restructuring of one of our dermatology partners as they restructure and are focused on quickly growing their sales and support infrastructure. On a percentage of revenue basis, gross profit was 71.5% for the first quarter of '22 compared to 72.8% for the first quarter of 2021 with the reduction related to temporary lower average selling prices for certain Xoft supplies. n a pure dollar basis, gross profit for the quarter was $5.4 million as compared to $6.3 million last year, largely reflective of the reduction in revenues. Total operating expenses for the first quarter of 2022 were $8.9 million, a $1 million or 14% increase year-over-year. Operating expenses in '22 included a $300,000 increase in the reserve for doubtful accounts, reflecting the general global economic concerns and potential elevated risk to trade receivables. The company remains committed to managing operating expenses with a selective focus on spending to support current revenue target achievement and future revenue growth, while maintaining the clinical superiority of our technology. Operating loss was $3.5 million in the quarter ended March 31, 2022, versus $1.5 million in the quarter ended March 31, 2021. This year-over-year increase represents the change in operating loss offset by a $100,000 of interest expense in Q1 2021. Non-GAAP adjusted net loss for the quarter was $3.5 million or $0.14 per diluted share compared to $1.6 million or $0.07 per diluted share in Q1 2021, reflecting few adjustments to GAAP net loss in each period. As of March 31, 2022, the company had cash and cash equivalents at $29.8 million, compared to cash and cash equivalents of $34.3 million at March 31, 2021. As Stacey mentioned, iCAD is de -risking supply chain elongation by adding inventory. While we do not expect to see a similar uptick in inventory levels moving forward, we do believe maintaining this increased inventory level, will de -risk the supply chain for the remainder of '22. The COVID-19 related decrease in December 2021 sales, resulted in the lower accounts receivable balance, while Q1 2022 reflected iCAD's traditional money -- monthly pattern, with the majority of sales occurring in the third month, resulting in higher relative accounts receivable balance at the end of the quarter. Your line is live. I think Stacey, if I recall correctly, you had about a dozen salespeople on the detection side and I think there we're going to be about half kind of turning over there. Just curious as to where that stands if all the territories have been been filled, if there's anything that you're still kind of in need of resource-wise on that front and bigger picture. So I'm really pleased with the progress that we made in overhauling the commercial infrastructure during the quarter, we moved very fast. As you mentioned, we turned over about 40% of our US sales team, and I would characterize it as we're about one hire away from having the full team in place that we would like to ideally have. The new reps have all except for that one that we haven't filled yet, they have all been fully trained and they are already contributing revenue to our -- our pipeline of opportunity. Maybe dovetailing off of that, and you alluded to it without mentioning names, but as I understand, I think there was at least maybe one or two people that joined your organization from the leading 3D mammography OEM out there. When you bring somebody like that in, and I admit iCAD is hardly the first company to make a competitive  like that. But you have embarked, I think, more aggressively in the last few months on going after that OEM customer base, in terms of putting ProFound AI in over what type of competitive offering they might have. In terms of that kind of timing where you're going on more aggressively at that end-user base, how important and how helpful is it to have somebody or somebodies, plural, coming over from that other organization in terms of going out and targeting those people. And in fact, even during Q1, we even had an order that was going to that vendor kind of changed over to iCAD. And we've been very successful and being able to add an increasing rate, convince our customers to separate those two decisions and our pipeline of opportunity in that category has increased substantially. But I'm really pleased with the momentum and progress in terms of how our pipeline looks not only in terms of its overall growth, but the profile of it and the mix of mammography gantries that are represented within. Is Risk the same playbook in the sense that older Risk assessment models we're not that great, and maybe now you've got to reeducate or educate a new, that user base as to why exactly ProFound Risk is so much better. And I think when it comes to ProFound AI Risk, as we've said before, we're really leading a major paradigm shift from what historically has been an age-based screening paradigm in mammography to what we believe will become a risk-adjusted screening paradigm, precision screening, unique and individualized for each woman's unique risk profile. And we're certainly the only company that now is able to offer a short-term risk solution that can assess, with around 80% accuracy, which women are likely to develop breast cancer in the next year. The existing models, like you mention, are lifetime risk models that have a lot of challenges. They, number one, are not very accurate, they're about 50% or 60% accurate, and they're also not very actionable. And like we have said of all of our other products, we think the key to changing this paradigm is developing a very compelling body of clinical data. And so a lot of our effort in the first half of 2022 has been on collecting more data on larger, more diverse patient population to prove out the clinical performance. So we've made a significant investment in these clinical studies, but we believe that they serve as a foundation and are really the necessary factor to get widespread adoption. And we're pleased with the progress that we've made, the results that we're seeing so far. As I mentioned in the script, we're now sort of packaging. We're the only company that can uniquely pull together ProFound AI, ProFound Density and ProFound AI Risk into what really is a premium AI offering. Your line is live. I wanted to start with the -- I think Stacey, you mentioned a deal that was solidified in Q1. Some of the things that led to the success, whether that revenue is going to be recognized here in Q2 or has already been recognized. And then just generally, any comments on the capital purchasing environment certainly sounded like it was looking at bit rosier, but would love to hear some more details there. With regard to the environment, what I would say is that it's getting better with every month. Because we still find that our customers still have a lot of distractions, a lot of issues that they're dealing with in particular staffing shortages across-the-board. So it makes it still a little bit sometimes hard to predict the timing on some deals, but it's significantly better than it was. So we're optimistic and we're really glad to see our reps out and in their accounts again, both in the U.S. and in Europe. With respect to the large enterprise deal, so my first point that I will make about that is that, that is the imaging vendor who is in that account is predominantly made up of the vendor that is the leading Tomo provider. It's a little bit of a mixed labs, and the keys to closing that really where the clinical superiority that the customer found relative to ProFound AI. And the deployment of the technology across the enterprise was really to be able to provide all patients access to that same high-quality level of care that same cancer detection accuracy, reduction in false positives and reduced reading time. However, we do have a lot of service contract revenue and things that gets recognized ratably over time and technology protection-type programs. So there is more revenue to come on that, but a good chunk of it did get recognized in Q1. It was a very small percentage of our business really sort of immaterial, not enough to even reported out. And we expect that to grow over time, but still overall, the -- a small percentage of our overall revenue and in 2022, and once we decide that it is meaningful enough, in terms of our overall revenue, we certainly will be transparent about it and report a metric that will be easier to track, the timing of that is still unknown. But by offering them that flexible payment model, where they can pay over the course of a couple of years, a little bit more than a couple of years. So that's really going to be our strategy with every quarter, is to really try to make that subscription customer group be sort of incremental to our plan. We do expect it to grow over time and towards the end of the year, we may find ourselves in a situation where we have a higher percentage of that are subscription. But right now, it's small percentage of our business and that's how we see it for at least the next couple of quarters. Your line is live. That is the one that I was talking about that was a world-renowned academic research institution, a household name that everyone on this call would recognize. And we did -- it was deploying ProFound AI at a number of sites throughout the country, and we did recognize a sizable percentage of the revenue in Q1. But as I mentioned, there's some ongoing service revenue and technology protection-type revenue that we'll recognize in future quarters. And if so, is that academic institution becoming a one of , expanded focus for you guys or you already have that beforehand, but probably a little bit more effort going forward to pursue those opportunities. It's becoming a greater percentage of our overall opportunities, Yale. We are seeing larger either health systems or multi-site academic research institutions, larger customers who are recognizing that if you don't have the technology and all of the hospitals are affiliated centers, that there is an inequity in care for patients. We hear that over and over again where we might have started off a deal in one or two of the hospitals that are affiliated with the system, and the customer comes back to us and says, \"We don't want to offer women different access to care, \" and there is a clear clinical value in this product that's proven in clinical study. And again, they can take some more time to close, but I feel like we're getting our arms around some of the ways that we can manage that elongated sales cycle, whether it's better understanding our IT stakeholders, like the Chief Information Officer, better understanding the time-frame to get through the legal requirements. So we're learning as we go, and I think over the last six months, we have learned a lot about how to approach these enterprise deals in a way that we can plan for this elongated sales cycle and try to take some steps to proactively tighten it up. It allows us to get faster market penetration, get larger average selling prices on every deal, and we're really pleased with that. Could you elaborate a little more, I understand maybe there's more things that you don't want to talk about. And when they do, they want to make sure that they acquire the latest and greatest and sort of cool -- full portfolio of innovation that's available from us. And we're finding that if we position and message this differently, especially now that we're starting to get some results from the -- the risk clinical studies that was really an important pieces this, that we were able to go in with really powerful messaging that again, no other company can match. There is no other company that can offer the level of clinical performance and ProFound AI plus our breast density and certainly no other company that has a short-term risk assessment solution, like we do. We're just getting going with it, but we're finding already a lot of interest from our customers and we're finding that our sales team is very interested in leading with the sort of premium bundle as a way of maximizing our differentiation versus all of our competitors. Your line is live. As I have said on the call last quarter, we really weren't addressing the full market opportunity. Previously, we were a little bit more reliant on some of our legacy partnerships and we didn't have full compatibility with our product lines to ProFound AI to all of the latest generations of the mammography systems in the market. Now we do, and so we're able to access the entirety of the market, and that has really made an impact on our pipeline and how it's building. We most certainly see that reflected in our pipeline quarter-to-quarter, even from a quarter ago to where we stand now and we're very optimistic that were on the trajectory that we had laid out last quarter in terms of seeing increasing growth and revenue each quarter. But right now, it's too small to really classify it as any one particular type of customer. We're very pleased with the progress that we've made in the past quarter, and we look forward to providing you with additional updates throughout the rest of this year, as we continue to advance our business and leading innovations really continue to drive sustained market leadership. So with that, I wish everyone a great night and we'll talk to you next quarter."
}