{
    "symbol": "ICAD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 23:26:03",
    "content": " And frankly, part of that is that we are positioning this a greater amount of the time, right, as a better way to accelerate, you know, winning business in what still is a challenging market, you know, environmental, having said that, you know, it's a new model, and we expect there to be some, you know, choppiness to it for a period of time. So, you know, we are, as I said, in the script, moving to a model, where we're sort of investing in this, in what I would call deeper levels of relationships with key partners and collaborators in the market where it's really more than just a transaction, right. So when you talk about, you know, mixed with the business, it's a little complicated in that, you know, when you recognize a perpetual license, you know, a perpetual sale, you're taking 100% of that revenue, basically, upfront, except for maybe a carve out on the maintenance piece, on a, you know, on a subscription sale, once you make that sale is first, there's a six to eight week lag, before you can even get it installed. I don't actually know how many total gantries that that represents, obviously, a very large number, but it's kind of a hybrid model, right, between owned and, and serviced accounts for the initial order that they have now given us, you know, again, that is a per exam type model that will enable them to use our technology to, you know, read hundreds of 1000s of mammograms. You know, they're still the capital model today is still the predominant way we're doing business, although it's obviously evolving and changing, you know, rapidly here, but there are still a number of customers, for example, all of our existing OEM agreements, right, that we have with the imaging company manufacturers, right, those are still for perpetual capital purchases, right. And obviously, I understand the issue with comparing, you know, subscription to capital licenses just based on the revenue recognition, the six, eight weeks and then obviously less of an upfront but when you mentioned there on someone else's question that 25 to 30% in terms of accounts that are that that 25 to 30% that are about I assume subscription at this point."
}