{
    "symbol": "MDB",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-03 00:19:05",
    "content": " Please go ahead, sir. In terms of like breakdown of where these customers are coming from, I think, I would just say, we’re seeing healthy growth of both new customers, as well as expansion of existing customers. What I would say with 5.0 is we’re just continue to double down on it one expanding our platform, obviously, with all the additions that we’re making, especially with native time series support and we’re also making it far easier for customers to use MongoDB. And I would say that, we’re even seeing digital native companies, ISVs, who have very, very demanding requirements that can continue to use -- either choose MongoDB or double down on MongoDB for their platforms and we’re really excited about what that means for us long-term. And I think you’ll see us continue to invest aggressively in Atlas, because every customer that we know, even the customers who are predominantly on-premise, they know that the benefit of using MongoDB is that they can start on-prem, but they have a very seamless path to the cloud. Well, if you know anything about the MongoDB culture, we’re very focused on serving our customers, but also being quite aware of what a competition is doing and I’m pleased to report that our win rates against the competition are very, very high, against both the standalone companies, as well as the clones being offered by the cloud providers, our win rates are really, really high. And what I would say is that, what customers are clearly telling us that, that they just don’t want to use a net new technology for net new use case, that they want to be able to run more things on platforms and they want to get the benefits of all the best of breed solutions out there. So -- and so that really allows us to continue to innovate fast, but still be able to address the needs of the organization and make sure customers can consume MongoDB’s capabilities at the rate and pace that they want to. And also is your strategic discussions that you’re having with customers now here in the U.S., is that also something that applies internationally or that’s more of later cycles, say, relative to where you are here in the U.S. Obviously, different theaters are -- the size of businesses is different, but we’re seeing significant demand across the globe. Atlas, the value proposition wouldn’t even make as much sense because people just hire their own op -- database administrators will turns out, people value speed, people value being able to innovate and people value being able to offload undifferentiated work. Please go ahead, sir. Second, Atlas’ growth of 83% reinforced the point that customers want a multi-cloud platform that enables them to innovate quickly and outsource the undifferentiated heavy lifting of managing their data infrastructure."
}