{
    "symbol": "UGRO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 20:40:22",
    "content": " And this growth, the successful diversification that we underwent this past year was evident in our record signed contract backlog of $93 million at the end of 2022, representing a sequential quarterly increase of nearly 40% and more than three times the backlog that we reported at the end of 2021. In the fourth quarter, construction design build revenue increased by $11.5 million, and professional services revenue increased by $0.3 million year-over-year, with both increases being driven by the synergies we're creating with our strategic acquisition. Supporting the strength of our go-to-market strategy with a single point of accountability across all aspects of our clients' projects, in the fourth quarter, we signed over $30 million of new design-build contracts, all with financially strong clients. That said, as we look at the quarterly cadence for the year and the strength and timing of our backlog, we expect to deliver sequential quarterly growth beginning in the second quarter through the balance of 2023, both in terms of revenue and adjusted EBITDA in order to meet our full year guidance that we're introducing today. This decrease was driven by a decrease in equipment systems revenue of $13.3 million, primarily reflecting significantly reduced equipment demand in the U.S. cannabis market because of ongoing state-level regulatory delays in the license awarding process, as well as the lack of movement of key industry financial support models such as the SAFE Banking Act. This decrease was partially offset by the accretive acquisition of Emerald Construction Management in April in '22 with an $11.5 million increase in construction design build revenue, as well as incremental professional services revenue of $0.3 million associated with the acquisition of DVO in November of 2022. This backlog is comprised of $82 million in construction design build, $6 million of professional services and $5 million of equipment systems contracts. So that $93 million, that's $93 million of signed contracts that will - depending on the sector and depending on the category, will be realized in anywhere from one quarter to - as it relates to a full large cannabis facility it could take up to 18 to 24 months."
}