{
    "symbol": "FLWS",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-02 10:44:14",
    "content": " All told, Harry & David set new records for this holiday season, including: its biggest sale day ever in December, breaking a record that was set in the pandemic year of 2020; its first $3 million Mobile Day, as more customers shifted from desktop and tablet into mobile; and record sales of our award-winning wines, all resulting in a record sales quarter for the brand, sustaining the growth that we have seen over the past few years. Gross margin improvement was led by 170 basis point increase within our Gourmet Foods & Gift Baskets business, which benefited from our strategic pricing initiatives; lower year-over-year ocean freight costs that continue to trend favorably; a more stable labor market, which enabled us to reduce overtime pay; and our logistics optimization efforts that leverages our full distribution network to reduce shipping zones and deliver products closer to the recipients. This segment's gross profit margin increased 170 basis points to 41% from 39.3%, benefiting from our strategic pricing initiatives, lower inbound transportation costs, improved labor availability and our automation efforts. Certainly, we talked about our strategic pricing initiatives on some of the -- our lower price point products, whether it'd be PersonalizationMall, Shari's, Cheryl's Cookies, those consumers where their household incomes are a little bit more challenged in this environment. I mean -- and with Flowers -- and we're certainly blessed with our largest brands Harry & David and Flowers where we have a broad-ranging consumers, so many of them are in higher household demographic incomes, and that allows us to move customers up on value and pricing and take advantage of the bundles and create your own products that we have to increase prices to those consumers. And I think when you look at this past quarter, I think it's a good example there where through pricing initiatives -- strategic pricing initiatives as well as just merchandising mix and featuring more bundles and higher price point items, we were able to lift AOV by 6%."
}