{
    "symbol": "ORA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 14:55:26",
    "content": " For 2023, we expect to deliver between $480 million to $510 million of adjusted EBITDA, an increase of approximately 14% at the midpoint over 2022 actual results, which is the highest growth we have seen in years in EBITDA. On an annualized basis, the new assets that will be added in 2023 as well as the potential improvements in Puna and Olkaria are expected to add between $25 million to $30 million of additional adjusted EBITDA versus 2022 partial operations. Total revenue for 2022 was $734.1 million, up 10.7% year-over-year. And revenue for the fourth quarter was $205.5 million, up 7.6% year-over-year, reflecting growth across all 3 of our operating segments. Across the full year 2022, our adjusted EBITDA results of $435.5 million increased 8.5% compared to $401.4 million in 2021. On an adjusted basis, net income attributable to the company's stockholder was $92.2 million or $1.63 per diluted share, an increase of 7.3% and 7.1% versus the same period last year, respectively. In the fourth quarter of 2022, net income attributable to the company stockholder was $18 million or $0.32 per diluted share, in comparison to the $18.9 million or $0.34 per diluted share in the same period last year. On an adjusted basis, net income attributable to the company stockholders was $41.2 million or $0.73 per diluted share, with an adjusted net income attributable to the stockholders up 80.3%. Electricity segment-level revenue increased 7.8% to $631.7 million and 0.6% to $165.2 million in the year-end -- Puna due to higher -- in the year-end and fourth quarter 2022, respectively. In the Product segment, revenue increased 52%, $71.4 million and 58%, $32.2 million in the full year of 2022 and in the fourth quarter, respectively. Energy Storage segment revenue increased 2.1% to $31 million and 27.3% to $8.1 million in the full year 2022 and in the fourth quarter, respectively. In 2023, we are planning to invest approximately $180 million in our storage assets compared to approximately $80 million in 2022. We expect total revenues to increase by 14% year-over-year at the midpoint and to be between $823 million and $858 million, with the Electricity segment's revenues between $670 million and $685 million, an increase of 7% compared to 2022. We expect an approximately 79% increase in the Product segment, with revenues between $120 million and $135 million. We expect adjusted EBITDA to increase by approximately 14% at the midpoint, the highest growth we have experienced in the last few years, and to be between $480 million and $510 million. On an annualized basis, the new assets that will be added in 2023 as well as the potential improvements in Puna and Olkaria are expected to add between $25 million to $30 million of additional adjusted EBITDA versus 2023 partial operations. Now when you look at the CapEx that we're spending in 2023 and you look in 2024, we will see a much bigger amount coming from the ITC part because, as we see it, in 2024 we have the COD of Bottleneck which is around $100 million and $105 million project, in addition to Montague which is another large project. So these 2 items, in addition to the on the geothermal, which is like you mentioned rightfully so -- Heber and North Valley should rate on a run rate base additional $25 million to $30 million of EBITDA in the following year. And we want it as early as we can, but we want it right, so when we look at 2024, not including assets that we will add in, in 2024, we are seeing a pickup in EBITDA on those assets of $25 million to $30 million, with almost -- all of it also coming from a top line growth of storage and geothermal assets. They will contribute some amount in 2023, but on top of it, on an annual base when you look at 2024, they will add additional $25 million to $30 million of adjusted EBITDA. If we will see a pickup in prices towards what we saw in 2022, we expect revenue in the storage to be higher by $6 million to $8 million."
}