{
    "symbol": "EAT",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-01 16:30:05",
    "content": " We believe with a world-class leadership team, stronger Maggiano's business and executing on Chili's four strategic pillars, we're making the right choices for our business, improving the experience for our guests and team members, and driving our four wall economics will help our business regardless of the macro environment. The -- as far as deploying incremental capital expenditures, I think yes, there's going to be those opportunities and we'll look at that, whether it's new restaurant development, we want to make sure again, we're effectively caught up as we kind of move forward with R&M investments. And good to see you're still where you're at, Eric, but, no, I think yes, labor did -- labor really benefited from the sales leverage side of the equation and as we indicated some of the \"investment back\", the incremental hours that we will be putting back into the system didn't have as much of an impact in the second quarter because they were late dated when we really started that piece of the equation. We have actually -- we're actually seeing the dining room business obviously continue to grow and that's thinking through the entire comp dynamic, traffic is down a little bit relative to that pre-pandemic dining room. If I kind of struck out on that question, but if I could just ask, was the traffic decline 7%, 7.5% or so for Chili's decline, was that roughly what you would've have expected in terms of the trade-offs, the natural trade-offs you're making the business, including the pricing? And as long as we run, a couple of points away from the industry on traffic, the equation looks really good for our business and then allows us to plow back investments that we hope will then grow traffic over time, whether it's advertising improved service levels or better food. So I think it's a huge opportunity for us, because then you can go a little sharper if you need to go sharper with the guests that would need a better value than the one that doesn't, right, versus the -- before you had that capability, you had to advertise it to everyone. I think the second thing is that we've got to continue to accelerate our simplification and get to a place where we're making a fewer items, we're making them a whole lot better, and that's going to improve margins and as well as allow us to invest some of that back into the business. And then I think the third thing is I think we got to try to stay on advertising on a hot price point, because that's going to obviously mitigate the traffic headwinds that you're going to get from a macro. And again, you're thinking about what are the -- what's the prudent level to get to as we kind of see momentum in the business, but understand some of the macros that are sitting out there also."
}