{
    "symbol": "EAT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-02 14:52:04",
    "content": " We expect these growth simplification and pricing initiatives will allow us to invest back into restarting our marketing voice sometime in q3 in the new calendar year, we know that cash job customers will be seeking great deals without sacrificing quality, and we're making plans that create broader awareness of our unbeatable Chili's value. But right now, based on everything that we're seeing, we're going to continue to manage that number down and hopefully we'll get below thirties the next time we talk, but we just got to make sure that we monitor the economic environment, make sure we don't get ahead of our skis on anything that we need that we think the customer needs. Brian, I'll sharpen it to the extent of reminding what I said in the last call, as we've reiterated the guidance and, and, and you hit on the traffic we do expect Chili's to run in a negative traffic the mid-single digit range as we kind of move through the fiscal year pricing will be at those levels that we told you about mix is kind of the delta, and I'm encouraged by the mix and the sustainability of what we're seeing on the mix side of the equation. I think if we focus on those two things, I think we're going to see significant improvements over time, and that's going to help both the labor line as well as probably more importantly, the customer service line. So just thinking about how this, this guidance really contemplates some margin wins from rethinking some things like the virtual brand strategy and the delivery menu pricing, but also perhaps some mar margin sacrifices, the assessing of team service model and any advertising spend that the company may have sacrificed in recent years that you want to get back to support some of the, the things you want to do. As we look at that, where that comes from and how it's funded isn't necessarily going to have to be sacrificing margin in the short run too because again, as we think about how we reallocate costs and where we're seeing benefits on a cost structure relative to what we originally thought for the year those give you really near term opportunities to think through what needs to foundationally go back into the business and what opportunities do we have to flow to the bottom line. So it helps color the discussion, but it, I think philosophically, and Kevin, you can add in anything you want to, I think we need to be thinking about how to build a an improved foundation of both of our brands businesses for the long term and we'll make the right decisions regardless of which fiscal year we're thinking about going forward. Is what we've seen, in the big competitors in casual dining, we're kind of doing the same thing with three for me, where it's not the lowest price point out there, but it certainly is unbeatable value when you look at everything that you get and we need to make sure that we talk about it, right because at the end of the day, if we don't advertise it's hard to drive incremental traffic. So I think a lot of times folks think that's, it's a 32nd TV ad that will reposition the brand, and the reality is we've got to do the heavy lifting to make sure that the brand really ex exhibits that all throughout the organization and the menu and, and the team members and the service model before we would go, do some kind of big bang, Hey, we're back rebrand."
}