{
    "symbol": "BRCN",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-15 23:58:07",
    "content": " Since that time, and as is standard practice at any new food processing facility, Merit has been undergoing a commissioning process at its production plant, working through and resolving operational issues as they have arisen with the goal of optimizing production throughput and yield and ultimately to achieve the nameplate capacity as per the originally engineered design of the production plant, which I will talk a little bit more about later in this call. Just last quarter, Merit fulfilled first commercial sales orders for its best-in-class pea and canola protein ingredients and we are pleased to note that there are currently food and beverage products on store shelves today, which incorporate Merit is novelty and canola proteins. Merit continue to fulfill commercial sales orders this quarter and Burcon record a royalty revenues of $32,000 from Merit on the sales of pea and canola protein products. During the quarter, our joint venture Merit Functional Foods which is currently commissioning its new state-of-the-art protein production facility, achieved numerous significant steps towards optimizing the facility where it is now producing under license from Burcon its best-in-class pea and canola protein ingredients. So while the production team at Merit has been hard at work fine tuning the facility and the production process, so too has Merit is production applications experts and sales team been working diligently with the proteins produced at the facility and with numerous CPG companies seeking to incorporate Merit unique proteins into soon to be launched new or reformulated consumer products. During the commissioning period, Merit has had modest commercial production and as a result, sales of Merit is pea and canola protein ingredients to food and beverage manufacturers have been limited, albeit increasing quarter-over-quarter, but for all intents and purposes, Merit sales are just at the beginning now. Commissioning a dual process protein production facility such as Merit is not without challenges, and startup issues and due in large part to the uniqueness of the plant’s ability to flex between pea and canola protein production. As we recently announced, Merit is now fine tuning the implementation of Burcon’s technology and as such, we expect that will soon be transitioning to full production of best-in-class peak and canola proteins."
}