{
    "symbol": "BRCN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-27 20:55:05",
    "content": " Burconâ\u0080\u0099s focus during the year was to support Merit in the commissioning of its state-of-the-art pea and canola flex protein production facility located in Winnipeg, Manitoba. Meritâ\u0080\u0099s total sales revenues for the year were $6.3 million, which included sales of commodity and co-products in addition to pea and canola protein sales. During fiscal 2021, we recorded $250,000 of research revenues from Nestle for work on improving functionality of Burconâ\u0080\u0099s and Meritâ\u0080\u0099s plant-based protein, as well as $9,000 of royalty revenues recorded from ADM for CLARISOY. Subsequent to March 31st, Burcon advanced $3.16 million as a proportionate share of a $10 million funding to Merit to address Meritâ\u0080\u0099s liquidity requirements as it ramps up production and sales. Within the backdrop of a growing plant-based market, our joint venture, Merit Functional Foods, achieved a significant milestone during the year by reaching the production output threshold as stated under the amended and restated license and production agreement for the successful commissioning of Phase 1 of a multi-phased build-out with its flex protein production facility. Merit also received two further co-investments from Protein Industries Canada, providing one-half of total respective project costs, the two separate projects, which would see Meritâ\u0080\u0099s pea and canola protein ingredients developed into new plant-based food and beverage applications. While Merit focused on production and sales, Burcon has -- had the opportunity this year to reallocate its bandwidth from supporting Merit to pursuing strategic partnerships and collaboration opportunities to commercialize our additional protein technologies that we have in our pipeline. Firstly, Merit completed the commissioning of Phase 1 of its state-of-the-art pea and canola flex protein production facility and is now focused on the growth of Meritâ\u0080\u0099s sales pipeline."
}