{
    "symbol": "BRCN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-14 18:19:06",
    "content": " Beginning with Merit Foods, we're please report that Merit has now commissioned it's state-of-the-art pea and canola protein production facility in Winnipeg, Manitoba and is fully scaled to supply leading CPG companies with its best-in-class pea and canola protein ingredients. We are thrilled by Merit's recent production achievements, attainting commissioned status for Merit’s Flex production facility as an important milestone, and one which further validates Burcon’s position as a global technology leader in the development of plant based proteins for foods and beverages. Considering the many challenges encountered over the course of the past year, it is noteworthy that Merit was able to push through the adversity and achieve the results they had targeted to reach the level of production capability that now positions Merit as the world's first dual technology protein production facility supplying the global food and beverage industry with both unique and differentiated key protein ingredients and first of their kind canola protein ingredients and with the expectation that Merit will continue to do so for decades to come. As part of the broader selling process, Merit continues to work closely with hundreds of CPG companies looking to develop innovative new foods and beverages or reformulate existing products using Merit’s innovative pea and canola protein ingredients. Within the context of the current under-supplied plant based protein ingredient market, there is significant interest in demand from Merit’s pea and canola protein ingredients which offer unparalleled purity and exceptionally clean and neutral taste compared to what's currently available on the market, providing Merit with a competitive advantage which we and Merit expect will drive sales, and which are expected to evolve into the long-term recurring revenue streams we just talked about. With Merit having now completed commissioning process, transitioning to full production and aggressively pursuing its sales pipeline and the sell-in process, Merit is now more than ever well-positioned as a premier plant-based protein ingredients solution provider, giving Burcon the luxury of being able to turn our focus, to exploiting the other technologies in our intellectual property portfolio, and to pursue the additional commercialization opportunities we have been nurturing through our management team and the team at Burcon's Winnipeg Technical Center. The Merit facility is in my opinion a large facility, it can process 20,000 metric tons of field fees equivalent let's call it amount of canola and as we have said on a number of occasions previously, implying revenue of up to about CAD 60 million at full capacity and yet can tell you that one of our Board members likes to point out over and over again that it's a demonstration plant in the Grand scheme of when you look at the plant-based protein ingredient industry on a global basis, when you look at the big players that exists in soy and pea protein, potato protein, you name it."
}