{
    "symbol": "FSM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 14:42:12",
    "content": " As of the end of the quarter, the company maintained a strong balance sheet with low debt leverage and liquidity available of $150 million, which is more than adequate to meet all our capital and growth plans. Looking at our consolidated production, all ore mines performed well and in line with our annual guidance projections for 6.2 million to 6.9 million ounces of silver, and 244,000 to 280,000 ounces of gold. With 4 million ounces of gold equivalent in mineral reserves, diversified production from mines located in two of the most important mining regions in the world, competitive costs, short-term growth in the pipeline and a healthy balance sheet, Fortuna is well positioned to continue harvesting high value opportunities within the portfolio, as we advance our business. Back to you, Jorge. At Yaramoko, production for the quarter was 2% greater than the plan at 28,000 ounces of gold in the mid to upper end of guidance for the period, while costs were contained at below the lower end of the guidance range at 1,147 ounces of dollars per ounce for the period. With nearly $76 million spent through end of the quarter and over $130 million committed, the project is well placed to be de-risked in the challenging environment, in which we are developing the mine today. The higher sales were driven by the contribution of Yaramoko with $55.4 million of sales in the quarter, and sales of Lindero of $54.1 million, which was 48% higher than Q1 2021 and represented an additional $18.1 million to our top line. This was comprised of $4 million of higher share-based payments when compared to the first quarter of 2021, for which we recorded a credit of $0.4 million and $4 million higher G&A between the sites and corporate. On the balance sheet and liquidity requirements, as Jorge pointed out, we closed the quarter with $110 million of cash and cash equivalents and liquidity of $150 million, which includes $40 million that remained undrawn at the end of the quarter under our $200 million revolving credit facility. Back to you, Jorge."
}