{
    "symbol": "FINV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 23:53:05",
    "content": " For full year 2022, we achieved our total transaction volume target with RMB 175.4 billion in total transactions, representing a year-over-year increase of 28%. Our total transaction volume in the fourth quarter reached RMB 48.6 billion, representing a year-over-year increase of 25% and a sequential increase of 7%. Notably, our full year domestic loan volume grew to RMB 171 billion, a year-over-year increase of 28%, and the fourth quarter volume rose to RMB 47 billion, a year-over-year increase of 24% and a sequential increase of 6%. International loan volume for the full year also climbed to RMB 4.3 billion, representing a year-over-year increase of 16% where loan volume for the fourth quarter reached RMB 1.4 billion, representing an increase of 41% year-over-year. With our ongoing efforts to acquire better quality borrowers, our proportion of category A and B borrowers in the domestic market further increased to 77% of our total borrowers in the fourth quarter from 63% in the same period last year. We are thrilled to report that during the fourth quarter, improvement across multiple operational fronts led to a revenue contribution of RMB 395 million from this segment, representing a 13% contribution to total revenue as well as an increase of 122% from the same period last year and a sequential increase of 13% from the previous year -- quarter. For full year 2022, revenue from the international segment was RMB 1.15 billion or 10.3% of total revenue, a remarkable accomplishment given the international contribution to total revenue just reached a double-digit level for the first time in the third quarter. Among others, growing fruitful collaboration with these local partners have led to a rapid increase in our proportion of loan funded by local banks to 63% in the fourth quarter of 2022 compared to 48% in the previous quarter and merely 10% in the same period last year. Notably, net revenues in the fourth quarter reached around RMB 3 billion, up 25% year-over-year, with full year net revenues exceeding the RMB 10 billion mark for the first time to reach RMB 11 billion, up 17% year-over-year. Preparing technological innovation and the constant acquisition of higher-quality borrowers, as a result, we expect our transaction volume in the China market for full year 2023 to be in the range of RMB 189 billion to RMB 205 billion, representing an increase of around 10% to 20% year-over-year. We also expect our transaction volume in international market for full year 2023 to be around RMB 6.4 billion, representing an increase of around 15%. And after the transition completion, we have been growing -- our growth has actually resumed above 20% Q-over-Q since the third quarter, and our outstanding loan balance has grown to RMB 800 million by the end of December, growing 167% year-over-year."
}