{
    "symbol": "DLHC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-07 11:03:04",
    "content": " We posted operating income of $7.1 million or 10.7% of sales, up 44% year-over-year and recorded EBITDA of $9.0 million versus $7.0 million in the third quarter of fiscal 2021. Besides our re-competes, weâ\u0080\u0099ve announced several new contracts that position us for additional growth in the coming years that include multiple award contracts that are IDIQ in nature with a ceiling of $10 billion to provide health-related research and development and R&D support to the U.S. Department of Defense, in particular, the Defense Health Agency and the Medical Research and Development Command. Weâ\u0080\u0099re also selected as part of another multiple award IDIQ contract with a $320 million ceiling for all 5 awardees, and that is to provide support for the National Cancer Institute with clinical support and study management, positioning us to help in the ongoing fight against cancer. We posted revenue of $66.4 million for the 3 quarter -- for the 3 months ended June 30, 2022 versus $61.6 million in the prior yearâ\u0080\u0099s fiscal third quarter. Weâ\u0080\u0099re starting to see a lot more attention coming from the agencies, particularly the federal agencies that we serve that are requiring that contractors have FedRAMP-level secure systems if youâ\u0080\u0099re going to move forward in handling large sensitive data, not only in the healthcare arena, where itâ\u0080\u0099s very, very sensitive health records being managed, but also from just cyber risk and general cyber risks across the industry. We under the leadership of our relatively newly hired Chief Human Resource Officer, Maliek Ferebee, weâ\u0080\u0099ve really focused heavily on the ability to retain our workforce as well as to be able to attract workforce given the threats that weâ\u0080\u0099re seeing out there. All of our managers have just come out of one of our sessions on making sure that weâ\u0080\u0099re applying some novel methods, leveraging, meeting some of the candidates and more social media means than the historical means of recruiting and really jumping on that so that we can deliver the revenue, deliver the expertise that our clients demand and need as well as have the resources available to meet the fill rate requirements to ensure that weâ\u0080\u0099re able to meet the exacting demands of the prescription environment for our VA customers. And so really what differentiates us I think is number one, weâ\u0080\u0099re absolutely focused on -- at the same time that weâ\u0080\u0099re fiercely competing for talent, weâ\u0080\u0099re focused on moving the needle on our contribution of the amount of the work that is delivered by direct labor of our team versus building subcontractors into our efforts."
}