{
    "symbol": "BLFY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 21:15:04",
    "content": "  Operator: Good morning, and welcome to Blue Foundry Bancorp's Third Quarter 2022 Earnings Call. Comments made during today's call may include forward-looking statements, which are based on management's current expectations and are subject to uncertainty and changes in circumstances. Blue Foundry encourages all participants to refer to the full disclaimer contained in this morning's earnings release, which has been posted to the Investor Relations page on bluefoundrybank.com. I would now like to turn the call over to President and CEO, Jim Nesci. Good morning, everyone, and welcome to our third quarter earnings call. After my opening remarks, Kelly will share the company's financial results. Earlier this morning, we recorded third quarter net income of $1.2 million or $0.05 per diluted share and a pre-provision net revenue of $1.1 million. Our lending team had another remarkable quarter, originating 172 million of loans. During the quarter, we focused on production on the multifamily segment, which we feel is a stable asset class during times of potential economic uncertainty. While our retail markets are beginning to show higher deposit costs, our loan growth has helped to expand net interest income by 5%. As of September 30, loans totaled 1.49 billion, up 67 million from the prior quarter. This represents loan growth of 5% quarter-over-quarter, the fourth consecutive quarter we grow our loan portfolio by more than 4%. While our loan pipeline remains healthy, given supply and the current environment, we do not expect to continue growing at this record pace. Additionally, the company added 18 million in consumer core deposits. Beginning in August, we repurchased 667,000 shares at a weighted average cost of $11.67, a significant discount to tangible book value. Additionally, last week, the Board of Directors approved stock option grants for officers of the company. Not only will these grants help us to retain top talent, they will further align our officers with long-term interest of our shareholders. On behalf of our Board of Directors and the officers of our company, I would like to thank our shareholders for their support and approval of the Blue Foundry Bancorp 2022 equity incentive plan. With that, I'd like to turn the call over to Kelly, and we'd be delighted to answer your questions. Our financial results were highlighted by net income of 1.2 million compared to 40,000 during the linked quarter. This improvement was largely related to pre-provision net revenue, which increased 586,000. Despite funding pressure from the rising rate environment, net interest margin remained relatively flat, expanding 1 basis point to 2.84%. Interest income increased 1.5 million and net interest income increased 5% or 653,000 driven by a 96 million increase in average loan balances. Remaining competitive in pricing, we have increased rates offered on select depository products. This, coupled with an increase in short-term borrowings, drove cost of funds to 66 basis points, a 9  basis point increase compared with the prior quarter. During the quarter, we released provision of loan losses of 419,000 and increased our provision for commitment by 170,000 due to a change in mix of our loan portfolio. During the quarter, our allowance to total loans decreased 7 basis points to 91 basis points. As a reminder, we are currently operating under the incurred loss model and are on track to adopt CECL by the required implementation date. In terms of expenses, excluding our provision for commitment, we saw $372,000 increase. This is due to a combination of director equity grants, an increase in working days and nonrecurring expenses from investor related activity and the potential branch sale. As Jim mentioned in his remarks, stock option grants for officers were approved this month. We expect these grants to add quarterly expense of approximately 300,000. Gross loans, excluding PPP, grew by 68 million or 4.8% sequentially, driven by originations of 172 million, primarily in the multifamily segment. During the quarter, the bank also purchased 15 million of high quality residential loans in our principal market, which were originated to Fannie Mae standards. With a duration of 4.1 years, our securities portfolio continues to provide cash flow that is being used to fund loans. 17.6 million of the decline in the securities portfolio was attributed to maturities, calls and scheduled pay downs. During the quarter, core deposits increased 4% or 35 million and now represent 71% of total deposits. Additionally, during the quarter, borrowing increased 90 million. Tangible book value declined $0.34 to $14.09 per share, driven primarily by the negative impact that interest rates had on our available for sale securities portfolio. Given our current tax position, most of the change in fair value flows through to equity with little tax benefit for the unrealized loss. Therefore, the rising rate environment has a more profound impact on our equity than it would have if we were operating with a more normalized tax position. As we mentioned last quarter, we currently intend to hold these securities through their contractual maturity, which will allow us to recoup the unrealized losses we have experienced to date. As Jim mentioned earlier, we repurchased shares at a discount, which had a positive impact on tangible book value. Yes, so we did use 299,000 of those shares to fund the equity portion of the Director's grants. We had strong growth in the multifamily segment this quarter, which we think is a good asset class for us to be in at this point. From an overall perspective, the majority of that, about 60% is in the New Jersey space, 32% is in the New York space, not in the Manhattan area. And then just specifically, kind of a cleanup item, within your net interest income, I know there was probably a very, very small amount of PPP forgiveness. As you said, that really has come down in the recent quarters. We only have approximately 0.5 million left in PPP loans, with about 30,000 of fee income to be amortized, which will not be meaningful, as we move forward. I think not unlike others, we are experiencing pressure on our funding sources. But realize as our growth has outpaced our deposit growth, we continue to see pressure on those funding. I was going to say what we're really focused on is introducing new customers to the bank, so most of those initiatives will be focused on bringing new funds to the bank, new customer money. Yes, and so just obviously stripping out the PPP fees, so your headline margin contract or your headline margin 1 basis point. But if I strip out the PPP fees, you were actually 4 basis points wider. Yes, I think as we had said last quarter, we benefited from some late deposit growth in Q2 that was fully realized in Q3. But again, as you took a look, we do have currently increased borrowings, which in the current rate environment, is putting pressure on those assets that we put on and the spreads we're realizing. Yes, so approximately 300 to 350 is prepay and exit fee loan related income that was realized during the quarter. And then on expenses you mentioned in your press release, you mentioned in your prepared comments to the one-time charges. So the one-time charges really include legal expenses, primarily we've had some charges there as well as an increase in the -- we had a branch that we anticipate selling that was recognized there. So in total, that 240,000 of the expenses for the quarter we believe to be nonrecurring. Obviously, you had your equity incentive plan for only part of this quarter. So really fully phased, that adds another call it 213,000 plus, your Directorâ\u0080\u0099s grant at 300,000. Just trying to put together --\n Sorry,  Kelly a chance to put her numbers together for you. As far as de novo branches in 2023, we continually look in the marketplace for areas that make sense for our bank to de novo. So while we may have a plan to put them on in 2023, I don't think most of the expense will be incurred in the first or second quarter of 2023. Yes, Laurie, on the expense front, from the equity awards on an annualized basis for those that have been granted to date, we're looking at around 2.4 million, 2.5 million in expense on an annualized basis. As I look at next quarter, as you mentioned, we had a partial quarter of the equity grants for the Directors, and this quarter we will have a partial for the equity grants that were granted to management. So we're looking at about a 13.6 in terms of expense run rate for Q4, inclusive of those new grants. And then I guess looking ahead into the March quarter, and maybe just if you could comment on the new branch expense -- I mean your new branches are probably $500,000, $600,000 in costs. I think as Jim mentioned, Laurie, those expenses we don't anticipate coming until later in the year. And currently, based upon our grants that had been granted, provided that guidance, there's no other guidance relative to an expense spend, as we look forward."
}