{
    "symbol": "PSTV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 23:36:05",
    "content": " The key focus areas of ongoing clinical investigation in the recurrent GBM development program will be further dose exploration including both increased dosing i.e., advancing to cohort aid and study of multiple doses and also collecting additional safety and efficacy data to inform the design of the future registrational trial. As I mentioned, the company recently completed key manufacturing objectives for cGMP 186RNL to support ongoing and planned clinical trials in 2022 and beyond,   drug of sufficient quality and scale to enable the completion of all further clinical investigation, including for ongoing and planned Phase 2 and Phase 3 clinical trials in patients with glioblastoma, leptomeningeal metastases, pediatric brain cancer, and really any conceivable future disease targets. Now regarding our development program and pediatric brain cancer, the company is on track to meet its objectives to submit an investigational new drug application in the fourth quarter of 2022, for what will be called the respect PBC Phase 1 dose finding an efficacy study of 186 rhenium bis-BMEDA for pediatric brain tumors, and that will be submitted in conjunction with our lead academic institution hospital of Northwestern University in Chicago. We plan to  of 186 rhenium bis-BMEDA for recurrent GBM as mentioned, we plan to present updated data from the ReSPECT GBM trial, the LM trial and forthcoming pediatric brain cancer trials at the Society for Neuro Oncology Annual Meeting and Education Day that will be held in Tampa on November  and one poster presentation there. We'll submit an IND for the study of 186 rhenium bis-BMEDA in patients with pediatric brain cancer as mentioned, and we plan to complete key CMC and IND enabling studies for the BAM program and complete a related pre-IND meeting as planned all on track. So I think I've mentioned in previous call this idea though of getting really long-term survivors here as possible but it's likely because of the peskiness of eradication of all the malignant cells is so difficult that we might have to provide some sort of re-treatment strategy either two or three years later, when the a well-treated tumor actually recurs or maybe early in the post-operative phase after single administration where maybe the tumor was so difficult we just couldn't cover the whole thing reliably."
}