{
    "symbol": "PSTV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:07:03",
    "content": " Fast forward to the end of 2022, we ended the year with two investigation drug candidates, Rhenium (186Re) obisbemeda, formerly called 186RNL and Rhenium 188 Bioabsorbable Alginate Microsphere or 188RNL-BAM as we call it regarding our investigational drug, Rhenium (186Re) obisbemeda, Rhenium obisbemeda, we have two active clinical programs now ongoing, one for recurrent GBM and the other for Leptomeningeal. The data in our trial showed that Rhenium obisbemeda can be safely administered and there's a statistically significant correlation, but between overall survival and both absorbed radiation dose to the tumor and percent tumor volume in the treated volume, the strength of the signal is unusually positive for a phase one trial. Based on the data from the phase one trial and Q4 2022, we initiated a phase two dose expansion trial, evaluating Rhenium obisbemeda for the treatment of patients with recurrent GBM using our cohort six dose, which is 22.3 millicuries in 8.8 milliliters of inject eight for small and media sized tumors, and that's essentially tumors that are about 20 CCS or less. So going back again to the SNO meeting back in November, we also prevented presented the early phase one data from the ReSPECT LM trial at that meeting that demonstrated that a single administration of vial AM bipa was feasible, safe and well tolerated across the two dosages studied at that time in cohorts one and two with patients with patients in that trial after treatment showing a decreased CSF tumor cell count by 48 hours following treatment that was between 46% to 90% in terms of reduction of the tumor cell count that was measured in the CSF. Our current supply chain and key partners are positioned to supply C GMP Rhenium obisbemeda for any ongoing and planned phase two, three clinical trials in patients with GBM, lm or pediatric brain cancer, and that's now fully in place as of the end of last year, pediatric brain cancer."
}