{
    "symbol": "MMYT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-27 14:11:02",
    "content": " One, it will be linked to kind of the overall business mix getting restored to pre-pandemic levels where hotels used to contribute almost like 50% plus of the mix. So, as this mix gets restored over the next few quarters, I think we should possibly see this kind of number increasing, because the amount of kind of customer division costs that we incur on the hotel side, are slightly higher, in line with the larger margins that we make in those businesses. The second point is weâ\u0080\u0099re also kind of not getting into any significant brand kind of expenses which are more longer term in nature keeping in mind that we still not kind of cross the pre-pandemic kind of volumes, and once we kind of getting beyond the pre-pandemic volumes, I think there will be a requirement to kind of if we start on the, on the brand expenses, and therefore, these two factors, keeping in mind is where we have called out that we could see a little bit of increase coming in the marketing, kind of costs. Moving on to the second question, on the investment, like weâ\u0080\u0099ve said I think that the business now firmly kind of having established which kind of profitability, and the cost levers, kind of well in control, also the fact that the larger investment in terms of opening up the larger segments, like air ticketing, or for instance, hotels, etc, that investment is already behind us. And just keeping that in mind and also the fact that just the overall, like I called out earlier as well, the macro headwind on high fares sort of look at that and look at the organic traffic growth that is already happening we ended up sort of balancing our overall marketing spend which is what we ended up doing in this reported quarter. It will be very different approach and some of the under penetrated segments like hotels accommodation, or a bus ticketing etc, where we are clearly looking at significant market share gains and the growth is kind of far outpacing the growth not just in the market, but also in the online market. Lastly, on your question on UAE again like I said, this is, again, more foray into the adjacent market where we believe we have a reasonable kind of a brand resonance, and therefore, the approach is to kind of do a kind of a gradual, slow investment kind of buildup rather than a big bang kind of a market entry, and therefore, the kind of looking at this being part of our respective segment reporting and so, you will see those numbers kind of coming in as part of the respective segments and therefore, the declining segments also kind of combined with the overall operating metrics being shared for segments. And just from brand loyalty standpoint every hotel chain, global chain will have their own loyalty sort of program as well, to attract their customer directly on their platform, we havenâ\u0080\u0099t really, over the years, seen this queue moving towards it, given the fact that the customers end up sort of doing selection where they want to see, especially in the market like India, compare it with many other hotels before they sort of make their decision to book. But I can tell you on our platform weâ\u0080\u0099ve been adding sort of accommodations like hundreds every quarter literally and also in terms of bookings from our pre-pandemic, last year level, we have already in this segment, weâ\u0080\u0099ve done sort of 125% growth on that. Coming on the hotel side again there has been like I called out almost like 11.5% quarter-on-quarter impact on pricing, which has come in, but hotels overall, we do believe will kind of remain in that broad range of about 17% to 19%. Yes, thatâ\u0080\u0099s the reason I was saying that, while youâ\u0080\u0099re apparently in this quarter also weâ\u0080\u0099ve been actually been able to kind of get too close to about one percentage points gross booking it might kind of vary slightly going forward, depending upon how the recovery patterns kind of going to shape out. I donâ\u0080\u0099t think we kind of looking at offsetting this company or the other cost lines, although one part of it would get offset from the fact that as we build growth here onwards, our mix should start improving on the hotel side and hotels as a better margin structure, which would mean that the blended margins could also slightly improve."
}