{
    "symbol": "MMYT",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-01 15:53:07",
    "content": " As a result, despite had headwinds on outbound travel, we delivered more than 126% recovery on air gross bookings and 117% recovery in overall gross bookings on constant currency basis compared to the pre-pandemic Q2 fiscal year â\u0080\u009920 quarter. Coming to our Bus Ticketing business, we maintained recovery momentum in the seasonally weak quarter, our overall Bus business gross bookings in quarter to recovered to 111% of quarter two fiscal â\u0080\u009920 levels in constant currency terms. During the first half of the fiscal, we have seen gross bookings grow 227.7% year-on-year in constant currency terms and the adjusted profit has come in at about $31.6 million versus a loss of $2 million in the first half during last fiscal year. The other broad highlight for the quarter is that despite Q2 being a seasonally weak quarter and the macro headwinds, we continue to see rebound in travel demand and that has helped us achieve gross bookings of $1.54 billion, which is about 1%, just about 1% lower compared to the seasonally strong previous quarter in constant currency terms. Adjusted margin for our hotels & packages business stood at about $57.4 million during the quarter, witnessing a growth of 74.7% year-on-year in constant currency terms. In our bus ticketing business, during the quarter, the adjusted margin stood at $16.9 million, registering a strong year-on-year growth of 129.8% in constant currency terms. Adjusted margin from the other businesses during the quarter stood at about $7.5 million, which is an 89.1% year-on-year growth in constant currency terms. Now these were largely coming out of the significant investments that we were doing in terms of building online penetration in the hotels business or the accommodation business and also driving significant amount of customer acquisition on the mobile platforms, particularly the mobile apps, which were launched between 2015 to â\u0080\u009917. And part of that, by the way, is also from the airlines because the endeavor really is for everyone to sort of build the volumes given that the recovery is still sort of short-off on in volume terms, short of full 100% recovery in the domestic air market. While the recovery has been fairly robust as we shared both for premium and mid-premium segment, in terms of just surpassing the pre-pandemic levels on gross booking basis very close to 100% sort of recovery even on volumes basis. And I would say less on the supply side, relatively speaking, more on the demand side because of the fact that the prices have also firmed up in the budget segment across the hotel partners or the hoteliers, relative to what it used to be, because there used to be aggressive promotions pre-pandemic focusing more on aggressive acquisition of the customers in this particular segment, which definitely drives more demand."
}