{
    "symbol": "EVLV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 21:42:09",
    "content": " The key takeaways are as follows; revenue was $8.7 million in the first quarter, up 27% sequentially and 118% year-over-year, primarily driven by strong demand in our key verticals and increase in purchase subscription deals and a continuing momentum with our channel partners. Our total contract value of orders booked or TCV was $19.2 million in the first quarter, up 7% sequentially and 128% year-over-year. We were also recently recognized by the National Center for Spectator Sports Safety and Security or NCS4, which tested the effectiveness of the Evolv Express platform. We were also recently recognized by the National Center for Spectator Sports Safety and Security or NCS4, which tested the effectiveness of the Evolv Express platform. As Peter mentioned, revenue in the first quarter was $8.7 million, up 27% sequentially and 118% year-over-year. Remaining performing – performance obligation, excuse me, or RPO was $50.5 million at the end of the first quarter, up 26% sequentially and 186% year-over-year. We're very happy to report that we continue to grow our subscription gross margin, which reached 65% in the first quarter of 2022 compared to 60% in the fourth quarter of 2021 and compared to 54% in the first quarter of last year. Just as important, our subscription cash gross margin, excluding stock-based compensation and depreciation and amortization was 91% in the first quarter compared to 86% in the first quarter of last year. We also had an increase of $2.1 million in payroll-related expenses, primarily reflecting the growth in headcount in the fourth quarter of 2021 and first quarter of 2022 but also the impact of first quarter payroll taxes. Adjusted loss from operations, which excludes stock-based compensation and the one-time items, was $19.2 million in the first quarter, compared to $8.1 million in the first quarter of last year. There were a few other timing-related working capital items that consumed about $2 million in cash in the quarter, including the activation of our new NetSuite ERP on April 1st, which drove us to prepay some expenses prior to quarter end, as well as the general timing of installations, which were slanted towards the back half of the quarter had an impact on billings and subsequent collections."
}