{
    "symbol": "ARCE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 21:49:03",
    "content": " For the first six months of the year, we accumulated revenues of BRL842 million, a 43% increase year-over-year or a 31% organic growth. When excluding the one-off impact from late orders in our operating cost, adjusted EBITDA margin for the first six months of 2022 was 33.2%, 80 basis points above six months 2021. Net revenues for the second quarter of 2022 were BRL 412 million, a strong 61% top line growth year-over-year and representing 26.4% revenue recognition of the 2022 ACV. For the first six months of 2022, they contributed to a 2.4 percentage points improvement in our cash gross margin, offsetting the nonrecurring increase in operating costs resulted from the late orders, as we incurred in higher printing and freight emergency costs. On slide 9, adjusted EBITDA for the second quarter reached BRL111 million, 53% above second quarter of 2021 with a margin of 26.9% or 31.4% when excluding the one-off impact of late orders not considered in the guidance range. Looking at the six-month figures, adjusted EBITDA increased 35% year-over-year with a margin of 30.6%, or 33.2% excluding one-off impact from the late orders. On slide 10, we summarize the year-over-year performance for the quarter for the cumulative six months of 2022 and cycle to date showing the clear evolution of our product cycle with a 52% increase in the adjusted EBITDA and a margin expansion of 100 bps versus 2021 cycle to date or 300 basis points when excluding the one-off impacts from the late orders. Moving to cash generation on slide 12, we present a considerable improvement of our trade receivables profile as we collected BRL519 million this quarter, 30% above the $400 million we estimated when we released the first quarter results with delinquency reducing to 5.6% versus 7.2% of revenues in the first quarter and 10% in the second quarter of 2021. As for the CapEx in the second quarter, we invested BRL43 million, roughly 11% of our net revenue adding to BRL90 million in the first six months of 2022, or 11% of our net revenue right at the middle of our guidance range of between 10% to 12% of revenues being invested in CapEx. We had a relevant improvement in the working capital, positive at 21% of EBITDA from 9% in the first six months of 2021, and an increase in adjusted EBITDA to cash from operations to 114% from 106% in the first six months of 2021, both positively impacted by a better trade receivables profile as previously presented. We also had a slight improvement in the adjusted EBITDA to adjusted free cash flow metric to 33.2% from 32.5% in the first six months of 2021, impacted by a lower effective tax rate and lower CapEx as a percentage of revenues. The first one would be, whether -- how -- basically, how you see the potential for revenue in this school cycle to actually beat ACV given the strong revenue recognition in the second quarter and students having enrolled late throughout the year."
}