{
    "symbol": "GWRE",
    "quarter": 1,
    "year": 2023,
    "date": "2022-12-06 21:45:03",
    "content": " AOE Insurance, part of  Insurance, the eighth largest insurer in the world was able to replace its core system with Guidewire Cloud platform in 12 months, and through greater flexibility, security and optimization, they were able to double their new business capacity by reducing manual steps and cutting claims acceptance time and half. Builders, a midsized mutual insurer specializing in workers' compensation and construction operating in 22 states, selected full InsuranceSuite on Guidewire Cloud platform to replace their legacy mainframe-based system and to establish a new technology framework that improves their customers' experience, increases productivity and supports future growth. In the first quarter, we executed a number of new InsuranceSuite production deployments on Guidewire Cloud Platform, including DEFINITY Insurance, a Tier 2 insurer in Canada known for industry-leading innovation, a two-time winner of Guidewire's Innovation Awards, migrated to Guidewire Cloud platform with over $2.5 billion in personal lines and production. Please proceed with your question. But I thought it was necessary to be crystal clear that there's just so much more of the innovation, the thrust of the creativity and the physical investment in the product going into cloud that I really wanted to make sure that every single one of our customers sees that and thinks about it and thinks about how they can take the appropriate steps right now to ensure that they're aligned with that eventual outcome. Please proceed with your question. Please proceed with your question. Please proceed with your question. But for a customer that's already built their products in the on-prem version of Guidewire, they were looking at having to rebuild that product using Advanced Product Designer, so we built something called APD retrofit, which is a mechanism for us to take most of the product definition that exists on-prem and convert it efficiently to an APD based product, which enables that customer to more smoothly transition to the cloud and take advantage more of the benefits of the cloud version of the product. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. So anyway, without giving you all the numbers of that because it probably changes for each insurance company and each line of business and each sort of segment of the core systems, that's how we generally think about the overall value proposition for Guidewire Cloud. Please proceed with your question. There's been a few conditions that have come up and examples of this where we were able to ensure that the Guidewire Cloud implementations were quickly patched for vulnerabilities in a way that it was just a lot more cumbersome for us to get those patches, those updates pushed out to all of the on-prem customers that were impacted by this."
}