{
    "symbol": "GWRE",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-06 22:59:10",
    "content": " I'm Alex Hughes, Vice President of Investor Relations and with me today is Mike Rosenbaum, Chief Executive Officer; and Jeff Cooper, Chief Financial Officer. Today's call is being recorded, and a replay will be available following the conclusion of this call. Statements made on this call include forward-looking ones regarding our financial results, products, customer demand, operations, the impact of local, national and geopolitical events on our business and other matters. These statements are subject to risks, uncertainties and assumptions and are based on management's current expectations as of today and should not be relied upon as representing our views of any subsequent date. Please refer to the press release and risk factors and documents we file with the SEC, including our most recent annual report on Form 10-K our quarterly reports on Form 10-Q filed to be -- and to be filed with the SEC. We continue to steadily execute and improve in all key of our business, and second quarter results were a good demonstration of this. We combined strong sales execution, great cloud adoption and improve cost discipline delivered than expected. We exceeded our targets for ARR, subscription and support gross margin operating margin products and our performance this quarter gives us a strong fundament to build on for the remainder of this fiscal year. As we continue to lead an industry transition to modern cloud-based core systems, we enable our P&C insurance customers to better engage with their customers, innovate with new products, channels and agile approaches to risk management and structurally grow more efficiently than is possible with the legacy core system. We continue to make steady progress in the key pillars of our strategy, cloud adoption, cloud deployment, cloud efficiency also growing our ecosystem of partners by amplifying everything we do on sales. On the call today, I'll talk about our quarterly progress in each of these areas. Starting with adoption; Q2 sales activity was strong with eight cloud deals including two new customer wins, three migrations, and three insurance suite expansions at existing customers. In the Americas, we had two new customer wins, including one for InsuranceSuite with a $2 billion DWP insurer and another for ClaimsCenter with a $1.4 billion DWP insurer. We also closed two cloud migration dealers, including one for ClaimsCenter with a Global Tier 1 insurer and another for InsuranceSuite with a long time Guidewire regional customer In addition, we continue to work with one of the largest insurers in the world to steadily expand on Guidewire Cloud with a new greenfield initiative. In EMEA, we had three cloud wins, which is a strong quarter for us in this region. Turning to cloud deployment, we continue to build momentum with nine more go-lives on the Guidewire in the quarter. The go live activity this quarter was international with three departments in the United States, three in EMEA, three in Canada customers and it goes up market with one Tier 1 and five Tier 2 deployments. In the quarter, we saw a Tier 1 insurer and a Top 20 P&C insurer in the United States deploying ClaimsCenter on Guidewire Cloud illustrating new GWCP's ability to scale with the largest insurers. At the same time, a startup insurer was able to deploy PolicyCenter and BillingCenter on Guidewire Cloud platform in just a few moments, demonstrating that GWCP can be deployed quickly. This Included AMA Insurance Company, one of Canada's largest motor insurers, deploying InsuranceSuite on GWCP to deliver greater efficiency and better experience for its customers and its agent network. This total includes migration and modernization in greenfield deployment and I believe this speaks to the capability, agility and stability of our cloud platform. We would obviously continue to increase this total in the quarter, and as we do, we continue to improve our operating capabilities and efficiencies with each new deployment and each new lead. We identify ways to improve both for our operating efficiency but more critically, we learn how to make these experiences and projects better for our customers. We also recognize that eventually and I might say inevitably, this number will be in the hundreds or maybe even the thousands. In the past 6 months, we have nearly doubled the number of the production customers on Guidewire Cloud and have been able to effectively control the infrastructure and headcount expenses required to support that growth. Turning to Guidewire Partner ecosystem, we continue to build momentum with both our SI partners and our agency partners. The number of Guidewire consultancy and system integrators grew to operating 21,000 at the end of Q2, up by 27% quarter-over-year platform. The number of cloud certified consultants increased year-over-year passing 6,300 at the end of Q2. The importance of this community is illustrated by the fact that SIs have participated in over 70% of our cloud projects to date and of these, 15% have been SI-led. Now before I hand it over to Jeff, let me just comment on what we see regarding our headquarters. Around 4 years ago, we moved into a beautiful new building in San Mateo, California with approximately 180,000 square feet of cases. This move allows us to realize significant savings while rightsizing and aligning our office footprint with needs of a more distributed, flexible and global workforce. We are thrilled with our second quarter cloud momentum with improved operational efficiency and cost discipline, all of which resulted in a great outcome in Q2 and a strong foundation to build upon as we execute forward our fiscal '23 and longer-term financial targets. The first half of fiscal '23 benefited from minimal ARR attrition and healthy growth in ARR coming from deals years sold in prior years with escalating fees, which we refer to as a ramp deal. Total revenue was $232.6 million, above the high end of our outlook. Cloud strength continues to be visible within subscription revenue, which grew 37% year-over-year to $86 million. License revenue was $73 million, up 5% year-over-year. Services revenue was $53.7 million, up 6% year-over-year. Turning to profitability for the second quarter, which we will discuss on a non-GAAP, gross profit was $131.9 million. Subscription and support gross margin was also 57%, compared to 49% a year ago. Strong subscription revenue growth, combined with our focus on cloud infrastructure efficiency, is having a positive impact. Collectively, we were pleased with our margins in the quarter and with how subscription and support margins are tracking for the year. We continue to make steady progress working through complex early cloud programs and other programs that have been leveraging subcontractors at higher-than-normal levels, and we still expect services to return to positive margin in the second half of the fiscal year. We ended the quarter with $870 million in cash, cash equivalents and investments. In Q1, we announced a $400 million share repurchase program. As part of that program, we executed a $200 million accelerated share repurchase program, which was finalized in February 2023, an aggregate share delivery of 3.2 million shares at an average price of $61.93 per share. We are pleased with our progress in the first half and feel confident in our pipeline for the back half of the year, but feel it is prudent to maintain our outlook at this point in the fiscal year. As I previously noted, the first half benefited from a strong ARR coming from ramp deals and very low ARR attrition. The second half of this year has more difficult year-over-year compares in these two areas, which was already embedded into our guidance. We are excited by the pace of new modernization this year, whereas in the early part of the cloud transition, much of the bookings activity was focused on customer cloud migrations. One, it indicates increasing confidence in the maturity of our cloud platform; and two, it is demonstrating our ability to compete and win at a high level since most of these deals are competitive. We are raising our outlook for total revenue, which we now expect to be between $894 million and $904 million, representing 11% growth at the midpoint. The primary change is we now expect subscription revenue to be $348 million, an upward adjustment of $6 million and representing 34% year-over-year growth. Turning to margins and profitability, which we will discuss on a non-GAAP basis, we expect subscription and support gross margins to be between 51% and 52% for the year, an increase of two to three percentage points when compared to our outlook last quarter and five to six percentage points from the Q4 call. As a result, we now expect overall gross margin of approximately 53% for the year. With respect to operating income, we expect an operating loss of between $17 million and $7 million for the fiscal year. We expect stock-based compensation to be approximately $139 million, representing 1% growth year-over-year. Given this and the impact of the accelerated share repurchase program, we expect a decline in our fully diluted shares outstanding this fiscal year. In general, the positive margin progression gives us confidence in our ability to scale cash flow, but the timing of collections can cause cash flow to fluctuate in a given quarter or year, given how much of our annual collections are due at the end of our fiscal year. We expect ARR to finish between $715 million and $720 million, which represents 16% growth at the midpoint on a constant currency basis. We expect subscription and support margins of approximately 50%, and we expect services margins of approximately 10%, and overall gross margin of between 50 and 51%. As part of this arrangement, we expect to take a write-off of the leasehold improvements, the right-of-use asset and lease liability in the existing location, and we expect the aggregate amount to be between an $8 million to $9 million loss, and this charge will hit G&A. This will impact our Q3 GAAP financial results, but given the onetime nature of this write-down, we will exclude this from our non-GAAP financials, and therefore, has no impact on the outlook provided above. We also have approximately $1.5 million in advisor and moving fees in the back half of the fiscal year, which is included in our outlook for the year. Looking ahead to fiscal 2024 and beyond, we expect to save approximately $10 million to $12 million per year as a result of this move. I understand there's maybe some onetime dynamics there; as you called out, but I wanted to dig into the reallocation from customer specific to kind of platform-specific investments. Look, I think in total, we are seeing -- as we realize benefits of the investments we've made in the platform to be run and executed much more that will afford us the ability over time to repurpose some headcount. And we talked a bit about this in Q1, where we had folks that were previously in our R&D organization, our product development organization that were for a period of time doing customer-specific work and so ended up in our cost of goods sold, our subscription product. And then over time, those headcount have now moved back into the product organization as they are kind of building product sets for the totality of our customers rather than doing customer-specific work and almost like a support life function. But in general, this is just us kind of managing steady progression in terms of how we think about our cost structure to support our cloud business. As you talk to customers, again, a lot of emphasis on kind of core back office efficiency and what that improved from an underwriting standpoint. I think the component of the platform and on both PolicyCenter, ClaimsCenter, BillingCenter side, but I'd say from a new business perspective, mostly claims are quoting. The digital capabilities around that gives them flexibility and agility to roll out new channels, new mechanisms to quote and price products, new places to put those products better and more effective mechanisms for staying connected with agents and agencies and MGAs are very, very important to a significant number of our customers. And even you might think if you're going through a distribution channel, the digital component doesn't quite matter as much. And I just think fundamentally, what we're trying to do for this industry is give them a platform that they can innovate with that they can iterate on. And so that if we can sort of make the projects easier for them to execute on smaller faster, they're going to be able to, in the same way any software company sort of iterates their way to success, you're going to be able to see sort of significant improvements in that marketing and distribution channel for both direct and indirect customers. I would say generally, we are seeing a continuation of what we've reported over the past few quarters in that the insurance industry is not immune, but is not specifically impinged, I'd say, by this. But in general, like I've said a number of times, I think that the time period around which these carriers are thinking about these modernizations and their strategy for these core systems is sort of at least multiyear, if not for a decade. So hopefully, that's clear like slow and steady winter race like Guidewire, we think that the demand is still there. things that we've talked about previously about carriers looking to do sort of more, I don't know, line of business by line of business type of purchasing strategies we still see that being a popular topic of conversation. And that's what gives us -- I think that drove a bit of the success in the quarter, as we called out, it was a good quarter for Europe as well as America. So yes, we feel pretty good about demand right now and feel confident through the end of the fiscal year. We have a bunch of very happy customers in that segment, and we continue to make progress around what I'd say, slowly migrating that customer base over to GWCP. I'd like -- the deal volume, the deal velocity there is not sort of multiples every quarter, but we do have a consistent pipeline and we do have a consistent plan. And most importantly, I think we do have a very strong and positive InsuranceNow customer base. And I really like the sort of growing synergy between the InsuranceSuite and InsuranceNow product lines where we're looking at analytics use cases and like I already mentioned, platform use cases, that enable us to get a little bit of lift about the combination of both of those assets inside of Guidewire. As you pointed out, it enables us to have a strategic presence down market, which I think is just strategically very important. And so when you look at it from a fiscal year perspective, it's easier than looking at it just every single quarter, quarter-over-quarter\n Next question is from the line of Rishi Jaluria with RBC. Mike, I wanted to start with you and maybe understand some of the news around the headquarter swap. I wanted to get a sense for how are you thinking about your own hiring and workforce philosophy in this environment, where you're kind of finding areas that you think are worth investing in, maybe where you're being a little bit more deliberate with headcount additions. So I think first thing you got to recognize, and we're certainly not alone in this that when we switch to completely from a work, we recognize that very sign we could be super productive. And that immediately causes you right away, we can hire people almost no matter where they are in the world. Now even before I even joined, Guidewire had two super presence in Dublin and Krakow Poland where we are doing real strategic product development or in both of those locations. But in the past few years, we've added a significant amount of headcount in India. And we just continue to think that we will be more and more distributed, let's say, as opposed to San Mateo centric. San Mateo, I think, will always be an important part of the company. But I would say if you project out over, I don't know, 4, 5 years, the strategy of looking for great people in different locations, regardless of sort of where they are, we're embracing that. And so what we're trying to do is gravitate hiring and people around hubs and creating sort of reasonably complicated schedules around ensuring that people have opportunities to get together, collaborate in person, but also then go back to their home offices and work individually. And we feel pretty good about that sort of balance that you, I guess, call hybrid work these days. And we feel good about it, and I think that confidence is reflected in the real estate strategy. And then, Jeff, we talked about subscription to support gross margins. And maybe number two, just philosophically how we should be thinking about longer-term gross margins within services and how you're balancing treating as a cost center versus maybe wanting to generate at least a decent profit given it is a pretty significant part of your business. And as we were embarking on the initial part of this cloud transition, we knew that there was a lot of uncertainty that our customers had about the path of going to Guidewire Cloud. We've learned a lot over the last two or three years, and we put in place kind of a multipronged strategy to bring that business back to where it has been historically where we're no longer kind of using that as an asset for us to get business over the line. So that's a big part of the strategy, and we're starting to see that part of the strategy to be realized. And then finally, we did some work internally looking at nonbillable roles and seeing how we could improve our efficiency of kind of billable to nonbillable rules. But in general, and I wouldn't say that this just applies to the Tier 1s. I think dealing with the dealing with all of the work, the project-related go-live work, I think successfully getting these programs live. I think it's very, very helpful. And I think that, that's only going to help us going forward, build confidence with the top end of this market. And I just think especially as it relates to the customer base, we traditionally have been more focused and more successful with Tier 1 and Tier 2 insurance companies. And then, Jeff, just diving into the subscription gross margins a little more. And when we look at this year, we know that there is some work that's required to get our customers from some of the earlier ski slope releases to the later ski slope releases. And so some of those costs have shifted into Q3 and Q4 but when we look at it all together, we started the year with an outlook of around 46% subscription support margins are now guiding to 51% to 52%. Q2 was a very healthy bookings quarter for us, a little bit higher than what we were expecting going into in the quarter. Maybe just kind of check the box and say, and we're moving to Guidewire. So for an existing Guidewire customer that is already up, already running with a deployed claim center, deployed pulse center in the deployed billing center, our whole strategy is to make it highly unlikely that it would make any sense for them to replace that implementation with something other than Guidewire. The switching cost is not 0, as we've talked about previously, there is some amount of switching costs and it is a project. But I would hesitate to say that I have I'm trying to think if I've seen a single situation in which somebody has said, we're going to put the whole thing kind of going to open up the whole strategy and look at it just because it's so clear that most of the implementation of Guidewire is supported in Guidewire Cloud, right? We didn't start over with the product made any sense, and it would have caused us to have to abandon that customer base. And so we're not yet -- that isn't just a perfect push the button and the thing upgrades, but it's much, much better and much more logical for a big deployed, excuse me, insurance company sort of opening it up to competitive bid. And we do see existing Guidewire customers saying, \"Hey, even though we've got Guidewire already for this new line of business that's not yet modernized, they will do RFPs for that, and we will compete for that business and we compete favorably in those circumstances, and that does occur. But for the existing base, it's unlikely that, that would be a dynamic we would worry about, just not because we're the best. And then, Jeff, not to believe the point too much, but obviously, as you get more scale on GWCP, in particular, how much more of the long-term operating margin target and I guess within that, obviously, gross margin. But how much of those reliant on just getting more and more customers to migrate over versus some of the other things you outlined earlier on the call, like reducing headcount or I guess, restraining headcount growth and some of these others. I kind of think business, $4 billion of ARR and we need to scale into that $1 billion of ARR. So that does mean that in order to get to our midterm targets, which have us at $1 billion of ARR, we need to add new customers and continued steady progression of migrating our installed base and winning new business. And in the case that -- you could call it the pivot we made, the decisions we made around prioritizing, constraining headcount growth in these areas and the focus that we made on optimizing our infrastructure spend are starting to work. We -- the platform marginally will scale much, much more efficiently now -- and so that's why we're so pleased with the results on the margin side this quarter is that, that strategy is now working. So great question, but I really want you to understand that the philosophy here is, like Jeff said, we've built the platform to convert this customer base and win the majority of Tier 1, Tier 2, Tier 3 insurance companies in the world, and I think we're on a path to doing that. The first thing I would say is I genuinely believe that this will have a big effect on every software company in the world, every person in the world. I think it's a very, very busy. And it's almost like new in the technology landscape has been invented, and we are all going to go find ways to leverage it super effectively. In fact, these systems can generate code is maybe almost miraculous in my opinion, but very, very exciting, no matter what you think. So we think that over time, we'll improve the efficiency around implementations, maybe upgrades. But the -- but I think of it as every developer in the world will get a little bit more productive as we figure out ways leverage this effectively and leverage it reliable, it's sure way. There is a whole host of capabilities that you could imagine around customer interactions, claims management, quoting, the back and forth that is associated with talking to consumers about insurance policies and things like that. And I think fundamentally, the way on that side of it, I think Guidewire will certainly play a role in the innovation side of this and creative ways that we can deploy this in the features of our service. But I also -- as one of our colleagues here, John Mullen pointed out to me today, actually, the fact that we have this marketplace that exists and facilitates start-ups and insurtech and smaller companies being into Guidewire deployed is a really big, big boost, I think, to Guidewire, but especially Guidewire customers. I think I said this before, ChatGPT sort of opened everybody's eyes to this. But I'd say, fundamentally, you're going to need a modernized core system at the base of your operation. if you really are going to fully leverage tools like generative AI, I think that, that's a fundamental step. But like I said, it's early, early days. It is early, early days, and the excitement about it comes from the fact that, like I said, I'm not the only one that genuinely think this is a miraculous level invention. So yes, we work with different carriers in different ways in this particular one. So as opposed to doing one massive deal with us, they look at it as when this line of business is ready to modernize or this line of business is ready to launch and that project is ready to kick off. Not everybody wants to approach it that way, not all of our customers do. As you say, hey, we got that done successfully, and that's going well. We've seen this with a couple of different carriers over my tenure here at Guidewire where they've got a baseline project, but there's an acquisition that comes sort of after the initial project has been kicked off and that acquisition creates an opportunity to do another line of business with the new implementation of Guidewire. And like I said, the name of the game for me is project go-lives, successful projects, build confidence build success, ensure that we're just steadily executing because that increases the likelihood that that next line of business, it will just be logical to put that on to Guidewire in the platform. And then just on the new modernization activity that's been talked about a couple of times, would be kind of a reasonable or maybe harder sales cycle that being associated with these. And as confidence builds as our experience builds, as the risk costs associated with successfully executing these monetizations, as those things get more controlled, you do see the potential, I'd say, for the pace to pick up thought, and that's for many, many times. And we've got deals that are perfectly logical and eventually are going to happen, but help pop up either on the regulatory side or on the -- just the baseline insurance side sort of catastrophe like other risks and events can have an impact on this. Just to add on, I mean I think this is always part of our plan. I think so far so on the macro has been fairly like but maybe one on the competitive environment, if I may. I think my talk competitive is that things have not changed, and we still have competitors regardless of the circumstances around the ownership of those competitors, they're still out there. I'm super, super happy with our progress to date and I think that I'm positive on our progress is positive about the future at Guidewire. And I think that, that will have impact on our ability to compete in the market successfully. It's like very clear to me, and I think it's becoming clearer and clearer that that's going to be -- but the ultimate were in this market will be Guidewire, but we still do have that competition. And so the news that you're referring to is pretty recent we -- but like my message to the team here at Guidewire, let's say focus, let's keep executing, and let's just keep playing our game. Jeff, stepping away from margin maybe to ARR for just a moment. You mentioned some of the positive first half impacts, but I think called out tougher compares in the back half. So just hoping to  and that comment a bit more, if there's anything macro or anything else that might be driving more conservative stance in the revs of your outlook for ARR. So we usually move our guidance around too much the earlier part of the year, this comp. So just when we look at activity in a material like ARR, it's still happen that this year, the first half was pretty healthy in that regard. This year, we're still expecting very solid retention rates around kind of 3% ARR attrition is how we always think about modeling our business. And so those are some of the dynamics that are causing net new ARR to slow down a little bit in the back half of the year, but that was always embedded into how we thought this year would play out. So the go-live activity has a lot to do with how the projects proceed, whether or not there's any delays and anything that you catch and whether or not those goal updates are pushed out. I would say generally, all -- unlike, I think, every project dynamics a bit like this is like you somewhat aspirationally at the beginning and then unfortunately, you get circumstances that cause a go-live to push out. Because when you do the math, we like to do these over the weekends because it inevitably involves some transition downtime for these companies, these core systems when they actually swap over. These things are never perfect and so it wasn't exactly every single 16 months ago that we thought would go live in the quarter, it went live in the quarter. And like I said, I think that this is going to end up being -- I kind of tried to point to this in my prepared remarks, it's like this is going to be just a steady, steady part of Guidewire from now and for time just the numbers in the customer base and the new business activity that we see. If we keep doing deals and we keep filling the pipeline, we keep closing deals and then fill in the pipeline for go-lives, that activity, that go-live activity feels just keep going as it does, the demand on the platform will keep growing. And because we're able to control the headcount and the infrastructure expense, the margin around that product will keep improving. So I'm just very, very excited about the progress, the execution and maybe the determination of the people at Guidewire to make those projects happen. Obviously, a lot of good cost savings stuff this year between hyperscaler contract negotiations and real estate consolidation. I think on the overall subscription and support margins, we're clearly tracking a little bit ahead of our FY '23 targets. And then in general, when we look at some of the cost savings initiatives, the company is doing a number of activities that I think give us a little bit of confidence that we're tracking a bit ahead of the plan. So at a high level, that's how I think about it. I just wanted to say thanks, everybody, for participating today. And we had Tier 1 and Tier 2 insurers, going live this quarter and like we talked about, driving margin improvement."
}