{
    "symbol": "INFA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 22:10:06",
    "content": " We achieved four new annual milestones â\u0080\u0093 we grew cloud ARR to over $450 million, subscription ARR to almost $1 billion, and surpassed $1.5 billion for both total ARR and total revenues. Momentum continued in Q4 from customers spending more than $1 million in subscription ARR, increasing by 35% year-over-year to 206 customers. In my conversations with customers, CIOs, CDOs, and business buyers across the globe, our partners and as I look at market trends, including Informaticaâ\u0080\u0099s annual CDO Insights report, all clearly state that data management and digital transformation led by data is enabling â\u0080\u0093 enabled by a cloud delivery model will continue to be a top priority of IT spending in 2023 and beyond. Total ARR for the fourth quarter of 2022 increased to 11.5% year-over-year to $1.52 billion, at the high end of our revised guidance range, driven by strong new business sales and Subscription renewals. Cloud ARR increased over 42% year-over-year to $451 million, exceeding the high-end of our October guidance range by $20 million. Turning to total Subscription ARR, Q4â\u0080\u0099s result of $994 million represents a 24% year-over-year increase, $4 million above the high-end of our guidance range, driven by new subscription customer growth and high renewal rates, in both our cloud and self-managed products. Lastly, maintenance ARR finished in line with expectations, down 6% year-over-year at $523 million, with a strong renewal rate of 96%, up one percentage point year-over-year. Using exchange rates from Q4 last year, international revenue would have been approximately $16 million greater in the quarter, which would have represented an international revenue decline of 4% year-over-year. If we had carried the same mix of 70% cloud and 30% self-managed net new into our 2023 guidance assumptions, we would have forecast approximately $80 million in additional FY2023 GAAP revenue. We expect Cloud ARR to be in the range of $604 million to $614 million, representing approximately 35% year-over-year growth. We expect non-GAAP operating income to be in the range of $400 million to $420 million, representing approximately 17% year-over-year growth. Our guidance for the first quarter ending March 31, 2023, is as follows, we expect GAAP total revenues to be $352 million to $362 million, representing approximately a 1% year-over-year decrease. We expect Cloud ARR to be in the range of $462 million to $468 million, representing approximately 35% year-over-year growth."
}