{
    "symbol": "NU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-17 11:35:43",
    "content": " In the first half of 2022 NuBrazil generated an account to profit of $13 million, up from a loss of $19.7 million in the full year 2021, while continuing to provision significantly as a result of the continued fast growth of our credit portfolios, as well as expensing large investments of new products and features such as Cripto, NuTap, NuPay investments, fixed financing, et cetera. With regards to the evolution of our credit card interest-earning assets in Brazil or IEP, it's important to contextualize, that we have been consistently expanding our credit card IEP, mainly as a result of launching new features that allow our customers to use their credit cards as financing means. Deposits continued to grow at a fast pace during the second quarter, up 87% year-on-year on an FX-neutral basis, with an average funding cost below CDI, Brazil's risk-free rate. Our core consumer finance products, credit cards and personal loans, presented above industry average profitability with ROEs in excess of 80% and 120% respectively, even in this more uncertain environment proving the robust levels of credit resilience. So it's resulting in growth that is â\u0080\u0093 that has not increased as much if you will compared to prior time periods but is absolute levels of growth that are fairly stable about $5 billion in personal loans we've added in the quarter which has been consistent with the prior couple of quarters and about five million new customers, which is also consistent with prior time periods. But if you take a look at our four cost pillars, cost to acquire, cost to serve, cost of risk, and cost of funding and we see the examples of other digital banks around the globe that have also started with consumer credit, they have been able to obtain levels of profitability and returns materially higher than those of incumbent banks in the markets in which they operate, even in markets that have substantially lower NIMs than Brazil. Jamie, I think from where I was coming is, if you take a look at the product penetration that we have across our customer base, you largely see that we have, I want to say about slightly more than 60% of our customers with credit card, slightly more than 80% of our customers with bank account, but about 5% of our customers with personal loans. And the way PIX is developing, we've effectively seen a few years everybody from let's say seven, eight years old to 90-plus will have an app with smartphone users in PIX And we think that ultimately means it's an addressable market of something like 170 million Brazilians, that will be connected with a smartphone, paying for absolutely everything paying people, paying businesses and being a really integral part of their life."
}