{
    "symbol": "NU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 23:43:11",
    "content": " I would now like to turn the floor over to Mr. Guilherme Vieira, Investor Relations Senior Manager at Nu Holdings. Our credit portfolio, with credit cards and personal loans, grew significantly above market, at 126% year-on-year, to a total of $8.8 billion, while maintaining healthy credit levels and strong unit economics. Our core consumer finance products, credit card and personal loans, continued to grow at a healthy pace during the first quarter, up 126% year-on-year on an FX neutral basis to a total book of nearly $9 billion. This was significantly above market growth rates, both for credit cards and personal loans, which, again, indicate that we continue to gain market share in these products. And finally, we have continued to have best-in-class unit economics, given the low customer acquisition costs, increasing average revenue per active customer and decreasing average cost to serve, allowing us to have an LTV to CAC of over 30x and already generating significant profitability in our first core product, Brazil credit cards. We ended Q1 2022 with approximately $3.4 billion in excess capital in our balance sheet, which gives us also the opportunity to continue taking share in our respective markets, while being mindful that the world has changed and maintaining a close eye and discipline in all our decisions, particularly when it comes to consumer credit and cost discipline. I would now like to turn the floor over to Mr. Guilherme Vieira, Investor Relations Senior Manager at Nu Holdings. Operator, please open the line. But the majority of our customers today in both credit and lending are customers that had other credit cards that had our personal loans and are deciding to effectively transfer their main relationships all to Nu Bank, and so that means we're able to get a lot of information from the market from credit bureaus, from the Central Bank. Operator, please open the line. Please open the line. Please open the line. As I said earlier, we have a very large consumer base, over one-third of that inflation  for customers, but we still have a small share of their credit portfolio, even in personal loans, we have around 2% of a market that has over BRL 200 billion of market. Please open the line. In fact, consumers who have adopted our three core products, bank accounts, credit cards and personal loans already have OpEx of about $35 to $40, so personal loans as we increase the penetration, both upsell and cross-sell is expected to bring material ARPAC to the equation. We're obviously working -- we see a significant still opportunity to increase that when we see such a slow -- still the point I mentioned we have a large customer base, but low market share in lending or credit card or limits are still small. Please open the line. Please open the line. Please open the line."
}