{
    "symbol": "DOW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 12:27:09",
    "content": " The terminal will be colocated on Dow's site in Stade, Germany and will satisfy up to 15% of Germany's current natural gas demand, helping enable a stable, cost-effective and sustainable supply of energy to Europe in support of the region's economy, Dow's business interests and our communities and our employees. In the Packaging & Specialty Plastics segment, operating EBIT was $1.2 billion, up $6 million year-over-year with operating EBIT margins down 400 basis points as price increases in the United States and Canada and Latin America were partly offset by rising raw material and energy costs in all regions. Sequentially, operating EBIT was down $208 million and operating EBIT margins declined by 390 basis points primarily due to higher raw material and energy costs in Europe. Operating EBIT was $661 million, up $335 million year-over-year as operating EBIT margins increased 560 basis points, primarily due to strong price momentum in both businesses and volume gains of 1%. Sequentially, operating EBIT was up $66 million, and operating EBIT margins increased 150 basis points as strong prices and lower planned maintenance activity in the core business offset higher raw material and energy costs. Operating EBIT margins increased more than 1,600 basis points due to strong price gains and an 8% volume increase on improved supply availability and robust stand for silicones in personal care and high-performance buildings and demand for architectural coatings. In 2022, our in-flight growth programs remain on track to deliver a run rate of more than $300 million in underlying EBITDA with a focus on targeting downstream and sustainability-led applications across all operating segments that will generate strong returns. In Packaging & Specialty Plastics, our FCDh unit in Louisiana is on track to start up in the fourth quarter of this year and will contribute more than $75 million in run rate EBITDA with a return on invested capital greater than 15%, giving us the key proof point to accelerate the licensing of our technology. In Industrial Intermediates & Infrastructure, our alkoxylates capacity and other efficiency investments are also on track to start up this year and in total, are expected to generate more than $50 million in run rate EBITDA with returns greater than 20%. All combined, these investments represent a 70% increase in our industry-leading downstream alkoxylates capacity over the next several years, targeting high-value applications where we're delivering 10% to 15% annual growth rates. Lastly, in Performance Materials & Coatings, we're also executing a series of incremental downstream debottlenecking projects with more than 20 projects expected to be completed this year, collectively contributing approximately $100 million in run rate EBITDA with return on invested capital of more than 20%. All in all, by 2025, we're projecting a cumulative underlying EBITDA improvement of approximately $2 billion, driven by projects like incremental high-margin polyethylene and functional polymers capacity to serve growing demand for flexible packaging, debottlenecking projects to enhance our mix toward polyurethane systems serving mobility and consumer applications, and new capabilities to formulate differentiated silicones, including silicone adhesives for next-gen electronics, mobility and infrastructure applications. Basically, what we're guiding to is to take the first quarter EBITDA actuals, subtract the $225 million of turnaround headwinds in P&SP and Industrial Intermediates & Infrastructure and that's our best estimate today of what we see with all the puts and takes of where second quarter EBITDA is likely to land."
}