{
    "symbol": "DOW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 11:14:06",
    "content": " Sequentially, operating EBIT was up $202 million and operating EBIT margins increased by 120 basis points due to improved product mix and increased integrated margins despite higher raw material and energy costs, primarily in the United States and Canada. Moving to the Industrial Intermediates & Infrastructure segment, operating EBIT was $426 million compared to $648 million in the year-ago period, as increased raw material and energy costs and planned maintenance activity were partly offset by higher pricing. Sequentially, operating EBIT was down $235 million and operating EBIT margins declined by 490 basis points also primarily due to higher costs and planned maintenance. And finally, the Performance Materials & Coatings segment, reported operating EBIT of $561 million, up 336 million year-over-year, as margins expanded by 960 basis points, primarily due to price gains for both silicones and coatings applications as well as improved monomers supply compared to the prior year. Industry siloxane capacity additions and supply recovery in China, along with higher energy costs are expected to generate a $200 million headwind in the quarter. In the near-term, our in-flight investments remain on track to deliver an incremental underlying EBITDA run rate of approximately $2 billion by year-end 2025, which includes approximately $300 million of run rate EBITDA in 2022 with growth levers across each of our operating segments. Our 3-year average EBITDA is now at more than $9 billion, driven by our early industry cycle growth investments, and efficiency programs that have collectively raised our underlying earnings above pre-pandemic levels, as well as improved our cost position versus the previous cycle. Good morning, Jim and Howard. Good morning, Jim and Howard. And then you got to add the net $50 million turnarounds on top of that, and that's really split primarily P&SP $75 million headwind; PM&C flat, and then there's a tailwind sequentially and Industrial Intermediates is at $25 million because the turnaround -- the big turnaround was behind us."
}