{
    "symbol": "IRDM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 13:17:04",
    "content": " Yes, so I think it's only been in the last year or two, probably through all these discussions around direct to smartphone capability that everybody suddenly woke up and realized that the L-band in our neighbor next to at the S-band are probably the most ideal spectrum for that kind of connectivity for small portable consumer type products of any sort. I would -- the way I think about it is if you look at our broadband business, we put up a 19% growth in the quarter, there's not much government, we haven't taken much of that $100 million away, so thatâ\u0080\u0099s just -- that takeaway should be helpful in that broadband growth as we look forward. It is some takeaway, but it's also if you looked at operational specific ways, the kinds of applications that were being demonstrated across the board, things like UAVs, and safety services and video, real time video in really remote places, including at the poles at South -- at the South pole and across wide ranges, those were some lots of new applications that can't be done any other way than really Certus. And that's -- we'll do some work on and help you understand maybe next year at this Investor Day, which I think we're kind of, by the way, sort of  in May sometime, but we'll see exactly where that works out to be. Well, I think that you're going to see at least in the next couple of years, whether it be Apple or the approach that we take will be a bit more -- users are not going to be people, it's going to be unexpected sort of use around the world. I think what we're seeing and what we hear from Garmin and all our other personal communication providers that work today is that they really have very dedicated and focused applications for recreational users, for hikers, for emergency workers, for maritime users, and they really focus on delivering specific things to those users who kind of need to depend on a service and it's obviously been very successful."
}