{
    "symbol": "IRDM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 12:14:02",
    "content": " Iridium continues to execute well, generating total revenue of $168.2 million in the first quarter, up 15% from the prior year's quarter. So far right now, it looks like we're going to clear most of the backlog at different times during the second and third quarter, but we're really not going to completely get out of being able to meet any kind of additional demand until almost near the end of the year. It will include our financial systems, our financial planning systems, our underlying financial systems, some of our employee management, performance and other supply chain issues also are our technology development that needs to even have some -- so not major, but around the edges, we think it's time particularly given all this growing success we're having to put some of that back into the business and make ourselves better as a result. Well, broadband continues to, I think, pace our expectations here as we continue to have more products from our partners that we're able to meet more market segments like moving beyond maritime and land into aviation and government as we move down from the original sort of Certus 700 products to Certus 200 and Certus 100, we continue to see growing activations, growing adoption. I think you're going to start sort of seeing that product hit the consumer segment this year and next year where anybody can sort of buy a product that could work say on the clear sheet of a small airplane or on a boat or on -- it can be portable devices, moving from sort of power devices into the portable range. So in terms of the guide, maintaining the service revenue growth target, I would think with all the strong demand, the strong equipment sales, that would translate into service revenue down the road, maybe it's not this year and that's why the guide is unchanged. It's something that they're going to award this year, and we're -- hopefully, we have put together the best proposal with our partner, and we'll hear good news about that. So we don't tout it because it feels like it's not going to take off our big demand business for '22, but it's just does feel very positive for sort of long-term growth and how we're positioned with it. But I saw even this week that they were kind of touting how they're supporting Isavia there in the sort of the Northern region, quite a large airspace where aircraft travel over the poles, that that's open and operating and I think you're just going to continue to see a lot of long-term positive information at Aireon. I don't know what to tell you other than I think people -- it's all coming together, all the work that we've done over many years to have a great network that performs very well that is price and position appropriately and our partners really are excited about the potential they're seeing in all the different ways that they can use our network to meet their needs."
}