{
    "symbol": "IRDM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 15:34:06",
    "content": " Our business has shown remarkable stability and growth through a variety of business conditions and economic cycles over our history, as we posted compounded annual growth rates of 9% in service revenue, 10% in operational EBITDA and 16% in subscribers over the last five years alone. As for Iridium's corporate priorities, they center around our commitment to our business partners, technology innovation and communities we touch in our ongoing efforts to unlock new business growth, all while delivering returns to shareholders. 2023 will be another year of service revenue growth in maritime, land, mobile, aviation and IoT, which will generate incremental free cash flow to support the return of capital to our shareholders and ongoing deleveraging. Itâ\u0080\u0099s now in the hands of our partners and is available for Iridium Certus 100 service and will roll out to our higher transmission services here in the first quarter, as well as in the new narrowband IoT module, we're calling the Iridium 9704, which is in development now for 2024. exec, our latest generation Wi-Fi hotspot product for voice and data connections to smartphones and tablets of all types. All the networks, including the one you just described there, are really going to take a long time to develop and are going to be what I would call lower end narrowband IoT segments that are in general not real time, not two-way, and will take some time to really develop because they -- while they can launch some satellites in the next year or two, it's not going to be permanent coverage or anything to provide people real-time sort of services. And we still see -- and by the way, another thing that could be affected I suppose by smartphones down the road, but again purpose built the first responders, the people who need satellite devices, backup services they provide, I just don't think is going to change that dramatically in the coming year even with all that for at least for a long time."
}