{
    "symbol": "MTX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 16:47:06",
    "content": " Our pricing actions more than offset the higher inflation and our acquisitions delivered, all of which offset the market weakness we experienced and resulted in operating income of $67 million, 6% higher than last year. We've steadily grown sales in the age of foundry and paper and packaging markets and sales there this quarter excluding China, increased by 7% driven by a 13% growth in India as our PCC and metalcasting business continued to strengthen positions in their respective markets. Our continued selling price actions drove sales higher by 13% over last year, and improved volume and mix added 6% to sales driven by higher metal casting volumes, continued growth from new contract wins and refractories, higher levels of activity in our project-oriented businesses, as well as an increase in sales from new products. Sales for the Performance Materials segment were $290 million in the third quarter, an increase of 16% versus the prior year and 24% higher on a constant currency basis. Environmental product sales grew 20% versus the prior year on strength and remediation, wastewater and filtration activities, but were 12% lower sequentially due to the timing of projects and building material sales were slightly lower year-over-year and sequentially, as higher levels of project activity in North America were more than offset by slower activity levels in Europe. Operating income excluding special items was $38.2 million and represented 13.2% of sales, 20 basis points above the prior year and sequential quarter, as pricing actions offset inflationary cost pressures. Third quarter sales in the Specialty Minerals segment were $166 million, an increase of 13% compared to prior year and 18% higher on a constant currency basis. Specialty PCC sales were 40% higher year-over-year, driven by continued strong demand in North America, higher pricing and the asset acquisition in the fourth quarter of last year. Refractory sales increased 13% versus the prior year and sales grew 20% on a constant currency basis, on the continued ramp-up of new business volumes and higher pricing to cover inflationary cost increases. That's grown from zero a couple of years ago, as we've entered into this market we're growing -- so this will be probably in the $20 million $25 million range growing very quickly, as I mentioned this quarter."
}