{
    "symbol": "MTX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 22:59:06",
    "content": " Operating income of $68 million was 15% higher than last year, and a record for a first quarter and earnings per share of $1.36 was a record for any quarter. We've commercialized multiple online-only products to support our e-commerce growth strategy, and are also developing new product offerings in Asia where pet care sales grew 36% in the first quarter versus last year. First quarter sales were $519 million, reflecting strong sales growth both year-over-year and sequentially. Operating income, excluding special items was $67.8 million in the first quarter, and the year-over-year operating income bridge, on the lower left of the slide, shows that operating income grew by 15% compared to the prior year. Sequential operating income bridge shows that inflation continued to accelerate into the first quarter, however, pricing actions delivered nearly $26 million to more than offset inflationary costs. First quarter sales for Performance Materials were $272 million, an 18% increase over the prior year and 6% higher sequentially. Sales in household, personal care and specialty products were 30% higher than the prior year, and 13% higher sequentially, driven by continued strong demand for consumer-oriented products and the Normerica acquisition. Specialty Minerals sales were $163 million in the fourth quarter, 10% higher than the prior year and 15% higher sequentially. First quarter sales for refractories were $84 million and were 14% higher than the prior year, driven by favorable mix from new customer wins and selling price adjustments implemented to cover inflationary cost increases. First quarter operating income for the segment was $16.5 million, an increase of 38% compared to the prior year. In summary, the second quarter is typically our strongest quarter of the year and we expect another record quarterly performance with operating income increasing by 8% to 10% sequentially, which represents around 15% growth versus last year. And lastly, really, we've signed over -- now we're up to about $120 million of new sales over the next five years and that puts us in a really good position to continue to grow and keep our margins strong. And that's coming from continued volume growth, based on stable market conditions, expanding those margins, getting pricing in the place that value -- that we believe appropriately values our products, our technologies and our partnership with our customers, and pulling that all together to deliver what we think is a strong year. But for now, we think at least through the third quarter, you're going to see that kind of 5% average number over prior year. As Matt mentioned, we saw $2 million worth of energy cost increases alone in these businesses, primarily in paper, in Europe, given what's going on, that we're going to carry. So I think we saw some strong growth due to some things in December, but I think if you take the March performance and you take that up the second -- out of the second quarter, that's the construction, the automotive, the paper, the seasonal activity, you're going to see, and I think you're going to continue to see some growth into the second."
}