{
    "symbol": "QIPT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-17 15:13:03",
    "content": " We are thrilled with the robust financial performance seen in fiscal Q2, which saw revenue of $33.6 million, improving organic growth over fiscal Q1 2022, strong operating cash flow and adjusted EBITDA margin acceleration to 21%. The company generated revenue of $33.6 million in second quarter of fiscal 2022, up 38.4% from second quarter fiscal 2021. Adjusted EBITDA for the second quarter of fiscal 2022 was $7 million compared to $5.4 million for the second quarter of fiscal 2021, representing a 31% increase year-over-year. Revenue for the six months ended March 31, 2022, increased to $63 million or 34% compared to the six months ended March 31, 2021. Adjusted EBITDA for the six months ended March 31, 2022, increased to $13.1 million or 23.5% compared to the six months ended March 31, 2021, and represented 20.7% of the revenue. Cash flows from operations for the six months ending March 2022 was $12.2 million compared to $6.6 million in the corresponding period ending March 2021, an increase of 84%. We are seeing positive momentum across the organization, and I'm very pleased to see revenue reaching $43.6 million for our fiscal second quarter with a strong adjusted EBITDA margin at 21% as we continue through the integration process of our recent acquisitions. Looking at our two most recent transactions on January 1, 2022, we announced the acquisition of At Home Health Equipment, a business with operations in Indiana, reporting trailing 12-month annual revenues of approximately $14 million, $1.6 million in net income and anticipated adjusted EBITDA of $2.9 million, reflective of a 22% margin post integration. On April 19, 2022, we announced the acquisition of Cutlite Medical, a business with operations across 7 U.S. states, reporting trailing 12-month annual revenues of approximately $7 million and with anticipated adjusted EBITDA of $1.5 million, reflective of a 20% margin post integration. The first being a focus on scale and hence, targeting companies in the revenue range of $5 million to $20 million consistent annual EBITDA margins between 10% and 20% and large distribution volume, which can be leveraged by our platform. At this time, I want to reiterate our outlook for calendar end 2022, representing fiscal Q1 2023 based on the current operations, market trends and completed and prospective acquisitions, we are reiterating our outlook for annual run rate revenue of $180 million to $190 million with $38 million to $43 million in run rate adjusted EBITDA. I'll also add in that is that it's important and that's for us to continue to build scale and that which is why you've kind of seen that margin maybe not particularly grow, but you have seen us maintain that 20% plus adjusted EBITDA margin even despite the inflationary pressure. So -- but once again, in that the -- truly the national contracts and that really allow us in that to enter into continuum areas in that and also on the acquisition front, when we acquire a company, if they don't already accept that insurance contract that we're immediately able to start accepting the insurance through the infrastructure, which allows us to kind of leverage in that those operations and build that scale that we've been talking about."
}