{
    "symbol": "QIPT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-22 15:15:29",
    "content": " As we carried out our strategic growth plan and future vision, fiscal 2022 has been another active and successful year for Quipt, which included 37% year-over-year revenue growth and continued strong margin stability. We saw healthy operating cash flow, consistent bad debt expense, and our adjusted EBITDA margin was very strong at 20.9% for fiscal 2022 and 21% for fiscal Q4, this performance exemplifies our ability to aggressively scale and increase revenue through strategic acquisitions without compromising our billing capabilities and overall margin profile. In summary, Quipt has had an extraordinary year reaching nearly $140 million in revenue, achieving over $29 million in adjusted EBITDA, growing to 94 locations in 19 states and surpassing 200,000 active patients, all while maintaining our impressive operating margins. Through the company's continued use of technology and centralized intake processes, respiratory resupply setups and/or deliveries increased to 231,495 for the year ended September 30, 2022, compared to 158,072 for the year ended September 30, 2021, an increase of 46.4%. The company's customer base increased 23% year-over-year to 173,203 unique patients served in fiscal year 2022 from 140,996 unique patients in fiscal year 2021. Revenue for fiscal year 2022 was $139.9 million compared to $102.4 million for fiscal year 2021, representing a 36.7% increase in revenue year-over-year. Adjusted EBITDA for fiscal year 2022 was $29.2 million at 20.9% margin compared to adjusted EBITDA for fiscal year 2021 of $21.4 million, representing a 36.5% increase year-over-year. Revenue for Q4 2022 was $40.1 million compared to $29.1 million for Q4 2021, representing a 37.8% increase in revenue year-over-year. Adjusted EBITDA for Q4 2022 was $8.4 million, at 21% margin compared to $5.5 million for Q4 2021, representing a 54% increase. Full year adjusted EBITDA margins were also very strong at 20.9%, given the present inflationary environments and the acquisitions made in fiscal 2022 that created a short-term lag to margin, we are very pleased with the margin stability and expect margins to improve further as calendar 2023 progresses. The 5 acquisitions in calendar 2022 added over 45,000 active patients, $35 million in revenue and over $7 million in additional adjusted EBITDA once integration is completed, which are all currently on schedule. As of fiscal Q4, we set at over $160 million in run rate revenue and over $33 million in run rate adjusted EBITDA, we are very confident in our aggressive growth trajectory as we move into 2023 and look forward to updating investors on our successful progress. That stayed pretty steady for us in that -- actually, over the past several years in that with that product mix in that, and we would continue to expect that in that to stay on that kind of 80% respiratory side and the other 20% being kind of other invert DME supplies and things like that and other supplies as a total percentage of revenue, although we are starting to look at different product categories that can complement in that those -- and help those other respiratory patients that we do have. And I think from what we are looking at in terms of fiscal Q1 '23 and going forward, now we are going into the reversal of that casketing effect where you would now see not only the device setups are increasing, but then as you go into the next few quarters, 3, 4 of 2023 and going into Q1 of 2024 as well, we will start seeing the -- again, the good casketing impact of new setups with increased recurring supply that continues to grow and you see the full impact of that about at least 5 quarters out is when you kind of max it out, right, in terms of recovery you got from the additional setups that we are going to do starting this quarter. So we can all factor in what that organic growth would look like just from a CPI increase plus the additional growth from this availability of devices and the recurring nature of those, we do suddenly expect us to, at a minimum, hit our historical growth rate, which was kind of somewhere between 7% to 10% in the past to hit in 2023, again we hope that we actually see that."
}