{
    "symbol": "QIPT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-16 14:13:14",
    "content": " On this call today, I will provide a summary of our significant growth activities year-to-date and update on the continued bullish regulatory landscape, the current supply chain environment which has been improving and update our core business with a focus on our record-breaking third quarter fiscal 2022 results. These positive trends and continued operating resilience led to another record financial performance in our fiscal Q3, which saw revenue of $36.7 million, 2% sequential organic growth from fiscal Q2. The Company generated revenue of $36.7 million in the third quarter of fiscal 2022, up 40% from the third quarter of fiscal 2021 and sequential quarter-over-quarter growth of 2%. Adjusted EBITDA for the third quarter of fiscal 2022 was $7.7 million compared to $5.3 million for the third quarter of fiscal 2021, representing a 44% increase year-over-year. Revenue for the nine months ended June 30, 2022, increased to $99.8 million, a significant increase of 36.2% compared to the nine months ended June 30, 2021. Adjusted EBITDA for the nine months ended June 30, 2022 increased to $20.8 million or 30.4% increase compared to the nine months ended June 30, 2021, and represented 20.8% of the revenue. As Hardik mentioned, since April, we have closed four attractive acquisitions adding over 30,000 active patients, equating to over $25 million in revenue and over $4.5 million of adjusted EBITDA post integration. Moreover, opening de novo locations where it makes sense, leveraging the numerous cross-selling opportunities that exist, adding new verticals of service and continuously optimizing our processes, signing additional national health care insurance contracts with major commercial payers in the United States, further expanding our patient accessibility, looking at opening de novo locations to complement existing infrastructure across our markets. The first in a focus on scale and hence, targeting the revenue range of $5 million to $20 million, consistent annual EBITDA margins between 10% to 20% plus in large distribution volume, which can be leveraged by our platform. So, we would expect as we go into '23 and that could help and that with some organic revenue growth, especially on the backside of providing these products for our National Insurance contract with UnitedHealthcare as we're starting to see a lot of inbound call for those types of supply, and Cardinal is a great distribution arm for us."
}