{
    "symbol": "XPEV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-23 13:25:04",
    "content": " In addition to that, I would also like to mention that actually, with our commitment and investment in our R&D technology, we are able to further decrease our cost of manufacturing and R&D in the future with the adoption of our platform-based vehicle architecture as well as our new generation of smartification and electrification technologies. This is our first flagship products that actually adopt the mature level of these three areas of the technologies, which as a result, are able to bring down our manufacturing costs as well as our R&D costs as well, because for the past years, we have seen every single product that we launched have been focusing on advancing technologies and next-generation technologies. As a result in the upcoming 2 to 3 years, we believe that we will also welcome a new generation of quality boost in terms of the overall use a few of our â\u0080\u0093 both the interior and exterior of our vehicles in the future as well as the adoption of more and more integrated direct costing technologies that will allow and achieve future upgrade of our product quality. And also because we are starting to launch new products, obviously, G9 being delivered in October will be the first of the few new products that we can launch, we start to see growth being sort of generated from these new product launches as well as going to fourth quarter, we feel like the seasonality is in our favor. So, we do think there is a strong chance and strong confidence that we are going to a growth cycle, led by our new product launches this â\u0080\u0093 end of this year as well as throughout the next year as well as I think with these new models, also representing better margin due to the platform design as well as higher price points compared to our ASP. And also with the â\u0080\u0093 as we observe for P7 with the newly launched City NGP, we observed a boost in sales performance, and we expect to see the same situation happened for P5 as well, which means that the â\u0080\u0093 with the launch of a higher level of smart features such as city level NGP, the sales performance for P5 will grow. And in the future, because our platforms right now will support this high-voltage and high-power supercharging facility, we believe that our future models will all be equipped with this kind of functionality, which means that we can be able to do better supply chain control to equip our future products with this kind of facility and allow us to achieve better economies of scale as well as cost controlled effects."
}