{
    "symbol": "ALR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 16:51:05",
    "content": " On a consolidated basis, our lifestyle services revenue declined $1.5 million, compared to the fourth quarter, due to the approximate 2% Medicare fee schedule rate cut, as well as the 15% assistant rate cut. Moving to our financial results for the quarter, in the first quarter management and operating revenues were approximately $38.5 million, a decrease of $1.5 million from the sequential quarter, primarily due to a reduction in lifestyle services revenues driven by the Medicare reimbursement rate cuts I just discussed. On residential segment reported total management in operating revenues of $24.3 million of the $8.9 million of management fees earned approximately $800,000 were attributable to construction management fees as we deployed $25.7 million of capital on behalf of the managed portfolio this quarter for routine community capital improvements. Our Lifestyle Services segment reported revenues of $14.1 million, a decrease of approximately $1.5 million, compared to the fourth quarter of 2021. Looking ahead to the next quarter within our Lifestyle Services segment, clinic and daily visitation levels have trended upward and along with seven expected net openings in the second quarter, we expect revenues to increase by approximately $400,000. Our net G&A expense was approximately $14.4 million, which represents a decrease of $1.4 million or 9% from the fourth quarter. Since the second quarter of 2021 we have reduced our gross, general administrative costs by $4.6 million or $18 million on an annualized basis, which is above our original target of $12 million mentioned previously. For the first quarter, we reported net loss of $9.7 million or $0.31 per share, compared to $10.7 million or $0.34 per share loss in the fourth quarter of 2021. In connection with entering this new term loan we terminated our existing senior secured revolving credit facility, which had no borrowings outstanding and was scheduled to mature in June 2022, due to timing of funding working capital obligations in conjunction with capital deployments at our own communities at quarter end, we had approximately $88.1 million of unrestricted cash and cash equivalent as we have reduced our current working capital obligations, we don't anticipate any elevated levels of these balances in the near-term."
}