{
    "symbol": "ALR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 05:20:18",
    "content": " In my prepared remarks today, I will discuss our plan to adopt and execute the recommendations made by the health care consulting group of Alvarez & Marsal, inclusive of the investments we are making in our operational support functions, combined with driving cost efficiencies, insights into the improvement of our operational and financial results for the quarter as well as provide an additional detailed commentary surrounding our strategic initiatives to continue driving revenue opportunities in our communities and clinics. At the end of the quarter, occupancy in our owned portfolio was 75.5%, an increase of 340 basis points compared to the end of the first quarter. In the 120-community portfolio managed on behalf of DHC, occupancy at the end of the quarter was 75.4%, which represents an increase of 80 basis points from the end of the first quarter. Sales lead volume increased 6% compared to the first quarter, largely driven by continued focus on marketing through our digital leads platform. In addition to the improved tour volume growth this quarter, our tour to sales conversion rate was 27.3% in the quarter, which is an increase of 450 basis points sequentially and highlights our immense focus on enhancing our sales tactics to improve occupancy. On a consolidated basis, our Lifestyle Services revenue increased $500,000 compared to the first quarter due to increased outpatient utilization. Wages and benefits as a percentage of revenues were 50.3% in the second quarter, a decrease of 210 basis points from the sequential quarter. Despite U.S. inflation at record levels, operating expenses decreased approximately $3.7 million or 2.1% from the sequential quarter. Base wages were up just 6% from the first quarter, while other residential expenses excluding the $1.7 million decrease related to self-insurance reserves decreased approximately $700,000. Notably, contract labor costs decreased by almost $500,000 or 12% from the sequential quarter, resulting from our focus on hiring of key positions. In the second quarter, management and operating revenues were approximately $39.7 million, an increase of $1.3 million from the sequential quarter, primarily driven by the residential improvement I discussed earlier. Our Residential segment reported total management and operating revenues of $25.1 million, an increase of approximately $750,000 from the first quarter. Of the $9 million of management fees earned, approximately $700,000 were attributable to construction management fees as we deployed $24 million of capital on behalf of the managed portfolio this quarter for routine community capital improvements. General and administrative expense for the second quarter was $17.8 million, which included $3.3 million reimbursed by DHC. As a result, excluding these two items, our net G&A expense was approximately $12.5 million, which represents a decrease of $1.9 million or 13.2% from the first quarter. And since the second quarter of 2021, we have reduced our quarterly net general and administrative costs by $5.2 million or approximately $21 million on an annualized basis. For the second quarter, we reported a net loss of $8.8 million or $0.28 per share compared to $9.7 million or a $0.31 per share loss in the first quarter of 2022. Adjusted EBITDA for the quarter was negative $1.3 million, a $4 million improvement compared to a loss of $5.3 million reported for the previous quarter. At quarter end, we had approximately $83.5 million of unrestricted cash on our balance sheet. Excluding CapEx and non-recurring impacts such as severance and consulting fees, cash loss from operations was about $2.5 million during the second quarter."
}