{
    "symbol": "CHCT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 14:49:03",
    "content": " During the fourth quarter, we acquired 13 properties in four transactions with a total of approximately 241,000 square feet for a purchase price of $50.2 million. For the year, we acquired 18 properties with a total of 423,000 square feet for an aggregate purchase price of $97.1 million which were approximately 98.9% leased with leases running through 2037 and anticipated annual returns of 9% to 10.25%. I am pleased to report that total revenue for 2022 was $97.7 million compared to $90.6 million for 2021, representing 7.8% growth over the prior year. Meanwhile, total revenue for the fourth quarter of 2022 was approximately $25.3 million versus $23.2 million for the same period in 2021, representing 9% growth over the fourth quarter of 2021, while quarter-over-quarter revenue grew 2.2%. And on a pro forma basis, if all the 2022 fourth quarter acquisitions had occurred on the first day of the fourth quarter, total revenue would have increased by an additional $1,116 million to a pro forma total of $26.5 million in the fourth quarter. From an expense perspective, property operating expenses increased year-over-year from $15.2 million in 2021 to $16.6 million in 2022 or 9.8%. During the fourth quarter, property operating expenses increased from $3.5 million in 2021 to $4.2 million or 17.6% for the same period in 2022. Sequentially, property operating expense decreased from $4.3 million in the third quarter to $4.2 million in the fourth quarter or 4% due to normal fluctuations in property operating expenses that occur quarter-over-quarter. For the year, cash G&A increased from approximately $4.9 million in 2021 to $5.4 million in 2022 or 9.6%. While in the fourth quarter, cash G&A increased from approximately $1.2 million in '21 to $1.5 million in '22 or 29.8% while increasing 15.8% quarter-over-quarter. The increase in interest expense was driven by an increase in interest rates, borrowings under our credit facility to fund acquisitions and the addition of the new $150 million term loan which closed December 14, 2022. For the year, funds from operations, FFO, increased from $52.9 million or $2.20 per diluted share in 2021 to $54.6 million or $2.24 per diluted share or $0.04, representing per share FFO growth of 1.8% for the fourth -- 1.8%. For the fourth quarter, FFO decreased from $13.8 million or $0.57 per diluted share in 2021 to $13.6 million or $0.56 per diluted share in 2022. On an annual basis, adjusted funds from operations, which adjusts for straight-line rent and stock-based compensation, grew from $56.5 million or $2.35 per diluted share to $60.6 million or $2.49 per diluted share or $0.14, representing per share AFFO growth of 6%. On a quarterly basis, AFFO increased from $14.9 million or $0.61 per diluted share in the fourth quarter of '21 to $15.4 million or $0.63 per diluted share in the fourth quarter of 2022. And from a pro forma perspective, if all the fourth quarter acquisitions occurred on the first day of the fourth quarter, AFFO would have increased by approximately $576,000 to a pro forma total of $16 million, increasing fourth quarter AFFO to $0.65 per share. I think historically what we've messaged, and I don't think that would change based -- even on what we're seeing, is we think it's tough for this portfolio to be leased any more than kind of 93%. Your average property acquisition cost in '22 was a little under $5 million, and you're basically right there again with the stuff that you either have closed or have under contract for '23. But occasionally, if it's the right opportunity, we see $2.5 million or $3 million acquisitions if we feel like it's a good opportunity for us, and in particular, if there's repeat business. But I think that $5 million average, maybe trending a little bit higher, just based on the fact that we're going to start closing on some of those larger inpatient rehab facilities over the upcoming year, I think that might push that average up just a little bit. I think last quarter, you guys said you had like $72 million of acquisitions you expected to close by the end of the year."
}