{
    "symbol": "MPX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 13:37:02",
    "content": "  Operator: Good morning, and thank you for joining us for Marine Products Corporation's First Quarter 2022 Financial Earnings Conference Call. Today's call will be hosted by Rick Hubbell, President and CEO; and Ben Palmer, Chief Financial Officer. Before we get started today, I'd like to remind everyone that some of the statements that we will make on this call may be forward-looking in nature, and reflect a number of known and unknown risks. I'd like to refer you to our press release issued today, our 2021 10-K and our other SEC filings that outline these risks. Also, in today's earnings release and conference call, we refer to EBITDA, which is a non-GAAP measure of operating performance. Our press release issued today and our website contain a reconciliation of this non-GAAP financial measure to net income, which is the nearest GAAP financial measure. As a result, we shipped fewer units during the first quarter of 2022 than in the prior year, as we continue to experience the effect of ongoing supply chain challenges related to delays in receiving key components required to efficiently complete final assembly of many boats. These delays, coupled with driver shortages are impacting our ability to deliver boats on a normal schedule. Average selling prices increased during the quarter because of price increases necessitated by raw materials and labor cost increases as well as a favorable model mix, which included larger boats. The updated market share statistics for the 12 months ended December 31, 2021, indicates that the combination of Robalo and Chaparral outboards in the 18 to 36-foot category had a market share of 6.3%. With Robalo brand holding the third highest market share in this category, Chaparral held a market share of 20.2% in the 21- to 34-foot sterndrive category, which was the second highest in this category and an increase in market share compared to the last reporting period. Net sales for the first quarter of 2022 were $76.6 million, a 2.2% decrease compared to the first quarter of last year. Average selling prices increased by 23.3% due to price increases we were forced to implement, due to increases in costs for materials and components and labor as well as the continued migration and customer preferences to larger boats. As Rick mentioned, unit sales declined by 20.9% as supply chain problems impacted scheduling of production and boat deliveries resulting in a higher than normal level of inventory at our facilities. Gross profit in the first quarter was $18.4 million, a 0.4% decrease compared to the first quarter of 2021. Selling, general and administrative expenses were $9.2 million in the first quarter of 2022, an increase of 9.5% compared to $8.4 million in the first quarter of last year. EBITDA in the first quarter of 2022 was $9.6 million, a decrease of $985,000 or 8.1% compared to the first quarter of 2021. For the quarter ended March 31, '22, we reported net income of $7.1 million, a 12.8% decrease compared to $8.1 million in the first quarter of 2021. Our international sales accounted for 5.4% of the total, representing a 5.9% increase compared to the first quarter of last year. Our cash balance at the end of the first quarter was $13.6 million, a $500,000 decrease compared to the cash balance at the end of the fourth quarter. Dealer inventories are slightly higher than at the end of the fourth quarter of '21, but significantly lower than at the end of the first quarter of '21. This revival motivates our new model designs, our continued emphasis on quality and our enduring efforts to produce and ship as many boats as possible under uniquely challenging circumstances. Our optimism is supported by continued strong demand indications, although there were a limited number of winter boat shows because of the ongoing COVID restrictions. As we enter the retail selling season, our dealer inventories remain low and backlog remains high. Judging by the recently published retail boat sales data, it appears that most of our industry is working through the same supply chain problems and production bottlenecks that have prevented marine products from completely satisfying historically high demand. We are tackling these problems and appreciate the dedication of our employees, the systems from our suppliers and the continued support of our dealers and retail customers. I'd like to thank you for joining us this morning, and we'd be happy to take any questions that you may have. Unfortunately, it's not consistent that greatly increases the complexity of trying to deal with the issue. But there are some particular components that are unique to us that are contributing to part of the problem, some of our innovative features like our Power Step because it's maybe not as widely available or used on other models. Fortunately, in terms of materials and things like that, that impact -- it could impact our ability to initiate new construction of boats has not yet impacted us in any significant way. So some of the other components, as I described here that we're able to put on after boats, have worked their way through the plant, but it does take a lot of time. Is that something that you've been dealing with, and it's just more acute. But certainly, we would like to ship boats as soon as they're ready and at any given time, when you close the books, you'll see finished goods -- completely finished goods on our balance sheet that are awaiting transport. There is some indication that that's getting better, but we can't tell you exactly when or to what degree. And unfortunately, it's impacting us as well. We're hopeful we're seeing some signs that from the supply chain issues, both receiving parts from vendors -- but also the driver shortages, hopefully, we're seeing some signs it's getting a little bit better. So hopefully, that will ease as the year progresses, and we'll in the not-too-distant future, maybe we get it back toward normalized levels of it. If you look at the average loan term interest rates, things like that, the 100 basis point increase in interest rates could increase the monthly cost of boat ownership by a little less than $100. And at some point, some of the marginal buyers going to say $450 a month was fine, but at $550, I may not buy one. But we -- remember, our backlogs are so high and dealer inventories are so low that we still believe that there are enough consumers who are waiting to buy a boat that it's not going to impact our financial results, at least at this time or for the foreseeable future. I think that's a good question, kind of relates back or my answer would relate back to what Jim said, which is we feel that demand at this point is so strong, we think that indications are that everyone is experiencing similar type of issues. We are not -- at the plant, we are not accepting every order that's out there. I'm sure there are some instances, but we feel that our reputation for quality and our styling and I think, frankly, our price point, there's many folks out there that are in high demand that are even more expensive than our boat. Hopefully, the retail customer will remain patient and hopefully, the supply chain issues are going to free up here soon so that we can begin to better meet that demand. And that obviously, again, as I indicated in my remarks, we'll make everybody have to right the retail customer happier, the dealer happier and certainly, all of our company employees because it's -- really it's a frustrating situation to deal with. In general, since the pandemic started, we are seeing that a greater percentage of buyers are first-time buyers, defined as people who have never owned a boat before. I don't have a recent update for you, but we know that it's north of 30%, probably less than 40%, but more than 30% of the people who are buying new boats today have never owned a boat before. The demographic profile at this time does not seem to have changed in terms of age, income, professional status, that's sort of thing. We have long thought that as baby boomers retire and that wave gets bigger, there will be more retiring baby boomers buying boats. I don't know if you have this data, but my thesis might be that, that repeat customer looking at a really tight boat market may say, \"Look, I'm just going to sit this out and ultimately just defer a purchase.\" I think that's a great point, Craig. He said, \"I'm pleased with the boat I have, why sell it, I'll just wait. I think it's going to be perfect for me, and I understand.\" I know in the car industry, also, there's a lot of delays in being able to take deliveries. So I think you make a great point that if things were to free up, I think there may be some existing -- whether they're Chaparral or other existing boat owners that have a boat, they may be able to flip it and the use market and be able to get a new boat. I think that very likely could be a scenario where there's -- yes, undetected demand that's out there beyond what we know right now from direct indications for consumers. I would now like to hand back the call over to Jim Landers, Vice President of Corporate Services for any closing remarks."
}