{
    "symbol": "PLYA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 07:37:03",
    "content": " Playa generated the highest third quarter adjusted EBITDA in the companyâ\u0080\u0099s history as our compelling value proposition continued to resonate with travelers as evidenced by our ADR growth compared to 2019, accelerating to approximately 53% on a reported basis or approximately 33% on a like-for-like basis, adjusted for portfolio mix and noncash adjustments. As of October 23, Playa owned and managed revenue on the books for the fourth quarter is pacing up nearly 16% year-over-year and 52% versus 2019, with ADR gains accounting for the majority of the increases. Finally, as I mentioned before, although our headline ADR growth compared to 2019 has been robust, the headline growth is benefiting approximately 5 percentage points from the noncash OTA billing methodology change highlighted in our earnings release, approximately 13 percentage points from asset dispositions of lower ADR resorts and the addition of our Hyatt Cap Cana resort. Finally, our resorts in Mexico, which have led the way during the post-pandemic recovery for Playa had another strong quarter with our highest segment occupancy as well as double-digit underlying year-over-year ADR growth. In aggregate, during the third quarter of 2022, 43.5% of Playa managed room nights booked were booked direct, up 2.2 percentage points year-over-year, marking the first year-over-year increase since our occupancy recovered to over 50%. During the third quarter of 2022, playaresorts.com accounted for approximately 13% of our total Playa managed room night bookings continuing to be a critical factor in our customer sourcing and ADR gains. Utilities and food and beverage remained headwinds on the cost front during the third quarter, but our Yucatan operations team has continued to execute at a high level with an underlying margin improvement year-over-year when adjusting for the timing of lumpy out-of-quarter of expenses such as brand fees and the aforementioned noncash OTA commission impact. The disruption of resort closure in the third quarter related to Hurricane Fiona negatively impacted the DR segment by roughly 360 basis points of occupancy, approximately $6 of ADR and approximately $3 million of resort EBITDA. Now for the fourth quarter of 2022, we expect owned resort EBITDA to be between $48 million and $52 million, inclusive of the aforementioned $13 million to $15 million impact in the Dominican Republic from hurricane-related closures. This adjustment is detailed in our Q4 2021 earnings release and related filings, but I wanted to call it out here as it was a roughly 1 percentage point benefit to total company ADR, but had an outsized impact on reported results in Mexico, boosting Yucatan Q4 2021 ADR by roughly $8.50 and Pacific Coast ADR by $2.75."
}