{
    "symbol": "PLYA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 18:13:05",
    "content": " Playa generated the highest fourth quarter adjusted EBITDA and owned resort EBITDA margin in the company's history, as our compelling value proposition continued to resonate with travelers as evidenced by our ADR growth compared to 2019, accelerating to approximately 67% on a reported basis or approximately 46% on a like-for-like basis, adjusted for portfolio mix and non-cash adjustments. In Mexico, the Yucatan led the way on occupancy and saw underlying ADR growth versus 2019 of nearly 50%, while the Pacific Coast reported another quarter of robust ADR growth, up 24% year-over-year, also aided by the highest fourth quarter group mix we have experienced in that segment. As of mid-February, our Playa owned and managed revenue on the books, excluding the two new Jewel properties in the DR for both the first and second quarter is pacing up over 30% year-over-year, with ADR gains accounting for roughly one-third of the increases. Now looking at other segments, the Yucatan Peninsula continued to deliver strong results with sequential occupancy improvements to a post-pandemic high of 81% and reported ADR gains of nearly 72% versus Q4 '19 or 49% underlying ADR growth when adjusted for OTA commission changes and mix impact from asset dispositions. For the first quarter of 2023, we expect owned resort EBITDA to be between $98 million and $103 million, and that is inclusive of a $10 million year-over-year drag in EBITDA from the transition of the two Jewel properties in the Dominican Republic. Looking ahead to the second quarter, we expect reported occupancy in the low to mid-70%-s, down slightly year-over-year, which again includes the mid-single-digit drag from the two Jewel properties in the DR. We expect Q2 ADR to grow high-single digits to low-double digits on a year-over-year basis, and owned resort EBITDA margins to expand year-over-year despite a $5 million year-over-year EBITDA drag in the DR from the two Jewel properties. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}