{
    "symbol": "PLYA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 16:37:17",
    "content": " Business momentum continued during the second quarter as Playa generated the highest second quarter adjusted EBITDA in the company's history, as our occupancy rate continued to rebuild and our ADR growth compared to 2019 accelerated to approximately 40%. Finally, I want to highlight that although our headline ADR growth compared to 2019 has been robust, I would like to remind everyone that the headline growth is benefiting approximately 3 percentage points from the non-cash OTA billing methodology change highlighted in our earnings release, approximately 13 percentage points from asset dispositions of lower ADR resorts, and the addition of our Hyatt Cap Cana resort. We estimate that airlift capacity growth compared to 2019 into Montego Bay accelerated by nearly 15% -- by 15% sequentially during the second quarter, which drove international passenger arrivals to finally exceed 2019 levels on a quarterly basis for the first time, since the beginning of the pandemic. The Dominican Republic continue to benefit from the capital investments we made prior to the pandemic, particularly the Hyatt Ziva and Zilara Cap Cana resorts, which had another stellar quarter and are now generating a cash-on-cash return well above the high end of our target range of 12% to 15% on a trailing 12 month basis, with a Resort EBITDA margin that was over 40% in the second quarter. In aggregate, during the second quarter of 2022, 42.4% of Playa managed room night booked were booked direct and 6.1 percentage points year-over-year, reflecting the continued relative strength of our direct channels, including a significant acceleration in group and third-party source business. Looking at our other segments, Yucatan Peninsula continued to deliver strong results driven by higher demand through our direct channels, leading to sequential occupancy improvement and reported ADR gains of nearly 60% versus Q2 of 2019, or approximately 39% adjusted for OTA commission adjustments and mix impact from asset dispositions. And if you look at how it's performed thus far in the first half of 2022, it's really only been up kind of high -- low-double digit ADR growth over 2019, which when you compare it with the other guys have done, like comparable hotels like Ziva Cancun and others, it's lagged by 20 percentage points to 40 percentage points."
}