{
    "symbol": "WPC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 13:07:03",
    "content": " In addition to the assets we're adding through the CPA 18 merger we've also made excellent progress towards the investment volume embedded in our original guidance, including about $1.1 billion investments year-to-date, including $478 million investments during the second quarter and just over $300 million in July. Turning now to our capital position having issued over $300 million of equity forwards through our ATM program during the second quarter at an average price of close to $84 per share, we're in an exceptionally strong position. As Jason discussed, given the pace of our investment activity year-to-date and the visibility we have into our pipeline, we are raising our guidance assumption for investment volume by $250 million at the midpoint to between $1.75 billion and $2.25 billion, which of course is separate and in addition to the approximately $2 billion of assets we expect to add through our merger with CPA:18. Upon completion of the merger, we expect CPA:18's net lease assets to add approximately $75 million of annualized base rent in addition the 65 self-storage operating properties we are acquiring from CPA:18 are expected to generate approximately $60 million of annualized operating NOI, with an estimated $26 million contribution to our 2022 guidance from the close of the merger through the end of the year. Our third quarter results are however expected to include approximately $1 million of asset management fees from CPA:18, as well as between $3 million to $4 million of AFFO from our ownership interest in CPA:18 which are included in earnings from equity method investments. Interest expense is expected to increase in the second half of the year as we take on approximately $780 million of CPA:18 mortgage debt, at a weighted average interest rate of 4.3%. As you may recall, non-operating income for the first quarter also included an annual dividend received from our investment in Lineage Logistics of $4.3 million, which we do not expect to receive again until the first quarter of 2023, and a $900,000 final cash dividend on preferred stock of Watermark Lodging Trust, which has since been redeemed. In addition to this, we sold 3.7 million shares through our ATM program in the form of equity forwards during the second quarter, blocking in our ability to fund future investments with over $300 million of equity raised at an average gross price close to $84 per share, and with about $285 million remaining available for settlement under equity forwards, we put in place during 2021, we currently have nearly $600 million of dry powder available from undrawn equity forwards. We ended the second quarter with about $400 million drawn on our $1.8 billion unsecured revolving credit facility, which in conjunction with our underdrawn equity forwards, puts us in an exceptionally strong liquidity position, totaling over $2 billion at the end of the second quarter. Your line is now live. We're still seeing sale leasebacks in support of M&A activity, particularly private equity-backed activity, but maybe more recently with the rising rates and the dislocation in the debt capital markets especially the high-yield bond markets where many of our tenants focused just below investment-grade. Your line is now live. We're still getting, I mean, year-to-date I think it's about maybe just under 50% of the $1.1 billion of deals year-to-date have CPI-based escalator as built in, I think our pipeline is about the same, if some of those have caps, I think the pipeline is maybe more significantly skewed towards uncapped CPI, but it's got an incrementally more difficult, or maybe it's just a part of the conversation. Your line is now live. Your line is now live. Your line is now live. I mean I guess from my perspective, if we're able to generate sufficient spreads relative to the riskiness of the investments that we're making, I think we want to stay active and we do believe we're able to do that in the market and we're in a very good position from a capital funding perspective as well with $600 million of equity forwards in place that are left to be settled. Your line is now live. Your line is now live. I think that underwriting has always been a key part of our strengths in being in the net lease market, acquiring highly critical real estate is really important, especially as credit profiles potentially weaken even if companies get into some balance sheet trouble and there's a restructure, we feel pretty confident especially with larger credits that they are going to restructure and with critical operating assets, we tend to fare quite well relative to maybe other unsecured borrowers or the equity holders certainly. Your line is now live. Your line is now live. Your line is now live."
}