{
    "symbol": "WPC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 13:02:01",
    "content": " First, it's important to remember that we were very active in the capital markets during 2021, raising almost $1.5 billion in debt capital, proactively prefunding almost all of our debt maturities through the end of 2023, locking in an attractive cost of debt on it significantly lower than current market interest rates. Leasing activity for the first quarter included lease extensions with 1 of our top 10 tenants, Pendragon, which is a portfolio of car dealerships we own in the U.K. We executed very attractive lease extensions on 30 sites, representing about $11 million of ABR, which added 11 years of lease term while recapturing 100% of the prior rent and keeping the existing rent bumps in place. So while we're seeing that come through, I think the impact of what we've seen since we announced guidance of the raise in the inflation print is more likely to affect the back half of the year or really even closer to the fourth quarter and be much more impactful on 2023. And maybe for Toni, going back to the conversation on the increase in same-store rent growth expectations, I understand it's probably biased towards the end of the year, but it still seems like going from to above 3% would be enough to move the guidance a little bit. So I think that's probably the largest exposure you'll ever see in terms of the rate movement we're seeing in any 1 year, but that's a full year-over-year decline the way that I'm describing that. So when I highlighted earlier, about a $0.01 to $0.02 increase over the back half of this year in terms of what we've seen move in the last month or 2 since initial guidance, I think that's pretty fairly weighted between the U.S. and Europe. I mean it's not that big relative to the broader portfolio, but what we're adding is meaningful in size, and we certainly keep that in mind as we look at our options, which to mitigate that could be to convert to net lease, which we did with the prior portfolio or if we think that there are -- it's the right thing to sell and reinvest that into net lease assets, that's something we can consider as well."
}