{
    "symbol": "STLA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 10:26:05",
    "content": " So, from here, I think we can summarize many of the things we are going to explain to you with Richard Palmer today by telling you that our net revenues were up 18%, our adjusted operating income was up 29%, our AOI margin was at a record high with 13%, our net profit up 26%, our industrial free cash flow up 78%, and our BEV sales growth rate up at 41%. It's also important that you realize that the 41 sales BEV growth rate has been achieved only with European sales, which means that we didn't even start the BEV offensive in the US market, but we are going to start this year, from this year, in 2023, we introduced the Ram ProMaster EV in the US market. Pricing power is fine. Pricing power is fine. Pricing power is fine. Pricing power is fine. Pricing power is fine. Net pricing actions delivered an 8% performance gain year-over-year, or â\u0082¬12 billion, with all segments contributing positively and split relatively evenly across our three engines, North America, Xtend Europe and South America, plus MEA, plus China and India and Asia Pacific. We had a substantial improvement in our net revenues, up 23% due to the impacts of a strong net pricing, positive vehicle mix due to increased Grand Wagoner and Wagoner volumes and the transition to the new Grand Cherokee from the prior version as well as approximately â\u0082¬9 billion of favorable FX translation. We see that all regions are now growing and delivering record profitability, and we see also that our overseas club outside of Europe and North America is now getting ready to become the third engine of our company with a 34% net revenue growth year-over-year. Point number two, we are fast progressing on Dare Forward 2030, and of course, the 41% BEV sales growth rate is demonstrating that, but the fact that between now and next year, we are going to double the number of BEV models is also very representative of the fact that we are not talking about transformation. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}