{
    "symbol": "MERC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-29 10:24:04",
    "content": " Please note this conference is being recorded and for the duration of the call, your lines will be on listen-only. On the call today is Juan Carlos Beuno, Mercerâ\u0080\u0099s President and CEO; and David Ure, Mercerâ\u0080\u0099s Senior Vice President, Finance, Chief Financial Officer and Secretary. I will begin by touching on the financial and operating highlights of the second quarter before returning the call to Juan Carlos to provide further color on the markets, a strategy update and of course, our recently announced acquisition. Also, for those of you that have joined todayâ\u0080\u0099s call by telephone, there is a presentation material that we have attached to the Investors section of our website. But before turning to our results, I would like to remind you that in this morningâ\u0080\u0099s conference call, we will make forward-looking statements. And according to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995, Iâ\u0080\u0099d like to call your attention to the risks related to these statements which are more fully described in our press release and in the companyâ\u0080\u0099s filings with the Securities and Exchange Commission. This quarter, we achieved EBITDA of approximately $141 million compared to Q2 EBITDA of roughly $145 million, which takes our year-to-date EBITDA to a record level of $440 million. This solid result was principally a consequence of improved pricing for energy and pulp, a reduced level of major maintenance, along with the positive impact of a stronger U.S. dollar being offset by lower lumber pricing and cost associated with the chip pile fire at our Stendal mill and lower pulp sales volume. To-date, we have received advance payments from our insurer totaling roughly $9 million. Today, we continue to benefit from record electricity revenues, but we are seeing inflationary pressure on energy dependent input costs such as chemicals and freight and on pulpwood, which is an energy derivative. After giving consideration to our plant 17 days shut at Rosenthal, our mills ran well this quarter when compared to Q2 when we have 43 days of scheduled maintenance. Looking ahead, we will complete a 14-day planned shut at our Stendal mill in Q4. You can find additional segment disclosures in our Form 10-Q, which can be found on our website and that of the SEC. European list prices averaged $1,500 per ton in the current quarter compared to $1,437 per ton in Q2. In China, the Q3 average NBSK net price was $969 per ton, down $39 from Q2. The price gap between NBSK and hardwood, narrowed modestly this quarter due to upward pricing pressure on hardwood, with the average Q3 net eucalyptus hardwood price in China at $855 per ton, up $40 from Q2. In total, average pulp sales realization movements positively impacted EBITDA by almost $18 million compared to the prior quarter. Overall, our average lumber realizations decreased significantly in Q3 due to both the U.S. and European markets weakening. Prices fell steadily in both markets during the quarter, while in the last few weeks we have seen a modest price recovery in the U.S. market. The Random Lengthsâ\u0080\u0099 U.S. benchmark for Western SPF 2 and Better averaged $581 per 1,000 board feet in Q3, which was down $286 from last quarter. Today, the benchmark lumber price in the U.S. is approximately $470 per 1000 board feet. Our electricity sales reflect our strong generation, along with elevated prices in Europe, where Q3 prices were in the range of $400 per megawatt hour. Exports to the grid totaled about 195 gigawatt hours in the quarter, which was down relative to Q2, principally the result of the downtime at Stendal. At the end of the quarter, our liquidity position totaled about $621 million comprised of $362 million of cash and $259 million of undrawn revolvers. Our quarter end liquidity position was down about $150 million from the previous quarter due to the â\u0082¬270 million acquisition of the Torgau sawmill, net of the related â\u0082¬100 million draw on our German revolving green credit facility. As I noted last quarter in connection with the Torgau acquisition, we have obtained an amendment to our German revolving credit facility that expands it from â\u0082¬200 million to â\u0082¬300 million and converts it to a sustainability linked or green facility, a modification that further acknowledges our commitment to our sustainability objectives. Effective in Q3, we have included our mass timber business in the solid woods segment to reflect a change in our operations and management structure. Previously, the mass timber business was included in the corporate and other segment. And going forward, our Friesau, Torgau and Spokane mills will make up our solid woods segment. And as you would have noted from our press release, our board has approved a quarterly dividend of $0.075 per share for shareholders of record on December 21, 2022, for which payment will be made on December 29, 2022. Mercerâ\u0080\u0099s lumber capacity is now almost 1 billion board feet as a result of the addition of this business and our product mix has been broadened to include shipping pallets, wood pallets and briquettes, along with additional green energy capacity. Torgau is the worldâ\u0080\u0099s largest producer of European pallet associated or EPAL wood pallets, with the ability to produce 17 million pallets annually. In addition, the facility can produce up to 150,000 metric tons of wood pallets over 400 million board feet of lumber and 85,000 metric tons of wood briquettes and 90 gigawatt hours of electricity. These synergies will come from the optimization of lumber production, drying, cleaning and grading between Torgau and Friesau. And on the input cost side we see opportunities to optimize wood chip and wood residual deliveries between Torgau, Rosenthal and Friesau. During the quarter, we completed the build-out of our design and engineering teams and are now actively bidding on numerous mass timber projects. On the other hand, global pulp markets remain strong through the third quarter, with almost all realizing modest price increases. These tight supply demand fundamentals are the result of low paper producer inventories, solid pulp demand in most regions, ongoing logistics bottlenecks, and high levels of pulp producer unplanned downtime. On average, our lumber realizations were down roughly 30%. Despite the volatility today, we believe the mid-term backdrop for U.S. lumber pricing condition remains positive, with low lumber channel inventories, relatively low housing stock and constructive homeowner demographics driving future demand growth. As such, we expect the U.S. and European lumber prices will stay flat in Q4, partially supported by recent temporary curtailment announcements made by certain Western Canadian lumber producers. In Q3, 47% of our lumber sales volumes were in the U.S. market, a relatively high volume influenced somewhat by the timing of vessels from Europe to the U.S. However, freight costs continue to increase modestly in Q3 as a result of higher fuel costs. Offsetting this negative impact is the slowly improving availability of North American railcars, which is allowing us to reduce our reliance on higher cost trucking solutions. On the other hand, Russiaâ\u0080\u0099s war in the Ukraine is driving European concerns around energy security and as a result has been pushing European energy prices up over the last few months. Consequently, people have been looking for alternative sources of energy, which in Germany is resulting in strong competition demand for pulpwood for using either pallet or firewood production. As a result, European pulpwood costs are up considerably and we are anticipating further upward pricing pressure in Q4. In contrast, sawlog demand and supply are in balance, and as a result, we expect sawlog pricing to only increase modestly in Q4. While the final form of legislation remains incomplete, we expect the cap program to begin December 2022 and run until June 2023. If enacted, this price cap program will reduce our energy revenues relative to Q3. However, we are hopeful that this electricity market cap program will also be a positive step towards reducing demand for and ultimately the price of pulpwood. In Western Canada, decreased log harvesting levels are related and related sawmill curtailments are putting upward pressure on pulpwood prices. And as a result, we expect pricing to be generally flat in Q4. The majority of the program is focused on high return projects that will drive new product development, ESG advances, productivity improvements and input cost reductions. In keeping with our carbon reduction strategy, we have commenced construction on our Lignin Development Center that will include a lignin extraction pilot plant. When completed in late 2023, the plant will employ a leading-edge technology that will allow us to look at commercializing derivatives of lignin. This set of investments will allow the state-of-the-art facility to fully utilize a more varied raw material mix, add glulam to our product portfolio and increase finger joint production. We expect the repairs to begin in Q4 during Stendalâ\u0080\u0099s planned maintenance shut, with the final repairs expected to be completed in the second quarter of next year. Currently, the mill is running at about 90% of capacity and we expect this percentage to increase to close to 95% with planned Q4 repairs. Products like lignin, mass timber, green energy, extractors, lumber and pulp are all products that will play an increasingly important role in displacing carbon intensive products. Products like concrete and steel for construction, plastic packaging, fossil fuel generated electricity and synthetic fragrances and flavors, even synthetic textiles. In fact, we believe that in the fullness of time demand for low carbon products will dramatically increase as the world looks for solutions to reduce its carbon emissions. As Dave noted, we are so confident in our ability to meet our carbon emission reductions target that we converted our German revolving credit facility to a sustainability linked loan, making us part of a small group of wood product producers willing to invest in carbon emission reduction targets in favor of modest reductions in our costs of borrowing. Just before we turn into questions, just â\u0080\u0093 itâ\u0080\u0099s been pointed out to me that there might have been some callers that we are having problems getting into the call today. So I just wanted to let folks know that I think itâ\u0080\u0099s sorted out now, but if you miss part of the call, donâ\u0080\u0099t hesitate to ask your questions. And just to remind folks too if you did miss part of it, so the call is being recorded and you could pick it up at a later date. Now, that Torgau is in your portfolio, wondering if you can give any updated thoughts on potential repositioning of that mills product mix at the margin pallets versus standard lumber. Yes, we are very pleased with the work that we are doing now in Torgau and the performance of the mill. As we have mentioned before, they are heavily weighted on the dependence on the pallet business. And the question on pulp markets, you touched on generally tight conditions and less prices in Europe have held steady to this point. Yes, when it comes to the order file, we havenâ\u0080\u0099t seen any dramatic changes on that regard. We do see that even though there is obviously some pressure from a situation that is more complicated on the paper producers in Europe with the high costs that they are enduring, the truth of the matter is that we also have a situation where China is not present in the market today as it has been in the past. And we know that as those lockdown measures related with COVID ease down in China and China comes back into the market, thatâ\u0080\u0099s going to be a significant push going forward. So for the fourth quarter, we expect that itâ\u0080\u0099s going to be very similar to what we have experienced in the last quarter, no major change on that end, again, our order book is healthy and we still have to see some forward pressure, positive pressure with the China situation going forward into the beginning of next year. Basically, itâ\u0080\u0099s kind of a similar situation that what we have seen with the pulp developments in terms of the order file and how things are moving. So there is significant delays in shipments and product that is sitting in the ports, longer time than what is expected or planned, but we do see that the price development for fourth quarter in both European and North American markets is fairly similar to what we are experiencing right now. We know that there is a big potential for it as a substitute of fossil-based products, the markets in which it can be applied to our various. But there is also opportunities in the carbon black space, there is opportunity in the asphalt space, this opportunity in battery replacement than in some of the components. We believe that most likely, the epoxy resins, the carbon black maybe a very attractive market, but itâ\u0080\u0099s way too soon for us to have already that narrowed down to which market in particular we would be able to participate. So, there is still questions to be asked as we push this exciting project forward and we should know more by the end of the year of next year. Well, yes, it looks like the cap â\u0080\u0093 looks like the cap will be around â\u0082¬180 per megawatt hour. So, the regulation, this particular regulation is still being still being drafted, but it looks like we are expecting that there will be â\u0080\u0093 the capital will go in and it will be effective December 1. So in Q3, our average electricity price in Germany was in the order of â\u0082¬388 per megawatt hour. If the regulation rolls out the way itâ\u0080\u0099s the narrative is describing, we would have two-thirds of the quarter would be at a lower rate, like â\u0082¬180 and one-third would be at a higher rate. Yes, currently itâ\u0080\u0099s still in the range of â\u0082¬300, â\u0082¬375 to â\u0080\u0093 sorry. Just in terms of overall cost, I assume most of your costs are dominated in euro or Canadian dollars, whereas the pulp and wood products is sold in dollars. Just looking it up here, but you are right typically you are exactly right, most of our cost structure is in euros or Canadian dollars if we can get a rough number for you. And we â\u0080\u0093 so sequentially, just to give you a sense sequentially, Q2 to Q3, we estimate the impact of foreign exchange was about $13 million this quarter compared to last quarter. Yes, it depends how you think about because we are a US dollar reporter, the way it comes and the products are U.S. dollar denominated products. Itâ\u0080\u0099s actually the conversion of the cost structure, the euro cost and the Canadian dollar cost, it gives rise to the improvement, yes. And then I wanted to spend a couple of seconds on the energy business, my sense is the energy generated is a byproduct of your production process and that there really is not a ton of cost associated with that business and itâ\u0080\u0099s sold directly back into the grid. Itâ\u0080\u0099s pretty hardâ\u0080¦\n Yes, all other things being equal, yes, thatâ\u0080\u0099s right. Richard, just to give you some context here, these are still very â\u0080\u0093 these are really solid rates for us. It sounds like a big reduction coming from â\u0082¬400 down to â\u0082¬180 or â\u0082¬200, but if you go back a year ago, our average was probably closer to â\u0082¬80 that we were selling to the grid. So these are still pretty, pretty solid rates in our mind. Before I begin, I was one that had trouble logging in, but just so you are aware too, the webcast just had the whole music on it, so you probably get some people let you know about that later. Yes, we are aware of that, if we donâ\u0080\u0099t get you what you need today, donâ\u0080\u0099t hesitate to give us a call after we will make sure you get everything you need. Ryan, we are looking at a 2023 very much in the ballpark of what we have in 2022. What we see so far in the drafts of the documents that have been circulated by the German authorities, they are considering up until June. But at the same time, they have also looked into setting us, setting cap for gas. And for example, in the case of gas, they are thinking about the entire year. So again, electricity maybe until June and gas maybe the full year whether thatâ\u0080\u0099s going to be maintained that way or they are going to decide otherwise is yet to be seen. Just maybe broadly speaking, as for the investment you are going to make in the business, how should we think about capital allocation, some of your bonds are trading the low-80s. We discuss these kinds of things regularly with our Board â\u0080\u0093 with our Board, just as we do all the policies around dividends. And we still believe that since we have quite a bit of CapEx growth projects in the pipeline, we believe the better use for that cash is to fund those growth projects before we start buying back some of those loans. I think you mentioned on the mass timber business, you have got 30 bids out in the market already. Itâ\u0080\u0099s exciting times, because we just finished setting up or building the team actually the marketing team that is working on these bids. And as you might know, this is a pretty intensive piece of work just to get a bid together for any such project. So, you have an array of different size projects within those 30. And obviously, our expectation and as such, some of those projects are all CLT. So, there is a bit of both, but obviously, heavy weight towards CLT as a replacement of concrete. And we are eager to see those bids come to closure, as the team is now advancing successfully into those. When we have barely entered the market, we just launched our website. So, the 30 projects that we are bidding for, I donâ\u0080\u0099t know that they would be representative share of what we would expect to see in the future. If those 30 projects are in the tens of hundreds of millions of dollars â\u0080\u0093 in the tens of millions of dollars, so itâ\u0080\u0099s â\u0080\u0093 they are significant in essence. But again, I donâ\u0080\u0099t think those are necessarily representative of what we see once people really know that we are out there. If I could sneak one more in and it really just changing geographies into Europe, you clearly have an advantage from a power standpoint, on the portfolio there the pulp mills. I think we do enjoy a significant advantage, because we have made a conscious effort to be able to extract as much energy as we can from our facilities. So, I think we are positively positioned versus others on the energy equation. Now, whether itâ\u0080\u0099s something that it is hitting some more than others, I am sure there is. For us, itâ\u0080\u0099s obviously positive, very positive. Just so I was looking through the 10-Q, itâ\u0080\u0099s kind of interesting to see the pro forma numbers with the MIT. Yes, we are also in the process of learning more and more about the pallet business. But I can anticipate already that yes, this is a â\u0080\u0093 even though itâ\u0080\u0099s a very dynamic market and we know it follows very much how the â\u0080\u0093 itâ\u0080\u0099s kind of a leading indicator of the economy as such. So, we have a kind of a very significant presence in Europe with our product. And which is not suffering, as you would imagine, because itâ\u0080\u0099s the Eastern part of Ukraine that â\u0080\u0093 itâ\u0080\u0099s the Western part of Ukraine, excuse me, the one where the production is held. So, they are pretty much active in the market still. So, itâ\u0080\u0099s an active market, very competitive market. But what we enjoy probably the fact that by being the largest, we are also probably the most competitive â\u0080\u0093 we are not probably we are the most cost competitive out there with the volumes that we are able to produce and how we manage inventory for our customers. So, we will see how, again, economy determines a little bit of how this market oscillates in terms of price. And there is some softness, obviously in the price right now. And then just our expectations, it looks like based on that performance disclosure, it was a profitably operating business year-to-date in 2022. If you remember, and I believe we have mentioned it during the call earlier, today that we had identified $16 million worth of synergies by running HIT. And we believe that we are in very good track towards achieving those, that level of synergies that we had identified. Just for the first month, we are on target and we are just beginning. So, there is a clear value in how we integrate the benefits of having the different setup mills close to each other, whether itâ\u0080\u0099s Friesau, or whether itâ\u0080\u0099s Rosenthal, or now HIT. And us being able to move around chips, wherever they are needed, and move sawdust where itâ\u0080\u0099s needed. And so with that flow of product back and forth between mills, rather than each mill looking what to do with those excess products, brings a very significant benefit and we are capitalizing on it. And then on the sawmill side on Friesau, itâ\u0080\u0099s very dynamic market last couple of years, prices up, prices down. So, we have a structure that allows us to navigate through these moments where lumber prices are not as high as we would like them to be, or some of the costs are higher than we would like them to be. And then just last question on, I think you alluded to this in the prepared comments. I think within the European region, we were kind of a little bit of captive trade flows. I think you have â\u0080\u0093 you are absolutely correct, there is. We see falling shipping rates, especially out of China. Now, out of China either to the U.S. or to Europe, you are basically getting fantastic rates. So, you can move products out of there, with not too much costs. So as and â\u0080\u0093 again as a lockdown seas and those things are â\u0080\u0093 and China starts to wake up, I think we expect to see a lot more movement and then taking advantage of those or being able to ship at lower costs. I wish we could say the same about railways, railcar situation in Canada, where we still suffer the consequences of not having enough, even though there might have been a slight improvement where we were a couple of quarters ago. So, I think there is a bit of mixed signals depending on where you bill, where you are going at, where you come from. That in some cases, itâ\u0080\u0099s still advantageous and some others we still donâ\u0080\u0099t see the benefit that you would expect to see. First just on German fiber costs, you mentioned that you expect per unit fiber costs to increase in the fourth quarter, with continued strong demand for wood for energy purposes. Sure, Matthew, when we look at pulpwood costs, just looking at Q3, when we look at Q3 versus Q2, they went up almost 20%, give or take 17% or so. So, itâ\u0080\u0099s â\u0080\u0093 and we see that that escalation has not stopped. That escalation will continue in Q4, whether itâ\u0080\u0099s going to be at that same level or not, we yet have to see. As I mentioned earlier, the wood chip is the one that is having the highest impact as people are now seeing the possibility of using those wood chips for the production of pallets and going into energy. Just a little bit up, but no to that affect. So, we believe that trend will continue still in Q4, where there is still â\u0080\u0093 until we see this energy cap impact and how that will materialize and what impact it would have on the overall situation of the biofuels and whether they will be maintained at the record levels that they are or whether they will recede a little bit and go back to more normal levels, we yet have to â\u0080\u0093 we have to see. I think the gas cap and the electricity cap that Germany is about to implement all those measures will help bring things a bit more into a more reasonable level, not at a cheaper level that we used to before, but not low, but at least not increasing at the rate that we have seen from Q2 to Q3. And then just one other following up on Johnâ\u0080\u0099s question earlier on Torgau, I know itâ\u0080\u0099s early days. At the same time, we are looking at what would be the capital plan for taking that mill to a higher level. We know that that mill can perform at higher levels and it will require some cash in order to do that, some CapEx to do that. We know the potential is large, but itâ\u0080\u0099s too soon for us to already put a number out there of how much we think we will be investing into that facility. We have planar capacity, excess capacity in Friesau that we can simply move to Torgau, so that that would be â\u0080\u0093 those would be kind of investments that are not material in terms of CapEx. So, they are things that we can do without necessarily adding a significant amount of CapEx. So, gentlemen, as of September 30th, company has looking at the Q2 $87 million in cash and estimated that the cash position will be as high as $430 million to $440 million end of â\u0080\u009823. So, just looking at that, looking at, obviously, the bond offering thatâ\u0080\u0099s due in 3 years and 3 months, I am guessing that the Board has spoken about a buyback of stock. And I am sure there is opportunities that the company is looking in terms of acquisitions, but the stock has been volatile at times. So, you can imagine they think about other ways of giving back to shareholders a buyback, a dividend, a special dividend. But ultimately they get weighed against alternatives and the alternatives that they are looking at the cap, the high return capital program that we have, not only the one that Juan Carlos talked about guiding for next year, but the portfolio of other projects that we have behind that. And then of course, on top of that, we have got a lot of resources that we are applying to trying to grow the company still. So, folks that are looking for new opportunities to buy something to grow in spaces where we have got competence and having a bit of dry powder has been â\u0080\u0093 we have been rewarded for that several times in the last few years, including the Torgau acquisition, including the Spokane, MIT acquisition that we probably wouldnâ\u0080\u0099t have been able to do if we werenâ\u0080\u0099t able to â\u0080\u0093 if we didnâ\u0080\u0099t have the agility that we do and have the cash available that we do. So, these are all considerations, including debt reduction, thatâ\u0080\u0099s also a topic, particularly at the moment, since the bonds are trading at a bit of a discount today. And at the moment, we feel the right thing to do and the Board thinks the right thing to do is push ahead with the high return CapEx and give ourselves a little bit of a dry powder to make sure that we can take advantage of some of the M&A opportunities that we are currently looking at. So, not the answer you are looking at, but I can I can tell you itâ\u0080\u0099s a â\u0080\u0093 these are elements that the Board considers quite considerably. So, donâ\u0080\u0099t hesitate to call one of us. Otherwise, we look forward to speaking to you again on our next earnings call in February."
}