{
    "symbol": "MERC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 13:37:06",
    "content": "  Company Representatives: Juan Carlos Bueno - President, Chief Executive Officer David Ure - Senior Vice President, Finance, Chief Financial Officer and Secretary\n Good morning and welcome to Mercer Internationalâ\u0080\u0099s, Fourth Quarter 2022 Earnings Conference Call. On the call today is Juan Carlos Bueno, President and Chief Executive Officer of Mercer International with David Ure, Senior Vice President, Finance, Chief Financial Officer and Secretary. I will begin by touching on the financial and operating highlights of the fourth quarter, before returning the call to Juan Carlos to provide further color on the markets, our capital plan as well as our strategic initiatives. This solid Q4 results was a consequence of improved pulp production of our Stendal mill, as we return the mill to near full production after the Q3 wood yard fire, along with higher pulp and energy sales volumes. This was more than offset by lower energy sales realizations in Europe due to the recently implemented energy price cap, along with considerably higher pulp fiber and chemical costs. In the 2022 fiscal year, we achieved record EBITDA of almost $537 million, driven by strong pricing for our products through most of 2022, a relatively strong U.S. dollar compared to the Euro and Canadian dollar, along with improved pulp sales volumes. Currently, Stendal is approaching 100% of capacity, and we expect the final repairs to the fire damaged wood yard infrastructure to be complete in Q2. As of today, we have received advance payments from our insurer totaling roughly $18 million. After giving consideration to our planned 21 day shut of Stendal in November, our mills ran well this quarter when compared to Q3 when we had 17 days of scheduled maintenance at our Rosenthal mill. Our pulp segment contributed quarterly EBITDA of roughly $98 million and our solid wood segment, which includes our Friesau lumber operation, along with the newly acquired Torgau mill and our Spokane mass timber startup contributed quarterly EBITDA of about $5 million. Supply constraints from Western Canadian producers, coupled with the increased demand from China helped keep Q4 pricing relatively stable in our markets, with only pricing declines. European NBSK list prices averaged $1,442 per ton in the current quarter, compared to 1,500 per ton in Q3. In China, the Q4 average NBSK net price was $920 per ton, down $49 from Q3. The price gap between NBSK and hardwood narrowed slightly in the quarter due to hardwood prices decreasing less than NBSK prices, with the average Q4 net eucalyptus hardwood price in China at $837 per ton, down $18 from Q3. In total, average pulp sales realization movements negatively impacted EBITDA by almost $7 million compared to the prior quarter. Overall, our average lumber realizations fell sharply in Q4 due to relative weakness in both the U.S. and European markets. The Random Lengths U.S. benchmark for Western SPF 2 and Better average $410 per 1,000 board feet in Q4, which was down $170 from last quarter. Today, the benchmark lumber price in the U.S. is currently $455 per 1,000 board feet. Our electricity sales reflect our strong generation, along with elevated prices in Europe, where Q4 prices were in the range of $200 per megawatt hour. Exports to the grid totaled about 222 gigawatt hours in the quarter, which was up relative to Q3, principally the result of Stendalâ\u0080\u0099s return to near full production and the addition of Torgau. The December implementation of an energy price cap effectively reduced the net realized price to about $120 per megawatt hour, which while lower than Q3 remains much higher than our historical realizations prior to 2022. However, the net earnings impact was nascent this quarter due to its GAAP requirement to mark-to-market acquired inventories and order books, in this case for pellets and pallets to the current market price; a treatment that removes most of the margin from the first full quarter of owner. We reported consolidated net income of almost $20 million for the quarter or $0.30 per basic share, compared to net income of $67 million or $1.01 per basic share in Q3. We consumed about $8 million of cash in the quarter compared to Q3 cash generation, which totaled about $27 million after adjusting for the acquisition of the Torgau sawmill and the related draw on our German revolving green credit facility in Q3. The reduction in cash generation is due to lower EBITDA, along with working capital movements reflect higher inventories. Looking ahead to 2023, we are targeting CapEx of about $175 million to $200 million in our operations this year. At the end of the quarter our liquidity position increased slightly from Q3 and totaled about $636 million, comprised of $354 million and $282 million of undrawn revolvers, including our new $300 million Euro sustainability linked facility. And as you would have noticed from our press release, our board has approved a quarterly dividend of $0.075 per share for shareholders of record on March 29, 2023, for which payment will be made on April 5, 2023. Overall, I'm pleased with our fourth quarter operating results, as it provided a solid conclusion to a record year for our company. Operationally we ran well, and our production and sales volume were up for all our products compared to Q3 and we return our Stendal mill to almost full capacity midway through the quarter. Lumber markets weakened more significantly in the quarter, but we are beginning to see signs that this market will improve. As Dave highlighted, there were significant changes in energy policy in Germany during the quarter, which reduced our electricity revenue compared to Q3, but while this top line reduction can quickly lower costs for natural gas, chemicals and pulpwood are now following and will materialize in our results in the next few quarters. We made good progress with the integration of the Torgau sawmill, coordinating the logistics for the various fiber and wood transfers we envisioned takes time, and I am excited with our progress to date with regards to our targeted synergies. On an annualized basis, we achieved approximately $6 million of synergies in Q4 and once we fully are integrated, we expect to achieve about $60 million per year of synergies. Our design and engineering teams are now actively bidding on numerous mass timber products, and we have currently over 50 projects in various stages of evaluation or bid, and many of our complex projects will take time to negotiate and finalize, but we expect a few of these already to be contracted in the coming days and weeks. As I mentioned, global pulp markets remained resilient through the fourth quarter with prices down only slightly. At the same time, we're seeing considerable demand improvement from China as COVID restrictions wane, and shipping channels reopen. Then of course in recent months, reduced supply is now beginning to have a material impact as paper producers look to increase their pulp inventories. This includes our Cariboo joint venture, where we're taking two months of downtime this spring and summer due to the lack of fiber. Hardwood prices also held their own in the quarter, although we are expecting some softness in the next few quarters as significant new capacity comes online in â\u0080\u009923, which may be detrimental to this market. It will take some time for the market to digest these volumes, and we expect the hardwood, softwood price gap could expand over time. The U.S. market continues to be volatile, but we're seeing some positive momentum, and despite the volatility today, we believe the midterm backdrop for U.S. lumber pricing condition remains positive, with low lumber channel inventories as we approach the spring construction season. The large number of sawmill curtailments, relatively low housing stock and constructive homeowner demographics, putting positive pressure on the supply/ demand fundamentals of this market. In Q4, 32% of our lumber sales volumes were in the U.S. market. In Q4, we saw pulpwood prices peak before reducing partway through the quarter. Looking ahead to Q1, we are anticipating downward pulpwood pricing pressure in Europe. Now in Western Canada, decreased log harvesting levels and related sawmill curtailments are putting upward pressure on pulpwood prices. And as mentioned, our Cariboo joint venture pulp mill has announced our curtailment due to lack of fiber, and we have also seen fiber concerns driving the recent announcement of the permanent closure of another interior BC pulp mill. In 2022 we invested almost $180 million in our operations, the majority of this going into higher return projects like our Celgar and Peace River. These projects would generate high returns in the form of lower wood costs and have considerable carbon reduction attributes, which will help us achieve our carbon reduction goals. Looking to 2023, we expect to invest between $175 million and $200 million in our mills as Dave had mentioned before, and we will again be investing heavily in high return projects. This Spokane plant investments will allow this state of the art facility to fully utilize our more varied raw material mix, add glulam to our product portfolio and increase finger joint production. As we think about climate change and the rapid shift occurring regarding reducing carbon emissions, products like lignin, mass timber, green energy, extractors, lumber and pulp are all products that will play increasingly important roles in displacing carbon intensive products. In fact, we believe that in the fullness of time demand for low carbon products will dramatically increase as the world looks for solutions to reduce its carbon emissions. To that end, going forward, you will see us looking to grow these areas of our business. We remain bullish on the long term value of pulp, but to bring more balance to our business, solid wood and extractors will go more quickly. I encourage you to look at our website for more details, and we're soaked in our ability to meet these targets that we converted our German revolving credit facility to a sustainability linked loan, making us part of a small group of wood product producers willing to invest in carbon emission reduction targets in favor of modest reductions in our cost of borrowing. That's right, so there'll be a little bit coming, but the insurance here has actually been quite efficient. Yeah, roughly $10 million. In paper demand, what we're seeing is obviously a slowdown in Europe, in the European markets. Very good and very happy about the progress in Torgau, particularly with the synergies that we're already able to extract in very little time. And looking at the progress that we made, moving all sorts of products around our mills in Germany, has been very, very - and as we unlock further capacity of Torgau, we expect those synergies just to increase. What we're aiming for obviously is to increase our lumber production over there, but at the same time we have benefits when it comes to the movement of wood chips or the movement of pines, sawdust and whatnot. Yes, just the sort of fiber related shuts that you're taking in both mills. Now having said that, obviously also in Germany we had over the quarter of a very high increase in wood costs associated with all the energy crisis and all the scare that was going on during that period of time. But obviously that has now eased down significantly, and actually what we're seeing today is an important reduction of the cost of the wood chips in Germany, which obviously is very, very favorable to us. Not yet to the level that we would want it to be, but clearly heading in the right direction, and we expect that to continue going forward, so I think that's very positive overall. And in the case of BC, obviously with the curtailments of â\u0080\u0093 continuous curtailments of saw mills, that is putting a significant strain in the whole system. Obviously that creates a little bit more balance, but yet we have to see how the development goes for the coming months. There's a â\u0080\u0093 if I talk about Celgar specifically, there's a couple of things that makes Celgar probably in a stronger position than other pulp mills that are in BC, and it's geographic location since we're close to the U.S. border. We're actively pursuing that and now basically setting up the proper logistics that would allow us to flow, to have a good flow of chips from the U.S., in case the BC continues to put more and more pressure on this. I think that's something very positive for Celgar, number one. And number two, we have the woodroom, that is â\u0080\u0093 that we've announced and that will be ready, not only in Peace River, but also in Celgar later in the year. We don't have those options of the woodroom or the proximity to the U.S., but together with our partners, we're working very diligently in making sure that we secure the necessary wood that is required for the mill. And we'll see how the development of this year works, but we're actively pursuing options to see if we can reduce the 60 day short curtailments that we've announced before. Yes, that's always a tricky one, because one person's definition of MOB might be different than anothers. This will be the year that we do the bulk of the work on the Spokane CLT plant, so we're looking for some expansion there. We're also doing some work at Torgau, some early optimization work to increase the lumber production at Torgau, and of course these - the woodroom that Juan Carlos talked about at Celgar. Okay and just lastly, and I didn't - sorry, I haven't been on these calls for a while just due to conflicts, but paper excellence is close to - from their acquisition resolute, resolute effort to best, both  or any interest in those. Is that capacity actually coming out of China, so while you're importing right now into China, as China opens up, that they will be a net exporter of product. When we were â\u0080\u0093 I believe Richard what we were referring to in additional capacity was more on the NBHK market, so hardwood market that will see a very significant capacity coming through during the year. That capacity is coming basically from South America, with Brazil and Uruguay coming, and Chile coming to play, and that's something that weâ\u0080\u0099ll â\u0080\u0093 that during the course of this year and next year will add quite a significant amount of pulp, of hardwood pulp into the market. So the destination of that, obviously as you will say China is going to be a significant market for it. I would say that if not the most predominant one, the off taker of a large part of that, and that's why we made the statement that we believe that NBHK is going to be going through probably a bit tougher cycle as that amount of capacity is being absorbed by the market. One thing that I would comment though is, usually when those things happen, it's kind of phased in. So those things are usually phased in a way that it seems a little bit easy to go through it, and as they ramp up their production, but obviously it's an important factor for I think for the end of this year, when some of those things are fully up and running, and even more in 2024. I guess the first question, it's for Juan Carlos, and itâ\u0080\u0099s really along the lines of balancing the business, and you mentioned this earlier on about â\u0080\u0093 when you announced the business. Yes, we're very, very focused on that specific item that you just mentioned, on balancing better our company and diverse it, so that it's not so heavily dependent on pulp overall. We believe that there is still very good opportunities for us to grow in pulp, but we will pursue higher opportunities for growth in lumber and CLT, and not only that, but also in our biomaterials space with lignin, and as Dave mentioned and I think I mentioned as well. If you ask me looking 10 years ahead, I would hope to see a company that is much more balanced, and by that I wouldn't be surprised if pulp is anywhere below 40% and lumber is anywhere above a third of our company, and some of these biomaterials take â\u0080\u0093 start taking some two digit space into this mix. You've been very adept and this isn't to be patronizing, but youâ\u0080\u0099ve been very adept over the years of sort of flexing things, levering up when appropriate and then paying down debt and being well positioned generally through the cycle. Yeah, no we do think about that a lot, even though we don't have any near term maturities, and I think we've been pretty fortunate to have kind of that core foundational unsecured, no covenant, very flexible financing structure in the past, but that may not be the place. Maybe as we get closer to the first maturity, which is in 2026, we'll have to see what the market conditions are for other sources of financing and a lot can change in the next year as well. As you know we've been generating â\u0080\u0093 we've got a pretty good cash flow, pretty good operating cash flow, and so I think we're going to have the opportunities if the markets aren't there to roll those facilities over. We'll have the opportunity to do something else, and that may include shrinking the debt up, and it may include â\u0080\u0093 we'll look at the other sources of financing at the time. As you know, we've been â\u0080\u0093 we've had a little bit of extra cash on the balance sheet at times in the last couple of years, and we've deployed that to pick up a couple of assets in the Spokane facility and recently the Torgau facility. So I think you'll see us at times be a little bit conservative or what might look outwards to be a little bit conservative, to make sure that if we do come across an opportunity that aligns with the strategy that Juan Carlos was talking about, that we're able to jump on those opportunities quickly. Sorry Andrew, that's a bit of a ramble, but yes, there's a lot of moving parts, but we're paying a lot of attention to that, particularly over the next year or two. So that is obviously of high expectations, and we've gotten good support from the government into that project. , that one we need to associate it with â\u0080\u0093 there's some work that needs to be done, and we want to do it at the time of our shutdown. As Dave mentioned earlier, that shutdown is scheduled for the fourth quarter for October, so it is linked to the fourth quarter shutdown for us to be entering to that commissioning phase in Celgar. The peace river, the peace river woodroom is in the range of $50 million to $60 million, and we'll start up in the next few months here, and the Celgar one is about in the range of $30 million to $40 million. It's just a little confusing, you know given â\u0080\u0093 how the mix of that segment has changed, and now you've talked about some investments to increase capacity. What is the profit outlook for that business going forward, either over the next one to two years, and what's the targeted return on investment for that Spokane facility. As I mentioned earlier, we're very happy with the way things are evolving there, and when I say that, despite the fact that materially in our revenue it doesn't show up yet, what we see is a tremendous amount of project and bidding work that we're doing with the team that we have assembled in Vancouver, and that is what gives us an extremely high confidence about the future of this business. Some of them in the very, very final stages and with very high confidence that we will close in a few that are very significant, and they weâ\u0080\u0099ll make a mark for, let's say the full load of our CLT facility and that is very important. That's why as we were seeing already this unraveling, even though we've only been into this, as you well said, for a short period of time and this is coming out of bankruptcy. Almost considered â\u0080\u0093 for us, it's considered as a startup. and that's why we decided to make the investment ahead of time, because we see the need for that facility to develop itself further, even though it's â\u0080\u0093 it was state of the art technology, but obviously there's opportunities to do more. Glulan and CLT, as we phase many of these projects that we're bidding on, we see more and more the need of those two going together in many of the construction projects that weâ\u0080\u0099re working on. So having the facility, being capable to provide both offerings is obviously something that would be very attractive to our customers and hence are decided to go through with that investment. In terms of your question of how material it can be going forward, without getting into committing to numbers, I would say that we would be â\u0080\u0093 by the end of â\u0080\u009924, we should be much closer to rounding values in â\u0080\u0093 closer to the $100 million profit overall in this facility. If we're going to be doing type of profit number that you put out there for 2024 in that ballpark, I mean does that facility were in its own credit structure associated with it. We'll see how it develops, and as Juan Carlos had mentioned, we're pretty bullish about it, and we'll probably if it goes away; we think it's going to go. We're going to invest more in that business, and it may need some financing and that might be appropriate to do. And just one thing to make sure that I â\u0080\u0093 I don't know if I misspoke, but when we look at the value of this and the expectations for it for next year, 2024 that I mentioned closer to 100, I refer revenue more, not profitability. I believe at one point there was a fair amount of pointer capacity, sort of capacity going in, and I think there was some thought of you know additional, either sorting or plaining capacity, I can't remember exactly which one. Now, the focus is now turning on the CapEx that we want to put into Torgau as we see a tremendous amount of potential in that facility. You mentioned that or made some comment associated with pallets, and just to be clear, our Spokane facility in Washington is not doing any of that. Now the acquisition of Torgau, that's where the palette and the pellet business comes in, and that's obviously something that we intend to maintain. But what we want to grow in that facility is the lumber output, and that's a facility that has four saw mills, saw lines and only two of them are being used in a proper way. That's why we want to divest â\u0080\u0093 or excuse me, direct our investment more towards Torgau as we unlock the potential that that facility really has."
}