{
    "symbol": "CCL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-21 15:28:03",
    "content": " And on top of this, our constant dollar revenue per passenger cruise day was 2% higher than 2019â\u0080\u0099s record levels for the full year and 4% higher in the fourth quarter, overcoming the dilutive effect of future cruise credits. Normalizing for 2019 fuel price and currency changes, which provides a better sense of the strength of the underlying fundamentals of the business and our progress, we expect adjusted EBITDA per ALBD to reach 50% of 2019 levels in the first quarter of 2023 with sequential quarterly improvement as we progress through 2023 that should rival 2019 levels by the end of the year. Turning back to our operating performance, we are effectively addressing near term challenges in the post pause transition with higher first quarter net per diems expected and have been reshaping our portfolio to drive revenue growth as we return to historically high occupancy levels and delivering measurable pricing improvements over time. Therefore, we expect to continue reducing our occupancy GAAP in first quarter 2023 to 2019 by nearly 5 percentage points from fourth quarter 2022. On the pricing front, first quarter 2023, we expect net per diems to be a 5.5% to 6.5% in constant currency, and 3% to 4% in current dollars as compared to first quarter 2019, a great accomplishment as we start the New Year. During 2023, while our European brands expect onboard and other revenue per diems to be up significantly versus 2019 as they were in 2022 and as has been the case with our North American brands, absolute onboard spending on our European brands is less than that on our North American brands. Off the base of our industry-leading cost structure, adjusted cruise costs without fuel per ALBD for the full-year 2023 versus 2019 are expected to be up 5% to 6% in current dollars and 7.5 to 8.5 in constant currency. For the first quarter 2023, the ranges are up one point less driven by lower dry dock cost per ALBD versus first quarter 2019, but first quarter 2023 does include an over 30% increase in advertising to further accelerate demand. While weâ\u0080\u0099re on the subject of fuel consumption, I would like to recognize everyone on our global team who contributed to the expected 15% reduction in both, fuel consumption per ALBD and carbon emissions per ALBD for the full year 2023, both as compared to 2019. I did want to point out that for 2023 versus 2019 at current fuel prices and FX rates, we did expect a negative impact from fuel price, fuel mix and currency of approximately $150 million for first quarter and an impact that is multiple times that for the full year, including a full year currency impact of over $70 million. Putting all these factors together, we expect $250 million to $350 million of adjusted EBITDA for the first quarter 2023 and sequential improvement compared to 2019 in each quarter of 2023 as we continue to close the gap."
}