{
    "symbol": "CCL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-30 13:06:02",
    "content": " Revenue per passenger day for the third quarter 2022 decreased from a strong 2019, mainly due to the impact of future cruise credits, or more commonly called FCC, and currency given the stronger U.S. dollar, along with our large presence in Europe with four brands in the UK and Continental Europe. Once again, our onboard and other revenue per diems were up significantly in the third quarter 2022 versus third quarter 2019, driven by price increases, greater spending by our guests and the increased effect of the second wallet as more guests are participating in pre-cruise sales of onboard activities. On the cost side, our adjusted cruise costs without fuel in constant currency per available lower berth day, or ALBD, as it is more commonly called, for third quarter 2022 was up 14% versus third quarter 2019. We have seen a continuation of the sequential improvement quarter-over-quarter in costs throughout the year, and expect to see a continuation of the improvement in the fourth quarter of 2022, with a low double-digit increase compared to 2019, driven in part by higher advertising expense to drive revenue for 2023. Therefore, while this resulted in the cumulative advanced book position for the fourth quarter below the historical range, we believe we are well situated with our current fourth quarter 2022 book position given current booking volumes that are running significantly ahead of 2019 levels as we capitalize on closer in booking patterns. So, your -- what youâ\u0080\u0099ll see is a big ramp-up in the back half of this year versus 2019, even higher than the normal level that we would see in the fourth quarter in anticipation of wave season. So, I just wanted to maybe talk about -- a little bit more about â\u0080\u009823, and specifically put the issues that you guys are having with current sort of booking window lengths or the length of time of the average booking that you called out as impacting the current quarter into context, which is that looking at â\u0080\u009823, right, youâ\u0080\u0099re ahead of historical volumes for â\u0080\u009823, youâ\u0080\u0099re ahead of pricing for â\u0080\u009823 against historical pricing."
}