{
    "symbol": "CCL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-24 14:02:05",
    "content": " The accelerated removal of these less efficient ships, coupled with the delivery of 9 larger, more efficient ships delivered since 2019 fosters higher revenues over time through a 7 percentage point increase in the mix of premium priced balcony cabins and an even better platform for onboard revenue opportunities as well as generating a 6% reduction in ship level unit costs, excluding fuel, moderating the effects of inflation and enabling us to deliver more revenue to the bottom line. During the second quarter 2022, we restarted 20 additional ships, resulting in 74% of our total fleet capacity in guest cruise operations for the whole of the second quarter. We were pleased to see that the second quarter 2022 revenue increased by nearly 50% compared to first quarter 2022, reflecting continued sequential improvement. We were encouraged by the very close-in demand we experienced during the second quarter for the second quarter, resulting in nearly double the close-in occupancy gains in second quarter 2022 versus second quarter 2019, a trend we had anticipated. However, let's not forget the impact due to the future cruise credit, or FCC as they are more commonly called, which cost us a couple of percentage points in second quarter 2022 versus second quarter 2019. Excluding the impact of FCC's revenue per passenger cruise day, the second quarter would have been higher than a strong 2019. Once again, our onboard and other revenue per diems were up significantly in the second quarter 2022 versus second quarter 2019, in part due to the bundled packages as well as onboard credits utilized by guests from cruises canceled during the past. On the cost side, our adjusted cruise cost without fuel per available lower berth day, or ALBD as it is more commonly called, for the second quarter 2022 was up 23% versus second quarter 2019. As a result of all of the above, we expect to see a significant improvement in adjusted cruise costs, excluding fuel per ALBD, from the first half of 2022 to the second half of 2022, with a mid-teens increase expected for the full year 2022 compared to 2019. And as I said before, we were very encouraged by the close-in demand we experienced during the second quarter for the second quarter, resulting in nearly double the closing occupancy gain in second quarter 2022 versus second quarter 2019, a trend we had anticipated. During the second quarter 2022, we once again increased our advertising expense compared to the first quarter 2022 in anticipation of our full fleet being in guest cruise operations and our 8% capacity increase for 2023 versus 2019. And so what we were trying to say is despite the fact that we were below the historical range, we do expect, because of the closer-in nature of the booking patterns, to see occupancy in the back half of 2022 to be higher than the 69% in the second quarter."
}