{
    "symbol": "FDX",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-16 20:14:10",
    "content": "  Operator: Good afternoon, and welcome to the FedEx Corporation Third Quarter Fiscal 2023 Earnings Call. I will now turn the call over to Mickey Foster, Vice President of Investor Relations at FedEx. Good afternoon, and welcome to FedEx Corporationâ\u0080\u0099s third quarter earnings conference call. The third quarter earnings release, Form 10-Q and stat book are on our website at fedex.com. This call and the accompanying slides are being streamed from our website, where the replay and slides will be available for about one year. During our question-and-answer session, callers will be limited to one question in order to allow us to accommodate all those who would like to participate. Such forward-looking statements are subject to risks, uncertainties and other factors, which could cause actual results to differ materially from those expressed or implied by such forward-looking statements. If you have not yet received your invitation, please call or email me or anyone on the Investor Relations team. Joining us on the call today are Raj Subramaniam, President and CEO; Mike Lenz, Executive Vice President and CFO; and Brie Carere, Executive Vice President, Chief Customer Officer. Thanks to the hard work of the FedEx team, our third quarter earnings were ahead of our expectations in what remains the challenged demand environment. The team delivered outstanding service throughout and following peak, despite significant weather disruptions across the United States. Importantly, our third quarter results also reflect our continued progress on the fundamental transformation of FedEx as we moved with urgency to realign our cost structure. Our cost reduction actions supported margin expansion at both ground and freight, but have not yet fully offset the impact of continued pressures at Express. Weâ\u0080\u0099re committed to addressing these cost imbalances, and we will be taking further actions in the coming months, including a more pronounced readjustment of the air network. Because of the magnitude of changes, we are planning across our air network and our continued need to maintain high service levels, thereâ\u0080\u0099s a lag in the timing of expense adjustments. Volumes declined by a low double digit percentage across all segments partially offset by higher yields at Ground, U.S. While revenue fell across all segments, the decrease was most pronounced at Express. Last quarter, we shared our expectation for continued pressures from lower volume and inflation. Weâ\u0080\u0099re not simply taking out cost, we are simultaneously focused on running our business more efficiently, flexibly and profitably, which will create significant value for our stockholders in the years to come. One of the key drivers at Ground was the ability to manage staffing levels and associated expenses, which resulted in reduced salaries, benefits and purchase transfers -- transportation costs. Combined, these expenses were down 8% year-over-year. Despite the dynamic environment, Ground continued to deliver for its customers during peak with an average time in transit of approximately 2 days, compared to 2.35 days in fiscal year 2022. In aggregate, these initiatives led to a modest increase in cost per package of 1%, despite 11% volume declines, and total operating expenses were down $345 million year-over-year. When combined with our continued focus on revenue quality, total operating income was up 32% year-over-year and operating margin of 9.7% that improved 240 basis points year-over-year. Freight has also illustrated disciplined commitment to profitable growth, revenue quality and managing cost of volumes. Beyond day-to-day management of variable costs, the Freight team is temporarily parking and selling equipment to right size the fleet and reduce future maintenance costs. Total operating expense at Freight was down 6%, supporting 270 basis points of margin expansion in the quarter. Importantly, our cost initiatives did not compromise the consistent outstanding service levels delivered by the Freight team. Last month, we announced a streamlined reporting structure that will reduce the size of our officer and director team by more than 10%. By the end of this fiscal year, we expect U.S. headcount to be down roughly 25,000 year-over-year. At Express our cost base is constrained in the short-term, where Express network is vast and complex and requires time to adjust to changing demand conditions. Therefore, weâ\u0080\u0099re taking additional steps to address our fixed expense structure. This quarter, we reduced flight hours by 8% and salary and benefit expenses by 4%. We also parked an additional nine aircraft, downgauged on certain routes and implemented various productivity improvements. As a result of these actions, we mitigated 45% of total revenue declines on an adjusted basis. Domestic Express, we implemented a single daily dispatch of couriers in February. With continued cost discipline, we anticipate sequential operating margin improvement in the mid single digits for the fourth quarter. Assuming the challenging demand environment persists in Q4, we expect to be able to mitigate at least 60% of the revenue related headwinds weâ\u0080\u0099re facing at Express. Before we dive into the financial results in more detail, Iâ\u0080\u0099ll provide a quick update on DRIVE, the program to support our transformation to create a more nimble, efficient and profitable FedEx. One part of this effort, as shown on slide 8, is to reconfigure our air network. And as we operate more collaboratively, we are leaning into the ground transportation more, requiring less CapEx while enabling us to reconfigure our network more quickly. There, we will focus on the actions we are taking to improve our performance, along with additional information to help you better model the impact on our progress. Now, let me turn it over to our Chief Customer Officer, Brie Carere, who will discuss market trends and our commercial strategy in more detail. As expected, the operating environment in the third quarter remains challenging. The trends we saw through the first half of the year persisted, but we started to see some moderation, and importantly, our team delivered excellence for our customers. At FedEx Ground, revenue was down 2%. The volume decline was significantly offset by a double-digit percentage yield increase driven by better product mix, fuel and large package and peak surcharges. We are very pleased with the results from the implementation of our global rate increase this past January, which has maintained a very high capture rate. At FedEx Freight, revenue was down 3%. Importantly, pricing discipline across the LTL industry is strong, and we expect the market to remain rational. Revenue at FedEx Express was down 8% year-over-year, primarily due to lower volumes globally and yield softness in Asia and Europe. In Europe, weâ\u0080\u0099re seeing improved operational execution with service at the best levels they have been since fiscal year â\u0080\u009821. Additionally, having a freight and parcel bundle for our customers in Europe differentiates us from the rest of the market. In Asia, market demand is rebalancing, resulting in lower yields and softer demand for priority services. The reopening of our international economy service this May will help stabilize our volumes out of Asia, given the marketâ\u0080\u0099s increased shift to deferred services. As expected, yield growth has been increasingly pressured across segments as year-over-year fuel surcharge comparisons normalize and customer demand shift. FedEx Express international turned negative, driven primarily by Asia, with Europe also softening. Domestic Express, Ground and Freight yield growth also decelerated. Despite market headwinds, weâ\u0080\u0099re pleased with the teamâ\u0080\u0099s ability to manage volume, share and margin at both FedEx Ground and FedEx Freight. Looking ahead, we remain prudent in our expectations for yield in the fourth quarter. In fact, across the board, FedEx Ground delivers to more locations in one or two days than our nearest competitorâ\u0080\u0099s ground service. I would also like to share progress weâ\u0080\u0099re making at Express, where service levels improved significantly over fiscal â\u0080\u009822 peak and are quickly approaching pre-pandemic service levels. While this is great progress, we know we have more to do, and weâ\u0080\u0099re making -- taking meaningful action to continuously enhance our service. For example, in Europe, with the reopening of our Duiven, Netherlands road hub this past October, we have expanded capacity, enabled a more efficient routing, and we have improved our service. Coming out of peak, service improvement has translated into good momentum for our sales team. First, the online FedEx Ship Manager has been fully modernized to make shipping more efficient, highly personal and easier to use for all of our customers. Customer feedback has been very positive, and weâ\u0080\u0099re finding that the more customers engage with Ship Manager, the more they appreciate it. FedEx Ship Manager is the primary tool for small business customers, and we plan to migrate 98% of all parcel shippers to this new experience before next peak. Next, we launched picture proof of delivery ahead of peak season, making us the first to market with this great capability. It has fulfilled a key customer need, driving confidence around successful package deliveries. In peak, our dynamic pricing capability enabled holiday peak residential surcharges to adjust dynamically based on individual customersâ\u0080\u0099 weekly peaking factor, delivering $150 million in profit. In the coming fiscal year, our predictive anomaly detection will improve revenue quality. Now, we will use those same capabilities to better manage customer performance and contract compliance. Finally, in January, we rolled out new visibility insights in 13 countries, providing customers with a four-hour time window for their package delivery. By delivering these innovative solutions, our teams are creating great value enhancing the overall customer experience. At Ground, operating income increased 32% and operating margin expanded 240 basis points to 9.7%. Margin expansion was supported by both, yield growth of 11% and cost reduction actions. These factors were partially offset by lower package volume, higher infrastructure costs related to previously committed projects and increased other operating expenses. And at Freight, the teamâ\u0080\u0099s focus on revenue quality and managing costs drove better profitability as operating income increased 15% and margins expanded 270 basis points. This was driven by revenue per shipment, up 11%, as well as a gain on a facility sale and partially offset by decreased shipments. At Express, our results continue to be pressured, and our team is acutely focused on driving improved profitability. Revenue per package grew 3% year-over-year, primarily driven by higher fuel surcharges and base rates, partially offset by exchange rate impacts. Yield growth decelerated and inflected negatively in international export, increasing pressure on profitability. Despite our performance in the third quarter, due to the actions we are taking in Express, we expect to see sequential operating profit and margin improvement in the fourth quarter. To provide additional color on recent demand trends and what we are planning for in our outlook, slide 17 shows trailing monthly volume trends for our major product categories. Domestic Express, International Priority and Ground Package trends improved somewhat into February on a sequential basis. As we look to the fourth quarter, we expect volume declines to continue moderating at Express and Ground as we lap the onset of softer volumes. Yield growth will be pressured as year-over-year fuel surcharge comparisons normalize and customer demand shifts, most prominently in Asia. Last fiscal year, CapEx was 7.2% of revenue, down from our historical levels of roughly 8%. By fiscal year â\u0080\u009825, our commitment is to be at 6.5% or lower. As I mentioned in December, we reduced our fiscal year â\u0080\u009823 capital spend forecast to $5.9 billion, which is approximately a $900 million reduction from initial plans for the year to account for the lower demand environment. We are prudently deferring and slowing the pace of projects, improving our capacity utilization and planning for moderated aircraft fleet investment to drive ROIC improvements. In line with this approach, we expect capital spend to be roughly flat in fiscal 2024 versus fiscal 2023 and be down as a percentage of revenue. We ended the quarter with $5.4 billion in cash and continue to generate solid cash flows, which supports our capital return strategy. In fiscal year â\u0080\u009823, we will return $2.7 billion to our stockholders. In summary, our capital allocation strategy reflects our commitment to reducing capital intensity and creating value for stockholders while continuing to reinvest in FedEx for today and tomorrow. In the fourth quarter of 2023, we expect market conditions to continue to negatively impact revenue and operating profit. However, on a sequential basis, we expect FedExâ\u0080\u0099s fourth quarter results to follow our historical seasonal pattern, representing the high watermark on the year. As part of these reductions, we will manage capacity to lower demand levels, including further reducing flight hours at Express and reducing Sunday operations, closing certain sort operations and taking other line-haul expense actions at Ground. We are executing targeted actions to reduce shared and allocated overhead expenses, reducing vendor utilization, deferring certain technology projects and discontinuing same-day city operations at FedEx Office. In addition, we expect to achieve savings related to further headcount attrition and the elimination of certain global officer and director positions, which we announced in February. Putting these factors together, our updated expectation for full year adjusted earnings is $14.60 to $15.20 per diluted share. Maybe Mike or Raj, maybe talk a little bit about that sequential improvement. Youâ\u0080\u0099re talking about a seasonal improvement, but I mean, you normally have that. And Mike, you mentioned youâ\u0080\u0099d normally have that seasonal improvement in the fourth quarter. So, as Brie highlighted, for the fourth quarter, we continue to project a lower level of demand, and that just heightens the emphasis of further traction on the cost initiatives. So Express, in particular, weâ\u0080\u0099ll realize greater savings from the initiatives that weâ\u0080\u0099ve highlighted, and that will drive to the mid-single-digit margin projection there. At Ground, we also expect -- we expect margin improvement at Ground, but not the same magnitude that we realized in the third quarter. And then, lastly, at Freight, we had an exceptional fourth quarter last year, and weâ\u0080\u0099re projecting strong performance in the fourth quarter this year as well, but weâ\u0080\u0099re not anticipating building upon that near term given the volume declines there. So hopefully, that puts it in context further for you there thinking ahead. So, I think mid- to high single-digit year-over-year decline in total expenses for Express would probably put us kind of flattish sequentially. So, maybe you could just sort of help us a little bit with the revenue dynamic. I think, Mike, you talked about volume declines moderating as you went through the third quarter. I know itâ\u0080\u0099s still a challenging environment, but trying to triangulate a little bit with some of the numbers youâ\u0080\u0099ve given us to -- on the revenue side there. From a volume decline perspective, what we anticipate seeing in Q4 is that the decline will get less. So sequentially, the volumes will improve from Q3 to Q4. And actually, when weâ\u0080\u0099re thinking about Express, we think that trend will continue into Q1 as well. That is here in the U.S., but also from an international perspective, as we talked about, weâ\u0080\u0099re going to open up international economy. So, we do think that the volume decline will moderate Q4 over Q3 as well as Q1 over Q4. And again, I am talking about that decline year-over-year. So I guess, as we think about the DRIVE initiatives here, is there any way you can help us maybe frame up how much of that -- of the $4 billion in savings have been implemented so far in terms of those actions. And then, I guess, as you sort of think forward, obviously, thereâ\u0080\u0099s a lot of uncertainty out there from a macro perspective. So, think about DRIVE as the framework of how we approach the business and running a more flexible and efficient operation across the board. So within that that has enabled us to move quicker here than we anticipated coming into the quarter in terms of our cost initiatives, and is also foundational to the $4 billion of structural cost reductions that weâ\u0080\u0099ve identified. So, if you think about the structural cost reductions, thatâ\u0080\u0099s operative irrespective of the demand environment. So, we look forward to giving further updates on the progress and details of the various domains within DRIVE on April 5th. I think the total is something like $3.7 billion, with $1 billion being permanent. So okay, Jordan, the -- yes, we will -- the $1 billion of permanent that Raj alluded to, we will realize that this year. The bulk of that is at Express, and we will see more traction on that, particularly in Q4 here. We have -- we had -- as Raj said, we had nine more aircraft parked during the third quarter, and weâ\u0080\u0099re projecting to park six more during the fourth quarter. So, that is illustrative of the takedowns and reductions underway there. And then also another component of the $1 billion, was taking out investments in that and initiatives and projects that we donâ\u0080\u0099t anticipate picking up. On the Ground side, I know youâ\u0080\u0099ve given us good information on the call, but just wondered if you could dig into things a bit further of -- within the quarter, what was the most important drivers of improvement. And then, I think it was a year ago or a while back, we were talking about labor shortages and the sorts really being a factor. Yes, Tom, you hit it very directly there because it indeed was the case that last year was very challenging in terms of the circumstances with the labor market in that. So, I certainly would highlight in the third quarter that Ground did an extraordinary job of flexing down resources following peak there. So, that was definitely a key element of the improvement there in the third quarter. That wonâ\u0080\u0099t be as big of a tailwind in the fourth quarter, given the dynamic that you highlighted there. But again, multiple dimensions within the ground operation of efficiency across the network within the docks and the facilities, line haul as well as pickup and delivery. Brie, thereâ\u0080\u0099s a lot of focus on the cost for obvious reasons, but to have the service levels back to pre-pandemic levels, to have the transit time down to two days amid all these cost cuts is a bit surprising. And we know when the network is running, itâ\u0080\u0099s most productive. And in fact, weâ\u0080\u0099re going to continue to do better from a service perspective. Weâ\u0080\u0099ve got a little bit more work to do, but it feels really good. So, if you could just kind of talk about fuel surcharges versus price maybe there. So what we saw in Q3 from a yield perspective, obviously, from a yield growth, we were very, very pleased. In fact, in Europe, it was the highest capture that certainly I have ever seen coming out of Europe. So, I think that the global pricing team and the global sales team are doing just an outstanding job. As we look forward into Q4 and beyond, we will see yield growth moderate, but we think the fundamentals are going to stick. So, we think the market is rational. But, of course, we will see moderation in yield growth next year as weâ\u0080\u0099re just lapping really, really high increases. So, Raj or Mike, I was wondering if you can give us some context around outcomes in Express this quarter. Weâ\u0080\u0099re seeing year-on-year margin declines kind of similar to where we had been maybe throughout the year, even though you guys are taking credit for incremental cost out. So, I know Ground and Freight looked a little bit better here, but what, I guess, is holding back Express, especially with similar volume outcomes. In Q1, the cost was up year-over-year, Q2 was flat. Q3, the costs are down $430 million year-over-year, and Q4 is going to get even better from there. Weâ\u0080\u0099re making progress on the air, as weâ\u0080\u0099ve talked about before. And then, as we look ahead, we are fundamentally going to make this network much more agile and flexible and supported by technology. I just want to ask on the Trans-Pacific lane, I know itâ\u0080\u0099s an important lane for you. I think itâ\u0080\u0099s important to remember the primary conversation that weâ\u0080\u0099re having is about Mexico, and we have a fantastic value proposition out of Mexico. So, as customers do want to diversify, we are anywhere they need to be. From a magnitude perspective, we do not see any short-term large shifts that would change the position of China being the worldâ\u0080\u0099s manufacturer. So, I donâ\u0080\u0099t think that thatâ\u0080\u0099s an immediate issue. And again, congrats on some of the progress here on the cost savings initiatives. So obviously, we saw them a little bit challenged this quarter, and you said that they are likely to improve sequentially going into fourth quarter. So certainly, as the environment has evolved here in the last 6 to 9 months, thatâ\u0080\u0099s heightened our emphasis on efficiency and cost initiatives to realize margin improvement and drive improved returns on invested capital. And so, the DRIVE framework is allow -- enabling us to relentlessly pursue these initiatives in a number of fronts. We talked about flexing the labor hours, the air network, the structure of the ground surface transport. So again, a lot of progress, more to go, but weâ\u0080\u0099re very confident that Express can realize the full potential going forward. I wanted to touch a bit on, I think, the color provided today and certainly in the Q&A and just whatâ\u0080\u0099s going on in the Express segment is very clear and certainly more to come there. I mean just kind of the Ground is clearly -- youâ\u0080\u0099ve made a lot of progress as noted on salary employee benefits down quite a bit, but also purchase transportation down quite a bit. Well, it was a number of fronts of the efficiency side with, again, flexing down the labor hours following peak. But broadly, the focus on utilizing the assets more efficiently and in a lower demand environment, that means certain facilities in that. So again, itâ\u0080\u0099s just about optimizing the network across the board. And look, itâ\u0080\u0099s very much impressive to see the progress weâ\u0080\u0099ve had here when weâ\u0080\u0099re also facing a headwind there from increased infrastructure costs at Ground, so that represents opportunity going forward as well on top of everything. So first, for the gain on the sale was roughly about $30 million at the Freight company for the facility there. And then yes, the reference for Ground was that the year-over-year improvement for the fourth quarter, we wouldnâ\u0080\u0099t anticipate it to be as large as what we realized here in the third quarter. On your other question, I mean, look, we are holistically adjusting the cost base on all dimensions, all areas. So, that entails both, the adjustments for reduced volume levels across the board, and you see progress there in a number of the lines, and then gaining traction as we lean into realizing the structural reductions with DRIVE. So, we will look forward to updating further about how the various initiatives are playing out here when we see you on April 5th. And then just to come back to DRIVE one more time, maybe level set expectations, if you could. I think, Raj, youâ\u0080\u0099ve talked about how weâ\u0080\u0099re going to get a lot more granular details and metrics and the work streams. I donâ\u0080\u0099t think weâ\u0080\u0099ve really gotten that much in the past, or at least not that consistently. First, Brian, weather was roughly about a $50 million year-over-year headwind. The DRIVE program is -- creates a lot more rigor, and Iâ\u0080\u0099m just thrilled with the progress as the team has applied this rigor and discipline to the work at hand and look forward to showcasing them to you in just a couple of weeks here. Can you talk a little bit about with the raised EPS outlook in just 2.5 months left in the fiscal year, where do you think youâ\u0080\u0099re going to come out in free cash flow for fiscal â\u0080\u009823? So yes, weâ\u0080\u0099ve continued to generate solid free cash flow even amidst the challenged business environment, which heightens our emphasis on capital efficiency. Oh, sorry, the onetime cost...\n On what free cash flow could be. Brie, I maybe just wanted to follow up on your comments about the higher capture on the GRI in Europe. I guess, Iâ\u0080\u0099m a little surprised by that given the softer demand environment. From a European perspective, I do think itâ\u0080\u0099s important to remind everybody that we have a very unique value proposition in Europe. And also, our sales and our customer service team do an incredible job with very personalized and social -- or solution-oriented selling. But I think the ability to get that GRI capture really emphasizes the loyalty that we do have in that customer base and honestly, an opportunity to go take some more profitable share in Europe. Raj or Mike, Iâ\u0080\u0099d like to talk -- Iâ\u0080\u0099d like to ask you to talk a little bit more about the fleet strategy going forward. And as we now look at the demand environment, we donâ\u0080\u0099t see that high demand coming through. So, we look at opportunities to right-size the fleet, and this is the predominant planning cycle as happens over Q4, so weâ\u0080\u0099ll update you on those plans as our entire fleets needs are finalized here. Mike, I just wanted to ask a question on Express margins just coming back to it a little bit because if I look at the range of outcomes over the last couple of years, itâ\u0080\u0099s been as high as 9.2%; itâ\u0080\u0099s been as low as 1.2%, which you just reported. And then kind of related to that, one of the criticisms from the Investor Day was the Q&A wasnâ\u0080\u0099t really -- didnâ\u0080\u0099t have a lot of, how do I say, detail around the bottom-up strategy, the cadence of the pathway to the improvement. So first, the way we have structured the DRIVE framework is that we have 12 domains with individuals assigned to each of those that are accountable and own the realization of the opportunities that are identified there. Now, of course, thereâ\u0080\u0099s multiple teams, and thereâ\u0080\u0099s multiple sub initiatives under that to enable those outcomes. But to the question of how do we measure and have accountability, that is definitely the structure and framework that we have in place. To your question about Express margin and profit volatility, thatâ\u0080\u0099s precisely what Raj was highlighting is a primary focus is to make the business more agile, more flexible with the various deployment of technology, making our fleet more flexible so that we can react and adjust. So, certainly realize that we need to build from here, and fully anticipate that going forward, and we will be relentlessly focused on that across the board. Ravi, this definitely illustrates the discipline, rigor and focus we have around responding, adjusting to changes in the volume environment, running an efficient network and adjusting in short order. Again, Iâ\u0080\u0099d highlight last year was -- quite frankly, the last two years, were quite unprecedented in terms of ability to both project and understand demand because our customers themselves were -- had a lot of uncertainty amidst the dynamics of the pandemic. And we sometimes skip over it, but the profundity of the labor availability and the immediate cost increases in terms of higher wage rates that were experienced at Ground canâ\u0080\u0099t be diminished. But this is a rigor and discipline that, as Brie said, it also supports our service levels across the board, too. So, itâ\u0080\u0099s a virtuous cycle there that weâ\u0080\u0099ll build upon going forward. Our next question is from Jeff Kauffman, Vertical Research Partners. Brie, we were out talking to different customers, and some had indicated to us that they were a little concerned about the potential for a labor action at one of your competitors and had begun shipping with you guys, which is something they didnâ\u0080\u0099t normally do. I was just wondering, I guess, a, we could look at this as, oh, itâ\u0080\u0099s a short-term thing; b, we could look at this as itâ\u0080\u0099s an opportunity to bring in some new customers. Could you talk about how youâ\u0080\u0099re engaging some of these customers that may be coming to you and saying, hey, Iâ\u0080\u0099m nervous. And so, as we think about any potential exogenous factor in the market that might put stress in the market, our goal is to protect our customers and to make sure that weâ\u0080\u0099re there for them. So absolutely, as customers are inquiring about available capacity at FedEx, we have been really clear that, yes, of course, we would entertain any good business, and weâ\u0080\u0099d love to talk to them. And anybody that wants to come and enjoy the FedEx value proposition, weâ\u0080\u0099re happy to talk to them prior to March 31st. This concludes the question-and-answer portion of todayâ\u0080\u0099s callâ\u0080¦\n Thank you, operator. In closing, I want to thank our team members as FedEx was once again the only delivery company ranked in the top 20 of the Fortune Worldâ\u0080\u0099s Most Admired Companies. And as we celebrate our 50th anniversary next month, Iâ\u0080\u0099m most excited about the ways that this team will continue to innovate and deliver for the next 50 years."
}