{
    "symbol": "FND",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 00:37:07",
    "content": " These earnings results are particularly gratifying to us when we consider our previous year's record sales and profits, the current operating environment, which includes extraordinary high inflation, rising mortgage rates, 10 months of declining year-over-year existing home sales and higher global supply chain cost and congestion. During the second quarter of fiscal 2022, we opened nine warehouse format stores compared with seven stores during the same period last year, including six warehouse stores in new markets. On a three year compound annual geometric growth rate basis, our second quarter comparable store sales increased 13.4% versus 15.4% in the first quarter and 13.4% in the fourth quarter of fiscal 2021. As expected, second quarter comparable store sales were driven by 17.9% growth in our average ticket. Consequently, Pros accounted for approximately 39% of our sales growth in the second quarter of 2022, up 500 basis points from the previous year. Today, over 80% of our Pro sales come from PPR members, and points redeemed increased 45% year-over-year in the second quarter. In the second quarter of fiscal 2022, design total and comparable store sales growth were significantly above the company's growth rate. We are also pleased that our second quarter sales from our regional account managers or RAMs, increased 80% year-over-year and 34% from the first quarter. As a percentage of sales, selling and store operating expenses increased 70 basis points to 24.5% from 23.8% in the same period last year driven entirely by our new stores. As a reminder, in the second quarter of last year, we leveraged our selling and store operating expenses at 610 basis points due to strong sales growth. Second quarter general and administrative expenses increased 0.5 percentage point, and as a percentage of sales, leveraged approximately 120 basis points to 4.9% from 6.1% last year. Second quarter net interest expense increased $400,000 or 29.3% from the same period last year. On a rate basis, our second quarter EBITDA margin declined 210 basis points to 13.8% from last year's record 15.9%, primarily due to the decline in our gross margin rate. We are pleased that our second quarter adjusted diluted earnings per share increased 4.1% to $0.76 from last year's record $0.73 per share last year, exceeding our expectations. Our inventory at the end of the second quarter of fiscal 2022 was $1.3 billion, an increase of 97% from the same period last year and 33.3% from the end of fiscal 2021. We are pleased with the start of -- over the third quarter of 2022, where our quarter-to-date comparable store sales are up about 13% and transaction declines are slightly better than the second quarter's 7.3% as we begin cycling past easier transaction comparisons. With that in mind, we are planning on comparable store sales growth to decelerate from the third quarter to date comps of 13% to a high single-digit comp as we approach the end of the year. At the midpoint of this range, the updated guidance would represent about a 5% reduction from our prior guidance and 12% growth from last year's adjusted diluted earnings per share, demonstrating the agility and durability of our business during a challenging economic period. Comparable store sales growth of approximately 10% to 11% compared with our prior guidance of 10.5% to 13%, adjusted diluted earnings per share to be in the range of $2.65 to $2.80 compared with our prior guidance of $2.75 to $3."
}