{
    "symbol": "IQV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 13:57:09",
    "content": " Compared to last year and excluding COVID-related work from both periods, our base businesses grew 14% at constant currency on an organic basis. Third quarter adjusted EBITDA increased 11.8%, reflecting our strong revenue growth and ongoing cost management discipline, offsetting the headwinds of wage inflation that are persisting in our business. Technology & Analytics Solutions revenue for the third quarter was $1.4 billion, up 4.7% reported and 11.6% at constant currency. Finally, Contract Sales & Medical Solutions or CSMS third quarter revenue of $183 million declined 9% reported but grew 1% at constant currency. Technology & Analytics Solutions revenue year-to-date was $4.247 billion, up 5.2% reported and 10.3% at constant currency. Finally, Contract Sales & Medical Solutions or CSMS year-to-date revenue of $561 million declined 4.6% reported and grew 2.9% at constant currency. Adjusted EBITDA was $814 million for the third quarter, representing growth of 11.8% while year-to-date adjusted EBITDA was $2,426 million up 10.6% year-over-year. Adjusted net income was $470 million for the third quarter and adjusted diluted earnings per share grew 14.3% to $2.48 and year-to-date adjusted net income was $1,413 million or $7.39 per share. Our backlog at September 30 stood at a record $25.8 billion, an increase of 5.4% year-over-year on a reported basis and 9.4% adjusting for the impact of foreign exchange. Next 12 month revenue from backlog increased to $7.1 billion, growing 2.8% year-over-year on a reported basis and 6.7% adjusting for the impact of foreign exchange. In addition, as already mentioned, global macro environment challenges such as wage inflation, investigator staff shortages, slower than expected recovery of patient visits, continued lockdowns in China and the still unresolved Russia-Ukraine conflict are persisting and so far, we've been able to offset all these challenges and absorb them in our numbers, but we're forecasting a modest residual impact in pockets of our business during the balance of the year, and we reflected this in the updated values. We're now expecting the guidance range to be between -- we are now setting the guidance range to be between $3,330 million and $3,360 million, which represents year-over-year growth of 10.2% to 11.2%. Moving to our fourth quarter guidance, we expect revenue to be between $3,654 million and $3,754 million or growth of 5.5% to 8.2% on a constant currency basis, and 0.5% to 3.2% on a reported basis. Excluding all COVID-related work, we expect organic revenue growth at constant currency to be over 10% at the midpoint of our fourth quarter guidance. We repurchase nearly $150 million of our shares while reducing our net leverage ratio to approximately 3.4 times trailing 12 month adjust EBITDA and finally, we retired at the beginning of the fourth quarter, $510 million of our variable term debt. You saw that we paid down debt in the fourth quarter with a term loan that was coming to $510 million in -- early in 2024 and comparatively expensive, and we'll be looking to pay down some additional term loan debt that near term in maturity as we go through next year."
}