{
    "symbol": "IQV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 11:40:25",
    "content": " Technology & Analytics Solutions revenue for the fourth quarter was $1,499 million, up 0.2% reported and 4.7% at constant currency. R&D Solutions fourth quarter revenue of $2,058 million was up 5.9% reported and 9.3% at constant currency. Finally, Contract Sales & Medical Solutions or CSMS fourth quarter revenue of $182 million declined 7.1% reported, but grew 2% at constant currency. For the full-year, revenue was $14,410 million growing at 3.9% on a reported basis and 7.8% at constant currency. For the full-year, Technology & Analytics Solutions revenue $5,746 million, up 3.8% reported and 8.7% at constant currency. Full-year revenue in R&D Solutions was $7,921 million growing 4.8% reported and 7.7% at constant currency. Adjusted EBITDA was $920 million for the fourth quarter, representing growth of 11.1% while full-year adjusted EBITDA was $3,346 million which was up 10.7% year-over-year. Adjusting for the COVID-related work step-down which we anticipate to be approximately $600 million, the contribution of acquisitions and the FX tailwind, our guidance implies 9% to 11% underlying organic revenue growth at constant currency. Now at the segment level, we expect revenue growth to be 6% to 8% reported, this includes a year-over-year step-down in COVID-related work underlying organic growth for TAS that is adjusting for the step-down and COVID work, FX and acquisition impacts will be 7% to 9%. For the full-year, revenue grew 13% organic at constant currency excluding COVID-related work, and adjusted EPS was up 13%. And lastly, we're projecting strong operating performance again in 2023, with 9% to 11% organic revenue growth at constant currency excluding COVID-related work, and 11% to 14% adjusted EPS growth excluding non-operational headwinds. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}