{
    "symbol": "SKLZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 20:29:18",
    "content": " We don't report on Aarki as a separate business unit, though we are -- we continue to be really excited about the business prospects for Aarki and its opportunity both to enable Skillz to offer a complete service offering to developers around both monetization and acquisition, but also the synergies that exist between our business and the Aarki business, particularly with respect to both our media spend and our ability to potentially enhance Aarki's targeting abilities with first-party data. I think this year, we're very focused on driving efficiency, so profitable revenue growth in bringing our overall adjusted EBITDA within a range of going cash flow positive, I think we've been messaging repeatedly that we intend to be breakeven as a total business by the end of 2024. So I think when Andrew mentioned a couple of those investments, core loop being something that helps drive an improved on system player experience, which increases LTV, cloud gaming being an example of an investment that reduces friction in the discovery of the product itself and viral coefficient, which accelerates growth on top of the existing marketing investments that we're making. And then again, just to recap, I think Andrew mentioned a little earlier, we expect to exit Q4 of this year with the target revenue after engagement marketing growth rate of above 30% in adjusted EBITDA margin of better than negative 10%. So I think you'd say on the top line revenue growth rate, given the continued optimization we're looking to do on engagement marketing, I expect the growth rate in Q2 probably to be a little bit lower than Q1. So we're of the view that today, we can generate a much higher return for our shareholders by investing in our business, so building better products and better platform for our users and developers, better content and let people downstream things potentially like a stock by back today. Also, as those games are getting live, we've actually built a progression system last year that we've been rolling out to the developer community, which enables developers to better customize the player experience and to enable users to have an increasing sense of ownership in progress as they play each game on the platform."
}