{
    "symbol": "ELME",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 14:58:04",
    "content": " The cost of owning a home in our markets has grown more than renting an apartment over the past few years and now stands at nearly $600 per month or 28% above our rents in Atlanta and over $1,200 per month or 43% above our rents in the Washington Metro. Effective new lease rate growth was 1.1% and the effective renewal lease rate growth was 10.1%, which blends to 5.7% for same-store move-ins that took place during the fourth quarter. For February move-in so far, effective blended lease rate growth increased to 5.8% for our same-store communities comprised of renewal lease rate growth of 9.1% and new lease rate growth of 3.7%. Retention was 62% during the quarter, which is a slight sequential increase as we continue to experience high renewal demand, supporting very strong renewal rate growth of approximately 9% year-to-date. Average effective monthly rent per home grew 9.7% in the fourth quarter compared to the prior year and 7.6% for the full year, reflecting the impact of the very strong lease rate growth we captured during 2022. Our current rent levels in February, plus the March move-ins we signed represent rental growth of approximately 5%, which is nearly 70% of the rental rate growth that we expect for the full year. Core FFO for the fourth quarter was $0.24 per diluted share, representing year-over-year growth of over 40%, driven by strong growth in rental income and the full deployment of our commercial portfolio sale proceeds. Multifamily same-store revenue grew by 8.9% for the quarter and 7.3% for the full year due to growth in rental rates, lower concessions, higher occupancy, and an 11% year-over-year decrease in bad debt for the full year. Interest expense is now expected to range between $29 million and $30 million, which incorporates a higher anticipated future Fed funds rate as the interest rate outlook has shifted since we announced our 2023 guidance last year as well as the impact of our new term loan. And I think we mentioned it in our prepared remarks, we have actually seen a decline in our rent-to-income ratio in our Atlanta properties that we have owned now that are entered the same-store pool has actually decreased to about 25% as we have seen strong growth from new renters moving into our properties and also improving the credit profile versus prior ownership. And in the Washington Metro, we have seen the numbers stay steady, which even in the face of strong rent growth, and we are around 26%, which is in line with our long-term average rent-to-income ratios for our assets."
}