{
    "symbol": "REAL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 22:50:17",
    "content": " After the speakers' presentation, there will be a question-and-answer session. I would like to now hand it over to Caitlin Howe, Head of Investor Relations. Joining me today to discuss our results for the period ended December 31, 2022, are President and Chief Operating Officer, Rati Levesque; and Chief Financial Officer; Robert Julian. Also joining us on the call today is our new Chief Executive Officer of The RealReal, John Koryl. Before we begin, I would like to remind you that during today's call, we will make forward-looking statements which involve known and unknown risks and uncertainties. You can find more information about these risks, uncertainties and other factors that could affect our operating results in the company's most recent Form 10-K and subsequent quarterly reports on Form 10-Q. Today's presentation will also include certain non-GAAP financial measures, both historical and forward-looking, for which historical financial measures, we have provided reconciliations to the most comparable GAAP measures in our earnings press release. In addition to the earnings press release, we issued a stockholder letter earlier today, both of which are available on our Investor Relations website. I would now like to turn the call over to John Koryl, Chief Executive Officer of The RealReal to introduce himself and provide a brief overview of his background. Then John will pass it over to Rati and Robert for an update on the business and finally, we will go into our Q&A session. As Caitlin mentioned, I wanted to take a few moments to introduce myself and provide some further insight into my background. First, let me start by saying I'm thrilled to have joined The RealReal, the company's approach, customer breadth and brand recognition within luxury resale are second to none. I am excited about our digital first company with growth tailwinds in terms of consumer trends and demographics, along with an authentic ESG story. Perhaps and most importantly, the talent that I have encountered so far at The RealReal is inspiring. As we all know the company's valuation is under pressure at the moment, and achieving profitability is the company's focus. Most recently, I led Canadian Tires online business through a period of substantial growth. We demonstrated operational excellence through the COVID-19 pandemic, amid a massive surge in demand and disruptions to our store operations. We accomplished significant cost reductions, while improving service levels for our millions of e-commerce customers. Similarly, during my tenure at Neiman Marcus, we drove considerable growth of our digital platform through new marketing vehicles, site experience improvements and omnichannel efficiencies. We balanced growth with profitability during this period, focusing on marketing to the right customers, delivering them the right experience, and doing so in the most efficient way possible. Now I have no illusions that The RealReal's path to profitability will be achieved overnight, or with only minimal effort. Rather, these types of accomplishments take both time and energy. Based on what I've seen in my first month at The RealReal, I am confident we can achieve profitability in the near future. Today, we reported solid financial results for the fourth quarter and full-year 2022. For the fourth quarter, both revenue and adjusted EBITDA came in better than the midpoint of our guidance. For full-year 2022, we improved our adjusted EBITDA loss and adjusted EBITDA margin compared to the prior-year. Despite a more challenging business environment, I believe we have made the changes necessary to deliver better results. Over the past six months, Robert and I identified and started to push on different levers in the business to reach profitability. To this end, we have been and continue to be focused on four key initiatives, which we laid out on the last earnings call. First, adjust our seller commission structure; second, continue to drive efficiencies and reduce costs; third, further optimize our product pricing to get the best price for our sellers in TRR; and finally, capitalize on potential new revenue streams. The first key initiative was to update our commission structure, which we implemented in November of 2022. The goals were to optimize take rate, limit the consignment of lower value items and increase the supply of higher-value items. We are closely monitoring the impacts of our recent changes, and we are encouraged by the early results. We have seen supply continue to come in and value is growing faster than units, which is aligned with the intended goal of the changes. Over the next few months, we will analyze the data and identify ways we can continue to improve our take rate profile. First, we added a dynamic tool to our website to allow consignors to calculate their potential earnings, enhancing transparency in the consignment process. Additionally, we began rolling out our new consignor Concierge team, which pairs each consignor with a small dedicated team of consignment customer service experts. Early results indicate that the consignor Concierge team is helping us to resolve issues faster, increase our Net Promoter Score and improve the overall consignor experience. Going forward, we will continue to assess our approach to further optimize commission structure and enhance the customer experience. Regarding the second initiative around improving efficiencies and cutting costs, we recently announced a reduction in our workforce of approximately 7% of the total employee base and a rationalization of our real estate footprint. As part of this action, we announced the closure of two flagship stores, two neighborhood stores and two luxury consignment offices. We closed underperforming stores, and we will continue to thoughtfully assess our store fleet to optimize our retail footprint. However, we will be disciplined in opening and closing stores to efficiently manage our cost base. our buyer acquisition cost was down 36% in Q4 2022 compared to Q4 of the prior-year, while effectively managing our marketing costs, active buyers was up 25% in the fourth quarter. During Q4, approximately one quarter of all of our inventory was covered by our new algorithm, and we anticipate that by year-end 2023, we'll have closer to 80% coverage. As you know, product pricing directly impacts our sellers as well as our profitability. We are moving fast and with urgency, but we believe these key initiatives will take time and their impact will not be meaningful, not be meaningfully reflected in our financial results until the second half of this year. In combination, we are confident these key initiatives will help move the business to profitability. Furthermore, we are excited to get John up to speed and move into the next chapter of The RealReal's evolution. We are especially encouraged that the changes we made during the year in particular, shrinking the direct business and growing the profitable consignment business were evident in our fourth quarter results. During the fourth quarter, GMV grew 13%, and our total revenue grew 10% compared to the prior-year. During the fourth quarter, our gross margin was 60.5% and an increase of 490 basis points compared to the prior-year. In Q4, gross profit increased $16 million or 20% compared to the same quarter in the prior-year. At the end of Q4, we had $43 million of net inventory on hand, a decrease of $20 million compared to the end of the prior quarter and a decrease of $28 million compared to the end of the prior-year. Today, we are providing first quarter 2023 guidance. Given that John is new in his role, we will not, at this time, be providing full-year 2023 guidance. However, we anticipate providing full-year financial targets during our next earnings call in May. For the first quarter of 2023, we project GMV to be in the range of $340 million to $360 million. We project Q1 revenue to be in the range of $135 million to $145 million, and we project Q4 adjusted EBITDA to be in the range of minus $35 million to minus $31 million. As a reminder, Q1 is seasonally a lower volume quarter for us. Additionally, our Q1 guidance includes a sequential increase in bonus accrual and a onetime accrual for the change in our loyalty program. Taken together, these create a flat year-over-year comparison in our adjusted EBITDA and a sequential decline compared to Q4 2022. Thanks very much for your attention, and we will now go into our Q&A session. At this time, we will conduct a question-and-answer session. And then secondly, you mentioned the EBITDA decline is bigger sequentially despite less profitable direct business being a smaller percentage of the mix. So in terms of the guidance and the flat revenue year-over-year, I'm actually very happy that you've asked the question, Anna, because I would like for folks to think about our business, bifurcate it now between the growth of our consignment business and the growth of our direct business. But what we're seeing in that result that overall minus 1% revenue is actually the consigned business continuing to grow in the 20% range, that good profitable business. You may recall that our direct business peaked both in terms of absolute dollars and in terms of its percentage of total revenue in Q1 of 2022, it was 34% of our total revenue in Q1 of 2022. The consigned -- the good consigned business, the profitable consigned business growing very healthily and the unprofitable direct business is shrinking. It does have a significant impact on our gross margin, which we project to continue to improve. And really, the biggest impact is volume. And I would say we mentioned in our opening comments that there is a bonus accrual, an annual bonus accrual, which frankly, did not pay and what's not accrued in the prior-year, which creates a couple of million dollar sequential decline. We changed our loyalty program, and it requires an accrual to be built up on the balance sheet that is front loaded in the beginning of 2023, which is another couple of million dollar decline. And a little bit, it's hardly worth mentioning some of this customer service activity has a little bit of a sequential increase as well. In retail, you just do see less volume in comparison to Q4. So in addition to everything Robert said, the onetime accrual and then a smaller investment, like he mentioned in the concierge pause with good news is we are seeing a healthy result in Net Promoter Score because of that. I guess just a higher level to start with, we've been hearing more about the aspirational consumer pulling back. And then thirdly, just in light of the restructuring, I was hoping you could touch more broadly on the real estate strategy. I'll take those, and I'll let the team add if needed. On the consumer side, it all starts at the top of the funnel, similar to the seller traffic is quite healthy and strong. Active buyers, we've mentioned, is up 25% year-over-year. I think I mentioned on the last quarter, we were seeing a bit of a trade-down effect where people instead of buying the top-tier luxury brands was maybe kind of trading down to that next year, five points less here and there. So we're not seeing that go up or down, since it has stabilized since Q3. So overall, pretty healthy on the consumer side both buyer and seller, and we feel good about that and really playing into the value play that we are especially on the pricing side as we go into more uncertain time. And then your next question on restructuring and real estate strategy, specifically on -- I think you're speaking about the retail stores. First of all, we're always optimizing our fleet. So where we really focused was around our flagship stores and luxury consignment offices, which were early concepts and less sufficient to drive supply. They're quite expensive to run, especially the flagship store. So I don't want to say never say -- never say never, but we don't expect to open more flagship. So it's in between that luxury consignment office and that flagship, and that's where we're seeing the most value come in and the most volume, but we continue to be opportunistic with these retail locations, and we're getting smarter about our leasing and contracts in our markets that we're targeting. Please standby for our next question. I'll start that one, Blake. I think that we had mentioned that many of these initiatives, you're really going to see the full impact in the second half of 2023. And as we mentioned before, we're not providing full-year guidance. But I do think it's fair for you to expect sequential improvements in adjusted EBITDA every quarter of 2023 and a pretty significant change in trend in the second half of 2023, leading to our confidence that we will be positive adjusted EBITDA in the full-year of 2024. And it's really a combination of all the strategic initiatives that we've been talking about, they all have varying degrees of impact on the overall results. So authentication really is core to what we're doing, and we're always looking to find efficiencies there. We've invested pretty significantly in how we measure and authenticate jewelry, diamonds specifically, where now we can hire a technician versus a gemologist to authenticate those items. We have a roadmap, a short, medium and long-term roadmap to really find even more efficiencies there to kind of offset the rigor of authenticating. Please standby for our next question. And you said that, that was because of lower selling prices. As far as the AOV be being down 2% year-over-year, and the lower emphasis on low-value and how we should consider that. Average selling price is slightly down, but that's really driven out of mix more than anything. But it really is just kind of all weighing game between AOV, UPT and ASP. And net-net, we expect those numbers to go in the right direction as far as value of the item. So as we get out of items that are low-value under $100, you're going to see kind of all of those numbers lift in the right direction. But again, net-net, with ASP increasing and AOB increasing, that's how you can expect the numbers to trend in the back half of the year. As far as marketing expenses and the back piece, yes, we did find great efficiencies, down 36% year-over-year. We also just have -- when you have a lot of volume and you have really great product, that also helps the marketing spend, especially with the repeat buyers. And Kunal, one thing I'll add on, we made some comments. I made some comments about the sequential change in adjusted EBITDA from Q4 2022 to Q1 2023, and I said there was more marketing expense sequentially between those two quarters. We haven't -- as we mentioned before, we haven't given full-year guidance yet. So that sequential change may not be indicative of a full-year change in trend on the change in marketing, spend in aggregate. Please standby for our next question. Yes, I'll take the first one. As far as real estate and stores are concerned, Again, we were very careful about which stores and real estate that we decided to shut down. Again, these were stores that were underperforming in comparison to the rest of the past. Sure, I'll take that. And we -- all that we've disclosed financially about the reduction in force is the cost of the severance and so on, somewhere between $1.7 million and $2.5 million. We've given a number in terms of how many folks are impacted by that, the 7% or roughly 230 people. We did not give a figure on a full-year savings amount, again, because we did not provide full-year guidance. But for modeling purposes, I guess, I would say you could make an assumption relative to how much you think a fully loaded person is impacts the P&L, and you could apply it to roughly 230 folks, and you would get the -- at least the incremental impact of that one piece of our expected full-year results in 2023. Just one for me, I guess. Just on take rate, it was -- I apologize if this was asked earlier, but marketplace take rate, I think, declined sequentially. And I understand, I think historically, the fourth quarter is a lower take rate, but you guys also, I think instituted those changes that could have -- should have increased take rates. One of the things, Marvin, I would mention is we always talk about take rate is effectively the result of our mix of what people are putting in their basket and whether it's high priced items that have a relatively lower take rate or lower price items that have a relatively higher take rate. And I would say, while we made a change to our commission structure and take rates in Q4 not much of that was very much reflected in the Q4 results or the Q4 take rate. It was just too far into the quarter, and there's just too much of a lag to see that. So I would attribute any change sequentially in take rates, it's just a change in mix between low take rate items and high take rate items that folks put in their basket. I do think that it's fair to anticipate that there could be an improvement in take rate year-over-year based on the commission structure changes that we made, which was being partially the intent of that exercise. And I guess if I could follow-up maybe on the topic of mix, because of the pandemic and the savings thereafter, there was a lot more consumption of jewelry and handbags and then it seemed like that was reverting back to apparel. As far as categories are concerned, they're all doing actually quite healthy, really driven out of ready-to-wear, but a lot of that, like you mentioned, is just rightsizing to pre-pandemic numbers. So as people are getting back out there, we're seeing a lot more sales in ready-to-wear and then as well as fine jewelry, specifically driven out of unbranded. So on the commission structure and the changes that we made on the supply side, good news is we're seeing value, like I mentioned, come in. One of our objectives was minimizing the lower-value items, so specifically items under $100 million. And it's still pretty early in the read there, but the rest of the price points, mid-tier and especially high value is quite strong. again, it's doing what we want to on low, low-value items under a $100 million is how we identify that internally and then mid and especially high doing quite well. No changes in the buyer behavior, except for what I said around the categories, ready-to-wear being quite strong versus pre-COVID numbers. Hey, John, just a bigger picture question. As you looked at this opportunity to join RealReal and you kind of peel apart the P&L, and I appreciate you're not giving financial guidance there yet. The reason I joined, quite frankly, is the RealReal defined the space. And our job, as you've heard from these guys, Rati and Robert specifically, is it's time to refine it. We have to spend the time addressing all of those things, getting in that right supply, getting it authenticated in the right way, shipping it more efficiently. But at the same time, we had to adjust the commission rates so that we can find that right mix and balance. So again, I joined here, quite frankly, because of, A, the mission, right; B, the model. So we're literally tearing apart every aspect of the P&L to say, where do we do our part. There are things that we just need to test, learn, increment and quite frankly, implement a lot of small wins that lead to big results. So again, not one line, it's a multi-lane answer. Before we close the call, I want to take a moment to express our deepest gratitude to the RealReal team. We are excited about the direction of the business, and we appreciate your tireless effort, energy and passion. To our people at the RealReal, thank you. Finally, I'd like to thank our more than 31 million members who are joining us on our mission to extend the life cycle of luxury goods and make fashion more sustainable."
}