{
    "symbol": "REAL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 23:43:06",
    "content": " To this end, we are focused on the following strategic initiatives: first, overhauling our seller commission structure, which took effect on November 1; second, further optimize our pricing algorithm to get the best price for our sellers; third, take a more aggressive approach on costs; and finally, capitalizing on potential new revenue stream. So Lauren, on the first part of your question, I do think that there's some lots of -- being totally honest, there's somewhat of an unknown in terms of what the normalized growth rate might be with this new approach in this new commission structure and taking things off our list in terms of different brands. But as I look right now at the website, there's -- and if I just go into one of the basic apparel categories, there are hundreds and hundreds of items under the $20 price point in here in men's apparel and women's apparel, I have to think those are -- show some economic dynamics close to categories like kids just told us don't make sense to put that many units through the system. So I mean if you're incentivizing high-end products and disincentivizing low ASP products, there's a mix shift headwind that you talked about, presumably to incentivize people to sell higher-end goods, you're going to improve the payout on those goods, which would be detrimental to your take rate. And as I said before, the higher price point items, we have a less rate -- take rate, but maybe more gross profit dollars, over lower priced items, we have a higher take rate, but we're earning less gross profit dollars. all of things being equal at constant mix, you would see a significant change and in our overall take rate and increasing our overall take with all other things being equal, which means sort of across the board, we're earning more, we're keeping more or overall revenue per GMV dollar is going up and we're going to be more profitable. And just like before, a decline in take rate is not the equivalent is bad news for our business at the time a lower take rate is good news for our business because we're selling more high-priced items in which we earn more gross profit dollars for that item. Yes, I agree with everything that Rati said, the other thing that I would add is I do think it's a benefit to our sales organization, we're spending in  amount of time dealing with these issues, maybe they weren't best equipped to handle versus somebody else who's dedicated to managing these sort of issues could do a better job. On the guidance side,  carton somebody how those people are paying attention already to  conversion but you're -- so if there's a larger range in revenue that is normal is the range we provided in GMV, is partially impacted by what you suggested at the high end versus the low end impact, only because of that is on a  explained earlier about the mix impact on the nominal rate."
}