{
    "symbol": "ENG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 08:18:27",
    "content": "  Operator: Good morning, and welcome to the ENG's 2022 First Quarter Financial Results Conference Call. At the request of ENG, today's call is being recorded, and will be available for replay on the Investor Relations section of the company's corporate website www.englobal.com. During today's conference call, company representatives may make forward-looking statements. A discussion of factors that could cause such differences appears in the Risk Factors section of the Company's 10-K. Presenting on the call today will be Darren Spriggs, ENG’s CFO; and Roger Westerlind, ENG's President. For the quarter, we reported approximately $7.4 million in operating revenue and $8 million in direct operating costs. Included in the direct operating cost is $426,000 related to underutilized staff, which is lower by $369,000 compared to the same period last year. Also included in direct costs is $829,000 of proposal costs, which has significantly increased over the same period last year due to the increase in volume of proposals. Our SG&A increased $282,000 compared to the same period last year, which included non-recurring legal fees of $70,000. We recorded a net loss of $3.6 million or a negative $0.10 per share for the year compared to the net profit of $46,000 or $0.00 per share last year. Our backlog increased by $500,000 to $13.3 million compared to $12.8 million at the end of last year. As of the end of last year, it was $12.8 million, and this quarter, it was $13.3 million. As a reminder, last year, we completed a rebranding campaign, relocated our corporate office to be closer to our client base, redesigned our website, hard key business development personnel with strong relationships to clients in our industry. Our cash balance was $17.7 million as of the end of the quarter, a decrease of $1.5 million over last year's balance of $19.2 million. The change in our working capital is primarily related to the $3.6 million loss for the quarter, but it included an employee retention tax credit refund of $1 million. We believe this cash on hand, along with internally generated funds, availability under the company's revolving credit facility, and other sources of working capital will be sufficient to fund ENGlobal's current operations and expected near-term growth. Our bookings in April actually exceeded the bookings in the first quarter, which we think is a great indication that all the things we have done is starting to pay off. We have a number of these projects, and we expect the value for ENGlobal to be in excess of 100 million."
}