{
    "symbol": "ENG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:46:06",
    "content": "  Operator: Good morning, and welcome to the ENG 2022 Third Quarter Financial Results Conference call. At the request of ENG, today's call is being recorded and will be available for replay on the Investor Relations section of the company's corporate website, www.englobal.com. This replay will be available shortly after the completion of this event through 9:00 a.m. Eastern Time on November 15, 2022. At this point, I would like to turn the call over to Rick Eisenberg, Media Relations Director with Eisenberg Communications. Thank you, operator, and thanks, everyone, for joining us on this call. During today's conference call, company representatives may make forward-looking statements. A discussion of factors that could cause such differences appears in the Risk Factors section of the company's 10-K. Presenting on the call today will be Darren Spriggs, ENG's CFO; Roger Westerlind, ENG's President; and Mark Hess, ENG's CEO. Following the presentations, Darren, Roger and Mark will be available for questions. For the quarter, we reported approximately $13.1 million in operating revenue, a 121% improvement compared to $5.9 million for the same period last year. Making this the fourth consecutive quarter, revenue has increased. This increase is attributable to the improvement in underutilized staff, which is lowered by 766,000 compared to the same period last year. Although, our gross margin percentage may vary from quarter-to-quarter, depending on the composition of the segment revenue, we expect our margins to continue to improve. SG&A decreased $169,000 compared to the same period last year. We held our fixed cost in line with previous quarters, notwithstanding the recent acquisition and the startup cost of our two new facilities. For the quarter, we recorded a net loss of $2.3 million or a negative $0.07 per share, compared to a net profit at $2.4 million or $0.07 per share last year. Last year's net income of $2.4 million included non-recurring other income of $6.4 million, which consisted of $5 million for our PPP loan forgiveness and $1.4 million for an employee retention tax credit. The improvement in backlogs and indication that our recovery is continuing and that the key strategic initiatives we implement in last year are producing the desired results, we expect our bookings to be significantly higher in Q4 compared to the previous quarters, and to carry a healthy backlog into 2023. For the year, we have been awarded 106 POs for new work with an average PO value of $227,000. For the quarter, we received 35 POs for new work with an average value of $181,000. For the first nine months of the year, revenue, gross profit and operating income all improved compared to the same time period last year. Gross profit increased by $1 million to $1.3 million from $300,000. We are pursuing additional financing alternatives in the event, we need additional working capital to fund our current operations. We believe our cash on hand, along with internally generated funds, availability under the companyâ\u0080\u0099s revolving credit facility and other sources of working capital will be sufficient to fund ENG's current operations  and expected near-term growth. As discussed before, ENG's focused markets are oil and gas and petrochemicals where we provide project management, engineering, procurement, fabrication, and also field construction services for trail mid and downstream clients. And as Darren mentioned, announced before, our GTL is a gas-to-liquid for stranded and flare gas is picking up speed. We have several opportunities, especially in the Middle East area. Since we last spoke, ENG has oil and gas, and petrochemical, we signed a number of major MSAs with major international companies, completed our first construction contract and finally, we see a lot of opportunities created by Doug and his team. Kevin, focusing on automation for government and industry and his team is focusing on the integration and automation market and making steady progress both with the DoD, DOE and major operators. Energy and renewables, Marc, delivered our first renewable diesel plant for Seaboard as earlier announced. Gas-to-liquid, the team is making headway in especially Middle East. As Darren mentioned, we signed a new lease in Brookshire which is West of Houston for our state-of-the-art fabrication facility, which we announced before. We also got our field service organization in Monahans, which is 45 minutes roughly at west of Midlands, Texas, which is really promising for field service and rest of bus crews. Since we last spoke, we have booked a number of new work. Few examples, if you start with oil and gas, and petrochemicals, we are doing a solar farm in Texas. We have signed an MSA with â\u0080\u0093 sorry, with one of the largest IOCs. We also awarded engineering for methane upgrades, the fabrication of vessels and compression station upgrades. In energy and renewables, we have expanded our strategy as earlier discussed to also service the chemical companies and the downstream opportunities. Of course, we are still focusing on the renewable diesel, especially the Sustainable Airplane Fuel segment, which is very active with several opportunities. In automation in DoD as Darren mentioned, we have been awarded by the Army Corps of Engineers. As also mentioned for GTL, we have several 50 barrel proposals out, which we are very hopeful to receive the PO soon. A few highlights in the oil and gas, and petrochemical group, we have some 30 hard bids outstanding with a total value of approximately $50 million. Automation and integration, both for IOCs and DoD, DOE has several opportunities. For energy and renewables, we have a mix of chemical and renewable projects, some 20 prospects value totally over $100 million. And lastly and not least, gas-to-liquid as I said before, mainly in the Middle East for major operators, some 10 opportunities with a total value of plus $100 million. Since that time, we have new leadership team, we rebranded, weâ\u0080\u0099ve moved our Houston office, weâ\u0080\u0099ve expanded our capacities and our capabilities with field construction and field services in West Texas as Roger and Darren both mentioned. To realize the benefit of these investments, weâ\u0080\u0099ve had to modify or sign many new MSAs providing for the new service offerings that we now have. While client acceptance has been a bit slower with these new services, weâ\u0080\u0099ve started executing these for our current and new clients. Additionally, we acquired new GTL technology as Roger mentioned. We are now very well positioned to take advantage of the increased workload we expect in West Texas and other basins, as well as our renewable business and other business units. Weâ\u0080\u0099re on the up upswing, and we have increased our revenue each quarter over the last four quarters. With the increase in revenue comes increase in utilization of our people, which helps our gross margins. And while holding our fixed cost steady, points to profitability in the near future. Q4 â\u0080\u0093 the start for Q4 will help the Q4 revenue, and it will also give us a much better start to the New Year relative to where do we started this year. Looking forward into 2023, we should see activity in our Oil and Gas segment increase significantly. The continual improvement of the industry outlook for both traditional oil and gas and green energy should continue for the foreseeable future, which will be a significant tailwind for us. We have a long list of opportunities in each of our business units, Roger just touched on many of them. And we expect to close on many of these in the coming months, which will continue to increase our bookings, our backlog and our revenue. The third quarter of 2022 revenues grew quite nicely quarter-over-quarter, but the gross profit declined approximately 50%. And like I mentioned in the script earlier, our gross margin or our gross profit is driven by the composition of the segment revenue and the utilization of our people. And with the Q4 â\u0080\u0093 Q3, we had some projects that had low gross margins in our OGP segment in Q3 compared to Q2. Darren, you mentioned and Mark reiterated expectation for meaningful booking growth even in fourth quarter 2022. So some of it is from the expansion in the Permian, both in the field services and the construction services, but thereâ\u0080\u0099s also increased bookings from our current business. The Henderson facility, we start with, call it the old one, is not optimally set up for doing modules. So the strategy forward is for Henderson, the existing older facility will do the smaller pipe racks mix and max and our Brookshire facility the new one will do the modules, for example, including GTL. New technology and new application all have challenges, which we are up to. So what we are doing, as Mark mentioned is weâ\u0080\u0099re finalizing the design. We had a big workshop last week and we are going to wrap up that to put a concrete plan in place for how we are going to both sell and execute this, which is well underway. And finally Roger, you mentioned that the North Dakota renewable gas-to-liquids projectâ\u0080\u0099s been delayed into 2023. And I think the summaries is â\u0080\u0093 the financing is more complicated than the operator expected, I think is a fair statement. In addition to that, Jeff, you know, so we have a finalized design for what we call inside battery limit for a 6,500 battery unit based on how the top of technology. What we have is another four or five opportunities where we are going to pursue, we are pursuing the same strategy as for the North Dakota plan. I mean, we are hope hopeful is some of these will be signed this year. We have â\u0080\u0093 I think, back to Mark's comment earlier, I think we redid the strategy and we sticking to that and it starts to pay off. I mean, that indicates a huge market, but it looks to us that the Middle East and with our porter also in the Middle East we are very hopeful that quite a few opportunities both this year and next year, if that answered your question. If I add to that, what we really have geared up is to â\u0080\u0093 in practice called follow the money. So, we are really focusing on the operators that we truly believe with all our knowledge have the money to either award is to us or unfortunately at times to others, but we don't want to get hanging that, that things drags on them, don't come to them. So with the help of the CRM, and we upgraded that also this year, 32 years on the line, I would say we have a solid back, not backlog, but the solid backlog prospects, which is really real for us or for somebody else for a long time, if that makes sense. So a 6,500 per pound is somewhere around 500 million. And the ENG scope then is focused on the inside battery limits, which means project management, the engineering, procurement, and fabrication modules. So if you take those $500 million, ENG scope is approximately $150 million over an 18, 20 miles period. Thank you, ladies and gentlemen, this does conclude today's conference call."
}