{
    "symbol": "SKM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 12:45:54",
    "content": " And now, we will begin the conference of the Fiscal Year 2022 Second Quarter Earnings Results by SK Telecom. Now, we shall commence the presentation on the fiscal year 2022 second quarter earnings results by SK Telecom. We are providing consecutive interpretation for the call, which will consist of a presentation on Q2 earnings highlights, future business plans, and strategic directions, as well as a Q&A session. The call is attended by our executives from relevant business divisions including Jin-won Kim, CFO and Head of Corporate Planning Team, of SK Telecom. The partnership is significant as it marks the beginning of hyper collaboration between SK ICT family companies and Hana Financial Group in a wide range of areas, including ICT and finance under the framework of SKT 2.0. We will pursue strategic cooperation with Hana Financial Group in six areas , including digital transformation of finance and development of new business models utilizing telecom and finance data. Operating income posted KRW 459.6 billion, up 16.1% year-over-year, primarily driven by the end of the accounting recognition of marketing expenses incurred at the beginning of 5G roll-out. Net income came in at KRW 258.1 billion, posting a 67.6% decline year-over-year, mainly due to the base effect of excluding equity method gains from SK Hynix, but it grew by 17.2% Q-on-Q. Having reported on the financial highlights of second quarter of 2022, let me now move on to major business achievements and strategic directions. As 5G became the major network in the industry with 5G penetration rate reaching 50%, we made a preemptive move of introducing five new 5G price plans on August 5 to offer more choices to customers. As more customers can enjoy 5G services with the new price plans, we believe that we can reach our goal of 13 million 5G subscribers by the end of the year. Going forward, we expect content sales to recover as the pay tv subscriber base continues to expand and new movies are being released with the easing of COVID-19 related restrictions. Utilization rate growth is on track for the new Data Centers that opened in Gasan and Siksa in July last year, which is expected to bring about sustained revenue growth. As for our Cloud business, we focus on MSP services that offer specialized solutions, primarily based on our network competitiveness and capabilities on MEC, AI, and Big Data. The strategic partnership with Hana Financial Group is expected to accelerate mutual cooperation in areas, including digital transformation of finance. In addition to the media and daily information services already available, A.tv and A.game were recently launched with many more useful services to be released going forward. In the second half of this year, new functions such as sharing and gifting will also be added as part of our efforts to expand the subscription product lineup and customer convenience. By enhancing usage value of customers going forward, T Universe will reinforce its position as a subscription commerce platform focused on four pillars of action, namely product diversification, customer experience innovation, marketing based on AI and DT, and business model expansion. We are also working for gradual expansion into the global market in the second half of the year through close cooperation with leading telecom companies in major regions, including Europe, North America, the Middle East, and Asia. Please go ahead with your question. Before I address your questions, I'd like to remind you that we have executives from the relevant business divisions, including subscription, Metaverse, MNO and integrated marketing. Regarding the new 5G price plans on August 5, we launched five new 5G price plans that include two on-tech plans. Whenever we have new network rollout as the number of subscribers increase, it is very natural that we offer more diverse price plans. As I mentioned in the beginning of my presentation, the 5G market is becoming more mature with 5G subscribers taking up more than 50% of the total handset subscribers. And as a result, we introduced diverse price plans, including low, medium, and high-end price plans and online only plans in order to offer more choices for our customers. Now, I would like to hand over to Mr.  , Head of Integrated Marketing Strategy Office, who will discuss the details and expected benefits. First of all, as for the regular 5G plans, we have 49 price plan that offers 8 gigabytes of data and 59 price plan that offers 24 gigabytes of data and 99 price plan that offers daily essential service benefits and unlimited data. With these new 5G price plans, we expect that now customers can enjoy more diverse and economic plan choices in terms of price data and benefits. As a consequence, some customers may downgrade their price plans to pending on their data usage and other customers may upgrade their price plans depending on the increased trend of data usage. But as for their impact on our revenue trends because all five price plans were launched all at once, we believe that we can share with you more details after we get more data from actual customer feedback and usage patterns. Now, moving on to the second question regarding our marketing expenses in the overall landscape. For the second quarter, marketing expenses grew slightly quarter-over-quarter, due to the increase in ad expenses, but as we previously communicated with respect to the MNO market operation, the MNO related marketing fees has been declining since the third quarter of last year. Moving on to the second half of this year, we will continue to maintain the trend of market stabilization and cost reduction. And as for the second half of this year, we will continue the trend of market stabilization and cost reduction and we will reinforce the downward trend of marketing expenses through efficient market operation focused on profitability. Recently, SK Telecom has been focusing on strengthening the competitiveness of our products and services that cater to our customers' needs. Please go ahead with your question. So, regarding the first question in June, SK Telecom communicated with the market, specific monetization models for Ifland. Regarding your first question about Ifland, I'd like to hand over to Mr. Yang Maeng-seok, Head of Metaverse Company for answers. In some B2B areas, we have been generating income by holding corporate events and creating avatars and spaces Going forward, we are going to plan for monetization through various functions, including the function of sponsoring creators that host meetings, a function of trading avatars and space creations and in-service advertising. One example, in the third quarter of this year, we're going to offer points to sponsors and participation as bonuses and these points can later be used for a Ifland services. Now, I would like to discuss the background behind establishing a strategic partnership with Hana Financial Group and our future plans. SK Telecom has been collaborating with HANA Financial Group in many areas, starting with the Hana Card joint venture in 2010 and including various partnership cards and business developments or business models, we were able to produce good results. Against this background, there was a common recognition between SK Telecom and Hana Financial Group for a need to form a new partnership. In that sense, this strategic partnership is very meaningful that it goes beyond the scope of cooperating just for credit card business, but rather to create a framework that allows us to cooperate in a wide range of areas that enables comprehensive cooperation between SK ICT family companies and HANA Financial Group. And secondly, we can develop new business models by combining telecom and finance data. In addition, we can integrate products and services   for customers of SK Telecom and Hana Financial Group and utilize the infrastructure jointly and we can conduct joint marketing based on digital technology and we can also pursue corporation for ESG management. On our part, SK Telecom will actively utilize this strategic partnership with Hana Financial Group so that we can strengthen the growth momentum of the five business groups that we have defined earlier this year. Please go ahead with your question. I would like to ask two questions. And this is what we consider the minimum guaranteed dividend that we expect from SK Telecom, but as we see this upside potential for your earnings and also if you take into account the dividend income coming from Hana Financial Group, I believe that there is an upside potential for dividend payout. The first question regarding the T Universe will be addressed by  , Head of Subscription Service Marketing Office. As you can see, the user base growth of T Universe is the highest among all the non-telecom services that SK Telecom has launched so far. And in the second half of this year, we plan to add more convenient features such as sharing and gifting, which are expected to bring about more significant growth in the future by creating more value for customers. And moving on to the size of business, the subscription business has been producing meaningful results since its launch with the GMV surpassing KRW 260 billion in the first half of the year. Now, I'd like to comment about the question regarding using dividend gains from Hana Financial Group as part of SK Telecom's dividend payout. So given that as a reference point, we can expect about KRW 20 billion of dividend gains from Hana Financial Group. Of course, with the increase in dividend income coming from Hana Financial Group, it's going to be helpful for our cash flow generation and this means that we will be capable of increasing shareholder return, but as for direct impact on our shareholder dividend payout, I cannot give you any detail at this point in time, but I hope that you will consider this as a very important means to enhance and maximize shareholder value. And going forward, we're going to consider the market situations in our financial structure before we finally decide on the annual dividend size. Please go ahead with your question. I would like to ask two questions. In the first half of this year, your CapEx size was KRW 850 billion, I wonder if it's going to be similar in the second half of the year on a year-over-year basis and you're engaged in building joint 5G networks together with the other telecom companies to increase the 5G coverage and I understand that this will continue until the end of the first half of 2024, so up to that point, what is going to be your CapEx trend for next year and the year after? And as for the second question, it is about your pay tv business, I can see that there has been a slowdown in the net adds of pay tv subscribers and your IPTV subscriber growth rate been on high single digit on a year-over-year basis. Regarding your question about pay tv business, I'd like to hand over to Mr. , CFO of SK Broadband and then I will cover your question regarding CapEx. In particular, the IPTV market has seen such subscriber growth of more than 1 million each year for the past five years and the IPTV market accounts for more than 60% of the total pay tv market. And as for SK Telecom, in the first half of this year, we have added more than 190,000 people to our IPTV subscriber base and we have maintained number one in terms of net add market share. And for our CapEx plan, as we communicated at the annual earnings conference call, as well as for the first quarter conference call, we are planning to maintain CapEx level to be similar to that of last year through efficient management. And at the same time, we're going to invest in growth businesses and through efficient execution and management will be able to stabilize the CapEx trend in the medium-term."
}