{
    "symbol": "VCEL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 12:51:02",
    "content": " The company delivered another solid quarter from a financial and operational perspective as we generated strong Macy revenue growth, record third quarter total revenue, continued profitability and operating cash flow, and made meaningful regulatory progress with respect to NexoBrid and our MACI lifecycle initiatives, which we believe will position the company for further growth in the years ahead. MACI's 30% growth also was the highest year-over-year quarterly growth since 2019, excluding the comparison to the second quarter of 2020, which was impacted by the widespread shutdowns due to COVID-19. While MACI continues to significantly outperform the overall market and the biopsy conversion rate is stabilized, we've not seen a sustained improvement towards pre-COVID levels so far this year, which will impact full year revenue for MACI, as Joe will cover in our guidance update. Despite these market dynamics, MACI remains on track for a strong finish to the year as it resumes its high growth profile and we expect MACI growth in the mid-20% range for the second half of the year compared to 2021. Moving forward, we believe that continued execution by our MACI sales team in the gradual improvement of the overall cartilage repair market and MACI conversion rate will support further growth and expanded utilization of MACI in the quarters and years ahead. It's worth noting however, that while the incidents of larger burns and patient volumes are more in line with pre-2021 levels, year-to-date revenue for Epicel in all of the underlying business fundamentals, including burn centers taking biopsies and treating patients, as well as overall biopsies and graph volumes are significantly higher than the same year-to-date periods prior to 2021. Based on this market dynamic and Epicel revenue performance over the past 2 quarters, we now expect Epicel revenue in the $8 million range for the fourth quarter, and total burn care revenue, including NexoBrid for the full year of approximately $34 million. We still anticipate strong MACI's second half growth in the mid-20% range versus the second half of 2021, with full year revenue from MACI of approximately $130 million to $132 million. So at this point, we expect kind of a range of $130 million to $132 million, which is just outside of our initial range of $132 million to $141 million -- and I think importantly, to your question, our initial range assumes some improvement in both the market and patient flow, which we have not seen happen and then a corresponding increase in conversion rates which, again, is stabilized but hasn't improved. So I think if you take a step back and kind of think about where we are, we're kind of near that initial guidance despite these challenges in the market, and our other metrics have generally kind of tracked as you talked about, our new surgeon adds we're kind of in that double-digit range, biopsies have continued, but that conversion rate, particularly in Q4 which is our largest quarter as you kind of see the year play out, will have an impact on the second half of the year."
}