{
    "symbol": "VCEL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 17:31:09",
    "content": " In terms of MACI quarterly trends and the seasonality of our revenue, we expect approximately 20% of MACI's full year revenue in the second quarter, which would imply sequential growth from Q1 to Q2 this year and continued year-over-year growth despite a more difficult comparison versus Q2 2021 as our volumes increased significantly last year in Q2 coming out of the winter COVID-related surge. So, what we're seeing and really at the midpoint, it is about $27 million for the second quarter, just to think a little bit about the quarters in each half of the year in MACI, which kind of plays into the guidance question. So, if you look at kind of the balance of the year, similar to what we talked about last quarter where we expect kind of the majority of the MACI revenue in the second half, you will certainly see an acceleration on a kind of year-over-year basis. I think it actually is helpful even though it's a couple of years back, if you look at really the H1 growth in our guidance versus H2 over 2019, which really still remains kind of the cleanest comp without all the noise from kind of COVID quarter-to-quarter or half by half. Just taking a step back at a higher level on Epicel, as you mentioned, there's about 140 accredited burn centers in the U.S. And as we've kind of consistently talked about in any particular kind of 2- or 3-year period, we may be getting biopsies or graftings from probably half of those centers, 70 or 80, and that's because not all centers are the same and really critical patients are often at those centers. We had a very strong year last year, right, where we kind of had a new level of performance, which continued into the first quarter and very much aligned with the commentary Joe gave on the last call that we would expect kind of similar run rates in the first couple of quarters and then a step-up as the growth driver sort of continue to take hold. We think that's kind of stepped up to sort of where we would expect it to continue in that going forward into this year, the growth drivers are really going to be around sort of increasing the number of centers, which we've seen in the first quarter and then increasing the number of biopsies, which again, will give you deeper penetration into those centers."
}