{
    "symbol": "VCEL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 14:57:04",
    "content": " Macy's also off to a strong start in the third quarter, and as Joe will discuss in further detail, we expect to see an inflection in MACI performance in the second half of the year with continued strong quarterly revenue progression and significantly higher quarterly growth rates compared to the same periods in 2021. We have seen solid underlying fundamentals for Epicel in the first half of the year, as the number of burn centers taking biopsies and treating patients with Epicel was consistent with the significantly higher burn center penetration seen in the same period last year, which included the highest Epicel volume and revenue quarter ever in Q2 2021. In summary, after a solid start to the year, we're maintaining our total revenue, MACI revenue and adjusted EBITDA guidance for the full year as the entire Vericel team is focused on delivering continued strong commercial and financial results in the second half of the year, while preparing for a potential NexoBrid launch in the first half of 2023. After two strong quarters of performance to start the year and momentum accelerating into Q3, MACI is well positioned to return to its high growth profile, and we are maintaining our full-year MACI revenue guidance of $132 million to $141 million. A few questions around that though, I mean, if I think about kind of the pacing dynamics that we saw in the first half of this year on Epicel, it implies, obviously, around $9 million for the third quarter. I think on Epicel, to your point, I think we're not â\u0080\u0093 I think what we're thinking now is kind of given the start of the year, it's more likely Epicel will be kind of flattish to last year or in the low $40 million versus our original guidance. So I would say, when we think about kind of, I would say, the first half of the year on MACI, the results to date and really even in the back half, I'd say, this is certainly something we're still focused on in terms of that backlog from a kind of commercial perspective, et cetera."
}