{
    "symbol": "VCEL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 14:55:17",
    "content": " The company delivered strong financial and business results to close the year as we generated record quarterly revenue, delivered our 10th straight quarter of profitability and positive operating cash flow and achieved significant development milestones including an accelerated regulatory pathway for the arthroscopic MACI program, an FDA approval of NexoBrid, which we believe will enable the company to build a second high growth commercial franchise. For the full year, total revenue was more than $164 million, with MACI revenue growing 18% to $132 million, we continued to deliver strong profitability and cash flow as we generated nearly $25 million of adjusted EBITDA and $18 million of operating cash flow ending the year with $140 million in cash in investments and no debt. We also generated record total revenue of nearly $53 million in the fourth quarter, as well as gross margin of 73% and adjusted EBITDA margin of nearly 30%, both of which increased versus the prior year and approximately $6 million in net income for the quarter, which increased more than 30% compared to 2021. Our strong fourth quarter results were driven by record quarterly MACI revenue of over $46 million, which came in at the high end of our guidance range, represented 24% growth over the fourth quarter of 2021 and approximately 50% sequential growth over the third quarter of 2022. With respect to the burn care franchise, we expect total burn care revenue of $28 million to $32 million with growth versus our fourth quarter annualized run rate for Epicel of $24 million, driven primarily by the launch of NexoBrid. Total net revenue for the full year was $164.4 million, driven by strong MACI results in the fourth quarter. For Q4, MACI revenue was $46.3 million and grew 24% versus the prior year and approximately 50% versus the third quarter. Moving down the P&L, we expect an improvement in gross margin compared to 2022 with gross margin expected to be in the high 60% range, adjusted EBITDA in the mid-teens percentage range and full year operating expenses to be approximately $140 million."
}