{
    "symbol": "UPWK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 20:50:31",
    "content": " So, we think that the opportunity is both there and it’s now in this critical time around the war for talent and we are seeing the results in terms of the numbers starting to peak through, although it is definitely early days and we know that some of these investments around brands, for example, will take multiple quarters to fully see and measure the ROI around. I think the fact that our fill rates didn’t move down at all even though a substantial portion of talent – all of the comps from Russian, Belarus became essentially invisible after we made the shift earlier in the quarter, I think that really speaks to the fact that talent from all over the world are very active in that category, all over Europe, Asia, U.S., etcetera. I think these are just – these aren’t metrics we’ve necessarily been forecasting even internally are driving towards but rather represent outputs, we’re really happy to see to validate our overall hypothesis of why a single Work Marketplace where customers can come and get work done in a variety of ways through Project Catalogs, through Talent Scout, through our Talent Marketplace, graduating up to our enterprise offerings. What we’re really seeing with those metrics is customers find that success, in this case, through one of the newer products that we’ve launched, a new entry point for them and then continuing to be very successful in both repeat usage, adoption of other ways of working, etcetera, which we believe when we launched the strategy 12, 18-plus months ago, we believe that this would drive that type of unlock for customers. The talent war that companies are really struggling with in terms of running into dead ends with their existing legacy ways of sourcing talent, operating with talent, their full-time employee model, staffing models, etcetera, those are just run one of the themes for so many of our customers, and they are waking up to the fact that both to find the workers they need today and to modernize their capabilities to really keep up with where the industry is, they need a switching like ours in their toolkit. The dynamic that we have had that’s been driving the take rate decline over the last, I don’t know, five-ish quarters or so has really been the very positive signal of clients spending more with the existing freelancers that they are working with, that appears in our client spend per active clients metric and as a result of the age into the lower price points on the – on our pricing tier."
}