{
    "symbol": "UPWK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 20:15:06",
    "content": " With this launch, we are bringing to bear more than 20 years of worker classification expertise as well as existing and new technology solutions to enable our customers not only to form the trusted long-term working relationships that Upwork is known for, but to do so via a complete set of full-time hiring solutions now available to all our customers, enterprise clients and marketplace clients alike. And then overall, our sales and marketing activity at this moment is really laser-focused on spreading the message around Upwork's benefit and value proposition at a time when our cost savings options, the agility that we offer customers, those aspects are so resonant in the landscape. In terms of the full-time offering, I'd say this is definitely just the next step in us delivering on the vision we shared a couple of years ago around really becoming the world's work marketplace and giving clients all of the ways that they want to hire and talent all of the ways that they want to work. The other channels actually performed really well, but that one was softer than we would have seen, largely due to issues around just what was available to us in that environment, and we've been moving to really realign some aspects of our performance marketing strategy, knowing what we know now that we didn't know at the back half of last year. And so what's, I think, exciting about that is we are able to bring down our brand marketing investment on the media side by 12%, in line with achieving our profitability goals and other objectives we have in the business, while also continuing to execute around that broader awareness strategy, which is about bringing a bigger umbrella to all of our sales and marketing efforts to make them all more efficient and productive over time. So what we're seeing in terms of the -- kind of what's baked into the guidance around macro is, basically, what we can see today from all of the trends that happened in the back half of last year, which you'll recall, in the middle of last year, we anticipated that we would see that $10 million to $15 million negative impact in the back half of last year, and that is very much what we saw. The third opportunity that I am excited about is the ways that companies that are integrating new AI tools and applications into their services, whether it's integrating them into their websites or offering for customers, again, they need talent to do this integration work and to do some of the work around customizing, tailoring and deploying these solutions as they're being adopted at scale in the market. So I think that's where we're doing a lot with our product solution, things like full-time hiring, things that we can put in terms of customers to get them reexcited about Upwork, things they might have forgotten or not known that we can offer them."
}