{
    "symbol": "UPWK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 21:37:08",
    "content": " Upwork is the leading digital platform that clients trust to deliver the talent they need, with the exact skills to get work done, and is the home that talent trust to champion them in innovating their careers, while bringing them exceptional work opportunities, there is vast potential to unlock on both sides of the world's work marketplace. Your line is open. What we've seen so far, Matt, is strong execution by the team continues, and I think against the backdrop of conversations which story, there's been an uptick of focus in Q1 and Q2 from customers around things like cost savings, maybe they themselves are doing layoffs or shrinking their budgets, but they're looking to us as an alternative for getting talent really cost effectively. Your line is open. Your line is open. Your line is open. We have such a strong talent base as it is and we've seen continued growth in that through the last years and quarters and certainly there's been a mindset shift, I think where in prior recessions going back to 2008, perhaps people might have seen freelancing as a risky place to be during an economic downturn. Your line is open. Your line is open. The third thing I'd say about this is we're really finding already that the value proposition that we have, does really resonate, given the broader secular trends around remote work, and digital transformation, as well as Upwork's specific benefits around cost savings and workforce flexibility, which are so top of mind for executives in these very moment. But I think the other big impact, and perhaps even bigger impact for us is things like these major secular trends around remote work around digital transformation around access to critical talent and skills, which are evergreen topics for executives that have become huge and impactful for almost every business and certainly huge for our business and core to our value proposition at this time. Your line is open. Your line is open. Your line is open. Your line is open."
}