{
    "symbol": "BCE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 13:14:07",
    "content": " Although Omicron undoubtedly is causing some near-term disruption, notably for Bell Business Markets and media advertising, we achieved robust total revenue and adjusted EBITDA growth of 2.5% and 6.4%, respectively, in Q1. This, together with our Canadian leading CTV AVOD app continued rapid scaling of the SAM TV advertising sales tool where year-to-date bookings are already 45% ahead of full year 2021 levels and our recently launched Noovo.info digital platform contributed to exceptional digital revenue growth of 84% this quarter. And if you look specifically at our fiber-to-the-home footprint, we delivered an even stronger result with 38,049 new customer additions and that once again drove strong residential Internet revenue growth sitting at around 8% in Q1. We also added 12,260 net new IPTV subscribers, that's up 14.6% versus Q1 last year and that's on the back of our customer segmentation approach and lower customer churn. Adjusted EBITDA was a highlight, growing 6.4% on year-over-year increases across all operating segments despite some COVID related headwinds at Bell business markets which affected data product sales in the quarter. Similarly, adjusted EPS was up 14.1% year-over-year to $0.89, reflecting a high EBITDA contribution from operations and lower year-over-year pension financing costs reflecting the strong net surplus position of our post-employment benefit plans, I never get tired of saying that surplus position. Finally, wireless EBITDA also accelerated significantly growing 9.3% on the high flow-through of strong service revenue growth and our disciplined and targeted responses to competitors' promotional offers which drove a 1.7 point year-over-year increase in margin to 45.7%. Despite lower year-over-year revenue, wireline EBITDA growth was positive, increasing 0.3%, reflecting a 4.2% reduction in operating costs which also supported margin expansion of 1.2 percentage points to 45.4%. Another quarter of industry-leading financial performance in Q1 as growth across all Bell Media platforms including digital which increased as Mirko said, an outstanding 84% year-over-year and that all drove a 15.7% increase in total revenue. Subscriber revenue was 22% higher versus last year, reflecting continued strong Crave streaming growth and the aforementioned onetime retroactive revenue adjustment. And therefore, that kind of speaks to -- there's  there in fiber footprint that we need to migrate from some type of copper service might be home phone to fiber and then on the copper decommissioning journey that I introduced or hinted at it to last quarter and that we're really looking at very closely this year in terms of a planning year so that we can kind of attack copper decommissioning at scale, I guess, for a better word -- for lack of a better word, in 2023 and beyond."
}