{
    "symbol": "BCE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 10:36:05",
    "content": " Since 2020, we have accelerated CapEx, investing more than $14 billion, the highest ever over a 3-year period by Canadian Communications company and we are doing it to forge ahead aggressively on constructing the broadest fiber footprint in North America, opening up Wireless Home Internet to 1 million rural homes in rural communities and building our mobile 5G networks faster. Despite a challenging macroeconomic backdrop for advertising, our Media segment performed better than expected driven by continued strong digital revenue growth, which is up 54% in 2022 and now comprises 29% of total Bell Media revenue compared to 20% in 2021. Notably, 70% of consumer fiber activations in Q4 were on gigabit or higher speeds, bringing our base of gigabit or higher customers to approximately $1 million or 43% of total fiber subscribers at the end of 2022. I am quite pleased that we delivered positive EBITDA growth this quarter even while absorbing $26 million in incremental storm recovery and inflationary cost pressures, higher media programming costs and a very expensive and highly competitive Black Friday period. Total revenue up 7.7%, fueled by robust postpaid subscriber growth and a higher proportion of customers on higher-value 5G unlimited plans, strong demand for Bell IoT services, continued roaming improvement and higher year-over-year mobile phone sales transactions that drove an 11.7% increase in product revenue. Despite soft overall TV and radio advertiser demand, total advertising revenue was still up 3.8%, and this was driven by record sales for the 2022 FIFA World Cup and continued strong out-of-home and digital growth. Slide 19, despite positive EBITDA growth and lower pension financing costs, we project adjusted EPS to be between 1.10 â\u0080\u0093 excuse me, 3.10 and 3.25 per share for calendar â\u0080\u009823 or 3% to 7% lower compared to â\u0080\u009822. Similar to last yearâ\u0080\u0099s growth range and reflects the strong flow-through of our higher EBITDA, lower year-over-year pension funding and an approximate $300 million decrease in CapEx that will drive a lower capital intensity ratio of 19% to 20%."
}