{
    "symbol": "BCE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:07:02",
    "content": " With approximately 900,000 more new FTTP connections deployed this year, 80% of our midterm broadband Internet build-out plan comprising 10 million residential and business locations will be completed and 5G LTE network service will be available to more than 80% of Canadians. In wireless, our focus on high-value mobile phone loadings and customer base management continue to pay off with another set of excellent operating results this past quarter highlighted by a more than twofold increase in total mobile phone net adds to approximately 111,000 record postpaid churn and continued strong service revenue, ARPU and EBITDA growth. In residential Wireline, we added 36,473 new net retail fiber customers this quarter, an increase of 19.5% versus last year which contributed to strong residential Internet revenue growth of 8%. And this was driven by a number of factors, so greater retail store traffic, 5G momentum, improved business customer demand, immigration growth, more focus on bundling wireless with residential Internet and outstanding customer base management, as you can see by our best ever quarterly churn rate of 0.75% in the quarter. We also added around 4,000 net new IPTV subscribers which is essentially stable versus last year despite the level of promotional offer intensity returning closer to prepandemic levels, while satellite TV and home phone net customer losses both increased compared to Q2 of last year when we experienced fewer customer deactivations due, of course, to COVID. On the B2B front, although near-term revenue headwinds continued this quarter from the sale of Createch in March and ongoing global data equipment shortages that drove a 23.2% decline in total wireline product sales as well as related delays in spending on service solutions by large enterprise customers, we saw some moderation in the rate of year-over-year revenue declines. Advertising revenue grew 4.7%, reflecting year-over-year increases across our specialty TV sports and news services as well as strong radio and out-of-home advertising demand as COVID recovery continues."
}