{
    "symbol": "BCE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 12:16:03",
    "content": " By the end of the year, 80% of our mid-term broadband Internet build out plan comprising 10 million residential and business locations will be completed and 5G plus service will be available to 60% of the addressable population, offering the best data speeds and lowest latency of any Canadian network provider. This drove strong revenue growth of 7.4% and 7.8% higher adjusted EBITDA, demonstrating that our consistent focus on higher value mobile phone loadings, customer base management and acquisition cost discipline continues to pay off. We added 95,036 new net fiber customers in Q3, that's up 33% over last year and our best ever result, driving strong residential internet revenue growth of 8%. Growing customer usage of Bell Media that SAM TV advertising sales tool platform, which more than doubled bookings in Q3, together with a 29% increase in crave direct-to-consumer subscriptions, contributed to strong 40% growth in digital revenues this quarter. Continued 5G momentum, immigration growth, strong business customer demand, increased focus on bundling wireless with residential internet service, as well as our lowest ever Q3 churn rate, which improved 3 basis points over last year . CTV remained Canada's most watched conventional network in Q3, expanding its lead with a 29% increase in audience market share while Bell Media's English language entertainment specialty channels also had a strong showing, finishing the broadcast year with 5 of the top 10 properties, including the top 3 spots for CTV Comedy, CTV Drama and Discovery. Service revenue was up 7% driven by our focus on high value 5G subscriber growth, strong year-over-year mobile connected device growth and continued recovery enrolling with the Q3 amount at approximately 114% of pre-COVID 2019 levels. Advertising revenue was down 2.3%, reflecting softer TV advertiser demand and a slow radio recovery from COVID due to ongoing macroeconomic uncertainty, as well as the nonrecurrence of approximately $15 million in related revenue generated last year from the federal election, Euro Cup soccer and the Tokyo Summer Olympics. And lastly, I'll finish on Slide 11 with $3.5 billion of available liquidity and a manageable debt leverage ratio of 3.2x adjusted EBITDA, a historically low after-tax cost of debt of just 2.8% with an average term to maturity of 14 years and a capital structure that has a substantially high portion of fixed rate debt, BCE's balance sheet is very healthy, helping them mitigate the impact of rising in interest rates. Moreover, with a substantial pension solvency surplus totaling $3 billion that has low sensitivity to interest rate movements, approximately $1 billion in U.S. dollar spending that has been economically hedged well into 2024 and a relatively low cyclical cycle for our majority of our revenues, BCE's free cash flow generation is strong, reliable and well protected from market uncertainty."
}