{
    "symbol": "RRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 14:11:13",
    "content": " As Appalachian shale production grew from virtually nothing just 15 years ago to now producing over 1/3 of the nation's natural gas supplies, it allowed the U.S. to lead the world in lowering CO2 emissions primarily from the substitution of natural gas for coal and power generation as natural gas has a 60% lower carbon footprint than coal. Operationally, Range successfully delivered on our second quarter development plans with production coming in slightly better than expected in first half 2022 capital spending of $244 million or approximately 52% of the full year budget, putting us on track within our full year guidance. Range's natural gas liquids production also received a premium to the Mont Belvieu equivalent price, coming in at over $42 per barrel or greater than $7 per Mcfe. This past quarter, a 4-well pad in Range's dry gas acreage area completed with an overall pad efficiency of 11.3 stages per day, which is a 5% increase over the previous mark that was set just last quarter. Combined with Range's diversified LPG marketing strategy, this drove Range's NGL price for the quarter to $42.63 per barrel, which is a premium relative to Mont Belvieu and Range's highest quarterly NGL realization in 10 years. And Range's greenhouse gas emissions equated to approximately 0.26 CO2 equivalent per MMcf equivalent, a level within 10% of the prior year. Cash flow of $519 million was driven by better than guided production levels, achieving strong pre-hedge realized prices of $7.18 per Mcfe compared to $3.25 in the second quarter last year. I think your question as we go through our annual bid process in the fall and we start to align that with what our program looks like, we can lay out what our activity program is going to consist of, which we're clearly in the throes of evaluating but it's not out of the realm of expectation, I think, for us to consider something in the 10% to 15% impact range for 2023. But I'll also say this, as you look at our cost structure, our low base decline and you look at our class-leading D&C per foot structure that we've had over the past, not just this year but the past several years, it's really a natural hedge against inflationary effects that Range would see versus our peer groups or in other basins. Range is very much a growth in cash flow and cash flow per share and not just because we're buying back shares, it's because of the built-in reduction in gathering costs as we've laid out in the Investor Relations materials that next year reduce gathering costs by $25 million, and that ramps to well over $100 million by the end of the decade."
}