{
    "symbol": "RNG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 19:25:03",
    "content": " One, we are a $2 billion ARR company; two, contact center is now over $0.25 billion of ARR and is a key growth driver for us; three, we are now at more than 5 million paid seats in our base; fourth, we matched our quarterly record of $1 million, plus TCV deals, bringing the total to almost 500; and five, we delivered a record operating margin in the quarter of 11.3%, up 110 basis points year-over-year. These are: one, the cementing of hybrid work in the post-COVID era, which in turn reinforces the need for cloud-based communications platforms; two, the ongoing adoption of mobility by businesses worldwide, which drives the need for solutions that enable work in any mode on any device from anywhere, Mobility is a friend, not a phone; three, Teams in the enterprise, which creates a meaningful opportunity for a well-integrated enterprise-grade UCaaS and CCaaS solutions. In terms of the macro, and what we called out specifically, I think Mo in his remarks talks about the couple of trends that we saw in the quarter: one, with sales cycles reverting to pre-COVID levels; and the other one was slightly more cautious buying behavior from larger customers, and that was manifesting itself in smaller initial deal deployments. And we think that this, frankly, could be reinvigorating the relationship with very positive outcomes for both companies and very importantly for the customers, because remember, their customers still need to grow to get to the cloud, RingCentral and Avaya Cloud Office data center still continues to be the only through UCaaS mobile tenants global high-availability solution that is able to accept incoming Avaya's on-prem customers by leveraging -- with leveraging their multi-year investments into endpoints and other points of integration. At the end of the day, I mean, I think I put all those things together, the lead growth continues to demonstrate to me the opportunity ahead is real, that we can create value for our customers, frankly, and especially so larger ones that have legacy telecom hardware, IT support costs, where the value creation that we can bring for them is actually a help when you're in these sorts of times. And in terms of what the guide is currently contemplating, what I said in my prepared remarks is that it's reflective of what we're seeing in the market today, including the trends that we've called out and also embedded within that, the guidance includes an additional one point to two points of headwind on growth from a stronger dollar, and that's for the full year 2022."
}