{
    "symbol": "CBD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 09:38:04",
    "content": " This video conference is being recorded and will be available at the RI side of the company, where you will also find the material for this release. The information contained in this presentation and the forward-looking statements made during this video conference referring to the business outlook, projections and operational and financial goals for GPA are based on the beliefs and assumptions of the company management as well as on information currently available. Investors should understand that general economic conditions, market conditions and other operational factors could impact the future performance of GPA and lead to results that differ materially from those expressed in the forward-looking statements. Since the beginning of the transition year and changes in the GPA strategy, we have recorded important changes, growth in same-store sales and an accelerated expansion, two fundamental factors for our growth. In the international perimeter, the business of the Exito Group has had an evolution in the 3 countries we are present in because of the increase in store traffic and a very good performance of innovative formats besides the multichannel sales that have a very high share. In Slide #4, I begin to speak about the main evolution indicators in each of the pillars that are part of our growth strategy. Regarding the top line, we had a growth of 16.8% in total sales and 17.3% in same-store sales vis-a-vis the fourth quarter of '21. In different work fronts that are underway, we have already observed improvements in some of the important indicators of the fourth quarter. Among them, the evolution of the refurbishment of the Pao de Acucar stores based on the generation 7. A reduction of our breakage in 1.3 percentage points vis-a-vis the fourth quarter of last year and an increase of 2.79 percentage points in the share of perishables in the total sales, reaching 4.2 percentage points for the Pao de Acucar banner compared to the fourth quarter of 2021. Perishables record 48% of the sales share, which is fundamental as part of our strategy and the renovation of our business. We continue working with a refresh project that looks upon the value proposal of perishables since the flow of merchandise, their exposure, assortment and the availability and quality of the product. Our goal is to increase the share of the category, reaching a share of 53% at the beginning of next year. In the first quarter of '23, we're going to move forward in the rollout and revision in the clustering of stores, pricing, management of stock and categories we began in mid-2022. This will unharness more benefits for the operation, and it allows us to think we will have an acceleration of same-store sales, reduction of losses and, of course, an improvement in customer experience. Our second pillar is what guide us regarding the expansion of the level of satisfaction of our customers, the NPS. In the digital parameter, we have a strategy to speed up our e-commerce, and we recorded a growth of 15% year-on-year compared to 2021, with significant improvements in the service levels that are being presented. We are retail food leaders with BRL1.7 billion for the year, 50% of which is carried out based on our own e-commerce IP. Now this result has been given thrust to -- based on the strategy based on 3 points: an increase in assortments, especially perishables, the expansion of availability of delivery schedules and the expansion of speedy delivery. Nowadays, 70% of our sales are delivered on the same day. We have accelerated the express delivery in 30 minutes in the proximity stores, expanding our partnership with Magalu, iFood shopping, and we have increased by more than 270,000 active users or app, reaching a total of 1.2 million active users per month. In the next slide, I would like to state that we're maintaining our expansion plan, opening 29 new stores between Pao de Acucar and proximity stores. During the year, we have reached the opening of 72 new stores. Regarding the refurbishment, we are at 60% of our store park that have been revitalized based on the Generation 7 model, and we have an increase in sales in those units. For 2023, we're going to inaugurate 103 new units aligned with our new expansion plan. And until 2024, we will have 309 new stores, 250 will be proximity stores with a focus on Minuto Pao de Acucar because of its maturity and the greater potential it has for capital clarity. This year, we will close down 100% of the -- we will refurbish all of the Pao de Acucar stores. Regarding profitability, Guillaume will explain the details to you. Therefore, I will not refer to this, but I would like to reinforce that we continue on with our work to recover profitability, working along 3 main lines: an improvement of our commercial lines, a reduction of breakage and a decrease of expenses. I would like to end my presentation on Slide 6, highlighting the pillars of ESG and culture regarding our goals of consumption of energy. When it comes to fostering diversity and inclusion, I have to highlight the work that has been done to focus on female leadership in the company. When it comes to social impact, we work sadly in terms of donating food led by the GPA Institute working along with all of our stores, we have offered more than 4.2 million supplementary meals, working with partners, social entities benefiting thousands of companies. With this, I would like to end my presentation and give the floor to Guillaume, who will speak about our financial highlights. I would like to highlight that as of Q4 2022, the Exito operations were considered discontinued operations, raised the IFRS 701 -- now in the accounting statements we can no longer see the breakout between the P&L lines of Grupo Exito. Starting by Slide 8, here, you can see the total sales of GPA Brazil -- new GPA Brazil. Excluding taxes, the sales was BRL4.9 billion, resulting in an increase of 16.8%, driven by the hypermarket converted stores and by the consistency of customers in our stores in the past quarters. A highlight once again, the proximity format with a double-digit growth of 17.3%, explained by the increase of the passage stores and more number of stores servicing the last mile partners. Now, Pao de Acucar or same-store sales totaled 6.7%. Now mainstream banners Mercado Extra and Compre Bem, the growth of same-store sales was 4.1%, an improvement vis-a-vis the growth of 2% of Q3 2022. On Slide 9, you can see the EBITDA and the adjusted EBITDA margin and new GPA Brazil. This is a reduction vis-a-vis Q4 of 2021, explained mainly by the pressure of gross margin and profit caused by the strong food inflation of 2 digits with the impact on merchandise cost, labor and also transportation to supplier stores. This effect was partially mitigated by the good performance of the SG&A, which dropped 1.8% when compared to Q4 of 2021, generating a dilution of 2.2 percentage points vis-a-vis the net income. This evolution is based on 3 main lines: commercial margin, SG&A, and in 2022 we observed the first signals of improvement in our SG&A, something observed in Q4 of 2022 breakage, which reduced 1 percentage points when it was compared to the beginning of the year. Now throughout of -- throughout 2023, we will have an important rollouts of project that will increase these gains, mainly in the commercial margin. Now the year-to-date, the adjusted EBITDA was BRL1.2 billion with a margin of 7%. With the total sales of Grupo Exito, which presented a solid sales performance in Q4 of 2022, tolling throughout the 6th consecutive semester double digits. In same-store sales, the gross sales was BRL7.8 billion. This is the same-store sales growth of  vis-a-vis Q4 of 2021 because of the depreciation of the peso, the total growth demonstrated a drop of 6.8%. In 2022, the Exito Group had a gross revenue of BRL20.3 billion. In e-commerce, the GMV was BRL709 million in Q4 with an online penetration on 9.5%. In Colombia, the growth of same-store sales growth was 12.1% because of the sound performance of cash and carry during the quarter. In Uruguay, the significant growth of fresh market stores with high share in sales, which was 52.9%. And finally, in Argentina, the growth above inflation was a result of the increase of traffic in the stores, good performance of commercial galleries and the consolidation of real estate business resulting on a same-store sales of 95%. Here, you can see the evolution of the EBITDA and adjusted EBIT of Grupo Exito, that was 8.6% in Q4 with an EBITDA of BRL599 million. This is a drop of 2 points, mainly impacted by one of the fact during the quarter with the adjustment of the balance of the stock that affected the gross margin and higher inflation level in these 3 countries. Now year-to-date, the EBITDA totaled BRL1.9 billion with an EBITDA -- adjusted EBIT of 7.8%. These exceptional elements are broken out in 3 major parts, BRL900 million regarding tax matters, BRL300 million regarding labor contingencies, and BRL200 million regarding restructuring costs. Now when we see the details of each one of these points now regarding tax matters, there are 3 points: one, BRL285 million regarding a decision of the Supreme Court that invalidated our ICMS contingents on energy and limited this credit for essential and productive areas. And the third point is tax matter that represents BRL288 million is regarding the tax reform in Colombia with an increase of the deferred income tax in Colombia, that would be 10% or 15%. In addition to these tax issues, we also had labor contingencies of BRL309 million, reflecting the highest value during the second semester. So our total label provision totaled BRL660 million, which is twice as much as last year. We would like to signalize that we reached the peak of labor contingencies in May of 2022, and there has been a constant drop of these labor contingencies since that year. Since Q3 regarding these points, we also had costs with restructures, which represent BRL227 million, and the matters regarding the closing of the hypermarkets restructuring of stores and the resizing of our headquarters and also Exito segregation projects. Now on Slide 13, you can see our financial leverage. And here, we can see that the company continues with the sound cash position of BRL3.8 billion, or BRL3.7 million. The short-term net debt, that is Indiscernible billion were refinanced by the new CRI issuance last week. Now on the left-hand chart, we can see that we totaled a net debt of BRL2 million in Q4 of 2022 with a leverage level of 2.3x the EBITDA. Now when we compare it to Q4 of 2021 pro forma Brazil, which excludes the position of Grupo Exito, here, we can see a drop of approximately BRL900 million of the net debt and 0.2 percentage points of leverage. The transaction with the supermarkets has been fully concluded and received with an anticipation of the installments of 2023 and 2024, generating a net cash in of BRL2.2 billion, which have been allocated towards a reduction of our net debt. We continue on to Slide #14, where I would like to remind you the schedule for the separation process of the Exito Group that we announced last year. In February of 2022 though, we approved in an extraordinary general assembly a capital reduction for the issuance of new shares for Exito. Beginning now, we will be waiting for the term of the legal position of creditors that ends on April 15th, and we will wait for the conclusion of the filing at SEC and CVM. Now with this, we would like to end the presentation of financial results, and we will now go on to the question-and-answer session. We would like to remind you that with us, we have Carlos Mario, the CEO from Exito; and Ivonne, the CFO from Exito. Let's go on to the first question from Filipe Casemiro, a sales side analyst from Bradesco BBI. First of all, if you could explain and give us more color on your gross margin dynamic. The second question, when we look at your reinforced base, your EBITDA is negative because of the growth of other operational lines. Thank you very much. I'm going to begin speaking about gross margin, and then we'll give the floor to Guillaume to speak about EBITDA and labor provisions. Secondly, and the consequence of this was the higher level of breakage that we expected with an impact on our commercial margins. We're working on this at this moment through commercial renegotiations, the commercial team between February and March, we'll be working on the revision of commercial contracts. We're heading towards the third level of adjustments of logistics, which should further decrease our logistic cost, making it more in accordance to our present day moment. Throughout the year 2023, this will also happen. The margin was strongly impacted in the fourth quarter, and it is our understanding that this is part of the trough. Interpreted Well, when it comes to your question on the other revenues and expenses, the operating expenses, we have 3 different elements. We have had 3 significant developments, the restructuring, refurbishing of stores and the headquarters. Thank you very much. Our next question is from Felipe Cassimiro, sell side analyst from Bradesco BBI. I would like to explore the dynamic of the online growth, which was 7% somewhat below our estimates. I would like to gain a better understanding of the dynamic because you're accelerating your service levels quarter-on-quarter, you have a higher number of partnerships. And the growth and the penetration fell short of what we expected for the fourth quarter, although we did have some highlights, for example, Black Friday, a historical improvement compared to what we had historically in the digital part in Pao de Acucar. But we do observe an upside now when it comes to enhancement, we hope to have a resumption of penetration share and growth for the year 2023. Now when it comes to that topic, we have a very positive expectation which is not based on wishful thinking, but instead on the work that we have carried out. And as you were able to observe through the figures because of that, we went from 40% in the first quarter '22 to 70% same-day deliveries. We have increased in 200 stores, the Pra ja delivery carried out in 2 hours. We have had a significant increase -- in the midyear in the third quarter, we had 890,000 customers per month. And we have made strides when it comes to click and withdraw deliveries, especially in those stores where we have the G7 model, we have an aquarium at the entrance of the store, enhancing the customer experience, a move forward in the partnerships and the expression of digital in proximity stores, especially from express delivery in up to 30 minutes, and we have also expanded our leadership position among our partners. We're moving forward quickly, enhancing our partnerships, and we have begun working recently with Magazine Luiza. And of course, during the rest of the year, leading us to 15% of penetration and up to 20% of penetration at the end of next year. Two, I want to understand how you see the discount side because it continues driving your bottom line. Danniela, I am going to respond sales discount and Guillaume will answer the other point. Well, sales discount, this is a constant matter of discussion amongst us and Casino. And now with Grupo Exito, we believe that we're on the right path and that we will find the solution to unlock the value, including here sales discount. We have nothing solid that I can disclose right now, but there is no doubt this is something that we're constantly talking about, and we do see an opportunity to unlock this value. Regarding drops, I shared this during the last call. #1, it would be the dividend proposal that was carried out by Exito that will generate a cash-in of approximately BRL230 million. #2, well, these are operating initiatives to improve the generation of our operating cash flow that come from the improvement of the EBITDA margin, the reduction of inventory from 2, 3, 5 days, also monetization of fiscal credits. We have BRL9 billion of fiscal credits in our balance; BRL2.2 billion of PIS, COFINS; and BRL0.8 billion of ICMS. We also â\u0080\u0093 there are also initiatives to sell assets, mainly real estate assets and nonstrategic business like gas stations; and at last our share â\u0080\u0093 our remaining share in Grupo Exito after a spinoff of 13%. But by the end of 2023, our perspective is to lower our debt. Itâ\u0080\u0099s important to remember that on 2022, we faced many labor continues because of 2 factors: 1 was the closing of the hypermarkets; and 2, the law changes, in May, the labor law was changed. Our next question from Andrew Ruben, sell-side analyst from Morgan Stanley, in English. Our next question from Joseph Giordano, sell-side analyst from JPMorgan. And we see the occupation costs of the company when we eliminate the extra store, it seems high. When we see the payment of leasing is 4%, 5% of your revenue, I would like to know if there is some legacy payments regarding the extra operations. Now regarding the ICMS, yes, 100% of the contingency was provisioned. Interpreted Now regarding the e-commerce, the answer regarding innovations during the next 2 years, our focus will be on 2, 3 points. Regarding digitization, one would be to increase sales in a profitable way. This is to increase the penetration, providing a better experience to our customer and also improving the experience of the store like pickers and delivery process because we don't want to see friction in these processes. Point number 2 regarding customization, everything regarding CRM. So because we want to pull out of a CRM model that is a generalized context that is all the same for every -- and we want an intelligent bespoke model focused on the existing customer base, and we have over 30 million customers. Point #3, and when you talk about exclusiveness, well, this is not our model. We believe that customers have to be able to access Pao when, where, whenever they want and how they want. Now regarding last mileâ\u0080\u0099s partners, we do see opportunities, and this has materialized. And if you can offer and if you can be a positive reference of food retail in these platforms, well, yes, we do see an opportunity of sales growth in them. Our next question from Joao Pedro Soares, Citi, sell-side analyst. Even though it's clear the initiatives that you are pursuing are based in assortment, service improvement, nonetheless, it's important to understand the timing of the improvement of gross margin. And point number 2 would be, I know that it's difficult, Guillaume, I know that there are many initiatives of asset monetization. And naturally, there are effects that perhaps depend -- I mean, there's not a clear timing, but it's important to understand the company's capacity to generate cash. So although there is an improvement in the EBITDA margin, I want to see the cash generation. Well, when you speak about gross margin, I will answer that question. Well, it's important to look upon gross margin based on 3 pillars: your relationship with vendors; secondly, your pricing strategy; and thirdly, the issue of markdown. When we're looking at suppliers, as I mentioned formerly, we are undergoing a process after the discontinuance of Extra to come closer to the supplier based on a new business model. And when it comes to category strategy, it is extremely important to offer the customer an ideal assortment, taking into account the size of the store. We're working on clustering of stores, and through this store clustering, thinking of the size of stores, of space, creating plants, and then offering a proposal differently from what was being done. We're focusing on the reference products, those products that we call never be better, although our value proposition is focused on premium banners, Minuto Pao de Acucar and Pao de Acucar, although we are rebuilding the stores so that they can be a benchmark in food retail in Brazil. We're referring to 250, 300 products that we monitor very closely. Secondly, the increase in penetration of perishables, which also aid and abet us in improving the recurrence of visits, loyalty of customers, and enhancing gross margin because perishables naturally offer a better gross margin. We have made significant strides, and it's important to reduce our capital costs, increase turnover, and as a result, of course, also reduce investments that are being made presently in markdowns and breakages because we still are faced with a surplus stock. What we see in the first quarter is an improvement upon the fourth quarter, and this should continue in the coming quarters. Joao, regarding your question about an organic cash generation. To have 3 different impacts going forward: an improvement in our EBITDA; a reduction of inventory, as mentioned by Marcelo, we are between 3 to 5 days of reduction in inventory; and third, the monetization of our main tax credits, especially PIS, COFINS, and ICMS. The next question is from , a sell-side analyst in Portuguese. , of course, we cannot break down too many details regarding the first quarter. What I can say is that we continue to observe growth in sales and evolution in the month of February, especially in the second fortnight because of Carnival. But as a counterpart to this, we have observed highlights, especially in the Rio de Janeiro market because of the operational enhancements and the work that has been carried out. This is a strong brand for both banners for the Extra market, for Pao de Acucar, and we could, of course, benefit from a reality in which the Hortifruti may be undergoing some problems â\u0080\u0093 Natural da Terra. Our next question is from Irma Sgarz, a sell side analyst from Goldman Sachs. Of course, although it has improved after the third quarter, it is still below the inflation for food. And of course, you mentioned this when speaking about gross margin. And by looking at my notes, we have been speaking about the G7 format for the last 5 years. Normally, the retail market renews its formats every 5 to 7 years. I would like to understand if you're already thinking about a new format or if in some markets, you require an innovation besides the G7 format, perhaps opting for the G9 format, which you have already mentioned. We still have some impacts, and it is important to understand the value proposition that we're working on very strongly to once again regain our premium customers, something that we have to go back to doing that we have begun to do, and the NPS is proof of that, is a value proposition, especially for Pao de Acucar, of becoming a premium food retail for Brazil. This year, we began investing in the top 30 stores, as we call them. They represent 7% above the average sales on average, 1 EBITDA point above the average, and were now moving on towards the top 50 stores. We're working on a model that we call the premium  representing the 15 most premium stores in the organization, further expanding our value proposition, not only for the brick-and-mortar store, reinforcing the brick-and-mortar store, working on the food hall concept, where we offer ready-to-eat, ready-to-go concept with greater volumes than we used to have and strengthening the presence of perishables, coffee, pizzas, hamburgers, pasta. Despite all of this, an important point, and here we have to be convinced of the work we're doing without shortening anything. We truly have to bring back our customers and the vision of customer -- our premium customers, so they return to the Pao de Acucar stores. And, of course, enjoy the premium value proposition that had suffered a deterioration. Very shortly, we will have news for you regarding an upgrade in the Mais program with a segmentation of customers, a segmentation in our customer standards to further engage these customers, a value proposition of the Pao de Acucar card, strengthening and awarding consumption in store, not only awarding those that consume outside of the Pao de Acucar. This is something we changed in the last quarter and beginning of this quarter to make sure that it will be worthwhile buying with the Pao de Acucar card, especially buying on the site, and in Pao de Acucar we have seen an increase of the card share within our stores, which is very important and strengthening our proximity strategy. We have observed a growth -- a tepid growth perhaps but a constant growth quarter-on-quarter in supermarkets, and we see a double-digit growth in the proximity stores. They're more sensitive to prices, and this is where we have worked with a commercial and operational partnership with a very strong return. We carried out a test at the end of last year, beginning of this year of changing for Compre Bem supermarkets in the coast of Sao Paulo to Extra stores. But for the Pao de Acucar value proposition, we have to stick to our strategy, although growth has not appeared at the speed that we wished it would. Interpreted Regarding G7, I do understand your point. They were carrying out a number of adjustments together with the commercial team, the store concept team, and they are broadening the presence of perishable goods in the store. And well, we can think about a new model as soon as this is necessary. And we expect 100% until the end of the year, 60% of sales. The next question from Iago Souza, sell side analyst from Genial Investimentos in Portuguese. Well, Easter, I would say that you have a point. What we observed during the World Cup wasnâ\u0080\u0099t the update that we expected because of the proximity to Black Friday, seasonality because of Christmas, and what we see more is a evelling field in terms of seasonality, 30 days before the event. Now obviously, you always have the last 10 days that represent a greater impact. Everything regarding fish products that is a great strength of Pao de Acucar and, obviously, fresh fish and also codfish where we already have everything planned for the entire month. And this will provide us the opportunity not to guarantee not only to capture the seasonality, not only exclusively depending on the last 10 days that come before the event, but also to better level our margin because as youâ\u0080\u0099re able to sell more during the preseason, obviously, you pull out of the seasonality with lower volume, with a less need of marking down prices. Now speaking specifically about Easter this year, what we are doing together with the industry, yes, we have been able to acquire additional volume than what traditionally we have closely followed the industry. Now everything regarding chocolates, chocolate bars, everything connected to that category as a whole has surprised us positively. This is, of course, close to the , the last point of contact where the customer â\u0080\u0093 where the impulse purchase takes place, and weâ\u0080\u0099ve seen a positive response in sales and in margins for this category. So yes, stores are being prepared now during the first week of o March. And for the first time, we are going to carry out encompassing test in the proximity stores. Traditionally, we donâ\u0080\u0099t explore the proximity stores because of physical space during Easter, and we do believe that here we can offer a more reduced assortment, but more relevant in these stores, and weâ\u0080\u0099re going to carry out this test this year, and we want to be positively surprised due to the work and the engagement of the entire team. Thank you very much. Weâ\u0080\u0099ve recorded important progress like the recovery of growth, our EBITDA has also improved. The expansion plan and the commitment of opening over 100 stores this year, in addition to the digital growth will surpass double digits. Nonetheless, we are committed to continue developing our strategy to recover the GPA that we want to be a supermarket company, a reference in the premium segment with a sustainable model."
}