{
    "symbol": "NEM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 15:22:06",
    "content": " Tom, please go ahead. Ahafo South delivered a strong second quarter performance increasing gold production by more than 25% compared to the first quarter due to improved ore grades, higher underground and open pit ore tonnes mined and steady mill performance. As part of the newly established profit-sharing agreement, Newmont Penasquito has agreed to pay an uncapped profit sharing bonus up to 10% of profits from the operation, with an expense of $70 million related to 2021 results, adding more than $65 per ounce to North America's second quarter all-in sustaining costs for gold and over $180 per ounce for coal product gold equivalent ounces. For 2022, we expect the profit sharing bonus to add additional costs of around $15 million at an $1,800 gold price, adding approximately $4 per ounce to North America's all-in sustaining costs for gold and $10 per ounce for coal product gold equivalent ounces. Looking ahead, costs are expected to stabilize as gold production from this large polymetallic mine increases in the third quarter due to higher grades delivered from the Penasco pit, whilst coal product grades from silver, lead and zinc begin to decline in the second half of the year as planned due to mine sequencing. At Tanami, the site also delivered improved production with an increase of more than 25% compared to the first quarter due to higher ore grades, an increase in tonnes mined and improved mill performance, helping to offset the impacts from higher contracted services costs in a very competitive labor market. Newmont delivered a solid performance in the second quarter with $3.1 billion in revenue at a realized gold price of $1,836 per ounce, adjusted EBITDA of $1.1 billion and solid free cash flow of $514 million. These impacts alone resulted in a reduction to net income of approximately $0.19 per share compared to the first quarter, largely offsetting a 12% increase in gold sales volumes due to higher production from our operations in Australia and Africa. Lawson, the key aspect of our dividend framework is gold price, and we look back at gold price over an extended period of time, not necessarily any volatility you may see in a particular quarter and look at the gold price over an extended period of time and we sit down and have that discussion with our Board to ultimately decide the dividend that we pay and determine the cash that we've generated and our capacity to pay a dividend. Then we're right in the middle of our business planning process at the moment where we're then looking and debating and discussing what we're seeing in terms of our input costs and how we're seeing the various contracts that we've got playing out in terms of whether it be contracted services label, whether it be our own workforce, whether it be the assumptions you make around diesel in the next year, the assumptions we make around spare parts, the assumptions we make around explosives and cyanide and the contracts that we've got in place with those suppliers. Tom, please go ahead."
}