{
    "symbol": "STGW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 10:36:09",
    "content": " Our top 25 client relationships average $6 million of net revenue in the quarter versus $4.8 million in first quarter 2021, representing a 27% increase as we continue to win bigger accounts. 03:41 Net revenue, which we believe is an important measure because it excludes pass-through expenses, grew organically 24% to $527 million and our adjusted EBITDA surged 34% to over $100 million. We are reiterating our full year guidance for 18% to 22% net revenue growth and 13% to 17%, when excluding advocacy, with adjusted EBITDA of $450 million to $480 million. 11:45 As I mentioned last quarter, we expect to significantly exceed the long-term 79% organic revenue growth targets we discussed in our November Investor Day, and are now comfortable targeting 10% to 12% organic growth in the long-term on average in addition to $450 million of GAAP revenue from M&A and growth of acquisitions, and $75 million of revenue from SaaS and DaaS products, all targeted by 2025. 15:20 Revenue for Q1 was $643 million versus $181 million for the same period in the prior year, or an increase of 255%. Net revenue, excluding pass-through costs was $527 million versus $158 million in the prior period, or an increase of 233%. Revenue for Q1 was $643 million versus $489 million in the prior year, or an increase of 32%. Net revenue, excluding pass-through costs, increased to $527 million from $429 million in the prior year or an increase of 23%. Ex-Advocacy, net revenue increased to $489 million or an increase of 22% as the impact of the political cycle is expected to ramp-up in the second half of the year. Net revenue in the Media Network increased by $39 million or 44% for the quarter, driven by strong growth at Gale, Ink and Assembly. 17:55 And Integrated Agencies, our largest segment increased net revenue by $46 million or 16%, driven principally by growth at Code and Theory, Anomaly, NRG, Harris and Instrument. When viewed from the perspective of our principle capabilities, net revenue increased across all categories led by digital transformation, which increased organically from $101 million to $151 million or 49% driven by growth at Code and Theory, Gale, Targeted Victory and Instrument. 18:37 Consumer Insights and Strategy increased organically from $33 million to $51 million or 56%, driven by growth at NRG and Harris. And finally, Creativity and Communications increased organically from $219 million to $232 million or 9% driven by growth at Anomaly and Allison & Partners. As a result, for the quarter, adjusted EBITDA increased to $101 million from $76 million or 34% over the prior period. 20:32 Ex-Advocacy, adjusted EBITDA increased to $90 million from $68 million or 32% over the prior period, which as I stated earlier, the impact of the political cycle is expected to ramp-up in the second half of the year. As Mark previously noted, we are reiterating our full year guidance of 18% to 22% organic net revenue growth and 13% to 17% growth ex-advocacy with adjusted EBITDA of $450 million to $480 million excluding the impact of acquisitions."
}