{
    "symbol": "STGW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 14:40:05",
    "content": " While incumbents have minimally raised outlook to 6% to 7% growth, we are reaffirming our already strong outlook for the year of 18% to 22% organic net revenue growth and $450 million to $480 million in adjusted EBITDA. Q2 net revenue was $556 million, a pro forma increase of 16% over the prior year, including 16% organic growth. Year-to-date, net revenue of $1.08 billion grew 19% with 20% organic growth versus the same period last year. Adjusted EBITDA was $111 million for the second quarter, an increase of 13% versus the prior year, bringing our adjusted EBITDA to $213 million for the first half, an increase of 22%. Revenue for Q2 was $673 million versus $210 million for the same period in the prior year, or an increase of 221%. Net revenue, excluding pass-through costs, was $556 million versus $182 million in the prior period or an increase of 206%. For the 6 months, revenue was $1.32 billion versus $391 million for the same period in the prior year, or an increase of 237%. Net revenue, excluding pass-through costs, was $1.08 billion versus $340 million in the prior period, or an increase of 219%. Adjusted EBITDA for Q2 was $111 million versus $39 million for the same period in the prior year, or an increase of 188%. For the 6 months, adjusted EBITDA was $213 million versus $63 million for the same period in the prior year, or an increase of 240%. Revenue for Q2 was $673 million versus $555 million in the prior period, or an increase of 21%. Net revenue for the quarter, excluding pass-through costs, increased 16% to $556 million from $480 million in the prior year. Net revenue, excluding pass-through costs, increased to $1.08 billion from $909 million in the prior year, or an increase of 19%. Beginning with Integrated Agencies, our largest segment, organic net revenue grew by $27 million and $79 million or 9% and 15% in Q2 and for the 6 months, respectively, driven by strength in digital, integrated pitches and larger contract wins. The media network increased its organic net revenue by $36 million and $68 million or 28% and 27% in Q2 and for the 6 months, respectively, driven by demand for our digital services, several $10 million contract wins and growth in our travel-related business. Organic net revenue in the Communications segment increased by $15 million and $30 million or 28% and 30% in Q2 and for the 6 months, respectively, driven by the ramp-up in our Advocacy business in the midterm election year. Adjusted EBITDA increased in Q2 to $111 million or 13% from $99 million in the prior period with an EBITDA margin of 20%, slightly lower from the prior period by approximately 50 basis points. For the six months, adjusted EBITDA increased to $213 million or approximately 22% versus $174 million in the prior period with an EBITDA margin of 19.6%, higher from the prior period by approximately 50 basis points. CapEx for the quarter and the 6 months was $7.9 million and $14.5 million respectively, or approximately 1% of year-to-date revenue, in line with our previous estimates. The company is reaffirming its full year guidance of pro forma net revenue growth of 18% to 22%, pro forma net revenue growth excluding Advocacy of 13% to 17% and adjusted EBITDA of $450 million to $480 million."
}