{
    "symbol": "STGW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 13:44:06",
    "content": " 3Q revenue was $664 million, a pro forma increase of 17% over the prior year with 16% organic growth. Net revenue, which excludes pass-through costs, grew 12% to $556 million and was driven by 11% organic growth. Year-to-date, net revenue increased 16% to $1.64 billion, with 17% organic growth. Adjusted EBITDA increased 15% year-over-year to $115 million, and margins expanded 60 basis points to 20.7% of net revenue. Third quarter net new business was $86 million, our highest on record, and pitch activity has remained healthy, giving us confidence going into 2023. As I reported, new business lagged in the second quarter, but after we went in force to the Cannes Lions International Festival of Creativity, it picked up strongly and resulted in the record $86 million of net new business this quarter, which augurs well for 2023. We're reaffirming our guidance for 13% to 17% net revenue growth, excluding Advocacy and $450 million to $480 million of adjusted EBITDA. Net revenue, excluding pass-through costs, was $556 million versus $409 million in the prior period or an increase of 36%. For the nine months, revenue was $1.98 billion versus $857 million for the same period in the prior year or an increase of 131%. Net revenue, excluding pass-through costs, was $1.64 billion versus $749 million in the prior period or an increase of 119%. Net income available to Stagwell common shareholders was $10.6 million and $33.7 million for Q3 and the nine months ended, higher by $12.7 million and $13.5 million over the respective prior periods. Net CapEx for the quarter and the nine months was $11 million and $25.5 million, respectively, or approximately 1.2% of year-to-date revenue, in line with our previous estimates. Net revenue for the quarter, excluding pass-through costs, increased 12% to $556 million from $498 million in the prior year. Net revenue, excluding pass-through costs, increased to $1.64 billion from $1.41 billion in the prior year or an increase of 16%. Adjusted EBITDA increased in Q3 to $115 million or 15% from $100 million in the prior period with an EBITDA margin of nearly 21%, higher from the prior period by approximately 60 basis points. For the nine months, adjusted EBITDA increased to $328 million or approximately 19% growth versus $274 million in the prior period with an EBITDA margin of 20%, higher from the prior period by approximately 50 basis points. The company is reaffirming its guidance for 13% to 17% net revenue growth, excluding Advocacy and $450 million to $480 million of adjusted EBITDA and adjusted earnings per share of $0.86 to $0.94."
}