{
    "symbol": "SY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-18 11:40:09",
    "content": "  Operator: Good morning, ladies and gentlemen, and thank you for standing by for So-Young's Third Quarter 2022 Earnings Conference Call. Thank you, operator, and thank you for joining So-Young's third quarter 2022 earnings conference call. China's overall domestic consumer market remained under pressure in the third quarter, with repeated COVID-19 outbreaks in certain parts of the country. Despite this market uncertainty, we delivered solid financial performance during the quarter, and we have now achieved gradual sequential improvements in each of the first 3 quarters of 2022. Total revenues were RMB 320 million, representing a sequential increase of about 5% and in line with our previous guidance. Our progress were well recognized among medical service providers, and we established new cooperation agreements with more institutions, thanks to our device product offering. The number of paying medical service providers on So-Young's platform reached 6,199, up 28% from the prior year. On the user side, we continue to refine our operations to serve different cohort of medical aesthetics consumers, leverage our deep understanding of users and our edge in big data analysts. In the third quarter, a number of user verified order on our platform grew 6% sequentially. In addition, we launched the So-Young Prime program targeting customers in the first and second-tier cities who account for the majority of medical aesthetics consumption. The So-Young Prime program is aimed at establishing clear and transparent industry standards, reducing consumers' trial and error costs, simplifying their decision-making process and providing one-stop solutions for light medical aesthetic services, enabling our customers to pursue beauty with peace of mind. As part of our long-term strategy for providing superior user experience, So-Young Select caters to our users' preference for high-quality branded medical service providers and enables providers to offer enhanced service and build their brand value. In the third quarter, with the rollout of So-Young Select, the promotional spend of service providers on our platform increased by over 25% quarter-over-quarter and about 20% year-over-year. Meanwhile, under So-Young Select, we have also rolled out So-Young Select Doctor, which helps users choose premium doctors, providing useful information to facilitate their decision-making and driving user conversion. In terms of industry regulation, the recent national regulatory policies emphasize a transparent pricing, consistent online and off-line pricing and cracking down on force advertising and misinformation that harms the interest of consumers. The regulatory requires for online platforms are consistent with the self-regulatory actions, So-Young has been implementing for years, indicating that our work is towards the right direction. Looking at the overall Chinese medical aesthetic industry, it is under pressure in the near term, while the positive perspective is intact for the long term. During the quarter, the non-GAAP net profit attributable to So-Young International Inc. reached RMB 9.9 million. Going forward, we will work to better serve medical aesthetic consumers by investing in our business and evaluating the user experience. According to the Frost & Sullivan, browsing back from the year-over-year decrease in 2020 due to the outbreak of the pandemic and the global medical aesthetic market grew by 13% year-over-year in 2021 and is expected to grow by 14% year-over-year in 2022, with CAGR of approximately 13% from 2021 to 2025. In 2020, the number of the medical aesthetic treatments per 1,000 people in China was about 21 compared with 82 and 48, respectively, in South Korea and the United States, which are more developed medical aesthetics market. For the third quarter 2022, total revenues were RMB 323.3 million compared to the RMB 431.5 million in the corresponding period of 2021, in line with our previous guidance. The decrease was primarily due to a decrease in average revenue per paying medical service provider, which was impacted by the resurgence of COVID-19 and remained under pressure from China's overall domestic consumer market. Within total revenues, information services and other revenues were RMB 235.7 million, down 26.7% year-over-year. Reservation services revenue were RMB 29.7 million, down 51.8% year-over-year. Sales of equipment and maintenance service revenue, which were from Wuhan Miracle Laser System Inc. were RMB 57.8 million compared with RMB 48.1 million in the same period of 2021. Cost of revenues were RMB 94 million, up almost 5% year-over-year. Total operating expense were RMB 236.6 million, down 26.6% year-over-year. Sales and marketing expense were RMB 124.8 million, down almost 35% year-over-year, primarily due to a decrease in expense associated with branding and user acquisition activities. Research and development expense were RMB 52 million, down 32% year-over-year, primarily due to a decrease in payroll costs. General and administrative expenses were RMB 59.8 million, up 9.4% year-over-year, primarily due to an increase in payroll costs and professional service fees. The increase in income tax benefit was primarily due to the refund of income tax of RMB 12.6 million in the third quarter of this year based on the final 2021 tax refund filing results -- a tax return filing results, sorry. Non-GAAP net income attributable to So-Young International Inc., which includes the impact of share-based compensation expenses, was RMB 9.9 million compared with RMB 28.9 million in the same period of last year. Basic and diluted earnings per ADS attributable to ordinary shareholders were RMB 0.02 and RMB 0.02, respectively, compared with RMB 0.06 and RMB 0.06, respectively, during the third quarter of 2021. We had total cash and cash equivalents, restricted cash and term deposits, term deposits and short-term investments of RMB 1.6 billion compared with RMB 1.8 billion as of December 31, 2021. Net current assets was RMB 1.3 billion as of September 30, 2022 compared with RMB 1.3 billion as of December 31, 2021. Net assets was RMB 2.6 billion as of September 30, 2022 compared with RMB 2.1 billion as of December 31, 2021. For the fourth quarter of 2022, we expect total revenue to between RMB 310 million and RMB 330 million. Today, the Board of Directors of the company authorized a share repurchase program, under which the company is authorized to repurchase of an aggregate value of USD 15 million of these shares, including in forms of the ADS during the 12-month period beginning from November 18, 2022. So recently, SAMR has released the guideline on taking down our first advertising and illegal pricing in the medical aesthetics industry. The regulatory requirements for online platforms are consistent with the self-regulatory actions So-Young has been implementing for years, indicating that all along, we have been a leader and training center in protecting the interest of our users. As the first platform to adopt and consistently drive self-discipline actions in the industry, we like consumers to be fully informed about the products, including price, performance specifications essential and disclosed products and services information in a comprehensive authentic and accurate manner. In the long term, government regulation will be beneficial for the healthy development of the whole industry and promote the medical nature of the aesthetics business. A medical aesthetics platform doesn't maintain user by entertaining them, but rather by satisfactorily solving their needs. First, we will continue to optimize community content, effectively recommended products and service to users and provide diverse content, including doctors and products. We were perfect user -- we will perfect user experience for online products, enhance consumer protection, optimize consumer consumption experience on our platform and drive user to make highly efficient buying decisions. Second, as our attention shifts from merely traffic incremental growth to operation and service of client stock, we keep improving user service experience during the whole life cycle and guarantee and their consumption experience throughout the whole process. Second, products and information on our platform need to provide good consumer protections as well as shops users issues with online decision-making and demands. Third, for users who want to use 1 institution to satisfy their diverse demands or needs, we provide service catering to multiple scenarios, so users can directly visit institutional with information acquired on our platform or some users with higher service requirements, they can work with institutions through our So-Young Select program. Finally, our platform provides upsell return with its customer service cancellations and insurance for customer issues, which ensures the experience throughout the complete progress. Despite this market uncertainty, we delivered a solid financial performance during the quarter, and the situation is gradually recovering in the first 3 quarters. In user front, as we discussed in prepared remarks, the global medical aesthetic market maintained steady growth in the past years, and there is significant upside of the penetration rate of the Chinese market. According to the Frost & Sullivan, the global medical aesthetic market is expected to grow at a CAGR of around 13% from 2021 to 2025. In 2020, the number of medical aesthetic treatment per 1,000 people in China were just about 21 compared with 82 and 48, respectively, in South Korea and the United States, which are more developed medical aesthetics market. On institutional front, as the impact of uncertain factors gradually ease and when they can operate normally, we believe their marketing budget allocated to So-Young platform will go up gradually. At present, we must commit to our long-term vision while making dynamic adjustment in short term and execute our exceptional strategy, improving the operation and providing high-quality user experience and forming closer relationships with industry partners. Overall performance of major online platforms were relatively soft compared to last year, while overall retail market is in a slow recovery stage. Despite our pressure on the overall consumption market, our daily online users during Double 11 stayed flat compared with last year. First, on industrial outlook, I believe Medical Aesthetics has a broad perspective to seize the opportunity and achieve growth. Through the years, we have built trust with our users when users have need for medical aesthetics, we can truly solve it and enable a better consumption experience. As we are not an entertainment platform, users don't spend plenty of time watching video or reading post, but search for a product that satisfies their needs. For the new initiatives, we are exploring new consumption scenarios for users and serve them with a range of diverse solutions. Based on the data, a shift in consumer demographics for medical aesthetics in terms of age, peers, income level, et cetera. According to transactions on our platform, mega cities such as Beijing, Shanghai, Guangzhou and Shenzhen have always led the consumption, with number of users placing orders and transactions activities at high level than other cities in China. But in 2022 are the new first tier cities, including Chengdu, Hangzhou, Wuhan, Nanjing and Chongqing are also become major cities for medical aesthetics consumptions. In terms of other categories on our platform, non-surgery accounts for over 80% of total orders, NTNG is one of the most favored category and the most frequently purchased product such as wipes and hydronic acid skin whitening and skin rejuvenation account for over 50% of total orders. The proportion is slightly higher than 2021, indicating users' demands from non-surgery categories. We also launched some products based on characteristics of certain categories, such as So-Young pin card, which includes several anti-aging products in our bottom of facilitated user choice."
}