{
    "symbol": "JOAN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-17 22:58:06",
    "content": " We continue to add new customers to join at a high rate, through the end of fiscal year 2022 our known customer database grew by 42% over the three years and is now in excess of $77 million. Even after absorbing nearly $60 million for higher year-over-year logistical costs, it should be noted, that our gross profit dollars measured on a GAAP basis, still grew by approximately 10% in fiscal year 2022, on a two-year stack. Adjusted EBITDA was $88.9 million for the quarter compared to $106.1 million last year, and $280.6 million in fiscal 2020, a 10% increase on net two-year basis. Net sales were $735 million, reflecting a decrease in total comparable sales of 12.4% to last year's fourth quarter. Our GAAP basis gross profit declined by 1% in the fourth quarter on a two-year basis, driven by expected but escalating increases in excess rate and related supply chain costs. We fully absorbed around $42 million year-over-year of higher Ocean freight costs in Q4, of which $35.3 million was included as an adjustment to gross profit on a non-GAAP basis, as we believe those amounts represent a transitory impact to our operating results driven by market conditions springing from the COVID-19 pandemic. Our fourth quarter selling general and administrative expenses totaled $278.4 million, a decrease of 11.3% compared to the same period last year, and an increase of 9.4% on a two-year basis. Relative to the fourth quarter of fiscal 2020 or two years ago, our expenses increased at a slightly higher pace than the 6% comp sales growth due to 1. increases in domestic distribution center costs, to handle later arriving goods; 2. increases in strategic and technology development costs; and 3. higher incentive compensation than two years ago. For the year, we also absorbed nearly $60 million year-over-year of additional ocean freight and related supply chain costs, of which $46.6 million was excluded from our adjusted EBITDA and adjusted gross margin, non-GAAP measures. Adjusted for excess ocean freight unrelated supply chain costs, gross margin rate improved by 280 basis points from two years ago or fiscal 2020 to 52.1%. While we did expect to see increases in inventory due to depleted stack levels at the end of our prior fiscal year, much of this increase was driven by excess ocean freight costs, which represent $46 million of our inventory balance at year-end."
}