{
    "symbol": "JOAN",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-03 22:36:03",
    "content": "  Operator: Welcome to the First Quarter Fiscal 2022 Earnings Call for JOANN, Inc. My name is Adrian, and I'll be your operator for today's call. I would like to remind everyone that comments made today may include forward-looking statements, which are subject to significant risks and uncertainties that could cause the company's actual results to differ materially from management's current expectations. For those who are new to our story, at JOANN, our mission is to inspire the great spirit in each of us with a strong legacy as a nation's category leader in selling, we are also one of the fastest growing retailers in the arts and crafts category with a robust omni-channel platform. Our vision is to be an inspirational leader that helps everyone find their happy place, through superior assortments, strong merchandising execution, and a relentless focus on customer service and experience. Our sales trends remained strong growing at 15% over last year's first quarter, with that strength spread broadly across our merchandise categories, customer segments, channels and geographies. We also drove gross margin expansion and controlled expense to increase net income to $15.1 million and expand adjusted EBITDA margins by 570 basis points, the 10% of sales, resulting in a $35.8 million or 165% increase in adjusted EBITDA versus last year's first quarter. Driven by our many balance sheet initiatives and $77 million in net proceeds from our recent IPO, we’ve reduced our long-term net debt by $570 million from the same period last year to $760 million at the end of our latest quarter. I too truly grateful for the efforts of our entire organization, collectively our field, distribution center and corporate teams on wavering focus on serving our customers and communities resulted in strong first quarter results for JOANN. Now, let me share highlights of our first quarter fiscal 2022 performance, which exceeded our internal plans on top-line sales performance, operating margins, and bottom line profit. Net income was $15.1 million in the first quarter of fiscal year 2022, compared to a loss of $23.6 million last year. Your line is open. Again, just the overall inventory carrying values is helpful there, but we’ve also implemented a number of controls in our stores over the last 12 months to 18 months, that are starting to really bear fruit. And then one I would put shortly after that, but I think longer-term is something that we’re quite excited about is just the overall lower penetration of clearance to our total inventory. I think these benefits will likely continue again, the one thing we’re seeing now is really a primarily these massive ocean freight increases. And these are – I’d say, the bad news is they’re probably unprecedented in their nature, but the good news is they’re not sustainable, at some point they’re going to fade and will go back to normalcy. Yeah, I think the rest of it kind of tailwinds I talked to we do feel they’re sustainable. I think that’s a portion of the benefit we’re seeing, but I would also attribute much of that to just our own analytics and really reading of the unprecedented number of new customers we have coming in to the space and really understanding their sensitivity to promotions and our ability to leverage our high-low model against that. Your line is open. Yeah, I mean our results were broad-based, really all of our core divisions were up and growing nicely, especially on the stronger side was really our arts and crafts and seasonal was a bit stronger than balance, but very broad-based. Sewing wasn’t as strong, but one of the things even though sewing is up nicely on a two-year stack. So, our things like our fashion apparel, our special occasion and then there’s obviously sales that come with that in terms of sewing construction, these businesses have largely been shutdown, because there haven’t been weddings, cosplay events, , there hasn’t been lot of program, those kinds of things. And as we see different geographies and zip codes open up, we’re seeing those businesses now start to blossom, but we see that’s going to be actually a nice little tailwind for us too, as we get back to the new normal. We’ll have a fairly modest number of projects this year somewhere between 10 to 15 that will be completed, as we’ve talked earlier a bit of an impairment in our ability to plan those projects this year, just given the pandemic and the ability to have construction crews in our stores in many markets. We’ve just completed a thorough review of our whole chain in terms of our strategy for those refresh projects and are well on our way to ramping up to full rollout mode starting really at the end of this fiscal year and moving into early next, that’ll result in about 60 to 70 projects per year. We endeavor to have a blended return on those projects of about four-years payback on the initial investment into those projects, some of them will blend a bit longer than that, a lot of them more quickly where we’re getting pretty healthy lifts on those projects for relatively modest investments. Your line is open. Maybe a follow-up for you, you mentioned machine sales, like during the prepared remarks here, but just curious if you could provide some color on the quarterly performance, any update – updated thoughts on how you expect machine sales to trend this year versus last year holistically? On that side of the house we feel very, very good, and we're still seeing a lot of young consumers coming in and learning the art and evolving the machine, experienced consumers continue to trade up. On the other side of the house, the craft machine house a very strong, very good pipeline of innovation still coming. And customers are engaging and we're seeing, very good follow-on sales. We're running the metrics now to see if it's the same as historic, selling again, I think is a little bit distorted because a lot of these major events that do a lot of selling are not happening yet, but they're starting to. And so we're seeing, good life where that is happening. Yeah, we're still seeing – we did some tracking of our newer customers recently. So yeah, we're still seeing very good follow-on activities in those customers that bought their first machine last year. I would also say we're seeing nice ability to be more efficient on our lower inventory carry that provides some nice labor efficiencies for us and our distribution centers, as well as our stores. And we've done a, I think a pretty good job leveraging those. Your line is open. Maybe just to follow-up on, Matt some of your most recent comments off of Steve's question with new customers. I know in the past we've talked about the 2020 cohort of customers that bought either a sewing machine or a Cricut machine, and felt that the sales view for 2021 was based on retaining about 65% of those customers and that those customers on average would see about a 66% increase in spend from year one to year two, all align with the historical measures. Yeah, I think definitely, as I mentioned earlier, the frequency and the basket value from that customer is at least as strong as we've seen historically in what we've hoped. I would say on the retention piece, was also talking with our Chief Customer Officer a bit on this earlier in the week. Just because we've – some of these customers were added in the fourth quarter last year, but certainly we're on trend for that and expect to be able to achieve that. And I guess there's no formal guidance for the second quarter, but at least where the consensus number sits would have your sales growing on a two-year basis at about 15%. So what I would say about the two-year trend for second quarter is the thing you probably need to think about with that and what we look at is that, the year, or two years ago, that second quarter was a pretty weak quarter for us. And actually our first quarter of that year was by far our strongest quarter, so some of this is really the trends in that two years ago time period. We actually feel like, our kind of quarter-to-quarter trends in terms of sales are going to somewhat normalize this year. I think maybe the one piece that would go against that is, as Wade mentioned, we deal – we do still have some businesses that have been shutdown, due to COVID things like our celebration category, special occasions, and so on. Maybe one last question, just thinking forward as well. What we're really saying is we have some tailwinds that maybe would have had it, even more optimistic. I mean, for perspective on the ocean freight, what we're seeing now on some of the broken containers that we're getting is as high as 10 times is what historically paid. So again, that's going to ultimately subside, I know others are seeing similar issues, but that's probably the one anomaly and that didn't hit us very much in the first quarter. That really is the thing that misses throughout the balance of year and then ultimately we will expect, we'll return to normal. We don't expect to give all of that back, but certainly not be that strong on a over-over-year basis for the balance of the year. Your line is open. I mean, I'll just for someone may be newer to the company, the Q2 compares last year had not only this kind of huge PPE surge, which has been long gone. So while we're going to be able to manage at or below our internal expectations and what we may have shared earlier around SG&A, we are also not going to put the bank at risk by trying to cut costs and allow us. I guess one thing I would say too, is, we've really spared no expense to make sure that we're standing strong and our in stock positions and our seasonal, being able to really run through the year. So we feel good about that versus the opposite of trying to save costs and not being able to, to be as relevant or as strong to our customers. And then on the e-com mix taking a little bit of a step down in the quarter, I assume that, that has to do with customers returning to stores. On the e-com, the thing to remember is as we got into April last year, and then, as we move forward, we had many of our stores that were shutdown completely to visitors entering. But now we're at a point, this quarter is much more of a normalized quarter, if you will. We would typically have a bit higher penetration from e-commerce in the back half of the year, relative to what we see in the early part of the year. But I would say it's relative to the other things we've talked about, it's pretty minor. You know, our e-com business is now very profitable and we've got a couple of very big leavers that we can make it even more so from a cost perspective and as well as the top line, now that we're kind of at the new normal moving forward, so we are encouraged by that. Your line is open. I mean for a purchase of under $30 and the kinds of customers we have, it's very different than, I would say automotive, appliances and the likes. Particular as for this quarter specifically, those occurred in what was already expected by us to be the strongest part of the quarter. It's when we were up against the, kind of the worst store COVID shutdowns last year. So again, I think that's Wade's point that makes it even a little muddier for us to really kind of sort out how much of that strong period of the quarter was due to the stimulus. Maybe I'll throw my opinion, Matt can throw his, but I think we're seeing, it's a pretty rational environment out there and we still promote – we're always going to promote, but I think we're getting smarter and smarter of how and when and why we promote. Our customers seem to be with us, and both are historic customers with us, but I think importantly we do get great value. We don't want to promote the way we promote now, and a lot of the new customers that maybe haven't been with us for a long time. I mean, I'd never say never, but I think right now it's a good environment and I anticipate the be for some time. A lot of the good results we're seeing, we really feel it's really because of this transformational journey. And for those of you that are stakeholders and we'll possibly be, I just want you to know that we're working as hard as we can every day on your behalf."
}