{
    "symbol": "DRCT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 22:01:04",
    "content": " In Q4 2022, our revenue increased to $29.4 million, an increase of $16.5 million or 128% over the $12.9 million in the same period of 2021, and adjusted EBITDA was flat at $1.8 million. In spite of these macroeconomic issues and changes, our company was able to achieve total full-year revenue of $88 million in line with our previously issued guidance an increase of $49.9 million or 131% growth over $38.1 million achieved in 2021. As a company, our primary focus for 2023 is to continue our strong growth trajectory and deliver $118 million to $122 million in topline revenue along with strong profitability. Our revenue increased to $29.4 million in the fourth quarter of 2022, an increase of $16.5 million or 128% over the $12.9 million in the same period of 2021. We finished the year with total revenue of $88 million, which was in line with our guidance, an increase of $49.9 million or 131% growth over the $38.1 million achieved in 2021. Colossus SSP grew to $22.3 million for Q4 and contributed $15.6 million of the increase, or 231% over the $6.7 million in the same period of 2021. For the full-year, our sell-side segment achieved $58.7 million in revenue, an increase of $46.7 million or 389% growth over the $12 million in 2021. For the fourth quarter, our buy-side businesses, Orange 142 and Huddled Masses grew 15% year-over-year and contributed $0.9 million of our increase, finishing the quarter with $7.1 million in revenue compared to $6.2 million in the same period of 2021. For the full-year, our buy-side segment grew to $29.3 million, an increase of $3.2 million or 12% over the $26.1 million in 2021. For the fourth quarter of 2022, gross profit dollars were $7.4 million compared to $5 million for the fourth quarter of 2021, an increase of $2.4 million as a result of higher revenue. Gross profit dollars for the year were $28 million compared to $18.4 million for 2021, an increase of $9.6 million as a result of higher revenue. For the full-year 2022, operating expenses were $21.3 million compared to $14 million in 2021 or an increase of $7.3 million. As a result of our IPO in February of 2022, the company has increased its headcount in the shared services area and incurred higher costs related to being a public company, primarily in the professional services and investor relations activities, which in total, we estimate these to be approximately $3 million over the course of our first year. For the full-year, operating income increased $2.3 million or 52% to $6.7 million for 2022 compared to an operating income of $4.4 million for 2021. Looking at our organic growth of our three subsidiaries in 2022, the operating income for the combined buy-side and sell-side advertising segments was $14 million, a 102% increase or $7.1 million compared to the $6.9 million for 2021. For the fourth quarter, adjusted EBITDA was flat at $1.8 million in the fourth quarter of 2022 and 2021 and for the full-year, adjusted EBITDA grew to $8.8 million or 39% higher than the $6.4 million adjusted EBITDA for the same period in 2021 not withstanding the additional public costs mentioned earlier. We plan to offer annual guidance and update it throughout the year and accordingly, we estimate that for the fiscal year 2023, we expect revenue to be in the range of $118 million to $122 million or 36% growth year-over-year at the midpoint."
}