{
    "symbol": "AMSC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-08-07 12:07:02",
    "content": " Before starting the call, Iâ\u0080\u0099d like to remind you that various remarks that management may make during todayâ\u0080\u0099s call about American Superconductorâ\u0080\u0099s future expectations, including expectations regarding the companyâ\u0080\u0099s second quarter of fiscal â\u0080\u009822 financial performance, plans and prospects constitute forward-looking statements for purposes of the Safe Harbor provisions under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including those set forth in the Risk Factors section of American Superconductorâ\u0080\u0099s Annual Report on Form 10-K for the year ended March 31, 2022, which the company filed with the Securities and Exchange Commission on June 1, 2022 and the companyâ\u0080\u0099s other reports filed with the SEC. John Kosiba will then provide a detailed review of our financial results for the first fiscal quarter, which ended June 30, 2022, and provide guidance for the second fiscal quarter, which will end September 30, 2022. Now, I will turn the call over to John Kosiba to review our financial results for the first quarter of fiscal 2022 and provide guidance for the second quarter of fiscal 2022, which will end September 30, 2022. Looking at the P&L in more detail, gross margin for the first quarter of fiscal 2022 was 10% compared to 13% in the year-ago quarter. R&D and SG&A expenses for the first quarter of fiscal 2022 were $10.2 million, flat compared to a year ago results. As Daniel mentioned earlier, we booked over $50 million in new orders during the first quarter of fiscal 2022. Almost all of the inventory increase is earmarked for projects within our new energy product lines that we booked during the first quarter, many of which are expected to ship in this fiscal year. During the first quarter of fiscal 2022, we shipped 2-megawatt Electrical Control Systems or ECS, to our partner in India, Inox Wind."
}