{
    "symbol": "HDB",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-19 10:29:02",
    "content": " On retail, we witnessed a healthy growth on disbursals across product, resulting in asset growths of 5%, both prior quarter and 15% over prior year. Wholesale business too showed a sharp rebound across sector, growing 11.6% over prior quarter and 17.4% over prior year. We opened about 2.4 million new liability relationships during the quarter and 8.7 million new liability relationships during the year, exhibiting a phenomenal growth of 25% over prior year, thus enabling the broad basing and deepening new relationships. CASA deposits recorded a strong growth of 22% year-on-year, ending the quarter at ₹7,51,000 crores with a CASA ratio of 48%. Net revenues excluding trading income grew by 10.4% over prior year and 3.8% over prior quarter, driven by an advances growth of 20.8% and deposits growth of 16.8%. Net interest income for the quarter at ₹18,873 crores which is at 71% of net revenues, grew by 10.2% over prior year and 2.3% over prior quarter. Excluding trading income, total other income grew by 10.6% over prior year and by 7.6% over prior quarter. Fees and commission income constituting 3/4 of other income was at ₹5,630 crore and grew by 12.1% over prior year and 10.9% over prior quarter. Moving on to operating expenses for the quarter were at ₹10,153 crore, an increase of 10.6% over prior year. Coming to the asset quality, the GNPA ratio was at 1.17% as compared to 1.26% in the prior quarter and 1.32% prior year. Net profit for the quarter at ₹10,055 crore grew by 22.8% over prior year. If you go back to pre-pandemic, go back to 3 years, 2019, right, if you look at it, the Basel disclosures that we do -- I'm doing that Basel because we show that assets by type -- wholesale was 45%, retail was close to 55%. In fact, in this quarter, the rate of growth in wholesale was even more, 10% sequential -- 11% sequential growth in wholesale in this quarter, right. One quarter doesn't make a -- cannot set your trend and show you something that is consistently there, but I'll give you the same thing, net credit margin for the full year, right, full-year '22, 3.3%, which means including that high credit cost quarter that we had in Q1, include that too. So even in this quarter, if you look at it, the retail grew by about 5% or so, sequentially, right, that's the kind of quote. Last quarter, we had a spend -- credit card spend of 24% and a loan growth of 9%. And if you think about the mix that you asked about, the retail -- the assets and the liabilities on the retail, let’s call it about say 40%, you should look at an annual rather than quarter because quarter-to-quarter there will be variation. So quarter-to-quarter variations, but if you look at the mix of various fees over a year kind of a time period, retail assets and liabilities, about 40% of the total, about 20:20 each. Over a longer period, if you go back 5 years ago -- 3 years ago, 5 years ago, 40%-42%, that's the kind of range that we had. If you look at any kind of a 2 blocks of 5 year period or something, think about the 2017 to 2022 or 2016 to 2021 or 2011 to 2016, whatever kind of a time period if you see, high teens to 20%, right."
}