{
    "symbol": "OLO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 20:52:04",
    "content": " These forward-looking statements include, but are not limited to, statements regarding our expectations of our business, future financial results, total addressable markets and growth opportunity, guidance and strategy, the restaurant ordering processing trend, ability to increase usage of our platform and upsell, including with respect to growth in average revenue per unit and the durability of our customer adoption of multi modules. We generated $47.3 million in total revenue, a 26% increase year-over-year as our platform supported increased module adoption within our existing customer base, increased transaction volumes and continued growth in new locations. The Olo platform is purpose built to help our customers do more with less and create a differentiated and memorable guest experience, and as restaurant executive and operator conversations increasingly focus on sales and margin maintenance due to challenges related to increased inflation, supply chain constraints and labor dynamics, we believe that Ola's platform is best positioned to meet restaurants' needs. Other examples of expanded relationships within brands this quarter include BJ's Restaurants and Brewhouse, as well as Wetzel's Pretzels, adding dispatch and Olo Pay in addition to our ordering rails and network modules. Furthermore, when restaurants pair on-premise solutions with Olo Pay, they're able to realize the incremental value of utilizing one single digital platform driving a better experience for their guests and staff as we've already seen a brand like Nandos with their adoption of QR code ordering and Olo Pay. As our latest platform level innovation, we believe borderless is the next step to improving the on-demand commerce experience, empowering brands to capture valuable guest data while delivering superior hospitality through added convenience and we're excited by the opportunity for borderless functionality to transform the sign-on and checkout experience for guests unlocking additional revenue opportunities for restaurants and Olo. Increased compensation costs to support new locations coming onto the platform and to a lesser extent, processing costs associated with Olo pay sales and marketing expense for the third quarter with $6.1 million or 13% of total revenue. And I think, we've seen moments in time like this in our history, 2008, 2009, I would contrast that with the digital transformation of this $1 trillion restaurant industry that is a mighty and persistent tailwind that's been at our back for 17 years and will be at our back for many, many years to come, especially as restaurant brands are looking to lean into digital transformation for the very reasons that Peter just mentioned, getting more productive, getting more profitable, and at the same time, upleveling the guest experience. I think it's showing how those efforts that we're making are helping to get brands that have been sold and are showing up in bookings, actually deployed and live on the platform for their operators benefit and for the guest benefit, and obviously for OLAS benefit when I think about Diego and some of the things that he's focused on in the role of chief revenue officer, it really aligns with our commentary around the growth drivers of the business. So we are very focused on ARPU as a huge driver of growth, and that is about selling additional modules into existing restaurant customers who are asking us to play a larger role because we're a mission critical platform and we've become something of a digital transformation area to these brands."
}