{
    "symbol": "UNFI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-27 12:21:04",
    "content": " As we enter the second year of our Fuel the Future strategy, we remain focused on driving operational improvement to optimize the value of our scaled and diversified platform across to $140 billion addressable market that we're pursuing in our core business. Some of the drivers of this growth include the addition of new business from customers added in fiscal 2022 weâ\u0080\u0099ve yet to cycle, the continued growth of selling more products to existing customers, new customer wins, and strong growth within our services platform. Your line is open. And then as Sandy suggested we're focused on the growth opportunities first, we're going to look for those opportunities, we're going to look for where we can better service our customers, where we can invest in the growth of the business and then we will focus on the capital allocation between debt and return to shareholders. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And when we think about that guidance what we're thinking about is trying to balance inflation, the impact on fill rates, the labor market, new business wins, all of those aspects that we tried to bake into our guidance to try to come up with a number that we believe is reasonable given that economic backdrop, particularly given our desire to maintain that flexibility that Sandy mentioned, so that we can continue to serve the customer as best as possible. Your line is open. Your line is open. So from our perspective, it's just another tool that we can have in our capital allocation toolbox that allows us to think about ways to return value to shareholders after we've gone through, as Sandy mentioned earlier, growth opportunities and the focus there, customer service and those types of items, and then we get into debt reduction and capital allocation with the share buybacks."
}