{
    "symbol": "UNFI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-09 13:50:10",
    "content": " Continuing supply chain challenges are at the heart of the issues, which continues to create short and long term impacts on UNFI and our customers accelerating inflation, along with varying degrees of negative unit elasticity, lower inbound fill rates, increased fuel expense, labor shortages, increasing wages and increased use of third party labor to manage stress points are all impacts on our business and our customers businesses this past quarter. And good morning, everyone. On today's call, I'll provide further color on key drivers behind UNFI second quarter results, future growth, the trends and operating environment Sandy touched on that are impacting our business and industry. Sales for the quarter were $7.4 billion, a 7.5% increase over last year's Q2, bringing the two year stack to 14.6% and a 6% sequential increase over the year's first quarter. As for new business, we're realizing sales gains across every channel from new business wins achieved last year in fiscal ‘21 and over the last six months, our sales pipeline remains robust and we continue to be confident in our ability to onboard new customers based on our unmatched capabilities to help our customers be successful. Based on year-over-year unit sale increases, we estimate that roughly 40% of our top line sales growth in the quarter came from volume gains, including cross selling and new business with the remainder coming from inflation. And good morning, everyone. As Sandy and Chris discussed, this quarter's results included greater levels of overtime and third party labor to service our customers as well as higher fuel costs. Given our performance year-to-date, our momentum with new and existing customers and our belief that inflation will remain at elevated levels we are increasing our full year expectation for net sales to a new range of $28.2 billion to $28.7 billion, a $400 million increase to the top and bottom end of the range. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}