{
    "symbol": "LAND",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 12:08:06",
    "content": " This is David Gladstone, and welcome to the quarterly conference call for Gladstone Land. He's also the President of Side stone Administration, the administrator for all of our funds. Today's report may include forward-looking statements under the Securities Act of 1933, Securities Exchange Act of 1934, including those regarding our future performance. And many factors may cause our actual results to be materially different from any future results expressed or implied by these forward-looking statements including all risk factors in our Form 10-Q, 10-K and other documents that we file with the SEC. You can find them on our website, www.gladstoneland.com, specifically the Investors page or on the SEC's website, which is sec.gov. Now FFO is a non-GAAP accounting term, defined as net income, excluding the gains or losses from the sale of real estate and are impairment losses from property, plus depreciation and amortization of real estate assets. We may also discuss core FFO, which we generally define as FFO adjusted for certain nonrecurring revenues and expenses, and adjusted FFO, which further adjusts core FFO for certain noncash items, such as converting GAAP rents to normalized cash rents. And today's call is an overview of our results, so we ask that you review our press release and Form 10-Q, both issued yesterday for more detailed information. We currently have over 115,000 acres on 169 different farms, and we also have 45,000 acre feet of bank water. So, we're into the billions for gallons of water that we hold and is held underground. And together, those two are valued at a total of about $1.6 billion for both the land and the water. Our farms are in 15 different states and more importantly, they are in 29 different farming regions. We mentioned this past couple of calls, acquisition activity remains slow for us. But overall, our existing farmland portfolio continues to perform pretty much as expected, and we had another very strong quarter, as you'll hear from the rest of my presentation and certainly from Lewis, our CFO. And this third quarter that we're in, we acquired four venues in Washington State and Oregon. Overall, net cash yields to us on these investments is about 6.2%, and that's about what we've averaged overall long term. So, as I mentioned just a few minutes ago, we're going to go to the leases on these farms that contain certain provisions. Remember, this is not rocket science, so it's not a quick move in terms of rents. On the leasing front, since the beginning of the third quarter, we renewed six leases on farms in three different states. In total, these renewals are expected to result in an annual operating income increase of about $281,000 million or about 10% over that of the prior leases. So if we got -- every lease came up and got 10%, we'd be well ahead of the growth record that we're all looking at. This latest headline inflation number was 8.2%, and it's been over 8% now for the past seven months. And this is a category where the crops grown in our farms fall in, and that category is mostly crops that are grown on our farms and are sold in grocery stores, that's at-home kind of indication. We believe the increases in food prices will continue to outpace inflation itself, normal inflation numbers and should help mitigate the increases and input costs experienced by our farm operators. Some of the farmers did report delayed plantings because the so much water in the crop land, but the crop losses in some fields due to the amount of surface water produced by the hurricane was very light. While we all are hoping for winter, and it seems to be coming that way because it's raining out in California now, to relieve the drought in the West, we've been focused on increasing the water security of our current portfolio of assets. And we may want to buy some of those in order to build up the water delivery infrastructure that we have and replace older inefficient equipment and irrigation systems upgrades, all of these kind of improvements are things that we normally do anyway. So, we're just getting ahead of the curve by doing it early. Surface water supplies all over California have been in high demand, of course, and we're not immune to these effects. To date, we've not had any water deficiencies prevent any of our tenants from making their obligation that is the rent payments that they owe to us. Believe it or not, there could be an oversupply of almonds coupled with the increase in cost of water due to the decreasing supply of both groundwater and surface water, certain of our almond farmers are beginning to experience decreases in production that is they're harvesting less. The impact of the current drought has been somewhat exacerbated by the fact that it occurred so soon after the previous drought cycle, which ended in late 2016. So, previous wet cycles didn't have enough time to refill all of the reservoirs before the current drought cycle. We're just hopeful that the snow that's going on out there will put a lot of snow in the mountains, and that's what most of these farmers live off of in terms of water during the summers. Throughout any long-term investment in California, we know that we'll have both drought periods and wet periods, and we build those assumptions into our underwriting models that we use. In aggregate, it's about $1.3 million of late rent payments that are owed to us. Might be a little touchy for a couple of the almond growers, but I think we're going to be fine. Regarding our capital plans, as we announced in August, we amended the stock offering Series C preferred stock to reduce the offering size and shorten the duration of the offering. As amended, we expect to sell only about $10 million more under the offering after this week's close before the offering terminated at the end of the year. So, we're pretty much out of that Series C preferred stock and looking at what we might put in its place for going forward. It's difficult to put these proceeds to work that we've been getting from the Series C. So, we are having to work harder to get accretive deals done. We'll find something for us, but it's not the end of the world to take a break for a while and see how this economy is going to come around. We did not incur any new borrowings during the quarter, but we did repay about $17 million of loans that were scheduled to mature. On the equity side, since the beginning of the third quarter, we've raised net proceeds of about $75 million from sales of the Series C preferred stock and $5 million from sales of our common stock through the ATM program. First, I'll note that for the third quarter, we had net income of about $1.8 million and a net loss to common shareholders of $3.6 million or $0.074 per common share. On a quarter-over-quarter basis, adjusted FFO for the third quarter was approximately $7.2 million compared to $4.5 million in the second quarter. The primary driver behind the increase in AFFO was about $3 million of participation rents recorded during the current quarter versus only $20,000 in the previous quarter. This was partially offset by higher incentive fee by about $500,000 during the current quarter. Fixed base cash rents increased by about $877,000 or 4%. On the expense side, excluding reimbursable expenses and certain nonrecurring or noncash expenses, our core operating expenses increased by about $534,000 on a quarter-over-quarter basis. Total related party fees increased by about $629,000 during the current quarter, primarily driven by a $505,000 incentive fee earned during the current quarter versus no fee earned in the previous quarter. Property operating expenses remained relatively flat, while recurring G&A expenses decreased by about $78,000, and this was primarily due to costs related to annual shareholders meeting in the previous quarter. One note on expenses during the third quarter, we did write off about $800,000 of deferred and unallocated costs related to the Series C offering as a result of the amendment that reduced the offering size. Overall, these farms increased in value by about $17 million or 3.7% over their previous valuations from about a year ago. We saw a particularly strong appreciation in the values of our Florida farms, which saw an average increase of 11%. Also of note, the California farms we had reappraised increased by 2%. So despite the ongoing drought and water concerns across the state, we continue to see values of our farms increase. So as of September 30, our portfolio was valued at about $1.6 billion and all this value is supported by either third-party appraisals or the purchase prices. Base lean's updated valuations and including the fair value of our debt and our preferred stock, our net asset value per common share at September 30 was $16.56, which is up by about -- which is up by $0.96 from last quarter. Turning to liquidity, including availability on our lines of credit and other undrawn but committed notes, we currently have over $175 million of dry powder in addition to over $100 million of unpledged properties. And on a weighted average basis, these rates are fixed at 3.26% for another five-plus years. The increase in interest rates does impact our ability to finance new acquisitions and of course, plays a factor in our decision to repay versus refinance all maturing loans. However, with respect to our current debt load, we have experienced minimal impact from the recent rate increases. Regarding upcoming debt maturities, we have up $56 million coming due over the next 12 months. About $31 million of this number represents various loan maturities, and the properties collateralizing these loans have increased in value by a total of $13 million since their respective acquisitions. By removing those maturities, we only have about $25 million of amortizing principal payments coming due over the next 12 months, which is less than 4% of our current debt outstanding. Over the past 31 quarters, we've raised our common dividend 28x and that has resulted in an overall increase of more than 52% over this time period. But as mentioned, we're being much more cautious on our acquisition front. We believe that investing in farmland growing crops that contribute to a healthy lifestyle such as fruits and vegetables and nuts, follows the trend that we're seeing in the market today. Overall demand for prime farmland growing berries and vegetables remains stable to strong in almost all areas where our farms are located, particularly along the West Coast and including the California, Oregon, Washington. And not to be outdone, the ones in Florida are moving at very good paces as well in terms of values. Overall, farmland continues to perform well compared to other asset classes. I mentioned this almost every time the NCREIF Index and Farmland Index, which currently has about $14.9 billion worth of agricultural properties has averaged an annual return of about 12.6% per year over the past 20 years with no negative years during that period. And both of those, the S&P and the REIT index have had negative years over that same period of time versus zero for the Farmland Index. I mean, after all, it's farmland. Similar to gold, it's a hard asset. Farmland is just dirt, having an intrinsic value because there is a limited amount of good farm land, especially in the areas that we're in, like Florida and California. And it's being used up by urban developers, especially in California and Florida, where we have a lot of farms. And unlike gold, which is another alternate asset, it's an active investment with cash flows to investors. And we believe we're better than a bond fund because we keep increasing the dividends every year, which bond funds don't usually do. We expect inflation, particularly in the food section to continue to increase, and we expect values of underlying farmland to increase as a result. And so, I think we're in the right area. This quarter, that being in Q3, I think we had about 1/3 of our portfolio that was revalued. It's not exactly 25% each quarter, it varies. I think Q4 is a little bit lighter, closer to 18% to 20% of our portfolio value is being revalued in Q4. I'm looking that up right -- no, the debt piece was -- sorry, bear with me, $0.55 per share. And that would be -- for example, if we went to the -- one of the farm credit associations that would be the net effective rate after interest patronage is received. But Farmer Mac would probably be in similar rates and similar range in the 5.5%, 5.6% range for us right now. And then, David, how -- you mentioned that you're putting a pause on the Series C that, that sunsetting at year-end and that you'll figure out the equity down the road. Well, we'd love to continue the Series C. But as you know, about 60% of the money we use to buy a farm is from one of these farming debt banks are in that area. First of all, the increase in their debt that they use to arm such as money they need to do the kind of things to the farm that have to be done every beginning of every year and then at the end of every year. In addition to that, I don't know if anybody follows it, but all over the world, they've been closing plants that produce any of the chemicals that need to go into farming and especially fertilizer. So it's a very difficult time for farmers in terms of doing that, and they're passing that on to the consumer. And so, as we watch this adjustment, we don't want to get in the way of something that's going on out there in the marketplace. We've got some things that we'd love to close, but we've got to wait until we can get to a point where we can finance it in a way that's very accretive to us. There's some desire on the part of some of our people here to do things that are not accretive and lose a little money over the few years, but I don't want to do that. So until the banking community comes back and the rates go down, and I don't think there's any chance of that happening anytime soon. We're going to be slow rolling our increase in are -- all of the things that we do, but most importantly, in closing new deals. However, if you think about it, it's probably a good time to take a breather. And there's always something to do there, such as build some more infrastructure, and we do that on a regular basis. So, I think for us, it's a time to take note of all the changes that are going on. As you may remember, when we've talked about this, we would love to be buying farms and going into the farming business, but there's just not a chance to do that right now. And if you added that increase in the value of the farmland to the dividends that we're paying, this would be a great return for almost anybody who wants to put something in their portfolio and not have to worry about it. So as a result, our goal is to continue just to develop the land that we have and increase the income. It's a very unconventional time right now, and we've all enjoyed the last seven or eight years in which interest was very low and everything was fine. And now this is the moment of adjustment, and we'll see what the government does to slow down the amount of dollars that they're printing and using to continue the government, and we'll also see what happens to the food prices. I don't know if I answered what you're looking for, but that's where I am in thinking about the world. Well, as you probably know, we keep saying it, almonds are our problem child today and almost all of those are done in California. There's a few that are not in California, but the ones that we have problems with are in California, and I say problems. So, it's almonds, it's California, that's the commonality of the payments that we haven't received. And I have a lady sitting across me here that does collections, and she's good. We have all of the things that we love to have in the fourth quarter, which is all the fourth quarter extras come in and we accrued how much of that in this quarter. $3 million of it in this quarter, and I'm hopeful that we get another $3 million or $4 million in next quarter in this quarter as well, this quarter, meaning the third quarter, we did $3 million in the fourth quarter. And so of course, when you get not all pistachio from the trees, it's been very expensive for those. And a lot of it goes to places like Spain and France in those areas as well as India is massive eater of almonds, and they've had their own problems inside of that country. So I think over time, Ed, this is going to be an area that will cure itself at some point in time as all of these almonds are passed on through. Strawberries, you've got to get them to somebody's mouth in 14 days. Right now, it's touch and go, and we've had them come a little slower to us in terms of payments. And so, we'll work through this little bulge that we have in the production amount of almonds on the one hand and payments on the other. There are a few farms that we have -- that we're working through, I guess, some water issues. But as David said, they're not on any row crops and they're not on permanent crops that we own, and that was the reason for the change in the language in the press release. So, that's why we changed that language to what it is. Now that is the -- that's based on the crop that was harvested last year, the 2021 crop. Pricing is down a little bit, but the increase in yields has -- based on the information we've gathered so far, the increase in yields has more than offset the slight decrease -- the decrease in price from the prior year. So that, coupled with a couple of additional farms that came online last year, which again leads is what results in the payments this year is what's leading to the right now, the expected increase in overall participation rents this year. It's kind of too early to say that right now, but we're still collecting a -- still in the process of seeing where yields are falling this year. You look at, John, the way things work out, it looks like every farmer believes that their farm, which their father or grandfather started is worth $1 billion. So, we have a lot of money tied up in water, but that's insurance. If we need it, we can use it I think the biggest thing for us, John, is just trying to figure out where we're going to land in terms of this economy and what are some stabilized price is going to look like. And it's better for us to not guess at that, but it happened and then by farms. In fact, the recession has probably sent more people to go out and find out how much of their farms are worth. And the real question is, can we make them work for us in terms of accretion to our shareholders so we can keep increasing the dividend. I think we will, but there's no guarantees in life. So John, it's just one of those undefined times when you can't make a bet work, you probably get the same kind of risk reward if you just went to Las Vegas and put a number amount of money on red and see whether you win or not. But it's better for us to wait and not put a lot of money out in times that are very, very difficult to predict. I think right now that if you were trying to sell some of the nut farms, you couldn't get nearly as much as you'd hope to get if you have a nut farmer. On the other end, if you were a strawberry grower or blueberries or any of the vegetables, you can continue to push it up because the -- all of these places from Safeway and Giant and all of those grocery stores are willing to pay up because they need those. And as a result, don't really have as much problems with water as those that are in the valley, which is most of the tree crops. I think the tree crops will sort out this year and next year's crop, which will be -- or '24 will be really dramatically stronger than the ones that we're in today. Right now, that's a majority of crop share lease, and we expect that structure to remain in place on a relatively small farm in Nebraska. Beyond that, we're just now -- for the expirations that are starting in the middle to the latter half of next year, we're kind of just now starting up negotiations with the tenants. We think we'll see increases on most, if not all of them, but a little bit too early to peg where -- what kind of range we think that increase will fall in. So, there's juxtaposition between us and our tenant that when we're talking about participation rents. And so I don't know, we like participation rents as long as we get enough during the year to pay because participation rents, gets you the upside that you don't normally get. For us, it won't impact -- well, I can't say it won't because the patronage, of course, is not guaranteed, but we do not expect it to impact the amount we get back. What would impact it is -- as we've said, we repaid about $16 million or $17 million of loans. So, the patronage for those loans, we will not give back since we're not paying interest into them, of course. And if they come on hard times or they have larger reserves in their portfolio than that, of course, could eat into the patronage that we get. But outside of that guesswork, we wouldn't expect any change in the percentage of interest that we pay coming back to us. We wanted more questions, but thanks a lot for calling in, and we'll see you next quarter."
}