{
    "symbol": "AXSM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 14:44:08",
    "content": " These statements may include statements regarding among other things, the efficacy, safety and intended utilization of our investigational agents, our clinical and non-clinical plans, our plans to present or report additional data, the anticipated conduct and the source of future clinical trials, regulatory plans, future research and development plans, our commercial plans regarding Sunosi, Auvelity and our pipeline products, revenue projections and possible intended use of cash and investments. Now with two differentiated products, Auvelity and Sunosi commercialized, encouraging early launch metrics of Auvelity, abroad and advancing late-stage pipeline, and a strong financial position, Axsome is well positioned to continue to deliver significant value to patients and shareholders. Total revenue in the fourth quarter of '22 was $24.4 million, consisting of net sales of our two commercialized products of Auvelity and Sunosi. The increases for the fourth quarter and full year were primarily related to commercial activities for Sunosi and Auvelity, including sales force onboarding, marketing spend as well as higher non-cash stock compensation expense. Sunosi is the only branded therapy available for patients who suffer from EDS and OSA and we expect increased and enhanced promotional and disease education efforts to drive market share growth for the product in 2023 in the U.S. With recently announced licensing of ex-U.S. marketing rights for Sunosi to Pharmanovia, we are well positioned to increase the availability of this important treatment to patients worldwide. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Obviously, with the launch of Auvelity and Sunosi being acquired in the second quarter of this year, we'll have a full year of SG&A expenses and Q4 being almost a full quarter, I think you can expect view that as a proxy and potentially a modest growth from -- on the SG&A piece as it relates to thinking about 2023 on a quarterly basis. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions."
}