{
    "symbol": "CPRX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 11:43:20",
    "content": " As we delivered record net product revenue of $43 million, a 42.5% increase, compared to Q1 of 2021 and ended the quarter with $198 million in cash and short-term investments. Net income before income taxes for Q1 of 2022 was $17.5 million, a 76.7% increase, compared to $9.9 million for Q1 of 2021. As a result of the outstanding performance for the quarter, we are reiterating our full-year 2022 total revenue guidance of $195 million to $205 million, representing a 38% to 45% increase in total revenues, compared to 2021. As we enter the second quarter with continued momentum, we expect to sustain the organic growth rate driven by newly diagnosed patients and the considerable number of patients diagnosed with LEMS, who are not yet on Firdapse. Q1 Firdapse, net sales were $43 million, which represents 13% growth quarter-over-quarter and 42% growth quarter versus the same quarter last year. By the end of March, over 90% of adult LEMS patients, we estimated to have been on Ruzurgi have been successfully transitioned to Firdapse with the remaining balance expected the transition by the end of the second quarter. We expect considerable organic growth each quarter in 2022, primarily driven by new patient enrollments of already diagnosed LEMS patients, not yet on Firdapse in the significant number of patients that are unfortunately misdiagnosed or undiagnosed. Our Catalyst Pathways patient services did a tremendous job in Q1, not only supporting patients transitioning from Ruzurgi, but also providing financial and educational resources to new and existing adult LEMS patients, caregivers and healthcare professionals. Our objectives for 2022 are straightforward, which are to continue to increase the number of adult LEMS patients being treated with Firdapse, expand the commercial potential Firdapse and identify synergistic opportunities in the rare disease space. Our total net revenue for Q1 ‘22 principally from Firdapse product revenue was $43.1 million, a 42.7% increase, when compared to total revenues of $30.2 million for Q1, ‘21. We reported GAAP first quarter 2022 net income of $13.2 million or $0.13 per basic share and $0.12 per diluted share, an increase of 72.8% year-over-year, compared to the first quarter 2021 GAAP net income of $7.7 million or $0.07 per basic and diluted share. Further in the first quarter of 2022, we recorded an increase of $2.1 million in expense relating to our commitment to make charitable donations to 501(c)(3) foundation that support LEMS patient programs. Cost of sales expenses were approximately $5.9 million in Q1 ’22, compared to $4.7 million in Q1 ’21, this represents 22.9% of total operating costs in both periods. Thank you very much, sir. Thank you very much, sir."
}