{
    "symbol": "CPRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 11:59:04",
    "content": " Our full year 2022 total revenues were $214 million, representing a 52% year-over-year increase compared to $141 million in total revenue for 2021. Fourth quarter total net revenues were $61 million, a 59% increase compared to $38 million in 2021. We reported GAAP net income of $83 million for the full year of 2022 or $0.80 per basic share and $0.75 per diluted share, a 110% increase compared to $39 million or $0.38 per share basic and $0.37 per share diluted. In 2021, further non-GAAP net income for the full year 2022 was $114 million or $1.10 per basic and $1.02 per diluted share, a 93% increase compared to $59 million... . Fourth quarter total net revenues were $61 million, a 59% increase compared to $38 million in 2021. We reported GAAP net income of $83 million for the full year of 2022 or $0.80 per basic share and $0.75 per diluted share, a 110% increase compared to $39 million or $0.38 per basic share and $0.37 per diluted share in 2021. Further non-GAAP net income for the full year 2022 was $114 million or $1.10 per basic share and $1.02 per diluted share, a 93% increase compared to $59 million or $0.57 per basic share and $0.55 per diluted share for the full year 2021. With another year of expected growth in front of us, we have recently provided the market with our forecast of full year 2023 total net revenues of between $375 million and $385 million, representing a 75% to 80% increase in total net revenue compared to 2022. We are very pleased with the full year FIRDAPSE net sales of $214 million, representing a 52% increase year-over-year, driven by consecutive quarterly FIRDAPSE net product sales growth. Demonstrated operational excellence positions Catalysts well to deliver the forecast combined net revenues of $375 million to $385 million in 2023, and leverage the 45% overlap in FYCOMPA and FIRDAPSE physician call points. We reported GAAP net income for 2022 of $83.1 million or $0.80 per basic and $0.75 per diluted share, a 110% increase year-over-year, compared to 2022 -- GAAP net income of $39.5 million or $0. Total net revenue for 2022, principally from FIRDAPSE's first revenue net was $214.2 million, a 52% increase year-over-year when compared to total net revenue of $140.8 million for 2021. Non-GAAP net income for 2022 was $113.1 million or $1.10 per basic and $1.02 per diluted share, which excludes GAAP net income of $83.1 million, stock based compensation expense of $7.9 million, depreciation of $141,000, amortization of $1.1 million, and an income tax provision of $21.6 million. This compares to non-GAAP net income for 2021 of $58.9 million or $0.57 per basic and $0.55 per diluted share, which excludes from GAAP net income of $39.5 million, stock-based compensation expense of $6.1 million, depreciation of $192,000 and an income tax provision of $13.2 million. Research and development expenses were $19.8 million in 2022 compared to $16.9 million in 2021, an increase of $2.9 million in R&D was principally related to the acquisition of $4.1 million of RUZURGI inventory, fully recorded to expense in the third quarter of 2022, offset by an overall decrease in R&D expense. The increase of $8.6 million when compared to the prior year is due to, among other changes, increases in compensation and benefit expenses as we continue to grow our business, additional charitable contributions to  supporting LEMS patients and amortization of intangibles, acquiring connection with the RUZURGI acquisition in July of 2022."
}