{
    "symbol": "CIDM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-15 16:57:02",
    "content": " I'd also like to reiterate, as Chris said, that we operate a portfolio business model in media technology, content and streaming that provides multiple revenue streams to fuel this rapid growth. While our streaming and digital content business continues to rapidly grow and become an ever larger percentage of our total business, we are also considering breaking out cinema equipment and our non-digital based distribution business into a legacy business line next fiscal year to highlight more clearly our key growth drivers. These include targeting at least 50% annual revenue growth in streaming and digital, growing revenue to $150 million through organic and acquired revenue, increasing monthly viewers to over 40 million, growing engagement to 1 billion connected TV minutes from 0.5 billion per month and growing the content library to 75,000 titles. Third, we continue to focus on expanding the distribution of our services adding 90 new distribution outlets for our portfolio in the last quarter alone, including new distribution of channels with Comcast, Dish Network, DirecTV, ViacomCBS's PlutoTV, IMDBtv, Samsung TV Plus, LG channels and more. So we think this is a really good time for us to continue to add new channels to the portfolio, but with a real focus on learning what our – I've listed a lot of great partners, really learning what is going to drive their business because ultimately, in addition to serving consumers, we're also trying to build great channel for those partners. Well, look – and I think as we've gone through many quarters over the last year talking about this, one of the things that I'm always impressed by is just when I think the team's ability to bring even more revenue growth out of the inventory, they go and they do even more. As I think we've mentioned on previous calls, the biggest challenge with soccer is unlike football that's kind of had 50, 60 years to kind of shape its cadence to work in the North American TV advertising market, football does not have the same sort of pauses and breaks every – sometimes even maddeningly that happens when you're watching an NFL game. We have a unique strategy and portfolio business model in technology, entertainment, content and streaming that provides multiple revenue streams in a broad portfolio of enthusiast streaming channels to fuel this rapid growth."
}