{
    "symbol": "UDMY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 21:20:02",
    "content": " Since nearly 60% of our revenue is from outside of the US, the year-over-year increase in total revenue includes a negative impact of 4 percentage points from changes in FX rates in both Q4 and the full year. Although segment revenue was down year-over-year in Q4, driven by the negative impact of FX, Udemy's marketplace continues to produce a steady source of organic leads and serves as a powerful content creation engine that provides fresh, high quality courses that ultimately feed the Udemy's business content library. Gross margin was 57%, a 320 basis point improvement from Q4 of 2021, driven by the continued revenue mix shift to Udemy Business since content cost as a percent of revenue are lower for that segment. We saw a bit of a deceleration in ARR growth, primarily due to the reasons Greg outlined earlier but ended the quarter with nearly 14,000 Udemy's business customers, up 32% from a year ago. Those trends impacted our customer retention, resulting in Q4 Udemy's business net dollar retention rate of 115%, or a 200 basis point decrease from the prior quarter. With all that in mind, we expect Q1 revenue to be between $168 million and $172 million, with Udemy's business segment revenue as a percentage of total revenue remaining relatively flat with the prior quarter due to our Q4 2022 consumer promotion cycle and revenue recognition. For the rest of the year, while Udemy Businessâ\u0080\u0099 growth may slow a bit, we believe that we can sustain mid 30s year-over-year growth each quarter, including the negative effect of FX and continued macroeconomic pressure. Taking all of that into consideration, for the full year 2023, we expect revenue to be between $700 million and $730 million or 14% year-over-year growth at the midpoint, including an estimated 3 percentage point negative impact from FX. With that said, we're still projecting mid-30s growth and exit of nearly $500 million in ARR with 60% of our revenue being generated by the Udemy Business side of the house. The other thing I would add, and we've spoken about this a little bit as well, is continued traction that we see in Udemy Business Pro and our cohort based leadership offering, that's additional growth that we can take advantage of within existing customers and new customers."
}