{
    "symbol": "UDMY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 20:04:02",
    "content": " We kicked off the year with a strong first quarter as businesses and consumers alike continue to choose Udemy to provide flexible, expansive and effective skill development to empower organizations and individuals. This was driven by outstanding Udemy Business performance in Q1, which grew 77% versus the prior year with over 11,600 total Udemy Business customers and $280 million in ARR, up 80% from the prior year. Our yearly business net revenue retention this quarter was 120%, up from 118% in the prior quarter as we continue to see massive success in growth in our land-and-expand strategy. In 2021, 61% of workers placed through Randstad's technology organization were active Udemy Business learners or course completers. As we look into some of the deal highlights this quarter, I'm excited to note that together with our end-market partner, Sanjieke, Udemy Business has closed our first deals in the People's Republic of China and launched a new website in management along with an iOS app for mobile learning. Adding to our wins in APAC, we achieved nearly $500,000 in ARR in our first quarter selling Udemy Business in South Korea through our partner, Woongjin ThinkBig, that we announced last quarter. While we do expect Udemy Business to grow larger than our consumer business in Q3, we are truly just getting started on the B2B opportunity for Udemy, and we believe the global market will only serve to accelerate our top line Udemy Business growth over the long term. To that end, this quarter, we launched 3 new assessments and 19 new labs within Udemy Business Pro and launched a Learning Paths API that allows learners to bring their curated Udemy Business learning paths directly into their LMS or internal sites to help drive effective learning. The beauty of our model is that as we grow content on the Udemy marketplace and engage more and more new learners, Udemy Business' SaaS-based model continues to benefit with the broadest and most relevant content in what is still a very large and underpenetrated market. I'm especially encouraged by our exceptional Udemy Business ARR growth, up 80% versus the prior year as well as acceleration in Udemy Business customer growth, up 49% versus the prior year. Udemy Business continues to serve as a key growth lever for us as we see healthy new logos and expansion among existing customers, wins across a wide range of industry verticals and good momentum in international growth. Udemy Business revenue was $64.9 million, up 77% from the prior year, continuing to demonstrate our strong growth at this scale. Q1 gross profit was $87.4 million, up 31% year-over-year, driven by Udemy Business. Udemy Business continued its robust growth with Q1 revenue of $64.9 million, up 77% year-over-year. Udemy Business gross profit was $42.7 million or 66% of Udemy Business revenue, which represents a roughly 120 basis point increase year-over-year. As mentioned earlier, we continue to expect Udemy Business to experience strong growth, becoming the majority of our revenue in Q3 of this year. Of note, our full year revenue, segment revenue and adjusted EBITDA margin guidance remains unchanged at $610 million to $640 million in revenue, with the Udemy Business at $300 million to $310 million in revenue and consumer at $310 million to $330 million in revenue. To summarize, our strong Q1 results illustrate 3 themes driving Udemy's strong performance: first, strong demand, solid execution and continued top line growth; second, unprecedented tailwinds accelerating the workplace shift to digital upskiling and learning that drive our TAM; and third, the continued health of Udemy's consumer marketplace, which fuels the growth of Udemy Business."
}