{
    "symbol": "BRKR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 13:52:10",
    "content": " If you go to Slide 4, you can see that Bruker's solid 10.5% organic revenue growth in the first quarter and even stronger organic bookings growth represent a good performance in light of challenges with a war in Ukraine and lockdowns in China. In summary, the first quarter of 2022 was a quarter with broad-based demand strength across virtually all Bruker businesses with double-digit organic bookings growth, as well as further investments in Project Accelerate 2.0, plus investments in our recent acquisitions in additional proteomics, biopharma and applied markets capabilities in the first quarter as well as in April. For the first quarter of 2022, the CALID Group revenue of $203 million increased in the low double-digit percentage with strong growth in microbiology and molecular spectroscopy. In the first quarter of 2022, Bruker's reported revenue increased 7.3% to approximately $595 million which reflects an organic revenue increase of 10.5% year-over-year. Compared to the first quarter 2021, BioSpin’s first quarter 2022 organic revenue grew in the low single-digit percentage against a difficult comparison due to European gigahertz-class NMR mix headwinds. First quarter 2022 BSI systems revenue increased in the high single-digit range organically, while our BSI aftermarket revenue grew in the low teens organically compared to the first quarter 2021. Non-GAAP gross margin of 52.7% increased 140 basis points from 51.3% in the first quarter 2021, principally benefiting from operating leverage from higher volume revenue mix as our Project Accelerate initiatives performed well, partially offset by supply chain and logistics challenges. First quarter 2022 non-GAAP operating margin of 19.5% was 110 basis points higher than the 18.4% in the first quarter 2021 driven by growth margin expansion, partially offset by increased sales and marketing investments as a percentage of revenue to support the growth of our higher margin products. BioSpin’s operating margin expansion in the first quarter 2022 had a year-over-year headwind from two European gigahertz-class systems in the first quarter 2021 revenue, which was offset by a gain on the sale of BioSpin property. Given the headwind from lockdowns in China, we expect that our second quarter 2022 operating expense ramp for Bruker will moderately outpace our revenue ramp and result in operating margins declining slightly sequentially from the first quarter 2022 before expanding sequentially in the second half of fiscal year 2022 versus the first half. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}