{
    "symbol": "BRKR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:13:14",
    "content": " In fiscal year 2022, Bruker achieved solid operating and financial improvements with 10% organic revenue growth, 150 basis points gross margin expansion and 11% non-GAAP EPS growth all while all with a non-GAAP return on invested capital above 20%. Turning now to slide 4, Brukerâ\u0080\u0099s solid 8.9% year-over-year organic revenue growth in the fourth quarter capped off another strong year for the company. Our revenues increased by $113 million year-over-year, or by 4.7% to $2.53 billion on an organic basis fiscal Year 2022 revenues grew 10.2% year-over-year. In fiscal year 2022, we delivered double digit organic revenue growth 150 bps year-over-year gross margin expansion, 60 bps year-over-year operating margin expansion and double-digit percentage non-GAAP EPS growth. Finally, we're also pleased with our 7% year-over-year, non-GAAP EBITDA growth bringing 2022 non-GAAP EBITDA to $547.5 million and the related non-GAAP EBITDA margin up 40 bps to 21.6%. In 2022, BioSpin Group revenue grew in the high single digits percentage year-over-year to $697.7 million with strong growth in its services and support revenues as well as strong growth in preclinical imaging and a notable contribution from our biopharma process analytical technology software acquisition Optimal. Moving on for the full year 2022, CALID Group revenues increased in the high single digit percentage to $822 million with continued growth in our life science mass spectrometry business and notable strength in proteomics applications and our timsTOF portfolio with now more than 600 units installed in customer labs. But our recurring revenue has advanced from the mid-20s percentage to 30% as you see in the lower left, and our geographic balance has really changed dramatically with fast growth particularly in the Americas, to where Americas and EMEA are at parity and about 33% and very, very similar to our broader APAC, South Asia revenue, which is about 34% of Brukerâ\u0080\u0099s total global revenue, also quite a different picture than from a few years ago. Starting in slide 12, in the fourth quarter of 2022, Brukerâ\u0080\u0099s reported revenue increased 3.6% to approximately $708 million, which reflects an organic revenue increase of 8.9% year-over-year. Our fourth quarter 2022 non-GAAP operating income grew 3.5% year-over-year, with the fourth quarter â\u0080\u009822 non-GAAP operating margins about flat year-over-year at 21%. Geographically and on an organic basis in the fourth quarter of 2022, our European revenue is down mid-single digit percentage year-over-year, Americas grew in the high single digit percentage range, and the APAC region grew in the 20% range year-over-year. Slide 14 shows our fourth quarter â\u0080\u009822 P&L performance on -- fourth quarter â\u0080\u009822 non-GAAP gross margin of 52.6% increased to 140 basis points from 51.2% in the fourth quarter of â\u0080\u009921 due to increased capacity utilization, favorable revenue mix and volume leverage. Fourth quarter â\u0080\u009822 non-GAAP operating expenses were up 8.2% compared to the fourth quarter of 2021 and reflect the continuing acceleration of R&D and Commercial Investments in Project Accelerate 2.0, including in proteomics and spatial biology, in addition to increased costs related to inflation. For the full year, gross margin expanded 150 basis points to 52.6% reflecting higher revenue, volume leverage and more favorable mix from Project Accelerate 2.0 while operating margins grew 60 basis points to 20.0% for many of the same reasons. Our outlook for 2023 includes, we are now guiding to organic revenue growth of 8% to 10% year-over-year, we estimate a foreign currency tailwind of about 1.5% with acquisitions also contributing about 1.5% to growth."
}