{
    "symbol": "BRKR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 23:31:02",
    "content": " Turning to our slide 4, in the second quarter of 2022, Bruker delivered robust bookings growth with organic bookings growth again outpacing organic revenue growth. Bruker's second quarter 2022 reported revenues increased 3.1% year-over-year to $588.4 million, despite a strong FX headwind of minus 7.3%. Our second quarter 2022 non-GAAP gross margin increased 180 bps year-over-year to 51.8%, while non-GAAP operating margin was 16.6%, a decrease of 70 bps year-over-year. In summary, the second quarter of 2022 again saw strong demand for our differentiated products as we ramped our OpEx investments in Project Accelerate 2.0 to capitalize on the major opportunities in proteomics and spatial biology as well as in biopharma, applied markets, infectious disease diagnostics, cancer research and semiconductor tools. For the first half of 2022, the CALID Group revenue or CALID Group revenue of $394 million increased in the high single-digit percentage with strong growth in life science mass spectrometry and microbiology aftermarket, but also with the supply chain delays slowing revenue execution. In the second quarter of 2022, Bruker's reported revenue increased 3.1% to approximately $588 million, which reflects an organic revenue increase of 8.8% year-over-year. On a non-GAAP basis, Q2 2022 EPS was $0.45 per share, an increase of 2.3% from the $0.44 in the second quarter of 2021. We used $44.4 million of operating cash in the second quarter of 2022, largely to build inventories for our planned revenue ramp in the second half of the year as well as to protect against supply chain risks. Compared to the second quarter of 2021, BioSpin's second quarter organic revenue for 2022 grew in the low double-digits percentage and benefited from revenue recognition of one, 1.2 gigahertz system in the second quarter of 2022, where there wasn't one in the second quarter of 2021. Q2 2022 BSI Systems and aftermarket revenue both increased in the high single-digit percentage range organically, compared to the second quarter of 2021. 2022 non-GAAP operating margin of 16.6% was 70 basis points lower than the 17.3% margin delivered in the second quarter of 2021, as our gross margin expansion was more than offset by increased sales and marketing investments to invest in higher-growth, higher-margin Project Accelerate 2.0 initiatives. As expected and noted in our first quarter call, in the second quarter of 2022, our sales and marketing OpEx ramp outpaced our revenue ramp, particularly due to supply chain delays. And finally, Q2 2022 non-GAAP EPS of $0.45 was up 2.3% compared to the second quarter of 2021. Given the strength in revenue and bookings growth in the first half of 2022 and our record backlog, we're maintaining our guidance for high single-digit organic revenue growth for the full year 2022, while reducing our outlook for reported revenue growth due to a stronger foreign exchange headwind. To give you some color on the third quarter of 2022, we expect supply chain and logistics delays to impact our third quarter with mid-single digits year-over-year organic revenue growth. On non-GAAP EPS, we do not expect to repeat the unusual tax favorability of the third quarter 2021 and anticipate third quarter 2022 non-GAAP EPS to be down year-over-year, but up sequentially from the second quarter 2022 by 10% to 20%. As you've just heard, this does not change our full year 2022 outlook for organic revenue growth or non-GAAP EPS, as we expect to catch up in the fourth quarter of 2022. Sure, so I think generally speaking, we -- as you may recall, Josh, we communicated in the first quarter earnings call that we were expecting to have our OpEx, for example, outpace our revenue in the second quarter, and that's essentially how it played out."
}