{
    "symbol": "FLXS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-26 11:38:05",
    "content": " From a profit perspective, we returned the company to profitable growth in the third quarter, delivering operating income of 4.1% as a percentage of sales, net income of $5.8 million and earnings per diluted share of $0.82. Profit performance was also supported by strong SG&A spending controls, as third quarter SG&A expense dropped to 11.6% as a percentage of sales, the lowest quarter of the fiscal year. Moving to the balance sheet and cash flows, the company ended the quarter with a cash balance of $3.4 million and working capital of $138.4 million, which represents a reduction of $32.7 million during the quarter, largely driven by a $24.9 million decrease in inventory. The strong cash flow also enabled us to fund $18.3 million of share repurchases in the period, which reduced our outstanding share count by 13.7% versus the prior quarter. Lastly, our sales guidance range is slightly larger this quarter than in past quarters, as we are expecting a large amount of incoming containers of product in June that is currently in our backlog which may either shift to customers in June or July depending on supply chain conditions and the timing of when we receive the product. Regarding profitability, while there is still much uncertainty on cost inflation near term, we are projecting operating income as a percent of sales in the range of 3.5% to 4.5% which is relatively consistent with third quarter results. Compared to the third quarter, we expect gross margins to improve to 16% to 17% in the fourth quarter driven by continued reductions in ancillary charges as well as additional price realization. Regarding our cash flow outlook, working capital is expected to be a source of cash flow in the fourth quarter as we anticipate inventories to decline another $10 million to $15 million in the period. Even though consumer demand for furniture is expected to moderate near term compared to the extraordinary high levels from a year ago, we will continue to pursue new sources of growth, including new customers and products."
}