{
    "symbol": "UFPI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 23:20:04",
    "content": " Consistent with our discussion last quarter, organic unit growth declined 4% due to capacity constraints, and as we continue to be selective in the business we take in order to focus on higher margin value added products. The components of our changing organic unit sales includes market share gains associated with a $36 million in sales to new customers, 18 million of sales to new locations of existing customers and 22 million of new product sales demonstrating the balance of organic growth channels. Finally, our sales to the construction segment increased 41% consisting of a 26% increase in selling prices, 3% growth due to the transfer of business from retail,11% organic unit growth and a 1% contribution from acquisitions. Moving down the income statement, our first quarter gross profits increased by $192 million or 67% and significantly outpaced our 10% increase in unit sales as our profit per unit improved. Besides acquisitions, which contributed $2 million to the increase, value based selling and favorable changes in product mix were the primary drivers for the increase in gross profits. Our concrete forming business unit increased its gross profit by $8.5 million, which includes $3.8 million as a result of the transparency of sales from retail. Sequentially, our SG&A increased from $178 million in Q4 to $220 million in Q1, primarily due to bonus expense as a result of an increase in our pre bonus operating profit, wages and benefits and sales incentives driven by an increase in our gross profits. Our cash flows used in operations for the quarter was $248 million and consisted of net earnings and non-cash expenses totaling $228 million compared to $128 million last year, and the $476 million increase in net working capital since the end of last year, compared to a $325 million increase in the prior year. But the point of the question, I mean, I know optically lumber pricing was up, that's going to help drive a higher gross margin, but I didn't know if it was more a an increasing capacity utilization, or some of this pricing rationalization that you guys have done in industrial and construction to drive such a, I mean, I think the highest gross margin quarterly gross margin you guys have had in the last six or seven years."
}