{
    "symbol": "UFPI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 22:09:07",
    "content": " As a result, we expect to invest up to $100 million over the next several years to find more new and unique products and develop a long term robust pipeline, which will deliver results over a three to seven year period from the time of investment. Our consolidated results this quarter are highlighted by a 3% unit sales growth including 2% organic over record volumes last year 22% adjusted EBITDA growth, EBITDA margin expansion of 130 basis points to 11% a trailing 12 month return on invested capital of 29% and a strong balance sheet with net debt to trailing 12 month EBITDA less than 0.2 times and liquidity over 1.1 billion. Consistent with our discussion last quarter, organic unit growth was flat due to capacity constraints, including the availability of labor and long lead times on equipment as we continue to be selective in the business we take in order to focus on higher margin value added products. By segment constructions gross profit increased by 93 million or 69%, led by a $73 million increase in site build an $11 million increase in factory built and an $8 million increase in our commercial business unit. Industrials gross profit increased by 28 million or 21%, primarily due to our value added selling initiative, and more favorable changes in product mix, including new products. Looking forward, we anticipate converting the $385 million increase in net working capital to cash during the back half of the year assuming lumber prices remain at those normalized levels and our business follows a more normal seasonal pattern. Specifically, our board just approved another quarterly dividend of $0.25 a share representing a year-over-year increase of 67% reflecting confidence in our future business network. Dropping then in June and this year the prices started out more elevated and then and then declined, obviously, through the quarter spending, the timing of sales and the timing of the market movements is probably not giving us cleaner look at that as is in the past and the business does become a little less weighted toward lumber, the more we accomplish in growing the other value added parts of our business and do more value added just generally means more fixed pricing. We lost $25 million in operating profit, I think, which is something Iâ\u0080\u0099ve never seen before, but thatâ\u0080\u0099s what occurred last year, because that drop in the market occurred in July and in August and we were selling into a dead down market for two straight months."
}