{
    "symbol": "ULBI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 13:52:13",
    "content": " For the first quarter of 2022, strong demand drove our Battery & Energy Products' medical revenues up 9%, and oil and gas revenues up 20% year-over-year, organically growing our Battery & Energy Products business, and when combined with the revenue boost from our Excell Battery Group acquisition, more than off set continued supply chain-impacted government defense revenues in both Battery & Energy Products and Communications Systems. Revenues from our Battery & Energy Products segment were $29.2 million, compared to $22.1 million last year, an increase of 31.8% attributable to Excell sales of $6.4 million and $2.5 million or 17.2% increase in commercial sales, partially offset by a $1.9 million or 24.1% decrease in government defense sales. The increase in commercial sales excluding Excell consisted of a $1.1 million or 30.5% increase in industrial end market sales, a $800,000 or 20% increase in SWE's oil and gas market sales, and a $600,000 or 8.5% increase in medical battery sales. The backlog for our Battery & Energy Products business of $82.9 million, the highest in our history, includes $66.2 million requested for shipping in 2022, representing an increase of $14.3 million over the comparable amount at year-end 2021. The sales split between commercial and government defense for our battery business was 80/20, compared to 65/35 for the 2021 first quarter, and the domestic to international split was 50/50 compared to 57/43 last year, accentuating both the delays in U.S. government defense sales and the continued success of our global revenue diversification strategy. Revenues from our Communications Systems segment were $1.2 million, compared to $3.9 million last year, a decrease of 68.3%, reflecting shipments delayed to future periods due to increased lead times on components from suppliers, and the timing of orders placed by our customers. Turning to our solid balance sheet, to proactively manage our supply chain, reduce the impact of potential component price increases, and optimize our position to service our rising backlog, we increased inventory by $3.2 million or 9.6%, compared to year-end 2021. So, it -- as Mike said, it's this big 45% increase, but a lot of it is just either new products that are in the process of transitioning or have transitioned to high-volume manufacturing, and I would say that the majority is ongoing products, a handful of products that are in the process of transitioning, which includes some of the military batteries, some of the public safety batteries, and as Mike had mentioned, are the $2 million order that we received for the medical carts."
}