{
    "symbol": "NTZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-10-03 13:04:03",
    "content": " As a reminder, interested persons can join this conference call live via telephone by dialing in the following number: (+1) 412-717-9633, then passcode 39252103#. Following the introduction, weâ\u0080\u0099ll conduct a question-and-answer session, instructions will be provided at that time for you to queue for questions. Joining us on todayâ\u0080\u0099s call are Mr. Antonio Achille, Natuzziâ\u0080\u0099s Chief Executive Officer; Mr. Jason Camp, President of Natuzzi Americas; Piero Direnzo, Investor Relations; and Mr. Pasquale Natuzzi would join us in a few minutes. As a reminder, today's call is being recorded. Before proceeding, we would like to advise our listeners that our discussion today could contain certain statements that constitute forward-looking statements under the United States Securities Laws. Obviously, actual results may differ materially from those in the forward-looking statements because of risks and uncertainties that can affect our results of operations and financial condition. Now, I would like to turn the call over to the company's Chief Executive Officer. So as usual, let me start sharing a bit what has been the quarter results. As you've seen from our press release, we closed the quarter on a positive note, both in terms of sales, which were high single digit above 2021, that as you know has been a very strong year for the industry as well for Natuzzi. So, having a  , which closed 7.8 on first half, I believe, has been a good result. And of course, we are very much higher than  , which has been the last year, our normal condition for the market before COVID. We will be commenting more in detail, but our branded business now represent 90%. We are on a journey to become a brand retailer and the branded business now is more than 90%, sorry, overall turnover. We spell out that in comparing this figure to 2021, you need to take into account the one-off measure that were still in place because of COVID that accounted 1.5 million in 2021. So, in other words, the operating profit of 1.1 million for the second quarter compared to 0.1 operating of 2021, once the official number is netted by the one-off measures. We continue paying a significant attention to cash, also given the uncertain times every business is running through. Our cash position is close to 60 million, roughly to the double that we need to manage our  . They remain not only for us, but I would say for the full â\u0080\u0093 for the whole furniture industry and I would say for the whole economy quite challenging because of multiple factors. In fact, last week's, we have seen a trend less positive than what has been in the start of the year, and we are taking and I will discuss later both the top line measure and cost measure to ensure that these difficult condition are not impacting our financial and our long-term plan. Your line is now live. Obviously, we're in unprecedented times with â\u0080\u0093 in the FX markets globally. So, let me start from the last part of your question. When we look at the buying is predominantly in dollars, because some of our â\u0080\u0093 letâ\u0080\u0099s say key ingredients like the wet blue  leather is negotiated in dollar and we buy from China where we source typically  and another the  part in dollars. When it comes to selling, our business has a significant portion in U.S., which more than offset the purchasing in dollars. The way we do to our, letâ\u0080\u0099s say, Financial and Treasury Department, we don't do covering because the covering will be too costly, you can develop the position short-term to offset the FX fluctuation. And I think for what I've seen, so far, our treasury department has been quite successful in doing so and navigating quite nicely through these effects volatility period. The stock trading on the New York is trading at cash, basically U.S. dollar, trading at cash, what does the company think about that number one; and what steps can we take to improve shareholder value? I definitely see a bit of a symmetry here, maybe given the past history of the company of not being systematic in providing return to investors. Last year, we closed with a 25 million EBITDA. As you said, we traded cash, not even considering the cash that we don't have on our balance sheet, but we have in our JV with a Â£60 million or $60 million and now where we have a minority, and then an answer is not considered in our balance sheet, but also that in a sense is part of the broader value creation story  . And this is, let's say  , of course, these years are a bit more excited than they wish. The second element is that we're trying to as well do to bring some spotlight or clarity on the story on Natuzzi, which as you know is a microcap in U.S., so we run the risk of being neglected for investors is also not benefiting from analyst coverage. Maybe it's  , but again, it's not a roadshow, itâ\u0080\u0099s simply sharing our story and what we are doing in a transparent manner. Your line is now live. So, just to scratch beneath the surface in terms of some of the operating lines, it looks like the operating expenses were down from like 37.7 million, down to 35.6 million, despite revenues being up about 6.5 and it looks like that was mostly transportation. 80% of our transportation costs, which are significant in the range of 60 million towards U.S. given the Fed the U.S. does not have production source from different region. So, Natuzzi Italia from Italy, and then branded business from Vietnam in addition from China, so quite longer with it. What we are seeing is definitely a significant decrease in freight surcharge, not yet at the level of pre-COVID, but significantly lower than what we've experimented in the most dramatic part of the industry last year, especially all â\u0080\u0093 last year also this year when, you know during Chinese New Year, the tariffs were reporting at all the time records. So, we are passing some of these, let's say, decrease across to our clients, but always in a very cautious manner not to jeopardize our marginality. Having said that, given the fact that the U.S. is really central for , maybe I will ask Jason, and if you allow me, Jason, maybe you can also share a bit how we deal with freight to , as opposite for  and take it also from there. So, during the last year, we probably adjusted our landed pricing to our customers three to four times depending on the brand as freight was rising. So, itâ\u0080\u0099s a big focus of ours to make sure that we're protecting our marginality by staying competitive as well. So, in other words, the reduction in transportation cost is persisting into the second half of the year. Now, when I look at, for example, commodity prices, many of the raw materials that go into your products, we're seeing them decrease now. And when we through the P&L start to realize the improved gross margins, but I see every indication that that's going to happen between Factory 4.0 reduction and raw material costs, you guys taking price increases, transportation being down, all of that points to better gross margins in the future. As you know, Dave, we don't provide guidance, but let me try to be explicit to your question. In quarter three, we still benefit also because our price increase typically are embedded in the system. So, the second half results don't yet include the impact of 2022 price increase for the business cycle of our order to revenue business that you mentioned. There are some material, which start decreasing, notably leather, other like fabrics, they're not decreasing, motion, they're not decreasing because yes, there is less demand, but also those industries are quite energy intensive and we all know the dynamics about energy these days. The average,   where there is less demand and answer   normalizing or they clearly invested the decreasing trends, like leather, which is a byproduct of meat production. Fabrics, which again is quite relevantly related to our business. In other metallic path, they're not decreasing because of the cost of production for those material as software from higher energy cost. But David, sorry to â\u0080\u0093 maybe it's a long story. So, by the time 2022 ends, we will have opened 7 stores, 6 of those additions and 1 Italia. And then in the first half of 2023 with signed leases, we'll open another 5 stores, all of which will be Italia. And so, that's maybe a quick summary of the openings ahead and happy to, kind of answer any more  come. So, in total for 2022, we will open 7 stores, 6 of those which are Natuzzi Editions, and 1 which will be Italia that our first Italian company will be right around December 1 of this year . And then in the first half of next year, all the signed leases and design complete, we'll open 5 Italia stores in key markets around the country. Your line is now live. I know them by art, but I want to be sure I quoted rightly, to pull out the information on the DOS and the  storage on China. And also, if we disclose it before us on revenue in 2021. And now, I mentioned a third way, we are implementing this year. So, the JV sourced products from us, and as any third party pays our industrial cost to pass the margin. So, every year, the JV distributes dividend and 49% of that goes to Natuzzi. We discussed and agreed with the Board a third way, which is distributing some cash that is sitting in the JV, which is not needed for sustaining this business in form of capital reduction, that have been approved is on their way in terms of execution. I will disclose the amount that get, let's say, finalized, but that is something which has been agreed by the Board of Directors of the JV based on my proposal to do some capital reduction. Those are the more short-term, let's say, ways. Mid-term as discussed, I believe, the JV is quite interesting in term of growth and we'd be clear now to comment because it's been almost   every year. So, there might be some long-term, let's say, option. I'm looking forward to be able to travel there because I believe that those are easy to be discussed with our KUKA in-person, but we already mentioned potential option, including separated IP or the entity, but there is no plan for that yet. I mean, Iâ\u0080\u0099m talking about the revenue over the JV because they are listed as well. And as for the number of stores, as of June, we have â\u0080\u0093 in China, we have 378 stores and of which 25 are directly operated by the JV itself and 353 are FOS. In terms of revenue, we read the revenue from the â\u0080\u0093 of the JV were   in 2021 and during the prior year, revenue was  . This year, as you know, China is the last big continent still affected by COVID, so, we had till May, 18 stores that were closed. Now stores are open, but the COVID related procedure are not really encouraging for shopping in the sense that to my latest information available, if a case of COVID was reported in a specific department store, all people entering this department store in the day will have need to quarantine. in the first six months, we opened 38 new stores. So, even in this, let's say, circumstances, which are not really favorable, still our active progression in China is continuing. I'm sorry, I mean, for being late, but I had a call with the Chairman of the company where we are trying to do business with. Isn't there in the range of 60 million, but again, Piero, if you can help me to be honest under the figure. It was â\u0080\u0093 okay, we had â\u0080\u0093 the JV had   roughly in   versus   at the end of 2020. So, going back to my initial point Georgia, and thank you for pointing to that, that's clearly, I believe one of the early investors pointed out that we are trading almost at the parity with our cash. As I mentioned eventually, which I believe is a significant progression â\u0080\u0093 progress we agreed in the Board of Director of the JV for this year, first capital reduction, because the nature of the business in China, which is based on retail, but most in the form of franchising, does not require significant direct investment. So, the cash sitting in the JV even considering the volatile environment in China is something   the business lead there. Your line is now live. Can you give us an update on your High Point property, I believe it was up on the market for sale. Based as you rightly mentioned on our sales in this , I'm not able at this time to disclose much more than that because discussion is ongoing as I speak. That is part of our strategy to focus on the investment that makes a difference from the long-term, which are our restructuring plans, accelerating the Factory 4.0 in our retail development. Just again, to me the sort of the bright spot or silver lining here is the reduction in operating expenses as a percent of revenue. because if I model going forward, if you would have had a 35% gross margin, we would have made like $5 million for the quarter. So, in OpEx, we have like say three main items. On some material like with blue, we see decreasing cost on some other material like fabric commotion, which â\u0080\u0093 whose production is high energy consumption, we don't see homogenous trend. The third, let's say, element is our transformation cost that I don't know if you mentioned or not, but that is an important element we're working on. As you know, we have multiple sites, which include directly operated sites Italy, Romania, China, and Brazil and outsourcing, the largest one being Vietnam and starting in Mexico, but also Portugal EMEA. So, the first strategic decision is reconfirming the location among those industrial platform. And that is based on multiple factor, which include the transformation cost, the tariff and the production cost. The second big levers, which is more controllable is the production cost, the transformation cost in our own factory. You are aware of the Factory 4.0 project I discussed before in Italy, which is delivering interesting results and is becoming the standard for all factories. We're also looking a way to accelerate the transformation, especially for Italy where we produce Natuzzi Italia and Divani&Divani, the sub brand of Natuzzi Editions for Italy. Yes, we still employ 1,400 people and we're carefully looking at way to accelerate restructuring, still being compliant with all the agreement that's been taken by the company with trade unions and public minister, which are important stakeholder in the local work environment. So, long story to say transformation is also an important part of that and we're working to make better industrial strategic sourcing decision and to continue lowering our transformation cost, especially in Italy. No, it's just right to summarize Dave's question. Well, honestly, at a global level, I'm not sure I have enough visibility to answer it, but that, obviously it was great news for everyone to see those costs come down year-over-year like that. So, transportation we discussed, it seemed pretty much taking a direction. Is the sense that in general, for the supplier to serve durables like furniture or the car industry, the demand is less stronger than 2021. So, it's providing, let's say, a benefit in term of potential reduction in cost, but at the same time, some of this producer like fabric's producer or motion producer, they intentionally use energy in their production process. So, the net effect, I've been reviewing the cost of trend with our purchasing team this morning. So, I've been also changing view with some of my peers, CEO of industrial company and they also are witnessing the same reality. Their answer is, it depends, which means it depends on the specific material and it depends on where you source it and it depends on the timing of your question because out there is very much still a volatile market when it comes to energy cost, raw material cost. No, the things â\u0080\u0093 so, we don't want to project any false reassurance on this because we are just taking what the market is delivering on the materials. For instance, we just launched an internal project with our IT department as part of the broader digital transformation to immediately recalculate the unit cost of a specific product based on the latest information on the raw material dynamics. So that the pricing or in the margin calculation, we don't use any more standard cost, which in a more stable world were somehow useful to take this, kind of decision during the year, but we are trying to use punctual information or real cost for individual product to take any pricing or margin decision. Your line is now live. So, about the new store concept, for those which were not able to see it in a design week, a Milan is accounted for Natuzzi Italia, our ambassador brand, which is intended to be propagating the DNA of the brand. As you know, the brand that speaks about Italy and especially speak about our reality of , which is a magic region and we try to convey that magic in the product and the retail experience. And in fact, in China, the  we mentioned before, the store for Natuzzi Italia have been opened for â\u0080\u0093 with the new concept was the new store for Natuzzi Italia that would be open in U.S., would be open with new concepts. So that is the image and the feeling the customer globally will get from Natuzzi Italia, which is a global brand. As you know, Natuzzi has even invested to become a brand and a retailer, the two things goes hand-in-hand. We are still way â\u0080\u0093 let's say, we're still with a lot of improvement on both areas. And retail experience is, of course, made of the infrastructure, which is the store that I mentioned before, but is made of a lot of other details that we are learning across geographies and we are trying to standardize in a blueprint that can become the standard, not only for our U.S., but also for our franchising partner, which is still and will remain the predominant of our distribution. Here I'm talking about the way in which the product is shown, the merchandising, the visual merchandising, all the clienteling thatâ\u0080\u0099s happening in the store. Again, just to be  , and again, we will talk a bit, if you don't ask me, I will do about the business trajectory, but if I look for instance of U.S. Retail, where U.S. has been in this quarter, a market which software, especially we will say , if you look at the performance up to date, retail on Natuzzi Italia is up 60% versus 2019, I'm talking like for like. And it's also up, again, if you look at year to date, it's also up versus 2021. So, there is a lot of work to be done, especially in Europe, and also in U.S., but those figure confirm us that Natuzzi has the legitimacy to run a retail. And if there are no further questions at this time, I'd like to turn the floor back over for any further or closing comments. And also, we are satisfied by seeing that this is the sixth consecutive quarter that we closed with positive results, notwithstanding the issue we reported in China, which created some shortfall in production. We feel that our cash position of roughly 60 million in the SPA, plus the one we own in China is a good platform to sustain diverse headwinds of this day. In the same times, we've been transparent that Natuzzi as other player in the furniture has been reporting since our  April, a softening in the demand. And when I say we, means the full organization, starting from the Chairman down to the last regional manager. We're also launching new growth opportunity, just to name one trade. It is the business we do with, let's say, in our store, that we do with our architect and designer is an important component in some stores, not so important in other. We just hired the senior manager to support creating a common terminology in accelerated part of the business, and I can mention other initiative here to support the growth like the JV in Vietnam. So,  direction on growth and top line, equally important direction on our cost structure. As I believe you captured from the discussion on the cost of material and transformation, margin is not something we can give from granted. It's a continued fight against external element like the cost of material, and against internal elements, which is our unit   production. We have several  to optimize our internal cost and those are being always there, but we're looking at those elements with an appetite to do more shorter. I don't know if Pasquale, Jason, Piero, you have any final comment, otherwise, I can't thank the audience for their patience this morning. Thank you so much, everyone. Thank you so much, everyone."
}