{
    "symbol": "ALG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 14:05:06",
    "content": " Alamo group's fourth quarter 2022 closed with a solid performance that produced record net sales and net income driven by strong demand for our products, despite persistent supply chain and labor shortage headwinds. Fourth quarter consolidated net sales for 2022 were $386.6 million, an increase of 15% compared to $337.2 million in the fourth quarter of last year. Gross margin dollars in the quarter improves compared to the fourth quarter of 2021 by $14.1 million, as did gross margin percent, which was up 50 basis points due to both price initiatives, take it earlier in the year, as well as improved manufacturing efficiencies. Consolidated net income for the fourth quarter of 2022 was $29.2 million for $2.44 per diluted share, an increase of 52% versus net income of $19.2 million for one point -- or $1.62 per diluted share for the fourth quarter of 2021. Fourth quarter 2022 net sales were $232.5 million, an increase of 14% compared to $204.3 million for the fourth quarter of 2021. Operating income for the fourth quarter of 2022 was $30.2 million, up 67% versus $18.1 million for the same period in 2021. Industrial Equipment division net sales in the fourth quarter of 2022 were $154.1 million, up 16% compared to $132.8 million for the fourth quarter of 2021. Operating income in the fourth quarter of 2022 was $12.5 million compared to $8.7 million for the fourth quarter of 2021, an increase of 28%. Consolidated debt sales were a record for the full year 2022 coming in at $1.5 billion, up 13% compared to $1.3 billion for the full year of 2021. Net income for the full year of 2022 was $101.9 million or $8.54 per diluted share, also a record versus net income of $80.2 million or $6.75 per diluted share for the full year of 2021, an increase of 27%. Full year 2022 net sales for the Vegetation Management division were $937.1 million compared to $812.7 million for 2021, up 15%. Full year 2022, operating income was $108.5 million, up 37% versus $78.9 million for the prior year. For the full year 2022 net sales for the Industrial Equipment division were $576.6 million compared to $521.5 million for 2021, an 11% increase. Full year 2022 operating income was $40.1 million versus $38 million for the full year of 2021, an increase of 5%. Net sales increased by 15% compared to the fourth quarter of 2021, despite currency translation effects the reduced sales by more than 3% or $10.5 million during the period. For the full year 2022, sales more than 13% with a currency translation having a negative impact of 2.4% or $32 million. The Vegetation Management division net sales in the fourth quarter rose 14%, led by a nearly 20% increase in sales of forestry and tree care equipment and a more than 20% increase in sales of governmental mowing equipment in North America. Industrial Equipment division's fourth quarter net sales were up 16%, led by a 26% increase in sales of street sweepers into pre-collection equipment, while sales of its excavators and vacuum trucks were up by nearly 15%. Compared to the prior year, Class 8 truck chassis receipts were approximately 40% higher in the fourth quarter of 2022, while receipts of Class 6 and 7 chassis declined modestly during the same period. No, that makes sense. No, that makes sense."
}