{
    "symbol": "CMS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 16:09:11",
    "content": " To elaborate for the first half of 2022, we delivered adjusted net income of $499 million, or $1.73 per share, up $0.09 per share versus our 2021 first half results largely driven by favorable weather and economic conditions in the state. These sources of upside were partially offset by increased operating and maintenance or O&M expenses largely driven by customer initiatives, embedded in rates to improve safety, reliability and our rate of decarbonization, which equated to $0.07 per share of negative variance versus the first half of 2021. We also note the $0.03 per share of negative variance in the final year-to-date bucket, which is primarily driven by investment costs related to the 2019 rate compressor station incident for which we are not seeking recovery at this time, as per our recent gas rate case settlement agreement, and the company's recent commitment to donate $5 million in support of income based bill assistance for our electric customers as per our IRP settlement agreement. The approved settlement agreement at $170 million significantly de-risked our financial plan, and when coupled with our December 2021 electric rate order provides $0.10 per share positive variance versus the second half of 2021. The forecasted rate relief net of investment-related costs in the second half of the year more than offsets our estimated impact of normal weather, which we assume will provide $0.01 per share a negative variance versus the comparable period in 2021. We continue to anticipate lower O&M expenses of the utility driven by the expectation of a more normalized level of storm activity this year versus the atypical levels experienced in 2021, which I'll remind you equated to $0.16 per share of downside in the third quarter of 2021 versus our financial plan. Lastly, it's worth noting that we have accrued a healthy level of contingency given our strong year-to-date performance as illustrated in the $0.24 to $0.28 of negative variance highlighted and the penultimate bar of the chart, which increases our confidence in delivering for you our investors. Your line is open. Your line is open. Your line is open. Your line is open. But I'd say, basically, what we've done so far as I understand it the structure that's contemplated is consistent with what we were talking about around EEI several months ago, where there's a three-year average on pre-tax operating income around $1 billion. Your line is open. Your line is open. Your line is open."
}