{
    "symbol": "CMS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 14:03:04",
    "content": " We remain focused on getting ready for that future with our IRP, which delivers even more savings to our customers with roughly $600 million in savings over our prior plan and reduces our carbon footprint by over 60% as we exit coal in 2025 amid 8 gigawatts of store and 550 megawatts of battery through 2040. This level of discipline to continuously improve has been a contributor to the successful regulatory outcomes in our settled electric and gas rate cases, which is highlighted by the $47 million of regulatory mechanisms to support infrastructure investments and assist customers. I'm also pleased to share that we are raising our 2023 adjusted full-year EPS guidance to $3.06 to $3.12 from $3.05 to $3.11 per share, compounding off of 2022 actuals like you would expect from a premium name like CMS Energy. Our strong performance in 2022 provided significant financial flexibility at year end, which, as Garrick highlighted, enabled us to de-risk our 2023 financial plan to the benefit of customers and investors, which I'll cover in more detail later. From a financing perspective, we successfully settled $55 million of equity forward contracts as planned and more notably opportunistically priced approximately $440 million of equity forward contracts at a weighted-average price of over $68 per share. To elaborate on the glide path to achieve our 2023 adjusted EPS guidance range, as you'll note on the waterfall chart on Slide 12, we'll plan for normal weather, which in this case, amounts to $0.20 per share of negative year-over-year variance, given the absence of the favorable weather we saw in 2022. As always, we'll adapt to changing conditions throughout the year to mitigate risks and deliver our operational and financial objectives to the benefit of customers and investors. In the outer years of our plan, we intend to resume our At The Market or ATM equity issuance program in the amount of up to $350 million per year in 2025 through 2027, given the substantial increase in our five-year utility customer investment plan. From a financing perspective, we successfully settled $55 million of equity forward contracts as planned and more notably, opportunistically priced approximately $440 million of equity forward contracts at a weighted average price of over $6 to $8 per share to address the parent company's financing needs for the pending acquisition of the covert natural gas generation facility in support of our IRP. To elaborate on the glide path to achieve our 2023 adjusted EPS guidance range, as you'll note on the waterfall chart on Slide 12, we'll plan for normal weather, which in this case amounts to $0.20 per share of negative year-over-year variance, given the absence of the favorable weather we saw in 2022. As always, we'll adapt to changing conditions throughout the year to mitigate risks and deliver our operational and financial objectives to the benefit of customers and investors. In the outer years of our plan, we intend to resume our at-the-market, or ATM, equity issuance program in the amount of up to $350 million per year in 2025 through 2027 and given the substantial increase in our 5-year utility customer investment plan. Your line is open. With respect to the components of the  refill mechanism, we just filed that earlier this year, to be clear, it's $22 million and we're going to allocate a portion of that towards excess capital investments over the course of '22 attributable to emerging capital work like asset relocations demand failures on new business. Your line is open. Your line is open. But I will also our general rule of thumb, obviously, is we always want to avoid block equity and we still think even at that level of up to $350 million per year, even where the market cap is right now that's up 2%. Your line is open. Your line is open."
}