{
    "symbol": "DXLG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 12:16:03",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Destination XL Group Incorporated, Third Quarter Fiscal 2022 Financial Results Conference Call. During today's call, we will discuss some non-GAAP metrics to provide investors with useful information about our financial performance. I'm grateful for the opportunity to speak with you today about DXL's third quarter results, and our continued commitment to the transformational strategy we have been consistently working towards since 2019 and that is delivering our results. Few brands, fewer styles and sizing based on someone else's definition of regular, limit him every time he tried to find clothing. While most retailers of men's apparel offer some level of big and tall assortment to their customers, it is often a single rack or a small sub department for no other omnichannel retailer is at their top priority. Coupled with selling, general and administrative expenses, which were in line with our expectations at 37.3% of sales, these factors delivered an adjusted EBITDA margin of 12.7% for the third quarter. In addition, during Q3, we continued to grow the active file and achieved the highest 12-month active file customer count in the Company's history. These results are driven by numerous factors including the development of our omnichannel portfolio, our transformational brand positioning, our approach to promotions, our merchandise assortment and inventory management. As we begin to peel back our omnichannel approach, let's start by talking about stores. Throughout Q3 and compared to our record 2021, stores delivered accretive monthly sales comp of plus 6.1% in August, plus 10.4% in September and plus 13.6% in October. When comparing to 2021 abnormal consumer behaviors associated with the countries reopening post-pandemic and the accompanying consumer revenge buying driven by both supply chain shortage fears and tentative demand, we believe this return to stores is even more impressive. Importantly, Q3 store performance was bolstered by an increase in dollars per transaction as well as markdown levels at an all-time low, two really important signs of health that I will revisit in the upcoming merchandise assortment and promotional approach topics. In the direct channel, across the browser, the app and marketplace, our direct and online business also showed growth versus 2021 Q3 at plus 5.5%. All three channels, the browser, the app and marketplace grew sales in the third quarter with the store integration to digital from universe sales the only declining element of direct. The continued growth of our marketplace business primarily on Amazon, but also on Walmart and Target Plus reduced our overall direct dollars for a transaction in contrast to the increases seen in stores. These dollars per transaction erosion is driven by the increased penetration of our big and tall essentials line on Amazon, which is targeted towards a different consumer than DXL's core customer with lower price points. We are continuously evaluating marketplace performance and product mix, knowing full well that consumer behavior shifts over the past few years have positioned marketplaces as shoppable search engines and points of discovery along overall customer journeys. Conversely, and as noted, we did not comp universe sales, but our belief is that with our materially better in-stock position in the stores, there is meaningfully less need to buy off the integrated web platform while shopping in our stores. The brand's repositioning is built around three key elements: why, how and what. What we do tactically, factually, pragmatically, we are a haven for the big and tall man with the largest assortment of brands and sizes accompanied by unrivaled expertise that creates an experience like no other. First, industry-leading expertise on big and tell sizing, offering a fit that he can't get anywhere else; second, the broadest and deepest assortment of big and tall national and owned brands, most of which are exclusive to DXL; third, the highest standard of construction and quality in our mix; fourth, a collection of brands and products that give him style options for most any occasion; fifth and finally, a level of service that gives them a better experience that he can get anywhere else, bar none. Layer this on to our 2022 marketing initiatives that were first referenced way back in -- during our Q4 '21 earnings call, loyalty and the CDP platform, and it's a powerful story and platform to continue to build upon. And when fully operational in Q1 2023, it will enable greater personalization and segmentation across all CRM touch points, while also unlocking further actionable insights to fuel new customer acquisition and inform targeting. When I first joined DXL, the Company was mired, and I used that word purposely, mired in a cycle of using broadly available coupons and discounting as a primary method of communicating to customers and driving sales. Not only did this limit margins and restrict profitability, it also took customers that DXL trades solely on price and promotion and not our unique fit our mostly exclusive assortment and an incredibly compelling experience. We have significantly shifted our promotional since those days, deploying promotions only when necessary to address customer file inventory opportunities, a stark contrast from the previous and essentially always on and heavy-handed promotional approach. While our clearance Q3 penetration was up slightly in 2022 at 6.7% to 2021's 6.4%, it is important to note that we have reduced our clearance discounting levels. Last year's deepest discount was 75% off, whereas this year's deepest discount is at 40% off. This has served multiple purposes; one, further protecting margins and markdown rates; and two, allowing for the deployment of occasional additional percentage off clearance promotions to address inventory while also stimulating consumer demand. As we have been significantly less promotional than any prior year, we do understand that promotions may play a role within the marketing mix, especially in Q4 and during the holiday season. However, gone are the days of deep and broad promotions just for the sake of having a promotion, we now combine a multiyear disciplined testing and learning approach with a rigorous business, customer inventory monitoring and are consistently scenario planning to activate against near-term trends without creating long-term brand repositioning harm. The continued reemergence of dress wear and tailored clothing saw greater momentum and contributed 19% of our Q3 sales versus 15% in Q2, while also driving higher price points and more casual categories. In our design collections, we offer exclusive sales from Nautica, Vineyard Vines, Psycho Bunny and Robert Graham, each of which all drove year-on-year increases via fashion forward style assortments. If we look more closely at the recent year-over-year comparison to Q3 2021, we have now right-sized our inventory levels and made up inventory, which is much more productive, ending Q3 at a healthy level at $106.8 million, which is a 30% increase to 2021. Shifting from the brand assortment and inventory discussion, I'd now like to talk about people, processes and technology, all of which apply to marketing. Building upon both Jim and John's background and experience, we will continue to examine in marketing and technology processes, customer journeys, user experience and outputs with two fresh up device. While the results of the previous marketing leadership drove are commendable, especially navigating through the pandemic, Jim and John's combined presence allowed DXL to shift even further from playing defense to playing offense with a focus towards the future, and as you've heard me reference before on previous calls. As I close out my comments, I'd like to address some macroeconomic factors and headwinds many of which are consistently appearing in today's headlines. As we know, 2021 was still a non-normalized year, which also included non-normalized behaviors, whether driven by pent-up demand from 2020's off year, the issue of stimulus payments and supply chain outage fears impacting consumer shopping patterns. While many of these elements no longer impact 2022, we are very mindful of the new emerging impacts of the macroeconomic environment, and how this year's factors, including recession fears, rising interest rates, inflation and consumer confidence translate to our business and inventory positions. Historically, DXL's rate of open positions in stores hovered around 10%. Today, that rate is now closer to 14%, and we continue to place great emphasis on hiring back and looking to gradually improve this trend. This is a requirement on my part, not an option as they are what makes DXL, DXL, whether in the stores, in the distribution center, in our guest engagement center or in the corporate office, their commitment to DXL and our cause is beyond commendable. Each and every day, I'm extremely grateful to be surrounded by fellow employees that choose to believe in what we're doing, that choose to believe in who we are doing it for and ultimately choosing to partner alongside DXL in that journey. I'd like to give you some more color around our Q3 financial performance, expectations for fourth quarter and our thoughts on capital allocation. Sales for the quarter were $129.7 million, up 6.7% from $121.5 million in the third quarter last year. On a comparable basis, adjusting for closed stores, sales grew by 8.7% with comparable store sales up 10.1% and our direct business up 5.5%. Compared to 2019, which was still our last normalized year, our comparable sales for third quarter were up 33.7%. The Compared to fiscal 2021, sales accelerated as we moved through the quarter with comparable growth of 7.4% in August, 8.5% in September and 10.3% in October. The continued resurgence of stores was the highlight of our Q3 sales and stores benefited from growth in traffic, conversion and dollars per transaction. Geographically, all regions outperformed their results last year, but the biggest gains continued to be in the Southeast. As an omnichannel retailer, we remain ready, willing and able to meet the customer on their terms, wherever and whenever they choose to shop and we were pleased to again see growth in both the store and direct channels this quarter. Based on the strength of our Q3 performance and Q4 outlook, we are increasing our sales guidance from a range of $520 million to $540 million to a range of $535 million to $545 million. Our gross margin rate, inclusive of occupancy costs, was 50% for the third quarter as compared to 50.2% a year ago. The decline in merchandise margin was due to increased product and raw material costs, elevated inbound and outbound shipping costs and higher penetration of our marketplace business, which is burdened with third-party sell and commission charges. The magnitude of the year-over-year changes in shipping costs and markdowns has become less pronounced in the second half of the year than it was in the first half, and this should hold true for the fourth quarter as well. For the year, we expect gross margins to be approximately 50 basis points higher than last year or approximately 50% of sales on the strength of our sales leverage and brand repositioning. As we've said before, our cost structure in 2021 was very lean and not sustainable to achieve our company's 2022 sales goals and long-term growth. On a dollar basis, expenses increased by $6.4 million, which was primarily due to investments advertising to drive customer acquisition and engagement, store corporate payroll to support our sales growth and fill open roles, and an increase in performance-based incentive accruals. Advertising for the quarter increased to 5.9% of sales, up from 4.5% last year as we seek to balance return on ad spend with customer file growth. Our full year advertising goal remains at 6.2% of sales, which provides us with the opportunity to further increase our investment in the fourth quarter. On the strength of our third quarter results, we are increasing our earnings guidance for the year to an adjusted EBITDA range of 12.5% to 13.5% of sales from our initial guidance of greater than 10%. This was primarily the result of our adjusted EBITDA of $59.6 million, partially offset by inventory investments of $25 million to get us back to better in-stock positions in our stores. We have invested $7.9 million of our cash flow into capital projects most of which has been in technology projects that support our stores, website and marketing and merchandising capabilities, all of which ultimately enhance our guest experience. For the full year, we expect CapEx to increase to $10 million to $12 million. We did not need to use our credit facility this year -- this quarter, which had availability of $90.2 million and is in place until October 2026. As we look to future uses of capital allocation for DXL, I'm excited by the opportunities that lay before us, especially within our store portfolio. First, there are pockets of the country where that are white space to us with no current DXL presence, but whose market demographics and our own analytics indicate strong support for a DXL store. We believe we could open up to 50 new stores over the next three to five years, and we are actively seeking real estate opportunities in such markets. Second, we will use this opportunity to finish uniting the store portfolio under the DXL banner by converting or relocating our remaining Casual Male anchor stores. And third, we are reviewing our existing DXL portfolio to determine which stores might benefit from a remodel to introduce some of the more modern elements to the customer experience through updates to the layout, branding and assortment. We just recently launched the grand reopening of the first of these stores in Warwick, Rhode Island and the early feedback from customers has been tremendous. First, we have opened up the exterior windows to provide a more appealing line of sight into the store, and we have changed the store signage from DXL men's apparel to DXL Big & Tall. Second, we have reset much of the interior to showcase lifestyle, fashion and exclusivity of brands in addition to creating digitally interactive guest engagement centers to enable a more consultative and integrated commerce opportunity and checkout experience. It is still very early, and we will provide more updates on the remodels in the future, but we believe there is an opportunity to push this remodel out to many more stores in the future. Wrapping up today's comments, I'd like to offer some additional perspective and closing thoughts. DXL's consistent and aligned strategy has not wavered, nor has our relentless focus on the big and tall customer. And while we create short-term impacts, we are simultaneously committed to long-term growth and making strategic investments in people, processes and technology that are all focused on delivering the immense opportunities you had ahead for DXL. Just your view on the consumer heading into the holidays, -- there's been a lot of different data points there suggesting some weakness, particularly in the first week of -- starting after the first week of October. But just curious what -- the way you're thinking about the holidays, consumer spending, all those types of bigger picture macro ideas. Mike, I would say our answer is going to be no different than it's been literally for the last two years. I think the reality is, though, as we've always been conservative, our optimism is tainted, if you will, for lack of a better way to say, by the ongoing consumer elements, right, the recession, the elements of inflation, mortgage rates. Just looking ahead -- maybe it's too early to think about this, but looking ahead, to 2023 in the margins there. When this year began, you said, well, that's not sustainable, and it could be around 10%. But from here, from this new level, have we hit a new level where you can grow margins continually from the 12.5% to 13.5% level? And also in that context, it could affect EBITDA margins if we think there's a greater opportunity to make investments and grow and invest in the business where the acceleration of EBITDA may not be as great next year because we believe that there are really material opportunities. So, I'm not giving you an answer specifically, but I think it's embedded in how we think about growth and the investments we'll make. But I think to Harvey's point, it's where do we continue to invest in the business. And so at least to me, it sounds a little different than a year ago when the answer to a similar question may have been the 15% EBITDA margin from 2021 is just not sustainable. I would not say that our expectations, just to be very clear, that we'll generate 15% EBITDA margins. We continue to think about being north of 10%, and we will continue to balance the level of investment, SG&A, things like -- of that nature that could affect EBITDA. So, I just wanted to make sure to clarify -- come back to the kind of -- it sounds like quarter-to-date trends have continued to be actually pretty strong. But I wanted to just also clarify, Peter, I think if our notes are right, the compares get actually substantially easier throughout the quarter. But I think as Harvey was mentioning, when you look at our guidance of $535 million to $545 million, that would imply a 2.5% to 10% comp for Q4. And while we do believe that we can push water uphill, as Harvey was saying, it's still -- it's difficult to predict what's going to happen, but we feel really confident that we will be able to deliver a single-digit increase somewhere between, call it, 2% and 10% for the fourth quarter. I want to come back to the capital allocation and it's -- you guys are in kind of an exciting point here where you have multiple pathways to growth, with store growth now part of the equation rather than storage shrinking like it's been the last four years, remodels, relocating. And then obviously, your marketplace, your DXL big and tall essentials, sounds like that is doing really well. So let me just start, Jeremy, with we don't want to get too far ahead of ourselves because we have one of these stores open. And keep in mind, a lot of these stores -- some of them are approaching 10, 11, 12 years old. So, I think we're going to be coming back to you with more information on that as we learn more, but it's still pretty early, but we're excited about it and wanted to let you know that at least it's on the horizon. So in today's market with increased construction costs and just where the market is, it's going to be higher than that. But -- I mean I wouldn't be surprised if a new store cost us $600,000, $700,000. And at a CapEx range of, let's call it, $10 million to $15 million for next year, you'd end up with $2 a share by the end of next year. Well, I think what you started with is absolutely correct is that we are seeing that freight and shipping costs are less of an impact on the comparisons that we're seeing now in Q3 and Q4 than they were in the first half of the year. I think that as we get into next year, we've -- I think we've pushed promotions pretty hard. So when you look at our gross margins at around 50%, that feels really good to me. I feel like we -- traditionally, pre-pandemic, we were 43, 44, now getting that up to 49, 50, I think feels great, and that's what we're going to be continuing to target in the future. And I completely agree with you on the challenges in real estate and construction and permitting and -- we've, behind the scenes, been doing a lot of work and our real estate team is doing a fantastic job with getting out and canvassing the country and identifying where are the opportunities that we want to be looking into. So, it's a long turnaround process, which -- this is, I think, the third quarter in a row that we've been talking about. Look, we think we can open new stores and we're looking at five for next year. So, we're getting up to that point where by the end of fourth quarter, beginning of first quarter next year, we're going to have a much better line of sight on are we going to be able to get five or not next year. But that's the plan, it's five next year. We look forward to reconvening with you shortly after the holidays, which we'll do a pre-release and then in the fourth quarter -- end of fourth quarter conference call."
}