{
    "symbol": "DSGX",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-02 22:33:05",
    "content": " We are pleased to report record quarterly revenues of $98.8 million this quarter, an increase of 18% from revenues of $83.7 million in Q1 last year. Back to revenue, our revenue mix in the quarter continued to be very strong with services revenue increasing 19% to $88.3 million or 90% of total revenue compared to $74.1 million or 89% of revenue in the same period last year. License revenues came in at $1.3 million or just over 1% of revenue in the quarter down from license revenues of $1.8 million in the first quarter last year, while professional services and other revenue came in at $9.2 million or 9% of revenue up 18% from $7.8 million in the same period last year. As a result, we continued to see strong adjusted EBITDA growth of 26% to a record $41.5 million or 42.0% of revenue in the quarter up from $33.0 million or 39.4% of revenue in the first quarter of last year. With these exceptional operating results, cash flow generated from operations came in at $40.9 million or approximately 99% of adjusted EBITDA in the first quarter this year, up 49% from operating cash flow of $27.5 million or 83% of adjusted EBITDA in the first quarter last year. From a GAAP earnings perspective, net income came in at $18.4 million, up 67% net income of $11.0 million in the first quarter last year. Overall, as Ed said, we are really pleased with these operating results in the first quarter as the strong organic growth and solid performance from our recent acquisitions resulted in an 18% growth in revenue and more importantly, 26% growth in adjusted EBITDA. So as of May 7, and using foreign exchange rates of $0.82 of the Canadian dollar, a $21 to the euro, and $1.409 to GBP pound, we estimate that our baseline revenues for the second quarter of 2022 are approximately $92 million, and our baseline operating expenses are approximately $59 million. We consider this to be our baseline calibration of approximately $33 million for the second quarter of 2022 or approximately 36% of our baseline revenues as at May 7, 2021. I think we're in the 2020s since the big push that we got at the start of the pandemic where it really shut up upwards of 40%, and we're seeing it now come back to a normal level of growth, but still quite good, probably one of our fastest growing businesses. I mean, we're up 70% from a – sequentially in the business as far as adjusted EBITDA and heavily that's, again, it's going to be a mix of both that organic growth and new existing customers that are doing more volume with us."
}