{
    "symbol": "CVET",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 19:32:04",
    "content": " In North America, we continue to gain market share in in-clinic distribution and our comprehensive solution for customers is clearly resonating, total North America organic net sales grew 9% year over year, which includes compelling performance from prescription management. As you can see on slide 4, prescription management, net sales increased 24% year-over-year to $140 million and non-GAAP adjusted EBITDA more than doubled to $13 million, driving this growth was strength in auto-ship, where net sales increased 50% year-over-year, and a 30% year-over-year improvement in sales from veterinarian initiated prescriptions or what we call proactive prescriptions. Now turning to the consolidated details on Slide 8, Covetrus net sales were $1.15 billion in Q1, an increase of 4% year-over-year or 6% on a non-GAAP organic basis. North America led the way once again, delivering 9% year-over-year non-GAAP organic net sales growth, despite challenging comparisons from the prior year. In the aggregate, this collection of businesses gross profit increased 15% year-over-year, or seven times faster than the 2% average growth rate of third-party products distribution, and now represents 44% of gross profit as compared to 41% in the first quarter of 2021. Turning to slide 10, consolidated non-GAAP adjusted EBITDA was $63 million for the first quarter of 2022, compared to $57 million in the prior year period, an increase of 11%. Moving onto our individual operating segments, beginning on slide 11, North America net sales increased 10% year over year in Q1, 9% on our non-GAAP organic basis. This included 24% year over year growth in prescription management and 7% growth in supply chain, including another quarter of year over year market share gains in companion animal products. As mentioned earlier, North America prescription management net sales of a $140 million increased 24% year-over-year during the first quarter, including an immaterial contribution from a small tuck-in acquisition completed in March. While the timing of investments can always be lumpy in prescription management, we remain focused on delivering a 15 to 20% flow-through from incremental net sales to adjusted EBITDA for the full year of 2022. And I'm encouraged to share that the UK challenges that have impacted the business over the last 12 months are now beginning to level off as we start the second quarter, boding well for more pronounced European segment non-GAAP organic net sales growth, entering the second half of the year. On slide 13, our team delivered 4% year over year growth in non-GAAP organic net sales in Q1 reflecting another quarter of strong sales execution despite unanticipated headwinds, tied to notable out of stock situation in the veterinary diet food category in this region and the recent flooding in Australia. Now, turning to our reaffirmed 2022 guidance as outlined on Slide 15, we continue to forecast year-over-year non-GAAP organic net sales growth of 7% to 8% in 2022. Looking at non-GAAP adjusted EBITDA, our 2022 outlook remains at $270 to $280 million and reflects 11% to 15% year-over-year growth. With that said, we remain confident in the trajectory of our higher margin strategic growth drivers in 2022, including another year of 20 plus percent net sales growth in prescription management in North America, an acceleration in our global software net sales alongside new products, and above average growth in our portfolio proprietary brands and Covetrus branded products across our segments. Finally, while we do not provide specific quarterly guidance, given the tough line market comparison in Q2, and the fact we have not yet lapped some of the global supply chain challenges that emerged in the second half of 2021, we expect Q2 non-GAAP adjusted EBITDA to approximate prior-year levels with a return to double-digit year-over-year growth anticipated during the second half of the year. Your line is now open. Your line is now open. Your line is now open. So we view even if there's 2% reduction or 3% reduction in visits, tremendous head room on prescription management, and I think Q1 results are the best signal of that visits were down, revenue went up 24% year-over-year. Your line is now open. Your line is now open."
}