{
    "symbol": "SNN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 17:13:16",
    "content": " The stronger growth we expected for the second half is coming through, and we remain on track with the guidance we gave at the half year. Before Anne-Francoise takes you through the detail, I'll make a few comments on our strategic progress. We're a company with strong innovation throughout the portfolio, where two of the three franchises are already delivering effectively. And we introduced to you our 12-point plan to improve our execution further, including the rewiring of orthopedics and operations. Today, we're one quarter into that plan. It's a journey, and we're still at the start, but I'm pleased with the early progress we're making. Firstly, we've embedded the structures to drive this work, the KPIs to monitor progress and drive accountability have been established. Our new demand planning process has now been active for a full quarter, and our level of back orders is starting to come down. It's early for these to be showing in our numbers, but we're showing the behavioral change and the sense of urgency that we need. And our work is not just about fixing things, we're building up our long-term growth potential at the same time by continuing to deliver important innovation. We've added new launches across the franchises and have made more key projects in robotics, extremities and negative pressure expected to come in the next few quarters. The third quarter revenue was $1.25 billion, which represents a 4.8% underlying growth. As you see on the slide, all three franchises contributed to our growth. Availability of certain critical components, such as electronics and resin, impacted elements of all three franchises. In addition, staff shortages in health care systems are still a constraining factor on growth. Nevertheless, it is pleasing that the growth acceleration is still coming through despite this challenging backdrop. Looking by geography, the U.S. grew 6%, other Established Markets 0.4% and Emerging Markets grew by 8.6%. Within Emerging Markets, China remains a headwind as we've seen two quarters of the full impact of VBP. Without China, our group revenue growth would have been around one point higher. Looking by franchise, Orthopaedics grew 2.1% underlying. Again, without China, the franchise growth would have been 5.6%, with 11.8% in Knees, 3.4% in Hips and 0.8% in Trauma & Extremities. In Knees, we're also starting to see the early benefits of our cementless knee LEGION CONCELOC as well as double-digit growth in Revision. And it is encouraging to see some narrowing in our recurrent performance versus our peers, but there's clearly more to do in Hips before we step up competitive wins again. And for example, it's only in our work to improve supply and integrated execution, so the benefit of that is still to come. Other Reconstruction is one of our segments affected by component availability, particularly semiconductors. Even so, we're continuing to build our robotics installed base and roll out new applications to CORI. We had the first knee revision cases on CORI in the quarter, and use in total hip replacement is also building, supported by our broad medical education program. Here, the decision not to participate in the broad rollout of provincial trauma tenders in China is currently offsetting a return to growth in the rest of the world. While that decision gives us a growth headwind for two more quarters, it keeps our focus on markets with more attractive returns. The acceleration in both segments was helped by China, which returned to growth after the impact of COVID restrictions earlier in the year. Recent launches across the Sports Medicine portfolio are performing well, with FAST-FIX FLEX and WEREWOLF FASTSEAL continuing to be ahead of our plan, although, again, component supply remains a limiting factor in AET. There are further opportunities to come for REGENETEN in other tendon repair indications and other global market, and Deepak will cover in a moment some of the truly outstanding evidence that we're accumulating for REGENETEN. ENT grew 32%, with volumes continuing to recover strongly across all categories. What is very encouraging is that it continues to be a balanced performance, with growth coming across all regions and product categories. In Advanced Wound Care, the strong growth in APAC from recent quarters continued. Advanced Wound Devices was, again, driven by our Single Use Negative Pressure product, PICO, which were double digit. Our traditional negative pressure product, RENASYS, is another spot in the portfolio, where electronics are important and tight supply is currently limiting growth. With the work to improve Orthopaedics and the ongoing momentum in Sports Medicine and Wound, we expect much stronger growth to continue into Q4. With just one quarter remaining, and based on what we can see today, we expect to come in at around the middle of our 4% to 5% underlying growth target. It builds on our existing strategy and covers the biggest opportunities for the Company, with five initiatives aimed at regaining Orthopaedics momentum across all of recon, robotics and trauma, and another five initiatives to improve productivity throughout the value chain. And finally, two initiatives to accelerate Sports Medicine and Advanced Wound Management. The detailed plans for this integrated set of actions, the expectations for delivery and the behaviors we need to succeed, are cascading throughout the Company now. Specific and quantitative key performance indicators are established across all initiatives, with mechanisms for measurement and internal reporting in place. So as this work advances, we'll periodically share some of those KPIs to demonstrate progress. As you would expect, this is an area where we've looked to start moving faster, and this slide shows some further detail. One group of initiatives is around rewiring our commercial delivery, and that includes rebuilding our planning processes to better match supply and demand, with closer collaboration between operations and commercial. It also includes improving asset utilization, particularly with instrument sets and also strengthening the last-mile logistics to get instruments and implants to customers more efficiently. Another group is around winning market share with our technology, where we've developed detailed plans for our key growth opportunities. We'll accelerate trauma through EVOS, where the launch of a large plates gives us the broad offering to compete with the market leaders. Finally, we're continuing to work on streamlining our recon portfolio, reducing the numbers of implant systems in each category and focusing on key brands. This is a change we're making carefully, supporting our customers to move to alternative products with the support of medical education. The productivity elements of the 12-point plan bring in a range of actions, including improving value and cash processes, optimizing procurement and in manufacturing. And in manufacturing, we're revisiting lean across our operations as well as continuing to review the network. Smith & Nephew has had lean initiatives before, but there's considerable variation across our sites and how far they've been implemented. We'll roll out the lean program with a phased approach, focusing initially on the greatest potential by product category and location and again, with the oversight and accountability to make improvements sustainable. Finally, there's the work to accelerate Sports Medicine and Advanced Wound Management. These two of our three franchises, which represent 60% of our business, are already performing well. We'll talk more about these aspects of the plan next year, but the slide gives some sense of where our focus is. There's still a huge opportunity in negative pressure wound therapy, and we've got detailed plans to scale our business, both through competitive conversions and traditional negative pressure and by expanding the single-use market globally. In Sports Medicine, we're driving more cross-selling in ASCs with improved coordinations, incentives and planning behind cross-franchise deals. It will take some time for this plan to play out in its entirety, with the completion of all initiatives taking around two years. As you'd expect, we've said about Orthopaedics with the greatest urgency, and that's where you see the earliest progress. First, on rewiring Orthopaedics commercial delivery, our new demand planning process has now been in operation for a full quarter. Plans are at a deep level of specificity down to the SKU level, and our operations and commercial specialists are working at the higher cadence of interaction that we need. We're more than 80% through a onetime exercise of pulling slow turning and inactive instruments back into Smith & Nephew, then completing them if needed and getting them back into the field. So it's work at the margin rather than a solution, but the pace at which we have driven that shows are change in behavior towards extracting value from our capital. We've moved our installed base past 500 units, even with the constraint of chip availability. We have new differentiation with the unique knee revision indication, and we have a pipeline of further indications and assets to build on that. And in Extremities, we're now prepared for the launch of AETOS. AETOS is the next-generation shoulder that we acquired in 2021, and we're expecting to launch in the near term. Finally, we've made progress on improving value and pricing across the portfolio, and it's a component that works. As we've said before, we're seeing significant input cost increases, and we don't expect to be able to pass all of that on in price. However, we are able to make some changes, and the price deflation we've historically seen for our portfolio is now neutralized. Innovation is a key driver of growth, and we've continued to deliver new devices, enabling technologies and clinical evidence with around 20 significant launches since the start of 2021. Most recently, in Orthopaedics, we've launched new software and indications for CORI, including making CORI the first and only system today to support knee revision procedures. In Advanced Wound Management, we've entered a fast-growing subsegment with DURAMAX S superabsorbent dressing for high exuding wounds that's now launched in Europe. In Sports Medicine, we've added outstanding new evidence for REGENETEN, with interim results from a randomized controlled trial presented in September. Analysis of 57 patients with rotator cuff tears showed a statistically significant reduction in re-tear rates after one year, from 25% of patients in the control group to just 3.5% of patients also receiving REGENETEN. These include further development of CORI with the Knee Tensioner, which is a proprietary device for soft tissue balancing; our next-generation shoulder project, as I previously referred to, AETOS; and a new generation of our traditional negative pressure platform, RENASYS, to add to our already leading technology and clinical evidence. The organization has embraced the 12-point plan, and we're demonstrating our commitment and urgency to deliver through our early progress. In the coming quarters, we'll show you further evidence of progress on product availability, growth and asset utilization, and as we begin to share more or some of our KPIs. At the same time, we'll deliver a series of key pipeline projects that will further enhance our growth profile across these franchises. It's by bringing together better execution and leading technology that we can deliver our potential as an innovation-led medical device company, and I'm looking forward to showing you more in the New Year. And then secondly, last time we asked you about midterm targets, Deepak. Excluding China, our Hips growth would have been 3.4%. Although there's been acceleration in the U.S. from Q2 into Q3, we clearly have more work to do to step up our commercial performance, particularly to get back into a competitive win mode. As I mentioned, our efforts to match supply and demand were one quarter into it. And I do believe the actions we're taking around improving supply and actually better matching supply and demand will yield the benefits here in Hips, Hassan. Secondly, as far as midterm guidance is concerned, traditionally, Q3 has been our trading update, and thus what this is today. We've got growth to do in terms of improving the margins, but we expect to come back to you at full year results time to update you on midterm guidance. As I mentioned, actually from a competitive standpoint, we're very pleased with the reaction to CORI that we're seeing in our -- from our customers around the world. Hassan, it's in ASCs as well as in the larger medical centers. And as I mentioned, we're only at the start of the journey in terms of building out functionality and indications in CORI. This has been a significant factor for us in terms of being able to cater to the demand that we already have for this product, and we expect once the semiconductor situation is resolved, we expect to be able to kind of get to fulfilling the full potential of CORI. Obviously, your competitors are talking about that the key driver of growth, and you've called out specifically in your 12-point plan. While we don't disclose the number externally, what I can share with you is we're tracking a little bit ahead of our internal plans relative to the number of deals, both in terms of number and size of deals around cross-franchises. In terms of CORI, as I mentioned, there's been considerable traction for CORI in the ASCs, but it's not just in the ASCs, CORI has application or applicability across all types of settings. But in particular, since you brought up ASCs, just did want to flag that we are pleased with the traction we've gotten in that center. It's primarily a U.S. factor for now, and we have the organization and the efforts kind of put together in a way to capitalize on the opportunity there. But the utilization of CORI is also important, where we place them and the role in place in terms of competitive share capture and the degree to which they're utilized in the context of a particular deal arrangement is an important factor. Just to give you -- for instance, I mentioned the KPIs as part of the 12-point plan execution. So we look at not only CORI placements, but the utilization of procedures with CORI and where we've implanted them. I'm pleased with where we are right now, but it's still early days. Obviously, you've mentioned that it's starting neutralize. We're seeing significant raw material or input cost inflation, and we are trying to pass through some of it. We expect to be able to continue to do that into 2023, but I don't want to overstate that factor. First one, just on Advanced Wound Care, a bit slower growth there than we were going forward and certainly with one of your competitors. Sure, I'll take the first one, and maybe Anne-Francoise can take the second. On Wound Care, I would say there's not any one particular factor. There's different forms to them at any given point, we do see interruptions in supply there. But I wouldn't call out any one factor that accounts for the relative softness there, but I will call out that supply has been a factor in that part of our business. Clearly, and you're right to ask with the dollar strengthening, that has an effect on us. And again, that's a number we'll update as we get into the full year guidance. I know you've indicated that, for instance, the EVOS replacing system should help from that perspective. Julien, maybe I'll start with the second one first, and I'll pass it over to Anne-Francoise. On Trauma & Extremity, so with the addition of EVOS Large, we now have the full complement to be able to enter into contracts. But with the addition of Large, we're actually able to go into RFPs and participate meaningfully. As Anne-Francoise mentioned, it did have an impact, and we expect it to have an impact over the next couple of quarters in terms of growth. But in the longer term, we have made some calls on markets where we expect to be competitive and have a good business that generates margins and also has the right returns on capital. So we're paced there by contracting cycles there, Julien. And we're very pleased with physician or surgeon reactions to the product, and we expect to be very competitive relative to systems on the market today. So in terms of being able to get to market levels of growth, it's just the ability to kind of now as contracts open up and RFPs open up to be able to compete there. I'll come back to your first question, Julien. So in terms of price, I think there's two ways to look at it. Clearly, in the short term, and we've referred to that in the presentation and earlier, it's about what can we pass on to customers given the current high inflationary environment. And we pulled all the levers we could, certainly, in terms of looking at lease price increases, contract compliance, renewing contracts. So we have to be clear, we cannot pass to customers all of the inflation we're seeing. So it's a really, really key fit in our performance in terms of being able to neutralize the historical price deflation. One, this is a couple that caught my eye, one was just around strengthening the last mile logistics. And secondly, the other one I wanted to pick up was just across the portfolio, I know you mentioned some market exits. The first part, in terms of last mile logistics, Robert, it's our ability to get sets to accounts that need them. So today, we've got actually very significant inventory in the field. So part of the issue there is we've got sets in places that don't actually need them, and we've got not enough sets in the places that do. And as a result, you've got reps spending a significant amount of their time chasing either sets of components in order to be able to support cases. So when I talk about last mile logistics, there's a number of components to that. First is leading the work of the logistics, the set completion and replenishment, to experts and logistics who are able to do that and offloading that work from reps that they can support -- that they can focus on commercial activities. And there's, secondly, having the system in place where things like set replenishment and set deployment happens based on where the greatest need is. So when I talk about processes to better match supply and demand, one aspect there is about establishing where the demand is and making sure things get to where they need to get to. So it is strengthening our entire logistics capability, which we're well along the way to doing. In fact, we've got the opposite problem today in Orthopaedics that we're trying to address. Related to the second part, in terms of exiting certain markets, it was a deliberate choice. It was a choice in taking a look at where the price points are, particularly in trauma and our ability to have an attractive margin profile for the business in these countries. So as you can imagine, decisions to exit a country in a particular line of business are approached with the greatest level of care and rigor in terms of decision-making. So we're confident of the decisions we made in terms of markets where we've chosen to compete with EVOs and where we've chosen to compete, we feel very, very good about the value proposition of EVOS and our ability to be competitive in these contracts that, as I mentioned, require the full system, the small, medium and large place, among other components of the portfolio. So there's two different, but related things. So the aspect of SKU rationalization, we kicked that off -- we've kicked off an effort around that, I think early part of last year, maybe even a bit earlier than that. So that's about reducing the number of SKUs in the product families we've got, and that's an ongoing exercise. We tend to run our business with a larger number of families, whether it's the knees or hips than our competitors do. So you could take an abrupt approach and in a relatively short period of time, reduce the number of product families. Now that we expect to have impact -- significant impact on our customers and of course, top line. We're being thoughtful in terms of how we migrate and transition our customers into a fewer set of product families, and that will take some time. And as I said, as a result of that, we expect that part of the 12-point plan to take a bit of time before we finally get to the end state. In the earlier comments, you highlighted, obviously, shared some of the challenges with cost inflation and the sort of balancing act you're doing, we're trying to push through higher pricing. I mean, clearly, you said it, we are not giving guidance for next year yet, and there are a few moving  when you look at the P&L. In particular, we know as part of the 12-point plan, where we need to focus on Orthopaedics and the cost of goods line, and all of that we'll be working through. So we'll come back to you with more detail, but clearly, there's a few variables on that line. So Chris, clearly, in terms of our midterm guidance, as we said, we're not giving guidance -- midterm guidance that includes 2024 in this call. We expect to give that along with our full year results, that's in February. So clearly, as I said before, they are aspirational, but we're in a good place in terms of accelerating -- our ability to accelerate top line. The trading margin has become more difficult this year, as you noted, with input cost inflation beyond what we had previously expected. So that's an area where there's still a lot of work to do, and the 12-point plan is aimed at not only the growth aspects of it, but the different levers we have to be able to offset that higher input cost. And we also expect that some of these elements will take some time, and also our margin expansion will come, but it will come in a nonlinear way or in a stepwise fashion. So putting all these pieces together and as we get a sense of how we exit the year, we'll be in a position in February to be able to give you an update on midterm guidance growth. What I'm focused on, Chris, is orienting the organization and executing on the strategy and driving the plan -- the 12-point plan as we've outlined here. As I indicated, early progress on that plan has been good, and we believe we will get to where we need to get to by executing well on this 12-point plan. So obviously, there's -- in this category, historically, in med tech, our ability to pass through prices has been rather limited. And as you allude to, there are some categories that are -- in which we're more able to do that than others. But, in general, you're right, there are some categories we're better able to do so than others. Unfortunately, we're not picking up any audio from your line. We thank you very much for your attention and interest, and we look forward to coming back in February to update you on full year results."
}