{
    "symbol": "KAR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 15:20:26",
    "content": " We generated a total gross profit of $171 million, an increase of 4% from Q4 of the prior year gross profit representative 62.1% of revenue excluding purchase vehicles. For the full year 2022, the finance segment generated $376 million in revenue, that was a 30% increase versus 2021 and that was driven by a 10% growth in transactions and an 18% increase in revenue per transaction to $241. Volumes in the wholesale marketplace are expected to remain below normal in 2023 and while we believe that lower used vehicle values will help drive more volume and will be a long term positive for us, and environment where used vehicle values are declining may put short term pressure on conversion rates before those longer term benefits are realized. Our guidance is based on similar marketplace volumes to last year, upside scenarios to arrange will include faster than expected commercial volume recovery, and an acceleration and dealer to dealer volumes, downside scenarios into the further contraction in wholesale supply below last year's levels and/or an increased risk beyond our expectations at AFC. At the guidance range that I've stated we expected the cash generated by our business after allowances for CapEx, interest payments, taxes and preferred dividends could reduce our company's net debt by another approximately $80 million to $85 million over the course of this year. But I think I'd say vehicle values would be the principal one, and then when you have lower conversion rate this is another factor, it puts pressure on gross profit, because if you think about you're inspecting a greater number of vehicles per every vehicle sold, for example when it comes to lower conversion rates, so that we generally find when conversion rates are lower, which they were gross profit per unit would be a little bit under pressure. You mentioned 15% to 20% EBITDA CAGR going forward, can you help us like the confidence of that how should we think about volume recovery, you're expecting that flows through that, and also how that volume recovery is slowing to gross profit and the SG&A annual average on that."
}