{
    "symbol": "KAR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 12:48:09",
    "content": " During today's call, I will provide you with additional information and detail in three areas: first, our capital allocation strategy following the completion of our recent divestiture of the ADESA U.S. physical auction business; second, our view of the current market factors that continue to impact the automotive industry; and third, our second quarter performance and outlook for the remainder of this year. So to summarize, I think it's fair to say that while the supply side equation remained very challenged during Q2, it didn't materially worsen versus Q1, and there is still widespread consensus amongst our commercial sellers and our dealer customers that these market factors that we've experienced over the past year-and-a-half are temporary and that if supply returns, prices will tend to rationalize, returning us to a more normal wholesale environment overtime. The items accounting for the increase are $10.3 million in non-cash stock-based compensation, $4 million in SG&A for CARWAVE, an acquisition that occurred after the second quarter of 2021, and $1.4 million in non-recurring severance as we exited headcount following the close of the sale of the U.S. physical auction business. And I think while it's not perhaps yet fully apparent in our metrics, I think a lot of these, the work we've done around the cost structure that I think will become more apparent here in coming quarters, the work around the consolidation and creating -- ultimately creating greater efficiency in system, I think will be very, very powerful for us as volume starts to recover because again, you know this business, like most businesses has a scale effect. I guess what I'd say is I'm expecting us to end the year with an SG&A run rate, something around $400 million give or take, I don't want to give a precise number, but I think something around that and that, that will be obviously down on what we've seen certainly in a number of a prior quarters."
}