{
    "symbol": "SERA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 19:56:07",
    "content": " At the close of the market today, Sera Prognostics released its financial results for the quarter ended June 30, 2022. Presenting for the company today will be Greg Critchfield, Chairman, President and CEO; and Jay Moyes, our CFO. During the call, we will review the financial results we released today, after which we will host a question-and-answer session. If you not had a chance to review our quarterly earnings release, it can be found on our website at seraprognostics.com. Please note that some information presented today may contain projections or other forward-looking statements about events and circumstances that have not yet occurred, including plans or projections for our business, future financial results, and market trends and opportunities. We refer you to the documents the company files from time-to-time with the Securities and Exchange Commission, specifically the companyâ\u0080\u0099s Annual Report on Form 10-K, its quarterly reports on Form 10-Q, and its current reports on Form 8-K. As a reminder, a webcast replay of this call will be available in the Investors section of our website. I will now turn the call over to Greg, Sarah Prognosticsâ\u0080\u0099 Chairman, President and CEO. Today, I will provide an overview of key business highlights during the second quarter and discuss some upcoming developments. During the last quarter, we aligned our sales structure to better emphasize pursuing contracts with early adopter health systems that have various degrees of integration in ways they provide healthcare services to pregnant women. Several examples of these include university systems, with as many annual deliveries as 8,000 per year were clinical and administrative leadership see the value of comprehensively managing the risks of prematurity inherent yet undetected in the population by traditional methods. Another example is integrated delivery network or IDNs, some of which have more than 30,000 annual deliveries where the organizations are institutionally focused on managing the health of patients with a comprehensive array of services offered in a cost-effective manner. Managed Medicaid is another area of focus, where we are in active discussions with participating payers and state and federal officials with the goal of reducing healthcare disparities. One such state has more than 80,000 Medicaid deliveries annually. In addition, we continue our work with non-profit organizations dedicated to addressing the health disparities that occur in pregnancies with Seraâ\u0080\u0099s preterm technology that is well suited for unserved populations. Other systems of opportunity are certain large geographically concentrated physician networks, with the ability and desire to lead in the delivery of better care for their patients, where examples of these kinds of networks include those with 2,000 annual deliveries. And finally, we are also engaging with six large hospital systems comprising more than 71,000 deliveries per year, where tight collaboration with two clinical leadership and hospital administrations potentially enables greater uptake of Seraâ\u0080\u0099s strategy. In addition to the benefit of accessing large numbers of pregnancies by the systems approach, renegotiation of price has the benefit of securing more prompt reimbursement with less uncertainty post contract execution. In systems adopting our testing, our emphasis is on training and implementation with the administrative level and clinical decisions to move forward having already been made. Ultimately, working in concert, they help to educate the physician practices regarding the clinical prediction performance of the pre-term test, the logistics of patient identification, requirements for sample acquisition, data integration, reporting and follow-up. We believe that this approach may help us to post significant revenues earlier in our mid- and longer-term outlook as we penetrate a very large asymptomatic pre-term testing market with the only broadly validated, commercially available prognostic blood test on the market. While we are admittedly early on, the opportunity is quite large, and this focused approach to commercialization is important to recognize that the time to bring on systems comprised of multiple customers has the potential to efficiently drive revenues for the efforts, as we build more comprehensive implementations. Soon, we will be making public -- selective public announcements of progress on these efforts that will serve as milestones along the highway towards widespread pre-term adoption. While we'd like to announce each and every one of these in the interest of transparency, certain systems do not allow publicity of any kind and some individual systems may be smaller, but we will strive to share important developments. As the first wave of early systems adopters begin using our test, we believe that their experiences will also help to support the decision-making of other payers who prefer a derisked situation where others have already done the analysis and decided to adopt. That capability forms the basis of Seraâ\u0080\u0099s vision, to improve the well-being of mothers and babies and in so doing to reduce health care costs. As you can see, the aggregate potential numbers I'm discussing today across all forms of these health systems, including self-insured employers are very large. As we are even mildly successful in executing on agreements with a number of these, we believe the revenue ramp will be notable over time. In May, we announced exciting and important improvements in the pre-term test performance. We demonstrated that compared to traditional methods, PreTRM testing detects five times as many pregnancies that will, in fact, have spontaneous premature deliveries with a sensitivity of nearly 90%. And at the same time, the PreTRM test demonstrated a very high negative predictive value of 99% in patients whose PreTRM tests are interpreted to be lower risk. This is very powerful stratification in addition to these performance improvement numbers, the PreTRM test was recently validated in an expanded time window for collecting blood now from 18 to 20 weeks, allowing physicians to more easily schedule patients for PreTRM risk devaluation by Sera's innovative tests. That work has progressed very well, and we are preparing it for a scientific review. If successful, we expect to be the only company to have the capability of addressing the two most important adverse outcomes of pregnancy with validated tests for each condition taken from the same blood draw. For example, typically, a blood test sample must be kept cold after blood is drawn and as it is transported to the laboratory. We are currently working to validate a collection transport mechanism without the need to freeze the specimen, which should significantly expand the number of sites where blood can be easily collected. This includes work on validation studies of new biomarker signatures based on our biomarker platform, as well as health and economic analysis of the PreTRM test in new populations. While as a result of the pandemic, clinical trial enrollment can be challenging, we are currently on track to enroll approximately 2,800 deliveries in the multi-center PRIME study by year-end 2022. First, we are continuing to add study sites to the PRIME study. And second, we are using the new expanded blood draw window during weeks 18 through 20, which increases the chance to enroll more subjects in a number of practices that conduct mid-pregnancy evaluations of patients as early as 18 weeks. This is important with accelerated enrollment, a positive interim look either improvement in neonatal morbidity mortality or decreased hospital length of stay, providing possibility of stopping the trial earlier. This, in turn, could have obvious benefits such as reduced costs from not having to continue the trial and giving us the opportunity to present additional earlier transformative data to payers and other customers. We are pleased to see progress clinically, scientifically and commercially at this stage of our development. Thanks, Greg, and good afternoon, everyone. Today, I'll briefly review our financial results for the second quarter and provide some general color on cost reduction efforts we've undertaken and our high-level view on testing revenue throughout the rest of the year. For the second quarter of 2022, we reported revenue of $70,000 compared to $20,000 for the second quarter of 2021. Revenue for the second quarter of 2022 was also up significantly sequentially from $38,000. As Greg noted, we are seeing traction among early adopters, and this is fostering improvement in revenue. Selling, general and administrative expenses for the second quarter of 2022 were $8.5 million, up from $4.6 million for the prior year period, due primarily to increased head count as we scale commercial operations and general corporate infrastructure as well as increased costs relating to operating as a public company following our IPO in July of 2021. As of June 30, 2022, the company had cash, cash equivalents and available-for-sale securities of approximately $121 million. On our last quarterly call, we mentioned that we believe we have sufficient capital to implement our strategy into 2025 without raising any additional capital. Since then, we've executed cost reduction actions, including streamlining our sales force and focusing our commercial strategy on integrated customer systems, as Greg mentioned, to extend that runway even further into what we anticipate is now 2026. In this regard, we are pleased to have the support of our investors to pursue our plans about -- without capital constraints, some companies in our space are facing right now. As a result of cost reductions and with continued adoption of the preterm test by payers, we anticipate a reduction in cash burn over time while revenue builds. Thanks, Jay, and thanks to all of you for attending our call today. While the scaling of our revenue is taking longer than we like, we are pleased to see some exciting trends on our early adopter integrated systems to customers, which is a solid proof point for our business. Finally, we are very pleased given the current macro market conditions to have sufficient cash to execute on our plans over years due to the excellent support of our investors. First, I was just wondering, I think last quarter you provided month-to-month update sequentially in terms of how orders increase. And we're anticipating seeing that trend to continue, and we're very excited about it. And as we said, the traction that we're getting with integrated systems is already beginning. We have contracts that have been signed, that have not been disclosed publicly, and that's something that happens, because there are many organizations that don't allow public disclosure. But what we can tell you is we are making progress, and we're excited to see growth in the number of orders and ultimately in revenue. We've not really given a guidance on physician reorder rates, but what we can tell you is the source of our growth is both new physicians coming on and existing physicians continuing to order more tests. The early adopter strategy is something that we've been working on, as I said, in the last couple of quarters. As you know, when a physician orders a test and the test result comes back positive, there are certain things that physicians will do because that pregnancy is flag as being at high risk. And we're finding that it's easier to do that once you've made the decision to go forward, it's easier in a system to be able to get it done. They have -- many of them have exceptional access to services they plug patients in, they see them. But it is easier for a systematic approach, and that's why our strategy is going in that direction. And in doing so, the entire system comes on board, and it's just a matter of time to educate and to implement those physician practices that are under that umbrella. Similar to that, I understand the systems approach you guys are going after. You guys mentioned today that, there were changes in your sales force that were made last quarter. And what we've done is we focused our sales team on integrated systems, where we -- we have metrics that we use to select which ones we know. It depends on the size, it depends on the opportunity, it's depends on the connection and a target list of these is assembled and we go after those systems. As I said before, we will have announcements forthcoming announcements on these as we move through the next several months. And just one more forâ\u0080¦\n The one other point I'll make, and I don't want to belabor this point, but I think it's an important one to emphasize. Getting in, in many ways, it's a high-level sale to an organization, where the leadership of -- the leadership of the organization come together, they discussed the opportunity carefully by the organization, and the organization makes a concerted decision to move forward. Once that happens, then we switch into an implementation mode where we go in, we work together with them to -- with all the various disciplines that are required to make sure that it is a seamless, integrated effort as we implement. You've got a system of people, multiple customers are under that same group and that entire organization comes on board. And as I said before, we do expect that the notable revenues are possible in the future because of that approach. And as I said in my remarks, that work has gone very well. This year, the goal is to validate â\u0080\u0093 we've not been projections of when any of the products will yet be available but that â\u0080\u0093 the validation is a predicate for that happening. And one final one, I think you might have mentioned other payers coming online or expected to come online. Clearly, publications where clinical utility and economic utility are demonstrated are very useful for all payers. Those are â\u0080\u0093 and there are readouts that we anticipate coming where that will â\u0080\u0093 those kinds of things we believe, will be beneficial in our conversations with payers. The PRIME study is a multicenter study done â\u0080\u0093 we've actually increased the enrollment in that study, and having the enrollment increase and having a blood drop window increase inside allows us to finish that study sooner. Seeing that, there is demand, seeing that people are using it and many of the implementations we're talking about, people are going to be very public with what they're doing with the information and be able to talk about how this is enabling them to take better care of pregnant patients. The more the word gets out, the more people see those kinds of things, that will have a beneficial effect in helping to also generate more revenues for people that are â\u0080\u0093 that haven't quite decided yet, but are asking that question. Thanks for â\u0080\u0093 thanks for taking the question, guys. Maybe just starting with PRIME, I think at the end of July, ClinicalTrials.gov had you guys still recruiting for PRIME? The goal for this year, Dan, is 2,800 deliveries before year-end, and we're on track for that. And as I said before, the increase in the number of enrollment sites and the expanded blood draw window, we believe are driving that. So once those pregnancies are enrolled, pregnancy has a very important feature that we let's not forget. But if the enrollment takes place in the middle of pregnancy, you have to wait until the end to know what the outcomes are. And what we're saying is during 2023, this one -- the interim look will be unable to take place. And as I said before, with an interim look, it's positive, positive one of the two primary endpoints is positive, either an improvement in neonatal morbidity mortality or a decrease in hospital length of stay. Either one of those is a -- an end point of which itâ\u0080\u0099s either positive, then the trial can be stopped and it will be finished earlier. If it isn't, then enrollment will continue to the end, and it will take longer to recruit but we anticipate that in 2023, we'll have sufficient numbers of patients enrolled to be able to conduct that interim look. And as I said before, it is not certainly that's because it works, that's the goal that we're aiming for. So if you go five, six months beyond the time -- the last patients enrolled, that's the time that the patient would deliver, then the time for data cleanup and analysis takes a little bit longer. The sensitivity of 88%, nearly 90% holds true in that expanded window. Those numbers come from that expanded window where we've demonstrated that, in fact, it does work. If you're able to detect the somebody at risk even a week earlier, you can actually begin proactive interventions a week earlier. We have validated it across populations in the US, the biomarkers performed well in other geographies. It could be the intervention effects, and we're not as strong as one might anticipate, everything that we see now, all the data that we have and all the work that we've done in biomarker development demonstrates that it should work. And so the question is, if it doesn't work, it may be more a situation where the interventions are not as effective. Stratified it works â\u0080\u0093 it works very, very well. It didn't show that problem in the first trial that was published in PTP trial, where were significant reductions in hospital length of stay and severe morbidity and mortality, they were both improved. What I can tell you is we're starting early, and we're focusing on sales geographies and opportunities that are there. And we -- as we build -- as we move forward, our hiring rate will be based on seeing success and where opportunities are. This is a very important principle in novel diagnostic companies, where you have something that you're deploying and you want to be able to see the effect you're penetrating the market before you invest in a much larger sales force. There are 18,000 physicians that deliver babies in the US. And if you look at the number that the salesperson usually have in their accounts, in their territories is somewhere in the order of 70% You run the math as you get close to 250 for a number. What we're driving towards is implementations that work, early adoption and continued progress with data and ultimately bringing more payers on board. And then we will expand selectively, opportunistically, as their support and payment for our test. So a lot of it, not necessarily â\u0080\u0093 necessarily focused on a specific reduction but on somewhat of a reorientation and focus so that we can maximize the â\u0080\u0093 the benefits that we get from each of our salespeople. So I know when you had first pulled your 2022 guidance, obviously, the future is about the success of the study and improving contracts and coverage and then really see the ramp. But net-net, I know when you had pulled your guidance it was due to COVID with a factor lack of access to doctors office things of that nature. We were not revising that at this point, as I mentioned earlier in the call. I don't know, Greg, if you want to add any more color to that, but no change in the guidance. I think the -- as we get further in the year, as we see more success, we'll be evaluating, how we think about it and be signaling properly to see how to think about it. But right now, there's been no change. Obviously, we'll see how Prime plays out. In the meanwhile, we will be penetrating additional customer systems and really working to drive this in these integrated groups of customers that we have. So, we're not sitting by idly that's just waiting for that to happen and let's just take the fires have to be bit, it isn't. That -- when that happens, it will take sometime. But this will all be implemented on a backdrop of continued growth of the product, continued penetration of the market. I want always to remind everybody, the candidate pregnancies for our test is more than $3 billion a year in the U.S. So those are people who are eligible, who would be the indicated use patients for the test. This concludes the call, and we look forward to providing an update on our business when we report our third quarter 2020 financial results."
}