{
    "symbol": "CIDM",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-14 22:45:06",
    "content": " Obviously, we had a great quarter as our financial results exceeded our internal expectations and those of the analysts that follow us by an extremely wide margin on both the top and bottom lines, with total revenues up 98%, net income up 1,139% to $4.9 million and EPS of $0.03 per share. While so many other companies in the streaming and entertainment business are struggling to figure out the best path forward as they try to reconcile years of record-breaking spending on content and marketing and an over-reliance on the paid subscription model, Cinedigm continues to demonstrate how a streaming content company can develop and execute a business plan that works successfully in real time today because of sound and reasonable business principles like diversification, portfolio management and a sensible content and marketing spending practice. All units of our company contributed to our successful quarter, which speaks to the value of our differentiated revenue streams across content licensing, our portfolio of channels, which are made up of a strategic mix of third-party and owned and operated networks and they span SVOD, AVOD and FAST, our library of 60,000 films and TV episodes, our resurgent theatrical release business and our proprietary state-of-the-art Matchpoint technology. Our key third quarter financial results for the quarter ended December 31, 2022, include: consolidated revenue of $27.9 million compared to $14.1 million in the prior year quarter, an increase of 98%. Our adjusted EBITDA was $5.1 million in the current year quarter compared to adjusted EBITDA of $1.3 million in the prior year quarter, driven by the phenomenal success of Terrifier 2 across multiple revenue streams, as Chris mentioned our streaming content growth and further decreases in the scale of our digital cinema business as it nears its end of life. First, we have dramatically expanded our content library, now totaling close to 60,000 movies and shows, bucking the industry trends, weâ\u0080\u0099re focused on rapidly making all these sales available to consumers and are adding thousands of titles per month to Cineverse and its sister streaming services and plan to add 4K and uncut versions of films for subscribers in the coming months."
}