{
    "symbol": "CIDM",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-16 17:46:07",
    "content": " As we've said previously, the seven whole upstreaming acquisitions we made over the last two years alone, brought in 15 new channels, 15,000 new films and TV episodes, and full ownership of our industry leading Matchpoint streaming platform, all of that on top of our triple digit organic streaming growth during that period. Despite this loan-planned wind down and much lower recognition of equipment sales this year, because of our continued hyper growth in streaming, we still expect to generate significantly higher total full year revenues in this fiscal year versus last year. Cinedigm's diversified channel strategy, our huge modern streaming content library, our industry leading Matchpoint technology, and our stellar management team position us to not only capitalize on that future, but to also quickly become a high growth, high margin and uniquely sustainably profitable streaming company. We are reiterating our long term growth goals for the next two to four years, including targeting at least 50% annual revenue growth in streaming, growing our annual revenue to $150 million through both organic and acquired revenue, and growing the content library to 75,000 titles. Despite all that, we fully expect to generate substantial full year total revenue growth for the company this year versus last year, where our consolidated revenues were $56.1 million, up 78% over the prior year. Our ad-supported streaming audience, including web, mobile, social, Connected TV increased to approximately 89.6 million monthly viewers, up nearly 300% over the prior year quarter, and total subscribers to the company's subscription video streaming services increased to 984,000, representing an increase of 45% over the prior year quarter. And we don't see any issue with both becoming sustainably profitable by the end of this year, as we said, with the cuts that John mentioned and also hitting that target of $150 million in revenues, and Erick explained the components of how we're going to get there."
}