{
    "symbol": "CIDM",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-15 18:13:04",
    "content": " While still in theaters on Halloween, we also launched Terrifier 2 on our Screambox, horror streaming channel, fueled by continued heavy viral marketing by Bloody Disgusting, the film has already driven increased traffic on Screambox of more than 250%, with subscriptions up more than 295% compared to the channelâ\u0080\u0099s previous high month. In what is seasonally our slowest quarter, the second quarter, we increased consolidated revenue by 39% compared with the previous year quarter, grew total streaming revenue by 78%, grew ad revenues 102%, our 10th straight quarter of record ad revenue growth and we increased our paid subscriber count by 48% over the prior year quarter to 1.06 million subscribers. Now we generated these stellar results because Cinedigmâ\u0080\u0099s extraordinary executive team is delivering exactly what we have promised, having now rolled up seven streaming content and channel acquisitions, including the aforementioned Bloody Disgusting and Screambox, expanding our enthusiast channel portfolio to 30 channels, building our content library into one of the largest modern streaming libraries in the world with over 50,000 films and TV titles, and leveraging our highly automated proprietary Matchpoint distribution platform across multiple revenue streams. John will cover our financial results in more detail and Erick will delve into the early success of our key business initiatives that we launched this year to further drive the business forward, including Cineverse, our flagship channel that debuted in September with several streaming channels and thousands of hours of content across multiple genres. Total streaming revenue increased 78% to $8 million, driven by another record increase in ad-supported revenue of 102% and a 38% increase in subscription revenue over the prior year quarter. Our adjusted EBITDA was negative $1.3 million in the current year quarter, compared to a positive adjusted EBITDA of $0.7 million in the prior year quarter, due to a decrease in legacy Digital Cinema system sales and eligible VPF systems as we winds down that legacy business, as well as higher direct and SG&A costs immediately following Q1 acquisition activity. And we are -- to your second point, we are extremely encouraged that there will be more successes like Terrifier 2 in our future, because we have added through these acquisitions that we have done and through our own capabilities, a real expertise and an acumen and identifying whatâ\u0080\u0099s going to work in the marketplace in the genres where we have released tons and movies, where we have streaming channels, where we think we have capabilities and expertise and data that our competitors donâ\u0080\u0099t have. But I think as I -- in my answer to the last question, as we move forward, we are going to continue to have a very robust business releasing films in a limited release and the end date VOD and we will probably be doing one or two wider release movies, hopefully, in the same way we did it with Terrifier 2 in a smarter, much more profitable way than the traditional releasing business."
}