{
    "symbol": "NVGS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-24 15:50:21",
    "content": " We achieved a quarterly adjusted EBITDA of $55.7 million, resulting in a strong balance sheet with $168 million in liquidity, roughly twice as much as last year, and we continue to reduce our debt levels through program debt amortization. During the first quarter, the company generated a net income of $27 million, which equates to $35 a share or $12.6 million or $0.16 per share if the unrealized gains on derivative instruments and foreign exchange losses are eliminated. The adjusted EBITDA for the first quarter was $55.7 million, a record for the company, which compared to $31 million for the first quarter of 2021 and to $55.2 million for last quarter, Q4 of 2021. There was an additional $13.5 million generated as a result of the revenues derived from the Unigas Pool, representing revenues from the now nine smaller Unigas vessels following the sale of the Happy Bride and 1999 built 8,600 cubic meter LPG carrier in March 2022. We also continue to see an increasing charter rate environment during the quarter, which accounted for $3.4 million of the increase in revenues this quarter as average charter rates rose to $22,933 per day or $697,500 per month, compared to $21,956 per day for the first quarter of 2021. Vessel utilization to – nudged up to 89.5% for the quarter, compared to 88.2% a year ago, contributing an additional $1.1 million to revenues. The operating revenue from Luna Pool was $5.9 billion for the quarter, representing our share of the other participants' net revenues, which voyage the expenses from the Luna Pool of $4.6 million representing the other participants' share of our net revenues from the pool. Consequently, our vessels had a net benefit of $1.3 million from the pool during this quarter, similar to the $1.1 million benefit in the first quarter of last year. Voyage expenses increased by 33.2% or $5.2 million during the quarter to $21.9 million, primarily as a result of the seven additional handysize vessels in the fleet, most of which were subject to voyage charters, thereby incurring these pass-through voyage expenses. In fact, vessel operating expenses per vessel per day reduced again this quarter by $51 per day to $7,841 per day, compared to $7,892 per day for the first quarter of last year and approximately $8,000 day for the last quarter of 2021. Depreciation on our vessels during the quarter increased by 63% or $12.2 million, when compared to the first quarter of last year. First, there were 16 more vessels in the fleet during the quarter compared to last year, which accounted for $5.8 million of this increase. And secondly, following the company's decision to reduce the estimated useful lives of our vessels from 30 years to 25 years at December 31, 2021, the effect on depreciation was, and will be an increase of approximately $6.1 million per quarter. General and administrative expenses were approximately the same for both comparative quarters at $6.3 million with the increase of costs relating to Ultragas of $1.2 million being offset by a reallocation of technical management costs to vessel operating expenses and a reduction of costs generally associated with the closure of the New York office and other income being management fees earned from the other participants for our management of the Luna Pool was just under a $100,000 for the quarter. The unrealized gains on derivative instruments were $15.2 million for the quarter, primarily relating to movements in the fair value of interest rate swaps as the five-year LIBOR swap rates have risen significantly over the course of the last quarter. Interest expense for the quarter was $11 million, an increase of $2 million on the first quarter of last year, all of which was as a result of interest on the additional $183 million of debt outstanding associated with the Ultragas vessels. But now that we better understand the capability of the terminal, the EBITDA guidance for 2022 is increased to between $30 million and $35 million based on the annualized profits of the past two quarters in addition to annual depreciation at the terminal of $5.2 million. During the first quarter in January, 2022, we sold Navigator Neptune, a 2000 built ethylene carrier for $21 million. On the graph on the right and side of Slide 11, we outline with the bar on the left of that graph, the annualized EBITDA based on Q1 2022 thereafter, each bar moving right shows the potential EBITDA if the average charter rates across the fleet were to rise by $1,000 per day, giving EBITDA of $260 million if the charter rates were to rise to approximately $25,000 a day and $350 million of charter rates climbed to $30,000 a day."
}