{
    "symbol": "NVGS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-21 16:39:03",
    "content": " As we show here on Slide 6, the net income and EBITDA for the fourth quarter was $10 million and $59.4 million, respectively, an improvement on the third quarter of 2022, giving a trajectory that is expected to continue into 2023. The total operating revenues for the fourth quarter were $123.3 million, $9 million less than the $132.3 million for the comparative fourth quarter of last year was $16.5 million higher than the $106.8 million achieved in the third quarter of 2022. However, these decreases were offset by an increase of $4 million as a result of increasing charter rates which rose from just under -- just over -- sorry, just under $22,500 per day for the fourth quarter of 2021 to $23,621 per day for the fourth quarter of '22, an increase of $1,100 per vessel per day, as well as an increase of $2.6 million as a result of increased utilization which, as Mads said, has increased from 91.4% for the fourth quarter of 2021 to 94.1% for the most recent quarter. Consequently, the other pool participants' vessels contributed $800,000 to us during the fourth quarter and $1.1 million -- sorry, $1.4 million over the 12 months of 2022. Voyage expenses, as I referred to a moment ago, decreased by $5 million or 22% during the fourth quarter to $16.9 million which had the effect of reducing revenue, as I just mentioned, as these are pass-through costs. Our vessel operating expenses increased by 8.7% to $43.9 million for the fourth quarter compared to the fourth quarter of 2021 which resulted in vessel operating expenses per vessel per day increasing quarter-on-quarter by 12.9% to $9,058. Depreciation of our vessels increased by 19% to -- or $4.9 million compared to the fourth quarter of 2021, primarily as a result of the reduction in the estimated useful life of our vessels from 30 years to 25 years which occurred on January 1, 2022. Depreciation for 2023 is expected to be approximately $130 million to $134 million, an increase in 2022 as a result of the additional 5 ethylene vessels acquired or to-be acquired from Pacific Gas. We redeemed our $600 million Norwegian bond in -- on December 23, 2022 and the foreign exchange loss incurred during the quarter relates to the retranslation of that bond between September 30 and the debt was repaid, resulting from the strengthening of the Norwegian kroner relative to the U.S. dollar. We have fixed interest rates or have entered into interest rate swaps for approximately 52% of our debt as at December 31, 2022 at LIBOR or SOFR levels that are fixed between 0.36% and 2% in addition, of course, to our 8% fixed rate $100 million unsecured bond. Our share of results from the ethylene export terminal were $7.9 million for the quarter based on throughput charges relating to 263,000 tonnes of ethylene exported through the terminal compared to 234,000 tonnes during the fourth quarter of last year and significantly higher than the 190,000 tonnes throughput during the third quarter of 2022. The tax charge for the full year 2022 was $5.9 million, of which $5.1 million relates to the 21% U.S. tax charge on our share of the profits from the ethylene export terminal. Net income for the fourth quarter was $10 million, as I mentioned, or $0.13 per share giving a total net income for 2022 of $53.5 million or $0.69 per share. As shown on Slide 8, during the last quarter of 2022, we extended the maturity of one of the bank loan facilities by 1 year from 2024 to 2025, refinanced another facility that tranches maturing in 2022 and 2023 by means of a new $111.8 million facility and we entered into a $151.3 million facility for our 60%/40% Greater Bay joint venture to part finance the acquisition of the 5 ethylene carriers from Pacific Gas. The total capital contributions required from us to Joint Venture for this expansion are expected to be approximately $120 million to $130 million, commencing in the first quarter of '23 and ending in the fourth quarter '24 which the company expects to fund using a combination of cash on hand and additional debt financing."
}