{
    "symbol": "CX",
    "quarter": 4,
    "year": 2021,
    "date": "2022-02-10 17:59:05",
    "content": "  Operator: Good morning, and welcome to the CEMEX Fourth Quarter 2021 Conference Call and Webcast. I'm quite proud of 2021 results, and I want to offer my congratulations and thanks to the men and women at CEMEX who make this happen any day. First and most importantly, it's another year of COVID. As we also achieved an exceptional financial and strategic performance, during the year, we delivered 18% growth in EBITDA, the highest in a decade. While we achieved admirable cement pricing results with the best annual growth since 2015, it still was not sufficient to compensate for rising energy and transportation costs. Traditionally, the most significant price action in our industry takes place in January and April in most markets around the world. While we expect that this year's annual increases will be important in our goal to recover margins, we will continue throughout the year to adjust our pricing strategy to reflect cost pressure. Adjusting for asset sales, we reached an 8% return of capital for the year, the highest level since 2007. In terms of free cash flow, we generated more than $1.1 billion, a 15% increase from 2020, money that we used to deliver as well as fund our growth strategy. Consolidated volumes for cement, ready-mix and aggregates grew mid-single digits with all regions contributing to growth. The model increase was complemented by strong pricing with consolidated cement prices rising 5%, while point-to-point pricing from December to December rose 10% is to share a strong runway for pricing momentum in 2022. Full year EBITDA increased 18%, the largest increase in more than a decade driven by pricing or volume. While the contribution of pricing is quite significant in the full year waterfall, it does not fully offset the rise in variable cost largely in energy, freight and inputs. And of course, the annual results will not show the rapid increase in cost we experienced in the second half. In cement, majority of pricing actions occurred in the period from January to April prior to the start of the construction season. Around midyear, we began to experience a significant runoff in cost, primarily energy and inputs that were not contemplated in our pricing strategy. While we moved quickly to adjust this year with additional  price increases, it was not sufficient to get paid with costs. Consolidated margins declined 0.8 percentage points in the second half, While ready-mix and aggregate margins held up well, cement margins were impacted. And while we were quite successful in the year with cement prices, it was not sufficient. As you can see on this slide, Cement prices rose 5% in 2021, the best pricing we have seen since 2015. And in 2021, we continue to strengthen our capital structure with perhaps the most visible metric mean leverage dropping below 3x for the first time in years. We invested heavily in our growth portfolio 2021, spending $380 million, the most in the last decade and continue to reposition our business towards developed markets. For 2022, we plan to accelerate the pace with an expected $600 million investment in strategic assets. This includes execution on our pipeline of close to $900 million in approved bolt-on market enhancement projects are mainly in developed markets, as well as legacy cement capacity additions of 4.3 million metric tons. Importantly, our growth strategy is paying off resulting in $100 million of incremental EBITDA in 2021 and an estimated $100 million for 2022. To that end, we announced in fourth quarter the pending sale of our operations in Costa Rica and El Salvador for $375 million. And most importantly, we made significant progress against our climate goals in the third year. The goal of our future action strategy is, of course, to provide green products and services for the customers so that the built world of the future is more sustainable and . As of March 2021, we have successfully rolled out net-zero low-carbon concrete and low-carbon cement under the best drop label in our market. These products complement our existing family of sustainable products and solutions, the time the meet the needs of a green and circular economy, reducing energy consumption, improving insulation, enhancing the capacity structures to withstand climatory factors and, of course, reducing carbon emissions. Finally with Danish modular 3D printing company COBOD, we successfully launched D.fab, a ready-mix solution for 3D printing that's costs 1/5 of the cost of specialized motors traditionally used in 3D printing. This product has been successfully used in 2 residential projects, including the world's largest 3D printed building. With our enhanced decarbonization road map in place, we'll reduced our current emissions by 4.4% to a historic low for CEMEX. In U.S., we have introduced limestone cement in 5 of our 8 plants, and we are retrofitting our plants to support additional limestone cement utilization in the future. With our ongoing Synhelion partnership, we announced last week that for the first time, we have produced clinker using solar energy. As the largest ready-mix cement in the western world, our ability to transition our fleet to electric would be a high event. Our recent announced partnership with HiiROC on the new hydrogen injection technology will further accelerate this strategy, allowing us to increase hydrogen usage fivefold. the world map embrace , a truly circular economy and the cement industry play an important role in this. The ability of cement plants to use society waste as alternative fuel reduce fossil fuel consumption as well as the amount of waste deposited in landfills when it produces methane, a greenhouse gas that is 80x more harmful to the environment than CO2. In 2021, alternative fuels constituted 29% of our fuel mix, a record substitution rate. Europe, of course, leads the way with approximately 60% of our fuel mix in alternatives. During 2021, our Mexican operation consumed approximately 13% of the total waste generated in Mexico City. We continue to expand this business in fourth quarter, announced the acquisition of a sustainable waste management facility in Querétaro. I would like to emphasize that our transition for a no-carbon economy is not only good for the world, but it's also profitable for CEMEX. In 2021, alternative fuels accounted from 29% of our fuel mix and produced ratings of $200 million versus fossil fuel. And when it wasn't built for the pandemic, it's been an important competitive advantage for us over the last few years. CEMEX Go and service is a key factor in our security, the highest cement promoter score ever for 2 consecutive years. On the operations side, machine learning is helping us along our cement plants more effectively and we use to optimize energy efficiency, fuel mix, carbon production and scheduled maintenance in our team. Today, CEMEX Ventures have invested in 16 start-ups, including , which provides last-minute last-mile delivery of building materials and voice control and just site delivery coordination platform. Sales grew 9%, driven by volumes and pricing. Cement, ready-mix and aggregate volumes were up 6%, 8% and 1%, respectively, with the residential sector as the main engine of growth. Despite difficult prior year comps, cement volumes in the fourth quarter were flat with double-digit growth in Florida and Arizona, offset by winter weather in California. For the first time in 15 years, we introduced a successful second national pricing increase. As a result, fourth quarter sequential cement prices rose 1%, while year-over-year prices increased 6%. January price increases took effect in Florida, Southern California and Colorado, regions which represent approximately 40% of our cement volumes. Given the continued cost pressure, we have advised customers that they should expect a second pricing increase in the year. Energy cost, primarily fuels, rose more than 20% in the second half, while imports increased almost 30% year-over-year. As a result, EBITDA margin declined 1.2 percentage points in 2021. To offset some of the rising import costs pressure in 2022, we will take full advantage of imports from our Mexican operations, a key competitive strength. We expect a low single-digit growth in volumes for cement, ready-mix and aggregate, driven by the residential sector and the recovery in industrial and commercial. Despite rising interest rates, we are confident we will continue to see residential growth driven by backlog in housing demand. Finally, for infrastructure, we expect the new Biden Infrastructure Build to yield incremental demand for our products towards the end of 2022. In 2021, we saw double-digit bag cement growth during the first half, supported by government social programs and record level remittances slow in the second half as the comps became more difficult and we move out beyond the midterm elections. As the formal economy picked up steam, bulk cement and ready-mix volumes benefited from higher formal housing and industrial activity. Industrial activity was supported by growth in manufacturing and warehouses, onshoring as well as the build-out of logistics networks. In fourth quarter, cement volumes declined largely due to a difficult comparison base with fourth quarter 2020 volumes, the highest since 2014, driven by pandemic housing improvements and government social programs. While plan prices grew 9% point-to-point in Mexico in 2021, this increase was not sufficient to compensate for rapidly escalating cost inflation in the second half driven largely by energy. While full year margins expanded 0.5 percentage points, we saw a deterioration in margins in the second half with fourth quarter margin declining 3.2 percentage points. The compensate for input cost inflation, we announced mid-teen percentage price increases for our products effective January 1. In addition, our climate action strategy is also helping us to respond to cost pressures in Mexico. In fourth quarter 2021, our alternative fuel consumption in Mexico reached 28%. Regarding 2022, we expect our cement volumes to be flat or decline low single digit, while ready-mix and aggregates increase between 2% and 5%. With high capacity utilization and the entire industry facing similar cost challenges, we are confident that we should be able to recover input cost inflation. In EMEA, top line annual growth of 6% was driven by higher prices and volumes in most markets. European volumes were up mid-single digits across our core products, led by increasing infrastructure and residential activities in the U.K., Poland, France and Spain. We achieved record cement volumes in Europe, led by double-digit growth in the U.K. with most markets above pre-COVID levels. As a result, our European cement prices in local currency terms rose 1% sequentially and were up 4% for the year. We've already announced price increases for January and April in Europe, which we expect will offset inflationary pressures from energy and raw materials. With our favorable carbon credit position, we have not been affected by the rapid run-up in carding cost in 2021. Finally, in Europe, our urbanization solutions business was an important driver of EBITDA growth. In the Philippines, cement volumes were up 7% with all sectors growing. Volumes were heavily impacted in fourth quarter by tightening of debt, which caused significant disruptions in the central part of the country. In Israel, construction activity was strong in 2021, with average daily sales volumes for ready-mix growing double digits and with low single-digit growth for aggregates. Since the government announced an industry rationalization plan, we have seen an important improvement in pricing. For 2022, we are expecting volume growth across our EMEA region, supported by fiscal stimulus and the renovation wave in Europe, as well as strong fundamentals in most markets. Net sales rose 18% on a like-to-like basis, the highest annual growth since 2012. While the region did benefit from an easy comp due to COVID lockdowns in 2020, 2021 cement volumes stood 13% and surpassed pre-pandemic levels. With volume breaks and high capacity utilization, the region experienced strong pricing momentum with cement prices up 8% in the fourth quarter. As a result of tight cost management control, EBITDA grew 25%, while EBITDA margin expanded approximately 2 percentage points. Volumes in fourth quarter declined slightly, primarily due to Colombia as a result of our pricing strategy. With continuous cost pressures, we announced price increases in cement for the beginning of the year of approximately mid-single digits to the region. In Colombia, our full year cement volumes grew 8%, supported by housing, self-construction and infrastructure. The outlook for the country in 2022 remains positive with a healthy self-construction sector, 4G highway projects, as well as the rollout of new infrastructure programs. In the Dominican Republic, we saw strong demand growth in 2021 with cement volumes up 22%. Due to unexpected maintenance in the fourth quarter, our volumes declined 5%. We believe that with higher global shipping costs, our strong logistics network, coupled with our planned cement capacity additions into a sold-out region will be an important competitive advantage. As you heard from Fernando, our 2021 results were quite strong with sales and EBITDA growing the most in a decade and generating around $1 billion in free cash flow for the second year in a row. On the debt management and capital structure side, our results last year were also quite strong and transformational for us, a year of many records and first. We refinanced our syndicated bank facility at a cost never achieved before, slightly above 1%, and with investment-grade style structure. During the year, our consolidated net debt as measured under our credit agreement declined by $2.3 billion, and we reduced interest expense by $141 million, representing savings of 20% versus the prior year. We also reduced our leverage ratio by the most ever, reaching 2.73x, a reduction of 1.4x and significantly lengthened our average life of debt to 6.2 years, the highest in more than a decade. In line with the task force's goal, we aim to have at least 50% of our debt stack sustainability linked by 2025. We have minimal exposure to interest rates with 90% of our debt at a fixed rate, a very favorable position in an environment of rising rates. We have great debt in various currencies when pricing is attractive, such as the euro, Mexican peso, Philippine peso and the Colombian peso, among others, which translated into a positive $140 million translation effect on our debt this year. In addition, we have an ongoing Mexican peso hedging strategy that effectively lowered the volatility of the exchange rate at which we convert pesos to dollars for tenders of up to 18 months. This year, our operations generated $1.1 billion in free cash flow, an increase of $143 million versus the year before. However, average working capital days reached minus 15 days, 1 day better than last year. Finally, for strategic CapEx, we invested $380 million in highly accretive growth projects. Working Smarter will fundamentally change the current shared services model into a fully digital, virtual and agile way of delivering business management services across our company and will create a unique competitive advantage. To accelerate innovation, we have signed separate multiyear contracts that, in the aggregate, are totaling $500 million with 6 leading service providers in the field of finance and accounting, information technology and human resources, replacing current expenditures with new supplier services at an optimized cost, effectively continuing to reduce our operating expenses. In addition, having access to our partners' collective research and development capabilities ensures that Working Smarter will remain at the forefront of technology and innovation for years to come. Beyond all of these benefits I just discussed, we expect to capture accumulated savings up to $100 million per year once Working Smarter is fully implemented and achieve a return on investment of about 4x with short payback periods. In 2022, we expect EBITDA growth of mid-single digits. Cost headwinds will continue to be with us in the first half of the year due to more difficult comps as we only began to experience inflationary pressures in the third quarter of 2021, but we expect these pressures to ease on a year-over-year basis in the back half. We expect energy to remain the largest cost headwind, and we estimate that energy for the production of cement will increase by 19% on a per ton of cement  basis. We expect CapEx of $1.3 billion with $600 million growing to strategic  With rising sales, we anticipate an investment in working capital of $150 million. Based on our current debt portfolio, we expect cost of debt to decline by $10 million. Overall, in 2022, we anticipate a favorable environment with more moderate volume growth in most markets and strong pricing dynamics that reflect high capacity utilization and input cost iteration. Finally, we aim to recover margins in line with our operational resilience goal with our pricing strategy. Before we go into our Q&A session, I would like to remind you that any forward-looking statements we made today are based on our current knowledge of the markets in which we operate and could change in the future due to a variety of factors beyond our control. In addition, unless the context indicates otherwise, all references to pricing initiatives, price increases or decreases refers to prices for all products. So considering your indications of double-digit pricing growth in key markets and the investments contributing to $100 million EBITDA, really the guidance of mid-single digit EBITDA growth is low in my view, even against the energy cost increase that you are indicating of 19%. I mean, is something happening with the PEMEX cycle volumes or are you expecting to having to import clinker at much higher cost because, yes, the EBITDA guidance is low given the present indication. Vanessa, I think that you put your finger on the pulse there, I think that certainly, we're coming into 2022 assuming and expecting a lot of volatility, particularly on the cost side. If we take the energy price increases that we saw in the fourth quarter and hold them flat to the whole year, that would give us about a 15% increase. Of course, we're accelerating our efforts to switch to alternative fuels and lesser costly and more effective fuels. I mean, we are expecting growth in some markets that are sold out, and we do expect some growth in that. So I think that bottom line on the -- you heard our guidance on the volume side, we're expecting flattish volumes in cement, low single digits in aggregate, and low to mid-single digits in -- sorry, low to mid-single digits in aggregates and low single digit in ready-mix. If we take a look at the end-to-end -- sorry, December to December, '20 to '21 point-to-point pricing increase for the year, it was 10% and versus the year-over-year price increase of 5%. And as you said, we've definitely made announcements in pricing of double digits in, I would say, most of our markets for January and April, and we're getting good traction on that. Now the other thing that is also important that we remarked on -- I mean, I talked about it a little bit is Working Smarter. I mean that has actually started paying off in '21, and we're expecting it to continue to deliver in terms of cost reduction. So bottom line, I would say that we're being cautious, commensurate with the expected volatility and high inflation going into '22, I think to that. I might just add 1 point, and Vanessa, I think that you're well aware of this, but we saw inflation in the spike in June. So what that means is that in the first half, we're going to -- because we had very low cost inflation in the first half of last year, the first half will be a very difficult comp and then things should normalize towards the back of the year. And the next question calls from -- comes from the web, and it's Paul Roger from Exane BNP. \"On the 4% reduction on CO2 on a per ton of cement produced basis, at this rate, given what you accomplished in 2021, you would easily achieve the 2030 target. Well, let me -- let me start by saying that last year was for kind of a special year regarding our transition towards a low carbon economy. But anyhow, I think what we are showing with last year's results and then I will briefly explain what is that happened last year. I think we are showing that our industry is capable of its transition, effective and fast transition towards a low carbon economy while increasing profitability of the industry. Now what happened last year, as you know, we started adjusting our ambition of aligned to the most accepted scenarios, and we adjusted our objective, we broke our 2030 objectives to 2025, and we include new ones. But what we did at the same time, starting in 2020, developed a very comprehensive road map, a CO2 reduction road map per cement plant. And for the first time, it was executed last year all over the 12 months. Again, I cannot promise 1.4 every year, but we now think we have really -- whatever we say is under control is under control to assure that our objectives, we've been met. And again, it's just a simple clarification because so many negative interpretations regarding our industry can be our possibility of capability of transition to a low-carbon economy. And you know that the potential reduction in margins, the potential increases of CapEx with our returns, I think that for time, we will be the most that's the old wisdom and that is the new wisdom, which calls for a cement industry, in a circular and green economy, serving better society and being as profitable or even more profitable than it has been. I think it is clear that what happened last year is that we started with a fine and started and executed our pricing strategy considering a much lower inflation, meaning normally in the last quarter of the year, we plan for our strategy for the first 4 months of the next year, and that's what we did. And we have commented -- in the case of ready-mix and aggregates, we managed to maintain margins in the case of cement. our price strategy for 2022, considering  high levels of inflation. So we start executing our pricing -- our 2022 pricing strategy already with the idea of recovering margins lost, not to lose more margins during 2022, and to achieve our operational resilience margin of 20%. I mean, Carlos, first, I mean, as Fernando said, I mean the -- we see some very good response for the January pricing increases. I think you saw in Mexico, in particular, I think yesterday,  came out announcing prices sequentially going up by a little bit over 8%. In the case of U.S. and Europe, which are more seasonally -- pricing increases are more seasonally affected, for those markets where we announced pricing increases for January. Now obviously, as you know, the U.S., because of seasonality, pricing -- most of the pricing happens in the spring in April. In the U.S., the January pricing increase is affecting about 40% of our sales versus -- the April 1 will be more 60%. Now to summarize, I mean we're going into January with somewhere between 50% to 60% of our markets with pricing increases starting as of January. Now something very important that we need to mention here is that we have communicated with our customers in many of our markets, particularly markets that are sold out, that they should expect a second round of pricing increases in the summer and fall. Now at the same time, as I said earlier, I mean, on the cost side, we're not sitting on our hands. We're making sure that we're investing more and executing more to switch to alternative fuels, which are 60% less expensive on a giga calorie per ton basis than fossil fuels. So I think that we're pushing on all fronts, frankly, on the pricing side and on the cost side. And on the pricing side, it's looking good. Well, if I may comment, then I think there is -- as you are suggesting, there is a mix effect in our ready-mix volumes and aggregate volumes are stable or growing when compared to cement that the declines of it is, to some extent, a mix effect. On margins, I think in Mexico, we have highest impact of energy costs when compared to other geographies. They already started executing and as Maher mentioned, and using the data from  in the , sequential increase of cement prices in Mexico is 8%. I think Maher mentioned also our aim with our pricing strategy this year is to recover margin, achieve over 20% margin  we're close to it  margin established in our operational procedures  plan or initiative. On top of what we have already executed -- executing, we will continue monitoring how inflation develops, and we will be increasing prices again from  basis to comply with this objective. I mean the fourth quarter of 2020, cement volumes grew by like 17%. And within that, bagged cement grew like almost 22%. So -- and we had like the highest, I think, amount of growth since 2014, probably. But at some point last year, you were contemplating the possibility of maybe introducing a dividend in 2022, which you decided not to do. But when we saw the way things started moving in the second half of last year, we decided to postpone that possibility. Maher, I think you said you have a target of 50% under your -- I guess, your green targets by 2025. And just because you don't have a lot of bonds that have calls in the short term, I think one in euros and maybe one in dollars next year. I mean we're -- obviously, there are -- I mean there's the 7 and 3/8, that something could happen in '23. So I think there's sufficient refinancing opportunities plus, as we deleverage, I mean, what's going to happen is that the amount that will be refi-ed, that will be sustainability linked, will become more important as a percentage of the total debt stack. And as you know, our debt is -- the bank debt is all sustainability-linked, including recently, we secured a peso-denominated loan that is close to about $250 million. So I think we're slowly putting in slices that are like -- that we feel reasonably comfortable that by 2025, should get us to a level of 50% or more. And you think -- well, I guess you don't know yet if the penalties or premiums would be similar. But of course, the greeniums as they call them, are subject of negotiation at the time that we structure a bond, as you know, and we will make sure that we are very market-driven and making sure that the greeniums are meaningful to the market, that they're not just -- unlike some of the -- some other issuers that have come to the market that have been criticized, frankly. And as an example of what can happen in here, the -- there are 2 projects that will increase even more, even further, the use of alternative fuels of 2 of our largest plants in Europe that's Rugby and . So starting in April, May, we will increase the use of alternative fuels in these 2 plants to 90% plus. So what you can expect is that we win from 29%, now we will continue increasing that proportion. I mean, I don't think -- we don't -- we have some fixing on the electricity side. What I can tell you is that in terms of the transportation bill, for instance, diesel, a big chunk of our diesel is hedged for 22%, 75% -- close to 75%. And in terms of the fossil fuels, I mean -- I don't want to call them hedges, but I would say that probably more than half of our fuels are fixed cost-based fuel, whether they're fossil fuels or alternative fuels. They can petition for a hike, but roughly 60% was under contract, I believe, for this year."
}