{
    "symbol": "XERS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 11:07:01",
    "content": " At this point in the year, we have a good line of sight to where we may end the year and are thus narrowing our net product revenue guidance from $105 million to $120 million to $105 million to $110 million. Gvoke net revenue in the third quarter was a record $13.7 million, a 24% increase compared to Q3 last year and a 19% increase from last quarter. Keveyis had another record quarter with $13.4 million in net revenue, an increase, excuse me, of approximately 17% compared to third quarter 2021 and an increase of 4% from last quarter. This performance resulted in $2.5 million in net revenue for the third quarter, 160% revenue growth from the second quarter. Conservatively, if we take 10% of those patients with multiple issues, as I have described or approximately 7 million prescriptions of this market at current branded pricing, this could be a $2 billion to $3 billion market segment in which we believe our once-weekly subcutaneous levothyroxine could compete very effectively. Total net product revenue was a record $29.6 million for the third quarter, representing a 31% increase over the same quarter last year on a pro forma basis. This increase was driven by growth of all three of our products, strong underlying demand, patient demand for both Gvoke and Keveyis, and new patient starts on therapy for Recorlev were the key drivers for total product revenue growth in the quarter. Gvoke net revenue for the quarter was $13.7 million, representing a 24% increase compared to the same period last year. This increase in revenue was driven by continued growth in prescriptions, topping $38,000 for the first time, more than a 40% increase compared to the same period in 2021. Year-to-date, Gvoke net revenue was $37.6 million, representing a 35% increase compared to the same period last year. Keveyis net revenue for the quarter was $13.4 million, representing a 17% increase compared to the same period last year on a pro forma basis. On a year-to-date basis, Keveyis net revenue was $35.5 million, representing a 19% increase compared to the same period last year on a pro forma basis. Recorlev net revenue for the quarter was $2.5 million, more than double compared to the second quarter of 2022 and a direct result of the steady growth of patients on therapy. As Paul mentioned, we are tightening our guidance of total net product revenue of $105 million to $110 million, still within our previous range of $105 million to $120 million. Selling, general and administrative expenses increased by $31.8 million or roughly 45% for the nine months ended September 30th compared to the same period in 2021."
}