{
    "symbol": "XERS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 10:56:05",
    "content": " $15 million in net revenue, a 36% increase, compared to the fourth quarter of 2021 and an 8% increase from the third quarter of 2022. Keveyis also had a record quarter and year, approximately $14 million for the quarter and just over $49 million for the full-year, which represent increases of 33% and 23% respectively on a pro forma basis. In 2023, we expect that to be in the range of $57 million to $77 million with the first quarter being the highest and improving considerably by the second half of the year, driven by our projected revenue growth and by aggressive cash management. Focusing on fourth quarter results, total net product revenue was a record $32.5 million, representing a 52% increase over the same quarter last year. Breaking it down by product, Gvoke net revenue for the quarter was a record 14.9 million, representing a 36% increase, compared to the same period last year. Full-year 2022, Gvoke net revenue was 52.5 million, representing a 35% increase compared to 2021. Keveyis net revenue for the quarter was 13.8 million, representing a 33% increase when compared to the same period last year. On a full-year basis, Keveyis net revenue was 49.3 million, representing a 23% increase, compared to 2021 on a pro forma basis. Recorlev net revenue for the quarter was 3.8 million, which represents a 51% increase over prior quarter and is a direct result of the steady growth of patients on therapy during Q4. Looking ahead for the full-year 2023, we expect our total revenue to be in the range of 135 million to 165 million, reflecting combined Gvoke, Keveyis, and Recorlev net product revenue and other revenue from existing and potential collaborations and partnerships. As we experienced last year, cash utilization in the first quarter is expected to be the highest quarter in 2023, driven by changes in working capital, including investments in inventory to support revenue growth. Considering our growing revenue and anticipated operating expenses in 2023, we expect our total cash, cash equivalents and short-term investments to end the year in the range of 45 million to 65 million meaning total cash utilized from operating activities for the year is expected to be in the range of 57 million to 77 million."
}