{
    "symbol": "OTIS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 13:05:03",
    "content": " For the first quarter since Q4 2021, New Equipment sales returned to growth as we continued the strong growth in EMEA and Asia-Pacific that we've experienced all year and were able to overcome supply chain and installation-related challenges, especially in the Americas. In 2023, globally New Equipment markets are expected to be down mid single-digits in units with flattish markets in the Americas and EMEA and down mid single-digits in Asia, driven by China, where we expect the market to be down 5% to 10%. With this as the industry backdrop for Otis, we expect organic sales growth to be in the range of 4% to 6%, with total sales of $13.8 billion to $14.1 billion, up 1.5% to 4% at actual FX. By segment, we expect New Equipment will grow 3% to 5% this year, with mid-single-digit growth in the Americas and EMEA and low single-digit growth in Asia. Organic sales grew for the ninth consecutive quarter and growth accelerated to 6%, our best performance of the year with mid-single-digit growth in new equipment and high-single-digit growth in service. While the fourth quarter free cash flow conversion was strong at 145%, our full year free cash flow came in at $1.45 billion or 115% of net income lighter than we had anticipated as we built $65 million of inventory to mitigate supply chain challenges and support backlog conversion going into 2023. Otis new equipment orders in the quarter increased 4% with EMEA and Asia-Pacific up high single digits and China orders returning to growth of mid-single digits, which more than offset a modest decline in the Americas. Overall with better than expected orders growth in the quarter, we finished the year with a new equipment adjusted backlog up 11% at constant currency with growth in all regions, including notably in China. Fourth quarter new equipment sales of $1.5 billion return to growth driven by over 10% growth in the America, EMEA and Asia Pacific with EMEA outperforming our prior expectations. In 2023, we expect new equipment organic sales to grow between 3% to 5% with Americas and EMEA up mid-single digits and Asia growing low single digits. Maintenance and repair organic sales are expected to grow 4.5% or 6.5% driven by maintenance portfolio growth, pricing and low to mid-single digit repair growth after two strong years of COVID-related recovery. Your line is now open. One moment for our next question. Your line is now open. One moment for our next question. Your line is now open. One moment for our next question. Your line is now open. One moment for our next question. Your line is now open. One moment for our next question. Your line is now open. Your line is now open."
}