{
    "symbol": "SATS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 22:38:09",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to EchoStar Corporation Conference Call for First Quarter 2022 Results. Now, I would like to welcome Mr. Terry Brown. Good morning, everybody and welcome to our earnings call for the first quarter of 2022. I am joined today by Hamid Akhavan, our CEO and President; David Rayner, COO and CFO; Pradman Kaul, President of Hughes; Dean Manson, General Counsel and Secretary; and Ken Carroll, EVP of Corporate Development. As usual, we invite media to participate in a listen-only mode on the call and ask that you not identify participants or their firms in your report. All statements we make during this call, other than statements of historical fact, constitute forward-looking statements made pursuant to the Safe Harbor provided by the Private Securities Litigation Reform Act of 1995. These forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause our actual results to be materially different from historical results and from any future results expressed or implied by the forward-looking statements. For a list of those factors and risks, please refer to our annual report on Form 10-K for the year ended December 31, 2021 filed on February 23, and our subsequent filings made with the SEC. I am pleased to participate in my first EchoStar earnings call, and I look forward to interacting with many of you in the future. As some of you are aware, Anders Johnson, our Chief Strategy Officer and President of EchoStar Satellite Services, has decided to leave EchoStar to pursue other interests. Following the overview, I will make some general comments on the business and competitive environment. Starting with North America, we continue to manage our U.S. consumer broadband sales and marketing efforts to optimize service to the existing subscriber base. In Q1, we adjusted the HughesNet service plans giving customers more data and increasing monthly fees. Another initiative in the consumer sector is an innovative product, which combines geo satellite and terrestrial LTE connectivity. This is a first-of-its-kind consumer-grade hybrid geo and LTE technology that creates a faster, more responsive Internet experience. And in the civilian government sector, we received an award from the Department of Veteran Affairs to continue to provide satellite services in support of its VA Knowledge Network, and an extension of the digital signage solution for the Social Security Administration’s 1,900 offices. OneWeb remains robust, and the team continues a very active deployment phase for the global gateways to support OneWeb’s global service launch. We announced another distribution agreement with OneWeb, this time to deliver LEO services to the U.S. DoD. In another exciting development, the satellite – at the SATELLITE 2022 trade show in March, our engineers demonstrated a revolutionary new electronically steered antenna for OneWeb service. Focused on the government and enterprise market, the sleek new ESA has no moving parts and a very low profile, ideal for fixed and mobile connectivity. So, let’s talk a little bit about our international operations. The HughesNet offering in Latin America, like that in the U.S., continues to be capacity constrained in certain areas, while usage remains high. In response, the team has adapted our strategy to pursue more high-value enterprise and government projects and community WiFi sites. An example, during this quarter, the team won two new school projects in Latin America using JUPITER System equipment and capacity. Five service providers in Mexico selected JUPITER equipment to connect more than 7,000 Internet access and community WiFi hotspots. We also crossed more than 2,300 active Hughes Express WiFi sites. And we announced a successful pilot of a community LTE project in Brazil, which uses geo satellite backhaul to connect an LTE tower to the ethernet. This delay is due in part to reallocation of critical resources in Maxar to a higher priority, government-related spacecraft project. Although we are disappointed with this delay, we remain highly excited about Jupiter 3 as it will bring significant additional capacity to our markets as well as the ability to offer high-speed service plans as demanded by our customers. While the growth of our consumer broadband business has been impacted as a result of our capacity constraints and other factors, we have continued to increase revenue by capitalizing on enterprise and government opportunities, both domestically and internationally. However, this change in our revenue mix has and will continue to put some pressure on our margins. As Pradman mentioned, we have several initiatives in place to limit the impact of this change and we will remain prudent in the efficient management of our business, protect our margins until we can monetize the additional capacity provided by the Jupiter 3 satellite. Free cash flow, defined as adjusted EBITDA minus CapEx, was $54 million during the quarter, increasing $47 million from the same period last year. Our balance sheet remains one of the strongest in the industry, and we continue to seek opportunities to deploy cash for growth. In the first quarter of 2022, we bought back 1.5 million shares of our stock in the open market at a cost of $35 million. I want to begin by thanking my leadership team here at EchoStar and all of our more than 2,000 employees around the world, not just for a warm welcome to me as a newcomer but for maintaining a solid track record of performance as evidenced by today’s results. As we all know, the satellite industry and I would venture to say the broader telecom industry, where I have spent a great portion of my business life, is in the midst of its most rapid business and technological change in decades. I’m excited about the dynamic nature of our industry as I view our position to be on the winning side of the equation given our strong resources, institutional heritage and financial flexibility. I know that there are questions about our long-term growth strategy, which I’m not prepared to address today, but I would like to mention that my leadership team and I are in the midst of a fresh reassessment of our resources and opportunities, and an examination of our industry and adjacent verticals with the goal to reignite and refine our corporate growth profile. But even based on a preliminary view of the situation, having been in my role just about a month today, I will assert that we are well positioned competitively. First, we have a uniquely strong balance sheet, something that most of our peers and competitors cannot say. Secondly, we have a global presence and trusted reputation worldwide. Third, we have a tremendous, and I would say, unmatched asset in our engineering capabilities. And finally, we have unique S-band spectrum assets that provide strategic opportunities. I’m excited about accelerating our momentum in that domain, and I want to share a couple of high-level updates on initiatives we are focused on. For one, we are pleased that last month the wireless industry’s main standard setting association, the Third Generation Partnership Project, or 3GPP, reached completion of its Release 17. Release 17 is the first to include non-terrestrial networks, or NTN, and to address satellites role in the 5G global communication ecosystem. Satellite 5G specifications include direct access to handheld devices, enabling global service coverage. Because of its S-band spectrum assets, which are standardized in 3GPP, EchoStar is positioned to become a leading global operator of 5G mobile satellite services, addressing direct-to-device mobility and IoT applications. The other update is that EchoStar Mobile, our EU licensee, has begun pre-commercial testing of its satellite-based LoRa IoT service. EchoStar Mobile solution is the first real-time bidirectional LoRa satellite service with mobile and remote capabilities, and we expect it to transform the global satellite IoT market with new, very low-cost services and enhanced LPWAN capabilities. Now among the many countering challenges and opportunities shaping this industry, we can be happy about one key fact. And while we will take investment leads both organically and via acquisitions, the core business, the financial stability and independence will never be jeopardized. I hope to participate in investor events post our second quarter of ‘22 earnings call, and to share more about the specifics of our strategic direction over the coming quarters. Your line is now open. Well, we implemented it, I think, beginning in February for this year. Some of the Q1 results clearly showed the higher ARPU, impact of this price increase. So, that’s going well. Now in terms of competitiveness, it’s fairly in the same range as our primary competitor and obviously, a lot – not long than the LinkStar offerings that are in the market today. And I know that, whatever, we have about a year for the satellite to come online. But clearly, we intend to give more bits to the customer. And I think with the additional value that the customer gets, it should position us very strongly to be competitive in that market. Just overall on the Hughes business, you’ve had some really strong equipment sales. In fact, it’s getting stronger. And you didn’t talk about the Bharti – well, I guess it’s Hughes Communications India, if I got the name right, the new Bharti JV. Are there any major changes in strategy that you... That’s an exciting part, I think, of our international business. As you know, we own 65% of that joint venture and Bharti Airtel owns remaining 35%. Bharti Airtel, as you know, is one of the two leading cellular service providers in India with over 400 million subscribers. So we expect that as 4G and 5G gets implemented in India, Bharti is going to have a lot of requirements for cellular backhaul to connect the new base stations with each other. And that business for – most of it should come to this JV, and we expect that to be a major part of our growth in India for the next few years. We also continue to supply equipment to Reliance Jio, which is the other major cellular company in India, and we hope to continue to grow that element of our business too. I think that the general tenor of the market in India, which was being run, unfortunately, which is highly regulated, has started changing. It’s not going to solve it out instantly, but I expect that there will be some nice advances in business in that area. OneWeb is obviously going to be because they have a Ku-band LEO, a major customer and also a major user of this ESA. And we’re very excited, and our potential customers are very excited too because it’s a revolutionary new technology, no moving parts, very low profile, making it ideal for mobility and aeronautical applications. If you designed it to the sort of aviation standards, then this is clearly not intended to be a product that could, in any way, serve the consumer markets and the consumer price index. It’s clearly designed for mobility markets, aeronautical being a big element of it, and high-end government markets, and also the enterprise – high-end enterprise markets. Your next question is from the line of Ric Prentiss from Raymond James. Your line is now open. First, I was familiar with part of the company. And I was part of a very high-profile company, and Hughes was a technology and product supplier, and I was incredibly impressed by the capabilities of the company in terms of innovation, bringing in solid technology. And I think the foundation here is extremely solid, and I was familiar with it, and in fact, familiar with many of the players, including Pradman here, sitting next to me. Other than that, I came from a private equity background, at least for the past 5 or 6 years in my life, I have been very, very actively involved in technology investments and TMT investments. When I look at the balance sheet here, I recognize that there is a significant opportunity for exposing value in the business that has been undervalued. I’d like to use our best understanding of the environment and dynamics of the market, which we have been serving for decades, to use our balance sheet. And as I mentioned in my earlier comments, I think the market is heading in a direction where opportunities will be cheaper and better to acquire. Long answer to your short question, but I thought that, that probably will cover three or four questions – follow-on questions, Ric. And that you see having a battleship balance sheet to put to work that might be at a very high level, something of interest. So certainly, it’s not technology. I’m not expecting or looking – it might happen in adjacencies, but in terms of how much technical power we have in-house, I think we have plenty to harvest. So those are – routes to market and products to market to me would be the focus area rather than innovating new technology, which we have plenty of in-house, and we can do, I guess, at will. Other one for me is a lot of times when new executives come into a company, their compensation package talks a lot about what the important metrics are. Hey, I want to make sure we do well here because it will serve me well and hopefully serve the shareholders well as also. So I would say – I mean at the moment, obviously, the compensation packages are what they have been and published, and there is no plan to change that in the course of this year for sure. But I think what might – the way I think about this as the most effective is we are in the middle of our strategic evaluations and thinking, and it’s going to take us a few months to get to a platform where we feel it’s a fair space, let’s call it. So this is probably a good discussion to have towards the end of the year where we are a little bit more, I guess, orchestrated and organized around our strategic directions. And there is great, great plans around Jupiter 3. I think we could do this in, hopefully, on our S-band area and certainly in the directions that we have seen progress already. So this would be more of an acceleration rather than complete back to a blank sheet of paper, which certainly is not necessary here. Your line is now open. But what I can tell you, though, is if you just look at the bill of materials, it should be very competitive with other units that we have seen in the market so far. Pradman, will I have you – is there any plan to procure – I heard in the past, EchoStar has leased capacity from other operators when kind of capacity constrained. We’re constantly looking at that and people who have excess capacity, especially over North America, are talking to us. But unfortunately, we haven’t yet seen economically compelling deal from any of those guys. But if we can come up with one, I’m sure we would evaluate that and – because it can only help our business. And then my last question, regarding S-band, and I guess some of the progress with 3GPP, I was just wondering if that gives any clarity to EchoStar regarding your LEO constellation. It’s a bit too early for us to answer that, but I can certainly say that the developments on 3GPP and a 5G inclusion for satellites in that standard opens up clearly a few angles and routes to monetize in our spectrum assets, which we are deeply analyzing and looking at. Certainly, this was not a news to us that happened yesterday. We have been part of that activity ourselves and have been very supportive of that, with a view that it would be helpful in terms of bringing satellite connectivity to pockets, which is – they are already there. There is still quite a bit of work to be done, not just by us, but also the rest of the industry trying to figure out the technology, build and commercialization of that. But from a framework of the opportunity, I think the clarity is there. And we – in one form or fashion, we will participate in that, and the question is exactly what, and please allow us a quarter or so to – maybe two quarters to – for us to kind of shape that and share that with you in more detail. Your line is now open. And then maybe just talk through – just given where the stock is, just talk through some of what you mentioned earlier, Hamid, on kind of new capital projects and sort of what the hurdle is there versus continuing to sort of aggressively buyback stock. And then the second question is really – I know we have talked about this in the past, but anything you can tell us around Jupiter 3 and sort of enterprise or wholesale opportunities, whether it’s mobile backhaul or anything else that could sort of come on quickly versus just a ramping of consumer subscribers? From a CapEx standpoint, I would expect CapEx to be somewhat below where we were in 2021, so probably in the $400 million range. And that will – on a per customer basis, we will probably start ticking up in the second half of the year as we start deploying a new generation of modem in anticipation of J3. But we also, as you correctly point out, will have final payments on J3 as well as launch and other ground infrastructure that will be completed this year. In terms of an investment hurdle rate, I am not anticipating that we would have a very specific target because part of that is a function of the market. I am not looking forward to that from a personal perspective, and I hope that – from economic growth perspective of the market, I hope that is not a long-lasting something – anything. But if it turns out that the market is heading towards softening, and we have seen the tech sector and the adjacent sectors to us are becoming a little cheaper. So, I think that if the market is heading our way, let’s put it that way. But will we trade buying our own shares versus the acquisitions, well certainly, our desire is that we shifted towards acquisitions from outside and growth of existing customer base. Again, I don’t want to set expectation that after 90 days, maybe in the job, the market has changed so much or I changed the company so much that – that would be a little too exuberant and too rash. I think clearly, the two major new applications we see in the enterprise sector is cellular backhaul and the community WiFi. So, that’s probably the primary difference. We will, obviously, continue to serve the enterprise market and continue to serve the defense markets and then add on these two other markets to it. Your next question is from the line of Ric Prentiss from Raymond James. Your line is now open. I want to ask – obviously, Anders has announced that he is resigning effectively in about four weeks or so from now. Well, first of all, I want to thank Anders for his great contributions to the company in the past 11 years. He leaves a great legacy here, and he also leaves a great, great team behind. And – so I guess, a long way of saying, I don’t think you should see us as having lost or losing critical resources. Anders was incredible in terms of his leadership, but we will rally around our team here, and I will contribute my own personal attention to it to make sure that nothing gets reduced there. If anything, we are shifting more resources there in order to make sure we are keeping up with the opportunity that is every day getting better in that space. So, please don’t read anything to it in terms of negative aspects other than we have a very good team, and that team is interfacing with me directly at the top level of the business. We saw some press releases fairly recently about DISH, sister company DISH, and EchoStar Hughes working on a Department of Defense contract jointly. Clearly, this is a very exciting part of new opportunities in our business. So, the work is just started, and it’s – hopefully, we will try to take it to the next step over the next few months. Speaking of DISH, many of us will be attending their first Analyst Investor Day at DISH, almost 20 years since a major Analyst Day at DISH. And certainly, one of the investor thoughts on both DISH and EchoStar is not much communication with The Street. Hamid, as you come in, hopefully, we are looking forward to a lot more communication as you get longer in the seat there. Any thoughts about even high-level guidance targets or growth targets, I was on two other earnings call this morning where companies were updating their guidance or talking about their guidance. Any philosophical problems with providing at least aspirational targets or kind of longer term targets, because as an underfollowed stock, it certainly causes people to have a lot more concerning questions. I appreciate your question, but it would be imprudent, and you would not – you should not rely on it if I give you any guidance after 30 days in a job. Certainly, if I say anything right now would be not having a solid foundation and you would not trust it anyway. Look, I can – I will obviously never make a comment on DISH regardless, so that’s a different public company that we have an arm’s length relationship with. But honestly, that’s just about it. Some of those things hopefully are relevant even for us, like some of the Open RAN, and some of the things they are doing, which ultimately on a 3GPP basis and deployment basis is also applicable to our business here at EchoStar. So, I think we see a lot – I see a lot of synergies in terms of their innovation and what they are bringing to market, and what we hope to bring to market. And I guess the other piece of that question is just related to DISH is finally opening the kimono  and sharing with an Analyst Day/Investor Day, what’s kind of their plans are and what their vision is. As you look at Jupiter 3 on the schedule now for first quarter ‘23, the S-band hopefully getting more clarity on that. Certainly, one of the things we like to do – I would like to do is to have more interaction with the market. I think one of the things that we can benefit from is being more interactive with you, being more communicative. I believe we have – if you just look at our balance sheet, if you look at the structure of our company, I think we have more valuable information and assets and products to expose to you. But as I have mentioned in my earlier standard comment was that I need a quarter or two quarters for us to be sure that when we take your time and we share something with you, it’s valuable and you can rely on it. And we want to – with that, we want to go ahead and conclude the meeting. So, we look forward to talking to you next quarter. And with that, this concludes today’s conference call."
}