{
    "symbol": "SATS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 01:20:06",
    "content": " Good day, everybody and welcome to our earnings call for the fourth quarter of 2022. Iâ\u0080\u0099m joined today by Hamid Akhavan, our CEO and President; Paul Gaske, our Chief Operating Officer; Dean Manson, our Chief Legal Officer; and Jeffrey Boggs, our Interim Chief Accounting Officer. All statements we make during this call, other than statements of historical fact, constitute forward-looking statements made pursuant to the Safe Harbor provided by the Private Securities Litigation Reform Act of 1995. These forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause our actual results to be materially different from historical results and from any future results expressed or implied by the forward-looking statements. For a list of those factors and risks, please refer to our annual report on Form 10-K for the year ended December 31, 2022, filed yesterday with the SEC. In December 2022, Pradman Kaul announced his retirement and we would like to thank him for his 50 years of service. As of January 1, 2023, Paul Gaske assumed the new Chief Operating Officer role that was established to lead all market-facing global activities. We remain enthusiastic about our future and believe that under a more streamlined management and operating structure, we will drive efficiency, synergies and greater growth. As for our agenda for the call today, first, we will provide a brief overview of financial activities from the fourth quarter. After that, weâ\u0080\u0099ll discuss our business strategy, which includes the three parallel work streams that are called Horizons and our progress on all three. Our revenue in the quarter on the fourth quarter of 2022 was $500 million, up slightly compared to the same period of prior year. On a full year basis, we achieved $12 million of growth. This in spite of the fact that for the full year of 2022 we faced competition from Starlink, which brought significant capacity to the market and we did not have access to the benefits of our upcoming Jupiter 3 system. While our consumer broadband business has been impacted by capacity constraints and other factors, we have continued to increase revenue by capitalizing on enterprise and government opportunities, both domestically and internationally. Our adjusted EBITDA in the fourth quarter was $164 million, an increase of 3% from last year, primarily driven by lower sales and marketing expense associated with our consumer broadband business. In the fourth quarter, we saw continued momentum in our enterprise business. With $195 million of new orders, our 2022 orders increased 41% compared to the same period last year. Most enterprise orders are recognized over several years, creating a long and a stable revenue stream. We remain excited about opportunities within the enterprise market, a market that we believe will continue to allow us to better diversify our business both domestically and internationally and provide cash generation through low capital investment and a scalable operating leverage. Free cash flow, defined as adjusted EBITDA minus CapEx, was $87 million during the quarter and $330 million in 2022. I remain excited about the strength of our balance sheet as it affords us the flexibility to explore investment opportunities that could faster growth, which remains a key component of our business strategy. Let me now turn the call over to Paul, who will provide some additional specifics on the quarter and our Horizon 1 and 2 activities. As a reminder, Horizon 1 is our near-term priority to maximize current services and operations while managing costs as we prepare for the launch of the Jupiter 3/EchoStar XXIV satellite. To that end, we continue to focus on operational efficiencies and yield optimization of our North America satellite capacity. In 2022, we restructured our portfolio of consumer service offerings to better align with market demand by provisioning additional capacity for our customers. We plan to continue to optimize our service plans in 2023, as we await the launch of the Jupiter 3 service. The changes in our service plans have resulted in a natural shift towards higher capacity, higher price plans for our customers, improving our ARPUs, while delivering an enhanced customer experience. Additionally, we remain focused on improving our cost structure through deployment of additional automation, improved processes and supply efficiencies, of course, without compromising the end user experience. In the third quarter of 2022, we launched HughesNet Fusion, adding support for latency-sensitive applications to the traditional HughesNet satellite service, which is optimized to support high-speed applications like video and downloads. HughesNet Fusion utilizes a unique data handling software to seamlessly combine our satellite service with the terrestrial wireless service, providing an exceptional Internet experience that is responsive, reliable and fast. The HughesNet service plans â\u0080\u0093 the HughesNet Fusion plans have been well-received by existing and new subscribers, and we expect the service to help attract new customers and reduce churn while improving ARPU. Although we continue to see competitive pressures within the underserved market we address, we believe the combination of our optimized service plans and HughesNet Fusion service should help combat competition. In the fourth quarter, we signed a $9 million managed service contract with a new customer to utilize our secure broadband connectivity. We also received extensions from three retailers valued at approximately $5 million each, and continue to see success with contracts and deployments in the retail, petroleum and energy markets. In our OneWeb program, deliveries of production gateways continued as planned. As of the end of 2022, we have shipped 32 gateways and expect to complete the total complement of 44 gateways in 2023, in line with our committed schedule and customer expectations. Additionally, we have shipped more than 12,000 satellite subscriber modules for inclusion in OneWeb terminals. Although the business is still a relatively small scale, it has been growing through the development of network and security management tools, or DoD applications, and evolving technologies such as terrestrial and 5G NTN networks. As part of our streamlined management structure, we merged our defense and civil government business groups into 1 cohesive unit to drive efficiencies and expand opportunities for growth in the future. Now to our international operations, we continue to allocate additional capacity to address a wide range of enterprise applications to close the digital divide. In Mexico, we added broadband and cellular backhaul locations for CFE Telecom as well as connectivity services to a major bank. In Brazil, we expanded the scope of our services agreement with a major telecommunications provider to deliver Internet in approximately 1,600 rural schools. With regards to our HughesNet service in Latin America, we remain focused on adding high-value subscribers, which is lowering churn, while optimizing yield on our existing Latin American capacity to increase profitability and cash generation. In terms of the Jupiter equipment sales â\u0080\u0093 Jupiter system equipment sales, we had significant orders from around the world. In Mexico, a major oil producer ordered an upgrade for their existing Hughes system and signed a multiyear support agreement. In Africa, a leading telecommunications service provider upgraded their Jupiter system to support network expansion and LTE backlog connectivity. In the Middle East, a telecommunication service provider ordered an additional redundant Jupiter gateway to enhance their service offerings. Now, let me focus on Horizon 2 activities. Iâ\u0080\u0099m pleased to report that the Jupiter 3 satellite is in the final stages of assembly and launch, which is expected to occur in the second quarter of 2023. As many of you know, in November of 2022, we entered into an amended agreement with Maxar, the manufacturer of the satellite, to secure compensation for path delays and to realign remedies to incentivize Maxar to complete the program expeditiously. The compensation provides for relief on approximately $14 million of payments through in-orbit racing, and more than $44.5 million plus interest on deferred in-orbit incentive payments. Also, Maxar agreed to enter into an agreement with us, where we will provide certain products or services to Maxar during 2023 for payments that will deliver us a margin of at least $30 million. In preparation for the launch of Jupiter 3, the team is focused on developing service plans with higher speeds, more data capacity and the extension of our HughesNet Fusion plan for the ultimate high-speed, low-latency satellite Internet experience. We plan to leverage our business connectivity, managed services portfolio, our hybrid BOGO business solutions and our own manufactured products to pursue growth. Increased participation in this vast market segment is a key element of our diversification strategy, which includes improving our operational scale with potential small acquisitions, which we will continue to explore. I would like to provide an update on Horizon 3, which is our strategy to expand into new markets around the world through both organic innovation as well as potential acquisitions. The 28 satellite LEO constellation is primarily targeting IoT services, which we believe is a vast untapped opportunity. Some of you may recall that in the second quarter of 2021, we launched our third nanosatellite known as EG-3, with the primary mission to bring in to use our Sirion-1 ITU filing. The satellite provided us with the ability to test a wide range of potential S-band applications and services, which we used in the design phase of our LEO constellation. During the first quarter of 2023, we lost contact with EG-3 and are continuing efforts to reestablish communication. Regardless of the outcome, our LEO constellation satellites will substitute for EG-3 in 2024, well in advance of the ITU required deadline in 2026. Last year, we initiated hybrid S-band satellite and terrestrial LoRa services over the EchoStar 21 satellite in Europe to create the first pan-European LoRa-enabled network. During the fourth quarter, we completed an initial commercial deployment of our hybrid S-band satellite and terrestrial LoRa services in Mexico, and we are currently testing similar services in the U.S. Regarding our 5G NTN activities, the LEO constellation will serve as a foundation for engineering 5G narrowband NTN-based capabilities, building on 3GPP Release 17 and beyond. For Horizon 3, in addition to our S-band activities, we are actively evaluating other opportunities for new avenues of organic and inorganic growth. Your line is now open. First, letâ\u0080\u0099s start with Jupiter 3, glad to see the timing firming up here that we are in the final stages. And so with that, we would expect in Q3 to bring our services into market. The system we have is already being deployed in the United States is ready to go, and the actual technology has been deployed in several customers already. Similar question I asked to one of your peers out there, how fast they think they would fill up their next-generation satellite that they are launching. And then when we think about capacity, I think you have about 1.3 million subs today. Well, as far as the build time, we are estimating about 2 to 3 years, which would be typical to what weâ\u0080\u0099ve seen in the past. As far as the actual sub numbers, I donâ\u0080\u0099t think weâ\u0080\u0099re prepared to give you a specific number. As we improve these plans and improve the capabilities for the customers, weâ\u0080\u0099ve seen in the past that the customers are willing to pay more. So we would expect overall revenue, which is our key objective here, and our yield from that capacity to be our main focus. And so this design was already in the registration in the filing, and weâ\u0080\u0099re just completing that. And so â\u0080\u0093 but it does provide a complete coverage of the globe even with several visitations per day, even in partial deployment, even from this very first start or first launch is launched in batches and the very first one actually does provide complete coverage of the globe. And as the additional satellites come on, that visitation rate increases. In terms of the cost structure, this is a second generation system for us, and is a stepping stone towards our main goal and ambition to build the leading wideband, perhaps the only wideband 5G NTN system to follow, which we have been working on. So you should assume that this is an incremental capital expenditure, but certainly not at the level that would prevent us from being able to materialize our larger system. And then a final question for me, obviously, you mentioned that the 28 LEO satellite is a stepping stone, its Generation 2, but not the ultimate wideband one. How do you view direct-to-device market, the satellite communications with smartphone linkage, that market seems ripe but also seems early and somewhat confusing to investors out there. First of all, we believe that direct-to-device is the fundamental opportunity, is a very large opportunity, and I think is a game-changing opportunity. But we also believe that the very first initial steps of messaging only in a variety of qualities and capabilities is the initial step that is the â\u0080\u0093 thatâ\u0080\u0099s a probably smaller step, not fully activating all the capabilities, which we think are exciting. A true wideband system, which will have a natural use of your smartphone similar to what you would use on a terrestrial network is what our ambitions are. That is still a few years away, but itâ\u0080\u0099s something that we are working on, and we believe that thereâ\u0080\u0099s not room for too many of those out there. And certainly, we hope to be â\u0080\u0093 expect to be the leading provider of that capability. But in the interim, obviously, it will be a messaging-based service direct-to-device, and we are able to demonstrate it and work that today in some of our systems. Your line is now open. Thank you and congrats on finally moving forward with the S-band constellation, now that itâ\u0080\u0099s out there, I got more detailed questions in â\u0080\u0093 maybe just start with a couple of technical things. And when you think about the â\u0080\u0093 there is existing competition out there, there is a lot of companies adding IoT constellations. We believe that just a narrowband IoT market, in itself by end of this decade will be more than $10 billion annually. So there is quite a bit of room, and this is not even all the different applications and use cases that have been identified. And as I mentioned, the way we â\u0080\u0093 the capabilities of our system are specified in our filing in â\u0080\u0093 that we have made for Sirion-1, so some of those you can actually find in public domain. Now having said that, this is â\u0080\u0093 we, again, consider this one a step, a significant step towards taking full advantage of our S-band spectrum capabilities, and that requires building a much more capable system. We are an engineering company, with deep, deep heritage and understanding of satellite systems and engineering links and capabilities. But also, as I said, we are looking to step beyond that and go to a wideband system. At this point, we are not really giving any more specifics today we are working in partnerships in the markets that I mentioned. But clearly, for a larger system with different geographies, it is our intention to maximize our access to market through multiple routes. But certainly, access to market has not been a limitation for us and demand has been robust in terms of partnership and wanting to sell the services. And just one question on existing service, with the new Fusion product, is that a service that you will offer even as Jupiter 3 comes out in the future and obviously has a lot more capability, does Fusion still become necessary or is Fusion a way for you to actually expand your addressable market because you can basically reserve some satellite capacity to use a little Fusion? So on the first question, we see Fusion as a key new technology and service that augments what we already do today. And if you look at our customer set, there is a lot of customers that the standard GEO services are a good fit, and we think thatâ\u0080\u0099s a predominant number of them as most of them, their applications have drifted over towards primarily streaming video and video applications. So we see that high speed kick really that, say, Jupiter 3 would provide as primary support. But if you look at the Fusion, customers that have latency-sensitive applications, we see that as really the answer that allows them to get the benefits of both the GEO and the low-latency terrestrial. Now what happens, I think, primarily for customers is that, as we look at rolling this out further, we expect to get a fair amount of our market coverage there. Well, that remains to be seen a little bit on the percentages. Obviously, as weâ\u0080\u0099re buying capacity from other players that is a lower margin than our â\u0080\u0093 use our own assets. If I may add also to that, look, weâ\u0080\u0099re expecting a significant churn improvement, and we have seen it already from the Fusion product. So while the Fusion product may, on its bill of material, cost and gross margin, not provide as much margin as you would get from using our own product, we see a significant improvement in churn, which compensates for that margin drop. So net-net, we think itâ\u0080\u0099s an incredible product, and we have received fantastic receptiveness from the margin place so far. We are anxiously waiting ourselves, and I think weâ\u0080\u0099re making great progress there inching forward every day. And for the first time ever in the satellite industry introduces the term unlimited, although itâ\u0080\u0099s no longer unlimited. But during the year that we had the maximum headwind, I think we delivered a growth year both on revenue and EBITDA. Your line is now open. Well, the simple one to answer is, we believe the investments weâ\u0080\u0099re about to make and we are making are accretive and improve our financial position in terms of margins and returns and over the horizons that typically are associated with capital investments in this industry. This industry, obviously, the capital investments are made a few years in advance, and there is no way to change that. However, we believe the margins associated in our models with any new investments would be at least as good as what we have historically done and potentially significantly better. And second is related to our share buyback, we stopped the share buyback because we believe we are able to â\u0080\u0093 in the longer term, we are able to generate significantly additional performance and gains beyond buying our own shares. And we do have use cases for our capital, and we will have demands on our capital that we think would serve the shareholders best. Thatâ\u0080\u0099s why we stopped the share buyback, even though we absolutely believe that our share price is grossly undervalued. We think we still are better off, and our shareholders are better off allowing us to use that capital to develop the business and put the business in a much faster growth trajectory. Your line is now open. In the 10-K, you talked about you have the S-band terrestrial as well as satellite authorizations in Europe, Mexico and Chile, and in the process for applying and receiving additional authorizations. So in terms of regions of the world, weâ\u0080\u0099re really focusing on that from commercial perspective, which are the regions that are going to be the most central to the most customers at the earliest stages of the project. And so weâ\u0080\u0099re â\u0080\u0093 we have a worldwide approach to market access, and weâ\u0080\u0099re well underway with that. So thatâ\u0080\u0099s the cornerstone of the effort and market access will, to a large degree, follow the deployment of this new system, the Sirion-1 system, as we have satellites to actually land traffic in jurisdictions, we will find that we will get more and more market access there. I think in terms of competition, it will probably vary from one region to the next. But we feel like with our technology and with the rights that we have for the ITU, weâ\u0080\u0099re very well positioned to be the leader. And within the U.S. specifically, I think, sister company DISH has some AWS spectrum that has a similar band. Weâ\u0080\u0099re not at a point right now where weâ\u0080\u0099re making announcements or public statements on that, but there are multiple directions that would go with that. And I think we also mentioned that enterprise has continued to grow as a percent of the revenues at Hughes,  was about 42% the most recent quarter. Yes, Ric, well, if you look at it, I think the last year and if we look forward next year or 2, we see the enterprise business continuing to grow. And of course, weâ\u0080\u0099ve had the consumer business waiting for our new Jupiter 3 satellite system. And one just mundane question on the corporate side and the financials, the corporate cost of overhead came in a little higher than we were anticipating, but I think had some tiny software  about what the right level of corporate overhead is as you have Hughes and Hughes growing and ESS, maybe getting larger too, over time. And just to remind you, in addition to the corporate expenses that does include a lot of our corporate development activities associated with the new projects weâ\u0080\u0099re doing around S-band. So there was some general increases in there, but also seeing a little bit of activity associated with our new project. So I think that level that weâ\u0080\u0099re at is, obviously, we do everything we can to keep that at the levels weâ\u0080\u0099re at. Ric, let me just add from my own business philosophy perspective, we are not adding management overhead, if thatâ\u0080\u0099s what your concern is. These are maybe shown up at the corporate level, but itâ\u0080\u0099s not adding additional management. In fact, if anything, since I joined the business, we have significantly streamlined our management and reporting lines in order to make sure we have a more of a flat organization as evidenced by the fact that we have , we have Paul representing of the house and so forth. And then final one for me to wrap it up, the ESS business, which is albeit very small, did see a noticeable uptick in EBITDA. So yes, weâ\u0080\u0099ve seen a real nice uptick into that business. Itâ\u0080\u0099s still â\u0080\u0093 the business is primarily third-party leasing on the 105 and Echo-9 satellite, so made a lot of progress there in terms of selling additional capacity there here towards the end of 2022. So look, I think weâ\u0080\u0099re â\u0080\u0093 the plan is to keep it at those levels, hopefully increase it, continue to increase it a bit here as we go to 2023. Just â\u0080\u0093 yes, so look I think we are at a pretty good level that we are at that we saw in Q4. Your line is now open. Since you brought up the segment reporting, I got to say I was hoping that with the 10-K, we might get some better segment reporting than how itâ\u0080\u0099s broken down today. Because the current structure, I mean, there is a lot buried within the Hughes segment in terms of other business lines that we really canâ\u0080\u0099t see. And would love to get a little bit more visibility on that, which I think would help with investors in your valuation. Both you have seen, first of all, the growth of our enterprise business. I think â\u0080\u0093 and I think 2023 will be a year of, I guess, transition for us as we kind of move forward with this Horizon 2 and Horizon 3 and Horizon 1, which is an optimization of what we have had. As you have seen, weâ\u0080\u0099ve done a good job in keeping the show running, but Horizon 2 and 3, which weâ\u0080\u0099re working on in 2023, kind of shape the business going forward in a significantly different way we expect. And as a result of that, it would be imprudent for us to go ahead and introduce additional segment details just to come and change them 9 months later. I think you would want us to get our act together, be more definitive with what we are planning to do and how weâ\u0080\u0099re progressing and then provide additional detail. I think the driver is that even with the CFO, our business is changing. And we have multiple evidence of growth and development and we are focused on all of them and we will find out this year, which ones are most applicable for the investors, and we do intend to make additional disclosures of that information. Obviously, youâ\u0080\u0099ve got the Jupiter 3 programs tailing off. And I think, on their call last week, ViaSat said they expect their CPE-related CapEx to be up threefold once the satellite launches. I think you should expect our CapEx to be similar to what you are seeing, and you should not expect us to be vastly different. We â\u0080\u0093 some of the CapEx that we typically had to pay for Jupiter 3, we wonâ\u0080\u0099t have to pay. But on the other hand, youâ\u0080\u0099ll see us acquire additional customers, significantly additional customers eating up some of the CapEx savings. So all in all, weâ\u0080\u0099re not expecting a disruptive step function change in our CapEx on an annual basis. I mean, donâ\u0080\u0099t hold me to every dollar of that, but weâ\u0080\u0099re not seeing â\u0080\u0093 weâ\u0080\u0099re not â\u0080\u0093 in no way we are stating that our CapEx is going to have an impressive jump of any kind. Except for two sites, they are all completely installed, and weâ\u0080\u0099ve been able to test some of these sites on an existing capacity we have on Echo 9. As I mentioned earlier, weâ\u0080\u0099ve actually deployed it in this configuration for two of the customers. Well, I think two things. One, for Jupiter 3, in Latin America and South America, weâ\u0080\u0099re optimizing the capacity for yield. So there, we expect to continue to add additional enterprise â\u0080\u0093 significant additional enterprise business. In North America, we still anticipate having applications for our capacity in the enterprise space. So it wonâ\u0080\u0099t be just consumer, but weâ\u0080\u0099re still working on those opportunities."
}