{
    "symbol": "SATS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 15:38:04",
    "content": " I would now like to hand the conference over to your speaker today, Terry Brown. Thank you, operator, and thanks to everybody for joining our second quarter earnings call. I'm joined today by Hamid Akhavan, our CEO and President; David Rayner, COO and CFO; Pradman Kaul, President of Hughes; and Dean Manson, General Counsel and Secretary. As usual, we invite media to participate in a listen-only mode on the call and ask that you not identify participants or their firms in your report. All statements we make during this call, other than statements of historical fact, constitute forward-looking statements made pursuant to the safe harbor provided by the Private Securities Litigation Reform Act of 1995. These forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause our actual results to be materially different from historical results and from any future results expressed or implied by the forward-looking statements. For a list of those factors and risks, please refer to our annual report on Form 10-K for the year ended December 31, 2021, filed on February 23, and our subsequent filings made with the SEC. Dave has served EchoStar and its shareholders diligently during his 18 years with the company, and we thank him for his many contributions and wish him well in the future. As for our agenda for the call today, first, the team will provide a brief overview of activity from the second quarter. After that, I will offer some comments on the business and our strategic planning process. Hughes had a solid second quarter in '22, one that included $426 million of new enterprise orders, one of our highest quarters on record. I'm proud to report that our HughesNet satellite Internet service has been recognized not only as the best satellite Internet provider of 2022, but also the best rural Internet provider by U.S. News and World Report 360 Reviews. This is the third time in a row that we've been recognized as the best satellite ISP, and both these accolades are a strong endorsement of our commitment to serving rural America. To that end, our team continues to focus on improving the North American consumer offering and customer satisfaction. Our new service plans, which we began rolling out earlier this year, are being well received by customers who are enjoying more high-speed data each month. And our ARPU remained strong, increasing from the first quarter. Looking ahead in our U.S. consumer market, we are excited about our new HughesNet Fusion service plans, which we will start to launch first with existing customers in August as they reflect the U.S. market beginning in September. Additionally, we remain a proud participant in the FCC Affordable Connectivity Program that helps to ensure eligible households have the high-speed Internet service they need. In the second quarter, we executed an agreement worth more than $180 million with Gogo Business Aviation. This is the first phase of our flat panel electronically steerable antenna technology, including 2,000 antennas we'll service to start in 2024 using OneWeb's LEO capacity and network. Also within the in-flight connectivity market, we completed a multiyear development and deployment project, enabling SES to launch insight services on SES-17 using the Jupiter system platform. In the U.S. managed services arena, our business remains solid. As just one example, we completed a project for a retail customers that involve upgrading network equipment at more than 2,000 stores in less than 5 months. In our OneWeb program, we continued deliveries of production gateways and systems as planned. We have shipped 23 gateways so far, and expect to complete all gateways in 2023. Our Defense Group had a strong second quarter also, winning add-ons from the U.S. Space Force SATCOM programs, a U.S. Navy 5G networks and classified systems development. In the civilian government market, the team secured a 4-year renewal of our contract with the Commonwealth of Pennsylvania, providing managed terrestrial and satellite broadband services to multiple agencies. Postal Service for managed terrestrial broadband services at 150 sites, bringing the total number of U.S. As in the U.S., our priority in the Latin American market is to maximize yield on our capacity. For the consumer business, this means value steering through tactics such as selective screening and capacity-optimized price plan. Our ARPU trend is positive, increasing from the first quarter. For example, during the second quarter, we won 2 additional orders from resellers to deliver broadband to schools throughout Colombia using our Ka-band services, bringing our total to nearly 10,000 sites under this project. In Brazil, we secured a 5-year contract extension with one of the biggest utility companies in the country, providing fleet automation for 3,000 vehicles. A large Brazilian customer expanded and extended our contract, connecting 1,700 additional retail sites to the satellite network. In Europe, a large multinational oil and gas retailer extended our contract to support the digital transformation with higher speed services and managed WiFi. An important element of our strategy is to expand connectivity in emerging markets, focusing on large populations and businesses either unserved or underfilled like terrestrial broadband business. We continue to successfully execute on this strategy, leveraging the strong acceptance of our Jupiter platform worldwide. As you know, in January of 2022, we completed the formation of our joint venture in India with Bharti Airtel now operating under the Hughes Communications India brand, HCI, the largest satellite service operator in India. It secured its first major win with a 5-year contract with Indian Oil Corporation to provide managed SD-WAN across 10,000 sites, and we launched nationwide high-throughput satellite service business, targeting enterprises, telcos and small to medium businesses using the GSAT-29 and GSAT-11 satellite office. During the quarter, PSN, Pacific Satellite Nusantara, selected Hughes to power their third high-throughput satellite with 11 Jupiter gateways that will provide 100 gigabits per second. We have managed to sustain our revenue with higher equipment sales to our enterprise and government customers both domestically and internationally, while at the same time, managing the capacity constraints and other factors across our consumer business. Our adjusted EBITDA in the second quarter was $168 million, decreasing 10% from last year. Inflation began to impact our operations in 2021, and we have experienced increased costs in certain functional areas including field services and customer care. Free cash flow, defined as adjusted EBITDA minus CapEx, was $92 million during the second quarter, increasing $38 million sequentially. Meanwhile, our balance sheet remains one of the strongest in the industry, and we continue to seek opportunities to deploy cash for growth. In the second quarter of 2022, we bought back 1.9 million shares of our stock in the open market at a cost of $43 million. On our first quarter earnings call, I shared some of my initial thoughts about EchoStar, our competitive environment and our unique strengths, including our strong balance sheet, our global presence and trusted reputation, our engineering expertise and our S-band spectrum assets. Since then, I have conducted a series of in-depth reviews of the various business lines and functional areas throughout the company in order to ascertain operational strengths and areas of opportunity. This is a methodical undertaking, designed to safeguard our financial stability and independence while capitalizing on long-term growth opportunities of existing business lines and new ones, including potential acquisitions. We are pursuing 3 parallel work streams that I call horizons, referring to 3 consecutive time windows. First, for horizon 1, we are looking at current business and ways to optimize both our operations and our offerings over the next year or so. We have touched on some of this already with the introduction of the HughesNet Fusion service, value steering and, more precisely, managing churn. To help combat profitability erosion due to the shift in revenue mix, we are focusing on capacity yield management rather than on subscriber growth. Simply -- and similarly, in the international markets, we'll direct our efforts towards the most scalable and profitable regions. For the couple of years following horizon 1, which we are calling horizon 2, we are developing and defining organic growth opportunities and preparing the organization to pursue them. For horizon 3, we are currently evaluating opportunities for new long-term avenues of growth, including commercialization of our S-band assets and potential M&A opportunities. Regarding our S-band initiatives, I would like to share a couple of high-level updates. EchoStar Mobile, our EU licensee, introduced our Pan-European LoRa-enabled Internet of Things network at the LoRaWAN World Expo in Paris. This network is the world's first bidirectional, real-time LoRa-enabled satellite service, and it provides seamless coverage of Europe, combined with the ability for hybrid devices to roam onto existing LoRaWAN terrestrial networks. We are on track for commercial service launch in late 2022, and we are excited to help transform the satellite IoT market with cost-effective, reliable and standard-spaced IoT services. We are grateful to our many team members across Europe who did a superb job in responding to this crisis, and we believe this effort demonstrated the vital role of high-quality mobile software services in the region, potentially worldwide. I know you're eager to hear more specifics on our strategic and financial direction, and I look forward to sharing additional information with you on future earnings calls. As you know, we are now in the -- we have the satellite in the chamber, which is one of the biggest hurdles that one has when you build satellites. And so we're getting more and more confident that the dates that we have projected are going to be met, give or take a few days here and there. I think, typically, once we launch the satellite in a couple of months after that, we should be in service. So we're still being -- we can't predict the exact date we launched for satellite, but by the end of the first half, I think we should be in service as a total new satellite in service. And obviously, some major industry events and news over the last couple of weeks, one of which was OneWeb and Eutelsat proposing a merger, Help us understand what that means for EchoStar and Hughes since they're both customers of yours. So really, it's a very positive development for us, I think. Both -- as you mentioned, Ric, both Eutelsat and OneWeb are very good customers of ours, so we feel good that we will continue to do business with them going forward. The current contracts that we have, which are significant are -- will continue. And I think this merger, along with the relationships we have with them really facilitates the GEO-LEO advantages that we've been talking about for the last 6 months. So all in all, we are positive, and we hope it will enhance not only our business, but obviously Eutelsat and OneWeb's business. I think if anything, we are hopeful that this will accelerate the process of starting phase 2, which gets us much more capacity and much higher speeds than phase 1 because potentially, this could make the funding for phase 2 and OneWeb a lot more practical at this stage. Pradman, I'd like to direct that question to you as well. Now the solution we are hoping in the interim will be Fusion, the Fusion service that we talked about, which is the combination of GEO and LTE capability, which will address the Fusion -- Fusion will address the latency issue very well. So we're hoping once we do that, that should reduce our churn from the people who need faster latency compared to the other services that don't need it. So we're hoping that we take the combination of customers that we have that will require low latency and the introduction of Fusion service beginning in August and September this year, that we will address the customers that are churning out. But I think the market will support 2 or 3 suppliers of this service, of high-speed service. And the second question is I've noticed that as you've embarked on evaluating the horizon 1 through 3 review, you've continued as a company with share repurchases. I'm curious on the one hand, the governing thought, continuing repurchases while thinking about some of these future strategic opportunities that you may have, particularly on the S-band. Dave, may I direct it to you first, and if there's additional comments on that, at the end of your comments. We continue to view the stock as being grossly undervalued, and so we're continuing the buyback program. Right now, we're only using a fraction of our operating free cash flow on that share repurchase. In terms of what an S-band network structure would look like, I think that is very much still in play. As to exactly what we will build out, we're aggressively pursuing those opportunities to evaluate that network, as Hamid has discussed, and I'm sure he's willing to discuss it further. But right now, we're very confident in the position of our balance sheet and our capability of making significant investments going forward. But at the same time, we're not spending as much on subscriber acquisition costs, so we continue to generate cash from operations related to that. And it's always important to balance that against new investments, not just S-band, but other organic growth opportunities that we may want to invest in, other product enhancement, acquisitions that we may want to look at. It's certainly -- we don't look at it one-dimensionally, and we know we have to trade off one against the other. And in the future, if we see huge opportunities in 1 area, that we make significant investments in, it may result in us slowing the growth in some other areas. But it's all done with a lot of thought and a lot of analysis with the intent of long-term growth of both revenue and cash flow and, obviously, shareholder value increase. Obviously, you're supplying gateways to Eutelsat and you're supplying gateways to OneWeb, so you seem pretty well positioned there. Pradman, I'll pass this question to you. Yes, besides gateways, we're already supplying modems for the user terminals at OneWeb. Number two, our program of developing the electronic scanning array is a very exciting program, and we are in significant testing right now and expect that we will be able to start delivering production terminals next year. And so we are hopeful that a lot of the applications at OneWeb next year will use our ESA, and that should generate significant revenues for us in the next 3 to 4 years. Now I thought last quarter, when you talked about the ESA, you were talking mainly about the IFC market. No, we're not going to supply and neither is OneWeb where their plan doesn't have the consumer in mind because the cost of an ESA, it just doesn't make sense for the consumer market where you can generate an antenna cost of $40 or $50. So the intent here is to address mobility -- the mobility market airplanes, ships, trucks, cars for the high-end enterprise. And so the idea there would be, today, they have to use these domed parabolic antennas because there's no ESA in the market that meets the requirement. And we will then start supplying the user terminals using the ESAs for all these other applications, except the consumer, which OneWeb announced are not addressing at this stage. Sorry, I said consumer I meant for enterprise because clearly, OneWeb is focused on the enterprise market. The government is going to be a big market for that, the U.S. government, the British government and a bunch of other governments that OneWeb already either signed contracts with or in the process of signing should be a big element and then certain types of big enterprise customers. We think next year, we should be deploying them all over the globe. I think in Gogo's 8-K, they indicated '24, '25 sort of deployment. As you said, we have to -- in order to fly a new piece of equipment, it has to go through a whole bunch of safety and airing kind of tests to be done, and that just takes time. I know a small contribution, but the margins, which had been in the 50s were up to kind of 60% in Q1 and in the 70% range in Q2. So I guess, should we expect to see the margins correct down 10, 20 points or so as you actually begin to ship hardware. Dave, if I may direct this to you in terms of the margin question. I'm not really sure I'm following you there, Chris, because you seem to reference ESS margin increases, and then you went back to Hughes equipment. Well, in the 10-Q, you break out the ESS as both service and hardware, but there has been no hardware up to this point, and I'm kind of referring to the EML business. Yes, the EML business is not -- and to be clear, EML is not part of ESS. And as you know, that revenue incrementally is almost 100% -- 90% margin. So as we grow that business, even on a small basis, the margin increases significantly. Let me address the first part of that, and I'll let Pradman address the second part. Yes, I mean, from a pure margin percentage standpoint, you're going to see erosion. We would like to see the margin dollars stay relatively flat, that obviously, there will be an up charge for Fusion to offset that incremental LTE cost. But given that we haven't really introduced the product yet, we haven't seen the impact on the margins, but our expectations would be dollar margins flat, but the percentage margin obviously erodes a little bit because of it. We have an agreement with 1 major wireless carrier right now, but it's not exclusive. In their 8-K, they indicate that they've got an exclusive on that business aviation product. And as we get into the business next year, we'll certainly look at the commercial aviation market. But today, our product is focused purely on the business aviation. This is a bit of a hypothetical, but recently, SpaceX made a filing for 2 gigahertz spectrum, specifically the spectrum that DISH currently holds on their -- what used to be called the TerraStar satellite here in North America. And I won't force you to guess what happens with that battle royale, but I guess the question is the Echo XXI is in essence, the TerraStar 2 satellite that you operate in Europe. Dean, if I may first direct this question to you, and then I'll add comments at the end, if necessary. Obviously, we have an interest in the S-band and do monitor filings there. One, I want to follow up on one of Michael's questions earlier with the competitive dynamics. Pradman, perhaps you can start the question. But I think at this stage, they're not the major barrier for us because the markets that they are serving are different from the markets that we are serving. We do in some of the fringes have some overlap markets, but not in a significant manner. From a competitive technology, obviously, a company like Starlink is the competition we worry about the most. Well, it's where the line is between number of subs per square distance. And generally, the other element that comes into play, obviously, is the financing the capitalization of a lot of these WISPs. Another question on kind of horizon 1, 2 and 3. Obviously, that plays into Michael and my kind of competitive landscape questions as well. But the way we think of horizons right now is that we are assuming that at least for the first 2 to 3 years of the operations of Jupiter 3, we do have a significant market advantage with an enormous capacity at a very reasonable cost per bit and some new products that we are working on in that area. So at least for the 2 to 3 years, which we consider horizon 2, we get an uplift in nearly all of our financial metrics, top and bottom. And by then, obviously, Jupiter 3 will continue to evolve and give us additional growth, but then our horizon 3 kicks in. Of course, Jupiter 3 will continue to grow. As I mentioned, it would be difficult for us to disclose any of that because it's work in progress and also somewhat sensitive. From a competitive perspective, you really can't disclose much until you have made enough progress that it makes sense to let the market know. But perhaps I can say that in horizon 2, it's primarily organic, but there may be some tuck-ins where in the enterprise business, we can increase additional density as opposed to scope. We have served a very large set of products, and we might choose to go deeper on 2 or 3 categories of enterprise or verticals, vertical offerings within the enterprise business, which is very broad. So there'll be more of a tuck-in acquisitions, just to give us enough depth and density. In horizon 3, we clearly are looking at a much larger scale, acquisitions or investments. Obviously, our S-band opportunity phones in that horizon 3, as I mentioned. But we are certainly looking at what can be, in the periphery or adjacency of the space we serve, that can come -- that could be synergistic with what we already have. So that takes us from our core to adjacent rings, perhaps towards enterprise business where we can have a bigger play in terms of the addressable market, yet remaining synergistic with what we already have. So that's probably as specific as I can be at this time, but we are hoping to share with you in the future release the earnings calls much more specifics. So as I mentioned, we are in a search process right now. This is a position that I will absolutely take very seriously, and it's an incredibly important position for our company, not only because it is generally an important position, but also we're in a company that we expect ourselves to remain in transition and new growth opportunities mode, both organically and inorganically. And certain depth and skill sets is required for that, and that is something that is obviously not easy to find. Again, that's -- please allow us to take our time and do the best job we can in terms of selecting. On the second half of that, it's hard really to address that. Sort of from the status quo, you're going to have -- by status quo, I mean, the existing business, not the horizon 2, the horizon 3 initiatives, which could obviously change that CapEx mix. But in post launch of Jupiter 3, what you're going to see is probably an increase in SAC, so consumer premise equipments, specifically on the CapEx piece, and a decline obviously on the satellite and launch-related costs associated with that. So it just depends on the -- how quickly we decide to grow the residential business or how much we take that capacity into alternative uses, as Pradman described. It's all about yield management, it's not about subscriber counts. But in terms of this year's CapEx, yes, it's going to be in the same range, probably in the $400 million range for the full year. Thank you, operator, and thank you for everybody for joining the call today, and we'll look forward to talking to you next quarter."
}