{
    "symbol": "HOV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-01 17:08:06",
    "content": " Moving to the upper right hand portion of the slide, you can see that our adjusted gross margin increased 170 basis points to 22.4% this year compared to 20.7% in last year's first quarter. In the lower left hand quadrant of the slide, you can see that our SG&A ratio was 12.8% for the first quarter compared to 11.1% in last year's first quarter. On Slide 8, you can see that excluding incremental phantom stock expenses, our adjusted pretax income improved 92% to $41 million compared to $21 million last year. Further demonstrating we're investing the money needed to grow our community count during the first quarter of fiscal 2022, our land and land development spend was $195 million, that is 9% increase over the $179 million we spent during the first quarter of fiscal 2021. Turning to Slide 17, even with that increase in land spend and paying off $181 million of debt late last year, we ended the first quarter with $271 million of liquidity. On Slide 20, we show the dollar value of backlog including domestic and unconsolidated joint ventures increased 13% year-over-year to $1.9 billion at the end of the first quarter. Beginning with the adjusted gross margin in the upper left hand quadrant, we assume that our multi-year target gross margin will decline by 400 basis points to a more normalized 20.5% compared to the 24.5% gross margin in the midpoint of our fiscal 2022 guidance range. The lower right hand quadrant of the slide shows that at the midpoint of our fiscal 2022 guidance, we will have grown revenues by almost $600 million since fiscal 2020. Given our planned growth in inventory and our expected higher inventory turns, we are seeking revenue growth of about $1 billion from the midpoint of our 2022 guidance range, which will allow us to achieve our $3.95 billion multi-year revenue target. As you can see, from the upper right hand portion of the slide, we are targeting to achieve a relatively stable multi-year adjusted EBITDA target at just over $450 million. However, we continue to focus on lowering our leverage levels and are seeking to achieve debt reduction by about $525 million from the $1.17 billion projected at the end of 2022 to $650 million of debt in our key metric target. When coupled with the $181 million debt that we reduced last year and the additional $200 million we plan to reduce in this fiscal year, this goal would reflect almost $1 billion of debt reduction from the $1.6 billion we had at the end of fiscal 2020. In the lower right hand portion of this slide, we show the roughly $70 million of savings, our multi-year targeted debt reduction goal would have on our interest expense. We continue to evaluate our capital structure and explore transactions to simplify our capital structure and strengthen our balance sheet, including those that would refinance our debt at lower rates, which would add to the savings and interest expense that our $82 million multi-year target assumes. We showed in the upper left hand portion of the slide our goal of achieving adjusted pretax earnings of about $372 million, up from $197 million in fiscal 2021. On the upper right hand quadrant, you see the multi-year growth target for shareholders equity to $838 million, up 379% compared to our $175 million equity at the end of fiscal 2021. In the bottom left hand portion of the slide, we show that if we were to achieve our multi-year key metric targets, that result would lead to dramatically improving our debt to cap ratio to about 44% and would mark substantial progress towards achieving our longer-term mid 30% debt to cap target."
}