{
    "symbol": "ARBE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 14:00:23",
    "content": " What we also see is that across all the OEMs, the understanding the Imaging Radar, the capability to have an independent source of information to the autonomous features and to the autonomous driving capabilities is a fundamental element that the manu -- car manufacturers are looking to add into the vehicles. With the basic Imaging Radars that are coming now into the OEMs and the car manufacturers, you might be able to see that there is a bigger object maybe sometimes identify them as stationary objects, but not really separate them and be able to see two distinct objects even if they are stationary and thatâ\u0080\u0099s what the Perception Radar is really bringing into the table. So if we look at the current generation radars, many of them, they are good for the adaptive cost control, maybe for some emergency braking, because they can see if there is something in front of you, they wonâ\u0080\u0099t be able to understand exactly the size of it, they wonâ\u0080\u0099t be able to understand exactly if itâ\u0080\u0099s a stationary, they wonâ\u0080\u0099t be able to identify it even if itâ\u0080\u0099s a stationary versus the Perception Radar that can clearly show the boundaries of these objects, can clearly show the free space, whether I can squeeze in between two different vehicles, whether the pedestrian is walking next to a track. So when we -- in Arbe is a chip manufacturer, our main customer in the automotive market are the Tier 1s and we have four Tier 1s that publicly announced that they are basing their next-generation radars based on our chipset. Itâ\u0080\u0099s -- this application is called Simultaneous Localization and Mapping, and this is considered one of the most difficult applications doing on sensor-only -- radar-only stack and we can -- we prove now that this is possible with our technology and this could be the basic for really planning the trajectory of the car for autonomous driving, but also for simpler ADAS functions like emergency braking and lane changing once you can get this high-resolution map with that perception, and of course, velocity perception, doppler perception, then you can really make conscious and smart decisions while you drive. We will give to the OEMs much better abilities to develop their own stack, their own kind of radar on top of it, and of course, to the Tier 1s, but we donâ\u0080\u0099t see the OEMs -- we havenâ\u0080\u0099t heard even from one OEM that they want to develop their own chipset. The -- what we see from the OEMs is a very strong desire to make their hardware ready for the features coming with the autonomous driving Level 2+ going towards Level 3 and make sure that their hardware is capable of processing and being able to sense the environment, and for that, you need the Imaging Radar as an independent sensor compared to the camera. So we can only refer to OEMs that allowed us to say their names, but we are hearing a lot of requirements and global trend of OEMs going into Imaging Radar and Perception Radars with the high channel count and thatâ\u0080\u0099s across about -- across the market, across most of the OEMs today."
}