{
    "symbol": "ARBE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 17:35:04",
    "content": " We were one of the first to launch radar adaptive cruise control in 1999 with Mercedes and have built the product line up to having 16 customers around the world in every segment of radar from corners to front looking, rear looking -- veneers looking at this new segment that's growing in the radar world around imaging radars. This collaboration focused on mass market production, safety compliance and providing customized for the imaging radar solution to automotive OEMs and for autonomous vehicles, trucks, commercial vehicles and traffic applications. We believe our next generation imaging leaders designed with Avis chipset, which used 48 mid and 48 this attendance to grade 2, 3 CI petro-channel lay for digital being coming instead of using a reliable figures will deliver unparallel leader performance by leveling thousands of venture transmitting and receiving channels, providing customized for the imaging leader solution to passenger and commercial vehicles as well as topical applications at a competitive price. And I anticipate that over the next 3 years, in particular sensor technologies, advanced sensor technologies like imaging radar technology will actually come to a price point and capability point where they have the reliability and value that the industry will increasingly use that technology to provide better ADAS functionality and applications to consumers. And I do believe that because technology is maturing in a good way that you will see the technology being democratized, meaning that more and more vehicles will actually be able to have this technology in their cars, especially also since the automotive industry is working on new electronic architectures that will be launched by the middle of this decade, meaning by 2024, 2025, and those new architectures will make it much easier to include those technologies going forward. I think the third player in this market, selling today 50 million ran of the year and expecting to reach 200 million rates by the end of the decade and shifting from the current rate of -- to imaging radars in the future, a major shift."
}