{
    "symbol": "BFRI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 12:53:07",
    "content": " Good morning, and welcome to Biofrontera Inc.'s first quarter 2022 financial results conference call. Also this conference call contains time-sensitive information that is accurate only as of the date of the live broadcast, today, May 13, 2022. Biofrontera undertakes no obligation to revise or update any forward-looking statements to reflect events or circumstances after the date of this conference call, except as required by law. Biofrontera believes these measures provide useful information for investors, yet should not be considered as a substitute for GAAP, nor should they be viewed as a substitute for operating results determined in accordance with GAAP. More specifically management will be referencing EBITDA, a non-GAAP financial measure defined as net income or loss excluding interest income and expense, income taxes, depreciation and amortization, legal settlement expense and certain other non-recurring or noncash items. Welcome, everyone to Biofrontera Inc.'s first quarter 2022 financial results conference call. It's clear that Biofrontera has significant market opportunity ahead of us, and I'm confident in this team's ability to capture it. Adoption of photodynamic therapy use going as are the clinical successes among Biofrontera sponsored and investigator initiated studies with our products, establishing our position as the leader in PDT and expanding the Ameluz label to deliver innovative solutions for patients, are the key mechanisms to unlock the drug’s potential. For the first quarter of 2022, total revenues were 9.8 million versus 4.7 million a year ago, representing an increase of 5 million or 106%. Cost of revenues increased 100% to 5.2 million, primarily due to higher sales of Ameluz. Selling, general and administrative expenses were 7.7 million, up 2.8 million primarily due to higher legal expenses, business insurance, commissions expense and personnel expense due to resumed hiring. Adjusted EBITDA was negative 3 million for the first quarter of 2022, compared with a negative 2.8 million for the first quarter of 2021. As of March 31, 2022, Biofrontera had cash and cash equivalents of $22.4 million. To provide some further metrics on our results, March 2022 was our strongest sales month on record, and Q1 was our second highest quarter on record. We expect total revenues to increase by at least 30% compared with 2021, including the typical seasonal strength in the first and fourth quarters. As I mentioned during our last conference call, a price increase for Ameluz that went into effect April 1 contributed to some advanced buy-in, yet we did not see as significant of an impact as in previous years when the January 1 price increase affected Q4. Beyond seasonality and some advanced buy-in, the other strategic drivers of our Q1 revenue were improved sales direction and tactical execution stemming from the field-focused approach, coupled with strengthening brand recognition and Ameluz’s share a voice among dermatologists through additional promotional efforts. In 2022, we are actively optimizing our sales team and are already seeing gains among our current customers. This team expands our market access support capabilities, enabling Biofrontera to be a dedicated partner for a wide range of specialized dermatology clinics from institutional accounts to regional organizations. Educating the industry on the importance of field therapy and the high efficacy of our product will support our efforts to expand utilization of PDT, especially among patients with more than 15 AK lesions when reimbursement for cryotherapy is tapped. Beginning next year, we will be expanding our sales organization with more reps in the field to further leverage the strategies, teams and initiatives we are putting in place this year. In January we attended the Winter Clinical Dermatology Conference and Maui Derm, both held in Hawaii, where we hosted an expert advisory board meeting with nine dermatologists to gain insight and guidance on key clinical and scientific messaging that addresses unmet needs, as well as approaches to the best communicate -- the best communication of critical data findings. In March, Biofrontera had a strong presence at the 2022 American Academy of Dermatology Annual Meeting, the largest and most prestigious dermatology conference. At the AAD, the team connected with practitioners and industry thought leaders as part of our continued effort to build Biofrontera brand awareness and trust within the community. Yesterday, we attended the Skin Cancer Foundation's Champions for Change Gala 2022 in New York, with proceeds from the fundraiser supporting life-saving educational campaigns, community programs and research initiatives. This week, members of the Biofrontera team are at the Music City symposium for Cosmetic Advances & Laser Education in Nashville, hosting a booth showcasing our AK treatments. The RhodoLED XL, which was approved in combination with the Ameluz for the treatment of mild to severe AK on the face and scalp allows for the elimination of a larger skin area, thereby enabling simultaneous treatment of AK lesions that are different from one another. Additionally, our licensor Phase 3 study evaluating Ameluz PDT in combination with the BF-RhodoLED lamp for the treatment of superficial basal cell carcinoma is approximately 75% enrolled. As we continue on our strategic path in 2022, we see growing brand value as a key metric of our medical affairs initiative, and we will continue to take advantage of opportunities to present our company and products and host demonstrations roundtables and other educational sessions. We have made tremendous progress in executing a thoughtful, thorough commercial strategy that addresses the changing landscape of dermatology, as well as in strengthening our brands through industry education and awareness initiatives."
}