{
    "symbol": "NTRA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:13:03",
    "content": " Given the volume and the reimbursement traction we are seeing, we think it's clearly the right strategy to continue to establish Signatera as a standard-of-care for MRD and recurrence monitoring, even if the unreimbursed volume growth pressures our margins in the immediate term. In addition, we do see a path to improving ASP on some of our germline testing through anticipated guideline changes, and we do think there is a path for us to get coverage on heart and lung in the transplant business On our cash burn guidance, we now expect to be at roughly $450 million in 2022 with significant improvement in â\u0080\u009823 and beyond. Just to level set, like where we've been and where we're going on Signatera ASPs, we started last year with the $500 on ASP and we've rapidly grown that ASP as we've gotten coverage for Medicare and the mix shift has continued to improve, both in terms of mix of Medicare reimbursed CRC patients and also a steadily improving mix recurrence monitoring patients as well. And actually, I think as we start to kind of look at the landscape and some of the newer ways of doing studies, there's been some companies recently that have done prospective trials in the range of 10,000 patients that are, sort of, matched with gold standard colonoscopy and they've executed those studies in the range of, kind of, $15 million to $20 million and took in the range of kind of one year. I don't think we've previously talked about average number of tests per patient, but what I can say is that the pricing for that service does reflect an expected higher testing frequency and slightly longer time frame on average than what you would see with the service that was priced for patients with colorectal cancer, for example, for Signatera, where the pricing was just under $6,000. And then based on some of the improvement projects and in-house projects that Steve was -- we're seeing earlier in the Q&A, we think that can drop down below -- lower again to below $500 on a blended basis per unit next year and just going to continue to get lower as your mix continues to shift towards repeat monitoring, and we just continue to get more efficient."
}