{
    "symbol": "NTRA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 18:40:02",
    "content": " During the course of this conference call, we will make forward-looking statements regarding future events and our anticipated future performance, such as our operational and financial outlook and projections, our assumptions for that outlook, market size, partnerships, clinical studies, opportunities and strategies and expectations for various current and future products, including product capabilities, expected release dates, reimbursement coverage and related effects on our financial and operating results. Please refer to the documents we file from time to time with the SEC, including our most recent Form 10-K or 10-Q and the Form 8-K filed with today's press release. We will provide guidance on today's call, but we'll not provide any further guidance or updates on our performance during the quarter unless we do so in a public forum. And we reached an incredible new milestone by processing 500,000 tests in a single quarter, growing more than 33% over Q2 of last year. We saw a strong continued sequential growth from organ health and oncology products, strong ASP gains in Signatera in NIPT, and we further strengthened our NIPT market position. This business momentum enables us to again raise our 2022 revenue guidance to $805 million to $825 million, an increase of $15 million at the midpoint. Pro forma for last year's onetime QIAGEN revenue of $28.6 million, this new range implies an annual revenue growth of 37%. Mike will cover this in detail later in the call, but our progress so far this year makes us even more confident on our path to cash flow breakeven in mid-2024. As good as the Q2 results were, they were negatively impacted by a timing difference of about $3 million worth of volumes that were accessioned in our lab but not reported out until early July. Therefore, we believe the printed results actually understate the momentum we think we are seeing in the business right now, and I think the rest of these highlights show that we are just getting started. We recently announced that we've been selected to participate in UnitedHealthcare's Preferred Laboratory Network after completion of a rigorous application and review process for access, cost, data, quality and service. We share UnitedHealthcare's commitment to driving improved patient access, affordability, outcomes and patient experience. This is the largest prospective multisite fully biopsy-matched study that has ever been published in the space and highlighted the benefits of testing for both donor-derived cell-free DNA percent and quantity, which we provide with each Prospera result. We continue to reach a record number of Signatera tests performed in each sequential quarter with our commercial momentum remaining very strong, led by colorectal and IO monitoring indications. In addition, we recently secured Medicare reimbursement for Signatera in muscle invasive bladder cancer. We continue the drumbeat of presenting excellent data at ASCO in June with 11 circulating tumor DNA abstracts, including one oral and seven poster presentations. In addition, we plan to publish or submit many significant studies for Signatera in the next few months, including data in colorectal, gastroesophageal, pancreatic, breast, ovarian, melanoma and bladder cancers. Seven of these studies have more than 500 time points, making them some of the largest circulating tumor DNA studies to date and four are in new tumor types. We are all very excited about Natera's future, and I think the Q2 results demonstrate we are on the right track. We processed a record 499,901 units in the quarter, 1/3 more than we processed just in Q2 of last year. As you can see from the volume progression on the chart, it was just recently that we surpassed 1 million tests for a full year in 2020. So to be at the 500,000 test level for a single quarter demonstrates the strong momentum in the business. We overcame our typical seasonality in the women's health business that we have historically seen in the second quarter, which is a function of existing accounts seeing fewer prenatal patients during Q2. In fact, this is only the second time in recent history that we've grown sequentially in Q2 versus Q1. New account starts were very strong, and we see an opportunity to further consolidate market share in women's health. Since the SMART trial was published in the spring, we are finding that data to be a significant competitive advantage in the field. We are off to a very strong start so far in Q3, and I think the raised guidance demonstrates our visibility, solid performance in the second half of this year. On the next slide, you can see the revenue growth was even stronger than the unit growth at 40%. As clinical Signatera volumes grow, the ASP progression is particularly impactful to the overall model. We are now seeing the Signatera ASPs in the 700s for the first time, and we think there's room for more improvement in the second half of this year. This is being driven primarily by our mix of Medicare-reimbursed tests improving and an increasing fraction of our volume starting to come from the recurrence monitoring indication, which is reimbursed by Medicare at the ADLT rate of $3,900. And overall, we expect this agreement to be a positive for our women's health products. In women's health, we continue to benefit from further market penetration, driven by ACOG's average risk recommendation in NIPT from August of 2020. So there's still a large opportunity for growth, enabling us to help more patients and physicians. Our volume has also increased from competitive wins where we continue to differentiate ourselves with unique clinical features and strong data, combined with our focus on user experience. I think we're well positioned to continue to lead going forward given we're still publishing meaningful data and adding clinical features, while many competitors do not appear to be investing in clinical data generation or their NIPT business. One example of our investment in clinical data generation is the publication of landmark SMART study in The Gray Journal, which validated the high clinical utility of 22q testing. Natera's 22q test is well positioned given the excellent sensitivity, specificity and PPV and because of our ability to assess the smaller 22q deletions that have historically been more difficult to detect and make up roughly 41% of the disease load. Test performance, breadth of disease load coverage and strong clinical data are important for physicians. Based on this quality of the SMART study, we are now even more optimistic that 22q deletion syndrome could be included positively in society guidelines in the near future. As 22q becomes more important as part of the decision of which NIPT laboratory to use, we see the benefit of choosing Natera increasing. Now in organ health, let's spend a bit more time on the Trifecta study recently published in Transplantation, which is a leading journal in the transplant space. Using a novel two-threshold algorithm incorporating both donor fraction and estimated amount of donor-derived cell-free DNA when assessing active rejection, the Prospera assay excelled at discriminating between active rejection and nonactive rejection with an AUC of 0.88 versus molecular pathology. We're continuing to perform very well, seeing record levels of test utilization in kidney, heart and lung donor-derived cell-free DNA testing. Chronic kidney disease affects roughly 37 million Americans, making it one of the single largest areas of health care today. In fact, a recent study published in the New England Journal of Medicine showed that roughly 10% of chronic kidney disease patients have a genetic etiology. Results can inform targeted treatment and therapies, help avoid kidney biopsy, confirm or reclassify a clinical diagnosis, provide risk assessment to relatives, identify candidates for clinical trials and diagnose conditions that could benefit from additional medical referrals. Total enrollment in the study is now -- was more than 1,700 patients across over 30 U.S. sites. To our knowledge, this is the only large-scale prospective multisite study looking at the clinical utility of performing routine genetic testing on chronic kidney disease patients. As a reminder, we started this study several years ago with the most prestigious academic centers in the field and partnered with Dr. Ali Gharavi, who's the Chief of the Division of Nephrology at Columbia University, as a principal investigator. Given the number of patients diagnosed and living with CKD, the TAM for this opportunity is similar to that of hereditary cancer testing. The big news in oncology was MolDx's decision to cover Signatera for muscle invasive bladder cancer under its umbrella LCD, which we announced in July. This is our fourth coverage decision by Medicare for Signatera after early-stage colorectal cancer; then a follow-on extension for Stage IV oligometastatic colorectal cancer; then third, the pan-cancer immunotherapy monitoring; and now, bladder cancer. Based on the communications we've had from MolDx, we believe coverage will include the neoadjuvant, adjuvant and recurrence monitoring settings. With about 81,000 newly diagnosed cases per year, bladder cancer is the sixth most common cancer in the U.S. generally split into muscle invasive and non-muscle invasive. Signatera's coverage in muscle invasive disease on the right side of the page represents, we believe, about 35,000 new patients per year. Based on our anticipated testing schedule, which itself is based on current NCCN guidelines for imaging, we believe this implies approximately 400,000 Signatera tests per year at full adoption. As a reminder, to put this in perspective, that is more than 2x the size of the entire breast cancer gene expression testing market, which has been a very important area for diagnostics in the past. To better understand the clinical utility of Signatera in this population, let's take a look at the patient journey. Once it's been diagnosed as muscle invasive, guidelines recommend neoadjuvant chemotherapy prior to cystectomy. However, it's reported that approximately 60% of patients do not respond to neoadjuvant chemotherapy with a lack of good biomarkers to assess that response. After surgery in the adjuvant setting, up to 2/3 of patients are cured by their surgery alone, while the other approximately 1/3 of patients will go on to experience distant recurrence. Here, the clinical challenge is whether to prescribe adjuvant systemic treatment, either chemotherapy for those patients who did not have neoadjuvant chemo or the new option of prescribing a year of immunotherapy as nivolumab was recently approved for use in patients at high risk of recurrence. Finally, in the surveillance setting, NCCN guidelines already recommend intensive monitoring as the scientific evidence is strong that early asymptomatic detection of recurrence leads to better survival. However, with the current monitoring tools, primarily imaging, it's reported that at least 50% of relapses are still detected too late. First, the 2019 Christensen paper in the Journal of Clinical Oncology, which followed 68 patients with regular testing, 656 time points in total, all the way from diagnosis through neoadjuvant therapy, surgery, then MRD assessment and recurrence monitoring. Second, in the 2021 Powles paper in the journal Nature, we reported that Signatera could identify the 37% of patients who were MRD-positive after surgery and who benefited significantly from immunotherapy, while the other 63% of MIBC patients who are MRD-negative did not see any significant benefit from immunotherapy. Coming from the Phase III randomized IMvigor010 trial, this was the first demonstration that Signatera is predictive as well as prognostic. The strength of that data, together with the breadth of evidence in other cancer types, is what makes oncologists so enthusiastic about incorporating Signatera into their standard of care. We will use the existing sales and marketing team focused on community and academic oncologists, the same user experience and customer support tools that have already been established and just simply continue scaling the existing Signatera lab since it's the same MRD product that we already offer for CRC and IO monitoring. With our strong commercial adoption and with every new covered indication, we create additional operating leverage and drive additional customer loyalty, further extending our first-mover advantage in this exciting field. After the bladder cancer announcement, we have been asked what is next in the clinical road map. We anticipate several important data sets to be published or submitted in the coming months in the areas of colorectal, gastroesophageal, pancreatic, breast, ovarian, melanoma and more. As Steve mentioned, seven of these papers have more than 500 time points and four of them are in tumor types where Natera has not yet published peer-reviewed data, making them substantial additions to our body of evidence. We also continue to grow and execute on our pipeline of prospective clinical trials, which are expected to deliver definitive practice-changing evidence over the coming years. Number one, we have submitted the CIRCULATE data from Japan for publication, which now includes 18 months of clinical follow-up versus the 12 months we presented earlier at ASCO GI. Number two, we're pleased to have enrolled the first patient into the new NCI-sponsored CIRCULATE-US trial. On the next slide, we're seeing early signs of enthusiasm from private payers. And we're hopeful that the NCCN Guidelines Committee for CRC, which meets in late August, may incorporate tumor-informed MRD into their guidelines. We believe a guidelines update is further supported by the recent data from Australia published in the New England Journal of Medicine, which showed that MRD-guided treatment of stage II colon cancer resulted in the same survival outcomes with approximately 2x less chemotherapy. As Steve mentioned, revenues would have been roughly $3 million higher in the quarter, if not for the timing difference between accessioning in the lab and reporting out the units, which is the event we need to accrue revenue. So that also artificially held down gross margins in the quarter, and I expect Q3 gross margins to be a little higher than usual as a result. In women's health, we have a sustained track record of adding 250 to 300 new physician offices ordering per month on a base of approximately 20,000 customer accounts. NIPT ASPs were up sequentially again this quarter, and we think there's more room for progress on women's health ASPs in the second half of the year. In addition to that progression, we estimate that we have about $30 million in receivables on accrued units that we expect to catch up on in the second half of the year. I won't repeat all of that here, but the first half of 2022 has reinforced for us that getting to cash flow breakeven is not going to require draconian cuts or fundamental changes to the business model. Based on the results we've seen so far this year, we now think we can get to a cash flow-breakeven quarter by mid-2024. On top of that base case, I think we have a number of potentially meaningful catalysts that we think can be achieved in the near term, as you can see on the right-hand side of the page. Any one of these catalysts would represent another step function change for the Company, and we've spent a lot of time describing why we are in a great position to achieve each of them. As you can see on the slide, this new guide represents a major step up from our initial guide in March and reflects the strength we are seeing in both ASPs and volumes across the Company. We are holding cash burn, margins and expenses stable to the prior guide for now, which represents some caution on the working capital elements we described earlier, expected continued scale in the women's health products and a recognition that the Signatera clinical unit economics, while improving, are still in a phase where they are dilutive to gross margins for the time being. Thanks for the question. So I think on the share gains, we think it comes down to a lot of things. And in addition, there's about nine points of clinical differentiation where we offer things that others simply can't do. So I think it's largely those two things, combined with our focus on user experience that are driving our share gains. Of course, as others pull back their investments both in their commercial infrastructure and also in R&D, I think that does benefit us. But largely, I think we're benefiting from the data and the clinical differentiation. On the 22q side, we've talked a little bit more in this earnings call about the possibility of society guidelines being updated in the near future. There's a very strong clinical utility resulting from doing prenatal testing for the 22q deletion and that's outlined in the SMART study, which was the largest prospective trial that's ever been done in the space that was published in January of this year. So we do think that there's a likelihood, a possibility that society guidelines change in the near future and include 22q as part of routine prenatal screening. I think on the Signatera ASP, it's largely what we had high hopes and expected for at the beginning of the year, which is our Medicare mix is increasing, the number of chemotypes that are reimbursed are increasing. So it's really a pretty natural organic progression on Signatera as we're very focused on, obviously, because those lines are really ramping. So on the NIPT side, it's -- again, it's pretty predictable. There's been some other barriers to kind of getting reimbursed for those patients and though that's gradually improving, whether it's kind of administrative barriers stopping us from getting the reimbursement for a covered test or just new coverage policies coming online. And related to that, I think you've seen stronger adoption in  patient population for CRC. Certainly, the -- with the median age of diagnosis at 73, we do expect a bigger Medicare mix there, a heavier Medicare mix, which is going to be positive for ASPs. Let me just add on commercial adoption, I'll say we're already seeing a nice increase in the utilization in muscle invasive bladder post some of these publications coming out. And post the coverage decision, there's been, I think, a lot of positive buzz. I think when you look at the overall TAM, it's about maybe 1/3 of -- maybe between 1/3 and 1/2 of what we had announced previously for colorectal, so that's potentially a good benchmark. But the other thing that I think is really unique here is that there's very limited data, I think, from competitors in this sector in muscle invasive bladder. And I think that's an opportunity for us to really kind of, on the long term, have a very significant outsized share of this particular segment of the market, which, I think -- which is a great benefit. Just the first one, if you look at Slide 20 in the deck, it highlights the mid-2024 target for quarterly cash flow breakeven. In the prior Q1 slide deck, it suggested that $1.3 billion to $1.5 billion revenue run rate and 55% gross margins would get you there to breakeven. So if we just look at that mid-2024 target on Slide 20, it seems to imply that $1.3 billion to $1.5 billion in revenues could be a reasonable target for 2024. Just looking at consensus, it's just north of $1.2 billion. It's the headlines of continued commercial traction, the continued progress across all points of the business gives us more comfort to give -- provide a little bit more precision around a quarter. Although we don't control the guidelines, I still think that there's some good discussion happening with KOLs that we're feeling positive about, both from the data that we've generated and also from the data from the DYNAMIC trial that was presented previously. So I think that there is a good opportunity for guidelines to potentially change in the summer or later in the year, like the December time frame. First, we do not think that publication of the GALAXY data in August is gating for a change in the guidelines, though we've done everything we can to accelerate that. And again, the reason we don't think it's gating is just because there has been so much other data now published and presented in the field that has really impacted how leading GI oncologists think about utility here. And as Steve mentioned, the DYNAMIC trial from Australia was a welcome addition to the overall body of evidence supporting ctDNA. So long term, when you look at the number of patients that are living with cancer versus the number of patients that are diagnosed every year, obviously, there's way more patients that are living with cancer. And so over the long term, we think that there's going to be a very significant shift to the recurrence monitoring indication. What we're seeing now though is just the demand and the uptake for the test is still high that we're seeing like a very large number of new patients coming in, and these are patients that are using the test for the first time. And as we -- our commercial and clinical team meet with more doctors, there's a lot of these patients coming in for the first time at their first time point. Now we are seeing, over time, over the past two years, a shift in the volume towards the recurrence monitoring and longitudinal tracking segment, which is what one would expect. But obviously, it's not going to fit with this sort of population dynamic just because we do have this significant number of new patients coming in. I think in summary, we think that the current ASP is quite immature for Signatera, and it's really a function of volumes expanding in these reimbursed populations, having more of these populations covered by Medicare, where we feel like we can really make a huge difference to the care in these patients. The clinical utility that we've demonstrated, I think, in some of the data that we published, particularly the prospective data in colorectal cancer, we think is really compelling. And obviously, that would then direct guidelines, which, of course, guidelines would then drive a broader commercial coverage. All those things are areas that we expect to have happen over the next few years in Signatera, which would drive ASPs significantly higher and make this business something that works for everyone. Thanks for the question. So as we said before, on early cancer detection, which is a priority for us, what we're doing is we're leveraging the data that we have on early-stage tumor exomes, and we've used that to generate a proprietary targeted panel of DNA mutations. We're combining that with methylation signatures, both available from public databases but also that we've developed ourselves and that we've licensed from our partnership with Aarhus University. The initial performance looks good, and that's prompted us, obviously, to continue with the work. But we plan on having a kind of more significant readout, I would say, later in '22 at some point in kind of the first half of '23 roughly. In fact, we've already done our pre-submission to discuss the clinical trial that we are participating in. And then post that, we'll be understanding their feedback, adapting our trial strategy if need be and then generating more significant proof-of-concept data, as I mentioned in the next kind of year or so. So from a competitor standpoint, I think we think that we're doing exceptionally well. I think in physicians' minds, we're seeing that the tumor-informed approach is the winner. We think we have the vast majority of the market share at this point, and we're in a very good position. And when you look at our local coverage decision from Medicare based on the data that we've generated and the peer-reviewed evidence that we've had, we've received coverage for both the MRD time point adjuvant decision-making in addition to longitudinal monitoring or recurrence monitoring. Similar, when you look at muscle invasive bladder, we've now received coverage for neoadjuvant for MRD adjuvant and for longitudinal recurrence monitoring. Again, I think just showing that we have super high-quality data and the breadth of our data is outside of just one narrow indication. Thanks for the question. So I think from a volume standpoint and a growth standpoint, we're doing well. Physicians are giving very positive feedback post the publication of the Trifecta study, which was the largest multisite prospective fully biopsy-matched study that's ever been performed. We're working with the vast -- well, I'd say, with the majority of transplant centers at this point. I think previously, we've said roughly in the range of 50% or something in that range but that continues to increase. From a penetration standpoint, we think the overall market is probably about 10% penetrated, and that means the vast majority of patients today still aren't being monitored with donor-derived cell-free DNA. But as things -- more data is generated and as physicians start to use donor-derived testing more frequently in their practice, obviously, there's a large opportunity to help patients."
}