{
    "symbol": "NTRA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 03:06:06",
    "content": " I think that’s important to note because the gross margins are temporarily weighed down by all the Signatera volumes we are running, which implies continued strong gross margin leverage from the products in the transplant and women’s health call points. Your line is now open. Your line is now open. Your line is now open. Your line is now open. But I think there are many others where you run that study and it’s not necessarily a study, I mean, the SMART trial in the non-invasive prenatal testing space is a good historical example for us where that was a pretty expensive trial that we had to run for five years, but we don’t have to run another trial like that. Your line is now open. In addition to, as you mentioned growth that we are seeing in other indications where physicians who have already experienced the test, let say, in early-stage CRC if you are a community physician and then a breast cancer patient comes along, where you are facing a similar challenging decision, where you are thinking through different treatment options and trying to evaluate a patient’s risk in that positioned, it’s really easy now for the physician to think about Signatera and order that test. Your line is now open. So on the FDA, I would say, we strongly support the information shared recently by the FDA with regards to NIPT and we have always believed that education and transparency in peer-reviewed evidence are very important and that’s why we published 26 peer-reviewed papers on NIPT including SMART study, which is the largest study ever performed and we employ over 100 genetic counselors and offer complementary genetic counseling sessions pre- and post-test to all patients. But it hasn’t impacted us in a negative way and we continue to grow, NIPT is still under-penetrated, we think only about 40% roughly at pregnancies today are getting NIPT testing, where else vast majority of patients still get biochemical screening, which has a positive predictive value that is significantly less than that of NIPT."
}