{
    "symbol": "AACG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-01 00:27:09",
    "content": " These forward-looking statements can be identified by terms such as anticipate, believe, could, estimate, expect, forecast, future, intend, look forward to, outlook, plans, should, will, and similar terms and include, among other things, statements regarding ACGâ\u0080\u0099s future growth and results of operations, ACGâ\u0080\u0099s plans for mergers and acquisitions generally, ACGâ\u0080\u0099s growth strategy, anticipated growth prospects and subsequent business activities, market demand for and market acceptance and competitiveness of ACGâ\u0080\u0099s portfolio training program and other education services, the impact of the COVID-19 pandemic on ACG and its operations, and ACGâ\u0080\u0099s plan and anticipated benefits of the measures implemented in response to the COV19 pandemic. Certainly, our students remain our top priority in 2022, and we were found of the continued resilience of both our students and teaching staff throughout the year, given unpredictable ongoing pandemic environment, despite our core portfolio training business being impacted by periodic lockdown in some of our key cities in response to local COVID-19 resurgence. Net income attributable to ACG of RMB2 million, total revenue saw a modest 2.3% increase for full year 2022, which was primarily due to increased contributions from other educational services and portfolio training services, excluding the onetime RMB33.5 million in investment gain from the disposal of our K-12 business recognized in fiscal year 2021, with significantly narrowed losses year-over-year. We have continued to confidently shift students towards a more flexible project-based program, designed to be tailored to building needs and potentially with a higher unit price, portfolio training program revenue increased to RMB57.8 million in the fourth quarter of 2022 compared to RMB54.2 million in the prior year period. Our portfolio training programs continue to see stable demand and students delivered modest revenue growth despite the impact COVID-19 continues to have on our business in 2022 because our ability to deliver stable top line results with controlling assets, we have continued to narrow losses excluding onetime items."
}