{
    "symbol": "FHS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-18 10:23:04",
    "content": " For 2022 first quarter, the company achieved revenues of RMB89.3 million, a 14.2% increase compared to last year of the same period. Item number two, I think our revenue increased notably 14% compared to last year of the same quarter, which is always a healthy indicator of a growing business, but it was actually our improvement in operating efficiencies, especially cost saving measures that contributed mostly to the significant increase by 264% in net income. So, total revenues was RMB89.3 million, an increase of 14.2% from RMB78.2 million in the first quarter of 2021. Revenue from government cooperative agreements was RMB12.5 million, an increase of 20.1% from RMB10.4 million in the first quarter last year, primarily due to increased number of publicly-sponsored students we served. Net operating expense, were RMB 9.7 million, an increase of 21.5% from RMB 8 million in the first quarter of 2021. To break them down, selling and marketing expense was about RMB 1 million – RMB0.1 million, sorry – a decrease of 60% from RMB0.3 million in the first quarter of 2021, mainly because most of the marketing has not happened yet for the first quarter, usually happens between the second quarter to the third quarter. Income from operation was RMB22.4 million, an increase of 103.4% from RMB11 million in the first quarter of 2021. Net income from continuing operation was RMB21.1 million, an increase of125% from RMB9.4 million in the first quarter of 2021. And our net income is RMB19.6 million, an increase of 264% from the RMB5.4 million in the first quarter, as most investor friends know that last year, half year, we only did about RMB11 million adjusted net income. And again, adjusted net income is the same thing as net income was RMB19.6 million, an increase of 264% from the RMB5.4 million in the first quarter of 2021. For business outlook, for the fiscal year 2022 is the same as we did for our annual report, the company expects total revenue of operating operation, a continuing operation to be between RMB480 million to RMB520 million, representing an increase of 15% to 24% on a year-over-year basis."
}