{
    "symbol": "AEHR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-07 00:43:06",
    "content": " Weâ\u0080\u0099re currently engaged or in discussions with almost all the existing and future silicon carbide suppliers now, regarding our unique low cost multi-wafer level test and burn-in solution that enables contact to and test of 100% of devices on every wave. Following the end of the quarter, we announced an initial purchase order from one of these suppliers for our FOX-NP multi-wafer test and burn-in system, multiple WaferPak contactors and a FOX WaferPak Aligner to be used for qualification of our wafer level burn-in solution for silicon carbide devices for electric vehicles and other markets. They have provided us with forecasts for our FOX-XP systems for volume production of their silicon carbide devices at multiple facilities around the world and we expect that they will purchase FOX-XP production systems to be shipped before the end of our fiscal year ending May 31, 2023. Weâ\u0080\u0099re expecting customers to resume buying in the current fiscal year 2023 and fiscal 2024, and several customers addressing the silicon photonics market at forecast additional FOX systems and WaferPak or DiePak contactor capacity needs during that time. As many of you know ON Semi, one of the top silicon carbide suppliers in the world announced in August it will increase its silicon carbide production capacity by 5 times and almost quadruple the number of its employees by the end of this year at its new silicon carbide facility in New Hampshire. This includes our belief that weâ\u0080\u0099ll receive production system orders from several silicon carbide customers beyond our initial lead customer and begin shipping systems to meet their production capacity by the end of our current fiscal year that ends May 31, 2023. Included in our bookings were announced orders of $16.8 million from our lead silicon carbide customer for additional systems, WaferPaks and a high volume production WaferPak Aligner. Keep in mind, and this is always, Iâ\u0080\u0099ve done this math before, itâ\u0080\u0099s always interesting, if you just go through the simple math of these forecasts and say there was 125,000 wafer starts to do silicon carbide last year and thereâ\u0080\u0099s 4 million, I think, if you remember, like, 25 times. Then all sudden, they start ramping, then all of a sudden, from what it feels like and Iâ\u0080\u0099ve heard this directly, they -- companies that theyâ\u0080\u0099re selling to are kind of coming back, because they really have done a good job of marketing themselves has being quality differentiated, selling the modules, selling the quality of the modules, and quite frankly, they did presentations, I talked about their wafer-level burn-in earlier and I think itâ\u0080\u0099s come through."
}