{
    "symbol": "AEHR",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-30 22:17:02",
    "content": " Forecast from William Blair estimate that the silicon carbide market for devices in electric vehicles alone, such as traction inverters and onboard chargers is expected to grow from 119,000 6-inch equivalent silicon carbide wafers for EVs in 2021 to more than 4.1 million 6-inch equivalent wafers in 2030, representing a compound annual growth rate of 48.4%. During the quarter, our second major silicon carbide semiconductor customer moved from an initial FOX-NP dual wafer test and burn-in system of ours, used for engineering and device qualification to purchasing their first FOX-XP systems to be used for production test and burn-in other silicon carbide wafers. We believe this customer who serves several significant markets, including the electric vehicle industry, as well as other industrial applications will purchase a large number of our FOX-XP systems to meet the publicly announced significant increase in plant capacity and revenue growth over the next several years and to end of the decade. These systems include our new very high voltage channel module option, enabling high-temperature reverse bias or HTRB as itâ\u0080\u0099s known in the industry, testing of silicon carbide devices using our proprietary WaferPak Contactors, which include patented anti- arching capability that is necessary to avoid high voltage electrical arching between devices or between devices and the streets on the wafer. As I have noted before, adding automation to our FOX production systems through our new Aligner gives our wafer level test and burn-in offering even greater value and opens up several large incremental markets to Aehr, such as high volume processes and chipsets with integrated photonics transceivers, high volume memory devices and also high volume high mix devices require an extremely high reliability and 100% burn-in such as automotive microcontrollers and sensors. During the quarter, we received a $25 million order for a significant number of additional FOX-XP wafer level test and burn-in systems scheduled to ship over the next six months to seven months to meet their increased capacity needs for producing silicon carbide devices for electric vehicles, chargers and electrification infrastructure. As with our other large silicon carbide customers, we expect the silicon carbide supplier to require significant capacity of wafer level test and burn-in systems to meet the fast-growing demand for silicon carbide devices and electric vehicles over the next decade. Since last quarterâ\u0080\u0099s conference call, three additional companies currently making silicon carbide devices decided to move forward with full wafer level evaluations and/or directly to purchase our systems. Semiconductor suppliers in critical applications such as silicon carbide MOSFETs that are used in the drive unit inverter of electric vehicles, must not only prove to the auto suppliers or OEMs as they are called, that their devices will last for the life of the mission profile, but they must also show how they will ensure production test screening to remove devices that will or are likely to fail. At capital depreciation rates of less than US$5 per hour per wafer on a full wafer of silicon carbide MOSFETs to be used in electric vehicle, inverters or chargers, our customers can cost effectively apply a burn-in stress condition to weed out early life failures and to stabilize the threshold voltage of these devices for use in power modules for up to 24 hours or more without driving up their cost of the devices. While we believe this transition is still several years out, we also believe it represents an enormous opportunity for Aehr Test with our unique position of having a proven and cost effective multi-wafer solution testing and burn-in and stabilizing silicon photonics devices at a massive scale while still in the wafer form. Aehr currently has systems installed at over half a dozen customers for 100% test and burn-in of silicon photonics devices used in 5G infrastructure, data and telecommunication transceivers and a few additional applications yet to be introduced. To conclude, we are very encouraged by the continued positive momentum in expanding growth opportunities we see with our current and prospective customers, and continue to be very confident in the guidance we have shared for revenue at least $60 million to $70 million for our current fiscal year that ends May 31st, which represents growth of at least 18% to 30% year-over-year and revenue growth of between 35% and 75% in the second half of this fiscal year compared to the first half of the year. And what we are seeing is silicon carbide, silicon photonics, these compound semiconductors are kind of a hotspot both in terms of applicability for new applications, driving things like electric vehicles or fiber optic communications, but also need this infant mortality rate and seem very susceptible to the desire for wafer level burn-in, because the devices are going to be put in multi-chip modules with other devices."
}