{
    "symbol": "AEHR",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-05 23:23:04",
    "content": " Our momentum in silicon carbide wafer level test and burn-in continues to grow and we see this momentum continuing for the next several years as companies are adding significant capacity in silicon carbide semiconductors to address the incredible forecasted demand, particularly for the electric vehicle and electric vehicle charger markets. The first is a major silicon carbide semiconductor supplier that purchased our FOX-NP dual wafer test and burn-in system used for engineering and device qualification during the quarter, and after the quarter closed, has since placed their first orders for two of our FOX-XP multi-wafer systems for volume production test and burn-in of their silicon carbide wafers, including the order we just announced today. This company is one of the world's largest suppliers of silicon carbide devices and serve several significant markets, including the electric vehicle industry, as well as other industrial applications. Adding automation through our new Aligner gives our wafer-level test and burn-in offering even greater value, as well as opens up several large incremental markets to Aehr such as high volume processors and chipsets with integrated photonics transceivers, flash and ultimately DRAM memories and also higher mix devices requiring extremely high reliability and 100% burn-in such as automotive microcontrollers and sensors. In a fairly short period of time, they selected our FOX-NP dual wafer test and burn-in system for qualification of their silicon carbide devices for multiple markets, including electric vehicles. Regarding that lead customer, they continue to ramp their capacity and use of our FOX-XP multi-wafer test and burn-in systems and WaferPaks which is being driven by increased demand for silicon carbide, particularly for, but not limited to electric vehicles. In addition to the customers that have now placed initial orders with Aehr for silicon carbide wafer level test and burn-in systems, our ongoing benchmarks and evaluations with multiple prospects made great progress during the quarter. We set out to be seen as the industry standard for wafer level test and burn-in, a critical piece of the production process for several semiconductors and their target applications, including silicon carbide and silicon photonics. Halfway through this fiscal year, we've already shipped over $5 million in systems upgrades in WaferPaks to silicon photonics customers and that's over 300% of last year's fiscal year's first half revenue for silicon photonics. We have systems installed at over half a dozen customers testing silicon photonics devices used in 5G infrastructure, data and telecommunications transceivers and a few yet to be introduced applications that we're very excited about. In conclusion, we continue to believe that we will receive production orders from additional silicon carbide companies beyond our current customers and begin shipping systems to meet their production capacity by the end of our current fiscal year that ends May 31, 2023. These include the bipolar voltage channel module and very high voltage channel module options, which enable new advanced test and burn-in capabilities for silicon carbide and gallium nitride power semiconductors on Aehr's FOX-P wafer level test and burn-in systems. Yes, I mean, we don't intend to try to be too vague, but getting yourself too accurate can also get you in trouble, but there's a couple of few customers that have not bought production systems from us yet, that we believe could be taking -- giving us orders and requesting deliveries even as soon as before the end of the year and we have capacity to be able to do that. So when you look at and you talk about capacity needs simply for silicon carbide from a wafer start perspective, there's a third that presumably if this industry gets on a similar to a -- I hesitate to say it more as well, but a shrink scale, you would have a 30% recurring revenue stream associated with that, not to mention sort of the movement over of additional machines for different diameters."
}