{
    "symbol": "DD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:46:11",
    "content": " Our third quarter results also demonstrated year-over-year operating EBITDA growth and margin improvement, reflecting DuPont's unique business mix, innovative solutions and highly diverse end markets as well as strong operational execution during the period. On a segment basis, third quarter organic growth was 15% for W&T, 7% for E&I, and I'll highlight 25% organic growth for the retained businesses that we report in Corporate  representing the adhesive portfolio from the former M&M segment. Our tax rate for the quarter was 26.2%, up notably from 23.5% in the prior year, resulting in a year-over-year headwind to adjusted EPS of $0.03 and a $0.05 headwind in the quarter compared to the midpoint of our previous modeling guidance. Industrial Solutions posted another strong quarter with organic sales growth of high single digits led by ongoing strength from Kalrez semiconductor-related product offerings, Vespel products serving recovering aerospace markets, OLED materials for new electronic displays related model launches and for health care applications such as biopharma tubing. Coming into the quarter, we expected a return to positive organic growth within Interconnect, but continued softness in consumer electronics specifically smartphones and lower PC and tablet demand globally, more than offset strong demand for Kapton film product applications in industrial end markets such as rail and defense and strength in Laird product offerings, including electromagnetic shielding and thermal management. Operating EBITDA for W&P of $382 million increased 8% versus last year as pricing actions and volume gains more than offset higher product costs driven by inflationary pressure, weaker product mix and currency headwinds. The higher-than-anticipated base tax rate for the full year that I discussed earlier, which equates to a $0.09 headwind versus our previous guide, is expected to be offset by a lower share count and net interest benefits resulting from a higher cash balance and the capital deployment actions we are taking in the fourth quarter. So if you look to the end of the year with all the puts and takes, about -- we announced today on the capital allocation between the share repurchase authorization getting started with $3.25 billion and the fixed portion of the November 2023 is being paid down at $2.5 billion, that would put our year-end cash at roughly $4.8 billion, so a nice position to be in. So if you back into the fourth quarter from the full year guide that we gave, we'd be more in the low 24% range from an EBITDA margin perspective versus last year it's 23.2%. So between the share repurchase that we announced today at the $3.25 billion, the lower interest income that we called out of -- lower interest expense that we called out of $100 million and further interest income from the cash that we'll be holding in the balance sheet, we've got north of 15% EPS growth just from those actions alone. The North America residential side, which is about 40% of the business, we'll pay close attention to, obviously, with the news out there on the potential headwinds in that space, but we're not seeing anything material at this point, so... You mentioned before about having prices not be surcharges, but just kind of be in the production cost or in the cost of the product."
}