{
    "symbol": "DD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 11:59:06",
    "content": " Regarding Rogers' first quarter 2022 performance, we were satisfied with top line progress for the business, with growth in the high single digits, and we're especially pleased to see new wins and ongoing growth in the electric vehicle space. As we separate the M&M business, we continue to encourage transaction-related expenses, with over $100 million of transaction costs incurred during the second quarter and about $700 million in costs related to the M&M separations expected in full year 2022. Operating EBITDA for E&I of $480 million increased 13% as strong earnings from Laird, volume gains and pricing actions were partially offset by higher raw material and logistics costs. From a line of business view, organic sales growth was led by Shelter Solutions, which increased high teens, driven by pricing actions and continued robust demand in North America residential construction as well as ongoing growth in commercial construction and strength in repair- and remodel-related demand during the quarter. Within Safety Solutions, sales were up mid-single digits on an organic basis as pricing actions were partially offset by lower Tyvek volumes, given the shift from garments to other end market applications and the resulting negative impact of increased manufacturing line changeovers on overall production. We are updating our full year '22 net sales guidance range to be between $13 billion and $13.4 billion reflecting a $200 million of incremental foreign currency headwinds, along with the removal of about $120 million in net sales related to the Biomaterials business, given its divestiture at the end of May. That $1 billion, $2 billion type range, and it would be something that would bring additional technology to play in one of those pillars that was, back to the electronics example, just give us more tools in the toolkit to resolve issues for our customers because we're so strong in application engineering, and we're really seeing the benefit of that with Laird tied together with the DuPont electronics portfolio. I would say it's in line with normal seasonality, so the -- with the one exception of we will start to return to posting growth within the Interconnect Solutions business on a year-over-year basis, just given that last year was a little odd with respect to the smartphone shipments of what they normally do this year."
}