{
    "symbol": "SPLK",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-02 22:50:03",
    "content": " I expect the CRPO numbers to stay in that range because, you have a cloud CRPO that's growing much faster, you have a non-cloud that's going much slower and so the combination I think, will stay somewhere in the range that you've seen for the past couple of quarters. I'm excited about the experience that Teresa brings as well as other key additions that we've had to ensure that we not just have the right metrics and focus areas for our sales teams, but that we have the right processes, scale, support, and complimentary teams to make sure that our sales teams are successful and that they engage most effectively with net new customers and the many, many customers are on-prem that still need to convert to our cloud offering. Customers can pick and choose, but ultimately as you are driving high volume of net new application capabilities on a cloud-first basis, developing an AWS for other clouds, you really need the entire Observability Cloud to get that job done effectively which is why we've been so focused on making sure that we've got the breadth and depth of features that drive that effective performance. Doug, I want to start with you in terms of trying to understand better your deployment capabilities and what I mean by that is, you obviously going to a business transition where you're offering both on-cloud and on-premise and migrating customers to use your cloud capabilities, but I wanted to reverse that lens and ask you where you're actually are deployed. So that goes kind of back to that sweet spot of data volumes continue to grow and our DBNRR, but, again, there's very clear and consistent within our cloud framework shows that the additional products that we're releasing, things like the observability cloud, in addition to the growth around data and complexity within our customers is a good positive trend. I would just – I guess the short answer to your question is in Q4 as well as Q1, there's been new products that we've released specifically in Splunk observability cloud that have led to some movement in gross margin, unfortunately down, but we don't see that is long-term. But I think we can get better at is being super crystal clear on what a blocker is for a on-prem customer to get to cloud and making sure that we have not just right sales motions, but we've got the right technical support, the right pro-serve, the right partners and any appropriate incentives to assure them that their journey to cloud is going to be as smooth as we've seen it be for thousands of customers now. I mean, have you seen some of those same benefits, I guess we're seeing in companies that frankly are already, sort of fully cloud in the cloud revenue model\n I'm hopeful but I think it's early since really hardly anyone's returned to work and therefore and therefore hasn’t really returned to travel."
}