{
    "symbol": "SPLK",
    "quarter": 2,
    "year": 2022,
    "date": "2021-08-25 21:58:17",
    "content": "  On today's call, we will be making forward-looking statements, including financial guidance and expectations, such as our forecast for our third quarter and our fiscal year 2022 as well as future expectations of revenue mix, renewals, duration, RPO growth, cloud growth, bookings, gross margin and operating cash flow, as well as trends in our markets and our business and our expectations regarding our acquisitions, products, technology, strategy, customers, demand and markets. During our last earnings call, I shared news of our launch of Splunk Observability Cloud, which brings together the world's best-in-class solutions for infrastructure monitoring, application performance monitoring, real user monitoring, synthetic monitoring, log investigation and incident response, giving IT and DevOps teams full stack visibility and context across any hybrid or multi-cloud environment. Cloud gross margin was 61% in Q2, up slightly from last year, with continued progress towards our expected exit rate approaching 70% this year and improving to 70% to 75% next year as we realize leverage from scale and elasticity of the platform. You may proceed with your question. You may proceed with your question. There's kind of a lag of -- as we move to cloud, it takes we knew it's going to take roughly a year from last year's cloud bookings to kind of show up in this year's kind of GAAP numbers in terms of RPO and CRPO and all the various kind of derivative metrics. You may proceed with your question. And as we just talked through on guidance, and we're now focused on $3 billion plus ARR by the end of this year, north of $1.3 billion in ARR for our Cloud business at continued really enviable growth rate. You may proceed with your question. Thanks so much, Doug. Thanks so much, Doug. You may proceed with your question. You may proceed with your question. There's the Splunk kind of cloud gross margin on the core Splunk cloud offering, which has been steadily increasing, but it's been offset by some lower gross margin in the Observability Suite where we worked over the past couple of quarters to integrate some of the acquisitions and really kind of pull things together. You may proceed with your question. You may proceed with your question."
}