{
    "symbol": "SCVL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 11:43:04",
    "content": " Looking at customer trends, non-athletic sales continue to be high, up 35.1% versus 2019, and encouragingly, athletic sales stabilized in Q3, up 4.4% versus 2019 driven by improvements in inventory positions and reduced supply chain challenges as the quarter progressed. Weâ\u0080\u0099re encouraged to share that earlier this month, we surpassed the billion dollar sales mark and at Q3 sales of $342 million was the second highest sales result of any quarter in the corporationâ\u0080\u0099s 44 years. In conclusion, Q3 marked the seventh consecutive quarter of double digit operating profits, customers counts climbed to the highest level ever, surpassing 31.5 million loyalty members, earnings per share year to date has more than doubled all but one of the prior 44 full year results, and we are on track to deliver against our EPS and strategic targets for the remainder of fiscal 2022. These sales increased $67.0 million or 24.4% compared to the pre-pandemic third quarter 2019, driven by sales from the Shoe Station banner and a comparable store sales increase of 18.3% from the Shoe Carnival banner. Summarizing our expectations for 2022 fiscal year, we expect sales to range from $1.27 billion to $1.30 billion, gross profit margins to be approximately 37.0%, operating income margin to range from 11.5% to 11.7%, and diluted earnings per share to range from $3.95 to $4.10. Itâ\u0080\u0099s too early to really share anything insightful as it just happened towards the end of Q3, but weâ\u0080\u0099re getting that data in hand of over a million Shoe Station customers now and weâ\u0080\u0099ve learned what we hope to have learned when we acquired them - first, theyâ\u0080\u0099re a highly affluent customer, second theyâ\u0080\u0099re a suburban customer, and third theyâ\u0080\u0099re coming from geographies across the markets where Shoe Carnival largely does not compete and was a space we wanted to enter. This year, weâ\u0080\u0099ve run none and have been pleased posting the seventh consecutive quarter of double-digit operating profits, and as weâ\u0080\u0099ve shared, Q3, our most important quarter of the year, was our second strongest sales in history, so weâ\u0080\u0099re confident the strategy is working."
}