{
    "symbol": "MVST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 23:12:09",
    "content": " We ended the fourth quarter with record backlog of $410.5 million driven by a robust order intake of $364.7 million led by the large win we announced in December for our energy storage division, or ESS and a strong demand across multiple commercial vehicle platforms in Europe. On a full year basis, despite facing continued challenges from COVID lockdowns in China and dealing with high infection rates in our Huzhou facility as Chinaâ\u0080\u0099s zero-code policy was abandoned, we achieved revenue of $204.5 million, up 35% from $152 million in the prior 12-month period. We posted gross profit of $2.2 million in Q4 2022 compared to gross profit of $1.2 million in the prior period, a 93% improvement. On a full year basis, our gross profit was $9.1 million compared to a gross loss of $42.7 million for the prior year, a 121% improvement against the prior year. Full year 2022 operating expenses were $170.7 million compared to $157.4 million in the prior year, an 8% increase. After adjusting for non-cash settled share-based compensation expense in our cost of sales, adjusted gross profit was $4.2 million in Q4 2022, compared to adjusted gross profit of $3.1 million in Q4 2021. When making the same adjustments for full year 2022, our adjusted gross profit was $16.8 million compared to adjusted gross loss of $38.5 million in full year 2021. After adjusting for non-cash SBC expense in SG&A, our adjusted operating expense in Q4 2022 was $21.4 million compared to $39.6 million in Q4 2021. When making the same adjustment for full year 2022, our adjusted operating expense was $96.5 million compared to $97.6 million for full year 2021. After making those non-cash SBC expense adjustments and accounting for changes in fair value of our warrant liability and convertible notes, adjusted net loss was $15.9 million in Q4 2022 compared to $33.4 million in Q4 2021. On a full year basis, adjusted net loss was $77.3 million in full year 2022 compared to $135 million in full year 2021. Our cash position gives us a very strong balance sheet to execute our 2023 plan, especially our 4-gigawatt hour of capacity expansion, which will come into production given as an additional $1 billion of revenue potential. Although Asia Pacific and China only currently account for approximately 10% of our backlog, these regions were $185 million business for us in 2022, and we expect the lease regions to have another strong year in 2023. Based on strong visibility from our backlog position, along with positive industry tailwinds pushing electrification forward in our key markets, we expect to achieve very strong year-over-year revenue growth in 2023 of 65% to 75%, our total revenue in the range of $336 million to $358 million."
}