{
    "symbol": "WTBA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 10:55:13",
    "content": "  Thank you for attending today’s West Bancorporation, Inc., Earnings Call. My name is Tunia , and I will be your moderator for today’s call. Today, I’ve got with me Dave Nelson, our CEO; Harlee Olafson, our Chief Risk Officer; Brad Winterbottom, Bank President; and Brad Peters, our Minnesota Group President. And with that, I’ll turn it over to Dave Nelson, our CEO. Our first quarter growth was rather flat, but we do have a strong pipeline. In fact, the first quarter ended 3.31%  was the third consecutive quarter end, in which we did not have a single loan in our entire loan portfolio that was 30 days past due. During the quarter, we added some more bankers and also moved into our recently completed new bank facility in St. And we are also now position to start construction on our Mankato in our West Des Moines bank buildings during May. During the quarter, we also received recognition from several publications naming West Bank is one of the top performing community banks in America during 2021, including the top 25 lists from Piper Sandler, Raymond James and S&P Global. And based upon our first quarter performance, our Board of Directors has declared a $0.25 dividend to shareholders of record as of May 11, and payable on May 25. So, with that, I’d like to turn the call over to Harlee Olafson, our Chief Risk Officer. I will make comments on our loan portfolio, credit quality, watchlist and our Eastern Iowa market. Just from a total perspective, make it’s interesting to note now that our credit portfolio consists about 50% of our loan balances are in our Central Iowa market, 25% in Eastern Iowa and 25% in Minnesota. In fact, as Dave stated earlier, we had no 30-day past due loans in the entire loan portfolio for third quarter in a row. Since we have very little current credit risk within the portfolio, we continue to focus our efforts are doing business with strong customers that have a good cash flow and/or significant liquidity. There’s still a lot of liquidity in the market, and the ability to lend that good spreads as a challenge. Shifting to our Eastern Iowa market, we continue to gain market share there and have a strong pipeline of business. We have a strong group of bankers that have developed solid relationships there, and are currently working on a lot of things that had come up previously that are still in the pipeline. But, I would say, that there are less total projects in the works in Eastern Iowa due to high construction costs and rising rates. And to talk about our other markets, I’ll turn it over to Brad Winterbottom, our Bank President. Overall, our loan portfolio net of PPP loans, which continued to shrink. That is despite roughly $60 million of payoffs that took place in the first quarter, and those payoffs were the result of businesses being sold, assets being sold, or assets being refinanced elsewhere. And it’s good in all markets, including Minnesota, Eastern Iowa and Des Moines area. We did add 2 very seasoned bankers in the first quarter of this year, one in the Des Moines market and one in the Minnesota market. And these are bankers that have had very large relationships elsewhere, very seasoned bankers know what they’re doing, and we’re expecting good things from them along with the rest of our team. With that, I’ll turn it over to Mr. Peters here, and he’ll talk about Minnesota. Just a couple of comments on the financials, and then we’ll open it up for questions. That was primarily the result of reducing one of our qualitative factors in the commercial real estate portfolio related to past due trends and classifications, it was a factor that we had increased during the pandemic. And we’ve got consistent performance in our portfolio those past dues and classifications, and all of our loans continued to perform strongly. First quarter of 2022, when we remove the impact of the PPP loans, our net interest margin was 2.81% comparable to first quarter of 2021 would be 2.94%. Our deposit rates pretty much, Florida out back in 2020, so there wasn’t a lot of movement on the cost side. But loan yields continue to decline, as rate competition is pretty intense through 2021 and into 2022, so that the loan yield competition continues in this environment where we’ve got a lot of liquidity in the market. Maybe just to start off here on the loan growth side of things, so despite the payoffs, I still thought it was a pretty solid quarter for growth, and you folks mentioned strong pipelines kind of multiple times throughout your prepared remarks. Just kind of curious now that rates are starting to rise and, perhaps, do so quite rapidly coming up. Well, on the loan side, I would say about 35% of the portfolio is either variable rate or has maturities over the next 12 months. So what we’re looking at on the loan side, now, we do still expect some pressure on the loans, even though the markets going up, we’re seeing still a lot of competition at low rates in our environment. So it’s kind of yet to be determined, how that will play out once the Fed increases rates. On the deposit side, we’ve got a portion of our deposit base that is more sensitive to the Fed funds rate. And so we expect our betas to maybe be a little bit higher than the rest of – other financial institutions, but that’s something that we are actively managing. Right now, we’re having a lot of discussions and a lot of conversations, and trying to manage that sensitivity with the upcoming expected rate increases. Let’s see on capital, I mean, your kind of tangible book value and get capital ratios were impacted like every other bank this quarter due to the AOCI impairment. I guess, kind of, in my point of view, it’s mostly accounting noise and regulatory ratios remain strong overall. Not significantly like you said, it’s not – wasn’t unexpected. I mean, I think we knew going into increasing rate environment that that we would have declines in the value of the investment portfolio. And so it’s – like you said, it’s kind of accounting noise. And then, you folks continue to add bankers in your markets, which certainly showed up in loan growth over the past couple of years. I mean, as you folks know, it’s just remarkably strong today. Frankly, right now, we’re very diversified. Again, we’re not into, we don’t have niche lending categories. So I feel very good that our credit portfolio will continue to be very good, even with some increasing rates and possible downturn in the economy. Last question for me, and then I’ll step back. The tax rate looks a little bit lower this quarter then we’re having running, I guess, roughly 19% on a GAAP basis versus the 21% or so, that it had been for the past couple quarters. It will bounce back that benefit this quarter related to the vesting of RSUs in the tax benefits, from the tax benefit versus book benefit that had been recorded."
}