{
    "symbol": "WTBA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 17:04:09",
    "content": " We're seeing our homebuilding business, which we have a nice portfolio of dealing with very reputable long-term homebuilding customers in Central Iowa, they are slowing up given the interest rate environment, and we're seeing some deals getting passed on or in the planning stages, we're working on, and due to the supply chain issues, uncertain construction costs and the rising rate environment, they have -- some of those folks have put that on hold and makes sense to them, it makes sense to us. Our income tax -- effective income tax rate was higher this quarter for the Iowa Bank franchise tax rates, there was a change in those rates that were enacted in June and that resulted in us remeasuring our deferred tax assets as a result of those changes in tax rates and resulted in an additional tax expense of $671,000 in June. So, when we look at the decline in margin part of that is driven by fewer PPP fees recognized in 2022 and then also just recognition of the rate environment that we're in the pressure on the deposit side for pricing, as the market rates increase and the continued -- really continued pressure also on the loans side in our markets, we're still seeing a fairly high level of competition and pricing competition on loans. Brad had mentioned our decline in deposits, primarily driven by existing customers using some of their liquidity to complete business transactions, rather than borrowing for those transactions are using their cash, and then also some or some accounts that were a little bit more sensitive to market rates and moved some money into treasuries that accounted for the vast majority of our shift in deposits in the second quarter. So that's -- that'll be -- that will vary among institutions depending on whether they've got held to maturity securities, what their level of available for sale is, so the comparability to other institutions gets a little bit clouded from stuff like that, but it's -- we continue to watch it, but we don't have any specific actions that we plan at this same time to change our strategy."
}