{
    "symbol": "KMPR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 22:23:03",
    "content": " And I think adding on to maybe the comment Jim was making when you're talking about Duane's -- when we say nearing rate adequacy, part of what we're trying to communicate is, is -- let's say we've taken X amount of rate in, say, a Florida or Texas or something. When we get to a point where we say, it's at rate adequacy, that might mean from that point forward, we feel good about where the new businesses, the renewal book actually has to come up for renewal for the full enforced to reach that, or get it so we're trying to communicate of you have the blend of those rather than the combined earned impact of what's going on in a particular given month if that helps a little bit. I see the slide on investment portfolio with some of the numbers there, can you help me with -- and I see that net -- new investment yields are up 100 bps year-over-year, how does this kind of new money rate today compared to the looks like a 4.2%, kind of, annualized book yield, kind of, what's the gap there? Now, that will play out over an extremely long period of time, so you won't see -- you might see $5 million and I'm just quoting numbers, like coming up over the next year, you're not going to see something like that, even though it's going to jump like $15 million or $20 million, or $30 million. That's a long way of saying you're going to have a -- some increases here just incrementally as you go forward, kind of, slow and steady from a yield perspective, from here till whenever the interest rate environment kind of changes, which hopefully is not in the near future, but that's where we're at. In this kind of environment, where you have what I would describe as broadly a hard market and most carriers are tightening underwriting, increasing rates, moving towards profit improvement actions, a lot of times what you see is retention goes up a touch and shopping may be increasing, but people aren't necessarily moving because they're finding that somebody might have as an example, 100% down payment, or their underwriting criteria might have changed in a different way, or they've restricted their new business quoting so certain agents can't quote those policies. Relatively, constant in terms of kind of what we're looking at -- we've just, obviously continue to make progress on our non-rate actions and then obviously, we have rate kind of flowing through the books where we were able to appropriately get it to kind of bring these things aligned. I think maybe Brian was asking a little bit about rate adequacy and then using that to write new business, I guess I asked a little differently, you mentioned on the -- I guess in the first quarter, you saw 10% rate on 21% of the book, and then the slide shows 7% rate on another 10%, then you commented on the call about getting additional rate for the balance of the quarter. And again, that's a very it's a very nuanced answer, but it's trying to emphasize I think the point Duane made when we were talking about rate, we're committed to achieving our long-term target profitability before we're growing, and we feel like we're at or near that rate adequacy. I think I'll just reiterate my comments that I closed with before we're encouraged by very strong progress and improvement in the underlying combined ratios, anticipate that's going to continue on a going forward basis, and are committed to hitting our target profitability and get into positioned again for that long-term profitable growth."
}