{
    "symbol": "SRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 12:56:10",
    "content": " And what that translates into is I'd say generally like in the retail assets that we're looking at evaluating, cap rates have increased 25 to 50 basis points if you compare it to say, late last year. I mean kind of mentioned like one of the things that we look at really carefully, look is when we do a sale leaseback to me, the competition is, obviously, other people that can provide a sale leaseback, but it's also the high-yield market and the leveraged loan market because we particularly focus on BB and B credits. Yes, look, I think we're not -- we don't focus about capital and do we think that for the right opportunities, we think there's capital available for them. So I wouldn't say that all assets would trade like that, but one of the things that we do when we look at our disposition strategy as you really think through, especially because there's no more pharma, you got to figure out who your targets and trying to get the best execution. When you have a super competitive market like we saw late last year, you just kind of throw stuff out there and send the $100 out and see what kind of comes in and all kinds of different people show up, that's not the kind of environment we're in right now. So I think that -- I guess, what I'd say is this is just my own impression, but like lifetimes going in price is a little higher obviously than It's more of a financial commitment, but the offering and product and services and opportunity that they provide membership is just a much more phenomenal experience. I mean, Ronald, I would say like if you look at just kind of look at our -- I think we have that one schedule in the investor presentation that talks about quarterly capital deployment performance. But we're kind of like said, it's been sort of a 3-week phenomenon in terms of volume, credit and opportunities at a cap rate that we think makes sense from a risk-adjusted return."
}