{
    "symbol": "SHEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 17:06:04",
    "content": " As noted on slide 4, we had another record quarter with Glo Fiber data net additions of approximately 3,300 increasing sequentially almost 39% as our fiber network expanded and our brand awareness grew. We added almost 19,000 new Glo Fiber passings in the quarter and ended the second quarter with approximately 113,000 passings. Our government relations team also made excellent progress in securing new Glo Fiber franchise agreements, adding approximately 72,000 new franchise passings in the second quarter and bringing our total franchise and government grant award passings to 330,000 or 89% of 2026 target fiber passing. Broadband revenue grew 9.2% to $61.4 million, driven by an increase of 8.9% in residential and SMB revenue, due primarily from a 138.9% increase in Glo Fiber data RGUs and a 4.3% increase in incumbent cable data RGUs. Broadband adjusted EBITDA for the second quarter increased 10.2% to $22 million, driven by top line revenue growth. On Slide 8, Tower segment revenue grew $100,000 to $4.7 million in the second quarter, due primarily to a 3.8% increase in tenants. Consolidated adjusted EBITDA for the quarter grew 16.4% to $18.6 million due to a 10.2% increase in Broadband adjusted EBITDA and an 8.6% decline in corporate expenses, driven by our previously announced cost reduction plan. As Chris mentioned, the second quarter was a productive time for our government relations team, adding new franchise agreements for over 72,000 new passings, including Shippensburg, Greencastle and Waynesboro in South Central Pennsylvania; Ashland in Hanover County Virginia; and Sussex County our first Glo Fiber expansion into Delaware. With our previously announced grant funding and our newer grant awards in the second quarter, Shentel has now won over $68 million in state and local grant funds to bring gigabit broadband to over 19,000 unserved homes. We had another record quarter for customer growth and ended the period with almost 23,000 total RGUs and a 15.2% aggregate broadband data penetration rate across all markets. In the second quarter of 2022, approximately 41% of our new subs adopted speed tiers of one gig or higher and our data ARPU remained consistent at $74.42. Broadband data average revenue per user increased approximately 3.3% year-over-year to $80.85 in the second quarter, as customers continue to migrate to higher speed tiers."
}