{
    "symbol": "SHEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 15:33:05",
    "content": " Broadband revenue grew $20.9 million or 9.2% to $249 million, driven by an increase of 9.3% in Residential and SMB revenue due primarily to a 119% increase in Glo Fiber revenue and a 3.5% increase in Incumbent Cable data revenue. Broadband adjusted EBITDA grew 7.5% to $90 million in 2022 due to strong revenue growth, partially offset by higher expenses of $7.9 million to support the Glo Fiber expansion; $4.3 million in salary, wages and incentive compensation; and $1.9 million in higher software-related costs from system upgrades. On Slide 8, Tower segment revenue grew $1.2 million or 6.9% to $18.9 million in 2022 due primarily to a 4.1% increase in the average revenue per tenant. Consolidated revenue grew 9% to $267.4 million in 2022 due to Broadband and Tower revenue increases of 9.2% and 6.9%, respectively. Consolidated adjusted EBITDA grew 15.6% to $76 million due to growth in Broadband and Tower adjusted EBITDA of 7.5% and 7.7%, respectively, and 10% decline in corporate expenses. Since our first full calendar year of Glo Fiber sales activity in 2020, we have posted a double-double with 10% and 16% compounded annual growth rates for revenue and adjusted EBITDA, respectively. We are now estimating approximately $9 million, the high end of our range provided last year, an annual backhaul and Tower lease revenue churn when we enter 2024 as T-Mobile rationalizes the former Sprint network during 2023. Negative free cash flow for 2022 was $115 million, up $18 million, as we accelerated our Glo Fiber construction. For 2023, we are projecting capital spending in the $260 million to $300 million range as we continue to invest aggressively to accelerate construction of our greenfield fiber-to-the-home networks. In our Glo Fiber markets, we plan to invest approximately $180 million, including approximately $110 million to complete construction of 100,000 passings in 2023, approximately $50 million for engineering, permitting and preliminary construction work towards the remaining 198,000 passings in the construction backlog and approximately $20 million to connect new customers. Roughly $15 million will be used to complete approximately 4,000 passings in 2023, and $25 million will be invested in engineering, permitting and preliminary construction work toward the remaining 19,000 passings in our construction backlog."
}