{
    "symbol": "SHEN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 10:24:08",
    "content": "  We had another record quarter for newly constructed Glo Fiber passings of 18,000 and ended the first quarter with almost 94,000 Glo Fiber passings bringing our total passings across all of our broadband networks to over 332,000. Broadband revenue grew 8.3% to $59.7 million, driven by an increase of 9.3% in Residential and SMB revenue, due primarily from a 14.1% increase in broadband data RGUs. First, $2 million of the expense increase supported the expansion of our Glo Fiber services, $1.8 million related to higher medical benefits, salary and vendor rates, $700,000related to the upgrade and conversion of our ERP, CRM and OSS systems, as Chris just noted. We expect broadband adjusted EBITDA margins to improve modestly in the second half of this year and grow over 40% by 2024, as we streamline our beam operations, Glo Fiber churns EBITDA positive and the software development cost strength. On Slide 8, Tower segment revenue grew $100,000 to $4.8 million in the first quarter, due primarily to a 5.6% increase in tenants, partially offset by a 3.6% decline in lease revenue per tenant. Consolidated revenue grew 7.9% to $64.4 million in the first quarter due to growth in broadband and tower revenues of 8.3% and 3.9%, respectively. Consolidated adjusted EBITDA for the quarter grew 2.4% to $17.4 million, due primarily to an 18% decline in corporate expenses, driven by the previously announced reduction in force and lower professional fees. We had another record quarter for customer growth and ended the period with over 18,000 total RGUs and a 14% - 14.7% aggregate broadband data penetration rates across all markets. In the first quarter of 2022, approximately 48% of our new subs adopted speed tiers of 1 gig or higher, and our data ARPU remained consistent at $74.33. Our total RGUs grew 1.7% year-over-year to approximately 188,000 at the end of Q1 2022, and our broadband data RGUs grew approximately 5.6% year-over-year to end the quarter with over $17,000. Broadband data average revenue per user increased approximately 3.5% year-over-year to $80.88 in Q1 2022, as customers migrated to higher speed tiers and our average subscribed download speed is now approximately 100 megabits per second. This was a significant improvement of 47% over the same period in the previous year, driven primarily by a new dark fiber lease to a major wholesale customer and the first phase of a new contract with a large hospitality customer for Internet and data services. Of the $165 million to $175 million investment in Glo and fiber-to-the-home, approximately $12 million is related to connecting new subscribers and approximately $30 million is for expanding broadband to un-served areas as part of government grant projects."
}