{
    "symbol": "CSWI",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-05 11:41:11",
    "content": " Comparing our fiscal second quarter year-over-year performance, we reported 23% revenue growth, 29% EBITDA growth and 37% growth in EPS. In the current quarter, all 3 segments contributed to organic revenue growth of $25 million, driven primarily by the numerous price actions in the current and prior fiscal year periods. During the fiscal second quarter, the Shoemaker, Cover Guard and AC GUARD acquisitions collectively contributed $11 million in revenue, all of which was reported in our Contractor Solutions segment. Our Engineered Building Solutions segment continued to grow, reporting revenue of $26 million, an increase of 8% due to multiyear initiatives to professionalize our commercial team, focus on high-growth geographies and introduce new products. Our consolidated revenue during our fiscal second quarter 2023 was $191 million, a 23% increase as compared to the prior year period, driven by price and contributions from acquisitions. Consolidated gross profit in the second fiscal quarter was $81 million, representing 28% growth, with the incremental profit resulting primarily from sales growth. Consolidated EBITDA margin improved to 23% as compared to 22% in the prior year quarter, driven by sales growth, which outpaced incremental expenses. Our Contractor Solutions segment with $130 million of revenue accounted for 68% of our consolidated revenue and delivered $27 million or 26% total growth as compared to the prior year quarter, comprised of organic revenue growth of $16 million and inorganic growth of $11 million from the Shoemaker, Cover Guard and AC GUARD acquisitions. In the back half of this fiscal year, we expect slightly slower revenue growth over the prior year period and moderate segment EBITDA margin pressure, as the remaining legacy lower-margin backlog projects are completed. Our Specialized Reliability Solutions segment achieved another very impressive quarter of organic revenue growth of $8 million or 30% due to continued benefits from pricing initiatives, strong end market demand, especially in the energy market and improvements in our operations and execution. Segment EBITDA and EBITDA margin were $6 million and 16%, respectively, in the fiscal 2023 second quarter compared to $3 million and 10% in the prior year period. For the remainder of this fiscal year and as compared to the prior year period, we expect continued strong revenue growth, albeit at a lower pace and modestly lower margins due to the timing impacts of material and freight cost increases, previously implemented pricing initiatives and the shift in mix towards the Shell Whitmore joint venture as volumes ramp up. Transitioning to the strength of our balance sheet and cash flows, we ended our fiscal 2023 second quarter with $14 million of cash and reported cash flow from operations of $47 million in the first half of our fiscal year compared to $43 million in the prior year period. As we look to the remainder of fiscal 2023, we continue to expect to have strong revenue growth across all 3 segments and at the consolidated level, which, when coupled with meaningful operating leverage, will result in strong year-over-year EBITDA and EPS growth. In light of the strength of our fiscal first half and including our recent acquisitions, we now expect a year-over-year revenue growth rate of approximately 20% with an EBITDA margin of approximately 22% for the full year. You're now going to start seeing that tailwind here kind of end of this quarter and into our fiscal fourth quarter, which, again, to Joe's point, gave us confidence in that 22% EBITDA margin because we see costs coming down, but it takes a while to flow through from when you see that CNBC headline about freight rates coming down this week."
}