{
    "symbol": "CSWI",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-05 21:58:07",
    "content": " EBITDA reached a quarterly record of $50 million five zero, a 21% growth compared to the prior year period. As you will recall, in last year's fiscal first quarter, we delivered growth in excess of 75% of revenue, and over 100% in EBITDA. Our Specialized Reliability Solutions segment, gained momentum and achieved record revenue of $36 million growth of $10 million or 40% as demand continued in all end-markets served, evidenced by incremental unit volumes and supported by the cumulative benefit of the pricing strategy we deployed last year. Our consolidated revenue during fiscal first quarter 2023 was $200 million, a 24% increase as compared to the prior year period. Consolidated gross profit in the fiscal first quarter was $86 million, representing 25% growth with the incremental profit resulting primarily from the cumulative benefit of implemented pricing initiatives which continued during the fiscal first quarter, the Shoemaker acquisition and increased unit volumes. Reported net income attributable to CSWI in the fiscal first quarter was $29 million or $1.88 per diluted share, compared to $21 million or $1.30 in the prior year period. Our Contractor Solutions segment with $138 million of revenue accounted for 69% of our consolidated revenue and delivered $27 million or 25% total growth, as compared to the prior year quarter comprised of organic growth of $19 million and inorganic growth of $9 million from the Shoemaker acquisition. Our Specialized Reliability Solutions segment posted another very impressive quarter of organic revenue growth of $10 million or 40% due to incremental unit volumes, driven by improving end market dynamics and numerous price initiatives during the last year. Transitioning to the strength of our balance sheet, we ended the fiscal first quarter with $16 million of cash and reported cash flow from operations of $17 million compared to $19 million in the prior year period. On the heels of such a strong fiscal first quarter, we now expect to outperform these metrics in fiscal 2023 and now expect total revenue growth to be in the high-teens and an adjusted EBITDA margin in excess of our historical average of 20.3%. The other thing I would say, Julio, this is Joe is that as you look regionally there are regions that are up double-digits or regions that are down double-digits and that seems to me to be an effect of weather and temperature and not necessarily an overall demand statement and so we're still pleased with the demand we see obviously again unit growth will moderate from what we've had over the last year or two, but revenues continue to grow nicely because of pricing and at the end of the day we have a very resilient line of products that are used in replacement of units in repair and maintenance and cleaning and those types of things which are all opportunities for us to sell to our customers and sell through that's very different from the capital-intensive businesses that require the purchase of a unit. As you well know, you've got a little bit of a year-over-year challenge these first couple of quarters, because you're still working with numerator and denominator that we've been able to raise prices to cover cost increases, as some of those costs have started to subside a little bit you've got a little margin expansion opportunity there, but we're just maybe a few months into some of that slowing down, so we don't want to get too far ahead of ourselves and assume that freight rates are exactly where they are in the rest of the year, and input costs are exactly where they are in the rest of the year but yes, I think you're looking at it the right way."
}