{
    "symbol": "GIB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-27 14:01:05",
    "content": " And from an industry perspective, led by Health with 129% book-to-bill as organizations continue to enable virtual health care delivery while ensuring secured data privacy protection; and government with 117% book-to-bill as agencies continue to prioritize a range of domestic initiatives such as social and health services, infrastructure, space-based data solutions, environment and -- and cybersecurity, all areas of strength for CGI. CGI's strong performance in the third quarter of fiscal 2022, again demonstrated the value of our end-to-end services, the breadth of our enterprise clients across all industries and the consistent operational rigor for which we have a proven track record of delivery through all economic cycles. I would like to share some insights from these interviews into the ongoing IT services client demand, along with examples of representative Q3 bookings that illustrate the value of each of CGI's end-to-end services. Based on ongoing client discussions, we see rising demand for CGI's offerings to help clients optimize their operations, increase their agility and counteract the impact of rising inflation, as well as increased interest in engaging CGI on go-to-market partnerships for client-owned proprietary IP. Next, we continue to make investments in our IP-based services and solutions, adding new solutions to our portfolio and enhancing existing solutions to meet emerging client needs, extending our IP through our relationships with external global alliance partners, integrating with their third-party IP to bring added value for our clients, and expanding our portfolio through M&A of client-based IP as well as firms focused on delivering proprietary intellectual property. So I mentioned this and I understand you had to join a little bit later, but I did mention some of this in my remarks that the managed services for us are typically 5- to 10-year deals, but they're a bit different where they're asking us to not just take on the legacy, but they're asking us to take on the legacy, modernize it, so we actually do the development of the modernization and then continue to manage those modernized operations."
}