{
    "symbol": "UNF",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-29 12:12:04",
    "content": " In our second quarter of 2023, consolidated revenues were $542.7 million, up 11.5% from $486.7 million a year ago, and consolidated operating income decreased to $20.7 million from $22.6 million or 8.4%. Our financial results in the second quarters of fiscal 2023 and 2022 included approximately $9.1 million and $6.7 million, respectively, of costs directly attributable to the three key initiatives that Steve discussed. In addition, we incurred costs related to the acquisition of Clean Uniform during the second quarter of fiscal 2023 of approximately $2 million. This strong organic growth rate was primarily the result of strong pricing efforts over the last year to share with our customers the cost increases that we have incurred in our business due to the ongoing inflationary environment, as well as continued solid sales performance and customer retention. Excluding these items, the segment's operating margin continues to be impacted by increase in merchandize costs resulting from the inflationary effects on our cost of our products, as well as higher levels of merchandize put in service with our customers in 2022 to support solid new account sales, increased activity in our energy-dependent markets, elevated wear additions at our customers, as well as certain national account investments. Revenues from our Specialty Garments segment, which delivers specialized nuclear decontamination and cleanroom products and services, increased to $42.1 million from $35.5 million in prior year or 18.5%. Our current assumptions regarding the impact of the Clean acquisition on our operating results for the year, which will be recorded to the Core Laundry operations include an increase in revenues of $42 million, a decrease in operating income of $0.5 million, which includes $3 million of purchase-related intangible amortization expense and acquisition-related expenses of $4 million, which includes the $2 million expense in our second quarter of 2023."
}