{
    "symbol": "FWRD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 13:12:03",
    "content": " Please be aware that certain statements in the company's earnings press release announcement and on this conference call are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements, which are based on expectations, intentions and projections regarding the company's future performance, anticipated events or trends and other matters that are not historical facts, including statements regarding our expected first quarter 2023 and fiscal year 2023. So at this point, we still believe that with Forward 23 initiatives in place and updated for the economic slowdown and for the fuel going down as well as with the Land Air Express addition to our team as well as potential additional acquisitions, we can still target a EPS 2023 ahead of 2022. So while it looks perhaps a bit thought lazy to say, okay, it's going to be back-end loaded or it's going to be second-half loaded, fact is all of these Growth and Game Shape initiatives are taking steam and are ramping up throughout the year. So when we are saying we are targeting a year that's actually up from last year, this is based on initiatives by our leaders, with their teams that add up on the growth side and on the Game Shape side and has a -- and if the economic headwind is steeper and longer, we do have additional opportunities with, again, Land Air Express already on board. And then we looked at that number getting somewhat better throughout the rest of the year, but we took a very, very steep double-digit year-over-year tonnage decline as the base case and then we build those forward force initiatives, the Land Air Express acquisition and some of those impact of effective kind of running off our system, including cost management or dimming and reweighing on top of that. Every customer is getting a GRI and the sales team and the customers did a tremendous job collaborating over the last several weeks about where we can grow with them, and we have more than 200 agreements in place where in some cases, if there's real growth that's substantiated and we track this on a monthly basis, that customers can kind of save more as they do more with us, meaning there's a mitigation where if someone goes with us in key veins that are good for them and good for us by 10% or 15%, then there's a mitigation of that GRI. By the way, for those of us or you that looked at our investor relations side in our deck, we just talked about it over the last several days, that visual of what our unclaimed terminals look like before the cleanse and what they look like all palletized today, we probably have to take that picture back in because I think it is a big part of our go-forward story of better high-value freight operated in a cleansed environment."
}