{
    "symbol": "LPSN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 22:50:05",
    "content": " We also secured a renewal with one of the largest -- biggest standing GainShare customers the quarter renewal, which converts about 90% of the customers' spending into recurring revenue for LivePerson, was driven by the volume messaging with support for the brand, the strong customer satisfaction they're seen using our platform, and our automation capabilities. In line with a broader -- with this broader vision, our continued focus on the healthcare vertical during the quarter led us to expansion with a major online marketplace for health insurance in the U.S., as well as one of the top three health insurance providers in the U.K. We're helping Bupa global Cut cost by converting some of the 430,000 customer service calls they receive each year related to referrals, medical guidance, and claim information to messaging conversations via their website and mobile apps. As I'll elaborate on shortly, we expect the cost reduction program we initiated in the first quarter, which we're continuing to execute in the second quarter to significantly alter our full year profit trajectory by improving non-GAAP gross profit margin to at least 70% and by moving adjusted EBITDA into positive territory. As a result, we are raising our guidance for adjusted EBITDA to a range of $ 1 million to $10 million, or a margin of zero to 2% and we now expect to generate positive free cash flow in the fourth quarter of 2022. We exceeded the high end of our guidance ranges for revenue and adjusted EBITDA in the first quarter and set in motion plans that we expect to drive meaningful improvements to full year adjusted EBITDA, gross profit margin, and operating expenses, with an anticipated return to positive free cash flow in the fourth quarter. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}