{
    "symbol": "LPSN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-17 16:18:08",
    "content": " On an annualized basis, we expect the B2B core to exit the year with at least a 16% adjusted EBITDA margin and up to a 10% free cash flow margin despite the expected decline of more than $70 million in non-core revenue on a year-over-year basis, most of which was set in motion by the profitable growth strategy that we launched last year. Next, over $20 million of the non-core year-over-year revenue decrease relates to Gainshare labor and pandemic-driven variable revenue, which we discussed as not strategic to the B2B core on the second quarter call last year. To summarize the key points directly, we have materially improved the P&L and we are drawing a line at the first quarter, after which we expect the B2B core's performance to be transparent and its business drivers consistent with growing revenue by increasing the Conversational Cloud's share of enterprise to consumer engagement, especially AI-based engagement across both voice and master. For total company metrics in the first quarter of 2023, we expect total revenue to range from $106 million to $109 million or a decrease of 19% to 16% year-over-year. As for total company metrics for full year guidance, we expect total revenue to range from $422 million to $436 million or a decrease of 18% to 15% year-over-year; and adjusted EBITDA to range from $15 million to $32 million or a margin of 4% to 7%. By winding down nonstrategic and low-margin lines of business, we have also provided immediate clarity on LivePerson's foundation, the B2B core business, driven by a growing base of software recurring revenue that represents approximately 80% of total company revenue in 2023. We also expect AI-led growth in recurring software revenue to further improve profitability throughout the year to an annualized rate of at least 16% in terms of adjusted EBITDA and up to 10% in terms of free cash flow, further strengthening both our balance sheet and the P&L."
}