{
    "symbol": "CC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:00:21",
    "content": " Your line is now open. And I guess to that, like if the TSS segment was a lot stronger than expected, and I suppose it's tied to a handful of things, whether it's the Aim Act or less, F-Gas dumping, or maybe even some mix, but I guess, can you parse out the various buckets as to what drove the huge jump in margins and the strength that you're seeing. Your line is now open. So we see here, this is a, -- we could call it a decade of secular growth, mid-to-high single-digit in a business that we think, long-term has EBITDA margins in the low thirties, clearly this year we're off to a great start, so we might be higher in this year, but generally speaking, we're looking to capture the growth with EBITDA margins North of 30%. Your line is now open. Your line is now open. So -- so the way you should be thinking about the transition of our business is, Visa, TSS, and the APM, it's all about value and use pricing and that's what you're seeing in the margin in the TSS, as well as on the APM businesses. That's primarily just because of the working capital dynamics as we look at how the supply chain is stressed in the marketplace right now, as we think about driving the growth in a business that you want to make sure that we are well-positioned to have the inventories in place be on the raw side on the product side. Your line is now open. So today obviously, and we've said on prior calls, I'll reinforce it here, our EBITDA margin in this business is unlikely to be at its target level of 25% or mid-twenties until we're not ore constrained, but I'd say as I look at the cost dynamics in the world, I'm glad that the majority of our plants are tied to natural gas here in the U.S., even though those prices are also up. Your line is now open. Your line is now open. As we look at, Kevin, from the Russia and the Ukraine perspective, what we've said is our revenue is around 1% in the previous year, so -- and majority of that goes in the TT business, given the supply demand dynamics that you're seeing in the TiO2 in the industry, we don't see any issues placing that volume in other parts of the world. Your line is now open."
}