{
    "symbol": "RKLY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 21:43:03",
    "content": " These forward-looking statements include, but are not limited to, the anticipated features, benefits, scope, focus, status and goals of our platform, technology, products, studies and partnerships with third parties, our ability to bring and the timing of bringing our products to market, our product development schedules, our strategies, our research and development plans, our customers, our commercial and market opportunities and trends, our debt obligations, our cost and expenses, our cash resources, cash burn, revenue guidance, financial projections and financial performance, and outlook and factors affecting the foregoing. We ended the quarter with $46.6 million in cash, cash equivalents and investments. We ended the quarter with $46.6 million in cash, cash equivalents and investments. I think what you're telling us is that the consumer wearable opportunity, which, correct me if I'm wrong, you previously projected $300 million to $320 million of revenue for '23, you've now removed that guidance. So if you look at the utilization of our own cash and capital in terms of our own efforts to meet the numbers for 2023, it's just so much clearer for us in the med tech area than it is in the consumer device area. If Xiaomi or another consumer wearable technology company placed a significant order with you for inclusion in their devices shipping in '23, you're not telling us that you don't have the production capability to satisfy both your med tech customers and your consumer wearable customers, and this is all about a choice you're making to focus on med tech as opposed to consumer wearables. So we're trying to get the message across here that through incredible efforts to build the Bioptx band ourselves and the customer reception associated with the device, we've been able to elevate the average selling price very, very dramatically with a road map that just continues to take it up with further enhancements in performance through going from unregulated to regulated and creating an extremely exciting opportunity for us in that product line -- that product area alone. So we've created a platform that can adapt to whether it's in-hospital patient monitoring, remote patient monitoring, clinical trials monitoring, we've created a platform that can easily adapt into each one of these environments plug-in, very efficiently and where as the data flows through our connect and cloud elements through into our customers' environments, that is a continued ongoing repeatable revenue opportunity for us, which we see as upside in terms of where we've been looking so far."
}