{
    "symbol": "EPR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 11:59:06",
    "content": " In addition, in a new partnership we funded $56.8 million of an approximately $64.5 million commitment for mortgage financing secured by 6 fitness and wellness properties operated by Gravity House, in Breckenridge, Aspen, Vail, Steamboat Springs, Winter Park and We've also entered into a relationship agreement to finance future growth. In total for the quarter, including Regal, we collected $6.2 million of deferred rent from cash basis customers that was recognized as revenue when received. Finally, we collected $4.6 million of deferred rent from accrual basis tenants that reduced receivables leaving on a balance on our books at December 31 of only $2.1 million, we expect to collect approximately $1.6 million of this remaining balance in 2023. The sales participation income included $7 million in cash received in connection with the sale of Creme de La Creme's early childhood education business to KinderCare and $2.1 million in cash received in connection with the sale of a ski property that secured a mortgage loan, which was paid in full in 2019. Additionally, we expect KinderCare to exercise a lease termination right with respect to 5 early education properties during the second quarter of 2023, representing $2.8 million in annual rental income. In 2022, full year, we collected approximately $18 million in deferred rent and interest from cash-basis customers that was recorded as income and approximately $25 million from accrual basis customers that reduced receivables. Accordingly, our 2023 investment spending guidance is $200 million to $300 million, of which approximately $175 million relates to commitments on closed experiential development and redevelopment projects, and we do not anticipate the need to raise additional capital to fund these amounts. I think with what's in production in 2020 -- headed towards 2024 as kind of the first real kind of stabilization number that I think -- and I'll speak and then Greg, that for 2024, we're seeing closer to a return to a $9 billion type of number. If you think about the $87 million of kind of deferred rent that's owned by the tenant, if you do get assets handed back in bankruptcy, should we expect that amount to be reduced kind of on a one-for-one basis roughly to the amount of leases that are rejected, i.e., ex percentage of leases get rejected, it will be that deferral amount would be reduced by a similar percentage?"
}