{
    "symbol": "AVAV",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-28 22:38:05",
    "content": " For the full fiscal year, we achieved record revenue of $446 million compared to $395 million last fiscal year. Gross profit for the fourth quarter was $48.6 million compared to $59.7 million in the prior year period, and our gross margin decreased to 37% from 44% in fiscal year 2021. While the timing of such task orders is still being finalized, we anticipate a significant positive impact to our fiscal year and beyond given the U.S. Army's plan to procure Switchblades for the European theater, particularly within NATO countries in Ukraine's proximity. We are now in negotiations with SoftBank on the second tranche of funding to advance the next steps of Sunglider's commercial development, which we expect to generate between $25 million to $35 million in revenue this fiscal year. As Wahid outlined, revenue for the fourth quarter of fiscal 2022 was $132.6 million, a decrease of 2% from the fourth quarter of fiscal 2021 revenue of $136 million. While this was down from last year's $70.9 million, it was the largest revenue quarter for the year for FUAS and included a $20 million FMS Puma order for Ukraine, as Wahid mentioned. Revenue from the Other segment, which includes our acquired Telerob and Progeny ISG businesses, increased year-over-year to $17 million versus $3 million in fiscal 2021 fourth quarter. Revenue for the fiscal year ended at $445.7 million as compared to $394.9 million for fiscal year 2021, representing an increase of $50.8 million or 13%. SG&A expense for the fourth quarter was $21.9 million, down $2.9 million from last year's fourth quarter. Excluding intangible amortization and acquisition-related expenses, SG&A for the fourth quarter was $17.6 million or 13% of revenue compared to $18.2 million, also 13% of revenue in the prior year period. For the full fiscal year 2022, SG&A, excluding intangible amortization and acquisition-related expense, was $73.5 million or 16% of revenue compared to full fiscal year 2021 of $56.4 million or 14% of revenue. Looking at the bottom line, our GAAP net income for the fourth quarter of fiscal 2022 finished at $7.3 million or $0.29 per diluted share compared to net income of $10.9 million or $0.44 diluted share for the fourth quarter of fiscal 2021. For the full year of fiscal 2022, we generated a GAAP net loss of $4.2 million or negative $0.17 diluted share compared to net income of $23.3 million or $0.96 per diluted share for fiscal 2021. Looking at the full year, the company posted adjusted earnings per diluted share of $1.25 for fiscal 2022 versus $2.10 per diluted share for fiscal 2021. Additionally, given the increasing global awareness and demand for our innovative solutions, the U.S. government's urgency to spend 2022 appropriate funding and our continued management of headwinds, I'm pleased to share with you our guidance for fiscal year 2023, which represents another strong growth year for the company. As summarized on slide number seven of our earnings presentation, we anticipate revenue of between $490 million and $520 million in fiscal year 2023, representing double-digit organic growth, and net income of $11 million to $18 million or $0.42 to $0.72 per diluted share. We anticipate about 60% of revenue in the second half of fiscal year 2023 compared to 40% in the first half, particularly as we benefit from orders placed at the end of the government's fiscal year and rapid turnaround shipments related to Ukraine. Our products and services by and large, enjoys strong bipartisan support in Congress, and we anticipate several orders prior to the end of the government's fiscal year with even higher shipments in calendar year 2023. We are -- it is not the most urgent thing because of the war in Ukraine, we have reprioritized some of our resources because of talent needs that we have to other more urgent programs and projects, but we expect that to be a business that we're going to do, as I said in my remarks, between $25 million, to $35 million of revenue this year, customer-funded R&D from SoftBank directly rather than the JV."
}