{
    "symbol": "AVAV",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-08 22:20:04",
    "content": " Revenue for the first quarter of fiscal 2022 was $101 million, a 16% increase from the prior year's comparable period. The Tactical Missile Systems business or TMS business contributed $19.2 million of revenue during the quarter, up from $9.5 million versus the prior year period. Revenue from the Other segment which includes HAPS, declined slightly year-over-year to $19.5 million versus $21.7 million in the fiscal 2021 first quarter. Our gross profit for the first quarter was $28.7 million, representing a gross margin of 28% of revenue compared to last year's first quarter gross profit of $35.4 million or 40% of revenue. When you back out intangible amortization of $4 million and $600,000 from the current and prior year periods, respectively, overall gross margin was 32% in 2022 versus 41% in 2021. Our aggregate gross margin without intangible amortization was 42% in the first quarter versus 46% last year, reflecting the negative impact of lower mix of small UAS revenue which historically has higher margins. When you exclude intangible amortization deal costs, SG&A expense as a percentage of revenue in fiscal 2022, was 19% for the first quarter versus 14% last year. Looking at the bottom line, our GAAP net loss for the first quarter of fiscal 2022 was $14 million or $0.57 per diluted share compared to net income of $10.1 million or $0.42 per diluted share for the first quarter of fiscal 2021. Our funded backlog at the end of the first quarter of fiscal 2022 was $257.7 million, a sequential increase of $45.9 million from the fourth quarter and an increase of $103.3 million versus the first quarter of fiscal 2021. Your line is now open. Your line is now open. Your line is now open. Your line is now open. The first one of those orders which we just recently secured also during the last few days of the last quarter -- last fiscal year, was about a $51 million contract that will essentially fund us for a good amount of a year to 15 months. Your line is now open. Your line is now open."
}