{
    "symbol": "AVAV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-03 20:53:03",
    "content": " Gross profit for the third quarter was $21.4 million, a decrease of 25% year-over-year gross margin percentage decreased to 24% from 36%, reflecting a heavier mix of service revenue. Net income for the third quarter was break-even or $0 per diluted share, as compared to net profit of $0.2 million or $0.01 per diluted share for the third quarter of fiscal year 2021. Revenue for the third quarter of fiscal 2022 was $90.1 million, up 14% increase from the prior year's comparable period. Our largest segment during the quarter was small UAS with $24.4 million of revenue, down from last year's $50.5 million dollars in revenue. Revenue from the other segment which includes HAPS and our acquired Telerob and Progeny ISG businesses, increased year-over-year to $26 million versus $8.6 million in fiscal 2021 third quarter. Next, turning to operating expenses, SG&A expense for the third quarter was $22.5 million and includes intangible amortization and acquisition-related expenses of $4.6 million compared to just $0.7 million last year. Excluding intangible amortization and acquisition-related expenses, SG&A for the third quarter was $17.9 million or 20% of revenue, compared to $12.2 million or 15% of revenue in the prior year period. Looking at the bottom line, our GAAP net income for the third quarter of fiscal 2022 rounds to $0 and $0.0 per diluted share, compared to Net income of 0.2 million or $0.01 per diluted share for the third quarter of fiscal 2021. With 95% visibility to the mid-point of our previously stated guidance, we are reaffirming our guidance for fiscal year 2022 as follows: full year revenue between $440 million and $460 million, net loss from continuing operations between $12 million and $8 million, adjusted EBITDA between $59 million and $65 million, diluted Loss per share between $0.47 and $0.33, and non-GAAP diluted earnings per share is forecasted to be between $1.23 and $1.37."
}