{
    "symbol": "BVS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 14:56:03",
    "content": " Before we begin, I would to remind everyone that our remarks today may contain forward-looking statements that are based on the current expectations of management and involve inherent risks and uncertainties that could cause actual results to differ materially from those indicated, including the risks and uncertainties described in the company's filings with the SEC commission -- the SEC including Item 1A Risk Factors and the company's Form 10-K for the year ended December 31, 2021, as well as our most recent 10-Q and our upcoming Form 10-K and other company filings made with the SEC. Let me begin with an update on our recent actions to address the financial obligations for CartiHeal, as well as the efforts across multiple work streams to enhance our financial position. At the end of February, we announced an agreement with CartiHealâ\u0080\u0099s shareholders to eliminate the entire $350 million of deferred purchase obligations and sales milestone payments. In December, we announced a company-wide restructuring designed to simplify our organization and streamlined processes, while ensuring our actions avoided materially impacting revenue growth. During the first quarter, we completed the restructuring and we anticipate generating $9 million to $10 million in annual savings going forward. Meanwhile, in building our annual plan for 2023, we prioritized investment in key near-term growth drivers for our business. We anticipate a year-over-year incremental of a few million dollars as we launch products like SonaStar Elite, Bone Scalpel Access and L360 and the submission of TalisMann, our next generation peripheral nerve stimulation device for 510(k) clearance. Lastly, we recently reached an agreement with our lenders to provide covenant relief for our debt compliance for the fourth quarter of 2022 and additional covenant flexibility through the first quarter of 2024. While we are disappointed in our inability to secure suitable financing for CartiHeal, our current business possesses multiple growth drivers and eliminating the obligations related to CartiHeal along with the recent actions we have taken has significantly enhanced our financial position. For the fourth quarter, revenue of $126 million was down 4%, compared to the same a year ago. Unanticipated rebate claims from one private payer, United Optum, along with lower volume growth and decreased selling price across our HA businesses impacted our top line performance and placed pressure on our gross margin and overall profitability. Let me first address United Optum's unexpected rebate claims of approximately $4 million, which represent claims previously not billed to us. United Optum recently notified us that they had found these unbilled claims in their system through their internal audit of their rebate process in the fourth quarter, which revealed that they had underbilled us. Going forward, we would expect to see any similar dynamic to have a substantially lower impact on our results, given the renegotiated rebate rates that began in the third quarter and lower pricing on which the rebates are based. As we continue to be impacted by a significant increase in the percentage of volume of contracted business in Durolane and Gelsyn related to private payer contracts, this is due to the lag in receiving invoices, which can be two to four quarters in arrears, consequently impacting our visibility to changing trends. The magnitude of this increase of $6 million to $7 million was above our expectations, and our team has worked with our private payers to review their claims data and understand the change. As a result, our average selling price, or ASP, for both Durolane and Gelsyn is now lower than previously expected. Due to the mechanics of how ASP is calculated, which is a four quarter look back that includes rebates paid, we expect that these larger rebate payments will continue to reduce our forecasted ASP throughout 2023. The extent of the quarterly reduction should lessen as the year progresses, and the higher rebate claims are removed from the calculation and replaced with significantly lower rebate claims due to our teamâ\u0080\u0099s successful renegotiations with payers last year. Given the competitive dynamics, volumes shifted above our expectations by $1 million to $2 million and more price-sensitive or non-contracted accounts. This results in a higher portion of our Gelsyn revenue being in our contracted business, further increasing pressure on ASP. As we progress into 2023, we expect the decline in our ASP will enable us to regain market share related to non-contracted volume. While we anticipate continued pressure on Gelsyn revenue through 2023, we believe that the mechanics of ASP reporting will lead to Gelsyn pricing stabilizing by the end of the year. Meanwhile, revenue for Durolane, our clinically differentiated single-injection HA therapy was impacted less than Gelsyn. While we experienced double-digit price loss, we continue to see double-digit volume growth. But given our competitive positioning, clinical differentiation and the continued market shift to single injection therapy, we anticipate continued strong volume growth, which should offset pricing pressure and lead to overall 2023 growth for Durolane. Across our HA portfolio, we believe market growth, combined with an increase in share from lower selling price will drive volume growth. However, we expect an overall reduction in HA revenue of high-single to low-double-digits, due to the impact of lower selling price. During the quarter, we fully launched BoneScalpel Access and combined with OsteoAMP Flowable, we now offer a complete portfolio in minimally invasive spinal fusion, the fastest-growing area in spine. Finally, as we move into 2023, we forecast that our double-digit organic growth will continue, because our overall smaller market share and market growth rates provide a strong backdrop for continued market penetration and growth. Within restorative therapies, organic revenue growth contracted mid-single-digits, driven by a decline in Exogen. However, Exogen revenue grew mid-single-digits sequentially and we see momentum building as we continue to re-engage with physicians after our sales force realignment at the start of 2022. Within Advanced Rehabilitation, revenue grew despite the impact from the anticipated supply chain disruptions and regulatory approval challenges we discussed on our prior earnings call. We expect this growth, combined with stability for Exogen will drive overall mid-single-digit growth for our entire Restorative Therapies portfolio. Finally, our International segment grew 13% on a reported basis, driven by our Misonix acquisition and strong organic growth for Durolane and our bone graft substitutes portfolio. As we move into 2023, we anticipate above-market growth for our International segment as we realize the benefits of our broader portfolio. Finally, upon reflecting on the challenges and performance in the second half of 2022, we are shifting our attention and prioritization inwards as we focus on improving our execution, internal processes, and operational efficiencies with the resolve to accelerate our margin profile, rebuild our balance sheet and regain investor confidence. These outcomes will come through: one, delivering on our annual operating plan where we achieve our sales plan, drive EBITDA growth and improve operating margins; two, completing our integration of Misonix and exploring additional financial savings across our business; and three, reducing working capital through decreased inventory and improved accounts receivable to drive cash flow. Despite recent challenges, Bioventus still retains a strong diversified business with market tailwinds. We have multiple growth drivers obtained through our recent acquisitions, such as our ultrasonic surgical solutions portfolio, peripheral nerve stimulation and Advanced Rehabilitation. Each of these should be coming to fruition over the next few years and enable us to accelerate growth by leveraging our leading medical devices, scale and commercial infrastructure. Finally, over the course of the next several quarters, we look to regain your confidence in our ability to execute as our results improve, and we deliver on our commitments. Revenue of $126 million, was a 4% lower, compared to the prior year. We saw a 10 percentage point decline in organic revenue, along with a 6-percentage point increase related to our acquisition of Misonix. Across Pain Treatments, sales declined 23%, compared to the prior year as we faced unanticipated rebate claims and pricing pressure related to our HA franchise and a decline in volume for Gelsyn, as Ken described earlier. We saw 14 percentage points of organic growth, representing three consecutive quarters of double-digit growth as we maintain momentum across both our Bone Graft Substitutes and Ultrasonics portfolios. Organic growth declined 6 percentage points as anticipated supply chain headwinds, along with the delayed receipt of EU MDR certification and Advanced Rehabilitation impacted revenue. Inorganic growth related to our wound portfolio acquired a year ago, totaled 10 percentage points. Moving down the income statement, adjusted gross margin of 71%, was 510 basis points compared to the prior year and was driven by two primary factors. First, we were impacted by the unanticipated rebate claims, the increased percentage of HA revenue going through private payers and the decline in our overall ASP, which Ken discussed earlier. Second, we had an unfavorable product mix given higher revenue from businesses recently acquired combined with the impact of lower revenue from Exogen. Overall, adjusted total operating expenses were $1 million higher, compared to the prior year as investments in selling and general and administrative expenses more than offset reductions in spending on research and development. Adjusted EBITDA totaled $15 million, compared to $28 million in the prior year. Adjusted net loss totaled $9 million, compared to the income of $18 million a year ago due to lower gross profit and higher interest expense. Net sales increased to $512 million, a 19% increase, compared to 2021. Organic sales increased 1%, while the acquisitions of Bioness and Misonix contributed 18 percentage points of growth. For the year, adjusted EBITDA totaled $66 million. Our 2022 adjusted gross margin reflects the impact of our Misonix acquisition along with a lower average selling price in the second-half of the year in our HA franchise, which I mentioned previously. Adjusted operating income for the year totaled $48 million, compared to $85 million in 2021. As Ken mentioned, we engaged our banking partners upon the termination of CartiHeal and have amended our debt agreement to provide additional headroom and leverage and interest coverage covenants beginning with the fourth quarter of 2022 and extending through the first quarter of 2024. Finally, due to the timing from any upcoming potential divestitures and uncertainty around the amount of rebates related to our HA business, we have decided to delay establishing our 2023 sales and earnings guidance until the impact of these can be firmly quantified. We see revenue growth of low-single-digits, compared to the prior year as strong growth across Surgical Solutions and Restorative Therapies is offset by a decline in Pain Treatments. How did we go from the CMS change not expecting to have an impact to it ultimately having a greatly lowering ASPs, impacting volume, impacting the rebate claims that we're seeing here today again. And I think when we look at this, what we did not anticipate is largely the percent of contracted business that was going through on our HA business. So as we move forward in the second-half of 2022, we saw an unanticipated rise in our contracted business that was beyond what was modeled and beyond the trends that we had in the business. This factor alone had a significant impact, because when you look at this change from wholesale acquisition cost to ASP and then compound with a higher percent of contracted business that obviously not only weighs on higher rebate payments, which were not anticipated, but obviously weighs on your ASP because that becomes part of the calculation on the quarter that the rebates paid. But obviously, fundamentally on the business, we'll have a big financial difference paying the lower rebates. But that was the biggest issue, Alex, is not having the transparency relative to the amount of contracted business and seeing that increase off a slope that was not anticipated. Because in the last quarter, it was expected during a 12-month after the CMS change went into place was when you start to see the headwinds start to abate, but now it's, call it, into 2024. Well, first of all, the WACC rebates continue to impact our ASP through the first-half of this year. So due to the extent of the contracted business that we have and what we estimate now, the impact of the WACC rebates because it's a four quarter look back, becomes a longer process to actually fall off. So as we start getting to the end of fourth quarter of this year and first quarter of â\u0080\u009924, those will be lessened that will cause price stability and actually our prices with Gelsyn and Durolane to rise as we go through 2024. But really, what's driving that, Alex, and shifting that out is just the percent of contracted business that we have. Obviously, we have a great business here at Bioventus and still a thriving business in all aspects with the headwind of HA, which will recede as we go through 2023. We got a solid business across multiple specialties in orthopedics that give us a lot of room and a lot of runway for continued growth, really based on market tailwinds that work in our favor for many years to come. I just had a question, I guess, looking out further to say, 2024, clearly, this year, you're still working through quite a few challenges. So when we look at in 2024 and kind of Bioventus and what should hopefully be a much cleaner slate, how should we think about your top line revenue generation capability as well as your ability to continue driving cost savings beyond the $9 million to $10 million in annual savings going forward. Obviously, we see a lot of ability to continue to drive growth and growth levers in our business, starts with Surgical Solutions in both our Ultrasonics portfolio, which is expanding with both the BoneScalpel Access launch and then this year, SonaStar Elite, which is a next-generation tumor ablation product. Across the portfolio, Advanced Rehabilitation, we expect continued double-digit growth. As far as expenses, we continue to see opportunities across the business, largely to improve our processes as we consolidate the businesses that we've acquired, we see many opportunities to improve ourselves, improve accounts receivable, our working capital, as we mentioned on the call. I think first, we've done a really good job over the last few months of looking at ourselves in the mirror from a cost structure perspective and making those reductions and improving our efficiencies where we think that is needed the best and so that positions us well to fight some of the headwinds we do have from an HA perspective. I mean as Ken said in his remarks, we need to be inward focused in 2023 and really figure out how we simplify our business through some of the divestitures that we're looking at, and that brings in cash flow, but it also brings in efficiencies within our organization and allows us to focus on the more important strategic businesses. So just on Exogen, you noted on your last call that you thought Exogen's slower-than-expected recovery would remain for the rest of 2022. And then as we mentioned, we did reorganize our sales force in early 2022 that caused a shift in some of our Exogen business just based on relationship changes, and that has now matured the sales force that is driving this, has developed new relationships and rapport that's continued to drive improvement in our Exogen business overall. And just on the unanticipated rebate claims, I know you talked last quarter a little bit about how you're trying to prevent these going forward. We just -- we continue to -- yes, one, I would just emphasize what we talked about is the unknown amount of rebates in the future will be much less and a lot less material to our business. The second thing is continuing to invest in this area with additional scrutiny and analytics around this to make sure that we're anticipating that, further deeper analysis of the invoices that we receive and working with our different partners across the payers to understand each of those invoices and encourage and work with them to increase the integrity of the invoices that we're getting. And for 2023, I was wondering if there's anything you could give us on cadence through the year either on revenue or margins. I'd say that we don't expect to have a lot different kind of revenue phasing, throughout the year wouldn't be a lot different than we've historically had. Well, I'm not going to get into a comment on that since we're not providing guidance, but wouldn't expect it to be significantly different than what we've seen coming out of the fourth quarter. While near-term challenges remain in our business, we are confident in the revenue and earnings growth opportunities as we move through 2023. In the coming quarters, we look to regain your confidence in our ability to execute and deliver on our commitments as we begin to improve our growth and margin profile to create stakeholder value."
}