{
    "symbol": "BVS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 14:22:05",
    "content": "  Before we begin, I would like to remind everyone that our remarks today may contain forward-looking statements that are based on the current expectations of management and involve inherent risks and uncertainties that could cause actual results to differ materially from those indicated, including the risks and uncertainties described in the company's filings with the Securities and Exchange Commission, including Item 1A risk factors in the company's Form 10-K for the year ended December 31, 2021, as well as our most recent 10-Q filed with the SEC. We're also very proud of our performance during the quarter as we continue to execute on our strategic goals and drive growth despite a number of headwinds, which included impacts related to the ongoing hospital staffing shortages, as well as Omicron related challenges faced by our surgical solutions business in January. We remain well positioned to take advantage of the shift towards single and three injection treatments for osteoarthritic knee pain, DUROLANE and GELSYN each represent roughly 20% share of the single and three injection markets respectively, with significant room for additional growth in the coming years for both therapies as they increase market penetration. In addition, as you may recall, last year, the AAOS highlighted that high molecular weight cross-linked hyaluronic treatments, such as DUROLANE showed statistically significant improvement and certainly osteoarthritis patients, DUROLANE possesses the highest molecular weight of single injection therapies available, which produces the longest residence time in the joint and an extended Half Life, strengthening our competitive position within the HA market. Now, let me begin with a review of our first quarter results, revenue of $117 million increased 43% compared to the prior year, we saw a nine percentage point increase from organic revenue, along with a 34 percentage point increase related to the acquisitions of Bioness and Misonix."
}