{
    "symbol": "ARCH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 14:42:05",
    "content": " From the cost kind of cadence for the quarters, once again, we're encouraged that we're seeing an improvement in volumes and we've guided up, 50% in volumes from the first quarter, but it's still going to be below what we need on a regular run rate basis. And now, having said that, clearly it suggests that we could have, much lower cost in the second half then we had in the first, and as John said, we would expect to see some improvement in the second quarter on those coking coal costs, but again, still a high priced environment, and again, still volumes being constrained but in the second half of the year with the volumes that are intimate by the guidance for what we provided for guidance of the 9.4 million tons of the midpoint, that certainly suggests that if we're shipping at 2.8 million tons, 2.9 million tons per quarter in the second half, we should get significant benefit from that higher volume. And a little bit of this is muted by the rail situation, but, as you stand back and look at the domestic thermal prices, obviously what's driving it's high natural gas prices, the utility inventories are low, but they're not going out for RFP because they don't have rail service. The biggest thing is that look, Russia supplies about 15% of global coking coal supply and right now there's a big question market as to how many of those tons are actually going to make it into the seaboard market this year. The other interesting data point, I think I put out there is we have had interest for a European utility on term business, out of the Gulf that we have not seen in frankly, I don't know that I've ever seen anybody wanting multiyear contract, but I think it's indicative of what's going on and frankly, they're looking for sure is supply and diversity and supply,\n Very helpful color guys. This business I think, is going to have to go forward running on a cash basis, but look the general concepts spot, there's no question the underinvestment is starting to manifest itself and we're seeing it on the coking coal side, but I also think you're seeing it on the thermal side. You stand back and look, the current events have maybe changed the glide path of the decline, but we all, I think know where this end and what we're tasked with, I think is figuring out how to take what's going on and the global thermal markets and figuring out how to play them best here at home and, I think we'll continue to generate cash out of these assets, but we're simply not going to put any more cash into them."
}