{
    "symbol": "FIS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 12:50:19",
    "content": " As we turn to new market growth, FIS is capitalizing on the rising demand for Banking-as-a-Service solutions, as banks seek to create new revenue streams by widening their traditional distribution to end consumers through fintechs and they're looking to leverage our embedded finance ecosystem. We have many examples of clients getting value from our ecosystem and full suite of solutions, including one of the world's largest grocers who continue to expand their relationship with us adding more banking capability to their operations and a very large global retailer who is expanding their loyalty portfolio by tapping into FIS' network of merchants for rewards redemption. Banking adjusted EBITDA margins contracted 130 basis points to 44%, primarily due to the high contribution margins associated with last year's term fees and the pandemic related revenue that we had to grow over as well as ongoing wage inflation. At the segment level, our organic revenue growth assumptions are unchanged, including Banking of 6% plus, Capital Markets in the mid upper single digits and Merchant in the low double digits. One moment for our next question. If you're looking back to constant currency or organic growth really, we continue to believe banking at 6% plus, capital markets in mid to high single digits and merchant in the low double-digit area for the full year. The other component I would tell you is I did highlight in the prepared remarks, we do see pay rates contributing to e-com growth where we're looking at organic growth north of 20%, which is consistent with our previous remarks, but we're looking at constant currency growth of both the third quarter and the fourth quarter at about a 30% level for e-commerce. We really see this is where the industry is going as we think about disruption, and we think we have a huge advantage given our assets across our segments to bring those together and drive new meaningful revenue, not just in traditional ways, but also to access new markets like embedded finance, like Banking-as-a-Service. One moment for our next question. One moment for our next question. One moment for our next question. This is the period where we sell the lion's share of revenue â\u0080\u0093 I'm sorry the license revenue during the course of the year, the termination fee has pushed from the third quarter to the fourth quarter which is also driving growth. One moment for our next question."
}