{
    "symbol": "FIS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 12:54:19",
    "content": " Going forward with continued market share growth in e-commerce as well as our strategic shift to embedded payments and embedded finance, we expect e-commerce to ultimately account for 50% plus of total segment revenue. On a consolidated basis, adjusted EBITDA margin contracted 150 basis points to 43.7% as margin expansion in capital markets and a reduction in corporate expenses was more than offset by contraction in banking and merchant, reflecting a mix of inflationary costs, high-margin pandemic grow-overs and incremental macro headwinds in geographies such as the UK. FIS continues to differentiate through expertise with enterprise merchants and financial institutions, we continue to provide mission-critical capabilities with highly recurring revenue streams and we benefit from a one-to-many operating model to drive underlying margin expansion, all of which we believe will deliver consistent and sustainable results through challenging macroeconomic conditions, driving value to our clients and shareholders for years to come. And so just looking at some assets that are obviously continuing to grow well, whether itâ\u0080\u0099s got markets or banking, versus parts of the merchant business makes me wonder, again, if it makes sense to reconsider that, right, and whether there is assets that could be better off just being with another company while you could reinvest in areas that really do want to be a focus, you could use cash from those sales. We have strength, I would say, here at FIS in two things: one, which is being very strong portfolio managers and making sure that we divest underperforming businesses, reallocate capital, etcetera, as well as strategically, I think weâ\u0080\u0099ve been a really, really good strategic provider of M&A. What weâ\u0080\u0099re really focused on right now is making sure we focus on the underlying cost structure of the company, getting the capital allocation correct, simplifying the operating model, you might see us look at things like getting out of certain countries where we donâ\u0080\u0099t think weâ\u0080\u0099re getting the right return, selling certain small areas of our business that we think would be better suited with someone else. But in terms of thinking about how to do that differently, possibly over the next 12 months to 24 months, is continuing to pivot to a platform strategy to drive incremental cross-sell and revenue growth either through Amplify, which is taking our existing products and selling them across our existing segments or as I just described, pivoting to in the Worldpay space or in the payment space, not only embedded payments, but also embedded finance. But probably most importantly, over the next 6 months to 12 months, you are going to see us really focus on the operating model and the underlying cost structure of the company, really focused on value creation and how we make sure that the operating model and cash flow conversion continues to be best-in-class, like FIS has been. And so you will see us bring down to normal levels and then reallocate into where we see growth in the businesses over the next 12 months to 24 months, but we wouldnâ\u0080\u0099t expect to need 9% of revenue capital expenditures going forward."
}