{
    "symbol": "KAMN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 22:33:10",
    "content": " Compared to the prior year quarterly sales and associated gross profit were lower for our JPF and K-MAX programs and we incurred an $800,000 inventory step-up associated with the purchase accounting for Aircraft Wheel & Brake acquisition. On a consolidated basis, our net sales in the third quarter were $172 million, compared to $161 million in the second quarter of 2022, and $180 million in the third quarter of 2021. Adjusted EBITDA in the third quarter was $20.6 million, or a margin of 12% compared to $16.4 million, or a margin of 10.2% in the second quarter of 2022. During the third quarter, we incurred an inventory step-up of approximately $800,000 related to the acquisition of Aircraft Wheel & Brake, with the remaining $2.3 million of inventory step-up to be taken during the fourth quarter. Adjusted EBITDA for the third quarter increased to $21.8 million, with a margin of 23.7%. Compared to the second quarter, volumes increased in the third quarter for bearing products serving commercial aviation, partially offset by lower sales and associated margins for engine aftermarket products and industrial bearings. Year-over-year sales increased 11%, excluding the benefit of $2.7 million of sales from Aircraft Wheel & Brake, and the $4.4 million negative impact from foreign currency exchange rates. In our Precision Products segment, adjusted EBITDA for the third quarter was $6.5 million, with a margin of 14.1%. Year-over-year quarterly adjusted EBITDA declined $8.3 million and margin decreased 920 basis points, primarily due to lower JPF sales and associated gross profit when compared to the third quarter of 2021, which had a much larger volume for this program. Profit expectations for this segment have decreased due to the lower margin realized year-to-date on our missile fuze program and K-MAX aftermarket spares and support, as well as the $4 million of additional R&D for KARGO UAV of which $2.5 million is expense and $1.5 million is for CapEx."
}