{
    "symbol": "KAMN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 12:43:06",
    "content": " Improved results were driven by higher volumes of our bearings, strong sales and margins of our springs, seals, and contacts into medical and industrial markets and increased sales of engine aftermarket components in our Engineered Products segment. Robust sales in the second quarter of 2022 for our bearings, springs, seals, and contacts into commercial aviation and medical markets helped to partially offset these declines. Compared to the first quarter, volumes increased in the second quarter for bearings products, serving commercial and military aviation, as well as medical and industrial end markets. Based upon the developments we are seeing in order rates in our Engineered Products segment, we remain confident in our outlook for the full year for the underlying business as a significant portion of our second half sales are already in backlog. Year-over-year results for this segment declined significantly from an adjusted EBITDA of $20.5 million and margin of 28.6% in the second quarter of 2021, primarily due to lower JPF sales and associated gross profit as the second quarter of 2021 had a much larger volume. Our results for the second quarter were in line with our expectations with lower sales and margin for our JPF programs, partially offset with strong sales into medical and industrial end markets and improved performance in commercial, business, and general aviation. Based upon the impact from the material shortage caused by the fire at one of our suppliers, lower than expected order rates in our Structures segment and current pressure from foreign exchange rate, we are revising our sales outlook downward to a range of $700 million to $715 million for the full year, which also assumes the sale of three additional K-MAX aircraft in the year. Given the favorable sales mix and the strength we have seen in our Engineered Products segment, we remain on target to meet our guidance for earnings, EBITDA, and free cash flow for 2022, excluding the expected benefit from the acquisition of Parker-Hannifin Aircraft Wheel & Brake business."
}