{
    "symbol": "LTH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 12:46:03",
    "content": " Average center revenue per center membership increased to $580 from $459 in the prior year period, reflecting increased member spending with our in-center businesses that continued execution of our pricing strategy and the opening of new athletic country clubs in more fluid markets. Rent expense increased 10.8% to $56 million, driven primarily by additional sale lease backs compared to the prior year and additional non-cash rent expense where we've taken possession of a site to begin construction, but have not yet completed construction and open for operation. Depreciation and amortization decreased 5.1% to $58.1 million and other operating income was $70 million, including $400,000 of non cash share based compensation expense, and a $28.4 million onetime gained related to the sale leaseback of two properties in the quarter. During the quarter as Bahram mentioned, we closed on the sale leaseback of two properties for gross proceeds of approximately $80 million, and we expect to close on two additional sale leaseback properties on or about May 13 for approximately an additional 95 million in gross proceeds, bringing our year-to-date sale leaseback gross proceeds to $175 million. Assuming we close on the 500 million of additional sale leaseback transactions at the end of the third quarter we expect total cash and non-cash rent expense for the year will increase from our previous range of $235 million to $245 million, or approximately 13% of projected total revenue for the year to $245 million to $255 million, or approximately 13.5% of projected full year revenue. Second, unlike previous years, where we typically lose net members in the back half of the year, we expect to gain net new center memberships in the third and fourth quarters of this year due to the opening of 10 new athletic country clubs during that period and improved member engagement and retention. And as a result, landlords everywhere wanting to work with us, wanting more lifetime assets and then, but certainly is not very the facts, it is the people who buy specific assets, and have specific financing to that asset, they're buying three clubs, they're putting 40% on and they want to get financing, and that group is going to have a harder time to compete with the other folks who are giving us the kind of cap rates we're looking for. So this continue transaction, this rotation of membership plus strategically going back to a person who's paying $30 a month less than the rack rate and saying we're going to take your dues up 15 bucks, you're still going to pay $15 less than the rack rate because you have an old member. They are similar whether if it's Frisco or Chicago, it's really you guys again, I just, I can't emphasize enough if you get the opportunity to go to see any one of the new clubs, urban or suburban, you will see, these are not gyms, they're athletic country clubs have the highest level of experience for the customer. One, our member NPS score continues to improve and B, very strong and we're getting a lot of great feedback again to how we treated people during the pandemic and then the experience that they're walking back into in the club, all the programming initiatives that we're investing in and have been investing in and all the new members coming to Life Time to participate in pickleball and small group training. When we, if and when we close on the additional $500 million of sale leaseback if you assume we do that towards the end of the third quarter, that moves rent expense for the full year up to about 13.5% and adds about an incremental $10 million of rent expense for the fourth quarter. This next $100 million, $120 million of revenue that comes in on a quarterly basis, it should be largely two thirds of it should be translating into incremental EBITDA because the fixed cost is already covered and the total cost of that incremental revenue should be about 30%, 35%."
}