{
    "symbol": "PFSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:15:06",
    "content": " In the third quarter, PennyMac Financial once again delivered strong financial performance with net income of $135 million or $2.46 in earnings per share. This quarter, we repurchased 1.9 million shares of PFSI common stock at an average price of $51.13, for an approximate cost of $100 million. In PFSI's investment management segment, net assets under management were $2 billion at quarter end, down slightly from the prior quarter due to PMT's financial performance. In total, this strong financial performance drove continued growth in book value per share, which was up 4% from June 30 to $68.26 at the end of the quarter. With mortgage interest rates currently around 7%, the most recent third-party forecasts for originations have decreased meaningfully, indicating an annualized run rate of $1.7 trillion to $1.9 trillion in upcoming quarters. In fact, quarterly operating expenses have been reduced by more than $170 million or 37% compared to average quarterly 2021 levels. Total correspondent loan acquisition volume in the third quarter was $22.4 billion, of which 46% were conventional conforming loans for which PFSI earns a fulfillment fee from PMT. Origination volumes for the third quarter were $2.3 billion and interest rate lock commitments were $3.8 billion, reflecting a steep decline in refinance volume. Purchase lock volume for the quarter of $1.4 billion was 36% of total locks, up significantly from 22% in the prior quarter. Originations in our broker direct channel totaled $1.3 billion and locks totaled $1.9 billion, also down significantly from the prior quarter, reflecting intense competition from channel leaders. PennyMac Financial's own servicing portfolio represented a prepayment speed of 9% in the third quarter, down from 12% in the prior quarter. Similarly, prepayment speeds in PennyMac Financial's sub-serviced portfolio, which includes mostly Fannie Mae and Freddie Mac mortgage servicing rights owned by PMT, were 6.9%, down from 9.3% in the prior quarter. PFSI's owned servicing portfolio, which consists primarily of Ginnie Mae MSRs, had a 60-day-plus delinquency rate of 3.5%, up from 3.2% at the end of the prior quarter, while our sub-servicing portfolio, consisting primarily of conventional loans, reported a 60-day-plus delinquency rate of 0.5%, unchanged from June 30. And the UPB of EBO loan volume totaled $250 million, both down significantly, as opportunities have declined due to higher mortgage rates. As David mentioned earlier, PFSI's net income was $135 million or diluted earnings per share of $2.46. As you will see on Slide 10, we provide a breakdown of the revenue contribution from each of PFSI's loan production channels, net of loan origination expenses, including the fulfillment fees received from PMT for conventional correspondent loans. Revenue per fallout-adjusted lock for PFSI's own account was 99 basis points in the third quarter, unchanged from the prior quarter. The servicing segment recorded pretax income of $145 million, down from pretax income of $168 million in the prior quarter and up from $8 million in the third quarter of 2021. Pretax income excluding valuation-related items for the servicing segment was $70 million, down from the prior quarter as higher loan servicing revenue, higher earnings on custodial balances and deposits and lower expenses were more than offset by higher realization of MSR cash flows and lower EBO-related income. Operating revenues increased from the prior quarter as loan servicing fees grew by $11 million, primarily due to growth in our servicing portfolio. Realization of MSR cash flows increased by $20 million, driven by higher average MSR values during the quarter. On Slide 14, you can see the fair value of our MSR increased by $237 million in the third quarter, driven by higher mortgage rates, which resulted in expectations for lower prepayment activity in the future. Finally, our investment management segment delivered pretax income of $1.6 million, up from $247,000 in the prior quarter. Segment revenue was $10.4 million, up 7% from the prior quarter. With total available liquidity of $2.8 billion as of September 30 and the ability to borrow up to $600 million against Ginnie Mae servicing advances, we believe PFSI is well positioned to address the potential impact servicing advances may present in a recessionary environment. I continue to believe PennyMac is strategically well positioned in the mortgage market given our strong levels of capital, our large and growing servicing portfolio and our efficient and low-cost operating platform run by a best-in-class management team."
}