{
    "symbol": "DLX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 00:57:05",
    "content": " Covering light revenue increased this quarter nearly 18% to $563 million and excluding incremental revenue from First American and business exits during the quarter, revenue increased nearly 7%. Total adjusted EBITDA dollars increased year-over-year, while our adjusted EBITDA margin rate of 18.1% was impacted by inflationary pressures, supply chain disruption, specifically in the higher-margin portion of our Promotional Solutions business and other factors which Scott will detail in a few minutes. For the second quarter, we posted total revenue of $563 million, up 17.7% year-over-year, not including incremental revenue from the First American acquisition and business exits during the quarter, revenue increased 6.6% year-over-year. We reported second quarter GAAP net income of $22.1 million or $0.50 per share in the quarter and included gains of $17.5 million from the sale of the Australian web hosting business and a call center facility, offset by an $8 million increase in acquisition amortization from the First American acquisition and an increase in interest expense of $11.9 million driven by this transaction and rising interest rates. Adjusted EBITDA came in at $101.7 million, up 4.3% from last year, driven by the acquisition of strong performance of First American. The adjusted EBITDA margin rate decline was largely due to inflation, supply chain disruptions within the higher-margin products in our Promotional Solutions segment, and the previously announced technology investments, partially offset by pricing actions and operating leverage from strong revenue growth. Payments grew second quarter revenue 65.7% year-over-year to $171.2 million, largely driven by the acquisition and outperformance of First American. Excluding the impact of business exits, segment revenue increased 7% year-over-year to $68.6 million in the quarter. Promotional Solutions second quarter revenue was $139.3 million, up 3.2% year-over-year, driven by new sales wins and pricing increases, partially offset by business segment. Commercial Solutions adjusted EBITDA margin for the quarter was 10.5%, down 540 basis points, largely as a result of inflationary pressures and lower revenue and higher margin products due to supply chain disruptions. As Barry mentioned, we have sold our retail packaging business within Promotional Solutions, including the previously announced exit of our DSS business, all of these smaller exited businesses from the segment generated approximately $30 million in revenue and negligible adjusted EBITDA in 2021. Checks second quarter revenue increased 7% from last year to $183.9 million as new competitive wins, pricing actions and strengthen in our business checks outpaced the secular declines in the industry. Second quarter adjusted EBITDA margins were 44.9%, down 180 basis points year-over-year largely driven by the addition of lower margin new customers. Free cash flow, defined as cash provided by operating activities less capital expenditures, was $13.5 million in the second quarter, down $5.8 million from the second quarter of 2021, driven by working capital changes due to the strong growth in the business, higher interest expense and higher cash taxes."
}