{
    "symbol": "LOVE",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-28 13:43:04",
    "content": " For the year, we generated a total annual net sales increase of 30.8% to $651.5 million. We will also be leveraging prime and linear TV buys to continue to drive reach, and we expect to spend at a rate of 12% of net sales in fiscal '24 in line with last year. The increase in showroom net sales was driven by an increase of 10.2% in comparable showroom sales related to strong holiday promotional campaigns, and the net addition of 44 new showrooms and five kiosks compared to the prior year period. Internet net sales increased $60 million, or 26.5% to $76.4 million in the fourth quarter of fiscal 2023 as compared to $60.4 million in the prior year period, driven by a strong holiday promotional campaign. Other net sales which includes pop-up-shops, shop-in-shop and barter inventory transactions increased $2.4 million, or 13.3% to $20.5 million in the fourth quarter of fiscal 2023 as compared to $18.1 million in the prior year period. Gross margin increased 70 basis points to 56.6% of net sales in the fourth quarter of fiscal 2023 from 55.9% of net sales in the prior year quarter, primarily driven by a decrease of approximately 190 basis points in total freight partially offset by a decrease of 120 basis points in product margin. The 18.9% year-over-year increase in SG&A was driven by an increase in employment costs due to new hires and variable equity compensation, increases in rent expense related to the addition of 49 new touchpoints, with higher percentage rent on showroom net sales, increase in technology and professional fees, and an increase in credit card fees related to increases in both sales volume as well as interest rates. Advertising and marketing expenses increased $300,000 or 1.2%, $25.8 million for the fourth quarter fiscal 2023 as compared to $25.5 million in the prior year period. Net interest expense of $16,000 for the fourth quarter was slightly lower than the prior year's period related to unused line of credit fees that increased due to the increase in our revolving line of credit earlier this year. For the year, we expect net sales of $700 million to $740 million, driven by the net planned opening of approximately 30 new showrooms and total comparable sales in the high-single-digit to low-double-digit range. Our outlook embeds the expectation that the new product introduction that Shawn and Mary discussed will launch in the second half of the year and does not include any assumption for open-box inventory-related barter revenues beyond the first quarter, which was approximately $22 million in net sales for Q2 through Q4 and fiscal 2023. Additionally, fiscal 2024 will contain a 53rd week in the fourth quarter, which is expected to contribute approximately $6 million in net sales $400,000  in adjusted EBITDA and $0.02 in EPS, which is reflected in our fiscal 2024 guidance. For the first quarter, we expect net sales of $133 million to $136 million, being driven by the planned opening of approximately 16 showrooms and a total comparable sales decrease in the 3% to 5% range. With the second half of our year traditionally being the strongest in net sales, the timing of our new touchpoint openings and new product launches and our planned flow of inbound inventory, we expect to use cash during the first three quarters of the year before generating substantial free cash flow in the fourth quarter to end the fiscal 2024 with a significantly higher year-over-year cash balance and no borrowings under the ABL. And whilst we always are very excited about the performance I shared earlier in terms of the growth and particularly where we see the long-term runway and all of the success that we've had, we have built in for continued growth, both in terms of just overall AUV in the business as well as also attracting new customers because one of the great advantages we saw last year, and I think in quarter 4 our customer traffic was up nearly 18%."
}