{
    "symbol": "EGY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 20:57:17",
    "content": " We expect the related capital spend in 2022 to be between $30 million to $40 million net to VAALCO, which is in addition to our 2021-2022 drilling campaign costs. If successful, we will have to come back to this well in a future drilling campaign to complete it and bring it online because it will require a subsea tieback .For the third quarter of 2022 due to the full field turnaround FSO conversion and field reconfiguration causing temporary downtime, we're guiding production to be in the 8,000 to 8,700 net barrels of oil per day. Adjusted EBITDAX rose 81% to $60.8 million in the second quarter of 2022 compared with $33.5 million in the prior quarter and nearly triple the $21.9 million in the same period of 2021.We've clearly benefited from our highest quarterly net sales volumes and sustained higher realized pricing. We also reported strong net income of $15.1 million or $0.25 per diluted share in the second quarter of 2022, which included a $25.9 million deferred tax expense and an $11.5 million non-cash unrealized derivative gain. After normalizing for the deferred tax charge on the unrealized derivative gain, our adjusted net income for the second quarter of 2022 totaled $30.7 million or $0.52 per diluted share as compared to an adjusted net income of $21.1 million or $0.36 per diluted share for the first quarter of 2022. In the second quarter of 2021, VAALCO reported $8.4 million in adjusted net income or $0.14 per diluted share. Production for the quarter of 9,211 net barrels of oil per day was higher compared to 8,051 net barrels of oil per day in the first quarter of 2022, which was expected due to the new wells coming online from the drilling program. In conjunction with the higher sales, we also had sustained higher crude oil price realization, which increased 3% to $113.38 per barrel in the second quarter of 2022 versus $109.65 per barrel in the first quarter of 2022 and was up 63% compared to the $69.61 per barrel in the second quarter of 2022. Given the expected decrease in sales for the third quarter related to the FSO change out, full field reconfiguration and turnaround and associated lifting costs, our guidance range for production expense, excluding workovers, for third quarter 2022 is expected to be $18 million to $24.5 million or between $30 to $33 per barrel of oil sales. General and administrative expense for the second quarter of 2022, excluding stock-based compensation expense was $2.7 million at the low end of guidance compared with $3.6 million in the first quarter of 2022 and $4.2 million in the second quarter of 2021. The per unit G&A rate, excluding stock-based compensation in the second quarter of 2022 was $2.81 per barrel of oil sales, which was significantly lower than the first quarter of 2022 and the second quarter of 2021 due to higher sales and lower expense. For the second quarter of 2022, net capital expenditures excluding acquisitions, totaled $37.1 million on a cash basis and $38.1 million on an accrual basis."
}