{
    "symbol": "EGY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 16:22:06",
    "content": " Adjusted EBITDAX rose 49% to $33.5 million in the first quarter of 2022, compared with $22.6 million in the prior quarter and nearly double the $18 million in the same period of 2021. We also reported strong net income of $12.2 million or $0.20 per diluted share in the first quarter of 2022, which included a 19.3 million non-cash unrealized derivative loss, and 10.3 million deferred tax benefit. After normalizing for the deferred tax benefit, an unrealized derivative loss, our adjusted net income for the first quarter of 2022 totaled $21.1 million or $0.36 per diluted share, as compared to an adjusted net income of $12.5 million or $0.21 per diluted share for the fourth quarter of 2021. On the first quarter of 2021, VAALCO reported $8.7 million in adjusted net income or $0.15 per diluted share. Production for the quarter of 8,051 net barrels of oil per day was higher compared to 7,554 net barrels of oil per day in the fourth quarter of 2021, which was expected due to the first well of the drilling program being brought online in February, but was partially offset by deferred production due to temporary operational issues in February. This will be a timing difference with production on stripping sales volumes and will result in higher sales volumes in the second quarter of 2022, which you can see in our Q2 sales guidance of between 10,700 and 11,300 barrels of oil per day. Costs were 14% higher than the same period in 2021, primarily driven by a full quarter of production in quarter 1, 2022 from the acquisition of Sasol's interest in Etame that closed in February 2021, compared with just over 1 month in Q1 2021. In the first quarter of 2022 increased as compared to $26.82 per barrel in the fourth quarter of 2021 and $26.02 in quarter one 2021, primarily due to lower sales volumes. Given the expected increase in sales for the second quarter, our guidance range for production expense excluding workovers for second quarter 2022 is expected to be $23 million to $24.5 million or between $22 to $25 per barrel of oil sales. Depreciation, depletion and amortization for the first quarter of 2022 was $4.7 million or $7.59 per net barrel of oil sales compared to $4.1 million or $5.83 per barrel on the fourth quarter of 2021. General and administrative expense for the first quarter of 2022, excluding stock-based compensation expense was $3.6 million, slightly above our guidance compared with $2.2 million in the fourth quarter of 2021 and $3 million in the first quarter 2021. Non-cash stock-based compensation expense for the first quarter of 2022 was $1.4 million and was comprised of non-SARs-related expense of 400,000 and SARs-related expense of 1 million. Even with our lower sales volume for this first quarter, our Q1 2022 annualized EBITDAX is about $134 million, $2.28 per share annualized. For the first quarter 2022, net capital expenditures, excluding acquisitions, total $23.1 million on a cash basis and 31.8 million on an accrual basis. As George mentioned, for the second quarter of 2022, we estimate our net CapEx to be approximately $40 million to $50 million and continue to expect our full year CapEx to be in the range of $90 million to $110 million."
}