{
    "symbol": "MTRN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 13:51:12",
    "content": " So we have been developing a very robust, comprehensive portfolio for deposition materials that can be used in this growth to support the North America market and of course, the chips act as itâ\u0080\u0099s going forward weâ\u0080\u0099ve heard a lot of investment announcements from a number of different fab companies, and then we certainly want to be able to continue to support Europe and in Asia, as well. And so as you kind of take that and you kind of take the average of that I can see its 50% the right number, I donâ\u0080\u0099t know, but I think probably maybe even maybe a little bit less than thatâ\u0080\u0099s a third to a 50 could be a range, I think, because of the fact that youâ\u0080\u0099re averaging out in Q3 with all the initial ramped, itâ\u0080\u0099s a little bit better ramp towards the end of Q3 and then probably about a three quarters away, I would say, in Q4. I would see that the way that we have planned at the plant because weâ\u0080\u0099ve done 150,000 square foot, we purposely made sure that weâ\u0080\u0099ve got enough capacity to be able to leverage that organic growth about these two things that weâ\u0080\u0099ve announced, which is the battery project as well as the ALD project along with other customers that we can get there and as well as other advanced chemicals products. I think both of these can be to your point meaningful impacts to us in the â\u0080\u009824, â\u0080\u009825, â\u0080\u009826 timeframe, particularly, I would say the longer cycles certainly the battery side and because that next generation work need some development work, since this isnâ\u0080\u0099t more in the prototype phase whereas the ALD is much more production phase, but I could see a combined scenario where itâ\u0080\u0099s an easily in the â\u0080\u009824, â\u0080\u009825 timeframe double digit at North a double digit type of figures from there. Please announce your affiliation, then pose your question. Please announce your affiliation, then pose your question."
}