{
    "symbol": "CRGY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 14:34:13",
    "content": " These statements are subject to risks and uncertainties, including commodity price volatility to continued impact of COVID-19, geopolitical conflicts, including in Russia and Ukraine, our business strategies and other factors that may cause actual results to differ from those expressed or implied in these statements, and our other disclosures. It's been less than a year since we began trading publicly as Crescent Energy, and we continue to be excited about the market opportunity ahead of us. For over a decade, our organization has maintained a consistent strategy based on cash flow, risk management, and investment returns, with the goal of creating long term value for shareholders through commodity cycles. We are pleased to share with you today's results, as this is our first full quarter including our recent Uinta Basin acquisition. Overall, our second quarter results were in line with our performance expectations as we focused on operations of our existing assets and the successful integration of our highly accretive Uinta Basin acquisition. The addition of the Uinta Assets has significantly increased the scale of our production base, reduced our per unit cost structure, and added high margin oil inventory, which has resulted in significant growth in our business. Relative to our first quarter results, net production has increased 18% and adjusted EBITDA has increased 92%, offering another tangible example of our acquisition strategy creating value for shareholders. In the second quarter, we continued to generate significant free cash flow and strong returns on invested capital, allowing us to maintain a healthy balance sheet and return capital to shareholders through our fixed quarterly dividend structure. Operationally, we continue to execute on our 2022 capital program having maintained three rigs across the Uinta and Eagle Ford and brought online 13 gross operated wells for the quarter. And in today's commodity environment, our quality multi-year inventory continues to see exceptional returns on capital with short payback periods. While operational performance has been strong and the business continues to grow significantly, Crescent remains relatively new to the public markets. We believe it's critical that we continue to increase market awareness of the Company, our strategy, and our proven track record of generating shareholder value. As I said earlier, we describe our strategy is focused on cash flow, risk management and returns. And we seek to deliver strong returns on invested capital, both through internal development and complimentary accretive acquisitions all in order to drive profitable long-term value for shareholders. Turning to the market backdrop, we would highlight that following years of under investment in the oil and gas sector, we are in a period of unique volatility, which has been driven by the rapid recovery of global economy, post pandemic and exacerbated by unprecedented geopolitical dynamics. While sustained higher commodity prices have bolstered our overall outlook, broader inflationary pressures and supply chain constraints continue to manifest across the oil and gas industry and will remain a key theme for the remainder of this year at least. In the A&D market, we are on pace to evaluate around 150 to 200 opportunities this year, which we firmly believe provides us with a differentiated view of the opportunity set available today. Given the heightened commodity price environment, we've seen a significant increase in assets on the market in 2022. In our view, the volatility and commodity prices alongside the steep backwardation in the forward curve has widened the bid ask spread in the A&D market and will likely lead to more failed sales than usual. We believe Crescent is well positioned to create significant shareholder value through this environment, given our differentiated investor mindset and broad operational capabilities covering both conventional and unconventional assets, which expands our list of actionable opportunities, ensuring we can find attractive risk adjusted returns that complement our existing portfolio. And given the nature of our business today, our low decline rate and multi-year inventory of high returning locations allows us to be patient in evaluating new transactions, while remaining well-positioned to capitalize on compelling opportunities as they arise from within the large volume of assets on the market today. First and foremost, we emphasize M&A activity that generates returns in excess of 2x our invested capital with sub five-year paybacks. Throughout our continual portfolio construction over many years, we believe we have proven our ability to capture attractive assets, integrate them into our portfolio and apply our strong operating skills to find synergies and create value for shareholders. With our differentiated business model including a unique combination of operating, financial, and investment expertise, we were well positioned to move quickly amidst complex sales process dynamics, and capitalize on a large and compelling opportunity for our shareholders. While maintaining pro forma leverage of 1.3x, we closed on the acquisition in March for total cash consideration of $690 million, a very attractive headline value for assets with $1 billion of approved developed PV-10 at 9x pricing as of March 31, and substantial development upside. We executed three years of hedges on a portion of PDP volumes at closing, ensuring strong downside protection, while maintaining significant commodity upside on the large base of unhedged reserves. The reduction in activity allows us to manage development timing, while our midstream provider adds additional capacity to our infield gathering system to support future volume growth from us and other operators who continue active development programs. Additionally, this allows us to validate both our spacing and completions design optimization relative to the previous operator, which we believe will create more shareholder value over time. Furthermore, as I noted earlier, we've continued to see the same broader inflationary pressures and supply chain constraints as the rest of our industry, which remain a byproduct of the higher commodity price environment. As touched upon during our first quarter earnings call in January of this year, we joined the Oil & Gas Methane Partnership 2.0 initiative or OGMP 2.0. The rigorous OGMP 2.0 framework will aid our efforts to create targeted programs to reduce emissions, accurately report our data, and help us to be positioned as an industry leader in emissions reduction over time. We were pleased to see that additional U.S. operators, such as ConocoPhillips, Devon, and Pioneer have joined the OGMP 2.0 as well, ensuring that we are in good company, as we strive to identify and reduce emissions as an industry. In short, our acquisition strategy, operational performance, and a supportive commodity backdrop have all contributed to the strong results posted this quarter, including our substantial free cash flow generation. With that, I'm happy to turn the call over to Brandi to cover our second quarter 2022 financial results and 2022 outlook. As we are successfully integrating our accretive view into acquisition while maintaining our rigorous commitment to cash flow priorities, 1A and 1B shareholder returns in the balance sheet. Alongside earnings, we announced a quarterly dividend payment of $0.17 per share consistent with the second quarter. We intend to pay $0.17 per share quarterly for the remainder of the year, generating an attractive 5% yield based on recent trading prices. As we continue to generate significant free cash flow through the remainder of the year, we expect to reduce leverage to our target level of 1.0x EBITDA, absent any potential acquisitions. For the second quarter of 2022, our first full quarter, following the Uinta acquisition, we produced over 140,000 net barrels of oil equivalent per day in line with our previous guidance. Additionally, we generated $373 million of adjusted EBITDAX and $137 million of levered free cash flow, which represents a 92% and 53% quarter over quarter increase respectively. For the remainder of the year, we continue to expect operating cost to trend lower on a $1 per Boe basis, which we anticipate will result in full-year OpEx per Boe, around the high end of our previous guidance range. The addition of the Uinta assets has also modestly increased our differentials given its production prices as a percentage of WTI, which has been more than offset by the higher oil weighting of our portfolio increasing our total realizations. Adjusted recurring cash G&A totaled $1.40 per Boe, which was in line with previous expectations and represents an 18% quarter over quarter decrease. Note this calculation excludes certain non-recurring expenses that we incurred associated with the Contango merger, the Uinta acquisition and the formation of Crescent energy as a public company, and we expect an incremental $10 million of one-time expenses for the remainder of 2022, including post-merger integration and other transaction related costs. Moving on to capital spend, we invested 193 million in the second quarter drilling 16 gross operated locations in the Uinta and nine in the Eagle Ford. As David mentioned, we planned a ship to one rig into Uinta Basin in this upcoming quarter, as we implement and monitor our optimized facing and completions design and managed volumes ahead of our third-party gas gatherers plant expansion. Based on what we know today, we believe our capital range continues to accurately account for expected inflation as our February guidance incorporated a 10% to 15% increase in capital costs year over year. Given we are seeing additional pressure of around 10% for the remainder of the year, we anticipate our total capital spend to trend towards the mid- to high-end of our expectations, but still within the targets we outlined in guidance. Moving to our capital markets activities, we continue to engage with the market to expand our followership, improve our flow and increase equity research coverage. As we touched on last quarter, we recognize that the current market positioning and awareness of Crescent is not yet at a level consistent with peers of similar size, and more nuanced aspects of the business such as the impact hedges have on near-term cash flows are not fully appreciated and reflected in our current valuation. With that being said, we continue to monitor and balance our intentions to increase market presence with the state of the broader equity markets, which as you all know have under undergone a period of extended volatility over the first half of the year. Given our initiative to increase market exposure, we do not intend to pursue a share buyback program like many of our public company peers, which we believe would run encounter to the creation of long-term value that increased float in market presence would provide. Additionally, we believe the relative shareholder returns of our ongoing development program alongside preserving balance sheet strengths and maintaining ongoing quarterly dividends is a more attractive use of excess cash flow. In summary, Crescent continues to perform in line with our expectations and remains well positioned to create shareholder value in today's market. We are focused on generating cash flow, making discipline investments, maintaining our strong balance sheet and returning cash to investors. Number one, we've made seven accretive acquisitions in the last 18 months and grown adjusted EBITDA to $1.5 billion on a hedge basis and $2.6 billion on an unhedged basis on an annualized basis for Q2. We continue to deliver strong free cash flow, which supports our high quality balance sheet and dividends. Number five, we believe our stock will gain momentum in the market as our legacy acquisition hedges roll off, and we continue to increase market awareness, trading liquidity and float in our shares over time. Really besides, I think it's fair to say, you're certainly going to maintain the base given, which is great to see. What I would say that's differentiated about us and we think presents a really compelling opportunity is the rest of the industry faces higher decline rates, faces a lot of pressure to return capital given what's happened in the public markets over the last decade. And so at a time when equity capital in particular is scarce in the sector, we do think our acquisition strategy, which has been proven over many years should deliver us really compelling opportunity to continue to grow the Company. So I would say, again, just to repeat that number one, we're focused on the balance sheet and the existing dividend. We're just patient with the excess capital we have, and in an ideal world, we'll find really attractive acquisitions while others are focused on a different strategy than we are. And so, as this market evolves, we'll be happy to consider what I would call more traditional uses of the free cash flow we're generating. We feel really good about where the balance sheet sits today, so would expect new hedges to come in in the context of an acquisition. So, obviously when you take over things, there's certain things that you learn along the way, but nothing notably surprising and everything kind of really in terms of overall our investment thesis is really playing out as expected. I mean, look think it's been a pretty dynamic market thane think, a lot of places where we've seen it and you've heard it as round steel pricing, a diesel, obviously just given where oil and gas prices have been -- sand has been a particular notable item. And then just with the type service market you're just kind of sting steady creep as you think of rig rates, which are smaller part of the capital cost as well as just the availability of completion crew. So, it's really kind of been steady in certain places you've seen higher growth, but I think what we're starting to see, particularly with the pullback and oil. It is just some stability starting to shake up in kind of the day-to-day commentary, but it's really been across the broad, but it's really kind of steel diesel pricing, and sand is where I'd say, we've seen the most notable price increases. We really -- we built our portfolio over the last seven, eight year downturn to be heavily production weighted and lower decline, and anticipating inflationary environment like this with a increase in commodity price environment."
}