{
    "symbol": "EAT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-24 14:01:07",
    "content": " So specifically that's eliminating low mixing or redundant menu items, eliminating redundant pantry SKUs that are in the back of the restaurants, removing unneeded dishware, which will help with both labor, as well as some cost of smallwares, eliminating unneeded process that happened that don't really help the guests, but end up being literally years of labor hours annually that we're spending money on and then reducing administrative work in the back of the restaurants that's not helping the guest. Chris, your line is live. And so we've got to make sure that we figure out ways to build capacity in that area, because I think both It's Just Wings, as well as in the Chili's business that zone one will be a source of growth going forward. We also have some growth ideas for virtual brands, so one of the big ideas that I'm really bullish about that we're going to be rolling out next week is taking all of the It's Just Wings wing flavors and curly fries and putting them on core Chili's. I think as we get further down the road in terms of the technology improvements, one of the things that I'm talking about with our leadership team is what can we use technology to do to make it both a better experience for the guests, as well as take some of the workout of the team members hands and in a world where we own most of our own restaurants that gets a whole lot easier to test and rollout a whole lot faster and so technology, as you know, and everybody that covers the industry is where everything is going, right. The new build construction has slowed somewhat, the market's are little bit longer date and time lines on some of the construction, you have seen some increased costs, which has caused us to pull back in different places to make sure that we are -- if we are constructing, we're constructing within a dynamic that we think we can get a good return. John, your line is live. And then we're going to reboot the My Chili's Rewards program, we probably will still give some things away, but it will be focused more on compressing the time between visits for our loyal guests and we think we can make that loyalty program more traffic driving, but less costly with a better strategy and execution based on key customer insights. John, your line is live. But we do think that there -- we do have some pricing power in different areas in the business between being a little bit slower than the industry last year on taking everyday pricing, making sure that we have really sharp pricing for that guest that's cash trapped that's available in the restaurant every day, which we're going to maintain and then the reduction of discounts over time that we think will help us earn better pricing on the business. Yes, you're understanding it correctly, we'll take a series of different price increases, not necessarily just menu price increases, obviously, looking at a lot of different dynamics, if where you can take actionable price you'll probably actually see on a quarterly sequencing, Chili's tick up a little bit above that average level as you, kind of, move through the middle of the fiscal year. Chris, your line is live."
}