{
    "symbol": "EAT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-02 15:48:03",
    "content": " To ensure we deliver a great guest experience and continue to grow the base business, we're focused on making sure Chili's is staffed with stable, well-trained teams and smooth operational systems. Your line is live. And if I could just tag on just a little bit to that, why that staffing in particular ability to bring dining rooms back up at higher capacity because when we see our highest operating periods like in December, it's when you're getting, as I mentioned, those dining rooms functioning back up to closer to normalized capacity. Your line is live. Your line is live. Your line is live. So I'm just wondering, especially with the pricing now at north of 4% of Chili's, what your outlook is specifically to the second half and whether that price increase is seeing any consumer pushback or whether you see any elasticity issues, it sounds like you're really not seeing any, but just trying to figure out how you would gauge that. And Jeff, again, as we continue to move through the second half of the fiscal year, while January gives us a little bit of a stub in the toe from a performance standpoint to overcome, I would expect moving out of this environment that you'll see the typical margin growth that you would in the back half of our fiscal year as we tend to obviously see progression in margins at the ROM level as we move through some of our higher volumes in Q3 - in Q4. Your line is live. That's why we're very cautious about how we price and making sure that our pricing actions don't do damage to the overall value propositions that we offer for consumers, which is why we think we've been able to, again, beat the category for 16 consecutive quarters on traffic. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. And is now going through what I will call the learning curve, just getting used to how to run a different model where your servers stay out on the floor and you've got a runner component and the technology is communicating back and forth, but it's out, it's running, and we're just getting proficient at it, I'll say. And we're very excited about how quickly they've gotten to where they are today, and we don't think it's going to be much longer than we'll be kind of pretty much fully up to speed. Your line is live."
}