{
    "symbol": "CHRW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:47:02",
    "content": " Compared to our third quarter operating expenses, the actions weâ\u0080\u0099re currently taking are expected to generate $175 million of gross cost savings on an annualized basis by the fourth quarter of 2023. Inflation, other headwinds such as annual pay increases and tailwinds such as lower incentive compensation, are expected to result in net cost headwinds of $25 million in 2023 that we expect to partially offset the gross savings resulting in net annualized cost reductions of $150 million by fourth quarter of next year. In our NAST LTL business, we generated quarterly AGP of $161 million in the third quarter, up 23% year-over-year. For the third quarter, Global Forwarding generated AGP of $248.4 million, representing a year-over-year decrease of 20% versus a record high for a third quarter in 2021. AGP in our airfreight business declined $12.5 million or 21% year-over-year, driven by a 16.5% decrease in metric tons shipped and a 5.5% decline in AGP per metric ton shipped. Another data point that demonstrates our progress is the execution of 615,000 fully automated bookings with carriers in our NAST Truckload business during Q3, which is an increase of 87% compared to the same quarter last year, and represented $1.2 billion in digital bookings in Q3 alone. Our third quarter total company AGP was up $43 million or 5%, with growth in NAST partially offset by the decline in Global Forwarding. Q3 personnel expenses were $437.5 million, up 9.4% compared to Q3 last year, primarily due to a 13% increase in average headcount. Q3 expenses of $162 million were up $28.5 million compared to Q3 of last year, driven primarily by increases in legal settlements, purchase services and travel expenses. Q3 net income was $225.8 million, down 8.6% compared to Q3 last year and we delivered diluted earnings per share of $1.78, down 4% versus last year, but up 78% compared to Q3 of 2020. The $699 million year-over-year improvement was primarily due to a $359 million sequential decrease in net operating working capital in Q3, driven by the declining cost and price of purchased transportation in our model. Conversely, Q3 of last year included a $412 million sequential increase in net operating working capital as costs and prices were rising. Our debt balance at the end of Q3 was $2.2 billion, up $472 million versus Q3 last year, primarily driven by share repurchases due to our expanded capacity to borrow, given our EBITDA performance. When including expected net headwinds of approximately $25 million, driven by inflation and merit increases in 2023, we expect to realize net annualized cost savings of $150 million by the fourth quarter of 2023. And so yes, I guess, if you take the very high end of our guidance of $600 million, and look at our year-to-date, youâ\u0080\u0099d be seeing 172, 173-ish kind of number would be the Q4 plug to get to the high end, which is higher than what we had in Q3 of 162-ish. And then back to your first question, I think you were asking about in our all other and corporate results, our income from operations, which was a $10 million loss compared to what would have been a $3.4 million loss a year ago, and thatâ\u0080\u0099s driven by unallocated expenses that we hold at the corporate level and think about that as primarily our investments in growth in the product organization."
}