{
    "symbol": "CHRW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 23:18:04",
    "content": " Our adjusted gross profit, or AGP per shipment increased 48% versus Q2 last year and 26% sequentially as the cost of purchase transportation declined during the quarter and the percent of truckload shipments with a negative margin returned to historical levels. And although pricing declined sequentially in Q2, our average linehaul rate billed to our customers, excluding fuel surcharges, increased year-over-year by approximately 1.5%, which was supported by our contractual truckload portfolio that was negotiated in prior quarters. In our NAST LTL business, we again generated record quarterly AGP of $166.9 million in second quarter or up 30% year-over-year through a 37% increase in AGP per order that was partially offset by a 5% decline in volume. As was the case in the last few quarters, the second quarter decrease in LTL volume was mainly driven by a normalization of business levels as our LTL volumes in the second quarter of 2021 were bolstered by a few large customers that benefited from the stay-at-home trend during COVID, which contributed to 23% LTL volume growth in the comparable quarter last year. Within these results, our ocean forwarding business generated Q2 AGP growth of $77 million or 51% year-over-year. Finally, our international airfreight business delivered AGP growth of $4 million or 7.5% year-over-year, driven by a 14% increase in AGP per metric ton shipped, which was partially offset by a 6% decrease in metric tons shipped. On the customer side of our marketplace, through further integrating and scaling a real-time dynamic pricing engine, we priced 71% of our spot truckload volume through this digital tool, resulting in $597 million of truckload business. After seven consecutive quarters of increasing price and cost per mile in our North American truckload business, both declined sequentially in Q2, with costs declining faster than price due to a softer demand environment and capacity that has grown over the past 12 months. Q2 personnel expenses were $444.8 million, up 22.6% compared to Q2 last year, primarily due to increased headcount as we support growth and transformation opportunities across our business. Q2 net income was $348.2 million, up 80% compared to Q2 last year, and we delivered record quarterly diluted earnings per share of $2.67, up 85% year-over-year. And so while the market will undoubtedly shift from this point over time, we've got a clear view on what it's going to take to deliver against that 40% operating margin target through the cycle, both in terms of the components of volume, AGP per transaction and just our overall cost structure. And more specifically, I would say, within that advisory, we go on to say that we believe that the first quarter is the only quarter that's going to see any sort of industry-wide price increase in order to get to a year-over-year down 15%, you have to see some decreases in the back half of the year."
}