{
    "symbol": "DERM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 09:50:04",
    "content": " While third quarter financial results did not meet our expectations, we continue to report record revenues for the nine months ended September 30, 2022 of $57.7 million, which is 26% greater than revenues for the nine months ended of the prior year of $45.1 million. In addition to the macroeconomic challenges faced by our sector, which limited our growth in the third quarter, Targadox revenue for the quarter was $4 million less when compared against third quarter of the prior year, reflecting the continued impact of generic competition for the brand. However, this shortfall was partially offset by an increase in Accutane revenue of $0.6 million or a 17% increase versus the third quarter of the prior year. Our flagship products, Qbrexza and Accutane along with the contributions of our newly launched products, Amzeeq and Zilxi represented $44.4 million or 81% of our year-to-date revenue. Oracea had approximately 340 million in prescription sales in 2021 according to Symphony data, once approved and launched in 2024, we believe that DFD-29 will be able to achieve net sales in excess of $100 million annually, providing meaningful revenue contribution for the company. Total revenue was $16.1 million for the three-month period ended September 30, 2022, a decrease of $3.5 million from $19.6 million for the three-month period ended September 30, 2021. Other incremental product revenue of $1.7 million versus 2021 during the three-month period ended September 30, 2022 was driven by our newly acquired and launched products Amzeeq and Zilxi. In addition, the three-month period ended September 30, 2021 included an inventory step up of $3 million for inventory units sold related to the acquired finished goods of Qbrexza from Dermira in 2021. Research and development expenses increased to $2.8 million for the three-month period ended September 30, 2022 from $0.7 million for the same period of the prior year. Selling, general and administrative expenses were $15.6 million for the third quarter of 2022 compared to $10.8 million for the third quarter of 2021, with the increase primarily resulted from the expansion of our sales force, product samples, marketing expenses related to the expanded portfolio of four products, Accutane, Qbrexza, Amzeeq and Zilxi, and professional fees associated with being a public company. Our non-GAAP adjusted EBITDA for the third quarter of 2022 after adjusting for R&D expenses related to DFD-29, resulted in a net loss of $4 million or $0.23 per share basic and diluted versus a net profit of $1.3 million or $0.14 per share basic and $0.12 per share diluted. I mean, as I look historically, right, itâ\u0080\u0099s relatively a new product, weâ\u0080\u0099ve been averaging, like you said, first quarter, we did about $4.9 million, second quarter this year, we did about $5.2 million in Q3, the Isotretinoin and market was down, we still held our market share at about 11.2%."
}