{
    "symbol": "HIVE",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-04 12:05:06",
    "content": " 05:52 HIVE’s total assets from the balance sheet, Darcy can go into more details on this for everyone, but you can see that from the end of twenty twenty it was approximately six point four million and now our Bitcoin Ethereum is eighty two million at the end of June, And the idea of launching the ATM in the first quarter of this year has allowed us to be able to huddle most of our production, at the same time is, take that cash flow from our existing business and upgrade our CPUs on swaps from four gigabyte cards to eight gigabyte cards. And so, throughout fiscal twenty twenty and twenty twenty one, you could see that you know, HIVE was mining twenty five, almost thirty thousand Ethereum per quarter, but of course, Ethereum prices were hovering around two, three, four hundred dollars in fiscal twenty twenty one, so calendar year twenty twenty one for HIVE. It was, you know, Bitcoin mining difficulty was incredibly high during this period, but nonetheless, HIVE just continued to steadily grow two twenty six Bitcoin in the fiscal year June thirty period end, which is our Q1. It's on this slide, slide twenty six, it’s showing, we generated revenue from digital currency mining in the first quarter of fiscal twenty twenty of thirty seven point two million from a coin production as we've gone over approximately ninety seven sorry nine thousand seven hundred Ethereum and two twenty six Bitcoin. 27:47 On this slide, we're looking at the quarter over quarter and can see our revenue from digital currency mining has increased to thirty seven point two million dollars from thirty three point four million in the fourth quarter of fiscal twenty twenty one. 30:24 And this is just looking at our continued gross mining margin income per share, it's zero point zero five dollars for the three months just ended of June thirty twenty twenty one and this is compared to the prior year of two point six million dollars gross mining margin and we had an income per share of pretty much zero for the comparative year over year at June thirty twenty twenty."
}