{
    "symbol": "HIVE",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-16 13:22:02",
    "content": " And the big reason for that is that there are so many kids who have AMD 580 chips or NVIDIA chips for gaming, in particular they turn their computers on to mine when they're sleeping, so you have a much more diversified ecosystem for mining Ethereum, and as one young -- it's anecdotal but when the young designer told me last week that there's CAD-CAM city panning for St. Antonio, and that he turns the machine on and it generates about $4,000 a year, which allows them to get -- to buy new equipment, new PCs, and any software he needs from mining Ethereum while he sleeps. Turning to Slide 36, we generated revenue from digital currency mining in the second quarter of Fiscal 2022 of $52.6 million versus $13 million in the prior year second quarter. The increase in revenues versus the same quarter in fiscal 2021 was due to an increase in the production of Bitcoin mining as you've seen to 656 from 88 in the prior year, driven by the acquisition of the 2 Bitcoin mining data centers in Canada. Our gross mining margin, which equates to our revenues minus direct operating and maintenance costs, increased in absolute dollars to $45 million in the most recent quarter compared to $9.2 million in the prior-year comparative. Turning to slide 37, comparing our current Fiscal Q2 quarter to the previous Q1 quarter, we generated revenue from digital currency mining in the second quarter of Fiscal 2020 of $52.6 million versus $37.2 million in the previous quarter. And staking in my opinion today with what the Fed has done to the treasury market and the fixed income market is something that's going to revolutionize the world moving forward because you can actually generate positive yield versus all the negative yielding debt instruments that exists currently due to inflation and the continuous money printing in the U.S.  We just today launch one of our first nodes in our DeFi infrastructure and governance business line, and then, of course, our third basket as DeFi venture, where we co-invest with the likes of Anthony Pompliano and Teeka Tiwari as well as other related parties through our vast network due to Yohan, Olivier, Diana, and Wooters relationships."
}