{
    "symbol": "PMT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 17:56:02",
    "content": " For the fourth quarter 2022, PMT reported a net loss attributable to common shareholders of $5.8 million, or $0.07 per common share, as solid income excluding the impacts of market driven fair value changes was more than offset by fair value declines in PMTâ\u0080\u0099s interest rate and credit sensitive strategies. During the quarter, PMT repurchased 1.2 million shares of common stock for $14 million at an average price of $11.80, significantly below current book value per share; and through January 31st, PMT repurchased an additional 22,000 shares, for an approximate cost of $278,000 at $12.63 per share. This quarter, $6.8 billion in UPB of PMT conventional correspondent production led to the creation of $127 million in high-quality mortgage servicing rights. Although returns in PMTâ\u0080\u0099s credit sensitive strategies were impacted by wider market credit spreads in 2022, we have seen a material improvement in early 2023, which has driven improvements in structured product markets, and which may generate additional attractive investment opportunities over time. In our interest rate sensitive strategies, the fair value of PMTâ\u0080\u0099s MSRs increased as interest rates increased and prepayment speeds have fallen significantly. On slide 7 of our fourth quarter earnings presentation, we illustrate the run-rate return potential from PMTâ\u0080\u0099s investment strategies, which represents the average annualized return and quarterly earnings potential that PMT expects over the next four quarters. In total, we expect the quarterly run-rate return for PMTâ\u0080\u0099s strategies to average $0.40 per share or a 10% annualized return on common equity. In our credit sensitive strategies, the potential return from PMTâ\u0080\u0099s organically created CRT investments increased from last quarter, reflecting credit spreads that continued to widen in the fourth quarter. As we mentioned last quarter, PMT began selling certain of its conventional correspondent loan production to PFSI, which totaled $3.9 billion in UPB. PMTâ\u0080\u0099s correspondent production segment pretax income as a percentage of interest rate lock commitments was 9 basis points, up from 6 basis points in the prior quarter and the weighted average fulfillment fee rate was 18 basis points, unchanged from the prior quarter. PMTâ\u0080\u0099s Interest Rate Sensitive strategies consist of our investments in MSRs sourced from our correspondent production, and investments in Agency MBS, non-Agency senior MBS and interest rate derivatives with offsetting interest rate exposure. The fair value of PMTâ\u0080\u0099s MSR investments at the end of the fourth quarter was $4 billion, up slightly from $3.9 billion at the end of the prior quarter. While delinquency rates for borrowers underlying PMTâ\u0080\u0099s MSR portfolio increased marginally from the prior quarter, they remain consistent with seasonal trends and our expectations for a conventional loan portfolio. Now, I would like to discuss PMTâ\u0080\u0099s Credit Sensitive Strategies, which primarily consist of investments in organically-created CRT from PMTâ\u0080\u0099s production, investments in non-Agency subordinate bonds from private-label securitizations of PMTâ\u0080\u0099s production, and opportunistic investments in GSE CRT. The fair value of PMTâ\u0080\u0099s organically created CRT investments as of December 31st was $1.1 billion, down slightly from $1.2 billion at September 30th, primarily due to prepayments. PMT reports results through four segments: Credit Sensitive Strategies, which contributed $10.8 million in pre-tax income; Interest Rate Sensitive Strategies, which contributed $9.3 million in pre-tax loss; Correspondent Production, which contributed $7.1 million in pre-tax income; and the Corporate segment, which had a pre-tax loss of $14.1 million. This amount included $8.1 million in market driven fair value losses, reflecting the impact of wider credit spreads in the fourth quarter. Gains on PMTâ\u0080\u0099s organically created CRT investments also included $17.8 million in realized gains and carry, $1.2 million of net realized losses recognized during the period, $11.7 million in interest income on cash deposits, and $15.5 million of financing expenses. Excluding market driven value changes, and the related tax impact, PMT reported $39 million of net income across its strategies. With respect to PMTâ\u0080\u0099s $450 million of MSR term notes maturing in April 2023, PMT has the option to extend the maturity for two years at its own discretion and is likely to do so given current market conditions. All CRT term notes contain the option to extend the maturity for two years at PMTâ\u0080\u0099s discretion, except $54 million of term notes due in October 2024. With PMTâ\u0080\u0099s current portfolio of seasoned investments in credit risk transfer and hedged mortgage servicing rights, we remain confident in its ability to deliver attractive returns to its shareholders over the long-term."
}