{
    "symbol": "PMT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:12:07",
    "content": " In what was a challenging market for most mortgage REITs in the third quarter, PMT reported net income of $1.5 million or $0.01 per common share. Strong performance from PMT's interest rate-sensitive strategies and overall income, excluding market-driven fair value changes, was sufficient to offset the impact of continued credit spread widening and an increased provision for tax expense. During the quarter, we repurchased 1 million shares of PMT's common stock for $13 million at an average price of $13.66, significantly below current book value per share. With mortgage interest rates currently around 7%, the most recent third-party forecasts for originations have decreased meaningfully, indicating an annualized run rate of $1.7 trillion to $1.9 trillion in upcoming quarters. Although returns in PMT's credit-sensitive strategies have been impacted in recent periods by wider market credit spreads, our lender risk share investments consist of seasoned loans, with a weighted average current loan-to-value of 62%, benefiting from the strong home price appreciation we have seen in recent years. In recent periods, equity allocated to PMT's credit-sensitive strategies has decreased meaningfully due to runoff of our lender risk share investments and the fair value declines that have resulted from market credit spread widening. Year-to-date, PMT has invested approximately $185 million in floating-rate CRT bonds recently issued by Fannie Mae and Freddie Mac. As David mentioned, PMT's Board of Trustees recently approved an increase to its share repurchase authorization from $400 million to $500 million. On Slide 7 of our third quarter earnings presentation, we illustrate the run rate potential from PMT's investment strategies, which represents the average annualized return and quarterly earnings potential that PMT expects over the next four quarters. In total, we expect the quarterly run rate for PMT's strategies to average $0.41 per share or a 10% annualized return on common equity. In our credit-sensitive strategies, the potential return from PMT's organically created CRT investments increased from last quarter, reflecting credit spreads that continued to widen. PMT's correspondent production segment pretax income as a percentage of interest rate lock commitments was 6 basis points, down from 9 basis points in the prior quarter. PMT's interest rate-sensitive strategies consist of our investments in MSRs sourced from our correspondent production and investments in Agency MBS, non-Agency senior MBS and interest rate derivatives with offsetting interest rate exposure. The fair value of PMT's MSR investments at the end of the third quarter was $3.9 billion, up from $3.7 billion at the end of the prior quarter. Now I would like to discuss PMT's credit-sensitive strategies, which primarily consist of investments in organically created CRT from PMT's production, investments in non-agency subordinate bonds from private label securitization of PMT's production and opportunistic investments in GSE CRT. The total UPB of loans underlying PMT's organically created CRT investments as of September 30 was $25.3 billion, down 4% from June 30. The fair value of our organically created CRT investments at the end of the quarter was $1.2 billion, down from $1.3 billion at June 30 due to fair value decreases that resulted from market spread widening and prepayments. PMT reports results through four segments: credit-sensitive strategies, which contributed $3.7 million in pretax loss; interest rate-sensitive strategies, which contributed $103.5 million in pretax income; correspondent production, which contributed $6.1 million in pretax income; and the corporate segment, which had a pretax loss of $15.5 million. The losses on PMT's organically created CRT investments this quarter totaled $1.4 million. Losses on PMT's organically created CRT investments also included $18.8 million in realized gains and carry, $0.2 million of net realized losses recognized during the period, $7 million in interest income on cash deposits and $12.7 million of financing expenses. MSR fair value increased $163 million during the quarter, driven by higher mortgage rates, resulting in expectations for lower prepayment activity in the future. These fair value gains combined with similar performance from the interest rate hedges held in PMT's taxable REIT subsidiary, resulting in a provision for tax expense of $78 million. PMT's corporate segment includes interest income from cash and short-term investments, management fees and corporate expenses. Excluding market-driven value changes and the related tax impact, PMT reported $46.5 million of net income across its strategies. All other CRT term notes contain the option to extend the maturity for two years at PMT's discretion, except $233 million of notes due in December of this year."
}