{
    "symbol": "COWN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 17:07:04",
    "content": " Looking at the current quarter, U.S. equity trading volumes in April have pulled back a bit from the strong activity, but our markets business remains active, generating almost a little more than 3 million a day in average trading volumes well ahead of the 2021 full year average. I guess I'm trying to think about the go forward in terms of the earnings algorithm, like what's the expectation in terms of how much share count shrink we could expect, just given the amount of excess capital as well as the monetization events that are likely on the\n Yes. And so again, I don't think our advisory business given the acquisitions we've made and the product capabilities we have is not going back to where it was pre the SPAC sort of the SPAC boom because we have a whole slew of new clients now that are looking for advice even if they're not doing SPACs. And as a result, when you look at who's trading them and who's likely to trade them in our conversations, these are people who are very fast in the equity market or in the macro market, clients who are already talking to and they're looking for ways to express their investment thesis using cryptocurrencies or investing in things where they think there's extensibility, the same way they might make equity investments. And when we think about the regulatory environment here, if you read what people have been talking about, we think there's going -- it's going to follow a similar path to the regulatory environment that we've seen for equities, which is that exchanges can do what exchanges do, firms like Cowen who are equity execution and prime brokerage and things like that will do what they do and custody will be its own thing. And so we're just -- I would say that we look at the mandates that we have, there's going to be back-ended in this year as we -- as people get closer and closer to having to do their capital raises. I think you can continue to see us to focus on end markets, we think there's continued growth that are both accessible and -- addressable and accessible, right, for Cowen. And what I like about what's happening at Portico and what's happening every day at Quarton is that the pitches include both M&A advisory and Capital Markets Advisory so that if sponsors are looking to do stable financings or they're looking to do a dual track where maybe they're going to try to sell the business or look at doing a cash-out refi, we have the ability to execute on both of those. And when you think about our build out, everybody knows that we're tied more to the equity capital markets calendar because we focus on things like disruptive growth and raising equity, which is what Cowen has been historically really good at."
}