{
    "symbol": "CBRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 13:08:02",
    "content": " Examples of these statements include our expectations regarding CBRE's, future growth prospects, including our 2022 outlook, operations, market share, capital deployment strategy, investments and share repurchases, financial performance, foreign exchange impacts, cost management, the business environment, and any other statements regarding matters that are not historical fact. In addition, as expected and previously communicated, we completed far fewer development asset sales this year than in last year's strong third quarter, mostly driven by the front end loading of asset sales this year. Our combined property sales and debt origination businesses grew by 79% in last year's third quarter, driven by a resurgence of activity following the brief 2020 recession. Additionally, advisory operating expenses increased by $47 million or 10%, with the majority of the increase due to hiring that occurred in late 2021 or early 2022 as we prepared for a more robust growth environment and higher employee compensation reflecting a tight labor market. While we began reducing operating expenditures during the third quarter, which shows the lowest year-over-year growth in OpEx since Q1 2021, only a fraction of our cost-cutting program was implemented during Q3, and thus did not fully reflect the impact of those reductions. GWS' segment operating profit margin on net revenue was 11%, excluding the impact of Turner & Townsend, down from an unusually strong third quarter of last year. You'll remember last quarter, we told you 75% of the REI segment's total operating profit will be realized in the first half of the year due to the cadence of our development asset sales. Our development business realized $17 million of operating profit against $100 million in the prior year, reflecting fewer asset sales during the third quarter. Within our REI segment, we believe we have realized approximately 90% of our full year segment operating profit, largely due to the expectation of a few development asset sales in the fourth quarter. And I want to stress again something Emma said, we have a massive amount of our cost basis that flexes automatically when revenues go down, commissions, profit sharing and development and investment management, incentive equity, bonuses, all of that is completely independent of this $400 million, $300 million of which we think will be permanent and $100 million of which we think will come back when things get better."
}