{
    "symbol": "CBRE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:57:02",
    "content": " Examples of these statements include our expectations regarding CBRE's future growth prospects, including 2022 qualitative outlook, operations, market share, capital deployment strategy and share repurchases, financial performance, including net leverage, profitability, expenses, and effective tax rate, the business environment and the effect of the COVID pandemic and geo-political tension, the integration and performance of acquisitions and other transactions and any other statements regarding matters that are not historical fact. Continuing recent trends industrial revenue rose strongly, while the omicron variant pose continued challenges, we were encouraged to see global office leasing improved significantly from last year's COVID suppress level and fall modestly short of the Q1 peak set in 2019. Our investment management business also turned in a strong performance in Q1, while operating profit declined by $9 million versus same period last year. You may proceed with your question. We're also increasingly focused on driving capital and resources into areas of our business with secular benefit and we're really well positioned to do that because we have such a strong base of operations across the four dimensions we talk about; product type, service type, client type, and geography. So we're relatively bullish about what's going to happen with values for both multifamily and industrial assets at the same time we're very aware that if there is a recession, if  do take up, if debt becomes more expensive which it will, there could be a period of time when the buyers and sellers go to the sideline, and that's baked into our thoughts about where we're headed for this year and next year. You may proceed with your question. You may proceed with your question. Ironically, when you look at what's happened to our business over the last two or three years during the COVID area – era, everybody knows that we faced secular headwinds in the office building part of our business, which is a big part of our business. You may proceed with your question."
}