{
    "symbol": "PDFS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 11:22:01",
    "content": " Bookings of Exensio in the quarter included an eight-figure contract with a large integrated device manufacturer to renew cloud-hosted manufacturing analytics for a number of additional years and to add deployment of test operations for both the customersâ\u0080\u0099 internal test and multiple assets , which enables this customer to leverage the platform benefits. This included additional revenue from organic growth and Gainshare at 28-nanometer volumes at multiple customers, particularly in China, and grew substantially for the third quarter. China revenue in the third quarter of this year is up 80% over last yearâ\u0080\u0099s comparable quarter, primarily due to Cimetrix licenses, Exensio and Gainshare even after adjusting for onetime Gainshare in Q3. The largest deal for the third quarter was a multiyear $10-plus million Exensio deal with revenue recognition over time, which we believe has the opportunity to expand over the contract term and sets us up well for renewal from future elevated levels. But what is not included are the pieces that we alluded to, which is what we call shadow backlog, which is really the Gainshare that would come in the future periods, which could also be the second piece of run-time licenses for Cimetrixs where we just get a customer order and fulfill it within the quarter. Thereâ\u0080\u0099s been a growing backlog on that over these last few quarters, including in the third quarter, we believe as customers, as I said in my prepared remarks, are not able to ship all the equipment they would have liked to have shipped in the quarter, probably due to the chip shortage. But that backlog as a percentage of the total quarterly revenue is not like the Exensio business, where backlog is much greater than quarterly revenue because it represents most contracts are two or three or four years on like, so backlog at any given time is a very substantial part of the Exensio more than exceptional quarterly revenue many times over."
}