{
    "symbol": "LYFT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 21:19:06",
    "content": "  Operator: Good afternoon, and welcome to the Lyft Fourth Quarter 2022 Earnings Call. At this time, all participants are in listen-only mode to prevent any background noise. Later, we will conduct a question-and-answer session and instructions will be given at that time. Welcome to the Lyft earnings call for the quarter and fiscal year ended December 31, 2022. Joining me to discuss Lyft's results and key business initiatives are our Co-Founder and CEO, Logan Green; Co-Founder and President, John Zimmer; and Chief Financial Officer, Elaine Paul. A recording of this conference call will be available on our Investor Relations website at investor.lyft.com, shortly after this call has ended. I'd like to take this opportunity to remind you that during the call, we will be making forward-looking statements. This includes statements relating to macroeconomic factors, the performance of our business, future financial results, and guidance, the impact of our cost reduction initiative strategy, long-term growth, and overall future prospects. In particular, those described in our risk factors included in our Form 10-Q for the third quarter of 2022 filed on November 8, 2022, and in our Form 10-K for full year 2022 that will be filed by March 1, 2022, as well as risks related to the current uncertainty in the markets and economy. All forward-looking statements that we make on this call are based on assumptions and beliefs as of the date hereof, and Lyft disclaims any obligation to update any forward-looking statements, except as required by law. Information regarding our non-GAAP financial results, including a reconciliation of our historical GAAP to non-GAAP results, may be found in our earnings release, which was furnished with our Form 8-K filed today with the SEC, as well as in our earnings slide deck. I would now like to turn the conference call over to Lyft's Co-Founder and Chief Executive Officer, Logan Green. Today, I'm going to cover the team's Q4 performance, important updates to our non-GAAP financial measures as well as our Q1 expectations. But first, I want to reflect on the progress we made in 2022. I'm appreciative initiative of the team's execution in a challenging year, we took important steps to strengthen our business and deliver significant value to our customers. Millions of people used Lyft to take trips, to get to work, vote, attend events, and connect with friends and family. Upfront information is a major advancement to the driver experience, and our work in other areas, including with Lyft maps, is competitively, differentiating and delivers value valuable marketplace efficiencies. Additionally, by integrating services for car owners into the Lyft App like roadside assistance, parking and maintenance, we can deliver even more value to the roughly 75% of Lyft riders who have a car. Before I move on to our financial results, I want to highlight two items from the press release. First, we've updated our definitions of contribution and adjusted EBITDA to include reserve adjustments for prior periods. And in Q4, we took action to strengthen our insurance reserves by $375 million which given the definition change, affected our reported results. Now, let me talk about Q4. We saw important tailwinds in rideshare, including strong demand and more drivers organically using Lyft. Revenue was the highest in our company's history, and our results beat our outlook on every metric excluding the action we took to strengthen our insurance reserves. We had 20.4 million active riders, which was the highest level in nearly three years, and revenue per active rider reached a new record. In particular, the airport use case reached another new high at just over 10.4% of rideshare rides with the absolute number up 25% versus Q4 of 2021. Additionally, on the enterprise side, managed bookings grew by more than 60% year-over-year and set a new record with continued strong adoption of our B2B offerings, particularly in the healthcare and retail verticals. In Q4, we are the most active drivers on our network in nearly three years, reflecting healthy organic tailwinds. And across the US, our average rideshare ETAs improved. Even with these tailwinds, our marketplace was running hot in Q4, demand outstripped supply, and prime time went into effect more often than we would have liked. As a result, our conversion rates, meaning the share of ride intents that convert to rides taken, came down quarter-over-quarter. This dynamic contributed to revenue and adjusted EBITDA, exceeding the high end of our outlook, excluding the increased insurance reserves. Going forward, we're prioritizing competitive service levels to maximize long-term growth and retention. Next, I'm going to address our Q1 guidance. As we've shared before, our business faces pressures in the first quarter of the year, both in terms of ride share as well as bikes and scooters related to colder weather. Second, prime time is coming down dramatically quarter-over-quarter because of increased driver supply. This reduction in prime time is good for our service levels, but will reduce our Q1 revenue and adjusted EBITDA. In January, we slightly reduced base pricing to remain competitive with the industry. Given the combination of these factors, we anticipate Q1 revenues of roughly $975 million, relative to Q4, this is a decline of approximately $200 million. About one third of the sequential decline is due to seasonality, while the remainder is due to less prime time and lower base prices. This is obviously not the level of growth or profitability we are aiming for or capable of, and we are laser focused on driving additional growth and managing costs. Relative to three months ago, the competitive dynamics changed. To take advantage of this opportunity and grow the market, we must prioritize competitive service levels. We are assessing the impacts of these changes and are actively reviewing adjustments to the business, including cost cutting measures. Stepping back, the fundamentals of the business are strong. We're seeing healthy rider demand, and our driver supply position has significantly improved. We believe these conditions, paired with cost cuts, will ultimately enable us to build of a larger healthier business. To begin, I want to note that unless otherwise indicated, all income statement measures are non-GAAP and exclude stock-based compensation and other select items as detailed in our earnings release. A reconciliation of historical GAAP to non-GAAP results is available on our Investor Relations website and may be found in our earnings release, which was furnished with our Form 8-K filed today with the SEC. Excluding the action we took to strengthen our insurance reserves, our Q4 financial results beat our guidance. This reflects a combination of strong ride share demand, improving supply, and good early progress on our cost reduction. In Q4, we reported record revenue of $1,175 million, up 12% sequentially and 21% year-over-year. This was the highest quarterly revenue in Lyft's history, and it exceeded the top end of guidance of $1,165 million. As Logan mentioned, our Q4 results reflect our marketplace dynamics, including elevated prime time. For full year 2022, our revenue reached a new high of $4,095 million, up 28% versus full year 2021. Within active riders, the sequential increase in rideshare riders more than offset reduced use of our bikes and scooters in the colder weather, and revenue per active rider reached a new high of $57.72, up 11% sequentially and year-over-year reflecting more prime time and longer rides. As Logan mentioned, we are now including insurance reserve adjustments for prior periods in our definition of contribution and adjusted EBITDA. In December, the SEC updated its guidance related to non-GAAP measures, which applies to all public companies. In Q4, we strengthened our insurance reserves by $375 million. This is at the high end of management's estimate of our potential exposure to past claims in light of past volatility, we believe this action will have the benefit of reducing the risk of insurance related volatility going forward. We reported Q4 contribution of $414.7 million, including $225 million of the reserve increase just discussed. Excluding this item and relative to our guidance, Q4 contribution was $639.7 million and contribution margin as a percentage of revenue was 54.4%, which is 290 basis points better than our outlook. As a percentage of revenue, operations and support was 8.1%, down roughly 250 basis points from Q3 and 260 basis points from Q4 â\u0080\u009921. Sequentially, in addition to the impact of cost savings initiatives, the decline in operations and support expense reflects seasonally less bike and scooter support. These modes typically have peak usage and support in Q3, which declines in Q4 and further in Q1 along with winter weather. R&D expense was $103.5 million, as a percentage of revenue, R&D was 8.8%, down roughly 140 basis points sequentially and 150 basis points year-over-year. Sales and marketing were $114.4 million, as a percentage of revenue, sales and marketing was 9.7%, down 150 basis points from Q3 and 190 basis points from Q4 of â\u0080\u009821. Within sales and marketing, incentives were 2% of revenue. We reported G&A expense of $379 million, this includes $150 million of the $375 million insurance reserve increase that I discussed earlier, and it's related to certain insurance costs that are generally not required under T&C regulations. Excluding the impact of this action and relative to our outlook, G&A was $229 million in Q4, which is 19.5% of revenue, down 110 basis points from Q3 and 280 basis points from Q4 of â\u0080\u009821. In November, we spoke to this work in detail and shared our expectation that it would result in roughly $350 million of annualized savings when fully in place. In Q4, these initiatives resulted in incremental OpEx savings of roughly $20 million, sequentially reflective of a partial quarter impact of the reduction in force. In Q1, we expect to realize an additional $40 million in savings versus Q4 â\u0080\u009922. In Q4, we reported an adjusted EBITDA loss of $248.3 million, including the $375 million insurance reserve adjustment. Excluding this impact, we generated positive adjusted EBITDA of $126.7 million, which beat the top end of guidance of $100 million. We ended Q4 â\u0080\u009822 with unrestricted cash, cash equivalents and short-term investments of $1.8 billion, in line with the level at the end of Q3 â\u0080\u009822. Before I move to our outlook, it's important to note that macroeconomic factors are impossible to predict with any certainty. As Logan mentioned, there are three key factors affecting our outlook relative to Q4. First, seasonality, we tend to see a different mix of rideshare. Second, rapidly improving supply conditions are resulting in less prime time. This is ultimately good for our service levels, but will reduce our revenue and adjusted EBITDA in Q1. Given these factors, we expect Q1 revenue of approximately $975 million which is down 17% sequentially. Our Q1 revenue guidance implies year-over-year growth of 11%, driven by growth in rideshare rides. In terms of profitability, we expect contribution margin of roughly 47%, reflecting lower prime time in prices. The decline in prime time and base prices flows directly to the bottom line, with the remainder driven by the seasonal component. As Logan mentioned, and I want to reiterate, our profitability in Q1 is a consequence of the dynamics we are facing, and we are taking immediate action to improve our future financial results. As one example, let me speak to stock-based compensation expense. We expect stock-based compensation will vary, but generally come down quarter-to-quarter as we progress towards this target. To conclude, we are facing near term financial headwinds driven by current market conditions. However, with more demand and better supply and a healthier marketplace overall, we can build a much larger business. This, in combination with the cost actions we are taking, will position us to deliver strong shareholder returns. We have three key business initiatives this year, each of which aligns with our strategy to deliver our competitive service levels and capture more demand. First, strengthen our marketplace technology to drive improvements in price and ETA. Second, deliver more value to a growing population of Lyft loyal riders and third, create more opportunities for consistent and transparent driver earnings. Today, over 60% of our rideshare rides are powered by our in-house mapping and navigation, which is up from less than 1% a year ago. It's the reason why we were the first to market to integrate our driver app with CarPlay and with Android Auto, which has been incredibly well received by the driver community. I got to drive on New Year's, and I can see why almost two thirds of drivers who Lyft Maps through Apple's CarPlay stick with it as their primary navigation experience. It's a big win for the driver to have turn by turn directions on the in car or display, and also creates nice route visibility for the rider. Next, I'm going to touch on our partnerships, which give riders more reasons to use Lyft and directly impacts their loyalty and frequency. In Q4, we expanded our relationship with Chase, giving their millions of card members access to Lyft Pink and to accelerated points or cashback when they use Lyft through 2024. With this partnership, we can introduce millions of people to Pink, increase our touch points with business travelers, and capture more high value rides. Based on our experience with similar relationships, riders with linked accounts take on average up to 20% more rideshare rides with Lyft than those with non-linked accounts. For drivers, we're doubling down on initiatives that increase preference. As Logan mentioned, upfront info is now available on 100% of rideshare rides on our network. This is one of the biggest changes we've ever made to the driver experience, and it has been incredibly well received, resulting in a meaningful increase in the time drivers spend using Lyft. In addition, last fall we began rolling out our Stay Nearby filter, which gives drivers the ability to stay in a particular region, and the feedback has been incredibly positive. Lyft drivers can now access charging discounts at EVgo stations, with gold and platinum drivers getting as much as 45% off in certain markets. We've also made it much easier to install a level two in-home charger by partnering with Wallbox to offer a Lyft specific discount on the hardware, along with pre-negotiated rates on installation. Given the high utilization Lyft drivers have of their vehicle, driving an electric vehicle can help increase their take home earnings. The team's various innovations and partnerships enhance the value of the Lyft network, position us to deliver better service levels, and ultimately capture a larger portion of consumers transportation spend. Operator, we're now ready to take questions. And perhaps, I guess, a return to normalcy in that healthier marketplace maybe was not anticipated in your 2024 targets. Thanks for the question. But, yes, as you mentioned, the marketplace is much healthier, much more imbalance than it's been for several years. The primary thing that has changed, and I will say it happened more rapidly than expected, is the supply side. So the supply side has come back in a very meaningful way, as we talked about already on the call, some top metrics on the supply side in nearly three years. What is happening with the guidance, obviously, seasonality, which is expected in our business, both rideshare and bikes, but also price with that extreme improvement in supply, you have a lot less prime time. And then the last point I want to make is that there is a difference in timing with insurance renewals, and it's important to us to not wait for any of that to rationalize and to be smart about ensuring competitive service levels. In terms of your question about adverse, we believe that having taken the reserve that we took in Q4, we are very well reserved and that reserve is appropriate. In terms of the first quarter guidance, I guess the sequential decline that's implied here seems to be much larger than last year and even the step down in volume due to the pandemic. And can you help reconcile, I don't know, you're talking about sort of extreme improvement in price, and so I would be hoping that you would see an extreme improvement in demand also, because I think you're calling out sort of a healthy demand environment. So I guess what is happening from a ride frequency perspective, from an active rider perspective. So in terms of seasonality, I think we've seen fairly typical seasonality effects and that accounted for roughly a third of the decrease, so that was baked in and not unexpected. I think the part that we talked about, that John just talked about, the reduction in prime time was much larger than anticipated. We've been coming off of extremely tight labor market, still tracking the unemployment numbers. And so that shift, I think, is very healthy, but has and had a significant quarter-over-quarter impact. And in January, the competition reduced their prices as they eliminated the fuel surcharge. But the bottom line is that puts margin pressure on Q1, as you can see in the guidance. And then you asked a bit about, I think, active riders. Okay, I'm going to get away from the quarter and just talk about big picture issues like or ask about big picture issues like regulation. So, two things in particular, New York City and then Prop 22 in California. Thanks for the question. So in California, the Attorney General, along with the Protect App Based Drivers and Services Coalition, of which we're part of both that group and the AG, appealed the Superior Court's ruling against Prop 22, which you probably know, oral arguments were in December, and they basically have until mid-March to issue a decision. Regardless of which way the ruling goes, the next step is likely an appeal by either side to the California Supreme Court. That could then take a few months to even over a year, depending on whether the Supreme Court accepts that review. Although you didn't ask about it, in Washington State, there was a historic milestone last year where a new law was signed that did protect the independent contractor plus model. It's the model preferred by driver and notably, a labor organization. And elected officials, along with the companies, listened to drivers and work together to pass the bill. In New York, a classification bill does not seem to be a priority for either the legislature or governor this session, which ends in June. Number one, very positively, for the first time in approximately three years, the supply side has come basically into balance with demand. So there's pent-up demand, particularly at peak times, such that we don't need to necessarily coupon to get that demand. Our focus on growth will be on Pink, which is our membership program, which focuses on our most loyal users. So I'd say that's the most important area of growth in the years ahead, and we're excited about that. You've talked a fair bit about the West Coast, and obviously there's been elements of a slower return to work in the West Coast of the US. So in in Q4, the West Coast broadly was 60% recovered versus Q4 at â\u0080\u009819. If you look at a city like New York, it's more than 100% recovered, even on a rides basis. We think for the West Coast, one of the things holding it back had been supplying levels. So we do expect that as we see this broader national easing of pressure on the supply side of the market, that that's going to really benefit service levels on the West Coast. And then since you asked a little bit about kind of company spend and how that affects us, I just want to comment on our enterprise business. On enterprise, we're continuing to see that actually pick up. We're seeing the return of large events and conferences and Lyft, what we call Lyft business managed bookings grew by more than 60% year-over-year. We also, as I mentioned, have health care in our enterprise business. And so that business is scaling nicely and there's actually more markets being authorized from a regulatory perspective to use our services, which expands the addressable market for healthcare. And that Q4 was our university partnership's biggest quarter of the year, with bookings up nearly 50% year-over-year. I have a couple, one just of a historical look back. And the second one, I know in the past you've talked about sort of growing in line with the industry, et cetera. Logan, how do you think about other sort of big picture adjustments you might have to make to the platform just to ensure that you can grow at those previous rates you spoke about called six, nine months ago. So on the first question, we saw mid-20s growth for the year on the kind of overall bookings. We have a very loyal group of riders and drivers who prefer Lyft, and we need to make sure that we show up for them with competitive price and ETA for our riders and competitive pay for our drivers. The great Chase partnership and the increasing suite of benefits that we've put behind Lyft Pink, I think make it hands down the best transportation membership program out there, and we're going to keep pushing to make sure that it remains in that position. You pay $9.99, but you get $29 in value. So just to be clear that the $29 doesn't mean that we're, the individuals paying $9.99 and we're -- we have costs of $29. They ride more with Lyft, and every ride more they take with us is incremental profit for us. And we look at retention on a month over month basis, and we're seeing industry level retention for these types of membership programs. So, again, we are running the program profitably, and still users are able to get that type of value. You mentioned that 2024 target, which is helpful. Yes, there's two main things. One is that we did the reduction enforce last year, late last year. And also there's been a shift on some of our talent to international markets where your second point is more the case that individuals are primarily making cash, not equity. Hey, thanks for taking my questions. I just wanted to start with the first quarter guidance assumes that you're going to need to see a ramp and incremental margin to get towards the $1,024 million EBITDA. Can you just walk, talk about how you can balance your competitive positioning and EBITDA margin over time and if there's anything about the first quarter that's causing sort of transitory headwinds to profitability. And also want to ask quickly going back to sort of regulation, I believe in New York City, there is a proposed rideshare wage increase that recently announced. Yes, so I think, the most kind of important piece to understand as what we talked about before which is the timing of entrance renewal. I think if you look back at our earlier margins, Q2, Q3 last year thatâ\u0080\u0099s probably more instructive of a typical place for them to operate. But the market place dynamics have changed, the competitive environment is different and so we are stepping back and reassessing at this moment. On New York, you had ask about kind of the potential for pricing change, we are not party in that litigation thatâ\u0080\u0099s ongoing. Yes, broadly we expect demand growth has been healthy, I think we saw in the back half of last year and continue to see healthy demand. So I think it's hard for us to, project out much further, but I think a lot of that kind of pandemic related swings are now behind us. And we're going to be in more of a healthy steady state growth where it looks like supply growth, we'll be able to track with demand growth going forward. It's like Logan said, like much more stable growth for us. And, as you mentioned, like the swings that we saw over the past few years, are much more costly and difficult to manage through. I guess you don't want to put hard numbers on it, which I understand. Is there anything you would say, alright, this is a major change in how you look at the business versus COVID. Because of x, y, z.\n I think the major change structurally was just, the highest variable costs insurance, went up. And again, that's going up for everyone in the industry, that's the most material change. Other than that, I'd say our tools have gotten better, because we've had to manage those extreme swings, primarily from like a year plus ago. So we built all these tools for oversupply under supply that we're continuing to refine and use, on a market-by-market basis. I think it was about $61 million in â\u0080\u009922, am I right to assume that's all coming from sale of flex cars at kind of above carrying value. And in this quarter-on-quarter, we project a modest decline related to that. Something you guys are still see as an attractive business to provide your supplier or is it a function of, hey, we don't -- that supply comes back. I said still attractive because the individuals that use Express Drive, drive many hours and so it's a great high-quality lever for that type of supply. Hey, guys, thanks for taking the question. And really sorry, these are asked before just jumping on a couple of calls. And then how does this translate into driver earning sounds like you're absorbing something in  now, but how confident are you that this is kind of a onetime adjustment and not a steady erosion in unit economics that happens going forward. So on base price, just to kind of repeat what we've gone through in Q4, insurance prices went up significantly. We made a base price increase at that moment in the beginning of January, we saw our competition removed their fuel surcharge, which was a price, base price decrease. We know from years of operating in the market that riders are sensitive to price and ETA, those are the kind of the basics of service levels. First and foremost, we are always prioritizing competitive service levels that is critical for us. And we also know that we have different timing for insurance renewal, right, the majority of ours was renewed October 1. Yes, so the rider pricing is not directly connected to driver pricing. So there's no direct impact on drivers with that change, except for more sort of top line, more demand flowing through the system. So bottom line, it's always healthy for the business and healthy for drivers for us to stay competitive in the market. Great, thanks, two questions. So on Pink only towards, I'd say in early second half of last year did we kind of really relaxed that with the lower $9.99 price, which was obviously material and getting more interest versus $19.99 program, we adjusted the benefits as well to make that make financial sense. And as I said, with an earlier question, we run that program profitably. Some of the main things that we did, as we went into kind of Q4 is that we put more in app messaging just simply about the program as we got really confident in the retention levels, that we were seeing that again, or at industry levels for that type of membership program. At that point, we and when we saw that, we could do it profitably while driving $29 on average of value to the rider. We wanted to talk more about it with our users simply so we added more in app messaging, where it made sense and it worked. You also asked about how we, or if we can share kind of as a percent of maybe bookings or something revenue, we do track that. And that is one of our internal targets for yearend that we are focused on, we're not sharing that externally at this time. For us supply was impacted dramatically by the pandemic, and important for drivers is consistency of earnings. And now that we're out of the pandemic, and the rideshare industry has moved past that there's consistent earnings. And so as a macro level, it's come back, it started coming back towards the end of the year, but really, I'd say, is Q1. And so as Logan mentioned, there was a change in base price that we made. But then, as competition removed their fuel surcharge, we needed to ensure we had competitive service levels. We just want to ensure we prioritize that, that's critical in this really good opportunity that exists right now, where the market is finally back in balance, we want to ensure we make it really easy for people to choose Lyft. Yes, in terms of Contra, just to set a little context in absolute terms in Q4 incentives in contra revenue were $337 million, which was up 17% versus Q3 flat year-on-year and still below the prior peak. But as we look to Q1 with the tailwinds, we're seeing to supply we expect contra revenue incentives will be down quarter-on-quarter, both in absolute terms and on a per ride basis. However, the extent of our investment will always depend on the real time market conditions and supply demand balance."
}