{
    "symbol": "NEOG",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-05 10:49:05",
    "content": " The Food Safety segment, which now comprises approximately 70% of our total revenues, grew nicely in the quarter on a core basis, including the indicator testing category, which is the most significant and profitable piece of the acquired Food Safety business from 3M. At the segment level, revenues in our Food Safety segment were $161 million in the quarter an increase of 140% compared to the prior year and included core growth of 6%. Sales of Bacteria & General Sanitation products were mixed, up low single digits on a core basis with growth of Neogen filters and Ampio Media and AccuPoint general sanitation products, partially offset by lower sales of rapid microbial testing products, rounding out our larger food safety product categories is natural toxins, allergens and drug residues, sales of which were down slightly on a core basis. Quarterly revenues in the Animal Safety segment were $69 million, up 8% over last year's second quarter. Gross margin in the second quarter was 48.9%, representing an increase of 250 basis points from the 46.4% in the same quarter a year ago with the increase primarily driven by the addition of higher-margin business from the 3M Food Safety transaction. Adjusted EBITDA was $64 million, representing growth of 116% from the prior year quarter, driven primarily by the merger with the former 3M Food Safety division. You'll recall that in November, we updated our outlook for achieving $1 billion in revenue and $300 million of adjusted EBITDA, shifting the timing to fiscal 2025 due to changes in the macro environment and exchange rates as well as the performance of the acquired business during the first eight months of calendar 2022. Additionally, as we think about adjusted net income, we anticipate a full year effective tax rate of around 20% and interest expense for the full year of approximately $57 million. After the acquisition of the Food Safety division of 3M, approximately 95% of our total revenues come from consumable products, which we believe positions us to continue to grow despite the current level of macro uncertainty."
}