{
    "symbol": "AGRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-24 12:31:03",
    "content": " Before we start, let me remind you that todayâ\u0080\u0099s call will include forward-looking statements based on our current expectations, including statements concerning our financial outlook and financing prospects for the future; our outlook for the first half and full year of 2023; managementâ\u0080\u0099s expectations for our future financial and operational performance, including our expectations regarding the market growth of Twirla and our operating expenses; our business strategy; our partnership with Afaxys and its ability to promote growth; our product supply agreement with Nurx and its ability to make Twirla broadly in hub locations; our digital advertising campaign and its ability to promote growth; and our assessment of the combined hormonal contraceptive market generally, among other statements concerning our plans, prospects and expectations. We think the third quarter of 2022 was a breakout quarter for Agile and Twirla because we saw meaningful growth in net revenue, total demand and Twirla factory sales. Today, I believe we can answer that question with our fourth quarter 2022 performance, which we saw continued double-digit quarter-over-quarter revenue growth combined with disciplined spending and provides insight into why we are encouraged by what weâ\u0080\u0099re seeing so far in 2023. Net revenue for the fourth quarter was $4 million, which represented a 33% increase from the $3 million we reported in the third quarter of 2022. We think this is notable because we finished the second half of 2022 with momentum that contributed to full year 2022 net revenue of $10.9 million, a 165% increase over 2021 net revenue of $4.1 million. Non-GAAP operating expenses for the fourth quarter 2022 were $9.2 million, which is identical to the $9.2 million reported for the third quarter of 2022. Full year 2022 non-GAAP operating expenses were $45.5 million, a 29% decrease from the $64.4 million reported for the full year of 2021. From the end of the fourth quarter 2021 to the end of the fourth quarter 2022, factory sales increased 205% while OpEx decreased from $18.2 million to $9.2 million. To that end, in January of 2023, we reported that we expect 2023 net revenue to be in the range of $25 million to $30 million, which would represent a year-over-year growth of 129% to 175%. Cost of goods sold, or COGS, which consists of direct and indirect costs related to manufacturing Twirla solely were $1.7 million for the fourth quarter and $6.8 million for the full year of 2022 compared to $5.7 million and $10.7 million for the same periods of time in 2021. We closed out the fourth quarter and the full year of 2022 with a net loss of $3.9 million or $0.10 per share and $25.4 million or $1.18 per share, respectively, compared to a net loss of $19.5 million or $6.63 per share and $71.1 million or $29.28 per share for the comparable periods in 2021. After deducting the other income attributed to the valuation of these warrants and the one-time only non-cash charge associated with the transfer of our equipment to Corium in the third quarter of 2022, non-GAAP loss was approximately $39.8 million for the year ending December 31, 2022, or $1.84 per share. Before we open to Q&A, I want to emphasize that the entire organization remains focused on achieving our goals of growing Twirla, attaining the 2023 net revenue target of $25 million to $30 million and ultimately, generating cash flow positive. We remain confident we can accomplish these goals by: first, focusing on the five states that have the highest level of reimbursement potential for Twirla and are estimated to allow us to reach 45% of U.S. women between the ages of 18 and 24; second, continuing to cultivate the non-retail channel through every reach of the Afaxys customer network, which includes Planned Parenthoods and student health centers; third, increasing our footprint in telemedicine through our collaboration with Nurx, which has provided contraceptive options to more than 1 million patients."
}