{
    "symbol": "HEXO",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-17 13:43:06",
    "content": " Joining us today is Charlie Bowman, President and Chief Executive Officer of HEXO Corp; and Julius Ivancsits, Chief Financial Officer of HEXO. Please note that all financial information is provided in Canadian dollars, unless otherwise stated that a copy of the Q2 results can be accessed on SEDAR and EDGAR. To open the call Charlie and Julius will provide their commentary on the quarter, followed by a question-and-answer session to ensure that we get to as many questions as possible. We'll begin by detailing some of our financial accomplishments, highlight a few of our key products and operational achievements that happened this quarter, our goal is to take you along the journey to a leaner operation focused on the quality and near-term profitability. Afterwards, Julius will walk us through HEXO's financial results. First, before I just start, about nine months ago, I had an opportunity to sit down with a number of the original shareholders, none of who have sold a single share of stock. Their advice to me was once we reset the balance sheet is to take off my corporate tie and to focus on the key consumer elements of why people purchase campus high THC, price and terpenes, grow the best strains to deliver this consumer experience at the lowest price we can. So let's address this legacy balance sheet, which was my first priority. Over the past six months, our aggressive cost cutting strategy has reduced HEXO's overall debt whilst improving our balance sheet. Next, we focused on strengthening our margins with a higher value product mix, leveraging a series of intense cost reductions and pricing disciplines. Now turning to our product and operational development, we've streamlined our recreational cannabis portfolio, focusing on delivering the best consumer experience. We expanded our health and wellness portfolio by addressing unmet consumer needs that only cannabis can address, featured on our Redecan Medical Platform. We signed a long-term agreement with Entourage Health, securing a multiple channel distribution network into the medical cannabis market over the next three years. This partnership is key to expanding our health and wellness portfolio and accelerates our ability to grow the business and deliver premium cannabis products to more Canadians, but to especially our veterans. In the recreational market, we are focused on creating a unique, sensory experience by highlighting some amazing terpenes and high THC strains from our in-house developed TnT strains. These strains were released after about 20 months of research and development, which reinforces our belief that properly balanced terpenes dramatically enhanced the cannabis experience. First, next generation of products from our internal genetics program highlights total cannabinoids, high THC percentage with a wide range of terpenes. We produce some of the industry's highest THC percentage, and without a doubt, the total cannabinoid content. Furthermore, these new cultivars give us a high production yield with greater margins and the industry's leading terpenes, THC percentage, and total cannabinoids. For example, we saw the high growth potential in the pre-roll segment, specifically in the infused pre-roll area, we expanded our capacity in our Popular Straight Edge Pre-Rolls facility in Fenwick, Ontario at the end of this quarter. Capacity, and expands our product offering and capabilities it enables HEXO to deliver the preferred cannabis experience to all of our Redecan and Original Stash customers. Before diving into the financial results, I'd like to comment on one of our biggest financial challenges, cleaning up the balance sheet. As Charlie noted, the debt repayment has helped delever our balance sheet, positioning HEXO for long-term financial success. I would also like to note that despite difficult marketing conditions and intensifying competition, which has to put significant pressure on pricing, we have made the decision to maintain our fair pricing as part of taking a sustainable approach and our commitment to quality. The decline can be attributed to a number of different factors, price reductions by our competitors in our biggest markets, Ontario, Alberta, Quebec, and British Columbia leading to HEXO market share declines. Also, the revenue was impacted by returns of seasonal products due to low velocity, unavailable supply for certain demanded products and specific products being placed on hold due to pricing reductions in key Ontario markets. Lastly, we ceased recognition of cannabis infused revenue as the result of the trust operationally â\u0080\u0093 operationalizing their cannabis selling license. At the same time, our net sales declined 54% relative to Q2 2022, due to increased competition and diminished performance of HEXO brand in key markets of Ontario, Alberta, and Quebec, along with the removal of product portfolios from the divested 48North business and Zenabis brands. Looking at our adjusted EBITDA in the quarter, we saw a loss of $2.4 million, which is an increase of $1.8 million from the prior quarter Q1 2023. On the positive note, the Redecan branded sales did increase 9% from Q2 2022 as a result of the increased emphasis on the Alberta market. On a final note, I would like to thank anyone â\u0080\u0093 everyone at HEXO for their ongoing commitment and positive outlook. Before we open the floor to questions, Iâ\u0080\u0099d like to echo that the successes we achieved in the second quarter resulted from our strategic alignment, which including tackling the legacy balance sheet, stripping all non-productive processes, capitalizing on our strengths, these adjustments will continue to create a more profitable entity for the balance of the year. Finally, Iâ\u0080\u0099d like to thank all of my fellow Fenwick, Cayuga, Masson, grow sites, and all of our employees and partners for their continued commitment to our business and customers. Your line is open. So Iâ\u0080\u0099m just curious not trying to tease guidance out or anything like that, but just where you sort of think the top line erosion could go proportionately from where you are today given the dynamics in the sector. We took a hard look when the price war began last quarter, a little before the last quarter, and measured out what would be the impact to us if we actually participated, maintained that volume, revenue number â\u0080\u0093 volume and revenue, and what that would impact into our net income as it would come down and this â\u0080\u0093 it was significant. We â\u0080\u0093 youâ\u0080\u0099re talking anywhere from $5 million to $8 million loss, and it just wasnâ\u0080\u0099t something that we wanted to entertain. The consumer experience comes from THC, it becomes from total cannabinoids and it becomes from terpenes. And so our points of differentiation was to launch these high THC, high terpene strains and place them in across the different parts of Canada. In addition to our straight edge, we recognized the growth of the infused pre-roll, and we had launched our atomic sour haze into this area, and weâ\u0080\u0099ve got a series of other products coming on. So for us, it was to reset the balance sheet, to reset the operation, so that we could not provide me too products into the market, but to have truly differentiated cannabis products withstanding experience from the consumer side. It looks like though when you look at the dynamics, thereâ\u0080\u0099s pretty big swings still in working capital that are causing for some of the volatility. A large chunk of it is if you just look at trade AR from quarter-to-quarter, you see a significant drop, while it was flat from Q4 to Q1. That coupled along with, if you look at our SG&A footprint, and just overall footprint, those expenses are down quite significantly. Your line is open. Hi good morning, Charlie and Julius, thank you for taking my question. In terms of your balance sheet and your capital needs, you mentioned your ATM. For the ATM, one of the reasons that we've taken a look right now of not tapping into the ATM was during this price war that was going on for lack of better words, we needed to establish what the new baseline was going to be as we look through to what our cash consumption would be and also how low we could take our cash burn from a standpoint of our cost takeout and our savings. In addition, with the velocity of the new strains coming on, it really does reset what the balance and the business was looking like. Weâ\u0080\u0099ve been really fortunate with both our primary debt holder, which is Tilray, but then all of our partners that we work with about supporting us as we go through from a standpoint of what we would need from cash, what we would need from a standpoint of working together to ensure that we have enough cash to run the operations. And then I think most importantly is when you look at like Tilray, theyâ\u0080\u0099re not only an investor in us, theyâ\u0080\u0099re also a primary customer for us too. And as I said a number of quarters ago, the goal for our operations has always been to be self-sustained. Your line is open. So first one from me, I just wanted to get some content of what you think, the impact might be of some of the changes that OCS is making. From a standpoint of all the Boards have been really active about reaching out to us, I don't think anybody was â\u0080\u0093 I don't think anybody was surprised with the price war and the magnitude that went on in the last five months. Whereas a lot of that, especially smaller independent retailers are bleeding from a standpoint of just the plethora of retailers that are on the market right now and undercutting one another. I think from a standpoint of the â\u0080\u0093 how this takes on, what we look at it is, I can't say on the industry and the others, but we look at the discipline of the business as the business should be profitable. The business should have a point of differentiation in every product line that it brings to the market, and you should charge a fair value. Our products are all priced in a good spot where we're in a fair area, a fair price point. As far as our margins go we've done an incredible job within the operations of getting cost out to where I feel very comfortable with the statement that if we're not the, we're one of the lowest cost operators in the industry. As such, it allows you to take that volatility of when people do silliness, like get into a price war and they should be more disciplined than that. The backside of that is, if there's additional margin that comes out by the Board â\u0080\u0093 by the government, what it should allow is to take away from the illicit market, because the illicit market had a fantastic growth this past year. So thatâ\u0080\u0099s one of the key things that we work with, and hopefully, the government continues to take on is to curve this illicit market. And from a standpoint of walking us the opportunity to go through what our quarter two results are, I just wanted to say thank you."
}