{
    "symbol": "BODY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 22:06:05",
    "content": " Following Carl and Marc's prepared remarks, we'll open the call up for questions. Before we get started, I would like to remind you of the Company's Safe Harbor language. Actual future results may differ materially from those suggested in such statements due to a number of risks and uncertainties, all of which are described in the Company's filings with the SEC, which includes today's press release. Today's call will include references to non-GAAP financial measures, such as adjusted EBITDA. Okay, first, let's get caught up. On our last earnings call, we presented our expectations for the fourth quarter and our plan to continue bringing costs in line with the dynamic environment, all while we pursue our significant strategic innovation plans for 2023. 2022 was a demanding year, and I'm proud of what our team achieved despite the challenging economic backdrop and the headwinds faced by our industry. But we met or exceeded guidance in all four quarters of 2022, and we executed on our one brand strategy that we announced exactly a year ago during our 2021 Q4 earnings call. As you might remember, we made the decision to consolidate the business into one platform to focus capital allocation and centralize all our technology, marketing and content investment. In July, we initiated the migration of the openfit platform, content and subscribers into the Beachbody on-demand platform and began engineering the consolidation of the Beachbody on-demand subscription, together with our premium BODi subscription to create one simplified, but extremely compelling offer. A full nutrition section with two incredibly popular eating programs and over 1000 healthy recipes, plus a brand new positive mindset channel to help our subscribers feel great about themselves in all shapes and sizes. We completed the process of aligning headcount, technology and production spend with the business plan and reduced our nutrition SKUs and key bundle configurations known as Total Solution Packs from a 190 variations down to five. In 2022, we improved EBITDA and CapEx by $125 million, that's ahead of the $110 million target we promised earlier in the year. That dramatically increases their income opportunity, which should in turn attract more people to sign up to be BODi partners. On the last call, we also introduced our plan to reposition our company and brand to fill a major void in the industry. Because what we've learned, really since the pandemic, but especially last year, is that the majority of consumers are rejecting the premise of the Legacy Fitness and Nutrition business that runs a playbook convincing prospects that they aren't good enough until they lose the weight or get the six pack. Of the programs we launched, two of them surpassed our expectations 4 Week Gut Protocol and Fire and Flow both which focus on how you feel, while you do the programs versus focusing on the results that you achieve at the end. Overall, happiness has declined over the last 49 years, while obesity rates and lifestyle diseases have increased. That's 74% of adults, and that number is climbing. And it's primarily retraining the same cohort of people who move from one solution to the next, over and over, trying to find happiness. Once we saw this gap in the market, we were quick to organize and expand the platform to serve this new category of health esteem. This is what's been missing from the model, a comprehensive solution that fits with real life, that delivers happiness on day one, not just physical results at the end of a program. In fact, as we surfaced this new category, we discovered a bold way to help people get healthy, while they still enjoy the foods they love. We actually encourage people to eat more dessert, and that's a whole new category we're moving into with the existing products. Then we saw a dramatic period of growth when we created the category of Superfood Health Shakes, and we're now taking everything we learned from the last two decades and our observations since the pandemic and expanding the market by opening it to this holistic new category of health esteem. First, as I said, we consolidated our subscription tiers of BOD and BODi into one simplified complete bundle, we call it BODi. For an annual subscription price of $179, or around $15 month for access to our library of 120 fitness programs, or over 8,500 on demand videos that services the business model we're best known for and which is the foundation of our revenue model. Second, we've launched an ongoing series of four new workout plans each month called BODi Blocks. These are new three week programs starting the first Monday of every month, serving beginners, general overall fitness, lifting and a specific plan each month for our connected bike subscribers. The BODi Block plans are the incremental layer to appeal to the audience that's not project oriented like our P90X customers for example, but just looking for a cost efficient and effective alternative to joining a gym or hiring a personal trainer with the flexibility to take time off during the month. Our partners use that monthly cadence of new BODi Blocks to start a new wave of subscribers every month, rather than only when a new program is launched, which was the trend of our old model. Third, we've added Positive Mindset Master classes to our platform, and it's a game changer for retention. This content makes BODi the only platform offering complete fitness, nutrition and mindset content in one subscription. This month, for instance, we're introducing a Master class called Happiness Habits with bestselling author Petra Kolber. Our Mindset Master Classes give people the tools to start with a positive mindset that enhances their experience and improves their self-esteem, as we saw from those two Feel good launches last year, when people feel good physically and are feeling good about themselves, that content has incredibly high value to subscribers and they're less likely to churn. Fourth, we're also expanding the positioning of Shakeology to not only be the first Superfood Nutrition Shake, but also the world's first Superfood Dessert, a smart dessert, if you will, with hundreds of recipes that take advantage of the incredible flavor variety of the Shakeology product line. There are tens of millions of people who may not be ready to start one of our fitness or eating plans, but who will absolutely take the logical first step of swapping their normal dessert choice for a Superfood Dessert that actually helps them lose weight and makes them feel great. And finally, all of this is driven by the powerful catalyst of changing the name of the platform from Beachbody to BODi demonstrating our commitment to our network who feel strongly that the Beachbody name was poorly aligned with our mission and holding them back from expanding their market. I can confidently add that our BODi partners are extremely enthusiastic about these initiatives, including the name change, the simplicity, the price points, and especially the addition of positive mindset content to the platform. There are also some other important operational improvements we look forward to in 2023, such as simplifying our digital experience by reducing clicks at checkout and adding alternative payment options later this year, such as PayPal and Apple Pay. These are all powerful changes that are enhancing the productivity of our proven business model, a model which has been consistently successful whenever we innovate our approach to fitness and nutrition based on our observations within our ecosystem. We're determined to help as many people as possible to achieve their goals and lead healthy, fulfilling lives, generating long-term, sustainable, profitable growth and shareholder value. We know we're executing all this in an unpredictable environment, but that's exactly when there's the most room and demand for radical transformation and BODi is taking the lead. Now let me turn it over to our CFO, Marc Suidan with the details of the quarter and the full-year 2022 results. Adjusted EBITDA was $3.5 million, compared to a loss of $26.6 million in the prior-year period. Notably, our fourth quarter results are a substantial improvement towards attaining a goal of generating profitable adjusted EBITDA on a recurring quarterly basis by the end of 2023. The actions that we implemented in 2022, coupled with our new healthless team initiatives, set the stage for sustainable revenue growth. On our third quarter call, we discussed our strategic initiatives relating to pricing, nutrition and cost reduction. With regards to pricing, and building on what Carl just shared, we introduced the new BODi pricing in September 2022. We adjusted the BODi Premium app to $179 annually from $298 and as of this month, you can only subscribe or renew on the BODi Premium app. As a reminder, the majority of our existing subscribers are involved only the basic library of all our programs at $120. Since we launched the new BODi pricing in September, our BODi subscriber file size has been growing in a healthy way. So while our overall digital subscriber base in Q4 contracted BODi is growing, additionally, we are finding that BODi subscribers have a much higher nutritional attach rate. These measures validate our vision of creating a higher value customer that is more engaged across our entire platform, including fitness, nutrition and mindset. We expect that the customer lifetime value will be higher because first, we will generate a higher initial ARPU due to pricing. Second, we will experience lower churn given the higher engagement enabled by the new fitness and mindset programming. And third, we expect that BODi customers will have higher nutritional subscription attach rates. Moving to nutrition, we expect to realize margin benefits as we continue to shift our product mix to higher gross margin products and enhance inventory management. To be clear, this is not a new product, meaning there are no additional product development costs. Simply put, this expands the existing TAM and it is complemented with hundreds of recipes on BODi to prepare Gourmet Superfood Desserts. When you enter our app, you see fitness, nutrition and mindset all at the top. Marketing continues to focus spend on variable commission partners or strict customer acquisition costs for quick payback, and we completed a restructuring this past January, resulting in a further reduction in force. In 2022, CapEx was $46 million versus $109 million in 2021, representing a 58% reduction. Our CapEx declined dramatically as we consolidated to one technology platform and one production library due to our simplification initiatives, we expect our CapEx will continue at the same level in 2023 as it did in 2022. Turning to our results for the fourth quarter, total revenue was $148 million, which was 2% higher than the midpoint of our guidance. Digital revenue was $69 million, down 16% versus last year. DAU/MAU was in line with prior-year levels at 29%, while retention improved year-over-year by 30 basis points to 96.8%. Nutrition revenue was $75 million, down 23% year-over-year. While we were disappointed with this contraction, the actions that we recently implemented, including our focus on Superfood Healthy Dessert, new packaging sizes and offering simplifications should improve our Nutritional business in 2023. Connected fitness revenue was $5 million, with approximately 3,700 bikes delivered. Our $50 a month bundle for the bike, and the BODi subscription continues to be our most popular bike skew. Starting this month, as more users transition to the BODi app, those subscribers will view the bike workout options, making it easier to market this offering to them. Gross margin was 57% of revenue for the fourth quarter, compared to 45% last year. The gross margin improvement was largely driven by revenue mix, which shifted to less connected fitness revenue in 2022. Digital gross margin was 77% for the quarter, compared to 84% in the prior year period. As we regain scale, the production costs will be spread over a larger revenue base, resulting in higher gross margin. With the focus on Shakeology via healthy dessert and the Shake & Hustle Packaging, our nutrition gross margin should improve over time. Importantly, our data shows that bike customers are very engaged in workouts and have a much lower churn rate. Total Q4 operating expenses, excluding impairment charges was $114 million declining 32% year-over-year, reflecting our aggressive cost management and the 40% reduction in headcount from January 1, 2022 to now. Our selling and marketing costs are primarily driven by partner commissions and bonuses, which are purely variable. As for our marketing spend on media, we continue to be very disciplined in managing customer acquisition cost, so it delivers a profitable LTV to CAC ratio. For Q4, we reduced G&A by 9% compared to last year as we continue to manage expenses tightly. Also in Q4, we reduced our technology spend by 42% compared to last year. You can see how our technology spend has been reduced significantly, while simultaneously delivering a transformational change in our platform. Excluding this equity comp addback, adjusted EBITDA would have been a loss of $2 million, which would have exceeded our guidance range of a loss of minus $9 million to minus $14 million and representing a 93% improvement over the prior year quarter. With respect to the balance sheet, we ended the quarter with an unrestricted cash balance of $80 million and $41 million of net debt. The existing debt arrangement has an additional facility of $25 million, which we do not plan on utilizing. Operating cash flow improved by $168 million year-over-year to negative $47 million, representing a 78% improvement. Fixed asset CapEx for 2022 was $26 million, compared to $78 million in the prior year, representing a 66% improvement. On the bike front, our new bundle strategy has allowed the company to improve inventory turns, gain very attractive long-term customers, and accelerate our cash conversion as we work through existing inventory. With regards to revenue, we are guiding Q1 revenues to be in the range of $135 million to $140 million. However, Q1 revenues for 2023 will not follow our normal cadence given that we just launched our new strategy and offering. With regard to adjusted EBITDA, we're guiding to a loss of $3 million to $6 million for the first quarter. We expect adjusted EBITDA to gradually build throughout the year, as we begin to fully leverage our cost savings midyear and see sequential revenue growth. As a reminder, the majority of our customers are subscribed to the basic BOD platform at $120, and those customers will transition to our $179 BODi platform as their subscription comes up for renewal. The new BODi customers will get significantly more value, and we have received no pushback from our partner network. Since adjusting the price in September and before launching our revamped BODi platform, the subscriber file size grew and retention improved. However, our internal forecast has prudently factored a higher level of churn from BOD to BODi due to the price increase. Although we expect subscription declines for the year, I cannot stress enough that we are focused on attracting higher value customers with a higher ARPU and believe that our Health Esteem platform on BODi will drive stronger consumer engagement and improve customer retention over time. We have dramatically simplified the business and are delivering on our One Brand strategy, resulting in significant cost reductions in a clear path to sustainable profitability in 2023. We just deployed our new Health Esteem platform, creating the only holistic Fitness, Nutrition and Mindset platform. And also, as you foresee people either renew the subscription onto BODi from the status quo or prior program, how do you foresee the ASP will play out for digital subscribers, but also on nutrition subscription as well as connected fitness, because I understand that you're trying to integrate all three components into one so that people can get access to nutrition through your Superworld dessert, but also the bike as well? What I would say is the BODi subscriber file size, if you recall, this started in the Fall of '21 is when we launched it, and it's basically our library. Right now, there's 8,500 live streaming workouts plus the 120 programs. And with what we just launched last week, we now also have the BODi Block, the new fitness programming, plus the Mindset programming, and the revamp on nutrition. So going back to September, that's when we adjusted the price down for BODi from $298 to $179. So even though I would say the majority of our customers today are still on BOD, BODi has grown in a very healthy way, and we're pretty happy with how it's tracking. As you ask, the average, let's assume the ARPU or that metric at a minimum annually would be $179. Some people may be signing up to quarterly, which is $99, right. And finally, what I would say is not only are they more engaged, more likely to renew, but we're also seeing a higher attach rate of subscription. So our vision of deploying, of attracting customers that are higher value in net seems to be really working out well with all the pilots we did and since launching on March 6. And is there a way to help us understand the renewal rate from the existing subscribers and switching to BODi, if you can help us to think through that, that would be helpful. I know that you presented a few weeks ago and you provided the margin on three different segments, Digital as well as Nutrition and Connected Fitness. Digital, I recall you mentioned it's towards 80%. So when we first increased BOD in last July from $99 to $120, it was an experiment to see how would the renewal rate be impacted. Now we're obviously monitoring very closely BOD to BODi, now superficially this may seem like a pretty big price increase, but I'll just say the biggest starts are actually people who sign up to what we call a total solution pack. And the average total solution pack before, which is basically the combination of digital and nutrition subscription was $180, and now it's $220, right. Now, to be more prudent, that's why we're not giving full-year guidance, because there's a lot of change we've deployed. To be more prudent in our internal forecast, we factored in a lower renewal rate but in general, I would say the jump is not as big on everybody as it may seem from the get go. So I really think at this point, it's a question of scale. So as soon as it starts picking up in size, and I'm talking more on the revenue size, you'd be amortizing the production cost over a bigger base, and that should bring back the digital margin into the low to mid-80s. On the Nutrition side, look, it used to be at one point, mid-60s, it went down to low-50s. Right now, it's around mid-50s. As you know, we've done a lot of things to improve our supply chain, like closing West Coast warehouse. As you can tell, it's down by more than half for the year. But most importantly, the product mix by pushing more Shakeology and reducing low margin products, that'll be the biggest beneficiary to that nutrition margin to get it closer to 60%. And also, is it optional to get on the bike or all of that is a part of sort of your program that people get on the BODi will have access to all, so which means that we'll see an uplift on Nutrition subscription as well as the connected fitness units delivered. First off, you're right. We've consolidated fitness, the eating plans and the positive mindset content into this one subscription, which comes down to about $15 a month. And you can imagine based on the number of apps out there, you'd have to have three or four apps to equate to what we're putting into this one synthesized offering. But what's beautiful about this is, for the first time now, the bulk of our subscribers have visibility to the biking content. So now that they've got visibility into their favorite super trainers doing these rides, we expect and have seen that demand for this new offering that Marc described, it will be incremental. An additional reason to do it, if you're going to have a bowl of ice cream, you might as well have a bowl of Shakeology Nice Cream at a third of the calories, higher protein, superfoods, fibers, all that good stuff for you and improve how you feel about your life. But at the same time, we do expect there will be some people who just come in for the fitness, who just come in for the eating plans, who just come in for the superfood dessert, or they just want to ride the bike and do our great rides. A couple of questions, maybe starting with the balance between a big new launch and controlling costs. Well, frankly, the launch costs are covered in the daily operating business. So now it's running the business, running it efficiently and acquiring customers efficiently into a strong LTV. This is a business model that we've seen very strong proof of concept, really, when we started testing it back in March, then again in June, another test in September and again in November that we've seen incremental benefits from this that led to the configuration, pricing and launch structure that we've had today. So we've been able to revamp and relaunch and transform ourselves, while dramatically cutting down costs. And that's all enabled by having one technology spend, one marketing budget, one production library. So this massive cost reduction was all done in a way where we're able to actually deliver more, not less, right, which should be very beneficial. And maybe just to make sure that it's clear, I think of the difference between cost cutting and efficiency. Yes, I would say it's largely complete, right. But for the most part, we're pretty close to realizing the benefits of all the cutting we've done and driving the efficiency we want. But once we started exiting that, I'd say we've pretty much set up the business to be able to run at this size. And then all the changes we're making is all about driving new growth, and thus the leverage model will create the profitability from there. What I would say is, like I just said in that previous question, we have a bit more cost to incur in this quarter for one-time costs. And then afterwards, largely at this size, we've set up the business not to burn more cash. Okay, and I guess I'm trying to understand more of the revenue assumptions you're making, given the very significant changes to the business model here. And then when we brought the -- in September, the price of BODi from 298 to 179, the reaction was very positive. They're incredibly supportive and mainly because remember, that's what I was saying earlier. When they bring in customers, they mainly start them off on what we call a total solution pack, which is both a digital and nutrition subscription. So all in, we don't think it's that big on most of our customers. Because when you take the 179, and that's like $15 a month. So from all the research and pilots we've done, we haven't seen anything that worries us the other way around. So everything we had in our vision, we're seeing play out through all the pilots and tests we've done in since our launch. Just as you think about the timeline for renewal, the 2 million digital subscribers that you ended with. There's a bit of skewing towards the first six months, because some are monthly, some are quarterly, some on a six month plan, but the majority are an annual. But overall, we'll see that 112 come through every month, all the way through March 2024. One of the things I'll say, Jon is -- Johnathan, is that the $179 does give us an advantage that we didn't have at the lower price point. And if anything goes sideways on us, we've been very conservative with the way we forecast the renewal rate. But if anything goes sideways on us, we have extra room in acquisition and intend to frankly, this is where growth can come from, that we take that extra room in the margin, in the margin of the $179 versus the $119 for customer acquisition. But again, you balance all these factors, right, because the thing we promise the market -- me the way I like to run the business is, I like to run it free cash flow positive. Then we start to make sure we're investing in growth, but not the other way around. So we're balancing these things and we're doing it in a conservative rational way, given some of the other uncertain macro factors at play. Look on the Connected Fitness one, with this new bundle we've launched, it's $1,800 upfront, financed through a Buy Now Pay Later firm called The Firm. So cash flow wise, it's actually very beneficial. Honestly, I think it's the best deal out there you could get for Connected Bike. And then really, I think now that we've launched this new BODi platform and there's so much more subscribers on BODi, they'll start seeing the bike workouts, right. Yes, the one thing I'll say, Jon, is that I'm very excited by this, you know this company like, we continue to innovate and test and learn, test and learn. And having that lever of the Connected Fitness, it's such a good customer and this rich the volume of people in our database now that they'll all have visibility to our biking content that just started on March 2. So I'm actually very excited by the prospect of the Connected Fitness business, but we're not doing it at a way that drags the business to your point. It's not a distraction, it's just an area of creativity where now we get to bring our best skills to the table and that is creating content and use cases so the people who get on that bike are going to be getting results and having a great time as they do it. And I will say, when this thing launched March 2 and people actually was the Monday the 6th that they really started to use this new content. We absolutely saw a jump, a significant jump in engagement on both the BODi platform and on the bike. And as Marc said, the consolidation of the business and the subscriptions just made this a much more efficient business model that now our network of partners we used to call them coaches, our partners have the ability to stay focused and they're not changing gears every three months. And then to the extent that the partners are going to do a lot of heavy lifting on that, is there a prioritization right, that in the first, I don't know, six months, we want them to focus more on the conversion right. Our focus is with our best customers, the current cohorts, and that's where we leverage our social media following that between corporate and our ambassadors, we got 20 million people following us, including our current subscribers. So our job is to make sure that we are surfacing the concepts, the value, the positive mindset content, the two eating plans, and all of this content, four new plans that drop every month to all of these subscribers to maximize renewal and to maximize engagement and obviously, hopefully results for those customers. But we've got this same, what we call the BODi Block construct that they get to market month after month after month with a new wave of plans dropping the first Monday of every month. First, priority, maximize sell through into the current subscriber base so that they understand the value that they're getting. And that's the business model that we've been running, really for the last 15 years. On the rebranding part, when we add up our social media followers or super trainers followers, our key coaches, it goes to well over 20 million. All right, then my follow-up would be you talked about the nutrition attachment rate. And then what happens to the -- and I know there's a bundle here, so maybe it's hard to parse out a nutrition ARPU, right. Right now, it's I mean, if you just take the numbers, it's around that 10% mark. We got to bring it back to where it was and everything we're seeing like I said earlier, the BODi file size is growing well, and the nutrition attach rate is where we want it to be, and I say that in a favorable way. And on the ARPU for nutrition, it is around, I want to say $100 to $110 a month on average for a subscription. Yes, and John, I will add, if I can add that our CRM activities are literally of my role, my top four priorities, CRM of selling nutritionals, and particularly this idea of expanding Shakeology into the healthy dessert category is one of my top four priorities. And we're seeing that through the really, that gets traction through the entire database. We've got consultants who have been helping us install what we call CRM sequences that once you install them and you understand what a five or six e-mail sequence what that productivity and return on that sequence can be, you install it and let it run. So somebody cancels or somebody lapse or pauses or changes flavor like we've got a sequence that runs, it communicates with those people in a way that now becomes predictable, additional revenue retention or additional LTV. And we traditionally see a decline in the nutrition files just from Q3 to Q4, the fact of the simplification of the business, like I said in my opening remarks, we've moved it from 190 different configurations that our prospects had to wait through to five. And we've also added a new SKU, which is 20 servings of Shakeology and 20 servings of Energize. One, it's a holistic product for people so they can get both of these things and not have pantry loading, meaning they're not going to be at the end of the month, still haven't burned through their product. It's appropriate to their consumption, but also it's a sampling opportunity. So these are all of the levers that we've been experimenting with in the back half of the year and going into the first quarter that give us a great deal of confidence that not only is the business model healthy, but we're making improvements to increase attach rate, which increases LTV. I know we went over a little bit here, but at the end of the day, the most exciting thing to take away from this call, which I hope our stakeholders see is that the hard part is behind us. So we're very excited, excited by what 2023 has in store for us. So I appreciate everybody's support to build the greatest resource for a healthy, active lifestyle in the world. This is no small undertaking, but the ultimate outcome is going to be a powerful company and business and very rewarding for everybody involved."
}