{
    "symbol": "ALIM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 08:23:04",
    "content": " On a GAAP basis we are reporting $14.6 million in global consolidated net product sales for the second quarter of 2022, a 36% increase over the same period last year. In the US segment, second quarter product revenue was $8.9 million, up 53% over the second quarter of 2021. On international business, we are reporting $5.7 million in product revenues during the second quarter, which was up over 16% from the same period last year. Importantly, end user demand in our International segment grew by over 21% compared to Q2 of 2021 and was up 9% sequentially over the first quarter of this year. As I take you through the second quarter financials, it is important to remember that consolidated net revenue in Q2, 2021 included $11 million of license revenue generated from the out-licensing of rights up to ILUVIEN for the Western Pacific, reason I will give you, comparative figures both with and without this licensing revenue. During the second quarter of 2022, our consolidated net revenue decreased 33% from approximately $21.7 million for Q2 2021 to $14.6 million for Q2 2022. More importantly, consolidated net product revenue increased 36% to approximately $14.6 million compared to $10.7 million for Q2 2021, showing continued momentum in our sales growth. US net revenue was $8.9 million for the second quarter of 2022, an increase of 53% from the $5.8 million reported in the 2021 period. As Rick shared and I want to reemphasize, US end user demand increased 45% in the second quarter of 2022 to 1,063 units compared to 731 units in the second quarter of 2021. Net revenue from our International segment in the second quarter of 2022, decreased 64% compared to Q2 2021. However, again focusing on product revenue, we saw a 16% increase in International segment to approximately $5.7 million for Q2 2022, compared to approximately $4.9 million for Q2 2021. Total consolidated operating expenses were $14.4 million in the second quarter of 2022, an increase of 12% compared to the $12.9 million reported in the second quarter of 2021, when travel and engagement with physicians in several of our key markets were still limited. We reported an adjusted EBITDA loss of just under $1 million in the second quarter of 2022 compared to positive adjusted EBITDA of $7.9 million in Q2, 2021."
}