{
    "symbol": "ALIM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 11:46:02",
    "content": " Our reported revenue of $13.6 million for the third quarter grew 11% over the third quarter of 2021, but was negatively impacted by the weakening euro and British pound sterling that reduced our reported revenue by approximately $800,000. Year-to-date, through the end of the third quarter, 2022 consolidated net revenues were $40.1 million compared to $34 million for the same nine-month period in 2021, representing 18% growth. In the U.S. segment, we saw third quarter revenues increase 27% to $8.9 million year-over-year. Our focus on increasing face-to-face interactions with customers across multiple formats continues to drive the strong performance as we saw end-user demand of 1,061 units, a record third quarter for our U.S. segment and growth of 27% over 837 units in the third quarter of last year. We reported $4.7 million in product revenue during the third quarter, down approximately 10% year-over-year. During the third quarter of 2022, our consolidated net revenue was $13.6 million, up 11% versus the prior year. U.S. net revenue was $8.9 million for the third quarter of 2022, an increase of 27% from the $7 million reported in the 2021 period. U.S. end-user demand, which represents units purchased by physicians and pharmacies from our distributors, increased 27% in the third quarter of 2022 to 1,061 units compared to 837 units in the third quarter of 2021. Total consolidated operating expenses were $15 million in the third quarter of 2022, an increase of 20% compared to the $12.5 million reported in the third quarter of 2021. After our cost structure prospectively, given the current macroeconomic environment and the lack of available capital in the public markets, we plan to limit our cash operating expenditures to less than $12 million per quarter in 2023, an approximate 15% decrease to ensure the generation of positive adjusted EBITDA and neutral to positive cash flow."
}