{
    "symbol": "FARM",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-07 13:12:01",
    "content": " As a reminder, today’s conference call is being recorded. Before we begin the call, please note that all of the financial information presented is unaudited and that various remarks made by management during this call about the company’s future expectations, plans and prospects may constitute forward-looking statements for purposes of the Safe Harbor provisions under the federal securities laws and regulations. On today’s call, management will also use certain non-GAAP financial measures, including adjusted EBITDA and adjusted EBITDA margin in assessing the company’s operating performance. The first quarter of fiscal 2022 represented the fifth consecutive quarter of sequential improvement and three critical measures for Farmer, DSD sales volume, gross margin expansion and production at our DFW facility. Sales continue to trend favorably, with total net sales up 11.4% year-over-year as volumes in both of our core channels continue to recover. We’re very pleased with the sequential improvements materializing our top line numbers and gross margin, especially considering the headwinds presented by the Delta variant and the lingering effects of the pandemic, such as inflationary freight cost, labor shortage, and other challenges, elevated coffee prices and the yet to come full normalization of consumer behaviors. Despite these challenges and the fact that we’re still operating under significantly reduced DSD volumes compared to pre-COVID levels, it’s clear that the improvements we have executed are demonstrating the leverage opportunity in our business model as market conditions gradually improve. Our gross margin is now just below 30%, despite the continued reduced volumes we’re operating under. So we’re eager to see how the business responds, once our volumes fully recover and even start to grow beyond that. We’re also seeing improvements materialize within our operating expenses, although that’s progressing slower than our gross margin recovery, primarily due to the elevated labor and freight cost. With the bulk of the turnaround initiatives behind us and volumes continuing to recover, our focus remains on rightsizing our expenses against our sales levels, prioritizing the most impactful expenses and continuing to implement new cost control procedures, such as restructuring our internal endorsing processes. With increasing green coffee prices, elevated ocean shipping and trucking freight cost, rising labor costs and shortages, both internally and those that are passed through, higher wages and increased input costs, which are largely impacting our allied products, it’s incredible to see how we’ve proactively been able to mitigate much of the headwinds to date. In today’s operating climate, any business that relies on freight and manufacturing is going to see the continued cost of goods headwinds. One of the key ways we’re improving cost is by moving products closer to our customers, driving down freight miles to offset price creep. Speaking of DFW, we’re pleased to see our DFW facility starting to fire on more cylinders. Further, we’ve leveraged our existing roasters and added an additional 7 million pounds of roasting capacity during the quarter with very minimal upfront investment. It’s great to see our efforts starting to meaningful take hold in our manufacturing capabilities, mainly because much of the margin expansion we’ve seen over the past few quarters has been driven by our footprint and network optimization initiatives. Aside from our footprint, we’re also seeing our efforts in shifting our customer and inventory mix, helping drive margin expansion. We’ve now exited a meaningful amount of less profitable Tier 5 DSD accounts and continue to look for new, more profitable ways to repurpose Tier 4 accounts. While we’re still deep in our optimization efforts, we’re starting to see the light at the end of the tunnel. Given all of the improvements we’ve touched on today and discussed over the past year, we’re particularly excited about the opportunity DFW presents for us. As we mentioned in the past, returning Farmer Bros. to its historical success in commercializing innovative products and services remains our core pillar of our growth strategy and drives additional operating leverage opportunities within our network. In addition to marketing their service capabilities beyond our current customer base, we’ve already launched pilot programs in five geographic regions. In the fiscal first quarter, we saw continued meaningful progress and material improvements throughout our business. As expected, and as we’ve communicated to you over the past few quarters, the largest DSD sales declines were from restaurants, health care, hotels and casino channels, while demand from C-stores had been impacted to a lesser degree. As Deverl mentioned, we experienced our best DSD volumes since the onset of pandemic in our fiscal first quarter and DSD sales volumes have continued to trend favorably in recent weeks as the Delta variant has subsided, and we enter our busiest time of the year. As we’ve mentioned in the past, our direct ship business was less impacted by the pandemic, given the types of customers in that channel, including our retail businesses, private label brands and third-party e-commerce platforms. Unfortunately, the fallout from the pandemic and the associated supply chain complexities put downward pressure on some of our customers’ businesses. As such, we optimized our direct ship customer base and exited several of our less profitable accounts throughout our fiscal 2020 and 2021 years, which has created tougher year-over-year top line comparisons, but it’s the right decision for the business as we look to drive profitability improvement. The good news is that the declines continue to be partially offset by rising volumes, including significant new customer wins as our newly refined sales strategy continues to produce tangible results in both the direct ship and DSD businesses. Our net sales in fiscal Q1 were $108 million, representing an increase of about $11 million or 11.4% from the prior year period. Our gross profit in Q1 fiscal 2022 was $32 million, representing an increase of $9 million from the prior year period. At the same time, our gross margin continued to expand and was 29% at quarter end compared to 23% in the year ago period. Despite the reduced volumes we’re still operating under, we essentially matched our pre-COVID gross margin from two years ago, which was 29.3% in Q1 of FY2020. While the continued gross margin expansion was driven by continued volume improvements, mainly within our DSD business, in addition to all of the developments we’ve implemented throughout our business over the past year or so. Our adjusted EBITDA in the fiscal first quarter was $3.5 million, compared to $5.7 million in the prior year period. I wanted to quickly remind everyone that our adjusted EBITDA in Q1 and Q2 of the prior fiscal year each included $7.2 million of amortized gains related to changes to our post-retirement medical plan that was sunsetted as of December 31, 2020. Our operating expenses in fiscal Q1 were $33 million, representing a slight reduction of about 2% from the prior year period. The improvement in our operating expense was primarily driven by a $5.2 million quarterly increase in net gains from the sales of two branches, which was mostly offset by a $2.5 million increase in selling expenses and a $2.1 million increase in general and administrative expenses. More specifically, the increase in SG&A expenses during fiscal Q1 was predominantly due to paying full versus reduced base salaries and the return of the 401(k) cash match suspension, that were both cost-saving actions implemented in fiscal 2020 due to the COVID-19 pandemic. Total capital spending in fiscal Q1 was roughly $2.5 million, representing a decrease of about $2 million compared to the prior year period. The decreased investment capital spending was partially offset by roughly $600,000 of higher maintenance spending compared to the prior year period, primarily associated with the purchase of coffee brewing equipment for our DSD customers as volumes improved. We expect the investments we made throughout fiscal 2021, including the initiatives around our coffee brewing equipment offering, now revived service and restoration to drive further cost savings and help mitigate some of the increased equipment prices as DSD sales recover. Our net debt, which we define as the gross amount borrowed on the revolver and term loan balances, less cash and cash equivalents, was $83 million at the end of fiscal Q1 compared to $81 million at 2021 fiscal year end. So I think, we started off 1Q pretty good and then Delta raised its head and then, I think, created some headwinds, and now it feels like it’s dissipating. And then as you saw us report, we’re continuing to see improvements week-to-week through the current quarter. And so while we don’t provide specific guidance on the COVID recovery number, because things continue to ebb and flow. And we’re seeing our ability to manage through with all the initiatives that we put into play and to all the mitigations on cost avoidance that we’re having as we manage our supply chain, ocean freight and transportation freight. So I think, the only thing I would really add to what Deverl said was that as we’ve more recently seen the Delta variant, the case counts really fall away, we’ve also seen a similar acceleration in our DSD recovery. Now, I will tell you, we will continue to see – we’re continuing to see our best weeks and in fact, we’ve seen some of our best reported days that would be the best days of sales that we’ve had since the outbreak of COVID and that continues each week as we progress through. So we’re very hopeful with all the work that everyone is doing and specifically across our country on a federal, state and local level. And then as you saw in our prepared remarks, we still see a component on channels of distribution, where they’re showing up more progressive. We still haven’t seen breakfast come back in full view in all hotels, even though hotel occupancy continues to be an all-time high. C-stores are rebounding better now that they’ve taken the coffee and tea from behind the register and put it back out into the bars, where you can have self-service again. Is this – and I know at some point, you say, we’re going to have to bring people back and – as volumes return, but that’s a pretty hefty contribution margin. We know we have to balance the health and well-being of our team members, first and foremost, which we’re doing. And that’s our trigger on putting headcount back in, plus ensuring market-by-market, where we’re working to ensure that our team members can take their allowed PTO and balance bringing new people on. So if you said the role, where you’re recruiting the most, we’re making sure that we’re bringing back and recruiting for both DSD, what we call RSRs, route service representatives and on our tech service technicians. Those are the top two job positions that we’re recruiting for right now, and we’re watching closely, because we know that our ability, first and foremost, to continue to drive more sales is get more installs and refurbs and repairs done to ensure the equipment is servicing the customer. But we will watch that, that’s – we know that, that’s a key statistic and the question you’re asking, we expect it to continue to be an area. We will not go back to the same structures that we have pre-COVID, that we’ve said to the Street. And so we’ll be a different organization as we continue, but we’ll lay our cost back in as we absolutely new to so that we can continue to grow DSD sales with the frontline. There’s a lot of pack in the prepared remarks, but could you go over some of the levers, obviously, you have pricing power, I’m not sure how often you could – how hard it is to increase price or how often. Now, first and foremost, I’ll turn this to Scott, but I want to give a couple pieces of context. We’re in unprecedented time that I haven’t seen in my 35 years and that being said, we have a team that’s positioned to drive cost savings and cost avoidance. I’d love to see our numbers if we wouldn’t had this pressure, but what that has done to us is it has shifted the conversation with our customers, to a supply conversation. One, on I’ll kind of weave it together with your last question you had about the sequential numbers quarter-to-quarter that we had from Q4 to Q1, because I think, that part of the story has been there. Obviously, we’re all kind of growing into the new labor rates that either we’re having internally, and we’re also seeing externally, so those are all pressures. But still, we’re making sure we control those costs and keep them in line with the rest of the P&L, so that we’re still getting contribution gains to the bottom. I think, it’s very true, it’s all kind of affirm it for you, is you talk about how you think we have pricing power, we can put in these fuel and freight surcharges into our business, but that it may lag a bit with the actual cost coming in the business. And I think that we’re currently in a mode, where we’re seeing those costs obviously come in and come in rapidly in some cases. So that will kind of continue and really be impacted – or kind of fully impactful by the end of the quarter, but we’re kind of in the process now, whereas the costs are really here first."
}