{
    "symbol": "IONM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-03 13:39:10",
    "content": "  Operator: Good day, everyone, and welcome to the Assure Holdings Fourth Quarter and Full Year 2022 Earnings Call. We refer you to Assure's recent filings with the SEC, including our annual report on Form 10-K for the full year for a more detailed discussion of the risks that could impact the company's future operating results and financial condition. Also on today's call, management will reference certain non-GAAP financial measures, which we believe provide useful information to investors. For a reconciliation of these non-GAAP measures, please consult the most recently filed 8-K associated with the filing of the earnings release for the year ended December 31, 2022, which is available on SECâ\u0080\u0099s website. We finished 2022 with a managed case volume of 21,557, well within our guidance, and expectations for between 21,000 and 22,000 managed procedures. This represents an increase of 24% in managed case volume over last year, a compelling metric to the underlying strength of our business. Importantly, our business remains highly scalable, with compelling unit economics, despite what have been significant reimbursement challenges that are plaguing not only the interoperative neuromonitoring industry, but the larger healthcare industry in general. Weâ\u0080\u0099re taking the actions necessary to counterbalance a challenging reimbursement landscape by exiting the shared revenue MSA model, utilizing our internal RCA function, and greatly accelerating our cash collections from commercial payers, facilities, and patients. On the revenue side, we made the prudent decision to implement a new accounts receivable, accrual, and reserve strategy during 2022. This led to a much higher accounts receivable reserve in 2022, which negatively impacted our net revenue. A bad debt charge of $17.9 million resulted in net revenues of $11 million for the year end ending December 31, 2022. During 2022, we experienced a more than 60% decrease in the Texas State arbitration rate beginning in October, which not only negatively impacted our accrual rate, but also increased our accounts receivable reserve. Additionally, collections on the COVID period during 2020, these claims were negligible, also increasing our bad debt expense. All the while, our company continued to experience accelerated cash receipts, collecting $21 million in 2022 compared to $13 million to 2021, and reducing our days to collect to 105 in 2022 compared to 209 in 2021. We're taking a pragmatic approach to accounts receivable reserves, given the challenges associated with collecting certain receivables, and persistent industry headwinds. Using this approach, we've increased visibility and substantially reduced our risk of future write-downs for uncollectible accounts going forward. The reimbursement environment was challenging in 2022, to say the least, and served as a significant negative factor for our financial results. The federal No Surprises legislation, which went into effect in January of 2022, was passed with the best of intentions, to protect consumers and provide healthcare providers with the ability to arbitrate claims where service was performed, but a fair rate was not paid. However, implementation of the legislation has been an utter failure on the part of the federal governments, as the federal agencies have faced numerous operational challenges, including a significantly higher number of claims than anticipated, which has led to lengthy times to resolve outstanding claims, and this is rampant across the entire healthcare industry. For State reimbursements, there was a significant reduction in benchmark reimbursement rates that went into effect in October, and there have been a number of challenging technical issues surrounding the inbound filing of claims. We believe the commercial insurance companies are lobbying in certain States to secure reduced reimbursement rates, causing downward pressure on our accrual rates. The reimbursement environment further supports our decision to develop internal revenue cycle management resources, which continue to be critical to our business. Smaller competitors that rely on third party billing companies are vulnerable to the current turmoil surrounding federal and State reimbursements, primarily because they don't have a framework on the tools to analyze the data or arbitrate like we do. We believe the arbitration process will ultimately lead to in-network contractual agreements with commercial insurance payers, which in turn will speed up cash flow and improve participation ranks. There is a strengthening case for industry consolidation in the near-term, and we expect to selectively pursue M&A opportunities that will help us to expand our managed case volume in 2023 2022, we extended our geographical reach to include the state of New Jersey, which historically has had a strong reimbursement profile, being among the top five in the United States. 2023, we are looking to add business in this new market, as well as expand in high-performing markets like Texas and Colorado, where we already have a significant footprint. On the cost side, in February this year, we initiated an incremental cost reduction plan that targets a further $2 million reduction in annualized operating costs. This plan is in addition to the more than $4 million in salary and workforce reductions, as well as other costs, that was introduced earlier in 2022. We have a robust infrastructure of professionals, capital equipment, and processes that serve the interoperative neuromonitoring space well, and data analytics on the back end to help us manage and improve our revenue cycle management process. Through cost-cutting and the use of analytics, we are positioned to withstand the industry challenges around reimbursement, and achieve sustained profitability and cash flow from operations during the second half of 2023. I want to point out that notwithstanding the issues around the reserve, our total cash collected has steadily increased the trailing six, 12, and 24-month period basis. Total cash collections, including MSA collections, were $27.5 million in 2022 compared to $22.7 million in 2021. Additionally, we are no longer supporting managed services agreements, required revenue shares with our surgeon partners, and we have exited the majority of these business agreements and expect to fully exit by the second quarter of 2023. As a result, we anticipate achieving and collecting an additional $200,000 or more of incremental cash receipts per month as a result of controlling all of that cash flow that is currently shared under MSAs. Importantly, we are driving higher participation rates, shortening our cash cycle, and achieving better collections. We're off to an encouraging start in 2023, with first quarter revenue collections better than our internal forecast, and headed toward what we believe will be measurable improvement. Days to pay have been reduced, and commercial payers are paying at a higher rate versus last year. While still early in the year, reimbursement rates appear to be stabilizing and possibly rebounding from 2022, and we are moving closer toward receiving a fair rate for the services we provide. Looking ahead, we are focused on aligning our costs with updated management case revenue expectations, and adding scale in favorable markets, and fixing, controlling, and reducing the cost of delivering our services. We continue to grow our procedure count, performing approximately 5,400 managed cases during the fourth quarter, an increase over the prior year's fourth quarter, and bringing our total for the year to 21,557. The fourth quarter is typically a seasonally strong quarter in our business, and we experienced a more beneficial revenue mix, with a higher proportion of patients utilizing more profitable commercial insurance programs relative to the proportion of facility patients. For the full year, we reported gross revenue of $28.9 million and net revenue of $11 million. Our gross revenue was negatively impacted by implicit price concessions of $17.9 million related to age claims, and a change in accrual rates from downward pressure on reimbursement. As John discussed, we refined our accounts receivable reserve process that now takes a more conservative approach to AR reserves. This process led to a significantly higher AR reserve in 2022, which negatively impacted our financial results, and made for a challenging comparison to the prior year. At December 31, 2022, the total accounts receivable reserve was approximately $14 million, and represents nearly 50% of our outstanding gross accounts receivable. Looking ahead, we expect a more normalized cadence to our accounts receivable reserve, and are forecasting less than $2 million of reserves for the first quarter of 2023. As John mentioned, we began to experience a decline in our reimbursement rates starting in October â\u0080\u009822, due to a revision in the Texas State benchmark, which negatively impacted revenue by $3.7 million for the year. Cost of revenues for 2022 were $15.2 million compared to $14.3 million for 2021, an increase of 6%. Importantly though, the number of managed cases increased 24% year-over-year. Through our cost-cutting measures, benefit of scale in the business from the growth and volume in tele-neurology services, we reduced our cost of delivery. In 2023, we are focused on further reducing our average cost of delivery and drive further improvement in gross margin. Additionally, we amended the useful life of certain intangible assets, resulting in an additional $3.1 million of non-cash amortization expense. When excluding these charges, normalized operating expenses were $17 million, which is nearly flat compared to 2021. Further, we continued to experience improvement in our average days to collect to 105 days in 2022 from 209 days in 2021, an important operating metric when measuring revenue cycle and use of working capital. At December 31, 2022, 86% of our outstanding accounts receivable was aged 12 months or less from date of service. In comparison, during the first quarter of 2022, just 68% of accounts receivable was part of the same category. Firstly, cash collections exceeded $21 million in 2022, and we expect them to be strong in 2023. Secondly, our plan is to be out of the MSA revenue sharing agreements by the end of the second quarter of 2023, with over 70% of the remaining MSA volume becoming wholly owned by the end of the second quarter. Fourthly, the certainty of what we will recover on revenue being realized in the cash collections, is now much more certain, and there could be upside coming out of the federal arbitration process as it starts to take effect in 2023. Fifthly, we're involved in two pieces of outstanding litigation in Louisiana during the course of 2023, with the first going to trial in July. We'll continue to focus on driving our cost of delivery to less than $1,100 per patient, including the cost of our RCM function so that we can meet the demands of lower reimbursement. We revised our practice of estimating the bad debt, and we've talked about this on some of the other calls over the course of 2022, where we started the reserve accounts receivable earlier in the process, which ultimately more expense rolled through the 2022 financials. For Q1, we're anticipating less than $2 million of bad debt, and we've really reduced our exposure on a go forward basis. I think the key issue from our standpoint, we've significantly reduced the amount per claim that weâ\u0080\u0099re going to obtain here. You're probably going to have federal claims coming through now, and we've written off so much that we don't think there's a lot of downside on the accrual rates now. As we we've struck deals with our surgeon partners, we will take over a meaningful amount of that accounts receivable as well to collect on a go-forward. But based on the information we have, we think a commercial claim will be worth probably between $22,000 and $2,400, in some cases higher. But that's probably in the range of where we are going to settle right now, down significantly from a year ago at this time, and probably down by 50% from where we were two years ago. You did a little over $5 million in the fourth quarter, and that's with exiting Louisiana and Arizona. For the quarter, yes, it's probably going to be - it will be similar to last year. You ended the year, I believe it was under $1 million. We've been - we've pretty much been, over the last couple of months, staying roughly static on the cash position. But obviously, it's more of a challenge for growth, Jim, in having limited working capital without doing something to continue to expand our business. We're not going to be able to hit our growth numbers without some additional capital, either through stimulus or equity or some additional debt on our line of credit. So, for Q1, as we discussed on the call, we're forecasting it to be less than $2 million. And one of the topics where we attempted to tackle with the reserves is to just push most of that bad debt, address it in 2022 so that are gross revenue in net revenue really do start to align moving forward. This was the first year where cash receipts, even before the write-downs, were approximating revenue. So, Jim, to your point, we're going to need to do something, but historically, revenue has far exceeded cash flow and that was our problem. This is the first time where cash flow is either approximating or potentially exceeding revenue, which is helping us. And from the end of 2021 to the end of 2022, we cut those days in half, and it went from approximately 200 plus days to 105. And so, we've either got to expedite getting the money back from the federal government, so the lawsuit, or we're going to have to go back and raise some capital in the market. And we believe there is some upside there and there will be increased upside as this process starts, at least as it starts as it's intended to be used going forward. I think the feeling from the competitors that have been at this for 20 years is, this is probably the toughest they've seen it right now in that period, but most are optimistic that things are going to turn as the year goes on. Won't be easy, but at those numbers, I think we'll be feeling much better about the business, and we've taken a number of steps in the first quarter to reduce the cost of delivery. We'll pick up additional margin by getting out of the MSA business, and it's going to be several hundred thousand dollars a month in margin that we will pick up going into Q2. I think those headwinds are going to work well for us, but the focus has got to be to continue to drive and run leaner going forward. At the same time, there are some tremendous data points that show that we are making significant improvement in our business, among those, making a significant dent in reducing the days to collect, making improvement in our cashflow, improving our corporate cash flow by almost 50% over the prior year, and total cash collections continuing to improve significantly. We just did not have - I don't think many people have visibility into the change in the arbitration rates that are going to happen at the end of the year, nor the rapid reduction in reimbursement as we saw it from â\u0080\u009821 to â\u0080\u009822. So, want to leave really the call with the fact that it was a tough year, but we are seeing improvement, and we're going to continue to work to drive our costs lower and to be able to meet the challenges of a changing market."
}