{
    "symbol": "PINS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 18:15:04",
    "content": " To help a user do a thing they already want to do is a much easier problem to solve, and that's something that we see on Pinterest that user are coming here with a clear intent -- yes, to hear for inspiration and discovery, they have a clear intent and driving that further to action, again, whether that's shopping, buying, making or doing, we think there's huge potential there. And so when I think about how we go forward on the shopping opportunities here, I think that's a really tremendous area of strength for Pinterest, is leveraging those debilities in computer vision and the visual nature of how people naturally explore a shopping journey and in really good ML and AI to personalize those what's really relevant for the specific user. So in that world, where the consumer is looking to engage in a digital manner across not just their e-commerce purchases, but a broader set of purchases, I think the way that they have engaged in shopping in the natural world, which involve much more discovery and inspiration and is much more visual, I think, just naturally plays to the strengths of Pinterest as a product and a platform. I think then in addition to that, I'd say the ability to go in just a lot more catalogs from a much broader set of players, it also really doubling down their investments, whether that's retailers or other commerce platforms, I think, gives us a lot of the right raw material to go drive that to action and as well as users being really, I think, ready to engage in a broader part of their shopping journey in a digital environment. The only other thing I'd add to it is that as we think about the way we're engaging with content creators, we see they appreciate the uniqueness of our platform as well, both it's a positive place to engage as well as the strong think that's something that both our advertisers see from us and are excited about from us. We believe we can attract content creators that are here for the specific users and environment that we have as well as the intent that they have, which is very different from other platforms where that intent may not be there or the intent is one of looking for the next entertaining video that can sometimes be harder for creators to keep up versus a platform where people are coming with an intent to either shop or make or do and that being be more enduring for those reasons and so I think that's an important part of our platform, both for advertisers, but that also creators are really noticing and allows us to play our own game there. And so, from a broader aperture perspective, it's a pretty useful way of thinking about those that are finding Pinterest content and are potential future mobile app users because they found this content through search."
}