{
    "symbol": "PINS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 20:55:03",
    "content": " The first one that I mentioned, which isn’t a brand new feature, but it’s the thing that Pinners fundamentally come to Pinterest for is we continue to invest in the quality of the recommendations and search results and I’m really proud of the team that they improved both in the last quarter. First, you called out some of the macro volatility that we saw in results around the war in Eastern Europe, any greater color you could give about the depth of pullback from advertising spend, or how volatile it was as the quarter came to an end, and whether you’re still seeing sustained weakness as we move into Q2. The reason I have confidence that it will continue is that our progress in signing joint business partnerships, which I think we’ve described in the past that we call them JBPs but they’re not contracts to spend, but their indications of intent to spend, the number of those large deals that we signed in particular with retailers grew 35% in terms of raw number year-over-year in the first quarter. In my opening remarks, I called out the second quarter as our weakest quarter, typically as people head to summer, a lot of times you’re spending more time outside and less time on Pinterest because you’re doing instead of planning. And then the last point was that we’re still facing this year-over-year growth headwind from the search algorithm change that happened in the fourth quarter and the threat of potential new headwinds from future algo changes, which is hard for us to predict in terms of timing. I think we might have mentioned earlier, we did have some creator marketing spend that we pushed out from the beginning of the year to the back half of the year as we continue to learn kind of really what works with creators and how do we create incentives that give them kind of the motivation to create content that’s really useful."
}