{
    "symbol": "RCII",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 15:57:09",
    "content": " Portfolio values for both Rent-A-Center and Acima were under pressure throughout the year, translating to an 11% pro forma year-over-year decrease in consolidated revenues to $4.25 billion with Rent-A-Center down 4% and Acima down about 16% on a pro forma basis. Skip/stolen loss rates for Acima increased 100 basis points year-over-year to 10.6% and for Rent-A-Center increased 180 basis points to 4.9%, both above our long-term expectations. Although we took steps to control costs and improve efficiency, the combined effect of lower revenues and higher losses drove over 300 basis points of adjusted EBITDA margin contraction and led to a full year 2022 adjusted earnings per share of $3.70 and compared to $5.57 for 2021. Consolidated gross margin was 50% in the fourth quarter, up 190 basis points year-over-year due to a higher mix of rental and fees revenues compared to merchandise sales in the current year period. As Mitch noted, our efforts in account management and underwriting are paying off, evidenced by our fourth quarter loss rate of 8.9% for Acima, which was down 290 basis points year-over-year and is the lowest since 8.7% in the third quarter of 2021. Fourth quarter consolidated adjusted EBITDA of $110 million was down 15.2% year-over-year with a 30.1% decrease at Rent-A-Center, offsetting 22.4% growth for Acima. Adjusted EBITDA margin of 11.1% was flat compared to the prior year period, with 470 basis points of margin contraction for Rent-A-Center, offsetting 540 basis points of expansion for Acima. Looking below the line, fourth quarter net interest expense was $26.4 million compared to $18.6 million in the prior year due to an approximately 400 basis points year-over-year increase in variable benchmark rates that affected $950 million or 70% of our total debt. Drilling down to segment results on Page 10, the Rent-A-Center business lease portfolio value was down 4.7% year-over-year, which drove a 6.8% decrease in the fourth quarter, rental and fees revenue and contributed to a 20.5% decrease in merchandise sales revenue. Adjusted EBITDA margin for the fourth quarter decreased 470 basis points year-over-year to 14.6%, primarily due to the lower revenues and higher loss rates compared to the prior year period. During the fourth quarter, GMV decreased 23.4% year-over-year, primarily due to macroeconomic pressure on consumers and the pull-forward effect of stimulus that caused a drop in application volumes for merchant partners. Adjusted EBITDA of $71.7 million was up 22.4% year-over-year, driven by lower losses and operating costs, offset by lower revenue. Adjusted EBITDA margin is expected to be in the mid-teens range throughout the year with loss rates improving throughout 2023, with continued elevated losses in the first quarter and ending the year in the 4.5% range. So, I know itâ\u0080\u0099s probably a bit difficult to parse out, but as you think about the 23% GMV decline in Acima last year, how much of that was you proactively tightening credit as opposed to sort of the pullback in demand at your retail partners, because it sounds like, at least from a doors perspective, you guys had a pretty good year."
}