{
    "symbol": "RCII",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 11:24:05",
    "content": " Second quarter revenues of 1.07 billion decreased 10.3% year-over-year due to cycling over strong results from the prior year period that included a significant benefit from stimulus programs, lower lease volume in the current year for Acima due to tighter underwriting, and the effects of lower discretionary income for consumers in the current year. Sequentially, second quarter adjusted EBITDA was up 29.5%, compared to the first quarter driven by a 515 basis point improvement in Acima margins that benefited from a reduction in the provision for delinquencies, lower loss rates, and better than expected performance on lease vintages from late 2021 and early 2022. Adjusted EBITDA margin was 12% for the second quarter, compared to 8.6% in the first quarter of 2022 and 15.7% in the prior year period. Regarding Acimaâ\u0080\u0099s performance, we believe that 24.2% decline in GMV during the second quarter was generally driven by a confluence of unique factors impacting the business this year rather than underlying fundamental trends. The combination of comping over last year's 43% GMV growth in the second quarter, due to stimulus programs and current year inflation has caused significant volatility in year-over-year trends across consumer businesses. Moving on to the Rent-A-Center Business segment, revenue decreased 3.1% in the second quarter, compared to the prior year period with same-store sales down 3.3%. For Acima, we expect continued pressure on consumer discretionary income, coupled with the lapping of extraordinary growth during the stimulus driven 2021 period will result in lower sales volume from merchant partners for the second half of the year and translates to a low 20% decline in GMV for the full-year. It doesn't have to keep growing to maintain those margins and we don't see it dropping with, especially in this environment as people trade down we think the Rent-A-Center business in the second quarter really so far this year is outperforming retail already, seeing a little bit effects of trade down there like I mentioned in my prepared comments. We'll see a step down in losses in the third quarter and then fourth quarter similar rates may tick-up a little bit in the fourth quarter relative to the third, just given the tougher credit environment, macro environment, but yes, 8% to 9.5% for the back half of the year for the Acima segment. If you could get a 5 point swing in trade down and it'd be hard to see today based on the way retail traffic is and some of the â\u0080\u0093 especially in the furniture side of things, but as the pull forward , let's say going into 2023 as you have that pull forward, kind of being less of an issue in the furniture business than â\u0080\u0093 and you have trade down, I think that's where things will start to get â\u0080\u0093 you'll start to see it on the Acima side just like we're already seeing it on our Rent-A-Center side."
}