{
    "symbol": "RCII",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:59:01",
    "content": " Consolidated adjusted EBITDA was $99.5 million with a margin of 8.6%, negatively impacted by elevated loss rates and delinquencies that we believe largely resulted from Acima underwriting practices in the second half of 2021, as well as post stimulus changes in customer payment behavior. GMV of $398 million declined 21% year-over-year on a pro forma basis, reflecting the effect of tighter underwriting, the January Omicron outbreak and cycling over strong GMV growth in the prior year period that benefited from government stimulus. And even with continued uncertainty, given the solid start to the year, progress with the changes at Acima inconsistent performance of the Rent-A-Center business segment, we are reiterating our guidance of full year consolidated revenues of $4.45 billion to $4.6 billion, adjusted EBIT of $515 million to $565 million, diluted earnings per share of $4.50 to $5 and free cash flow of $390 million to $440 million. First quarter revenues of $1.16 billion increased 11.9% year-over-year on a reported basis and decreased 5.8% on a pro forma basis, with both merchandise sales revenues and rental and fees revenues down year-over-year. GAAP loss per share was $0.08 in the first quarter compared to a diluted earnings per share of $0.64 in the prior year period, and included onetime costs related to the Acima transaction and integration. Skip/stolen losses in the Acima segment increased approximately 400 basis points year-over-year to 12.6%, driven by a return to more normalized loss rates following the wind down of government stimulus programs and higher charge off rates on poor performing leased vintages from the latter part of 2021. So really it's just a normalization, maybe 30 or 40 basis points higher than the midpoint of that range with all the growth they've had the last couple of years, but really in line, really a good quarter on the Rent-A-Center side when you think about where the portfolio ended. I would just add on to that, that there's really nothing yet that to Maureen said, except just to do a little math when you think about the 400 basis point improvement in losses as these leases from last year run through Acima. And I think -- and you think about last summer too, the third quarter last year, we were about $1.52 in diluted EPS, and I'm using the third quarter, not the first year -- the first year or second quarter last year was even higher, but obviously stimulus driven. And that's part of how, even with the tighter underwriting, as Maureen Short said, and in a in a GMV number in the second quarter similar to the first quarter that our two year GMV number still be over 20%."
}