{
    "symbol": "RKDA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 21:07:15",
    "content": " Our Q2 2022 revenues were up 175% compared to the same quarter last year, part of the increase was driven by the recognition of $862,000 in license revenue from Bioceres related to the Chinese approval of HB4 soy. Pam will provide additional insights, but it is important to note that our total operating expenses in Q2 2022 include $1.6 million in write-downs and adjustments, partially offset by a $1.1 million gain on the sale of Verdeca to Bioceres. Total revenues recognized for second quarter 2022 were $3.9 million compared to $1.4 million in second quarter 2021 for an increase of 175% and $7.1 million second quarter year-to-date, compared to $2.2 million during the same 6 months of 2021 for an increase of 217%. Product revenues generated from Zola Coconut Water sales, 1 of the brands acquired in the second quarter of 2021 accounted for the majority of the increase for the quarter and year-to-date, along with increased body care product sales and the license revenue Stan discussed briefly at the onset of the call. Research and development expenses have continued to decrease significantly as planned, $359,000 this quarter versus $1.1 million this quarter last year, and $754,000 second quarter year-to-date versus $2.3 million second quarter year-to-date for 2021. SG&A expenditures have also decreased $4.6 million in second quarter and $9 million second quarter year-to-date compared to $6.4 million and $10.4 million second quarter 2021 and second quarter year-to-date 2021 for decreases of $1.7 million and $1.4 million, respectively. Net loss attributable to common stockholders was $3.8 million in the second quarter of 2022 compared to $5.3 million in the second quarter of 2021, and $8.3 million in second quarter 2022 year-to-date compared to $3.2 million in second quarter 2021 year-to-date. I've addressed the notable variances that bring us to loss from operations and the remeasurement and sale of Bioceres stock in the first and second quarters of 2021, impacted net loss attributable to common stockholders significantly with a gain of $2.8 million and $10.2 million in second quarter and first half of 2021, respectively. So in the first quarter, if you back out grain sales, I came to about a $1.9 million revenue number."
}