{
    "symbol": "RVLV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:19:04",
    "content": " I would also like to remind you that this conference call will include forward-looking statements including statements related to economic conditions and their impact on consumer demand and our business, operating results and financial condition, our cost and inventory management, the impact of new fulfillment centers, our growth, including growth in active customers and product offerings market opportunities in related macroeconomic and industry trends are future events and our outlook for net sales, gross margin, operating expenses and effective tax rate. The spread between our inventory growth year-over-year and our net sales growth year-over-year decreased by more than 50% in the fourth quarter on a sequential basis when compared to the third quarter of 2022, and we continue to expect to exit the second quarter of 2023 with an inventory position that is balanced for growth and efficiency. Our net sales in 2022 were $1.1 billion, an increase of 24% year-over-year and reflect a compound annual growth rate of 22% for the three full years since we completed our IPO in June 2019. In 2022, our revenue retention of the prior year customer cohorts was an exceptional 97%, meaning that even if we didn't add any new customers last year, our net sales would have remained nearly flat year-over-year. I am proud of our ability to deliver 24% year-over-year growth in net sales in 2022, achieving our long-term revenue growth target in a very dynamic and fluid operating environment all while maintaining a profitable and cash-generative business that further strengthens our balance sheet to give us the flexibility to continue to invest in key initiatives to drive growth and continued market share gains. Consolidated gross margin was 51.4%, a decrease of 339 basis points year-over-year, primarily due to a lower mix of net sales at full price and deeper markdowns compared to the fourth quarter of 2021. Net income was $8 million or $0.11 per diluted share a decrease of 73% year-over-year that was impacted by the meaningful differences in our effective tax rate, the lower gross margin and growth in operating expenses that outpaced our net sales growth year-over-year. To illustrate our progress towards rebalancing our inventory position, the unfavorable spread between our inventory growth rate year-over-year and our sales growth rate year-over-year peaked at 49 points in the second quarter of 2022, decreased to 40 points in the third quarter of 2022 and decreased significantly to 18 points in the fourth quarter noted today. Now as you think about modeling net sales for the full first quarter, please keep in mind that in the back half of the first quarter of 2022 a year ago, we had an exceptionally active calendar of impactful marketing activations including the Revolve Social Club pop-up that featured special events almost every night throughout March of 2022. Selling and distribution, in 2023, we expect selling and distribution costs to represent around 17.5% of net sales for the first quarter and 17.3% of net sales for the full year, consistent with the full year in 2022. To highlight just one example, we are exploring a multimillion dollar annualized opportunity to reduce shipping costs by consolidating return shipments from some of our larger international regions and in some cases, to hold international returns in country and fulfill orders from them locally without ever returning the items to the U.S. We are continuing to track the balance between managing operating expenses while at the same time, investing in our brands and other key growth initiatives that are critical to maximizing our long-term growth potential, guided by Mike and Michael, our two largest shareholders, who own nearly 45% of our common shares, we believe this is the right strategy to drive value for shareholders over the long term. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}