{
    "symbol": "WHF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 20:05:05",
    "content": " Gross deployments were partially offset by repayments and sales of $45.1 million, primarily driven by 5 full realizations and partial sales in several credits as we look to create capacity and optimize the BDC's portfolio for higher-yielding credits we're seeing in our pipeline. As I shared on the last call, so long as our portfolio remains heavily concentrated in first lien loans, which have lower risk profiles but also lower returns than second lien loans, we expect to continue to run the BDC up to 1.35x leverage in order to help the BDC consistently earn its $0.355 quarterly dividend. Although we had strong net originations during the quarter, the fair value of our investment portfolio was $800 million at the end of the first quarter, a decrease from $819 million at the end of Q4 2021. During the first quarter, we transferred $82.7 million in investments to the STRS JV, including 6 new deals, 5 add-ons and the remaining portion of 3 deals previously transferred in exchange for cash of $57.7 million as well as $25 million in-kind investments into the JV. The JV's portfolio had an average unlevered yield of 7.9% compared to the end of Q1 -- sorry, it was 7.9% at the end of Q1, consistent with the Q4 '21 average yield of 7.9% as well, with a portfolio size at that time of $259.5 million. As Stuart mentioned earlier, we transferred 6 new deals, 5 add-on transactions and the remaining portion of 3 previously transferred deals, aggregating to approximately $82.7 million in exchange for a net investment in the JV of $25 million as well as cash proceeds of approximately $57.7 million. As of March 31, 2022, the JV's portfolio helped positions in 33 portfolio companies, with an aggregate fair value of $312.8 million compared to 28 portfolio companies at a fair value of $259.5 million in Q4 '21. As we have noted in prior calls, the yield on our investment in the JV may fluctuate period-over-period as a result of a number of factors, including the timing and amount of additional capital investments, the changes in asset yields in the underlying portfolio as well as the overall credit performance of the JV's investment portfolio."
}