{
    "symbol": "WHF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 16:53:06",
    "content": " In 2022, core net interest income totaled $35.5 million or $1.526 per share, representing a 19% increase from 2021â\u0080\u0099s core NII of $29.7 million or $1.405 per share. In Q4, GAAP net investment income in core NII was $11.1 million or $0.476 per share, which more than covered our quarterly dividend of $0.355 per share. Turning to our portfolio activity for the quarter, gross capital deployments in Q4 totaled $49.8 million, of this amount $42.1 million was funded into six new originations and the remaining $7.7 million was funded into six additional-ons to existing portfolio accounts. After $13.3 million in net mark-to-market decreases, $1.6 million in realized gains, $1.6 million of accretion and the effects of the STRS JV asset transfers, the fair value of our investment portfolio was $760.2 million at the end of Q4. Regarding dividends and as announced this morning, in addition to our normal quarterly distribution of $0.355 per share, our Board has declared a special distribution of $0.07 per share for the quarter ended December 31, 2022. The management and Board of the BDC will also examine the ongoing improved earning power of the BDC portfolio, given increases in spreads and base rates to assess whether there should be an increase in the core dividend from $0.355 per share. During the quarter, we recorded GAAP net investment income in core NII of $11.1 million or $0.0476 per share, compared with the quarterly distribution of $0.355 per share. In the fourth quarter, we recorded a decrease in net assets resulting from operations of $1.2 million, a decline of $5.1 million compared to Q3, which is primarily driven by our mark-to-market losses recognized in the portfolio this quarter, partially offset by the realized gains and investment income earned in excess of our distributions declared. Regarding the JV specifically, one portfolio company fully realized and one new asset was transferred during the fourth quarter in exchange for cash of $8 million. As of December 31 2022, the JVâ\u0080\u0099s portfolio help positions in 28 portfolio companies with an aggregate fair value of $284.3 million compared to 28 portfolio companies at a fair value of $280.9 million in Q3."
}