{
    "symbol": "WHF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 15:04:06",
    "content": " As I shared on the last call, so long as our portfolio remains heavily concentrated in first lien loans, which have lower risk, but also lower returns in second lien loans, we expect to continue to run the BDC at up to 1.35 times leverage in order to help the BDC earn its $0.355 dividend each quarter, which we have -- and weâ\u0080\u0099ve consistently distributed that dividend since our IPO. Regarding the three realizations, we earned $16.3 million, including interest in fees, which generated an aggregated IRR of 12.1% on the $48.1 million of aggregate capital invested into these first lien deals. After $7.5 million in net mark-to-market decreases, $0.2 million unrealized gains and $1 million of accretion, the fair value of our investment portfolio was $764.6 million at the end of the third quarter, down marginally from $766.5 million at the end of Q2. In the third quarter, we reported a net increase in net assets resulting from operations of $3.8 million, a decrease of $3.5 million, when compared to Q2, which was driven by unrealized mark to market losses on the overall portfolio. As of September 30, 2022, the JVâ\u0080\u0099s portfolio held positions in 28 portfolio companies with an aggregate fair value of $280.9 million compared to 32 portfolio companies at a fair value of $318.8 million as of the end of Q2. In terms of the remaining $20 million -- sorry, yes $20 million of capacity on the BDC balance sheet, we are reserving that for assets that are priced at SOFR 700 or above, and we are regularly seeing SOFR 700 on assets that are modest leverage 50% or less LTV and first lien, senior secured first lien. So, while our portfolio is currently -- I think itâ\u0080\u0099s 97% first lien, and our pipeline candidly is majority first lien right now, I would not be surprised over the next quarter or two if we were able to find a couple of good second lien investments in noncyclical companies that we thought presented compelling risk return for our investors."
}