{
    "symbol": "FSK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 13:47:13",
    "content": " During the first quarter, our net investment income was $0.77 per share and our adjusted net investment income was $0.72 per share, which was $0.08 per share above our public guidance. As many of you know, our dividend policy consists of a base quarterly dividend of $0.60 per share, coupled with additional amounts in excess of $0.60 per share during quarters where additional net investment income is generated. From wherever rates were on March 31st, 2022, all other things being equal, every 100 basis point increase in short-term rates should increase our annual net investment income by $0.19 per share, or between $0.04 and $0.05 per share on a quarterly basis. At our Investor Day, we communicated our view that in total over the next six quarters, these opportunities, depending on prevailing interest rate rates and other factors could generate up to $0.15 per share per quarter of additional net investment income. As a reminder, on our fourth quarter 2021 call, we stated that we had achieved approximately $0.05 per share of incremental quarterly run rate adjusted net investment income through two quarters. As of the end of the first quarter of 2022, before taking into account recent upward moves and interest rates, we've achieved $0.12 per share of incremental quarterly run rate adjusted net investment income. First, at the time of the Investor Day, we identified $0.04 per share of potential incremental net investment income growth on a quarterly basis, assuming we redeployed certain non-income producing assets into income producing assets. At the end of the first quarter, we've achieved $0.03 per share of this incremental net investment income growth. Over the last three quarters, we have expanded both our investment portfolio and our joint venture to generate approximately $0.07 per share of additional run rate quarterly net investment income as compared to a potential of $0. The difference between the $0.07 per share of additional run rate net investment income we have generated and the $0.09 per share of net investment income, we targeted at the time of our 2021 Investor Day relates to asset-based finance investments and our joint venture. As a result of these combined activities, we have achieved approximately $0.12 per share of incremental quarterly run rate contribution to our adjusted net investment income. Also, as I mentioned, once our ABS investments begin to generate income and our JV begins paying an increased quarterly dividend, we expect to generate an additional $0.02 per share of additional quarterly net investment income. Offsetting these positive increases to adjusted net and investment income have been the recent increases in interest rates at a slightly elevated average leverage balance during the quarter, which combined to impact us by approximately $0.04 per share at a lower weighted average portfolio yield of 8.3% as compared to 8.5% at the time of our Investor Day. From a forward-looking guidance perspective, we expect second quarter 2022 GAAP net investment income to approximate $0.70 per share and we expect our adjusted net investment income to approximate $0.65 per share, which is in line with our run rate adjusted net investment income, about which Dan spoke earlier on the call. As a reminder, the $0.05 per share difference between our GAAP net investment income and our adjusted net investment income relates to the expected accretion of our investments during the quarter due to merger accounting. In an effort to link the $0.12 per share of quarterly run rate adjusted net investment income, about which Dan spoke earlier, from the time of our Investor Day in September of last year and compared to our 2Q 2022 guidance, the key inputs are as follows; first, we begin with the $0.61 per share of adjusted net investment income we provided as guidance at our Investor Day and add $0.12 per share to that number, which equates to quarterly adjusted net investment income of approximately $0.73 per share. We lower by $0.02 per share due to a lower weighted average portfolio yield of 8.3% as compared to 8.5% at the time of our Investor Day, and we lower by another $0.02 per share to reflect a decline in fee income associated with our expectation for lower origination activity during the second quarter. These adjustments result in our current run rate adjusted net investment income of $0.65 per share, which equals our second quarter guidance of $0.65 per share. And so now, as of the end of the quarter with, I guess, three month LIBOR was just under one -- it was like 0.96 or something, so for every 100 basis points of increase in rates going forward, we believe we'll generate an incremental on an annual basis $0.19 a share of net investment income on a quarterly basis therefore between four and five."
}