{
    "symbol": "ZION",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-25 22:39:06",
    "content": " Although we did increase our incentive compensation accruals to align with a revenue outlook that now includes the effect of expected rate increases, non-PPP net interest income increased about $10 million and finally there was a $10 million charitable contribution in the prior period that weighed somewhat on that quarter. Excluding PPP loans, the yield declined 13 basis points to 3.43% from 3.56%, a portion of which is attributable to elevated prepayment penalty income recognized in the fourth quarter, but also the effect of some of our promotional campaigns and maturity of interest rate swaps. Please proceed with your question. I think we've been pretty clear that even without rate increases, we're expecting what we termed strong net interest, income growth, and as outlined in my prepared marks and on the slides and as we've noted previously, we're -- because we're asset sensitive, we expect any increase in rates from here on out to be additive to net interest income. Please proceed with your question. I think that, if the fed loses control, if they -- if inflation really gets out of hand, certainly that could, and we could see a recession that would slow things down, but I don't think that anything that we're seeing in terms of kind of the fed fund's future market suggests that we're going to see the kinds of interest rates that historically have created a lot of problem. Please proceed with your question. So if you were talking, if you were talking pre rates of moderately increasing NII, do we think about that kind of core growth and then add let, if we were to get 200 basis points of rates this year, then we'd effectively get an annualized $350 million in next year and then, so for first quarter, we'd get about a fourth of that. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}