{
    "symbol": "ZION",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-23 19:47:05",
    "content": " First, our balance sheet, which is supported by what we think is a very high quality deposit base has benefited from rising rates, resulting in growth of net interest income, exclusive of the contribution from PPP loans of more than 40% over the year-ago quarter, and 30%, when including PPP income that had a substantial positive impact a year ago, but very little effect in the current quarter. Comparing the fourth quarter to the third quarter, the single most significant difference was the improvement in revenue, driven by the effect of interest rate changes on earning assets and continued strong performance from customer related non-interest income. The yield on average total loans increased 64 basis points from the prior quarter, which is primarily attributable to increases in interest rates. Our operating account balances were relatively stable through 2022 with a slight decline in the fourth quarter compared to the third, which we believe reflects the rising value of deposits as interest rates have increased. Net interest income on the bars reflects the benefit of both loan growth and higher interest rates, while the net interest margin in the white boxes largely reflects the impact of the rising interest rate environment on earning yields, combined with our ability -- earning asset yields, combined with our ability to contain funding costs. The difference from the prior periodâ\u0080\u0099s disclosures of latent sensitivity is the shape of the curve and the accelerated pull-through of net interest income growth, which was attributable in part to our lower-than-expected deposit and funding beta as we begin to increase our deposit rates to reflect the increased value of money and the limited rate movements we have reported so far, our modeling would now estimate a deposit beta of approximately 18% compared to the beta of 5% observed cycle to date. Therefore, given the model increase in interest expense and using a stable sized balance sheet, the latent sensitivity, interest rate risk measure, indicates a decline in net interest income of about 1% in the fourth quarter of 2023 when compared to the fourth quarter of 2022. Regarding emergent sensitivity, if the December 31, 2022 forward path of interest rates were to materialize and using a stable sized balance sheet, the emergent sensitivity measure indicates a decline in net interest income of about 2% in the fourth quarter of 2023 when compared to the fourth quarter of 2022. With respect to traditional interest rate risk disclosures, our estimated interest rate sensitivity to a 100 basis-point parallel interest rate shock using a same sized balance sheet has declined by about 2 percentage points from the third quarter and about 10 percentage points from the beginning of the year. As rates have risen and downside risk to net interest income has increased, weâ\u0080\u0099ve been moderating our asset sensitivity primarily through interest rate swaps, while generally maintaining customer operating deposit balances and allowing certain rate-sensitive deposits to decline. While there will be seasonality along the way with fewer days in the first half of the year, for example, we expect that by the fourth quarter of 2023, including the latent and emergent sensitivity as well as an expected increase in loans, net interest income will be modestly higher than that reported in the fourth quarter of 2022. Our proportion of noninterest-bearing to total deposits at just over 50% is, in my opinion, kind of remarkably high, given the change -- the rapid change in interest rates, and historical levels. As reported in our comments, the majority -- in my way of thinking, the majority of our net interest margin expansion this quarter really had to do with the stability and the value of those noninterest-bearing deposits. If you look at -- if you look at what the yield is on loans in the fourth quarter of â\u0080\u009822 versus the average benchmark rates in the third quarter of â\u0080\u009822, youâ\u0080\u0099re going to get about a 45% loan yield beta, and thatâ\u0080\u0099s the difference between just measuring it on the current quarter versus the current quarter."
}