{
    "symbol": "ZION",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-24 23:38:04",
    "content": " First, as Paul will discuss in greater detail, our asset-sensitive balance sheet is benefiting from rising rates, and we're seeing that in our net interest income. We believe we are well prepared and positioned for any recession that may materialize with stronger pre-provision net revenue as a result of higher interest rates and capital that is strong relative to the risk profile of our balance sheet, particularly given the fact that much of our loan growth in recent years has been concentrated in loan types that are less prone to loss. Comparing the third quarter to the second quarter, the single most significant difference was the improvement in revenue driven by the effect of interest rate changes on earning assets and continued strong performance from customer-related noninterest income. Combined with the third quarter's loan growth, our loan-to-deposit ratio remains a very comfortable 71%, which is still about 15 basis points below the level just prior to the pandemic. Net interest income on the bars reflects both loan growth and higher interest rates, while the net interest margin in the white boxes also reflects a remixing of earning assets in the last 2 quarters toward higher-yielding assets. Regarding latency sensitivity, rate changes that were in place as of September 30, we'll work through our balance sheet and income statement over the near term and should add approximately 10% to our net interest income in the third quarter of 2023 when compared to the third quarter of 2022. Regarding emergent sensitivity, if the forward path of interest rates were to materialize, we would expect an additional 3% in net interest income in the third quarter of 2023 and when compared to the third quarter of 2022, in addition to the 10% increase from latent sensitivity. In other words, and for example, loan growth would be expected to add to net interest income beyond the latent and emergent sensitivity estimates, which consider only changes in interest rates, while the investment portfolio attrition would be expected to narrow these figures. In summary, we expect latent and emergent interest rate sensitivity, combined with continued loan growth and manageable changes in deposit volume and pricing to continue to increase net interest income over the coming year. Customer-related noninterest income was $156 million, an increase of 1% over the prior quarter and 3% over the prior year. And when combined with the changes in revenues associated with our deposit products produces an outlook customer-related noninterest income in the third quarter of 2023 or slightly increasing compared to the current quarter, up from the prior quarter's outlook of stable. A little over half of the linked quarter ACL increase can be ascribed to the buildup of reserves on existing non-PPP loans, up from 5 basis points - I'm sorry, up 5 basis points from the prior quarter to 1.10% with the remaining increase attributable to growth in the loan portfolio. And specifically, I said just due to the effects of latent and emergent sensitivity, combined, we would expect net interest income in the quarter, a year from now, to be approximately 13% higher than the current quarter. I would just add to that, that we're coming off of two or three of the biggest quarters in our history in terms of loan growth, all in areas that are - have been really focal points for our lending. So focusing on net interest income, sort of our expectation and modeling would indicate that even with an acceleration of deposit betas from where they're at or as has been noted, our deposit - all-in cost of deposits remained exceptionally low."
}