{
    "symbol": "IBCP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 16:28:06",
    "content": "  I am pleased with our second quarter 2022 performance in which we generated strong core operating results with $3.1 million growth in net interest income, a 26 basis point expansion of our net interest margin on a linked quarter basis and a $255 million increase in loans, including growth in each category of loans, as well as a $48 million increase in total deposits. Now turning to Page five, Independent Bank Corporation is reporting second quarter 2022 net income of $13 million or $0.61 per diluted share versus net income of $12.4 million or $0.56 per diluted share in the prior year period. Moving on to Page 19, non-interest income totaled $14.6 million in the second quarter of 2022, as compared to $14.8 million in the year ago quarter and $18.9 million in the first quarter of 2022. Second quarter â\u0080\u009822, net gains on mortgage loans totaled $1.3 million, compared to $9.1 million in second quarter of â\u0080\u009921. Mortgage loan refinancing applications have slowed and the mortgage production mix is rotated to a lower percentage of saleable mortgages positively impacting non-interest income was a $4.2 million gain on mortgage loan servicing, due to a $3.1 million or $0.12 per diluted share after tax increase in the fair value due to price and $1.1 million decrease due to paydowns of capitalized mortgage loan servicing rights in the second quarter of â\u0080\u009822. As detailed on Page 20, our non-interest expense totaled $32.4 million in the second quarter of 2022, as compared to $32.5 million in the year ago quarter and $31.5 million in the first quarter of 2022. Total non-performing assets or $5 million or 0.1% of total assets at June 30, â\u0080\u009922, loans 30 to 89 days delinquent totaled $3.7 million at June 30, 2022, compared to $2.3 million at December 31, 2021. Moving on to Page 24, we recorded a provision for credit losses expense of $2.4 million in the second quarter of â\u0080\u009922, compared to a provision credit of $1.4 million in the year ago quarter and a provision credit of $1.6 million in the first quarter of 2022. Loans increased $254.8 million in the second quarter of 2022 or 34% annualized, which is well above our forecasted range. Non-interest income totaled $14.6 million in the second quarter of 2022, which was within our forecasted range of $13 million to $17 million. Second quarter 2022 mortgage loan originations, sales and gains totaled $317.7 million, $143 million and $1.3 million, respectively."
}