{
    "symbol": "IBCP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 13:44:04",
    "content": "  Independent Bank Corporation reported third quarter 2022 net income of $17.3 million, or $0.81 per diluted share versus net income of $16 million, or $0.73 per diluted share, in the prior year period. This has led to strong core results in the third quarter of 2022 with $3.8 million growth in net interest income, a 23 basis point expansion of our net interest margin on a linked quarter basis and net growth in each category of loans as well as growth in total deposits including non-interest bearing deposits. I am very pleased that we are able to continue to grow deposits, which increased 3.4% during the third quarter of 2022, and now total $4.3 billion at September 30, 2022, an increase of $209.9 million from the start of the year. Positively impacting non-interest income was a $4.3 million gain on mortgage loan servicing due to a $3.2 million or $0.12 per diluted share after-tax increase in the fair value due to price and a $1.1 million decrease due to pay downs of capitalized mortgage loan servicing rights in the third quarter 2022. As detailed on Page 16, our non-interest expense totaled $32.4 million in the third quarter of 2022 as compared to $34.5 million in the year-ago quarter and $32.4 million in the second quarter of 2022. Compensation increased $1.3 million compared to the prior year quarter due to raises that were effective at the start of the year, a decreased level of compensation that was deferred in the third quarter of 2022 as a direct origination cost on lower mortgage loan origination volume, and an increase in the lending personnel. Loans increased to $151 million in the third quarter of 2022 or 18.4% annualized, which is above our forecasted range. Non-interest income totaled $16.9 million in the third quarter of 2022, which was within our forecasted range of $13 million to $17 million. Third quarter 2022 mortgage loan origination sales and gains totaled $209 million, $157.5 million and $2.9 million, respectively. Lastly, we purchased 181,586 shares, an average cost of $22.08 for the year-to-date period in 2022, but we did not purchase any shares in the third quarter as we are focused on preserving capital to increase our tangible common equity ratio and support our continued strong loan growth."
}