{
    "symbol": "IBCP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 14:52:07",
    "content": " In doing so, our first quarter 2022 performance generated strong core results with good growth in net interest income, stabilization of our net interest margin, and net growth in each category of loans and total deposits. Turning to Page 5, Independent Bank Corporation reported first quarter 2022 net income of $18 million or $0.84 per diluted share versus net income of $22 million or $1 per diluted share in the prior-year period. The decrease in the 2022 first quarter earnings as compared to the first quarter of 2021 primarily reflects a decrease in non-interest income, and an increase in non-interest expense that were partially offset by an increase in net interest income, and a decrease in the provision for credit losses. The first quarter 2022 highlights include an increase in net interest income of 9% over the first quarter of 2021, loan growth of $99 million, or 13.8% annualized and deposit growth of $88.4 million, or 8.7% annualized, a return on average assets of 1.54%, and a return on average equity of 19.38%. This falls on a strong fourth quarter of 2021 where we experienced commercial loan growth of $45 million, also excluding PPP activity. Reduction in the CET1 ratio, and the total risk-based capital ratios due to an increase in risk-weighted assets of $161.2 million in the first quarter of 2022. The increase in the base rate forecast in net interest income in the first quarter 2022 compared to the fourth quarter 2021 is primarily due to an increase in rates, which resulted in higher forecasted earning asset yields as well as higher forecasted earning asset balances. Moving on to Page 17, non-interest income totaled $18.9 million in the first quarter of 2022 as compared to $26.4 million in the year-ago quarter and $15.8 million in the fourth quarter of 2021. First quarter of 2022 net gains on mortgage loans totaled $0.8 million, compared to $12.8 million in the first quarter of 2021. Positively impacting non-interest income was a $9.6 million gain on mortgage loan servicing due to an $8.5 million or $0.31 per diluted share after-tax increase in the fair value due to price and a $0.9 million decrease due to paydowns of capitalized mortgage loan servicing rights in the first quarter of 2022. As detailed on Page 18, our non-interest expense totaled $31.5 million in the first quarter of 2022 as compared to $30 million in the year-ago quarter and $33 million in the fourth quarter of 2021. The first quarter of 2022 included $0.4 million of recoveries related to reserve for unfunded lending commitments, due to a decrease in unfunded lending commitments. Moving on to Page 22, we recorded a provision for credit losses credit of $1.6 million in the first quarter of 2022 compared to provision credit of $0.5 million in the year-ago quarter, and a provision expense of $0.6 million in the fourth quarter of 2021. Non-interest income totaled $18.9 million in the first quarter of 2022, which is higher than our forecasted range of $13 million to $17 million. First quarter 2022 mortgage loan originations sales and gains totaled $270.2 million, $221.7 million and $0.8 million respectively. Mortgage loan servicing generated a gain of $9.6 million in the first quarter of 2022, due primarily to a positive $8.5 million fair adjustment -- value adjustment due to price."
}