{
    "symbol": "LLY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 16:21:05",
    "content": " Operating income increased 66% in Q1, driven by higher revenue, primarily due to higher sales of COVID antibodies, lower R&D expenses for COVID antibodies, and to a lesser extent, lower acquired IPR&D and development milestone charges. Operating income as a percent of revenue was 33.4% for the quarter and reflects the benefit from COVID-19 antibodies revenue, as well as the negative impact of approximately 210 basis points attributed to acquired IPR&D and development milestone charges. As the bottomline, we delivered strong earnings per share growth of 63% in Q1, inclusive of approximately 1500 basis points related to lower acquired IPR&D and development milestone charges. That $0.35 reduction are non-core -- in our non-GAAP EPS range includes the 55% decrease due to the year-to-date acquired IPR&D and development milestone charges, partially offset by improved business performance of $0.20 attributable to the net benefit of Q1 bebtelovimab sales and increased investments in R&D. The -- I wouldn’t look backwardly at the fact that with that obesity agents up to this point really haven’t been able to secure good access, at the weight loss levels that you were seeing 5%, 6%, 7% weight loss. But if you are looking at a product like tirzepatide that can deliver up to 22.5% weight loss, we do believe and there’s good data out there to suggest that’s going to really improve and lead to the good health outcomes. Thanks, Mike, and Dan. First, the efficacy, as you pointed out, the more than 20% weight loss is really unprecedented level of weight loss in the field and I think that’s exciting for patients and addressing a very significant unmet medical need. Hey, just on tirzepatide, so based on your product and novo to the go, the weight loss is impressive, but with based products that still about 30% to 40% of patients who placebo who don’t achieve at least 5% weight reduction, which is quite a high percentage and it almost seems to suggest a resistance mechanism of some sort to circular. Thanks, Mike, and Dan."
}