{
    "symbol": "HRZN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:08:03",
    "content": " For the quarter, our adviser's platform funded $106 million in new debt investments across our targeted industries, including $89 million funded at HRZN. We funded 7 transactions totaling $89 million, including $84 million in debt investments, 5 new portfolio companies consisting of 3 new tech investments, 1 new life science investment and 1 new health care tech investment, providing further diversification to our portfolio. In the third quarter, we closed $194 million in new loan commitments and approvals and ended the quarter with a record committed and approved backlog of $252 million compared to $221 million at the end of the second quarter. Our portfolio's credit quality remains solid, as shown by the fair value of 97% of our debt portfolio consisting of 3 and 4-rated loans as of September 30, an improvement from the prior quarter end. While the economic environment and investor sentiment remains challenging, VC firms continue to maintain record levels of dry investment powder, nearly $300 billion, which may provide liquidity for new investment opportunities and to support existing portfolio companies. Subsequent to quarter end, on October 26, we priced a new $100 million securitization which when closed will lock in a 7.56% coupon rate, free up our KeyBank credit facility and increase our capacity to make new debt investments. For the third quarter, we earned total investment income of $23.3 million, an increase of 42% compared to the prior year period. Our divestment portfolio on a net cost basis stood at $612 million as of September 30, a 9% increase from June 30, 2022. Our base management fee was $2.8 million, up from $2 million in last year's third quarter due to an increase in the average size of our portfolio. To summarize our portfolio activities for the third quarter, net new originations totaled $89 million, which were partially offset by $5 million in scheduled principal payments and $22 million in principal prepayments. At September 30, the portfolio consisted of debt investments in 57 companies with an aggregate fair value of $609 million and a portfolio of warrant, equity and other investments in 96 companies with an aggregate fair value of $26 million."
}