{
    "symbol": "HRZN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 13:07:17",
    "content": " We grew the portfolio by $62 million, another quarterly record for HRZN, which resulted in a portfolio value at quarter end of $577 million. For the quarter, the adviser's platform funded a record $192 million in new venture debt investments spread throughout our targeted industries including a record $137 million funded by the public company. We grew our portfolio by $62 million in the quarter, a second consecutive quarterly record and finished the quarter with a portfolio of $577 million. We funded 15 transactions totaling a record $137 million including $63 million in debt investments to seven new portfolio companies consisting of four new life science investments two new technology investments, and one new health care tech investment providing further diversification to our portfolio. In the second quarter, we closed $203 million in new loan commitments and approvals and ended the quarter with a record committed and approved backlog of $221 million compared to $151 million at the end of the first quarter. As of June 30, there was $75 million outstanding under our $125 million KeyBank credit facility and $137 million outstanding on our $200 million New York Life credit facility, leaving us with ample capacity to grow the portfolio. For the second quarter, we earned total investment income of $18.6 million, an increase of 38% compared to the prior year period. Our debt investment portfolio on a net cost basis stood at $563 million as of June 30, a 13% increase from March 31, 2022. Our interest expense increased to $4.2 million from $3 million in last year's second quarter, due to an increase in average borrowings. Our base management fee was $2.5 million, up from $1.8 million in last year's second quarter, due to an increase in the average size of our portfolio. To summarize our portfolio activities for the second quarter, net new originations totaled $137 million, which were partially offset by $5 million in scheduled principal payments and $65 million in principal prepayments and principal paydowns. The portfolio consisted of debt investments in 55 companies, with an aggregate fair value of $552 million and a portfolio of warrant and equity and other investments in 91 companies with an aggregate fair value of $26 million."
}