{
    "symbol": "HRZN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 12:41:05",
    "content": " We finished the year with a committed and approved backlog of $220 million, which provides us with a solid base of opportunities to grow our portfolio in 2023. We generated net investment income of $1.46 per share, well in excess of our distribution level for the year, due largely to higher interest rates on our floating rate investment portfolio and the growth in our portfolio. I would note that last quarter, based on our strong performance and the confidence in our outlook, we increased our declared monthly distributions by 10% to $0.11 per share as well as paid a $0.05 per share special distribution for our third consecutive year. Despite continued macroeconomic headwinds in Q4, we grew our portfolio by $85 million in the quarter and $262 million for the year, ending 2022 with a record high portfolio of $720 million. In the fourth quarter, we funded 10 transactions totaling $104 million, including $73 million in debt investments to 4 new portfolio companies consisting of investments in 2 new tech companies and 2 new life science companies, providing further diversification to our portfolio. In the fourth quarter, we closed $133 million in new loan commitments and approvals while we maintained our selective approach to new opportunities and ended the year with a committed and approved backlog of $220 million compared to $252 million at the end of the third quarter. In November, we closed $100 million loan securitization with a 7.56% coupon rate, which freed up capacity in our KeyBank credit facility and increased our capacity to make new debt investments. In addition, there was only $5 million outstanding under our $125 million KeyBank credit facility and $177 million outstanding on our $200 million New York Life credit facility, leaving us with ample capacity to grow the portfolio. For the fourth quarter, we earned total investment income of $23 million, an increase of 37% compared to the prior year period. Our debt investment portfolio on a net cost basis stood at $701 million as of December 31, a 14% increase for September 30, 2022. Our base management fee was $3 million, up from $2 million in last year's fourth quarter due to an increase in the average size of our portfolio. To summarize our portfolio activities for the fourth quarter, new originations totaled $104 million, which were partially offset by $4 million in scheduled principal payments and $8 million in principal prepayments and partial pay downs. At December 31, the portfolio consisted of debt investments and 60 companies with an average fair value of $686 million, a new portfolio of warrant, equity and other investments in 100 companies with an age fair value of $34 million. Just my last question then, is kind of just a broader question on the VC lending landscape, not necessarily specific to your portfolio, but -- with the significant amount of -- with a significant decline in the level of exit activity occurring in the VC markets as well as valuations going lower, how do you foresee the level of new venture investments being made in the space, either to new companies or maybe more importantly, supporting existing companies with additional rounds of capital."
}