{
    "symbol": "HRZN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:32:03",
    "content": " Our first quarter highlights include: We grew the portfolio by $57 million, a quarterly record for HRZN, which resulted in a portfolio value at quarter end of $515 million. We ended the quarter with NAV of $11.68 per share, up $0.12 from year-end 2021 and up $0.61 from the end of Q1, 2021.We generated net investment income of $0.26 per share, below our distribution level of $0.30 per share due to a lower amount of prepayments, which is historically typical for the first quarter. For the quarter, the adviser's platform funded $132 million in new high-quality venture debt investments spread over all of our targeted industries. We funded 16 transactions totaling $73 million in the first quarter, including $47million in debt investments to seven new portfolio companies, consisting of three new technology investments, two new sustainability investments, one new life science investment and one new healthcare tech investment, providing further diversification to our portfolio. In the first quarter, we closed $100 million in new loan commitments and approvals and ended the quarter with a record committed and approved backlog of $151 million compared to $127 million at the end of the fourth quarter. First, we increased our lending capacity by $100 million on our New York Life facility while also extending its investment period. As of March 31, there was $44 million outstanding under our $125 million KeyBanc credit facility and $94 million outstanding on our $200 million New York Life credit facility, leaving us with ample capacity to grow the portfolio. For the first quarter, we earned total investment income of $14.2 million, an increase of 7% compared to the prior year period. Our debt investment portfolio on a net cost basis stood at $500 million as of March 31, a 13% increase from December 31, 2021. Our base management fee was $2.2 million, up from $1.8 million in last year's first quarter due to an increase in the average size of our portfolio."
}