{
    "symbol": "SYY",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-31 15:54:04",
    "content": " Importantly, gross profit growth this quarter outpaced operating expense, an important milestone that we expect to continue into the remainder of the year as we make progress in further improving our supply chain productivity. Number one, softer than originally budgeted market volumes in the local segment, partially offset by Sysco growing 1.35 times faster than the market in total; number two, higher than originally planned operating expenses, while steadily improving; number three, favorable GP per case and strong margin management; number four, favorable GSE or corporate expenses. Overall adjusted operating expenses were $2.7 billion for the quarter or 14.3% of sales, a 33 basis point improvement as a percentage of sales over the same quarter in the prior year. Operating expenses, we've updated for the year to reflect the current rates of productivity, which are lower than what we had originally budgeted, but as I called out in my prepared remarks, we're making steady progress, green shoots of improvement. First of all, talking about some of the operating expenses we had, as I alluded to in my prepared comments, first of all, snapback costs, which we've talked about for the past several quarters to remind you going back, we are originally about $35 million then they were reduced to $29 million then to $10 million and now very pleased for the second quarter to be down to zero in that. We've got the best trained sales associates in the industry, 5,000-plus strong in the U.S. alone, and they're very focused on penetrating lines with existing customers, and we're going to make new customer acquisition, a bigger priority for our sales reps in the second half of the year given the overall market conditions as we're seeing them. And in aggregate, what we're looking for in the revised guidance â\u0080\u0093 we provided today, the midpoint of 4.07%, just to keep in perspective is a 25% growth over prior year and it's a 15% growth over 2019, which is the peak profitability year of the company. So we updated our guidance today to reflect the fact that, yes, our operating costs in the second half of the year will be higher than what we originally budgeted, but an improvement from where we stand here today at the end of Q2 and we're seeing the progress that needs to be made in order for us to be able to deliver the full year and it has my personal full attention and the full attention of all of our leaders Neil will toss to you for any additional comments. As Neil said, we took a big step back at the midway point, turned over every rock, looked at every component of our build of the full year budget and compared it to the trends of the business performance and we applied for the second half of the year, the trends of our business with known trend vendors that we - Sysco can positively impact, the operating expense that Ed just asked about is a projected improvement in the second half of the year. So that's the first customer who's not inside a Sysco Your Way neighborhood and we're seeing significant lift in profitability and top line growth with customers that are invited into that program and we have meaningfully expanded the rollout of Sysco Your Way â\u0080\u0093 excuse me, Sysco Perks over the last quarter. On the cost side of the equation, as we talked about the impact of the labor dispute, putting that into the numbers looking at the pension expense, now that we've remeasured the plan at the midpoint of the year, knowing that that will continue forward as I mentioned, that about $15 million of expense that you saw down below the line, carrying forward again in Q3 and again in Q4. So it's about in the second half of the year, leveraging our growth initiatives, they're working and we can accelerate those initiatives of Perks, Sysco Your Way, Italian and allocation of time and our sales reps can spend more of their time with prospecting new and penetrating further with existing and we're getting better and better at that."
}