{
    "symbol": "GHM",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-06 14:00:22",
    "content": " Thank you, Sherry, and good morning everyone. Here with me on the call are Dan Thoren, our President and CEO; and Chris Thome, our Chief Financial Officer. You should have a copy of the third quarter fiscal year 2023 financial results, which we released this morning and if not you can access the release as well as the slides that will accompany our conversation today on our website at ir.grahamcorp.com. Dan and Chris will provide their formal remarks, after which we will open the line for questions. If you would turn to Slide 2 in the deck, I'll review the safe harbor statement. You should be aware that we may make some forward-looking statements during the formal discussions, as well as during the Q&A session. These statements apply to future events that are subject to risks and uncertainties, as well as other factors that could cause actual results to differ materially from what is stated here today. These risks and uncertainties and other factors are provided in the earnings release, as well as with other documents filed by the company with the Securities and Exchange Commission. During today's call, we will also discuss some non-GAAP financial measure disclosures. However, you should not consider the presentation of this additional information in isolation or as a substitute for results prepared in accordance with GAAP. So with that, if you would please advance to Slide 3, I'll turn the call over to Dan to begin. Thank you, Debbie, and good morning, everyone. Before I get started, I'd like to congratulate the Barber-Nichols team for making Glassdoor's Best Small & Medium Places to Work list for 2023. Throughout Graham Corporation, as we advance our strategy, I believe it's important for our businesses that we keep our workforce highly engaged, that we provide a work environment in which all feel welcome and we strive to create opportunities for each to achieve the best of their abilities. I believe we accomplished this by providing our teams with the resources, inclusive culture, and professional development they need to be their best at addressing our customers' requirements. Now, on to our results for the quarter. Chris will walk you through much of the details, but let me touch on some important highlights. We delivered $40 million in revenue achieved $0.03 per diluted share in earnings and $0.08 in adjusted earnings per share, and we ended the quarter with $294 million in backlog. Driving this was strong gross profit, improved gross margins, and continued cost discipline. In fact, we generated $2.2 million in adjusted EBITDA this quarter. Our successes with the U.S. Navy have resulted in a very robust backlog of defense business and we are continuing to strengthen our position in commercial aftermarket, while increasing our presence in the growing space industry. In fact, I will dive a little deeper into the backlog and long-term visibility and growth potential of Navy projects later this call. While orders in the quarter of $20 million were soft, we believe it was primarily due to timing and a reflection of the general ebb and flow of large projects being released. This is especially true given the large value of repeat orders we have received for critical U.S. Navy projects, which we believe validates our position as a key supplier for the defense industry. Thank you, Dan, and good morning, everyone. As Dan mentioned, our third quarter performance was in-line with our expectations. We had record quarterly sales of 39.9 million, up 39% or 11.1 million over last year's third quarter, and was driven by our defense, refining, aftermarket, and space markets. The increase over the prior year period reflects the achievement of project milestones, as well as improved execution. You may recall that last year's third quarter included the impact of U.S. Navy first article project, labor and cost overruns, which impacted revenue, as well as margin. As noted in our release today, we delivered an additional first article unit for critical U.S. Navy program during the quarter, bringing the total of first article units shipped to four this year. Base revenue increased 2 million versus the prior year and is being driven by newly awarded programs, which continue to ramp up and the relationships we have with many of the key commercial players in this growing industry. Additionally, during the quarter, we continued to see strong growth in the refining aftermarket, which was up 2.5 million or 64%. Additionally, we are proactively working to drive aftermarket demand, which is a key strategic initiative for us. For the quarter, sales in the U.S. increased 34% and represented 83% of our sales, while international sales accounted for 17% of total sales and is 66% higher than one year ago. The mix of U.S. to international sales has shifted over the last couple of years given the growth in our Navy business, as well as the addition of Barber-Nichols, which sells primarily into the U.S. Gross profit and margin improved significantly over the prior year period, which was impacted by the labor and material cost overruns I just mentioned. Sequentially, gross profit improved 18% on a 5% increase in revenue, due to continued improvement in execution better pricing, as well as a better mix and increased volume. SG&A expense for the third quarter, excluding intangible amortization was 5.3 million, up 12% or approximately 555,000. However, SG&A expense as a percentage of sales improved to 13.3%, compared with 16.4% in the comparable period in fiscal 2022. For the third quarter of fiscal 2023, net income was 368,000 or $0.03 per diluted share. On an adjusted basis, earnings per share was $0.08 per diluted share and adjusted EBITDA was 2.2 million. Turning to Slide 6, you can see our capitalization. Total debt at quarter-end was 14.2 million, compared with 19.1 million at the end of the second quarter. We paid down 5 million of debt during the quarter, which was funded by 9.3 million of cash flow from operations. Going forward, we expect our cash flow to be lumpy, due to the nature of these large contracts. Also noteworthy is that these debt payments and stronger EBITDA levels brought our bank leverage ratio down to 2.5x at December 31, and we are now back in compliance with the original terms of our credit agreement. Capital expenditures for the quarter were 1.2 million, which brings the nine month total to 2.4 million. We continue to expect capital expenditures to be approximately 3 million to 4 million for fiscal 2023, which implies about 1 million in CapEx for the fourth quarter at the mid-point of the range. Going forward, we expect capital expenditures to be at an elevated level as we invest in our growth initiatives. We have instituted strong cash management throughout the organization, which includes actively managing working capital and operating expenses, while increasing oversight of capital expenditures to ensure a proper return on capital. For the quarter, orders were soft, primarily due to the project timing. For the nine-month period, orders were 151.9 million, up 26% over the prior year. This includes a 47% increase in defense orders, a 141% increase in space orders, and a 33% increase in energy and chemical aftermarket orders. We believe that the repeat orders for critical U.S. Navy programs validates the investments we made over the last year, and our customers' confidence in our execution. If you turn to Slide 8, you can see that orders drove an 8% increase in backlog from the third quarter last year and now sits at 294 million. Most of the backlog expected to convert beyond 12 months is for the defense industry, primarily to the U.S. Navy. I'll now turn the call back to Dan to speak to our longer-term strategy and in particular the opportunity with defense, as well as our outlook for the remainder of the year. As you saw on the last slide, we have measurably increased our presence in the defense industry. The recent wins have grown our defense backlog to 234 million, which is 80% of total backlog. Executing well, delivering to plan, and high quality helps ensure future orders. Once we win these opportunities, we work to expand our margin through improved efficiencies and supply chain management and improved pricing as we win future orders. Beyond the equipment we are currently supplying to the Navy, we see other potential revenue streams. And as we look further into the future, the next generation attack submarine design has begun and Graham has a role in that development program. Now, let's turn to Slide 10. This is a bit of an eye chart, but it will help you understand the growth potential we have as it relates to planned projects. We estimate that over the remaining life of the program, including what we have in process, we have about 400 million in revenue potential. With the SSN Virginia Class Subs, there are 22 subs completed and eight are under construction. Over the next 25 plus years, there are 36 remaining builds planned at about two subs per year. Finally, for the SSBN Columbia Class Subs, there is one under construction and 11 planned builds remaining. Based on these projects and then rounding up for torpedo power & propulsion hardware that we provide, we estimate approximately $1 billion to $1.3 billion in total potential revenue over the next 30 years from   projects with the Navy. If you turn to the next slide, you can see our updated full-year guidance. Overall, we did take our fiscal 2023 guidance up including bumping the revenue range up to 145 million to 155 million, sticking with a gross margin of about 16%, SG&A about 15% of sales, and adjusted EBITDA ranging between 7.5 million and 8.5 million. This implies an adjusted EBITDA margin of approximately 5% at the midpoint of the range, well short of our aspirational goals, but significantly above last year. Importantly, as Chris noted, we are strengthening our balance sheet, improving financial flexibility, and generating cash. This will help enable us to execute on our growth plans both organically, as well as with acquisitions. With that operator, please open the phone lines and Chris and I will be happy to answer any investor questions. So, yes, it's clear that orders are lumpy here and I want to talk about that for a minute. And if I look back over the last couple of years, fiscal 2020 was a desert and the orders have been, sort of ramping up 2021 and 2022. And if I do a trailing 12-month or a last four quarter, average, the curve keeps sloping upward. Well, certainly one big thing that happened in that time frame was the acquisition of Barber-Nichols. We again, kind of long-term guidance that we had put out there, I mean by fiscal 2027, we want to be at the $200 million range. Being much more aggressive on the commercial side of the business in the energy and petrochem side, as far as going after a lot of that aftermarket business all fits into this longer-term growth. So, I would say that it is expected to continue to grow and kind of towards that 200 million in 2027. So, there's â\u0080\u0093 certainly we've seen an uptick in aftermarket orders and those have remained strong here over the last year. In the past, those have been a precursor to more of the capital, the larger capital type equipment orders. We havenâ\u0080\u0099t seen those pick up quite yet, but it's interesting to watch the market and a lot of the press regarding that in all of the big profits that the oil companies are making. So, at some point, we do expect that we'll see some of the capital markets start to â\u0080\u0093 or the capital equipment orders start to turn on, but we just haven't quite seen that yet. Yes, it's â\u0080\u0093 so Graham Corporation had a very significant database of installations and they talked about like $1 billion of installed base that they've had over the many, many years that they've been working in these markets. And as we look at that installed base, we realize that we're not as proactive in going back and following up with those prior customers to understand how the equipment is continuing to operate. So, building up our aftermarket team using the database of the   base to really understand how old is that equipment, what would we recommend to the operators, as far as maintenance and replacement. So, helping our customers, kind of get ready for that. So, it's not an emergency in the end, it's really the   that we're taking. I mean, obviously, the existing fleet of refiners in the U.S. is just going to be run harder and harder because permitting to get anything new is going to become more challenging, it looks like. So that is very much an industry in the middle of research, development, and technology demonstration. Some of them are subscale some of them â\u0080\u0093 well, a lot of them are subscale actually. We don't expect really any production orders to come forward, gosh, probably another five years, but this is the perfect place for engineered product companies to get involved in new technology and that is, just getting involved with the big players to help them demonstrate that technology start to develop the new product and then be in the position to really help them roll this out as it starts to roll-out. For 50 years, Graham has been known as a low multiple metal tank and piping fabric cater for their industrial products, but since June of 2021, when you acquired Barber-Nichols, you've almost overnight transform the company into a highly technical, critical component manufacturer for defense industry, and the fast growing space industry. On the bottom of Slide 10, under the Graham Engineered & Manufactured Content, you show a number of products such manufacturer, but investors really don't understand how critical these components are, especially for nuclear propulsion and subs and carriers. But also, here's one example that confused me. And the description on your website under submarine ejection system says Barber-Nichols makes ejection assemblies that form part of the pressure boundary of naval submarines, but it really doesn't explain what these things are. So, Graham Manufacturing in Batavia that has been involved in refinery and petrochem plants, mixed vacuum equipment that is based on a convergent, diverging nozzle. So, while they have the same descriptor, they're greatly different applications, and equipment. And when I dug into it, it says it's a 10-stage system and it has to be super silent to the subs. It's kind of interesting in the old movies you would see the captain of the torpedo saying, launch the torpedo and you hear this big whoosh because they used to launch them with air pressure and the air really gave the submarine position away. Now, they launch them with water and so they're much quieter. Also on Slide 10, you didn't mention, but you had in the past about regulators and alternators. And Barber-Nichols is involved in several different programs, some that are brand new, some that are more in the technology demonstration realm, some that are in production. And so, we tended to more genericize that and just describe that as torpedo power & propulsion hardware. And it's not just for the Virginia class, but for four sub classes, for Los Angeles, Ohio, Virginia, and Columbia subs covers a lot of torpedoes. Yes, the heavyweight torpedo is used on all of the different submarines. Yes, for the components that we're supplying, obviously we're supplying those to a larger defense integrator prime that is providing the complete torpedo to the Navy. Good morning, Dan and Chris. I would say the key ones, yes, Bill, there's certainly still some very important holes to fill as we go forward, but the key ones are pretty much filled at this point and we're able to execute much better than we had in the past. The only thing I would add to that is just like every other company, labor does continue to be a challenge, we are making substantial progress in that area and have seen quite a bit of increase in direct labor over the last year. So, just like everyone else, the market for engineers and welders and skilled labor continues to be challenging, but we're navigating our way through that fairly well. As Chris had mentioned, people are still tough to come by. And so, just individual positions within our companies are a little bit tough to fill, you know still even after we've come out of COVID and that will work. Staffed pretty well â\u0080\u0093 we still have one more opening that we're trying to fill within the Houston office, but doing fairly well there. So, certainly from a strategic plan perspective, you don't want it to completely changed direction from year-to-year. So, I would suspect that it will be a very, very well aligned with the strategic plan we laid out, yes, last year. We're modeling the budgets, looking at our markets, understanding where the revenue is coming from, etcetera. So, we're still in the process, but I would suspect that it will be very much along the lines of, we have â\u0080\u0093 we have stabilized Graham Batavia pretty well. And then on the Barber-Nichols side, we talked about, kind of the four major areas of work that Barber-Nichols is pursuing and that hasn't changed. So, at a high level, it will be tweaks on last year's strategic plan to take what we learned this year and improve ourselves even more. Just two more quick items if I could, Dan and Chris. So, the contract welders that we held to get back on schedule, those have â\u0080\u0093 all those contractors have left and have been dismissed. We do from time-to-time to fill in where â\u0080\u0093 for the gaps in production, we do subcontract out some of our commercial work. So, we do still have that going on, but the contract welders that we had on-site have gone home. And secondly, I just wonder if you could do a little bit more of a deep dive into the nature of your space business, as far as maybe not so much to customers who I assume are probably confidential, but the types of products that are being included in the space business. So, we get involved in launch vehicles where we're basically pumping fluid out of the tanks and into the combustion chamber. So, it's pumping fluid around within the satellite to cool the electronics and communication equipment, so thermal management systems. So, when the astronauts go on space walks, Barber-Nichols will have some of the environmental control types of equipment in those backpacks. I don't think it'll be predictable, Bill. And then the backpacks, not sure how many they're going to be making, but there's multiples of those also. So, we tend to kind of focus on the ones that have some repeat potential associated with them because that forms more of a steady base of business than the one-offs. While the one-offs are a lot of fun from an engineering perspective, they aren't as good from a business stability. Well, congratulations on the job you fellows are doing and thank you for your time today. Good morning, Dan and Chris. You touched on a space quite a bit, which is â\u0080\u0093 what was one of my questions, so I can skip on. And then in exchange for that, they come to work for us for two years. We just had a class that graduated at the end of the year and we're recruiting for our class, which is going to start here in February and we have some good response there and we continue to â\u0080\u0093 it's been a nice program for us. As I mentioned, we have a â\u0080\u0093 we're at the highest level in Batavia direct labor than we've been for the last year and a half. So, we're pleased in the way that's going. And as you heard Dan mention, Barber-Nichols being ranked in the top 10 on Glassdoor for small and medium sized business companies to work for just show some of the work that they're doing, to recruit talent. So, just like everyone else, talent is a resource that we continue to go after. So, that's probably something that's more of a fixture longer-term, not something that you would conceivably stop pursuing the school, the welding school that is. No, I just said for the foreseeable future, we expect to continue that program. So, I would say that the approach that we've taken thus far for the Gulf Coast area is really on the sales and service engineering side and we haven't put design engineers down there yet. We think that we have better control over our designs, have the subject matter experts in Batavia, but we are looking at alternative ways to be able to outsource more of the mundane engineering tasks that aren't being done in Batavia now that potentially we could be having done elsewhere and then have our subject matter experts really be able to work on the high value engineering contributions. And so John, I would probably, just to answer your question more along the lines of yes, all things are open and we're considering several at this point. So, just â\u0080\u0093 I don't  \n Yeah, exactly. And then lastly, in the past, you talked a little bit about some exposure to biodiesel and the green revolution, if you will. On the hydrogen side, we're also seeing quite a bit of activity. And so, for both companies actually, and so, this is again one of those, kind of early types of industries that people are trying to figure out what the best solution is demonstrating the technology and then starting to build the initial plants to produce this and distribute the hydrogen etcetera. So, we're pretty excited about that. So, we would expect that we'll win some of those going forward. And so, that's one area that I would say that we haven't seen a lot of exposure to. And thank you, everyone, for joining us here today. We are building better companies, creating opportunities, and steadily delivering on our plan."
}