{
    "symbol": "PNW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 23:07:06",
    "content": "  Operator: Good day, everyone, and welcome to the Pinnacle West Capital Corporation 2022 Fourth Quarter Earnings Call. I would like to thank everyone for participating in this conference call and webcast to review our fourth quarter and full-year 2022 earnings, recent developments and operating performance. Our speakers today will be our Chairman and CEO, Jeff Guldner; and our CFO, Andrew Cooper; Ted Geisler, APS President; Jacob Tetlow, Executive Vice President of Operations; and Jose Esparza, Senior Vice President of Public Policy, are also here with us. Please refer to that document for forward-looking statements, cautionary language, as well as the risk factors and MD&A sections, which identify risks and uncertainties that could cause actual results to differ materially from those contained in our disclosures. In looking back on 2022, it was no doubt one of our most challenging years in recent memory is we faced major financial headwinds and a financial reset resulting from the outcome of our last rate case. Coming out of last rate case, we laid out a comprehensive plan and strategy and we met or exceeded nearly every target we set for ourselves, including delivering strong service reliability to our customers. Turning now to regulatory, we came out of the last rate case fully committed to improving our regulatory relationships, and we've seen progress as a result of our focus in that area. We received constructive decisions for all key items served by the previous bench during 2022, including our financing application last December. Our number one goal continues be to be doing what's right for the people and prosperity of Arizona, which includes working collaboratively with the commission and building a more constructive relationship. Turning to the operation side, I want to start by recognizing our field team's exceptional execution in 2022, I'm especially proud of our employees for prioritizing safety and ending the year with significantly lower employee injuries. In addition, while parts of the southwest region experienced capacity shortages, again in 2022, our careful long-term planning and resource adequacy allowed us to serve our customers reliably. Additionally, we remain engaged in the western wholesale market which allowed us to make off-system sales and to create savings for APS customers. Importantly, those off-system sales directly benefit APS customers by lowering our overall costs, while helping maintain regional grid stability. And finally, our generation units performed extremely well with our nonnuclear fleet, recording a summertime equivalent availability factor, EAF of 95%, and we achieved a capacity factor of 100.2% at the Palo Verde Generating Station. As a result of this commitment, we made extraordinary progress on that front in 2022 with APS earning ratings from its customers making it among the most improved utilities in the nation for both residential and business customer satisfaction, measured by J.D. Compared to 2021, APS achieved quartile gains in every single driver of residential and business customer satisfaction, firmly lifting the company into the second quartile nationally for residential customers, in the first quartile nationally for business customers. Consequently, overall satisfaction is now well above industry benchmarks when compared to the Company's large investor-owned peers. We also continue to make progress on our resource procurement and clean energy commitment since announcing our goal to reach 100% clean carbon-free energy by 2050, three years ago. Additionally, as previously discussed, we issued an all-source RFP last year for another 1,000 to 1,500 megawatts of new resources to be in service from 2025 to 2027, and we continue to work through finalizing procurement decisions from that RFP. Looking forward, our goals for 2023 include, continuously improving our customer communication and engagement; achieving a constructive outcome in our pending rate case; and reliably serving customers through the tremendous growth in our service territory. However, we believe in our ability to provide long-term value to both customers and shareholders and we look forward to executing our plan and continuing our proven cost management efforts all against the backdrop of Arizona's extraordinary economic expansion. So I want to thank you for your time today and I'm going to turn the call over to Andrew, who will talk about our fourth quarter and full-year 2022 earnings and our forward-looking financial expectations. But right upfront I want to make clear that while we are navigating through challenges brought on by the negative outcome over the last rate case, we have been executing well on our plan and we remain confident in our ability to create renewed growth and deliver strong shareholder returns. For the fourth quarter of 2022, we lost $0.21 per share, down $0.45 compared to fourth quarter 2021. In the fourth quarter, we determined that impairment of the investment was appropriate due to ongoing disputes on transmission cost allocation and a lack of a probable favorable outcome. For our full year results for 2022, we earned $4.26 per share, down from $5.47 per share in 2021. As noted earlier, the negative rate case outcome drove a financial reset and is the primary driver for the lower year-over-year results. The Bright Canyon impairment charge, higher O&M and higher interest expense were other negative drivers for lower year-over-year results. The Bright Canyon impairment charge, higher O&M and higher interest expense were other negative drivers for lower year-over-year results. For the year, we saw beneficial weather as well as customer and sales growth that partially offset the negative drivers. Turning to customer growth the fourth quarter remained in-line with our guidance at 2.1%, which was also the customer growth rate for the full-year. Arizona continues to be a popular destination for relocation and have the fifth highest population growth in 2022, according to recent data from U.S. Census Bureau. Arizona has continued to show strong employment growth, including an emerging areas of economic diversification with manufacturing employment, for example, growing at 6.2% to 2022 as compared to a U.S. rate of 3.8%. Sales increased 1.2% in the fourth quarter relative to the prior year and for the full year 2022, our weather-normalized sales growth was 2.4% in line with our upwardly revised guidance range. This was anchored by strong C&I growth of 4.6% over 2021, as the benefits of Arizona is increasingly diversified economy realized. Although this is a decline from 2022 actual results, the range is comparable to our weather-normalized 2022 guidance range of $3.90 to $4.10 per share. Headwinds for 2023 include higher benefit expense, interest expense and plant D&A. We continue to have a strong focus on O&M and look for opportunities to create efficiencies, reduce risk and keep our costs low to maintain affordable rates for our customers. Looking at our forecasted customer growth, we expect it to remain strong and are maintaining the 1.5% to 2.5% guidance range for 2023. On sales growth we expect continued strength particularly in the C&I segments as economic diversification takes hold in areas such as semiconductor hubs, other large manufacturing and distribution. In addition, Procter & Gamble, also announced plans for $500 million investments in the manufacturing facility, creating 500 new jobs. Anchored by examples like these, we are expecting our weather-normalized sales growth range to be 3.5% to 5.5% for 2023. Nevertheless, we are expecting a headwind in 2023, primarily resulting from the net effect of higher discount rates. Turning to interest expense as the Federal Reserve continues to raise interest rates, try to combat inflation. Importantly, the increase in CapEx is independent of any rate case outcome and is directly related to loan growth and the needed investments we are making in more resilient infrastructure. While our current payout ratio is higher than our target, we believe our plan will allow us to achieve our long-term dividend payout ratio of 65% to 75% in the future, recognizing that all future dividends are subject to approval by our Board. We have a path forward that is centered around our long-term track-record of constructive rate case outcomes, a robust service territory growth, continued balance sheet strength and cost discipline and a focused management team that is taking action. Your line is live. Just starting off, I wanted to touch on the financing plan a little bit, recognizing that you won't need equity or won't be issuing equity until after the current rate case. As I mentioned earlier, the capital that we've added into the plan here is really dependent on load growth and serving the service territories it expands. Once we get through the rate case and think about, for example, our clean capital spend, that will be an area where as we with a constructive outcome consider a different ratio of self-build versus PPA assets. But as of now, the need for 2024, that $400 million to $500 million post the rate case is intact. So the forecast is driven by a diversified group of manufacturing, data center customers and some of the overall C&I growth that we're seeing in the service territory. We're not really depending on the broader macroeconomic story as much as specifically identified customers, which include TSMC, and it's a considerable part of that. The 2% to 4% of the 3.5% to 5.5%, that is from the large customers, TSMC is a considerable part of that, but there is data center customers and other manufacturing there as well. The 5% to 7% earnings growth rate is through 2026, and that's pretty much coterminous. The sales growth rate -- the long-term sale growth rate that we have here is through 2025, but roughly similar trends through that forecast period. As you've seen even in 2022, that sales growth is certainly helping us to mitigate the inflation and some of the O&M pressure that we're seeing. Your line is live. Let me ask you, so Jeff, you historically have said that, you're under-investing in APS by maybe roughly a $200 million to $300 million per year. I mean, obviously, from your prepared remarks, it sounds like the $600 million, you guys just bumped up in CapEx is sort of agnostic to APS and base level spending. And Shar, I wouldn't say we've under-invested in the system, I mean, as you know, we've been keeping up with what we need to invest in for load growth where the opportunity is around the generation side and where there are opportunities particularly now with the tax credit framework that the IRA has set-up. Obviously, it wouldn't be 100% utility owned, but we're doing probably what in the 25% range of utility on where a more rational, I think if we could do it, would be in the 50% range so that we're actually being able to maximize the benefit of those tax credits for customers. And if we can do that, then we get to a more optimized mix of utility-owned versus PPA, solar and storage, primarily is what I think you would expect to see. Yeah, I was just more curious on that $200 million to $300 million, you've quoted before in the past and how that correlates with the CapEx increase today. There is a much narrow range of rate base growth with the prior forecast, Shar. You've seen some of the timing move around in our capital, Jeff, was just talking about our clean spend. But that's really been, the main thing is the increase in the range, driven by the higher CapEx forecast. You're talking about roughly $200 million disallowance and capital structure that's in the 50-50 range, applying ROE to that, and that kind of gives you the rough EPS impact of beginning to recover on that. Your line is live. And we'll look at pension when we go into remodel strategy and one of the various levers that we need to think about in what a constructive outcome looks like, but it's not the only lever and it's not the only cost that we've got to deal with. In the last rate case, we average the two years surrounding split test year but regulatory recovery remains one path that we continue to look at. But then of course, any other levers we have around our other costs, O&M, interest expense, all those things that we can do there to make sure that we meet our forecast. You know 2022, all asset classes for the most part, face losses and discount rates went precipitously. But it's going to be the overall framework that really drives what we do, right, like we'll look at the results of the case and figure out how we optimize the mix of both the PPA and then the utility-owned generation and storage resources. And so can't really flag what that looks like here, but we have opportunity, I think to get a more optimized mix for customers. Then we're seeing now and just because of the last rate case, we are not able to do utility-owned assets at the level that we think is probably optimal. Yeah, Anderw, we do get recovery on the cost and the results year-over-year impacted by those costs kind of coming into our income statement without offsetting revenues. So what you really see, if there were a positive outcome would be the recovery on the investment in there alongside the cost. Your line is live. And then on your just credit outlook, I think you kind of mentioned in the deck, 16% to 18% range. You saw both Moody's and Fitch this month reaffirm their current outlook, the current ratings as well as the negative outlook. And you could take a look at their positions, but ultimately absent some exogenous factor, they're really looking to see the rate case outcome to make determination about the ratings and any future changes they make to the downgrade thresholds. We're committed to that 16% to 18%, that's what keeps us in our -- the your last part of your question, that's what keeps us in our current category. You've got Moody's with 18% threshold right now and S&P with a 17% to keep us at our current rating and return to stable 13% for a downgrade, that they are one-notch lower right now. And then so, we use that 16% to 18% target to keep to the current ratings. We'll have to see, as I said, after the rate case of the rating agencies readjusted at all what the targets are for downgrade. I think, both of which had indicated that they don't like being one of the lowest if not the lowest-rated commission in the U.S. from like RA."
}