{
    "symbol": "HE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 19:09:04",
    "content": " Net interest income of $65.7 million was up 9% due primarily to higher average earning asset balances and higher yields, partially offset by lower Paycheck Protection Program, or PPP, fee income as PPP loans continue to pay down. Non-interest income was down $1.8 million to $13 million, primarily due to lower bank-owned life insurance income and lower mortgage banking income as the higher interest rate environment has impacted production. On the utility side, we saw $6 million more in ARA revenues and $1 million from lower penalties for fuel efficiency on Hawaii Island, offset by lower net income due to tax adjustments recorded last year, higher O&M, lower revenues due to a timing change for revenue recognition at our Maui utility, higher depreciation and higher interest expenses. On Slide 8, utility CapEx through the third quarter was approximately $217 million  This year's CapEx continues to be lower than originally anticipated due to supply chain disruptions, customer work delays, re-stopping  resource availability and permitting delays. In addition, we now expect higher PIM rewards this year from the interconnection experience and low to moderate income energy efficiency PIMs and lower O&M than previously forecast, contributing to our improved outlook for 2022. ASP  strong net interest income growth reflected higher yields and balances across nearly the entire loan portfolio and higher yields in the investment securities portfolio, partially offset by lower PPP fees, now almost fully recognized and higher funding costs. Net interest margin expanded to 2.96% in the third quarter versus 2.85% in the second quarter, as the benefits of a higher rate environment and higher yields were only partially offset by the lower PPP fees and higher funding costs. We expect continued lower mortgage banking income this year, given the impacts of higher interest rates on mortgage production. We still expect a holding company loss of $0.28 to $0.30 for the year, excluding the $0.06 gain on sale at Pacific Current in the first quarter, although we expect that higher interest expense will put us towards the upper end of that range."
}