{
    "symbol": "EBC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 15:26:03",
    "content": " Growth and loan outstandings continued to accelerate during the quarter, rising 16% overall on an annualized basis, driven by record commercial and home equity loan production with net charge offs of just one basis point. Commercial loans were up $357 million or 16% annualized, organic residential loans were up $52 million were 10% annualized and consumer loans driven by home equity loans were up $19 million or 6% annualized and we added $78 million of mortgage loans to the embraced relationship we described last quarter. Non-Interest income on an operating basis was $45.3 million in Q3, insurance revenues were $23.8 million in the quarter, up 8% from the same quarter of 2021 and down $900,000 from Q2. As I mentioned, the provision in the quarter was $6.5 million due primarily a loan growth and was sufficient to maintain allowance of about 1% of total loans. We expect to see net interest income for 2022 in the range of $570 million to $580 million, and we expect to see our net interest margin move into the low 3% range in early 2023 if not late 2022. We do expect a good quarter for closings in Q4 and expect that to come down and as I articulated, we would expect slower growth as the -- as conditions -- as 2023 looks like it'll be a more difficult year than 2022, but the pipeline going into the fourth quarter is at about the same level as it was the prior quarter. Yeah, it's -- I'm laughing Encore, the casino leader locally, it'sâ\u0080¦ sort of a local joke, but it's embraced home loans and as we outlined at the quarter last time, earlier in the year when the liquidity picture was very different, we were looking to in essence direct security cash flows away from the securities market and developed -- had a pre-existing relation -- very strong pre-existing relationship with Embrace. If I'm doing the math off the operating guide that you have provided, just simply going from right in the middle, the $460 million to $500 million operating expense for full year '23 compared to '22, that's almost 9% growth and completely get your comments around the compensation growth expense of 6% to 7.5%."
}