{
    "symbol": "ARD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 22:02:05",
    "content": " Group adjusted EBITDA rose 22% at constant currency to $323 million on a report basis, driven by a strong performance in glass Europe and Africa, including the impact of Consol and modest year-on-year growth in AMP. EBITDA of $159 million increased by 1% on the prior year, but was held back by softer-than-expected shipments in the Americas, net favorable mix and the impact of inventory management initiatives. So if I turn to glass packaging, fourth quarter glass packaging revenue increased by 35% to $1.13 billion, reflecting 19% growth in shipments and the pass-through of higher input costs. Revenue in Europe and Asia increased by 73% to $709 million in the fourth quarter, reflecting 3% like-for-like growth in shipments, a full quarter effect in Consol and the pass-through of higher input costs. Fourth quarter adjusted EBITDA in Europe and Africa increased by 110% to $142 million compared with the same period last year, and pro forma for the acquisition of Consol grew by 35%. If I look to outlook for the year ahead, AMP has guided to full year 2023 adjusted EBITDA growth of the order of 10% of the $625 million reported for '22. But if you're looking at the ARGID Group, so the main cash flow items there, there will be capital expenditure with the full year of the African business will be about $450 million. But I think -- but the answer to the short question is that, as we said earlier, we expect cash flow generation to reduce debt starting next year because we've still got the tail end of investment programs to complete. Yes, the pro forma in the full year was, as we indicated on previous calls, it was up the order of $200 million pro forma, and the actual was about $160 million, which reflected a contribution for almost since -- almost immediately after acquisition from the second furnace in Nigel, good operating performance, very good operating leverage."
}