{
    "symbol": "TRS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-29 22:20:05",
    "content": " Within our TriMas Packaging Group, sales of certain dispenser products for hand soap, sanitizer and lotion dispensing applications were significantly lower as compared to the prior year quarter for the reasons I previously noted. Our sales within Europe are off the prior year quarter adjusted for currency by 5%, all of which is within our TriMas Packaging Group and the vast majority of which is within our dispenser related product lines. Adjusted operating profit for the quarter was $21.6 million or just under 10% of sales for the quarter, a margin which was lower than the prior year quarter, mainly due to the lower demand and related under absorption of both fixed and SG&A costs in the period, mix and energy costs. Operating profit decreased by $9.2 million to $18.1 million as the impact of lower sales was further exacerbated by a less favorable sales mix increasing inflationary pressure on input costs, including approximately $2 million of additional energy costs in Europe, which continues to be meaningfully impacted by the ongoing hostilities in Ukraine as well as currency exchange rates. As weâ\u0080\u0099ve mentioned previously, sales and operating profit for TriMas Aerospace throughout 2021 were positively impacted by $30 million of stocking orders for highly profitable specialized fasteners from one end customer. Adjusting for the impact of destocking orders in Q3 of 2021, Q3 2022 organic sales were up 8.5% year-over-year as we continued to see order intake and backlog for certain products trending above our initial internal plans for 2022. This year-over-year improvement in operating profit is primarily attributable to a $4.8 million gain from a strategic divestiture of a property mentioned earlier, which offset the loss of margin related to the prior period special stocking orders as well as the impact of continuing supply chain and labor inefficiencies and rising inflationary pressures. As I mentioned earlier in this call, order intake remains robust within TriMas Aerospace, and we do expect to see organic sales growth accelerate as we exit 2022 as the production challenges experienced this year begin to ease on account of improved manufacturing efficiencies."
}