{
    "symbol": "TRS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 16:09:02",
    "content": " Sales were approximately $238 million, up 8.5% as compared to the prior year quarter, driven by organic sales of 3.5% and sales from acquisitions, which contributed 7.2%, partially offset by unfavorable foreign currency exchange of 2.2%. Adjusted operating profit for the quarter was $32 million or 13.5% of sales, which was $2.1 million higher than the prior year quarter, but 20 basis points lower in margin largely due to product mix and higher energy costs in Europe. During the second quarter of 2022, and consistent with our results for the previous three quarters, we continued to experience double-digit year-over-year organic growth for products used in food and beverage and industrial and agricultural applications as these end markets continue to deliver stable macroeconomic growth. It's also worth noting that our flexible food and beverage product lines, which we take to market under our Rapak brand, continued to see strong demand for their bag and box product solutions with sales increasing by more than 30% on a year-over-year basis. While we are pleased with the sales performance for the quarter, given the challenging macroeconomic factors currently impacting many of the regions of the world in which we operate, we will continue to closely monitor our order book and production planning as our customers potentially bring late pandemic period inventories further in the balance over the second half of the year. Operating profit when compared to Q2 2021 was up slightly to $29.2 million as the impacts of higher sales and less volatile resin costs were offset by inflationary pressure on other input costs, including energy cost in Europe, which continue to be meaningfully impacted by the ongoing hostilities in Eastern Europe as well as currency exchange rates. Adjusted EBITDA for the quarter was $8.2 million or 17.4% of sales, a 90 basis point improvement year-over-year compared to $7.4 million or 16.5% for the prior year period."
}