{
    "symbol": "SLGN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 16:12:05",
    "content": " Free cash flow of $368 million while continuing to make investments in future growth opportunities; and finally, record revenue, volume and segment income in our high margin Dispensing and Specialty Closures business. In our Metal Container segment, we see low single-digit volume and low to mid-single-digit adjusted segment income growth in 2023, primarily as a result of mid-single-digit volume growth in our pet food markets which represent roughly half of our total volume in the segment and continued operational improvements in the business. In our Custom Containers segment, we expect adjusted segment income to grow in the low single digits, with low single digit volume growth as volume trends are expected to improve throughout the year as we continue to cycle over a previously discussed decision to not renew a long-term piece of business and to replace that volume with new higher-margin contractual business later in the year. Based on our current earnings outlook for 2023, we are providing an estimate of free cash flow of approximately $425 million in '23, a 16% increase from 2022 as earnings growth and lower use of cash for working capital as compared to '22 is partially offset by higher CapEx which we expect to be approximately $250 million in 2023 as we invest alongside our core and new customers. But what we're doing in the market, specifically, Gabe, on Dispensing and Specialty Closures, again, we've got a really strong team focused on that market, focused on areas of growth and delivering new products, new innovations to our customers that are allowing them to then take those products to market and grow their business and we're the beneficiaries of that, right. And then as we look forward to the CapEx in next year, it's up a bit, largely because of some of these new opportunities really across the business but primarily in the Custom Containers business which we just talked about as well as some good opportunities in the Dispensing and Specialty Closures business. And I think if you go back to our Dispensing and Specialty Closures segment, it was a large negative roughly in 2021, if memory serves me correct and we basically recovered that negative through the course of 2022 and now we're anticipating relatively stable prices for resin as we move forward into 2023."
}