{
    "symbol": "SLGN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 15:05:17",
    "content": " As you've seen in this morning's press release, we reported record adjusted earnings of $0.78 per diluted share at the higher end of our earnings estimates and ahead of the prior record first quarter of 2021 of $0.75 per diluted share. Given our strong start to the year, our volume outlook for the remainder of the year, our deep customer relationships, the strong operational performance of each business and our continued success in integrating the recent acquisitions, we are raising our full year guidance to $3.90 to $4.05 per diluted share for our new range, representing a 17% increase at the midpoint over record 2021 levels. These gains were partially offset by anticipated lower volumes, largely as a result of the fourth quarter of 2021 prebuy, as well as ongoing supply chain challenges, primarily at our customers and a less favorable mix of products sold. On a consolidated basis, net sales for the first quarter of 2022 increased $203.8 million or 16.5% versus the prior year, to a $1.44 billion as each of our businesses delivered top line improvement. These increases were largely the result of the pass-through of higher raw material and other costs across each business, with higher volumes in the Dispensing and Specialty Closure segment, including from acquisitions and a more favorable mix of products sold in the Custom Container segment. This decrease was primarily attributable to lower unit volumes of nearly 14%, the impact from the higher percentage of smaller-sized containers sold and ongoing inflation and manufacturing costs, partially offset by strong operating performance and income contribution from the Easytech acquisition of approximately $1 million. This increase was largely attributable to favorable impacts from the delayed pass-through of the lower resin costs in 2022 versus the unfavorable impact in the prior year from the higher resin costs and strong operating performance, partly offset by the impact of volume declines of approximately 8% versus a very strong pandemic-driven prior year quarter. We're also providing a second quarter 2022 estimate of adjusted earnings in the range of $0.90 to $1 per diluted share, the midpoint representing a 12% increase as compared to the record adjusted net income of $0.85 in the prior year quarter. And we see demand holding up quite well in that environment and feel pretty good in talking with our customers about their outlook for the year as well, that they've got more clarity into the demand function even with the higher prices that have been implemented. And then, I think as Adam just indicated, we've got good line of sight with our customers in terms of what the volume outlook looks like for the rest of the year. And to Bob's point, we've got pretty good line of sight not only into 2022 but well beyond 2022 with our strategic pet food customers and what they're doing in their market. But when we think about re-lockdown measures in China, again, I get it there's obviously a supply chain that we got to think about and things going in for, let's say, Mother's Day that was probably nonexistent for two years and then the holiday selling season and stuff like that. Gabe the only thing I would add to what Adam said, if I go back to the dispensing systems' margin question is that remember too if your question is more about the increase on a year-over-year basis, you've got a little bit of price carry-in where we're recovering the resin lag from the prior year that benefits the quarter. If you look at our food and beverage business, once we get through the pre-buy activity that we've talked about and metal closures, the balance of food and beverage looks very strong to us and will contribute that kind of growth profile that we've expected for the ongoing business as well. George, the one thing I would add to what Adam said really for both businesses, and it sort of goes to the point of we've delivered, but it's really been on the operational performance of the business as well. So, I think we've got a lot of confidence in the teams that support our customers and get the operational efficiencies that -- really, that's not just in the face of this inflation. I recall in the Analyst Day, we were saying that we could see a point where food cans for Silgan actually are growing volume year-over-year and we're getting very close to that outside of the pandemic impact that we've seen, just because of the growth of certain products in our portfolio. And then the continued investments into the Dispensing and Specialty Closures segment, we do think the growth rates and the margin rates for those businesses are just different than what we've had historically at Silgan and certainly different than our Metal Container segment. So it seems as though investors still think of you as predominantly if not entirely a food can, company even though the food can market has gotten much better over the past couple of years and you have this large other business for which you've been paying higher multiples. Because I think, if you look over a long period of time and we laid this out in that meeting that you were talking about, that our growth rates have been at or near the top of the peer group, not all organic necessarily, but it's always been the strategy as Adam said to take the cash flow of the combined business and continue to grow our portfolio into other areas."
}