{
    "symbol": "DECK",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-29 19:57:11",
    "content": " Across our entire portfolio of brands, HOKA was the primary driver of growth, increasing 140% over last year, in part due to unique marketplace dynamics which include lapping disruption in the channel last year, refilling depleted channel inventories for the domestic UGG accounts and shipping UGG product earlier than in the prior year to mitigate ongoing macro supply chain pressure and ensure we have product well positioned in the marketplace. We are focused on our long-term strategies to increase consumer awareness and adoption of the HOKA brand to build a multibillion-dollar global performance brand over time, enhance the year-round adoption of UGG as a global lifestyle brand with broad acceptance of the brand's diverse product offering, and driving consumers to our online ecosystem to increase our DTC mix to 5 0% of total company revenues over time. What we're more aligned, I would say, in terms of kind of a traditional cadence as it relates to wholesale accounts for HOKA, there, it's about just getting inventory in to accommodate our wholesale dates, as well as some of the launch dates and that is where we are seeing some pressure and looking to expedite and use some of that air freight. So don't have a specific number at this stage other than to say, the growth that you're seeing in UGG wholesale in Q1 is really our strategy of getting more product out early to replenish inventory in the wholesale channel, which we've done. If we're seeing it anywhere, it's probably in the new mill and the Classic Mini versus previous years, but we're not seeing a lot of early shopping based on inventory. So overall, comfortable with what we're guiding this year, more variable to drive marketing globally and brand awareness globally, leveraging on the fixed cost, but also recognizing we're probably a little bit behind where we thought we would be a quarter ago and that's giving us a little bit of leverage in the current year."
}