{
    "symbol": "DECK",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-28 22:59:04",
    "content": " Performance in the first half exemplified the execution of key strategies as HOKA achieved exceptional global growth, delivering back-to-back quarters above $200 million contributing 35% of total revenue, up from 28% last year. Moving to the brand highlights, Global UGG second quarter revenue increased 8% versus last year to $448 million. Looking towards the second half of fiscal 2022 for UGG, we expect to drive sell through with the brand’s diversified product assortment, both with our wholesale partners and through our direct-to-consumer channels. HOKA DTC increased 81% versus last year, which is on top of the prior year’s triple digit increase, reflecting the brand’s consumer acquisition gains in greater repeat purchasing from existing consumers. As UGG wholesale increased 19% versus last year, as we ship more product into the channel, though, we did experience pressures from port delays and HOKA continued to deliver and press of growth across all channels with an increase of 47%. SG&A dollar spend for the quarter was $239 million up 25% from last year’s 190 million, higher spend was primarily driven by greater marketing expense to fuel brand heat, highlight new categories and increased localized content, increased compensation costs as we onboard new talent to support our growing organization and higher variable expenses related to increased volume for our warehouse logistics and IT. For the full fiscal year 2022 we are reiterating our expected top line revenue growth of 18% to 20%, which equates to revenue in the range of $3.01 billion to $3.06 billion, including expectations of HOKA growing 50-plus percent over last year with confidence the brand can include $875 million of revenue. Our focus remains to increase global awareness and adoption of HOKA as we work towards building a powerful multi-billion-dollar performance brand, build the global adoption of UGG across a diverse set of consumers, categories, seasons and regions, and acquire consumers direct into our ecosystem with the goal of scaling our DTC mix of business to 50% of revenue over time."
}