{
    "symbol": "PHUN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 20:47:02",
    "content": " The completion of Q1 constituted continued operational momentum for our business as we further accelerated our Mass platform vision and adoption across the number of key fronts, including new product introduction, indirect channel expansion, digital asset activation, and a more than 310% sequential gain in year-over-year revenue growth, representing a new first-quarter record for reported revenues as a public company. In parallel, the conclusion of Q1 subsequently provided even more growth to our business as we further scaled our light life Phunware hardware sales and continue to improve our balance sheet, including a current digital currency balance of more than 652 Bitcoin and 1,222 Ethereum, valued at more than $22 million at today's trading prices. Phunware spent more than a decade helping large brands established Mobile ecosystems on our MaaS platform that are designed to better engage unique audiences by ensuring every interaction is contextual By leveraging blockchain technology, we now have the opportunity to deliver solutions that can not only authenticate and compensate who has been engaged with PhunCoin, but also incentivize engagement with PhunToken while leveraging our MaaS Customer Data Platform to give consumers better control over their data and their relationship with brands. Looking ahead, we are well-positioned to commercialize the world's first truly de -centralized data economy with a persistent mobile first connection to consumers through PhunWallet and the robust infrastructure required to support an Oracle network that bridges Web3 applications to Web2 data with Lyte by Phunware, we will do for data with Bitcoin did for finance by disintermediates,  hardware vendors, software vendors, system integrators, and strategic consultants, and finally, carriers and service providers. Please announce your affiliation, then pose your question. So we have growth plans -- the headcount built into the operating plan -- but I think right now, we're going to see a modest amount on the hardware side and fairly measured because we're getting a lot of extra revenue scale out of the ability to sell tokens and things that don't really require that we throw headcount at those sales. Please announce your affiliation, then pose your question."
}