{
    "symbol": "IRWD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 12:07:16",
    "content": " At this time, I would like to welcome everyone to the Ironwood Pharmaceuticals Third Quarter Investor Update Call. Good morning, and thanks for joining us for our third quarter 2022 investor update. A discussion of these statements and risk factors is available on the current safe harbor statement slide as well as under the heading Risk Factors in our annual report on Form 10-K for the year ended December 31, 2021, and in our future SEC filings. During today's call, Tom McCourt, our CEO, will review our strategic priorities and provide an update on the commercial performance of LINZESS. Good morning, everyone, and thanks for joining us today as we share our third quarter results. As we approach the end of the year and look back on the progress we've made across our strategic priorities, we are very pleased with the strides we have made to advance treatment in GI diseases redefine standard of care and bring important medicines to GI patients. As we move forward, we remain committed to unlocking new opportunities for LINZESS and strengthening our portfolio with innovative GI assets as well continuing to deliver sustained profits and cash flows. In the third quarter, we are pleased to report the brand delivered double-digit extended unit prescription demand growth year-over-year and for the first time, exceeded 1 million total prescriptions in the quarter, a remarkable achievement. Based on the continued strong performance of LINZESS through the third quarter, we maintain our full year net sales guidance of low single-digit percent growth. Going forward, we believe there is still a significant opportunity to reach appropriate new adult patients and drive additional prescription demand growth. Second, we are seeking to build an innovative portfolio, both through the development of our internal assets and through the in-license acquisition of external assets that target serious organic GI disease that we believe will position our company for continued growth. In the third quarter, we advanced our pipeline programs highlighted by the exciting positive top line data from the Phase III trial of LINZESS 72-microgram in pediatric patients age 6 to 17 with functional constipation. Mike will discuss the top line data in a few minutes, and we look forward to sharing more detail on the potential market opportunity at a future investor update. Next, the Phase II proof-of-concept study for CNP-104 for the potential treatment of Primary Biliary Cholangitis continues to progress, and we are continuing study start-up activities for IW-3300 Phase II proof-of-concept study in patients with interstitial cystitis and bladder pain syndrome. And finally, we continue to generate profits and ended the third quarter with $574 million in cash and cash equivalents on the balance sheet. LINZESS continues to see high utilization among health care practitioners, further reinforcing our position as the #1 prescribed branded medicine in the U.S. for the treatment of adults with IBS-C and chronic constipation. In both the third quarter and on a year-to-date basis through September, LINZESS extended unit prescription demand increased 10% year-over-year, in line with our full year expectations. In the quarter, total prescription share for LINZESS continued to lead the market and exceeded 44% in quarterly TRx share, a 1.6 share increase versus the third quarter in 2021. Importantly, this performance was driven by an acceleration in new prescription volume, a key indicator for potential future growth. In fact, an all-time high was achieved for new prescription share of 38% and new-to-brand volume increased 9% compared to the third quarter in 2021. The foundation for this excellent LINZESS performance is driven by the strong clinical profile, high patient satisfaction, our focused investment in both consumer and professional promotion and class-leading formulary access to help support health care practitioners and patient access. Finally, we're committed to advancing opportunities to broaden the clinical utility of LINZESS and help more patients in need of treatment as evidenced by the recent positive Phase III data in our 6- to 17-year-old pediatric program functional constipation. As part of our commitment to leadership in GI, I'm also excited to share that recently, we attended the American College of Gastroenterology, or ACG meeting, which included a symposium on updated IBS treatment guideline and other recommendations. We're proud that in June, LINZESS was the only therapy to receive a strong recommendation for the treatment of adults with IBS-C in the updated AGA treatment guidelines, a powerful reinforcement that LINZESS can help adults living with the highly frustrating symptoms of IBS-C. We couldn't be more excited about the strong position we're in today and the opportunities ahead of us. We're really pleased with the positive results of the Phase III trial, which showed that linaclotide improved frequency of spontaneous bowel movements and stool consistency and was well tolerated in the study population. Functional constipation is one of the most common GI complaints in this age group, and we have a significant impact on the patient's quality of life. A total of 330 patients, aged 6 to 17, fulfilled modified ROME III criteria for child/adolescent functional constipation were randomized in a 1:1 ratio between linaclotide or placebo. Top line data indicated that linaclotide 72 micrograms showed a statistically significant and clinically meaningful improvement compared to placebo in 12-week spontaneous bowel movement frequency rate or SBMs per week, the primary endpoint. The most frequently reported treatment-emergent adverse event was diarrhea, which occurred in 4.3% of linaclotide-treated patients versus 1.8% in the placebo group, adding additional data to the existing pediatric safety data in this population. Since successfully completing the Phase I dosing studies in healthy volunteers earlier this year, we're continuing study start-up activities and plan to finalize the Phase II proof-of-concept study designed this year, and we expect to enroll patients beginning in early 2023. COUR Pharmaceuticals continues to recruit patients in the clinical study with CNP-104, and we expect to see data in the second half of 2023. I had the opportunity to attend the 2022 Primary Biliary Cholangitis Patient Education Conference for the first time in October where PBC patients, family members and clinicians came together to raise awareness and provide education and support for family members and friends of people diagnosed with PBC. At this meeting, investigators and clinicians alike were excited by COUR's novel nanoparticle platform to potentially help cure this devastating disease. We believe CNP-104 has the potential to significantly shift the treatment paradigm in PBC, targeting the root cause and if successful, be the first truly disease-modifying therapy for patients. We had a strong third quarter, driven by continued impressive double-digit LINZESS demand growth. Now LINZESS U.S. net sales were $261 million in the third quarter of 2022, a 3% increase compared to the third quarter of 2021. Year-to-date, through the third quarter, LINZESS prescription demand is up 10% year-over-year and net sales growth is up 2% year-over-year. For the full year, we continue to expect LINZESS U.S. net sales growth in the low single digits driven by double-digit prescription demand. In the third quarter of 2022, Ironwood revenues were $109 million, driven primarily by U.S. LINZESS collaboration revenues of $105 million. During the third quarter of 2022, Ironwood recorded $20 million of income tax expense. GAAP net income was $50 million, and adjusted EBITDA was $69 million in the third quarter of 2022. In the third quarter, we generated $69 million in cash flow from operations and ended the quarter with $574 million in cash and cash equivalents. Our capital allocation priorities continue to be focused on investing to maximize LINZESS and actively pursuing innovative, highly differentiated GI assets to add to our portfolio. Ironwood revenue of $420 million to $430 million, which includes approximately $10 million in royalty and other revenues and adjusted EBITDA of greater than $250 million.We believe our company is well positioned for continued growth and remain focused on advancing our 3 strategic priorities. It's really appetite for BD and M&A in this environment, given the state of your capital structure. First, on the notion of price, look, I want to be clear, we're -- this is the third quarter call. We're not in a position today to provide guidance for 2023 yet, but hopefully do that at an investor conference in early January. One, we're pleased with the strong growth of LINZESS, and the important driver in our mind of that growth has always been our class-leading payer access. And that at the start of the year, I think we communicated that we believe that 2023 would be moderated -- less moderate -- or more moderate relative to that high single-digit year-over-year decline. We still think it will be better than 2022, but we're not ready to communicate what that is until probably when we give guidance in early January. I think it's important -- first of all, we can't comment on, obviously, their IP real estate. I also think it's important to remember, LINZESS has a very strong position in the marketplace, as you know, and we've been playing on a generic market from day 1. And it continues to thrive because of the strong clinical profile and the very high satisfaction, but also the broad payer access we have. So obviously, we take all threats very seriously, but our job as a market leader is to continue to grow the market and capture a disproportionate share of that to continue to drive the growth because really the lifeblood of LINZESS is demand growth, and we continue to refine our marketing mix from promotion to payer access, to continue to support that growth because we just don't see it changing. Keep in mind, as successful as this brand has been, there's 30 million people out there suffering and with this new pediatric indication, that adds another 4 million to 6 million patients. So we expect to see continued growth in demand, and we just need to be able to maintain that momentum. We are taking a very disciplined approach, though, on capital allocation and have set a really high bar for evaluating and completing transactions, especially in this environment, and we want to make sure that the deals we do create value. And I think from our perspective, the third pillar that we have in our overall strategy is around generating profits and sustainable free cash flows. And so I think we're looking for assets, and we'll circle back to the market when and if we can find something that meets our requirements and hurdle rates. I do not know what's coming next year, but just to help us kind of bookmark clinical expectations. As you know, their current products on the market in PBC, and they've used the endpoint around alkaline phosphatase. But it's also important to realize that with this new technology, the other key component we're going to look at is the impact on the immune response in patients with PBC. Because again, as we mentioned in prior calls, the science around this is quite amazing, and we now have the opportunity to literally measure the T cell autoimmune response in patients with autoimmune diseases. And PBC is an autoimmune disease driven by really a unique antigen, the PDC-E2 antigen that mitochondrial enzyme complex that we've also talked about earlier. And so we are going to look at T-cell responses in this study as well because that will really give us a real tangible index of the drug's efficacy, but also a very likely read in to the clinical benefit downstream. Because as you know, one of the real challenges in PBC or liver disease in general is how these biomarker changes, like alkaline phosphatase translate into histologic or liver function improvement. And the ability to focus on these immune targets really gives us, I think, a nice opportunity for an additional read in to clinical benefit. And then I think on the pediatric, maybe, Tom, why don't you address this one. Basically we estimate 4 million to 6 million kids suffer from functional constipation from 6 to 12, which is really, I think, the real kind of attractive market target that we have. I mean what we've seen in market research so far is a very, very positive response to the clinical profile, particularly the tolerability profile, which is very encouraging. As far as current utilization, there is some use out there, particularly with the pediatric gastroenterologist, but it's a very concentrated prescriber base overall. And this is where I think we're really going to let the data guide us to see how promotionally responsive the market is, which certainly we know it's very promotional responsive for adults. But we don't see a dramatic increase in the investment, it's really refining the marketing mix in terms of who we're targeting and what communication channels are we going to leverage to educate physicians and drive patient demand. We -- you're talking about the sort of inability to date at least for available immunosuppressive agents to really wrestle with the pathology in PBC, and I think we've learned a lot about the immunologic processes in the last 3, 4 decades. I mean a lot of those approaches have gotten great therapies, whether they're anti-TNFs or more specific cytokine approaches, but the reality of a lot of pathology is it doesn't interplay with those pathways. Those immunotherapies have improved beneficial in PBC, and it's probably likely to the unique features of that autoimmune disease which is driven by a very specific subtype of T cells, CD4 and CD8 T cells that respond to the specific PDC-E2 antigen. But that -- the flip side of that is that's what makes those diseases so right, if I could use that word, for the approach that COUR has taken with the nanoparticle technology because that is a very specific approach that gets to target a specific antigen that could be or in this case, is the root cause of the disease like PBC. So I think the flip side is really a positive in the tolerance platform because it gives us a very focused attack for the pathology of PBC, and that's why we're quite excited about that program. I think that we were -- again, there are 3 things that are really driving new to brand growth. There's focused investment that we have on the consumer side and also on the professional side in terms of brand promotion, and then lastly, I think the thing we've been talking about all along on our call, which is leading formulary coverage, well, it's class leading. I don't know, Tom, if there's anything else that you think , but I think those are the big drivers of new-to-brand growth in the quarter. Sravan, I think that's spot on. I think the other thing to keep in mind is we presented data at DDW a year ago, showing that the excellent prevalence of IBS-C has increased pretty significantly coming out of the pandemic. I think it's certainly a lot of the stress, which we know does trigger IBS symptoms. So I think we're seeing, one, an increased number of patients presenting to the physician's office. And to Sravan's point, we continue to refine our marketing mix, both on consumer activation and primarily consumer activation that's been very successful as we continue to evolve that market mix, particularly in the digital space, where we know there's a real heavy traffic, but patients looking for some help. So I think to Sravan's point earlier, I think this is about a lot of suffering patients, more suffering patients, actually seeking care. Two, we've got a very strong brand that's easy to prescribe, and we also know that this drug continues to be very promotionally sensitive and as we push it grows. First, I think -- Tim, that's really a great question because it's also one of the things that makes this really so scientifically amazing, because the whole root cause of PBC is that mitochondrial antigen, the PDC-E2. So it's a native protein in the mitochondria, PDC-E2 that the patient's immune system looks at as an enemy or a foe and it reacts to it and kills the bile duct cells. That really is the hallmark of PBC-- and that's what makes it very unique and to your point, a very targeted opportunity. So they have an altered immune response to this host antigen, and it's a very unique antigen that really lets us target that antigen in these patients. I'd say, look, I think we're super pleased with the commercial margin year-to-date. Year-to-date through the third quarter, commercial margin sort of in line with where we were in 2021, and we expect full year commercial margins to also be roughly in line with last year. So we continue to focus and refine the marketing mix as Tom had talked about earlier in an effort to optimize brand profits, and commercial margin, as you know, can fluctuate like we had in the second quarter last year when we talked about the -- sorry, second quarter earlier this year, we talked about the reasons that it fluctuated and why it's back to 74% this quarter. But we don't see that -- even though it's -- there's a lot of overlap with the existing targeted physicians, we'll probably identify some high potential pediatricians that will trade off because they could be higher potential docs. But we don't see a dramatic change in the overall investment in the brand, even though we're adding another 4 million to 6 million patients that we'll be targeting. So we're running a series of pilots out of the gate, both with regard to professional promotion to see how promotional responsive it is as well as there's a very, very innovative channels out there, both, targeting parents of kids as well as pediatric physicians that it will also be piloting. But again, I think this is where the data will really help guide us with regard to what is the right level of investment to drive ongoing growth."
}