{
    "symbol": "ANGO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-12 12:52:02",
    "content": " We ended the quarter with revenue of $87 million, representing growth of more than 13% year-over-year. Net sales from our Med Tech platforms were $22.6 million, representing growth of 40% over the fourth quarter of last year. Revenue for the full fiscal year was $316.2 million, representing growth of almost 9% over the previous year. When adjusting for the one-time $5 million order from NHS during the prior year period, our Med Device business grew 3% year-over-year. Revenue for the fourth quarter of FY â\u0080\u009822 increased 13.2% year-over-year to $87 million, driven by continued strength in our Med Tech platforms, including Auryon, NanoKnife and thrombectomy. Med Tech revenue was $22.6 million, 40% year-over-year increase, while Med Device revenue was $64.4 million growing 6.1% compared to the fourth quarter of FY â\u0080\u009921. For fiscal 2023, we expect mechanical thrombectomy to grow 30% to 35%, AlphaVac revenue from both the F22 and F18 LMR was $2.2 million in FY â\u0080\u009922. For FY â\u0080\u009822, our VA business is down 1.1%, but when accounting for the one-time $5 million NHS order last year, this business is up 4%. Now moving down the income statement, as illustrated in the gross margin bridge included in the earnings presentation posted this morning, our gross margin for the fourth quarter of FY â\u0080\u009822 was 53.4%, a decrease of 170 basis points compared to a year ago, but an increase of 120 basis points sequentially as our capacity improvement initiatives yielded benefits for us in the fourth quarter. We anticipate that FY â\u0080\u009823 revenue will be in the range of $342 million to $348 million and we expect full year adjusted earnings per share to be in the range of $0.01 to $0.06 as we continue to invest in driving sustainable growth in our key Med Tech platforms, while also managing continued headwinds. So, you could use that 1% to 3% range for all of devices and then some of the other detail that we gave you in our Med Tech products together to get to that guide that we gave you of $342 million to $348 million."
}