{
    "symbol": "ANGO",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-30 13:09:05",
    "content": " Before we begin, I’d like to caution listeners that during the course of this conference call, the company will make projections or forward-looking statements regarding future events, including statements about expected revenue, adjusted earnings and gross margins for fiscal year 2022, as well as trends that may continue. Our Auryon business continued its positive trend in our first quarter, as strong procedural volumes and new customers drove revenue of $5.9 million, up sequentially from $4.6 million in the fourth quarter of FY 2021. For FY 2022, we expect Auryon to continue to grow meaningfully and based off the strong first quarter performance, we now expect Auryon to generate revenue in the range of $24 million to $26 million, compared to our prior expectation of $18 million to $22 million. As Jim noted, our revenue for the first quarter of FY 2022 increased 9.6% year-over-year to $77 million. Med Tech revenue was $17.6 million, a 68% year-over-year increase, while Med Device revenue was $59.4 million, roughly flat compared to the first quarter of FY 2021, which included that $5.2 million NHS order. Auryon contributed $5.9 million in revenue during the first quarter, building upon the momentum of the product’s official commercial launch and strong performance in FY 2021. Our research and development expense during the first quarter of FY 2022 was $7.4 million or 9.6% of sales, compared to $9 million or 12.8% of sales a year ago. SG&A expense for the first quarter of FY 2022 was $33.4 million, representing 43.4% of sales, compared to $26.3 million, representing 37.4% of sales a year ago. But I know out of the gate a year ago when we launched, it seemed like we’re getting mostly customers who are familiar with the other laser that have been in the market jumping to us first, saying, let me try this new product, because they knew the other laser had some limitations and our new product the way it works with the 355-nanometer eliminated many of those limitations."
}