{
    "symbol": "ANGO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-07 12:53:04",
    "content": " We ended the quarter with revenue of $74 million, representing growth of about 4% year-over-year. Net sales from our Med Tech platforms were $19.6 million, representing growth of about 29% over the previous year. Through Q3, our Med Tech business grew about 42% year-over-year and year-to-date comprised approximately 24% of our overall revenue base, up from 18% in the prior year period. Auryon performed well, particularly in light of the tough environment in January, when hospitals and OBLs were significantly impacted by COVID spikes, both in terms of patient admittance and healthcare worker shortages, due to nurses and providers falling ill. Auryon procedures remained fairly evenly divided between above and below the knee, demonstrating the versatility of both our technology and platform, the unique breadth of our addressable market and opportunities for continued growth. When adjusting for the one-time $5 million order from NHS during the prior period -- prior year period, our Med Device business grew 2% year-to-date. Our revenue for the third quarter of FY '22 increased 3.9% year-over-year to $74 million, driven by continued strength in our Med Tech business, including Auryon, NanoKnife and thrombectomy. Med Tech revenue was $19.6 million, a 28.6% year-over-year increase, while Med Device revenue was $54.4 million, declining approximately 2.8% compared to the third quarter of FY '21. Revenue in our Endovascular Therapies business increased 14.5% year-over-year to $38.1 million, benefiting from the continued adoption of Auryon and our thrombectomy portfolio. Auryon contributed $7.3 million in revenue during the third quarter, continuing the momentum we've been building since last year's launch. Revenue from our oncology business declined 5% during the quarter as compared to prior year, as oncology-related procedures were acutely impacted by COVID and hospital staffing disruptions. As illustrated in the gross margin bridge included in the earnings presentation posted this morning, our gross margin for the third quarter of fiscal year '22 was 52.2%, a decrease of 190 basis points compared to a year ago, but up 40 basis points sequentially, including the impact of the CARES Act reimbursement Jim mentioned earlier. Our research and development expenses during the third quarter of fiscal year '22 was $7.3 million, or 9.8% of sales, compared to $8.6 million, or 12% of sales a year ago. SG&A expense for the third quarter of FY '22 was $29.1 million, representing 39.4% of sales compared to $28.6 million, representing 40.2% of sales a year ago. Our adjusted net income for the third quarter of fiscal year '22 was $1.3 million, or adjusted earnings per share of $0.03 compared to adjusted net income of $0.7 million or adjusted earnings per share of $0.02 in the third quarter of last year. In the third quarter of fiscal year '22, we used $8.8 million in operating cash, had capital expenditures of $1.1 million and additions to Auryon placement and evaluation units of $1.5 million. We also continue to expect full-year adjusted earnings per share to be in the range of a loss of $0.02 to a gain of $0.02, as we continue to invest in driving sustainable growth in our key Med Tech platforms, while also managing the continued headwinds we discussed."
}