{
    "symbol": "NCSM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 00:38:04",
    "content": " We significantly exceeded the consolidated revenue guidance for the third quarter of 2022 that we provided in early August, enabling us to generate over $8 million in adjusted EBITDA during the quarter. Starting with Canada, our Canadian revenue of nearly $35 million in the third quarter exceeded the high end of our guidance range of $23 million to $24.5 million. Turning to the U.S., our revenue of $11.5 million for the third quarter fell just below our guidance of $12 million to $13.5 million. Our international activity improved again sequentially in the third quarter with revenue of $2.6 million, which was slightly below our expectations of $3 million to $4 million. As reported in yesterdayâ\u0080\u0099s earnings release, our third quarter revenues were $48.9 million, 51% higher than the prior yearâ\u0080\u0099s third quarter, with increases of 57%, 43% and 14% in Canada, the U.S. and international markets, respectively. On a sequential basis, our revenue in the third quarter was 78% higher than our revenue in the second quarter of 2022, with an increase of 171% in Canada due in part to normal seasonality and a 5% increase in international markets, offset by a 5% decline in the U.S. Gross profit, which we define as total revenue less total cost of sales, excluding depreciation and amortization expense, was $20.5 million in the third quarter or 42% of revenue. For a sequential comparison, our gross profit in the second quarter of 2022 was $8.9 million or 33% of revenue. Our selling, general and administrative expenses, or SG&A, were $15.4 million in the third quarter of 2022 and were within our guided range of $14.5 million to $15.5 million, despite higher incentive accruals related to an improvement to our expected financial results for the year. Our SG&A expense was $4.4 million higher than the third quarter of last year, primarily due to increased headcount and higher salary expense. In the third quarter, our non-cash share-based compensation expense totaled $0.9 million and our nonrecurring litigation expenses totaled $1.7 million, which was an increase from the prior year, primarily due to a patent infringement trial, which Iâ\u0080\u0099ll discuss further in a moment. Turning now to cash flow items and the balance sheet, our cash flow from operations for the third quarter of 2022 was negative $3.8 million and our net capital expenditures for the third quarter were $0.1 million, resulting in free cash flow for the quarter of negative $4 million. Turning now to a few points of guidance for the fourth quarter and the full year for 2022, we currently expect fourth quarter total revenue of $42 million to $46 million, an increase as compared to the fourth quarter of 2021, but a decline from our robust third quarter."
}