{
    "symbol": "NCSM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 09:51:04",
    "content": " Our revenue performance for the quarter increased by over 30%, as compared to both the first quarter of 2022 and the second quarter of 2021, driven by increases in activity and fracturing systems and repeat precision. Our Canadian revenue of $12.8 million in the second quarter exceeded the high end of our guidance of $11.5 million to $12.5 million, as market activity remains strong, despite seasonality related to spring breakup and wet weather conditions in June, which delayed customer activity. Our international activity improved in the second quarter relative to the first quarter with revenue of $2.5 million, however, fell below our expectations of $3 million to $4.5 million of revenue. As reported in yesterday's earnings release, our second quarter revenues were $27.5 million, which is 28% higher than the prior year second quarter. On a sequential basis, our revenue in the second quarter was 30% below revenue in the first quarter of 2022 with increases of 34% and 65% in the U. S. and international markets respectively offset by a seasonally-driven 55% decrease in Canada. Gross profit, which we define as total revenue, less our total cost of sales excluding depreciation and amortization expense, was $8.9 million in the second quarter or 33% of revenue. This was below our guided range of 36% to 40% for the quarter, and compared to $7.5 million or 35% of revenue in the prior year second quarter. For a sequential comparison, our gross profit was $14.9 million or 38% of revenue in the first quarter of 2022. Our selling, general and administrative or SG&A expenses were $13.7 million in the second quarter, which was $1.9 million higher than second quarter of last year, primarily driven by increased compensation expense, including salary and benefit restorations and salary increases. Our SG&A expense for the second quarter of 2022, compared favorably to our guided range of $14.5 million to $15.5 million with favorable variances in several categories, including share-based compensation and litigation. During the second quarter of 2022, our depreciation and amortization expense was $1.1 million and there was minimal income attributable to our non-controlling interest in a repeat precision. We expect our U.S. revenue to be between $12 million and $13.5 million, our international revenue to be between $3 million and $4 million recovering from lower levels in the first half of 2022, and we also expect our Canadian revenue to be between $23 million and $24.5 million as activity rebounds after spring breakup."
}