{
    "symbol": "DOCU",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-09 20:42:09",
    "content": " Q4 total revenue came in at $660 million, up 14% versus prior year, finishing the year with $2.5 billion of revenue and 19% year-on-year growth. We closed out the year strong, and Iâ\u0080\u0099m proud to share that we achieved an impressive milestone for the Company, delivering $2.5 billion of revenue for the fiscal year, reflecting 19% growth year-on-year. We added approximately 30,000 new customers during the quarter, bringing our total installed base to $1.36 million at the end of the year, a 16% increase year-over-year. We also saw a 27% year-over-year increase in customers with an annualized contract value greater than $300,000, reaching a total of 1,080 customers. For the full year, non-GAAP operating income rose 23% to $570 million and operating margin was 21% versus 20% in fiscal 2022. For the full year, non-GAAP net income was $419 million, up from $411 million in fiscal â\u0080\u009822, a growth rate of 2% year-over-year. Operating cash flow in the quarter grew 56% year-over-year to $137 million, representing a 21% margin. Free cash flow for the quarter was $113 million, a 17% margin compared to $70 million, a 12% margin in the year prior, a 61% increase year-over-year. Free cash flow declined 4% year-over-year to $429 million, a 17% margin compared to $445 million, a 21% margin to fiscal 2022. For the first quarter and fiscal year â\u0080\u009824, we anticipate total revenue of $639 million to $643 million in Q1 or growth of 9% year-over-year. Of this, we expect subscription revenue of $625 million to $629 million in Q1 or growth of 10% to 11% year-over-year. For billings, we expect $615 million to $625 million in Q1 or flat to 2% growth year-over-year and $2.705 billion to $2.725 billion for fiscal â\u0080\u009824 or growth of 2% year-over-year. So, I think on the expansion rate, I think itâ\u0080\u0099s a continuing trend that weâ\u0080\u0099ve been talking about from -- over the last few quarters, which is, as the book of business has grown and the macro environment has softened, the rate at which customers are expanding is slowing."
}