{
    "symbol": "DOCU",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-08 21:15:09",
    "content": " Customer growth remained strong as we added approximately 44,000 new customers during the quarter, bringing our total installed base to 1.28 million customers worldwide at the end of Q2, a 22% increase compared to a year ago. This is one of many examples, which underscores our successful strategy of landing and expanding customers who then grow with us over time in new use cases with new products or features to address their evolving business needs. Please proceed with your question. So I think really helping customers understand just the efficiency and effectiveness in the belt-tightening environment that weâ\u0080\u0099re in, our marketing team is really focused on amplifying that because we have very much a land-and-expand model where we start small. Please proceed with your question. I think as we got to scale to the place we are now, weâ\u0080\u0099re seeing smaller upsells and expansions as customers continue to consume what they bought and the timing of those renewals also impacts kind of those expansion rates. Please proceed with your question. Please proceed with your question. Please proceed with your question. And we give that visibility to those leaders and would be able to get agreements that have more use cases when we get started because we also find with our customers, the more use cases they have, the less likely they are to leave DocuSign or to take business away from us. So, the other part of that is partnering with our product portfolio folks and within Heather  and her team on making sure that we are coming up with the right capabilities, our product for these customers and APIs for our partner portfolio because in a lot of cases with enterprise, we have SIs and ISVs that have to go in and really help integrate what we are doing with other capabilities that they already have in place at the enterprise level. Please proceed with your question. Please proceed with your question. And so we really think of that as a metric thatâ\u0080\u0099s around delighting our customers the ease of use of what we do even given some of the underbelly of the complexity of the product, I think is really a testament to that high ROI and what customers get from using DocuSign, and we think thatâ\u0080\u0099s a big differentiator in the marketplace."
}