{
    "symbol": "DOCU",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-09 17:52:07",
    "content": " For example, we grew our customers with a greater than $300,000 ACV by 32% from a year ago, as our successes during the quarter demonstrate, we continue to see both growth and leadership in eSignature, as well as progress across the rest of the Agreement Cloud suite. Customer growth remained strong, reflected in approximately 67,000 new customers in the quarter, bringing our total installed base to nearly 1.24 million customers worldwide at the end of Q1, a 25% increase compared to a year ago. Please proceed with your question. Please proceed with your question. But lastly, I would say, I think in terms of lessons learned, it is that -- the core thing that DocuSign had always done sort of pre-pandemic about really driving customer success, being an organization that's focused on driving adoption and the consumption of what people have purchased are there -- is the core things we need to do. And so some of the things that Dan touched upon in terms of bringing in new leaders, ramping up the field teams, looking at customer demand and use cases and product opportunities within the customers, and then the macro environment that we're seeing, that is baked into our current outlook in the back half of the year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. I think when you think about kind of that back half of the year, we're not guiding on the dollar net retention, but it's fair to say that it is reflected in some of the growth rates and in Q2 we would expect it to be around the bottom end of that historical range. Across the 1.24 million customers or even 180-odd thousand direct customers, there's no simple answer because we have quite a range of customers, of course, but if I try to think through it on average, it's dramatically more people saying, I only need a little bit more as opposed to a lot more, which I needed last year as opposed to people saying, I'm pushing or deals are taking longer to close. Please proceed with your question. I don't think I've ever seen that historically happen in your business from a Q1 to Q2, where you're adding $0 of net new DR. Was there like some pull-forward business from Q2 that landed in Q1, or what's going on in that guidance? Please proceed with your question."
}