{
    "symbol": "APLD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-13 11:43:08",
    "content": " Please proceed with your question. So the way that I think about and the way I think you should think about the ramp of our business and the EBITDA is kind of the lower end, if you think about per 100 megawatts, the lower end of the economics for EBITDA per 100 megawatts that we're targeting is about $18 million. And so per 100 megawatts, you should think about, $1.5 million a month of EBITDA, and I walked through in the prepared remarks, kind of the $400 million that we're kicking -- 400 megawatts that we're kicking off, and those should be starting to come online, kind of in the fall, and then get fully ramped, either at the end of this calendar year or early next calendar year. And so, I think the assumption you should get as those coming online, and so with those that 400 online, you're running at about $72 million a year of EBITDA and then we continue to bring more online in the first half of that calendar year. Please proceed with your question. But you're right on the numbers that you're talking about, we think as far as people continuing to operate machines, they've already purchased at our site, you're looking at probably around a $9,000 Bitcoin price before I think there would even be a thought of shutting those down. Please proceed with your question. And then, lastly, I think will be kind of the ramp up of operations there was -- it was fairly, I mean, I would say chaotic is a good word to use when we started in February, and you're racking all of these miners, and we did use a lot of the people locally, because you need this real big burst of labor, really to put all of these things up and plug them in, but you only need it for a few weeks. Please proceed with your question. Like I said, I think there's even if there were no new machines purchased, for the next six months, I think there's so many sitting on the sideline, and so much capacity that still required that you're going to want to get these plugged in even all the way down, as I mentioned earlier to Bitcoin at 10,000. And so we actually have transformer some being delivered to that site next week, and then all the way through the summer, so it'll be I think we're in really good shape to bringing that one online, in the early fall timeframe and it'll be the kind of shortly thereafter the other Texas wind facility but the supply chain still for transformers and switchgear are probably the biggest bottleneck. Please proceed with your question. I think the other thing that we think about in the marketplace, if you get much more kind of a much tighter capital markets, which is obviously arrived, is maybe it'll bring opportunities for us for consolidation, or kind of as a typical, what you would see in the business model that we're running doing, some -- maybe some type of sale leaseback on facilities that are already running, and running those for other people. Look so as far as hosting, the way I think about our business is, we have security from our customers, we have these long-term can take or pay contracts with security on the equipment, we sit at a much more, I guess higher level, higher security level in the industry, we still get to generate great margins, we still get good returns on capital."
}