{
    "symbol": "NXPI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 11:57:07",
    "content": " Beginning with quarter four, our revenue was $12 million better than the midpoint of our guidance with the trends in the mobile and industrial and IoT markets performing better than our expectations, while Automotive was in line and Communication Infrastructure below our expectations. Taken together, NXP delivered quarter four revenue of $3.31 billion, an increase of 9% year-on-year while maintaining channel inventory at a 1.6 months level, well below our long-term target. Full year revenue was $6.88 billion, up 25% year-on-year, a reflection of higher pricing, our strong company-specific product drivers and accelerated content increases, thanks to the secular growth in sales of xEV vehicles and prioritization by OEMs of premium class vehicles in a limited supply environment. For the fourth quarter, Automotive revenue was $1.81 billion, up 17% versus the year ago period and in line with our guidance. Full year revenue was $2.71 billion, up 13% year-on-year, primarily due to higher pricing and the strong competitive positioning of our solution offering comprising industrial processes and about  cash connectivity and security. For the fourth quarter, Industrial and IoT revenue was $605 billion, down 8% versus the year ago period, so better than our guidance. Full year revenue was $1.61 billion, up 14% year-on-year, primarily due to higher pricing and continued traction of our secure mobile wallet. For quarter four, Mobile revenue was $408 million, up 9% versus the year ago period and better than our guidance. For quarter four, Communication Infrastructure and Other revenue was $494 million, up 8% year-on-year and below our guidance. At our Analyst Day in November '21, we highlighted our expectation to grow total company revenue to approximately $15 billion in 2024, coming from $11 billion in 2021 within a compound annual growth range of 8% to 12% over that period. Embedded within this outlook, we highlighted six company-specific revenue drivers across all our served end markets, which we anticipated to grow in aggregates to about $6 billion in '24 from a $3 billion level in '21, representing about a 25% 3 year compound annual growth range. Additionally, we shared with you that our high relative market share for business would grow to $9 billion in '24 from $8 billion in '21, reflecting about a 5% 3 year compound annual growth range. Full year revenue for 2022 was $13.21 billion, up 19% year-on-year. We generated $7.64 billion in non-GAAP gross profit and reported a non-GAAP gross margin of 57.9%, up 180 basis points year-on-year as a result of higher internal factory utilization and fall-through on higher revenue, which is at the high end of our long-term financial model. Full year cash flow highlights include $3.9 billion in cash flow from operations and $1.06 billion in net CapEx investments or 8% of revenue, resulting in $2.83 billion of non-GAAP free cash flow, up 23% year-on-year or a healthy 21% of revenue. Total revenue was $3.31 billion, up 9% year-on-year, in line with the midpoint of our guidance range. We generated $1.92 billion in non-GAAP gross profit and reported a non-GAAP gross margin of 58%, up 70 basis points year-on-year and consistent with the midpoint of our guidance range. Total non-GAAP operating expenses were $713 million or 21.5% of revenue, which is up $32 million year-on-year and down $17 million from Q3, slightly favorable to the midpoint of our guidance. From a total operating profit perspective, non-GAAP operating profit was $1.21 billion, and non-GAAP operating margin was 36.5%, up 160 basis points year-on-year, above the midpoint of our guidance range, reflecting solid fall-through in operating leverage on the increased revenue level. Cash flow from operations was $1.08 billion and net CapEx was $233 million, resulting in non-GAAP free cash flow of $843 million or approximately 25% of our revenue. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}