{
    "symbol": "AKA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-15 10:29:03",
    "content": " And while third-party brands make up less than half of the Culture Kings’ volume, as discussed last quarter, we have seen order cancellations and supply chain impact on some third-party brands, which disproportionately impact the Australian business. Petal & Pup’s strategy of strong seasonal focus, test and repeat buying and a growing mix of exclusive product is working, as evidenced by an 80% increase in customer repeat rate for the first quarter compared to the first quarter last year. For the first quarter, net sales grew 116% to $148 million as compared to $69 million last year. For the quarter, active customers during the trailing 12 months grew 46% on a pro forma basis to $3.8 million compared to last year and grew $120,000 on a sequential basis. First quarter net sales in the U.S. increased $78 million, up 81% from the first quarter last year and increased 54% on a pro forma basis. Turning to rest of world, net sales of $19 million increased 30% from the first quarter in the prior year on a pro forma basis, which was impacted by the Omicron surge in New Zealand, where there was a similar consumer reaction of Australia. In addition to lapping extremely strong growth in the second quarter of last year with the U.S. reopening, we were up against an unfavorable FX impact of 7%, which equates to an additional $3 million headwind compared to what we saw in the first quarter. Our strong inventory position, Princess Polly’s continued momentum in the U.S., and our team’s progress on executing Culture Kings’ growth strategy, as we look beyond 2022, we remain confident in our ability to deliver on our long-term targets, which include net sales growth of approximately 20% annually, excluding acquisitions; the addition of one to two acquisitions per year; and long-term adjusted EBITDA margins in the mid-teens. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}