{
    "symbol": "GPRO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 19:13:02",
    "content": "  And welcome to GoPro's Quarter 2, 2022 Earnings Conference Call. At this time I will like to turn the conference over to Ms. Jalene Hoover, Vice President of Investor Relations. With me today are GoProâ\u0080\u0099s CEO, Nicholas Woodman; and CFO and COO, Brian McGee. Todayâ\u0080\u0099s agenda will include a brief introduction from Nick and some commentary from Brian, followed by Q&A. For detailed information about our second quarter 2022 performance and our outlook, please read the management commentary we posted to the Investor Relations section of GoProâ\u0080\u0099s website. Before I pass the call to Nick, I would like to remind everyone that our remarks today may include forward-looking statements. Forward-looking statements and all other statements that are not historical facts are not guarantees of future performance and are subject to a number of risks and uncertainties, which may cause actual results to differ materially. Additionally, any forward-looking statements made today are based on assumptions as of today, including, but not limited to, uncertainty related to the duration and impact of the COVID-19 pandemic and the war in Ukraine. To better understand the risks and uncertainties that could cause actual results to differ from our commentary, we refer you to our most recent annual report on Form 10-K for the year ended December 31, 2021, which is on file with the Securities and Exchange Commission and is updated in future filings with the SEC, including the quarterly report on Form 10-Q for the quarter ended June 30, 2022. Today, we may discuss gross margin, operating expense, net profit and loss, EBITDA as well as basic and diluted net profit and loss per share in accordance with GAAP, and on a non-GAAP basis. We believe that non-GAAP information is useful, because it can enhance the understanding of our ongoing economic performance. A reconciliation of GAAP to non-GAAP operating expenses can be found in the press release that was issued this afternoon, which is posted on the Investor Relations section of our website. In addition to the earnings press release and management commentary, we have posted slides containing detailed financial information and metrics for the second quarter of 2022. The management commentary, slides as well as a link to todayâ\u0080\u0099s live webcast and a replay of this conference call are posted on the Investor Relations section of GoProâ\u0080\u0099s website for your reference. Unless otherwise noted, all income statement-related numbers that are discussed in the management commentary other than revenue, are non-GAAP. Now, I'll turn the call over to GoPro's Founder and CEO, Nicholas Woodman. In Q2 2022, GoPro delivered a fifth consecutive profitable quarter on a GAAP basis at $0.02 per share and our eighth consecutive quarter of profitability on a non-GAAP basis at $0.08 per share. Both revenue and non-GAAP EPS in Q2 exceeded expectations at $251 million and $0.08 per share, respectively. Direct to consumer revenue increased nearly 9% year-over-year to $95 million, or 38% of revenue. And subscription and service revenue hit a new quarterly milestone of $20 million, positively impacting our bottom line. Our subscription service continues to be a powerful financial engine for GoPro and represents our fastest-growing, highest-margin and most profitable product. We ended Q2 with 1.91 million subscribers, a 65% year-over-year increase of approximately 754,000 GoPro subscribers, and we are on the cusp of surpassing two million GoPro subscribers, which translates into $100 million of annual recurring subscription revenue with gross margin of 70% to 80%. We are on-track with our plans to launch several exciting new hardware and software products in the back half of 2022, wowing our customers with blistering new performance made easy thanks to significant updates to our software experience that will put a premium on convenience. And let us provide some colour on Q2, Q3 and our 2022 outlook. As a reminder, there both the CEO and CFO comments in the management commentary posted in the Investor Relations section of our website. As Nick mentioned, Q2 saw through exceeded guidance and revenue and EPS were also on the high end of guidance. As has been widely reported, -- Big Box retailers are actively reducing their inventory along with weeks of supply. In terms of retail Big Box channel inventory, we believe we are well-positioned at approximately 9 to 10 weeks of inventory. However, we expect retailers to generally reduce weeks of inventory in the second half which could impact our sales into the channel. For 2022, based on our outlook, we expect the overall FX impact to revenue margin and earnings to be approximately $33 million compared to 2021. Inflation, rising interest rates and other macro-economic issues may impact demand as well as competition for share of wallet during the second half. Taking these macro dynamics into consideration for 2022, we expect camera unit sales up between 2.9 million and 3.1 million units which is down from our prior guidance of approximately 3.2 million units as well as year-over-year. We expect second half 2022 compared to first half 2022 unit sales to grow nearly 60%, up from 46% in the same period in 2021. Furthermore, on the demand side, through July, we are running ahead of projected demand and fell through which is encouraging well disruptive quarter outlook. We continue to effectively manage supply chain, the third quarter camera secured and the fourth quarter pipeline is well-developed. To execute on planned product launches, we will continue to invest in product innovation and hardware, software, and the client experience as well as in targeted marketing while continuing to drive efficiencies in all areas of our business. Operator, we are now ready to take question. Your line is open, please go ahead. Hi Martin, it's Brian. Our catch has been pretty consistent through the years, although, I have to say because we've come out with new accessories. Of late, we are seeing a bit more in accessory sales in our quarters. And next question is on the geographic weakness, its strengths. To get the combination I'd like direct to crew, direct into duty-free at airports. And then, people then buy we have to extrapolate purchases from online gopro.com, Amazon and other retailers which is the bulk of the purchases. We have seen particularly in Europe and Asia, a rebound in travel, we've all seen that but through duty-free and crews were seeing that comeback and that was part of our upside in the quarter and which is great. That said, it's also those two channels were above 50% of where they were pre-pandemic. So, it's will be a tailwind for us if that happens. Your line is open, please go ahead. Why donâ\u0080\u0099t dig a little bit into the expectation for 3Q on given retailer commentary, I understand, wanting to be conservative around, there are open supplies and  play some more inventory in light of where positioning is. That said, you guys obviously have had a flagship launch around the same time of the year for quite a while. We feel very good about any sell through, so demand is definitely there. And if that happens, that's great because that gives more open to buy dollars for retailers. So as long as our products moving, they're going to keep buying. I think we have pretty good visibility on the third quarter in terms of moving the  product and product availability and the strength also on gopro.com, you can be there and encouraging as well. So from that perspective, it's good. And then, we'll get to the fourth quarter, we have really good data historically on new products and how many products in the lineup and which products move and at what rates and relative to each other. And so obviously, we'll have a flagship product for the fall and an additional product, that additional product, we expect to do well, but it doesn't have to knock it out of the park. Great, and just going off the prior questions around the dispersion across regions in performance. We're seeing some of it, which has been encouraging popping up here in July. Your line is open, please go ahead. I think on demand side, we're actually seeing a stronger demand than we've initially guided for in the quarter which is very encouraging. So we're seeing solid demand that really picked up in Q2, picked up more in Asia and continued in Europe. So as long as the sell through continues, like I said, as we expect it to, we have very good visibility then into selling. And then maybe just, Brian, again, on thinking about seasonality back of the envelope math, for me kind of implies you need to get towards the higher end of seasonality, revenue seasonality in both 3Q and 4Q, if we take kind of the midpoint of your selling plus your ASP comments. But considering we have more products to sell, we'll get the load in and the sales and the sell through. Brian, I think you mentioned that you don't expect much growth from America in the second half. The good news is, we have, as I said in prepared remarks retrieve inventory in 9 to 10 weeks, which is pretty good. And historically, right where we would want them to be so that they're not missing sales. But if we keep selling through and see the demand, like we've been seeing in July, that maybe that doesn't get cut. I think, since the pandemic, I think we're seeing a little bit of a cycle too because North America back in the second half of â\u0080\u009820, first half of most of '21 was very strong for North America, and Europe and Asia were much more tempered on our business. And we're seeing that cycle, where North America over the last couple of quarters has kind of cut down a bit. So obviously, I think you move to the moving camera demand to the high end of your products set. But looking forward, it sounds like you're going to have an additional product launch this year. I think as we look at it going into next year, we expect to have APS continuing to go up more to the high end and more unit growth. And if North America can come back, if it's in recession, or going through some of those economic issues, if that comes back, then we do better. And I said this in the May call, as I looked at subscription, and the number of subscribers, we expected it 2.2 million that's going to continue to grow into 2023 given the model and we expect to see subscription revenue up about 50% year-over-year. It's up way up, already during that '21 over '20. So that's also going to have a positive impact on gross margin while we're at 40 points in 2020 or 2022, sorry I'd expect to be at least 2023 because of the growth in subscription. Brian, you mentioned Big Box retailer in North America, 9 to 10 weeks inventory. We see that's a good level because those are good, healthy in stocks where they don't lose camera sales as they, they could choose to drop inventory. But I think, if they go too low, even in seven, eight weeks, it could be stocked out and miss sales. Now maybe that comes back to gopro.com, too. But that's all  took the numbers down, right because we don't know exactly where they're going to go because they're managing their business too. No, it's more the latter. Yes, that's what I thought. Yes, just for the record, I mean, we've done a really, really good job of managing channel inventories and not getting over our SKUs because we know that if it goes too high, that's just trouble for us and for the retailers. So we've seen how that's played out, historically and we haven't had to do that in the last two years. Mr. speaker, I'd like to turn the conference back to you for any additional closing remarks. And thank you, everybody for asking Brian, all the questions."
}