{
    "symbol": "BSX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 12:08:04",
    "content": " In fourth quarter '22, total company operational sales grew 9% and organic sales grew 7% versus fourth quarter '21, which was the low end of the guidance range. Full year '22 operational sales grew 11% versus '21, while organic sales grew 9%, in line with our guidance of approximately 9%. Fourth quarter adjusted EPS of $0.45 declined minus 2% versus '21, and full year adjusted EPS of $1.71 grew 5% versus '21, both achieved in the low end of the guidance range. We are guiding to organic growth of 6% to 8% for both first quarter '23 and full year '23, which excludes the acquisition of Apollo Endosurgery and the majority stake investments in M.I. Europe, Middle East and Africa grew 11% on an operational basis versus fourth quarter '21 and 12% on a full year basis. In Latin America, the momentum continued with operational sales growth of 16% versus fourth quarter '21 and full year growth of 28%, with all business units growing double digits versus '21. Urology sales grew 12%, both operationally and organically versus fourth quarter '21 and on a full year basis. Endoscopy sales grew 7% organically in the quarter, and on a full year basis grew 8% organically versus '21. Within Arterial, we are pleased with the performance of our drug-eluting portfolio growing strong double digits for the full year and achieving the number one global position -- I'm sorry, the number one position within SFA in the U.S. On a full year basis, our venous franchise was flat versus prior year with Varithena, our market-leading varicose vein offering, growing over 20% in 2022. Within Cardiology, Interventional Cardiology Therapy sales grew 5% organically in fourth quarter and on a full year basis grew 8% organically versus '21. CRM sales grew 6%, both operationally and organically versus fourth quarter '21 and on a full year basis grew 8% operationally and 7% organically. Fourth quarter consolidated revenue of $3.242 billion represents a 3.7% reported revenue growth versus the fourth quarter 2021 and reflects a $158 million headwind from foreign exchange, slightly favorable to our expectations as the U.S. dollar weakened throughout the quarter. Sales from the acquisition of Baylis contributed 160 basis points resulting in 7.1% organic revenue growth at the low end of our guidance range of 7% to 9% growth versus 2021, including an approximate 200 basis point impact associated with an unplanned sales reserve related to an Italian government payback provision, which was recorded in the fourth quarter of 2022. Sales from closed acquisitions contributed 240 basis points, resulting in 8.7% organic revenue growth, in line with expectations and inclusive of a 50 basis point impact associated with the Italian sales reserve. Full year 2022 adjusted earnings per share of $1.71 represents 4.8% growth versus 2021, achieving the low end of our guidance range of $1.71 to $1.74. Adjusted gross margin for the fourth quarter was 70.5%, resulting in full year 2022 adjusted gross margin also of 70.5%, in line with our expectations. Fourth quarter adjusted operating margin was 25.7% resulting in full year 2022 adjusted operating margin of 25.6%, improving 30 basis points versus 2021, inclusive of a 30 basis point negative impact from the unplanned Italian sales reserve. And despite our expectation of continued macroeconomic headwinds, our goal is to achieve approximately 26.4% adjusted operating margin for the full year 2023, representing 80 basis points of improvement versus the 2022 adjusted operating margin of 25.6% and importantly, 50 basis points of expansion compared to the full year 2022 adjusted operating margin without the impact of the Italian sales reserve. On an adjusted basis, our tax rate for the fourth quarter was 11.9% and 12.7% for the full year 2022 and including discrete tax items and the benefit from stock compensation accounting. Excluding an approximate 100 basis point headwind from foreign exchange, based on current rates, and a 20 basis point contribution from closed acquisitions, we expect full year 2023 organic revenue growth to be in a range of 6% to 8% versus 2022. Excluding an approximate 350 basis point headwind from foreign exchange based on current rates and a 70 basis point contribution from closed acquisitions, we expect first quarter 2023 organic revenue growth to be in a range of 6% to 8%. Under current legislation and forecasted geographic mix of sales, we forecast a full year 2023 operational tax rate of approximately 14%, with an adjusted tax rate of approximately 13% including the benefit of the accounting for stock compensation, which we expect will largely be recognized in the first quarter, resulting in a Q1 2023 adjusted tax rate of approximately 12%. We expect full year adjusted earnings per share to be in a range of $1.86 to $1.93, representing 9% to 13% growth versus 2022. So, we expect potentially some sales growth challenges in Q1, but we do expect strong double digit for the full year, likely not at the same level as the 22% that we delivered in '22, but strong double digits nonetheless."
}