{
    "symbol": "VSH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 14:52:04",
    "content": " Vishay reported revenues for Q2 of $864 million, a quarterly record despite a temporary closure of two key facilities in Shanghai, China for over two months. Revenues in the quarter were $864 million, up by 1.1% from previous quarter and up by 5.4% compared to prior year. Reconciling versus prior quarter, adjusted operating income Q2 2022 compared to operating income for prior quarter, based on $10 million higher sales, or $24 million higher sales excluding ex rate impact, adjusted operating income increased by $12 million, to $158 million in Q2 2022 from $146 million in Q1 2022. Fixed costs were flat quarter-over-quarter, inventory impacts had a negative impact of $1 million, and exchange rates had a positive effect $4 million. Based on $44 million higher sales, or $78 million higher excluding exchange rate impacts, adjusted operating income increased by $33 million to $158 million in Q2 of 2022 from $125 million in Q2 2021. Selling, general and administrative expenses for the quarter were $110 million, slightly less than expectations due to foreign exchange effects. The expected share count for EPS purposes for the third quarter 2022 is approximately $143 million, excluding any impact of share repurchases. Global inventories in the second quarter increased $54 million or by 10% versus Q1, and were 28% above prior year that had been characterized, you remember, by a rather extreme shortages. Excluding exchange rate effects, sales in the second quarter were up by $24 million or 3% versus prior quarter, and up by $78 million or 10% versus prior year. Excluding exchange rate impacts, inventories in the quarter increased by $46 million, $10 million in raw materials and $36 million in WIP finished goods. Capital spending in the second quarter was $60 million versus $32 million in prior year, $38 million for expansion, $4 million for cost reduction and $18 million for the maintenance of business. And we generated in the second quarter free cash of $139 million on a trailing 12-month basis again, including $25 million taxes paid for the repatriation of cash. Sales in the quarter was $230 million, which includes $3 million from our new acquisition Barry Industries up by $11 million or by 5% from previous quarter, and up by $30 million or 16% is the prior year. Sales of inductors in Q2, were $90 million, up by $8 million or by 9% versus prior quarter and up by $6 million or by 7% versus prior year, excluding exchange rate effects. $7 million or 6% above prior quarter, and $90 million or 7% above prior year without exchange rate impacts. Sales in the quarter were $78 million, $1 million or 2% below prior quarter, but up by $6 million or 9% versus prior year, which excludes exchange rate impact. Sales in the quarter were $192 million, up by $13 million or 7% versus prior quarter and up by $24 million or 14% versus prior year, again without exchange rate effects. In the quarter, we had sales of $158 million, 13 million or 8% below prior quarter and $6 million or 4% below prior year without exchange rate impacts. It's calculated, the impact quarter-over-quarter is $10 million, if you compare the two quarters $10 million divided by $900 million sales approximately , right."
}