{
    "symbol": "VSH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:42:09",
    "content": " Revenues in the quarter were $925 million, up by 7.1% from the previous quarter and up by 13.7% compared to prior year. Reconciling versus prior quarter, operating income Q3 2022 compared to adjusted operating income for prior quarter, based on $61 million higher sales or $76 million higher sales, excluding exchange rate impacts, adjusted operating income increased by $25 million to $183 million in Q3 2022 from $158 million in Q2 2022. Reconciling versus prior year, adjusted operating income Q3 2022 compared to operating income in Q3 2021, based on $111 million higher sales or $155 million higher, excluding exchange rate impacts, adjusted operating income increased by $60 million to $183 million in Q3 2022 from $124 million in Q3 2021. Vishay in the third quarter achieved gross margin of 31.3% of sales versus 30.3% in the second quarter, adjusted gross margin of 31.3% versus 31.0% in Q2, an operating margin of 19.8% of sales versus 17.5% in the second quarter, adjusted operating margin of 19.8% versus 18.3% in Q2, earnings per share of $0.98 versus $0.78 in the second quarter and adjusted earnings per share of $0.93 versus $0.82 in Q2. Global inventories in the third quarter increased substantially by $92 million or by 16% versus Q2 and were 40% above prior year. Excluding exchange rate effects, sales in Q3 were up by $76 million or by 9% versus prior quarter and up by $155 million or by 20% versus prior year. We generated in the third quarter free cash of $193 million, again, on a trailing 12-month basis which also includes the $25 million taxes paid for the repatriation of cash. Sales in the quarter were $207 million, down by $1 million or by 0.5% from previous quarter but up by $40 million or 24% versus prior year. Sales of inductors in the third quarter were $84 million, down by $5 million or by 6% versus prior quarter and up by $1 million or 1% versus prior year, excluding exchange rate effects. Sales in the third quarter were at $126 million, $3 million  -- or 3% below prior quarter but $19 million or 17% above prior year which again excludes exchange rate impacts. Sales in the quarter were $73 million, $3 million or 4% below prior quarter but up by $7 million or 11% versus prior year which excludes exchange rate impacts. Sales in the quarter were strong at $209 million, up by $20 million or 11% versus prior quarter and up by $33 million or 19% versus prior year, again, without exchange rate effects. Sales in the quarter raised sharply to $225 million by $69 million or by 44% above prior quarter and by $56 million or 33% above prior year, all excluding exchange rate impacts. For the fourth quarter, we guide to a sales range between $860 million and $900 million at a gross margin of 30.0%, plus/minus 50 basis points."
}