{
    "symbol": "VSH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 14:21:09",
    "content": " Revenues in the quarter were $854 million, up by 1.3% from previous quarter and up by 11.7% compared to prior year. Reconciling versus prior year, operating income in Q1 2022 compared to operating income in Q1 2021 based on $89 million higher sales or $109 million excluding exchange rate impacts. Excluding exchange rate effects, sales in Quarter 1 were up by $16 million or 2% versus prior quarter and up by $109 million or 15% versus prior year. In semis, prices went up in the quarter by 3.4% versus prior quarter and by 8.8% versus prior year and in passives vis-a-vis prior quarter by 1.4% and by 3.2% versus prior year. Excluding exchange rate impacts, inventories in the quarter increased by $77 million, $29 million in raw materials and $41 million in WIP and finished goods impacted by interruptions of the supply chains due to pandemic related issues, some additions to safety stocks, revaluation impacts as well as inflation on materials and logistics costs. Capital spending in the first quarter was $36 million versus $29 million in prior year, $24 million for expansion, $2 million for cost reduction and $10 million for the maintenance of business. We expect capex of approximately $325 million, which is a substantial increase versus prior years, mostly due to our project of building a 12-inch MOSFET fab. Sales in the quarter were $207 million, which includes $4 million from our new acquisition Barry industries, up by $19 million or by 10% versus prior quarter and up by $27 million or 15% versus prior year again, excluding X rate impacts. Selling prices for resistors continue to increase, plus 1.9% versus prior quarter and plus 3.4% versus prior year. Sales in the inductors in the first quarter were $83 million, slightly up by $1 million or by 1% versus prior quarter and flat versus prior year excluding exchange rate effects. Sales in the first quarter were at $128 million, flat versus prior quarter, about $26 million or 25% above prior year, again excluding exchange rate impacts. Sales in the quarter were $81 million, $3 million or 4% above prior quarter and $5 million was 7% above prior year, which excludes exchange rate impacts. Gross margin in the quarter increased sharply to 40% of sales, up from 34% in prior quarter, mostly due to better selling prices and the favorable product mix. Sales in the quarter were $182 million, down by $9 million or by 5% versus prior quarter, but up by $29 million or 19% versus prior year without X rate effects. Sales in the quarter were $173 million, especially capacity constraint, $2 million or 1% above prior quarter and $22 million or 14% above prior year without X rate impacts. Taking into account the present pandemic related disturbances in Shanghai, which in the second quarter will cost us at least $35 million of sales, we had Q1 rates guide to a sales range for Q2 of $830 to $870 million at a gross margin of 28.1% plus-minus 50 basis points."
}