{
    "symbol": "FTCH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 17:59:04",
    "content": " As a result of this initiative, Q3 gross profit margin increased 160 basis points year-on-year to 45% and digital platform order contribution margin expanded 580 basis points year-on-year to 32.4%, and we plan to extend this trading strategy through Q4. With respect to Q3 2022 profitability, order contribution margin was up 580 basis points year-on-year to 32.4%, reflecting ongoing efforts to drive margin improvements, and our cost of technology and operating overheads were lower quarter-on-quarter. The brand platform generated gross profit of $81 million at a 49.8% margin, an increase of 120 basis points year-on-year, which was driven by the additional net economic benefit from the Reebok partnership. Loss after tax was $275 million, after the following non-cash items: an increase in financing costs year-on-year due to unrealized FX losses, an increase in depreciation and amortization year-on-year as we started to amortize the Reebok partnership licensing agreement in March, higher share-based payments due to 2022 equity grants and an impairment charge on our Browns business as a result of impacts of the macro environment. Please unmute your audio and ask your question. Please unmute your audio and ask your question. And when you do remove your demand generation spend as we have done year-on-year, by bringing it down to the lowest level in five quarters at 19% of revenues, you're effectively removing that marginal incremental customer that isn't that valuable. Please unmute your audio and ask your question. Please unmute your audio and ask your question. That's led to this demand generation reduction year-on-year of 17%, which is driving the order contribution margin up by 580 basis points as well as, obviously, the strength of the third-party gross margins, as I touched on before. Please unmute your audio and ask your question. Please unmute your audio and ask your question. Please unmute your audio and ask your question."
}