{
    "symbol": "FTCH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-25 21:27:04",
    "content": " Outside of these three factors, which were expected and discussed on our Q1 2022 call, Q2 underlying performance remained very strong, with full-price marketplace GMV, excluding Russia and Mainland China, growing circa 20% year-on-year for the second consecutive quarter. As such, we have reorganized the business according to these principles and have created two new roles: Chief Marketplace Officer, who will be accountable for the performance of the Marketplaceâ\u0080\u0099s BU and Group President, whose role is to position our Farfetch group capabilities to the industry, ensuring our three BUs work together to deliver on Farfetchâ\u0080\u0099s mission to be the platform for luxury. We continue to see strong brand engagement on the platform with brands continuing to increase their supply in the marketplace, up double digits in Q2, and working with us on unique collaborations and launches, demonstrating our strategic value as the online partner of choice for the luxury fashion industry. The major drivers of reported GMV and revenue growth included high-single-digit growth in the marketplace, outside China and Russia, including growth in full price of 20% year-on-year. Reported Digital Platform GMV declined year-on-year by 3% to $883 million, but grew 2% year-on-year at a constant currency, which was slightly lower than the Q1 2022 constant currency growth of 5% year-on-year as Q2 had a full quarter of impact from reduced trade in Russia and China. During the second quarter, we resolved the warehouse issues impacting our operations in Q1 and alongside strong demand for NGG brands, Off-White and Palm Angels, delivered Brand Platform GMV of $107 million, an increase of 47% year-on-year or 68% on a constant currency basis. As a result, our full year expectations are: Digital Platform GMV growth of 0% to 5% year-on-year; Brand Platform GMV growth of 0% to 10% year-on-year: Digital Platform order contribution margin above 30%; and Brand Platform gross margins about 50%."
}