{
    "symbol": "HCDI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 15:03:13",
    "content": " As of September 30, 2022, our backlog of fully executed contracts for the sales of developed residential lots and single family homes was $6.9 million, an increase of 81% from the prior year. Our fee build backlog as of September 30, 2022 was $2.1 million compared to $12.6 million in the prior year. During the third quarter, sales decreased by 34.8% to $11.7 million as compared to $18 million for the prior year period. The $6.7 million decrease in gross profit and 35.9% decrease in gross margin was primarily due to the non-recurrence of higher margin entitled land sales in the third quarter of 2022 and a decrease in fee build gross margin due to cost overrun disclosed during the second quarter. Our operating expenses increased to $4.5 million for the three months ended September 30, 2022 as compared to $3.3 million for the three months ended September 30, 2021. Net loss for three months ended September 30, 2022 was $3.4 million as compared to net income of $3.7 million for the three months ended September 30, 2021. For the three months ended September 30, 2022, we had a basic loss per share of $0.37 compared to basic earnings per share of $0.21 for the three months ended September 30, 2021. Net cash used in operating activities for the quarter ended September 30, 2022 was $32.6 million compared to cash used by operating activities of $18 million for the quarter ended September 30, 2021. Our real estate assets have continued to increase to $179.9 million as of September 30, 2022 from $122.1 million as of December 31, 2021. Sales for the first nine months of 2022 increased by 10% to $50.6 million compared to $46 million for the first nine months of 2021. The sales improvement in 2022 was primarily due to increases in home sales of $11.5 million, fee build revenues of $3.6 million and developed lot sales of $1.3 million, partially offset by a decrease in entitled land sales of $11.9 million. The $6.5 million decrease in gross profit in 2022 was primarily due to the decrease of entitled land gross profit of $4.5 million and fee build gross profit of $3.8 million, partially offset by $2.4 million increase in gross profit from home sales. The decline in net income was primarily attributable to cost of sales overruns with our fee build projects, less volume of high margin entitled land sales and increased operating expenses in the first nine months of 2022. For the first nine months of 2022, we had a loss per share of $0.88 compared to basic earnings per share of $0.17 for the first nine months of 2021. Our full year financial outlook for the 12 months ended December 31, 2022 now includes the following: Revenue in the range of approximately $61 million to $65 million compared to our previous range of $80 million to $90 million; adjusted EBITDA between a loss of approximately $5 million and a loss of $7 million compared to our previous expectation, which was at or around breakeven."
}