{
    "symbol": "QMCO",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-09 22:03:07",
    "content": " Earlier today we announced results for our fiscal first quarter, with revenues of $89.1 million, up 22% year-over-year and both adjusted net income and earnings per share at the high-end of our guidance. As of the first fiscal quarter, our backlog has grown to $30 million compared to $14 million in the previous quarter and $2 million in the year ago period. As Jamie mentioned, first quarter revenue was $89.1 million, up 22% from the same period last year. Our backlog grew to $30 million at the end of the June quarter, with a significant order contribution from our hyperscale customers. GAAP net loss in the first fiscal quarter was $4.2 million or a loss of $0.07 per share compared to a net loss of $17.5 million or a loss of $0.35 per share in the prior fiscal quarter, which included a debt extinguishment charge of $14.8 million related to the retirement of 50% of our senior secure term loan last quarter. Excluding stock compensation, restructuring charges and non-recurring charges, non-GAAP adjusted net income in the first fiscal quarter was $125,000 or breakeven compared to adjusted net income of $2.1 million or $0.03 per share in the prior quarter. Adjusted EBITDA during the first fiscal quarter was $5.4 million, which reflects an increase of $4 million on a year-over-year basis and a $3 million decrease sequentially, primarily due to lower revenue and higher operating expenses. Adjusted working capital, excluding deferred revenue balances, increased by $2.8 million during the first fiscal quarter to $58.1 million from $55.3 million at the end of the prior fiscal quarter. During the first fiscal quarter, before the effect of changes in assets and liabilities, cash generated from operations was $3 million, offset by $10 million in net cash used by changes in working capital accounts. Other notable uses of cash in the first quarter of fiscal 2022 were $1 million in capital expenditures and the paydown of long-term debt of $500,000. Given the ongoing supply chain shortages for the second fiscal quarter of 2022, we are guiding revenues of $88 million plus or minus $4 million, which includes a $2 million contribution from the Pivot3 acquisition, non-GAAP adjusted net loss of $2 million plus or minus $1 million, non-GAAP adjusted net loss per share $0.04 plus or minus $0.02, and adjusted EBITDA of $2 million plus or minus $1 million. And is it reasonable to think that just adjusting for the timing of the deal that the current quarter's revenue would be a reasonable proxy for what you could do going forward, or can some of the synergies that Jamie talked about in his prepared remarks start to hit as we get into fiscal third quarter or fiscal fourth quarter of the year there. I think that the easiest way to characterize that, Dave, is when you look at our backlog, the $30 million of backlog that we carried out of the quarter, roughly a third of that had -- we had the parts, we could have shipped within the quarter. Look, I think we expect the backlog in our traditional hardware based products to go back to the sub-$5 million level where it's insignificant. And then, could you perhaps give us your kind of goals in the surveillance business now that you've got a platform and 500 customers, and you're doing $2 million a quarter, let's say, as your run rate."
}