{
    "symbol": "QMCO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-08 23:14:03",
    "content": " Our fiscal year 2022 revenue grew 6.7% year-on-year and we made significant progress towards building recurring revenue, exiting fiscal year 2022 with $7.4 million of subscription software ARR and $160.5 million in high value recurring revenue. Turning to results for the fourth quarter, revenue was $95.2 million, an increase of 3% year-over-year and flat compared to the prior quarter, and above the preliminary revenue results we provided in mid-April. Backlog decreased slightly to $60 million compared to $62 million last quarter, as we continued to be supply constrained primarily on tape drives, as well as broad based shortages of components for servers, network cards and circuit board. For fiscal year 2022 total revenue increased 6.7% to $372.8 million with year-over-year growth primarily driven by strong demand from the hyperscaler customers, combined with an increase in software subscription revenue and video surveillance product and services revenue related to our recent acquisitions. GAAP net loss in the fourth fiscal quarter was $7.8 million or a loss of $0.13 per share, compared to a net loss of $11.1 million or a loss of $0.19 per share in the prior fiscal quarter. Excluding stock compensation, restructuring charges and non-recurring charges, non-GAAP adjusted net loss in the fourth quarter was $2.8 million or $0.05 per share compared to adjusted net loss of $4.6 million or $0.08 per share in the prior quarter. The net cash used related to changes in assets and liabilities was $30.5 million and primarily represented increases in inventories, including pre-buys of inventory for the contract manufacturer of approximately $19 million and reductions in liabilities that include AP, accrued compensation restructuring and deferred revenue in total approximated $11 million. Non-GAAP adjusted net loss is expected to be $3 million, plus or minus $1 million and adjusted net loss per share of $0.04 plus or minus $0.01 per share, using the share count of $83.6 million to reflect the shares issued during the first quarter related to the rights offering, and we expect adjusted EBITDA in the fiscal first quarter to be breakeven plus or minus $1 million."
}