{
    "symbol": "QMCO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-09 22:56:02",
    "content": " Revenue was $95.3 million with backlog increasing sequentially to $62 million, another quarterly record for the Company, with strong demand offset by ongoing supply chain headwinds. As Mike will discuss, we estimate that roughly $26 million of customer orders in the quarter could not be fulfilled, which had a major impact on revenue, gross margins, earnings and adjusted EBITDA. As a result of the continued strong customer demand, coupled with the supply chain constraints, the customer order backlog grew over $10 million during the quarter to $62 million from $50 million last quarter and $30 million as of June 30, 2021. Approximately $26 million of orders in the ending backlog could have been shipped to customers in the third fiscal quarter, if we would have had the support from the supply chain. During the third fiscal quarter, secondary storage revenues were up 17% sequentially, primarily driven by the increase in hyperscaler revenues as well as the improving supply of LTO-7 and LTO-8 drives that help support sequential revenue growth. Given the continued pressure on revenues due to the supply chain constraints, combined with the increasing supply chain cost environment, in addition to increasing our prices, we are also implementing certain operating expense reduction programs in the fourth fiscal quarter. This compares to a net loss of $9.3 million or a loss of $0.16 per share in the prior fiscal quarter, which included a debt extinguishment charge of $15 million, partially offset by a gain of $10 million for the forgiveness of the PPP loan. Excluding stock compensation, restructuring charges and nonrecurring charges, non-GAAP adjusted net loss in the third fiscal quarter was $4.6 million or a per diluted share loss of $0.07 compared to adjusted net income of $114,000 or breakeven in the prior quarter. Adjusted EBITDA in the third fiscal quarter was $0.8 million, reflecting lower-than-expected revenues and gross margins due to the unprecedented headwinds we have faced related to the supply chain constraints and related increased costs. Adjusted working capital, excluding cash and deferred revenue balances increased by $6.5 million during the third fiscal quarter to $62.3 million from $55.8 million at the end of the prior fiscal quarter. Taking these factors into consideration for the fourth fiscal quarter of 2022, we are guiding revenues of $92 million, plus or minus $5 million; non-GAAP adjusted net loss of $4 million, plus or minus $1 million. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}