{
    "symbol": "EFC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 17:35:06",
    "content": " Net interest income on our credit portfolio increased significantly quarter-over-quarter, driven by the larger portfolio, while we also had strong performance from our CLO and CMBS strategies, and significant net gains on interest rate hedges and retained non-QM tranches, driven by the appreciation of our non-QM interest-only securities. Our weighted average borrowing rate increased by 115 basis points sequentially to 3.76% at quarter end, driven by higher short-term rates and a greater proportion of our borrowings secured by our loan portfolios, which carry higher borrowing rates and agency assets. Agency MBS, for example, is against functioning as a relative value market, not just the market absorbing forced liquidations and unlike some days in the third quarter, there is good two-way flow now, spreads are moving predictably, with liquid credit indices and balance sheet constraints no longer seems to be the overriding concern, and with spreads extremely wide, the forward-looking opportunity looks attractive. So I think the unrealized -- a portion -- I can give you better numbers, but big picture, a good chunk of our losses to date have been unrealized year-to-date, whether thatâ\u0080\u0099s in the agency strategy, where there is a component thatâ\u0080\u0099s unrealized, whether itâ\u0080\u0099s on our originator stakes, where we took those stakes down to the point, Longbridgeâ\u0080\u0099s mark, below book representing the transaction value of LendSure, we took down, which the company has big cash -- sizable balance sheet with cash balances and I think thereâ\u0080\u0099s upside there. And so I think one thing thatâ\u0080\u0099s been interesting about 2022 and itâ\u0080\u0099s going to really distinguish it relative to other years is it going to be the lack of bank buying of securities and thatâ\u0080\u0099s been on Agency MBS, itâ\u0080\u0099s been AAA CLO, itâ\u0080\u0099s been across the Board, so itâ\u0080\u0099s been a lot written how banks are struggling with diminished capital as they have had to absorb a lot of mark-to-market losses in available for sale portfolios. When we started the small balance commercial strategy in Ellington Financial, it was 100% non-performing loans and it was buying things that came from the old Washington Mutual portfolio, the old GreenPoint portfolio that had big -- those companies, those banks had -- were both acquired during the financial crisis and they both had a lot of headaches in their fall balance commercial portfolio and the acquirers, we are selling a lot of delinquent loans and so."
}