{
    "symbol": "EFC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 15:52:05",
    "content": " Our loan origination businesses provided much of our asset acquisition volume during the quarter, but we also took advantage of the market, sell off through secondary market purchases of discounted nine QM loans and credit, most notably credit risk transfer bonds or CRTs to illustrate just how much spreads have widened in CRTs. But there will be a lack in any event, ADE which is a backward looking measure, has its limitations as a measure of the full earnings power of our portfolio, especially in a market with large swings and interest rates and spreads like we're seeing today and where liabilities are repricing faster than assets like they did this past quarter, but this is where the relatively short duration of so much of our credit portfolio comes into play in a big way. That 112 million was distributed as follows 53% and reverse mortgage loan origination, 30% in non QM loan origination, 10% in consumer loan origination, 3% in residential transition loan origination, and 2% each in small balance commercial and conventional mortgage loan origination for the second quarter, total G&A expenses decrease sequentially by $0.03 cents per share to 14 cents while other investment related expenses decreased by $0.07 cents per share to $0.09 driven primarily by the costs associated with the senior note offering that we fully expensed in the previous quarter. And a lot of it, I think we can earn back because much of the loss was due to spread widening on non-term loans and agency MBS as is often the case after a quarter like that, the going forward opportunity set looks really good today. And some reasons of the country given poor housing affordability during the second quarter, any sector with a lot of interest rate risk, a lot of volatility exposure or where pricing is dependent on the securitization execution got hurt, not surprisingly, then our non-term strategy was our biggest drag this past quarter to put the spread widening on non QM this year in perspective, consider these two data points on January 14th, we priced the first non QM deal of the year. We have recently been able to purchase new non QM loans with mid to high 7% coupons and with interest rates lower over the past few weeks, the economics on these new loans look very attractive, especially relative to the stabilization we're seeing in the nine QM securitization market. I pointed this to this out on previous calls, but in this environment of rising rates and market turbulence, it's worth highlighting again, our low level of interest rate sensitivity in the table on Slide 12, the fifth line down non-agency RMBS CMBS, other abs and mortgage loans captures the vast majority of our long credit portfolio. And that's even before taking into account or interest rate hedges, we've accomplished this by focusing a significant segment of this portfolio on products like one to two year commercial real estate bridge loans, sub one year average life, residential transition loans and short term consumer installment loans, particularly as market volatility, spikes and spreads widen. So if you take away that, I think my projection is that just at these higher note rates and also at higher HCA, you're probably just going to see organic non-QM volume dropped by I would guess at least 30%, I just think it's fewer borrowers qualify. So it's much more, what's going to drive the returns on those things is going to really have a lot to do with loan performance as you're not, it's not like buying, a more senior security where it's more like prepayments and spread, what happens to spreads you're down at the capital structures, you're exposed to the credit risk and Larry mentioned on the call, but one of the benefits of having these original stakes is you, we have an active dialogue in terms of underwriting standards and how we should be reacting to changes in the market and changes in the housing market. So that blows up your recourse leverage by $350 million, which is not a small number given, we have a billion dollars of equity, but in terms of how many really sort of assets you've added to the balance sheet it's a, that's a relatively small number we're retaining more now, so that that percentage has increased, but still relative to the size of the balance sheet, the amount of retained tranches, that we add when we do a securitization is still pretty low. So hopefully it's a short term phenomenon in asset yields catch up and we mentioned that we've been able to push spreads and we're seeing higher yields and spreads in the market, and certainly the market yields on our portfolio were both up sequentially by 60 basis points, give or take on the asset side. We talked about, some of it is just taking advantage of the right time to sell some of the agency pools that we have and replace them, just, naturally which whatever is in the market at time, but that's going to recharge and the other thing I want to mention is that it hasn't been that long where and they're still going to be going up where short term, money market rates are higher."
}