{
    "symbol": "EFC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 17:46:06",
    "content": " Moving forward, after we get fully invested and take advantage of today's much higher reinvestment yields, we expect core earnings to again cover our current quarterly dividend run rate of $0.45 per share. You can also see on this slide, that the weighted average market yield on our credit portfolio increased by about 10 basis points sequentially which we expect to increase further as the yields on our portfolio adjust to wider yield spreads and rising rates while the blended yield on our agency portfolio increased a full percentage point quarter-over-quarter to 3.2%. And we completed a consumer loan securitization, which removed $36 million of borrowings from our balance sheet Finally, we added an additional financing facility for our commercial mortgage origination business Our overall debt-to-equity ratio adjusted for unsettled purchases and sales increased to 3.2:1 as of March 31, from 2.8:1 at year-end, driven primarily by increased borrowings on our larger credit portfolio and by the issuance of the unsecured notes. Our weighted average borrowing rate increased by 54 basis points to 1.78% as of March 31, due to the combination of higher short-term rates the new senior unsecured notes and disproportionately more borrowings on our loan portfolios, which carry higher borrowing rates relative to agency. Your line is open. Your line is open. Your line is open. Your line is open. Hi, Brock I think it – look last year and I sort of mentioned this in my prepared remarks you had a combination of very high volumes because the housing market was on fire very high volumes and very high loan prices right because you had relatively tight securitization spreads from the yield curve was at low levels, which is where you price a lot of the non-QM bonds off of. Your line is open. Your line is open. And the other thing I would say is, with the curve a lot flatter and given the certainly the short-term dynamics of what's going on in non-QM market I think that the you're going to see 7% note rates real soon."
}