{
    "symbol": "ENV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 16:01:04",
    "content": " Before we begin, Iâ\u0080\u0099d like to point out that our earnings press release, supplemental presentation and associated Form 10-Q can be found under the Investor Relations section of our website at envestnet.com. During the call, we will be discussing certain forward-looking information. I encourage you to review the cautionary statement on Slides 2 and 3 for potential risks, uncertainties and other factors that could cause actual results to differ from those expressed by the forward-looking statements. Joining me on todayâ\u0080\u0099s call are Bill Crager, Envestnetâ\u0080\u0099s Chief Executive Officer; and Pete Dâ\u0080\u0099Arrigo, Envestnetâ\u0080\u0099s Chief Financial Officer. Bill and Pete will provide a company update, as well as an overview of the companyâ\u0080\u0099s third quarter 2022 results. During the Q&A, please limit yourself to one question plus one follow-up. Good evening, everyone, and thank you for joining our third quarter earnings call. Weâ\u0080\u0099ve grown the number of services our clients are leveraging from us, grown the number of users utilizing our D&A products and won the important mandates that weâ\u0080\u0099ve competed for. But first, it is important to understand that while we navigate the market and economic cycle, there is another very powerful trend at work. This is a super cycle as data, intelligence and digital engagement transform our industry to connected, hyper-personalized active advice. To step back for a moment, Envestnet drove the last transforming cycle, cloud-based, feed-based, independent advice. When you look at Envestnetâ\u0080\u0099s growth over the years, it becomes so evident how essential Envestnet has become to the core of the advice industry. As we enabled the movement to fee-based, the assets on our platform grew at a 42% CAGR from 2010 to 2020, while the total advice industry grew only at 13% during the same period of time. During the cycle, we created significant value for our shareholders. Given our increasingly connected ecosystem, the intelligent digital capabilities we offer, these are beginning to drive this generationâ\u0080\u0099s super cycle. This is what makes us even more essential, more embedded, more competitively differentiated. We are continuing to digitize, streamline and foster more productive partnerships that expand our capabilities and generate new revenue streams. And importantly, across our business we have made meaningful progress on the path towards margin expansion. In our Wealth segment, net AUM/A flows were positive, above both industry and our peer group. During the quarter, we increased the number of accounts we serve, and the number of accounts per adviser increased 8% year-over-year. This is an intended focus of ours, and weâ\u0080\u0099re not surprised that clients are utilizing more and more of Envestnet services. This growth will drive accelerated gains as current market conditions normalize, something that Iâ\u0080\u0099ve referred to in the past as the coiled spring. We continue to expand the footprint of who we serve and the solutions that they use, which also generates more revenue growth. On our client roster, weâ\u0080\u0099ve recently been engaged by a national credit union, we signed a national RIA as a planning client, we expanded our partnership on fiduciary and 401(k) solutions with a national wirehouse firm, and finally, we saw strong conversion activity during the quarter. 38% year-over-year growth for tax and impact overlay as well as direct indexing, and well over 100% year-over-year growth in our high net worth solutions. These are especially notable as these are Envestnet managed solutions, meaning we capture 100% of the economics. In our Data and Analytics segment, we have substantially grown the number of paid users to over 37 million today, and thatâ\u0080\u0099s up from 25 million in 2019. As economic conditions improve, this will be another coiled spring for our business. Total number of transactions that weâ\u0080\u0099ve tracked this year are estimated to be 48 billion, which is 2.5x what it was in 2019. Additionally, the launch of the Wealth Data Platform is a clear example of how we are creating value for our clients and driving incremental revenue growth. The platform allows home offices and advisers to connect, to aggregate, protect and analyze their own data. It also generates extraordinary intelligence, as we have grown the number of insights we publish to over 20 million a day. Over the past 16 months within the tax overlay program, advisers utilizing insights have experienced 57% growth in assets, while advisers without insights have only grown at 20%. There is very strong interest in growing utilization, which drives more and more flows, which means our advisers will experience faster growth, as will Envestnet. We expect the wealth data platform to generate more than $35 million in annual revenue by 2025, and the platform insights will continue to generate even greater usage of our marketplace of fiduciary solutions, which will capture additional recurring revenue from this critical offering. We recently announced a partnership with FNZ, a global leader in wealth management solutions. We are partnering with them to create a fully end-to-end, from prospect to client, from plan to portfolio, to execution and custody, digital environment that will automate, scale and fully digitize our clientsâ\u0080\u0099 engagement with Envestnet. This is another very significant step in value creation, and it enables us to pursue expanded revenue opportunities associated with custody, captured through our platform technology integrated with FNZ. In addition, FNZ will distribute the Envestnet Wealth Data Platform to their international clients, which represents a major step for Envestnet in the international wealth market. As we grow and are defining the competitive landscape by bringing the intelligent and transformational capabilities to the industry, weâ\u0080\u0099ve been investing. Earlier this year, we completed the investment-driven hiring cycle and reached our peak in personnel in the first quarter. Weâ\u0080\u0099ve seen the benefit of this talent in so many ways over the last quarters, and the marketplace is recognizing this as well. With that said, we recently announced an agreement with Tata Consultancy Services to outsource our data and analytics operations in Bangalore. This partnership allows us to transition resources to TCS, giving us operational flexibility and scale, while generating an estimated cost saving between $10 million and $13 million in 2023. Weâ\u0080\u0099re also modernizing our operating environment for our Wealth business by consolidating and cloud scaling our portfolio trading, accounting, reconciliation and reporting capabilities. This modernization will positively impact our bottom line in late 2023, with additional benefit realized from 2024 to 2026. As we put these systems into production, we have seen a significant efficiency and productivity lift that ultimately will create cost leverage across our business. Given the steps that we are taking, we believe that by year-end, Envestnetâ\u0080\u0099s personnel will be nearly 25% lower compared to the peak in the first quarter of 2022. We are investing in future capabilities, while rebalancing the organization to be more efficient in all areas of our business. Lastly, another meaningful effort that has a long-term client benefit and cost impact for our business is the successful integration of each of our recent acquisitions to maximize the value of these new additions to the Envestnet family. Redi2 integration is on track, while also winning exciting new mandates with these revenue management offerings. But I want to say this, we remain committed to achieving the 25% adjusted EBITDA results by 2025 and believe we are taking the steps despite this market to achieve that result. With that, let me turn to Pete so he can share results as well as what we expect for the rest of the year. Envestnet continues to proactively drive our strategic imperatives, while responding to headwinds created by the economy and the capital markets. For the third quarter, our financial results exceeded our guidance with adjusted revenue of $307 million, adjusted EBITDA of $53.5 million and adjusted earnings per share of $0.45. While the performance in Q3 was favorable, the near-term outlook for the Wealth segment, again, was adversely impacted by unfavorable equity and bond markets. Importantly though, in Q3, Envestnet continued to deliver positive net flows well above most peers. Over the last 12 months, we have posted $81 billion of net flows or an annualized organic asset growth rate of 11%. Also, the addition of over 100,000 AUM/A accounts and continued increase in accounts per adviser within the quarter demonstrate the importance of our platform to our clients through challenging times. Our Data and Analytics business also performed well in Q3, although continues to face pressure as the economy is impacting its asset manager and fintech client base. As Bill noted, we continue to make progress as we transform this segment from a product subscription strategy to a platform model with emphasis on content for wealth management, consumers and small businesses. Now Iâ\u0080\u0099d like to discuss our recently announced partnership with TCS, which provides a significant expense saving opportunity for Envestnet, which will generate substantial progress as we work toward our margin goals. The TCS partnership allowed us to effectively transfer Envestnet employees to one of the worldâ\u0080\u0099s largest consulting companies, which should allow us to scale this function in future years, consistent with the anticipated growth of the business. In doing so, we expect to get an immediate expense savings, with a full year benefit in 2023. For the fourth quarter, we expect adjusted revenues to be between $294 million and $296 million, adjusted EBITDA to be between $52 million and $54 million and adjusted EPS to be $0.42 to $0.43 per share. For the full year, we expect adjusted revenues to be between $1.241 billion and $1.243 billion, adjusted EBITDA to be between $218 million and $220 million and adjusted EPS to be between $1.82 and $1.84. Our guidance, as always, does not assume any changes in the capital markets from the prior quarter end. And as such, is based on market levels as of September 30. Looking ahead to 2023, as is our standard practice, we wonâ\u0080\u0099t be giving specific guidance until our next call in February. However, taking into consideration the market levels as of September 30, the annualization of this yearâ\u0080\u0099s market performance would present roughly a 6 to 8 percentage point headwind to our 2023 revenue growth rate, in addition to the approximately 6 to 8 percentage points of market impact to our 2022 revenue growth rate. Despite these challenges to top line growth and given market values as of September 30, we currently expect to increase our EBITDA margin in 2023 by around 100 to 125 basis points compared to 2022. Iâ\u0080\u0099d also like to add some context around a few items that do not impact our reported non-GAAP financial results, but do affect free cash flow. As we have implemented our broader strategy in 2021 and 2022, we have experienced increases in certain items, such as capitalized software. We have consolidated portions of the business, and we are implementing practical cost management given the very difficult market climate, creating a series of restructuring costs, including a write-down of our real estate footprint. We expect the growth rate of several of these items to come down significantly going forward, especially compared to the increase we saw from 2021 to 2022, and some areas we expect to come down in absolute terms. We ended September with $241 million in cash and debt of $863 million, making our net leverage ratio approximately 2.8x EBITDA. As youâ\u0080\u0099ve heard tonight, we have reported a positive quarter despite the historic headwinds that we face. We drove $27 billion of net flows during the quarter and onboarded over 100,000 net new accounts to the platform. After the quarter ended, we took important strategic steps announcing 2 exciting partnerships. And as I stated a few moments ago, we are operating more efficiently, scaling, automating, lowering the cost to administrate our business, while we invest in the areas of growth and long-term value creation. We are executing our strategy, which creates significant value for our clients and for the industry, while it enables our business to capture the next leg of accelerated growth and margin expansion. Today, we once again are leading a transforming super cycle of data intelligence, digital engagement and personalized offerings. We are delivering more, more effectively, making ourselves even more essential to the industry and to our clients. The people of Envestnet lean in, lead and execute. Envestnet is the most open architecture environment in the industry, period. But in our conversations with clients, they are looking for more digital options, more efficient operating environments. And Envestnet took the step, and weâ\u0080\u0099re driving that advancement in our mind with this partnership. We are accelerating FNZâ\u0080\u0099s entry into the United States market, and they are bringing us into the international markets. We also have a very complementary approach to how we approach our clients, working collectively to create success and growth and also profitability for our clients. So with FNZ, Envestnet will provide the leading capabilities on the front end, everything that weâ\u0080\u0099ve modernized and all the operating technologies that we offer the marketplace today. And with FNZ, we will deliver the most advanced digital automated opening and servicing for the full life cycle of a client account, which includes custody. And so itâ\u0080\u0099s a truly kind of digital end-to-end environment that weâ\u0080\u0099ll be introducing to the market, Devin. It opens up some new revenue streams for Envestnet which weâ\u0080\u0099re excited about, and I think over time are meaningful for us. As we use our technology platform to enable services like custody, you noted that, thereâ\u0080\u0099s also cash management, thereâ\u0080\u0099s also lending, other capabilities that utilizing our technology platform will be able to enable. As we approach that kind of entry or release into the market, weâ\u0080\u0099ll start to forecast what contribution from a revenue standpoint, we think this can produce for us. But I do believe, given the streamlined digital nature of this, and the real-time nature of the data that weâ\u0080\u0099ll be able to provide during that account opening and administration process, it is differentiated and has the opportunity to be very successful. And I would just add to that, in addition to that, there is the global distribution of certain solutions that Envestnet will work and partner with FNZ to FNZâ\u0080\u0099s international client base. I was surprised to not see an update in your prepared remarks, unless I missed it, or in the deck around the personalized solutions. I think in the last few quarters, youâ\u0080\u0099ve given the AUM number and even last quarter, the account numbers, I thought that was going to be a major KPI for you to measure success. Iâ\u0080\u0099d mentioned, Alex -- thank you -- I mentioned in the script, but Iâ\u0080\u0099ll just kind of highlight some of the progress there. So direct indexing, year-over-year assets are up 4% despite the market. And adviser growth, the number of advisers using the direct index product is 53% growth. And on overlay, 2% year-over-year asset growth. Again, impressive given the headwinds of the market. Sustainability, as you know, is an asset class that has been reasonably challenged from a performance standpoint. That said, weâ\u0080\u0099re eking out growth, $36 billion in sustainable assets on the platform. Weâ\u0080\u0099ve got accounts up year-over-year by 9% despite the performance headwinds, and advisers are growing as well for that solution. So we -- it continues to be a major focus, which I highlighted in the prepared remarks, and something that will become a more and more meaningful driver of our growth as we penetrate the asset base, which is an intended focus of ours. But when I think back to the IPO days, I remember that your, I guess, back-office organization overseas, was, I think, you view it as a key differentiator, and you really wanted to have control because everything needed to be right, everything needed to be timely, et cetera. And looking forward, are you at all worried that as you lose control that, A, at some point the costs may balloon because you donâ\u0080\u0099t control it anymore or the, I guess, the service may go down. But related to that, $10 million to $13 million in savings, thatâ\u0080\u0099s a â\u0080\u009823 number. One for data and analytics, and thatâ\u0080\u0099s the office in Bangalore, which weâ\u0080\u0099ve transitioned to TCS, and Iâ\u0080\u0099ll talk about why and the thought process around that. The other one is in Trivandrum, and that supports our wealth platform. We continue to believe that we can create a substantial competitive advantage, utilizing the wealth infrastructure and the wealth back office. At our peak -- at some point this year, we were at $5.7 trillion in assets served. Weâ\u0080\u0099re trading millions and millions of blocks, tens of millions of trade blocks each quarter, weâ\u0080\u0099re servicing 18 million-plus accounts. Weâ\u0080\u0099re committed to it, and weâ\u0080\u0099ll continue to invest in it. That said, with the Bangalore operation, which is the operation that TCS -- weâ\u0080\u0099re partnering with TCS on, the business weâ\u0080\u0099ve seen has transitioned pretty substantially from a screen scraping administrated business to more of an open banking and direct connectivity, and thatâ\u0080\u0099s something that weâ\u0080\u0099ve driven. Weâ\u0080\u0099ve driven a network of direct connections with more and more financial institutions to streamline the way data moves around the system versus the hard, old-school way of screen scraping. So as we look forward, we think there is so much more agility with TCS as it transitioned from the former way, that screen-scraping administrative platform to open banking, and really saw that as an opportunity to transition that pool of resources in an effective way to create immediate and near-term cost savings, â\u0080\u009823 noted, $10 million to $13 million. But as we go forward and we scale as our volumes grow, which theyâ\u0080\u0099re growing pretty substantially in the data and analytics business, thereâ\u0080\u0099ll be more and more leverage that will be created there from a cost savings standpoint. So the starting point for that is $10 million to $13 million in savings, but we anticipate that will grow. For my first question, just in terms of the update that you provided on the Insights Engine, very impressive numbers in terms of the users that use that product and in terms of the account growth and the asset growth versus the nonusers. But there is a very substantial product thatâ\u0080\u0099s tied to the Insight Engine, and thatâ\u0080\u0099s the Wealth Data Platform. And the Wealth Data Platform, really, we announced that rollout a couple of weeks ago, and beginning to introduce that solution to our clients. It collects the data thatâ\u0080\u0099s on the Envestnet platform, but expands it to collect all of our clientsâ\u0080\u0099 data to normalize it, to verify it, to reconcile it, to then publish it. It is in its purest way a demand-generation tool because advisers, the greatest opportunity that they have for growth is in their current book of business. Weâ\u0080\u0099re surfacing these things at their desktop, then connect it to the workflow to go and execute. And in the FNZ instance, all the way back through the full administration of the account. And so it is a one-of-a-kind, a truly transforming capability that is making its way to market, and I believe will create very substantial adoption over the quarters ahead. Obviously, conversion activity has been very strong, but it also reflects decisions that were made earlier when there was less -- when the economy wasnâ\u0080\u0099t -- when the economy was more robust. But we had a very strong conversion quarter and those tend, you know, Surinder, they tend to be lumpy. Weâ\u0080\u0099ll have more conversion activity in the fourth quarter, but the third quarter was strong. This quarter and in the last couple of weeks, we did sign a national credit union for a bunch of our services. We signed a national RIA for our leading financial planning capabilities, we have worked with UBS to offer our fiduciary and 401(k) solutions to their workplace offering. I think weâ\u0080\u0099ve seen exceptional win rate this year, not only in the Wealth business, but in the data business as well as the number of firms that are working with the company today is higher than itâ\u0080\u0099s ever been before, and have had a pretty substantial win rate this year. Itâ\u0080\u0099s been very much focused on expanding services with our existing clients, and weâ\u0080\u0099ve been very, very successful, I believe, in doing that this year despite the market. So when we said on the investment program, weâ\u0080\u0099re going to focus, weâ\u0080\u0099re going to go deeper in our existing client base, that is occurring. And you can see it, the market headwind and the overall industry flow rates, those arenâ\u0080\u0099t performance-related issues. The performance-related things that weâ\u0080\u0099re able to focus on and drive, we are driving. We have a -- itâ\u0080\u0099s a global partnership and Iâ\u0080\u0099d say, Peter, weâ\u0080\u0099re just starting with the wealth data platform in that international market. And some of our software solutions includes the very powerful fin apps weâ\u0080\u0099ve designed for our client portal, or things like our financial planning capability, which is world-class, is best-in-class and believe thereâ\u0080\u0099s a global opportunity for those capabilities. Ultimately, we will work together as we really forge and execute on this partnership, to be able to think more broadly about some of the fiduciary things we do as well. So this is -- yes, of those 3, in Q3, the total was a little over $3 million. But what Iâ\u0080\u0099d say, Peter, Iâ\u0080\u0099d just add to that is weâ\u0080\u0099re winning some really -- off the bat, currently, early in the match or early in the game here, weâ\u0080\u0099re winning some important mandates. In Truelytics, itâ\u0080\u0099s core and embedded in our wealth data platform. The Redi2 is going deeper in the RIA market as well as with asset managers, which is something we highlighted when we acquired the company. And 401kplans.com, the UBS would be an indication of how thatâ\u0080\u0099s being received in the market. And that will be bundled into our Wealth Data platform that has high, high value and is a unique I think, very high potential offering that we have, compared to any of the other data solutions that are in our space. But then we utilize it, and itâ\u0080\u0099s important to note this, we utilize it heavily in our internal sales and marketing focus because we can reach out to an adviser and not try to sell them a service like tax overlay or social or direct indexing. We can actually say, your account could benefit from this service and you have an 88% chance of closing that. And that is a very powerful connection with that adviser versus what typically happens from a sales standpoint, where people are trying to sell benefits and features and go through all that without -- weâ\u0080\u0099re hitting that nail on the head to say this client of yours has this opportunity, let us help you go close it. I would say that, all things being equal, these are all very positive, impactful contributing capabilities. But the direct index solution is the highest fee rate and itâ\u0080\u0099s explicit free rate, Iâ\u0080\u0099m sorry, fee rate in that it offers both gross and net revenue from 15 to 20 basis points kind of thing. But then when we bundle some of these things together in our high net worth, and I talked about it in the script, weâ\u0080\u0099ve seen this year, 2022, weâ\u0080\u0099ve seen 100% growth in our high net worth solutions business. And there weâ\u0080\u0099re bundling consulting, asset allocation overlay, execution of the portfolio in really -- for very high net worth individuals and helping advisers close that business. So smaller target market because itâ\u0080\u0099s truly the high, high net worth, but weâ\u0080\u0099ve been very successful there and weâ\u0080\u0099ll continue to grow there. From a more mass market or affluent market, that direct index solution will probably be a primary driver. And so what we do is we create the insights and then theyâ\u0080\u0099ll be published to that adviser in a ranking of accounts at risk, accounts with opportunity and then the financial impact to the adviser based on executing on that transaction or executing on that service or protecting that revenue going forward. So if we have the data, we can understand the implication of an insight for that adviser. They are categorized, and then -- theyâ\u0080\u0099re categorized and then theyâ\u0080\u0099re kind of stack ranked by impact. And yet, weâ\u0080\u0099re driving the growth and the penetration that weâ\u0080\u0099re seeing. In the environment that weâ\u0080\u0099re rolling out and introducing to the market here in the fourth quarter, it becomes a very powerful platform of capabilities that the advisers business begins to optimize on. And thatâ\u0080\u0099s a meaningful, meaningful step for us. And then your fourth quarter outlook, it implies that subscription revenue will be down a little bit quarter-over-quarter. And when we recognized that revenue, they reset in the fourth quarter. I do believe that this will be highly adopted by that newer, more digital inclined adviser. And as we drive our cloud service, the Wealth Data Platform into the market, I would anticipate that weâ\u0080\u0099d see quite a bit of adoption there in the pipeline for that offering, which, again, we just announced a few weeks ago, is significant. And it might be a little too early to sort of think about this just yet, but maybe not. And if you scrub down underneath that, you see that the value-added services have been very, very resilient. And youâ\u0080\u0099ll hear the industry, and I think itâ\u0080\u0099s important to note, the industry is driving towards these very personalized offerings to individuals. And so when you scrub under our redemption data, you see that these tend to be more resilient accounts, and I think theyâ\u0080\u0099re long-term accounts. By that, I mean, your performance reporting and everything kind of is that cycle, that life cycle of an investment. So we call it personalization at scale and something that weâ\u0080\u0099ve invested quite a bit in, and part of our investment program was to create scale there, and I think weâ\u0080\u0099ve been successful at it. And overall, Iâ\u0080\u0099d say, Ryan, despite the market, and itâ\u0080\u0099s been -- I know for everybody on the call tonight, itâ\u0080\u0099s been a very difficult headwind. We stated we were going to make investments, weâ\u0080\u0099ve made the investments. And weâ\u0080\u0099re driving growth in those areas in a very difficult environment, but weâ\u0080\u0099re also advancing our position with partnerships with folks like FNZ and TCS and our ecosystem of partners. So I think it really speaks to the focus, the discipline we put around that investment strategy, execute it and now weâ\u0080\u0099re rebalancing the organization and turning towards margin expansion, which weâ\u0080\u0099re committing to for 2025. As I just said to Ryan a moment ago, Envestnet, weâ\u0080\u0099re forging ahead, and we are executing."
}