{
    "symbol": "AOUT",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-09 19:16:04",
    "content": "  :\n 00:02 Good day everyone, and welcome to American Outdoor Brands Inc. Second Quarter Fiscal twenty twenty two Financial Results Conference Call. 03:29 During our second fiscal quarter, our ecommerce net sales grew nearly five percent year over year and over two twenty eight percent on a two year basis, including a meaningful increase in our direct to consumer business. 04:15 For the first half of fiscal twenty twenty two, we delivered net sales growth of one point five percent versus the year ago period and net sales growth of over sixty two percent versus the first half of fiscal twenty twenty. 14:32 Net sales for the first six months of fiscal twenty twenty two were one hundred and thirty one point five million dollars, which represents a one point five percent increase over fiscal twenty twenty one and an increase of more than sixty two percent over fiscal twenty twenty. Gross margins in the second quarter came in above our expectations at forty six point seven percent, a reduction of just twenty basis points from last year. Adjusted EBITDAS for the first half of fiscal twenty twenty two was twenty one point three million dollars or sixteen point two percent which is in line with our expectations and in fact, is above the high end of our guidance range for the full fiscal year. 17:59 In addition, we believe our planned pull forward of inventory purchases in Q1 and Q2 positions us well to continue servicing our customers through the second half of fiscal twenty twenty two. Based on our first half results, combined with what we believe is the consumers preference for our strong portfolio of brands and our current visibility into the second half of the year, we are narrowing our guidance range for fiscal year twenty twenty two, which represents growth over fiscal year twenty twenty one. 23:07 We estimate that net sales for fiscal twenty twenty two will be in the range of two eighty million dollars to two eighty five million dollars, which at the midpoint would represent growth of roughly two percent over the prior year, and growth of nearly sixty nine percent over fiscal twenty twenty. 24:15 With regard to gross margin, we would expect to see gross margin percentages in the second half of fiscal twenty two fairly similar to our percentages in the second half of last year. 24:38 Finally, we expect our effective tax rate will be approximately twenty five percent for the balance of fiscal twenty twenty two and our fully diluted share count will be about fourteen point five million shares."
}