{
    "symbol": "CMTL",
    "quarter": 1,
    "year": 2023,
    "date": "2022-12-08 21:10:25",
    "content": " I'm Rob Samuels, Comtech's Head of Investor Relations. We're also joined by Mike Bondi, our CFO and we'll also be hearing from Maria Hedden, our Chief Operating Office. Before we get started today, I'll also say that both myself and Ken and always available to answer questions our investors may have, so please get in touch if you want to organize a meeting to talk about the company, our results, or our strategy. We also have a detailed discussion of the quarter in our shareholder letter available on our website and we have also been working to communicate directly about our business and our market between quarters in our blog, Comtech Signals. Certain information presented in this call will include, but not be limited to, information relating to the future performance and financial condition of the company, the company's plans, objectives, and business outlook, and the plans, objectives and business outlook of the company's management. The company's assumptions regarding such performance, business outlook, and plans are forward-looking in nature and involve significant risks and uncertainties. As you all know, this is still early days in my tenure as CEO and early in the journey for everyone at Comtech as we move to fundamentally transform our business. That said, as we head into a new calendar year and close the books on our first quarter of fiscal 2023, I could not be more pleased with the progress we're making and the opportunities ahead. One thing that I was consistent and clear about from day one in my conversations with everyone from my leadership team, our employees and our investors, was that Comtech needed to move faster than ever before. Our end markets are changing in real-time, our customers' needs are constantly evolving, and new technologies mean that we can offer creative solutions to solve their problems if we as an organization, commit to working together as one contact. It's early in the process, but the One Comtech journey is underway and working. In addition to a quarter-over-quarter increase in consolidated net sales, representing the fourth straight quarter of topline sequential growth for Comtech, our bookings of $181 million foreshadows the increasing customer value we are creating as One Comtech. I should also point out that this performance was delivered even as we reorganized our business, continued to restructure our senior leadership team across multiple functions with key appointments, and continued to make changes to improve the functional machinery of our organization. And I want you to hear directly from our COO, Maria Hedden, as she's in the trenches, streamlining and improving our processes so that everything we do at Comtech we do better, faster, and more efficiently. For Q1 fiscal 2023, we recorded $131.1 million of consolidated net sales, of which $80.9 million were recorded in our Satellite and Space Communication segment, and $50.3 million were recorded in our Terrestrial and Wireless Network segment. Our consolidated first quarter net sales represented a 3.3% increase over last quarter and, as Ken mentioned, our fourth consecutive quarterly increase. Compared to the year-ago quarter, our consolidated Q1 fiscal 2023 net sales increased $14.3 million or 12.2%, driven by higher revenue in our Satellite and Space Communication segment. It also reflects startup costs associated with the opening of our new high volume technology manufacturing centers, as well as increased costs resulting from the ongoing impacts of COVID-19 and inflationary pressures. Sequentially, in line with our prior guidance, adjusted EBITDA in Q1 fiscal 2023 was lower, both in dollars and as a percentage of sales, reflecting overall changes in mix, the general rise in costs due to an inefficient supply chain and inflation, and the settlement last quarter of fiscal 2022 annual incentive compensation with fiscal -- fully vested share units in lieu of cash. As Ken previously mentioned, bookings during the quarter totaled $181.2 million, representing a 26.9% sequential quarterly increase, and a quarterly book-to-bill ratio of 1.38 times. Overall, our consolidated Q1 net sales and adjusted EBITDA were ahead of our guidance provided last quarter and we're pleased to have exceeded our targets, and to have increased our funded backlog from July, particularly in light of an economic environment that continues to be challenging. As I said, at the top of the call, a big part of our financial performance reflects a lot of hard work that we're doing to improve the core machinery of our business. In my opinion, we have the best people and the best solutions, and we serve the most demanding customers in the world and we're growing. To support everything, we're doing and everything we want to do, we have to make sure that Comtech's organization, operations and systems can keep pace with where our business is going. Maria joined us in March, bringing over 20 years of executive P&L management experience and a history of improving business performance. At the core of Maria's work is a commitment to a One Comtech strategy, ensuring that everyone at the company shares a common set of tools and processes to improve and optimize everything they do every day. I want you to be able to hear directly from Maria, that's her workplace such an important role in accelerating the growth and profitability of our business. Today is actually the first time I've participated on earnings call, but I think it highlights two things that I expect are important for investors. The first is at Comtech, we are making serious strategic commitment to operational integration and excellence, what you've heard Ken call One Comtech. And also meant we had to make sure all our teams were appropriately staffed to not only meet today's needs, but for the growth we anticipate. And  a reorganization of our leadership structure to make sure we had the right executives in place, but also create structures to ensure all our leaders had a clear sense of the totality of our business and access to the insights and innovation from across the business. We are in the process of a firmware business and operations improvement, project to control costs, where we can to defend and grow margins, while at the same time make deliberate investments to promote our growth and ability to operate at scale. I have instituted a monthly business review process which convenes the entire leadership team for a full day to make sure we celebrate our wins, learn from our losses, and make sure our plans and targets are on track and appropriately resource. And in many organizations, change can bring uncertainties and down, but at Comtech, I see every day what our financial performance this quarter confirms that we're making the right kinds of changes that are unleashing and empowering our people to do what they already were doing, innovating and delivering the best solutions to our customers around the world. We all know that there is a lot of work to do ahead of us, but I have the confidence that the changes we are, and will be implementing at Comtech, will create permanent competitive advantages for our company and our customers as well as value for our shareholders. As she said, we made significant changes to our leadership structure and now have executive focused on both our key end markets as well as our key customer segments. Together, it means we have a leadership structure that is ready to partner with customers across business units and has expertise in the specific needs of key customer segments. Before I move on to take questions, let me circle back to our bookings, which at $181 million for the quarter, were over 2x higher than our first quarter of last fiscal year. Our investors should pick this to be a clear indication that while we continue to improve the machinery of our business, we have not and will not failed to remain completely focused on solving our customers' problems and creating unprecedented customer value in unique and innovative ways. Our contract wins during the quarter validate not only our unwavering customer focus, but also make it clear that Comtech solutions and services continue to set the standard in every one of our key markets. But I'm always happy to win repeat business too, because it means that these tough customers have put our products through their paces and we have measured up to their very high standards. Among the contracts were awarded during the quarter from customers we have worked with before, we saw key wins with the U.S. military as well as for the Ukrainian government, which is adding new communication systems identical to those we donated them -- donated to them in March of this year. In addition, one of the largest wireless carriers in the United States, renewed our 911 services contract with them, again, underscoring that across our segments and our end markets, customers have come to know, trust, and depend upon Comtech. With new leadership, a new organization, a refreshed common operational infrastructure, and an energized and invigorated team, our One Comtech transformation is positioning us for success. Next week, Fred will be retiring from our board and from all of us here at Comtech, we wish him well, and thank him for all his contributions over the years. So, Ken, I wanted to ask you've now got a quarter under your belt, maybe a little more detail or color on your observations, your evaluation, your conclusions. I'm going to offer perspective on that and then if Maria or Mike want to chime in, they can with respect to their -- the lens through which they look through. But I'll tell you that first of all, the move to One Comtech is challenging. We're moving through that aggressively and we've baselined, the current configuration, current operating processes that they operate on. One of those is the launch of the Innovation Foundry, our technical incubator, if you will, that's being led by our Chief Growth Officer. And in this kind of a controlled environment, we can't even quantify what we think that customer value might be. So, one of the things is I'm really excited and enthusiastic about the Innovation Foundry and how that provides a lens through which we can up here our capabilities to the systems and services level and measure the performance that that brings our customers. Joe on the Terrestrial and Wireless business background again in early part of fiscal 2021, we announced winning several large 5G location-based services contracts. Also coming in fiscal 2022 and especially in Q2, just to remind everybody, we did have a $2.5 million benefit to cost of sales that were the result of reducing the warranty approval due to lower than expected warranty claims in that 911 product area. When you look at the sales and the adjusted EBITDA contribution net in Q1 of fiscal 2023, as we stated before, we're subject to mix changes and the recently awarded statewide NG 911 contracts, as we disclose generally have lower upfront margins, lower than our 911 Wireless Call Routing Services. Whereas you have to keep in mind the new contracts that were winning in the 911 area, the NG 911 area, those contracts were recently won, we're installing the infrastructure, and it's going to take some time, as we turn on the PSAPs to absorb that upfront cost. We're getting towards the tail end of the deployment, portions of those contracts, where we're spending the CapEx, and we have been lining up the PSAPs. You mentioned the $181 million number in bookings for the quarter, I assume that included some big chunky contracts. I think during the quarter, you announced a Tropo deal with the U.S. military for $50 million. And in terms of the next item, I would say we call out we have a large Tier-1 carrier that we provide call routing services for that customer. Those are probably the largest -- we had some additional reset orders with the U.S. Army and some other key wins, but certainly those were the three largest that we would call out. George I will tell you that, that as we bring our business together, we are seeing our addressable and serviceable markets expand as we look to harness the enterprise wide capability of One Comtech and that enables us to move up tier into the Systems and Services segment. So, we're pretty enthusiastic about the opportunities that's revealing to us and we're seeing customers even engage with us directly to better understand how this expanded value proposition can create value for them. So, looking forward, our customers are aligned with us in this expanded value proposition, that's expanding our new business funnel going forward. Also, I think you guys have about $130 million drawn on the credit line, the revolver right now. In terms of the debt, on the balance sheet, it's actually a little north of what you just said. So, in the presentation on our balance sheet, you see as long-term it's because we were successful in getting our lenders to move forward with an amended deal. We did change some of the deal terms to be more representative of today's business, but that was a syndication we announced last week. Obviously, you're reading a lot of news reports, there's a lot of skittishness out there with the lenders, dealing with a global recession, potentially higher default rates. And so navigating through that in this environment, we're very pleased with the outcome and it gives us the flexibility to operate. Sure, in terms of your guidance, I certainly will be mindful of that we're only given guidance for Q2. We're certainly in economic environment, that's challenging, as Ken mentioned, and then we disclosed, we definitely have seen inflationary pressures, supply chains is still not running optimally. And against that background, and backdrop, we're pleased with our performance in Q1, we think that over time, our margins will improve. But when -- where we can, we are resetting that backlog with higher pricing that is market-based, taking into account inflationary pressures, but certainly for the rest of the year, it's a little too early to call. And as I pointed out last year, in Q2 -- Q1, we certainly had some favorability based on the mix at the time. But we're right now, we're not going to go beyond what we're saying for Q2 is guidance on the top and bottom-line. I will tell you Mike -- this is Ken, I'll tell you also that that we are making great progress, I'd like to give Maria chance to jump in here. And so maybe just a word from Maria, with respect to the metrics, the KPIs, the way you're tracking that on the integrated master schedule and driving the team against their goals. So, obviously, we've rolled out some of our people strategy and what we've done with that, but clearly some of the new processes that have been instituted over the last quarter that is focused on really understanding some of our business risks, understanding those key performance indicators. And really that's driving visibility and alignment across the organization to stay focused on really being able to grow the organization, while continuing to perform day-to-day on our expectations. And then maybe just on the pipeline itself, you kind of called out the macroeconomic, geopolitical effects here, but also you've obviously had strong demand. In our Satellite and Space segment, we're now able to move up here to offer systems and services that our individual siloed businesses would not offer before. It significantly expands our market opportunities, and it expands the size of our new business funnel. Now, we're able to offer customers in the Satellite and Space arena significantly greater value proposition because it creates more -- significantly more customer value, and we can move into more innovative business models that enable us to monetize that value proposition more effectively. Now, in Terrestrial and Wireless, we're expanding both geographically and we're also increasing the number of transactions that we handle with respect to either 911 calls or location-based queries. So, the number of transactions, as that increases and in fact, as we move toward machine-to-machine 911 like-calls and not just human-to-human, that will increase another -- and make available another dimension of growth, for Comtech. Thirdly, as the Satellite and Terrestrial Network infrastructures converge, we see ad growth opportunities in another dimension. And you see that with devices now offering multiple connectivity choices, terrestrial like Bluetooth, Wi-Fi, and cellular, but also satellite connectivity to Leo and you see multiple devices, and device providers moving in that direction. So, at the end of the day, we see significant growth potential in each of our individual segments, as well as at the enterprise level through the convergence of satellite and trusted  domains, where Comtech is uniquely advantaged. Well, we see Tropo as an exciting technology that complements SATCOM because when SATCOM tends to degrade in its performance, such as in a hurricane, where you have extremely heavy rain, Troposcatter actually improves in its performance envelope, because it operates by bouncing the signal -- the propagated signal off of particles, and the more particles that are generally the better it works. And we see opportunity there in the traditional military and defense environment, but we also see opportunity commercially in terms of connectivity -- connecting oil and gas enterprises, providing robust connectivity between critical operations centers, like hospitals, fire houses, law enforcement, emergency operations centers in a hurricane or other kind of a situation. Because of the success it's having in the peer adversary conflict, we see it moving into new markets as well, adjacencies commercially, as well as at the enterprise level, like oil and gas. The company's international customer base as a percentage has stayed constant last couple of years, last five years or so around one quarter and correct me if I'm wrong. And the reason I say that is because as we move to ground -- satellite-ground infrastructure, and maybe providing that as a system or providing that as a service, international customers have the opportunity to benefit that as well. As we see the international community migrate from 2G and 3G to 4G, 5G technologies in the Terrestrial and Wireless market, we see the opportunity that that will benefit us. So we think our -- really the several legs of our business, all can move into the international market, as we update our capabilities and our marketing schemes, the international market will benefit by that the same as our domestic and defense activities. So, this quarter benefited from military sales -- foreign military sales of your beyond line of sight communication terminals, and for Ukrainian government to an extent you can give us color. And the Ukraine is a great example because they're in a conflict with what we like to say, as a pure adversary. So yes, we do expect that to have an extent -- an extended benefit that continues the viability of our equipment, and extends its value, because it works, it works in the toughest of environments proven. And finally, it's a very long-term question and -- so if we can comment on this. Well, I'll tell you the convergence of Satellite and Terrestrial Network infrastructures we see as a significant opportunity for Comtech because we have technology leadership in both of those domains. And so as that convergence of Satellite and Terrestrial comes together, we see Comtech uniquely positioned to take advantage of that. So, when the smartphone was introduced, it didn't just take market share from the Blackberry, it in fact, created a much larger market of new apps that had never been done before that created enormous customer or user value. Okay, so in the second case, the smartphone's introduction didn't just take market share from the incumbent, it expanded the entire ecosystem. None of us know right now, whether the convergence of Satellite and Terrestrial is going to behave like the former, where it's going to take market share from those providers that do not provide SATCOM or whether it will create an explosion in the ecosystem of new apps and new capabilities that create an expanded market for everyone. So, I'm not going to make a prediction, except to say that, that I think Comtech -- reiterate my first point, Comtech is I think, very advantageously positioned, because our strength in both Satellite and Terrestrial Network technologies and location-based services. So, that's one of the reasons -- one of the driving reasons, we bought our siloed businesses together, so we can up-tier our capabilities and take advantage of this kind of a market inflection. Yes, I think historically, we saw -- because it was combined with our commercial saving, you saw the EBITDA profile there. Going forward, certainly, we're at a point where we're seeing convergence of two types of revenue streams at the same time and the building up of the NG 911 revenue. So, right now, I'd say, initially, as we absorb those upfront costs, the EBITDA contribution will be sort of what you're seeing right now, because we're in between those large 5G LBS contracts. As we announced in Q4, we had a nice sized order come through, but you'll see the revenues from that ramp up towards the tail end of this year. So, right now you're getting a more of a mix of our NG 911 revenues. I'm not going to give a specific percentage, but it's certainly higher than what it is right now because we're just at the front end of those contracts. In in the past couple of years, you've seen our EBITDA contributions come down from say, the 14%, that we were doing pre-COVID. It's certainly a challenging environment, but in the next couple of years, I would expect this to get back to that level. It was at this point in time annual renewals, and in terms of pricing, just due to competitive aspects of it, we have a very good relationship with a Tier 1 carrier, and it was a seamless type of renewal. I think the headline ceiling was $200 plus million, maybe $213 million. And this particular go around, it was a $50 plus million order that we received, which is sort of the first production run in terms of their needs for it, it's something that they have a need and a desire for, it's going to take some time to get the deliveries out based on the fact that it's a very large order. But in terms of our outlook, we're just focusing on the current order that we have. And then the, the award to the U.S. Army, I think at the time, when you were awarded the Marine contract, the U.S. Army had a larger contract that they awarded to someone else is the is what you were awarded this quarter part of that, are they coming back to market? The Army situation is one that we are exploring, and working toward, because our equipment -- as I mentioned, before, our equipment is proven in battle. So, what we're doing is trying to leverage that, and have exploratory discussions that can lead to something that helps the Army be more effective as they get in the fight. So, in terms of Ohio, I think at this point, it's not likely to be voted on before the end of the year. In our view, just to remind everybody that that was just a booking this year and there was likely no revenue contribution, just given that you have to do a lot of design work upfront. Our view right now in terms of our outlook is, it's certainly a large contract potential could be north of $100 million. But right now in terms of setting our own expectations, we're viewing is it's something that could be in the short-term to get a booking, but in terms of revenue contribution, or EBITDA contribution wouldn't be until next year. I don't think so, at this point, give us the whole thing up front, it might be in increments, but it's still -- stories to be told there. I'm not going to name the states or the regions, but there are a handful of those that are coming to market and we'll be responding and I think with our recent wins and our capabilities, we think we have good positioning there. Yes, sure, in terms of our progress here with our large LEO customer, as we announced last quarter, we expanded our relationship. And in terms of where we're sitting with the customer, like I said, things are progressing. And we'll see in terms of our timing for production orders, I think that's still early to call. I don't know if anybody else wants to say--\n Yes, just some other things, in addition to what Mike shared, obviously, there's a couple of development contracts that we're moving into production phase. Sure, just to level-set to for the quarter, Asiya, keep in mind that we did pay out about $4 million in CEO transition cost during the quarter. In light of our backlog growing about $50 million this quarter, we certainly felt that it was prudent to start the procurement cycle of some specific items to support that increase in backlog. And from an investing perspective, CapEx in Q1, might look a little high right now, but, keep in mind that at the end of last year, we had about $6 million of unpaid capital purchases. And coming off of a $30 million target for last year, we -- holistically we spent about $25 million of that $26 million. But at the same time, we're also seeing the channel of facility move coming towards the end. The Pennsylvania contract, Arizona contract, and South Carolina contract in the 911 space, we're also getting those PSAPs on to the system. In terms of cash flows for Q2, we still have some other initiatives that we're working on, I would say, you can -- I'm going to give specific guidance on CapEx for Q2, but it's going to be probably still elevated, and then trail off towards the back half of the year. But in terms of overall cash flow generation, we're trying to be mindful of a leverage ratio now that we have a new credit facility in place. We do at this point, expect to be positive, but there's a lot of year left, we still have some pipeline opportunities that may hit and so right now, we're just going to keep our comments down to Q2. As we're evaluating this market, it's not recurring in nature, say for the opportunities that are very near-term in front of us, we would not likely be spending that. But because of those opportunities, we made a decision as a company to go above and beyond to show our potential customers and existing customers that we're here to partner with them. But right now, there's -- itâ\u0080\u0099s a very competitive marketplace, there's a lot of opportunity to grab and so we're going to make those investments to secure for the long-term. But right now, while we're encouraged at the start of Q1 and going into Q2, it's just a little too early for us to call in terms of this challenging environment that we're still navigating through. Yes, I mean, I would say this Asiya, the -- our trajectory, we certainly are pleased with our trajectory having four quarters of sequential growth. So, I know we're being compared to maybe others in industry, but certainly with what we had to face in 2022, with certain specific headwinds in our business, and then the Russia-Ukraine war, it's nice to see that we've been growing our backlog and having such a strong bookings quarter. Supply chain, we're aware of what we have to work around, namely long lead items, and making sure we procure timely enough to deliver on time. One of the significant value propositions of bringing our siloed businesses together as One Comtech is we can now deal with our supply chain with a single voice, an amplified voice. And instead of maybe ordering perhaps the same part through two different businesses in smaller quantities, we can speak with a louder voice and consolidate those buys and we should see a benefit from that. When we talk about improving the machinery of our business operations, that's the kind of thing we're talking about. Just thanks to Ken, Mike, and Maria, and thanks to everyone for dialing in today. As Ken said, there are additional details about our strategy and performance available in our investor letter and SEC filings and we'll provide ongoing insights in our Signals blog. So, for anyone with questions, please just reach out to me directly and let's connect."
}