{
    "symbol": "TRGP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 16:41:04",
    "content": " Some of our highlights from 2022 include record safety performance based on multiyear low total reportable incident rate, record gathering and processing volumes in the Permian, record volumes across our logistics and transportation assets, record adjusted EBITDA of $2.9 billion, a 41% increase over 2021 while also reducing our share count. Execution and successful integration of our Delaware Basin acquisition and our South Texas acquisition, execution of our corporate simplification with our DevCo repurchase and preferred share redemption, successful sale of our 25% equity interest in Gulf Coast Express Pipeline for approximately 11 times EBITDA, upgrades to investment grade by all of the rating agencies and completion of two successful investment-grade offerings and higher year-over-year return of capital to our shareholders through both an increased common dividend and continued common share repurchases. The significant year-over-year increase in adjusted EBITDA is driven by higher expected gathering and processing volumes, higher expected NGL transportation, fractionation and export volumes, higher expected marketing optimization and LPG export opportunities, higher fees from contract escalators, a full year contribution from our Delaware Basin and South Texas acquisitions, contribution from our acquisition of the remaining 25% interest in Grand Prix and higher hedge prices. As you can see from Slide 12 in our earnings presentation relative to our full year 2023 financial guidance, a 30% move higher in commodity prices from our guidance levels would increase adjusted EBITDA by around $100 million, while a 30% decrease would reduce adjusted EBITDA by around $60 million. Targa's reported quarterly adjusted EBITDA for the fourth quarter was $840 million, increasing 9% sequentially as we benefited from the first full quarter of our Delaware Basin acquisition, optimization opportunities and recent processing additions across our Permian systems despite lower commodity prices and operational impacts from Winter Storm Elliott. We estimate full year 2023 adjusted EBITDA to be between $3.5 billion and $3.7 billion, a 24% increase over 2022 based on the midpoint of our range, assuming commodity prices of $2.25 per MMBtu for Waha natural gas, $0.70 per gallon for our weighted average NGL barrel and $75 per WTI crude oil barrel. I will say that when you look at our volumes that we had from third quarter to fourth quarter of 2022, those probably donâ\u0080\u0099t illustrate exactly the volume growth that weâ\u0080\u0099re seeing over time across our various assets and alluding to the comments that Pat made as it relates to our growth on the G&P side of our business. One moment for our next question, please. One moment for our next question, please. So we've actually seen the returns improve just as a result of utilization as we try to get plants constructed as quickly as possible, but as Pat mentioned, sometimes have to operate the system overcapacity prior to a new plant coming online and/or utilized third-party offloads, that means that once the new plant is online, it tends to be very highly utilized or at least that has been our very recent history."
}