{
    "symbol": "BNL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 19:14:09",
    "content": " Our portfolio continues to perform exceptionally well with 100% of base rents collected during the first quarter, an occupancy of 99.8% as of quarter end, all but two of our 752 properties were subject to a lease, and our properties were occupied 210 different commercial tenants with no single tenant accounted for more than 2.1% of ABR. During the first quarter we generated AFFO of $60.4 million or $0.35 cents per share, which represents growth on a per share basis of approximately 13% and 3% over our Q1 and Q4 2021 results respectively. Q1 equity issuance has provided the leverage capacity and liquidity to execute our current acquisition guidance and flexibly navigate the second half of 2022 without compromising the integrity of our balance sheet As I stated on our Q4 earnings call, we amended and restated our revolving credit facility, upsizing the capacity to $1 billion, extending its maturity date to March of 2026, and reducing the applicable margin to 85 basis points based on our BBB and Baa2 ratings. That being said, I don't think anyone should expect that this is going to be a large effort by us in Canada, I think the most exciting part of it is, in the same way that our diversified strategy differentiates us from some of the other competitors on portfolio or sale leaseback opportunities where we're able to take down, maybe the entirety of a portfolio where others aren't able to do so because they don't invest in a particular vertical. Sure, so I think sort of backup in terms of what we've accomplished so far, and how that's provided flexibility as we continue to move through the year and a lot of the volatility that we're seeing in the markets and the options that we have available, I would say that as of right now, we don't have a need for a debt offering this year, we have contemplated whether or not, there would be an opportunistic point to do so and to term out some of the debt from our revolver into more permanent basis. So it's really hard to say where that rate is, what I guess I would say is that, given the bond offering that we did last year, as well as some of the revolver work and increasing our size there, I think we're well positioned today that plus our leverage to be able to continue to pursue our growth objectives without having any need to go to the market in anytime soon."
}