{
    "symbol": "OMAB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 15:04:03",
    "content": " The cost of airport services and G&A expense increased 9% relative to the first quarter of 2021, mainly due to a 20% growth in payroll expense, which is a result of the effects of the changes in labor regulation in Mexico 2021, and the incorporation of new business lines such as the operation of the OMA VIP Lounges. Please proceed with your question. Please proceed with your question. Right now, in the quarter, we were just 10% is all the traffic of the first quarter of 2019, so we can assume that we are now operating that at pre-pandemic levels basically and the cost that we are seeing should keep increasing slightly even the higher volume of traffic, but we do expect to continue to benefit from operational leverage. What you would be seeing on a quarterly basis comparison through the third quarter of this year, would be in the same line item that you saw in the first quarter like pay roll concentrate comparison to last year and we also continue to see some increases in the traffic services such as claiming and security where we have even with the larger amounts of our operation increase the size of the  services at most of our airports, but I think that we are in the right set up in terms of our constriction we managed by \n 16:14 And just to add on today's point, we definitely believe we have become more efficient and we think that the current levels of profitability are sustainable. 17:14 So we will continue to manage from operational leverage but when you compare to the first -- the second quarter of 2021 and probably the third quarter of 2021, you will continue to see the increases in payroll expense basically because of the basis of comparison rather than by a future increase in our cost. The first question is related to traffic on the last conference calls, you mentioned about reaching to pre-pandemic levels by the third quarter and reaching full year figures dropping around 3% to 5% when compared to '19 levels. Please proceed with your question. I think that what's interesting to point out is that if you look at the route of Monterrey, Mexico, the quarter -- the variation versus the first quarter of '21 was 70%. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. 31:45  Sorry, and with respect to how much is fixed rent versus variable in the first quarter of 2022 out of our commercial revenue, excluding parking around 65% of the revenue was derived from fixed rents, and 35% was derived from value, as a point of comparison in the first quarter of 2021, also excluding parking 72% of the commercial revenue was fixed and 28% was variable."
}