{
    "symbol": "ELP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 12:54:08",
    "content": " And to conclude, in terms of M&As with the low leverage of the company, we believe that in spite of the challenging market situation, especially, because of the interest rate and the commodity prices, we still consider that -- there are some good opportunities in the market, especially, our focuses on brownfield opportunities and we are evaluating the renewal segment all ways with capital allocation discipline and all this based on the high possible governance levels of the Copel Group trying to align the company to the best practices in the market increasing transparency and improving the decision-making process on the part of the management. The increases of inflation and the hike in interest rates, negatively affected the cost of debt and reached almost BRL350 million, a growth of approximately BRL180 million compared to the first quarter of 2021 and we also saw a reduction in the financial results of almost BRL130 million referring to the financial result of the debt that the state had with Copel with a CRC of over BRL1.4 billion that was remunerated at IGP-DI+665 and this that was totally settled in August 2021. As you can see, of the BRL159 million of growth that contributed with most of that BRL137 million, BRL45 million with a negative impact of UEGA BRL40 million due to the reduction in the level of dispatch in the case of GeT, the improvement in the hydrologic scenario, as we said before reflected an average GSF of 95% compared to 89% one year ago, increased the result of the purchase and sale of energy from BRL778 million to almost BRL800 million and already showing a positive trend for the remainder of the year. At this, we are maintaining the regulatory efficiency of about 20%, although we have recognized in the first quarter '22, an increase in the provision for civil and labor lawsuits of approximately BRL30 million, as well as a net component of BRL18 million in the PCLD that we believe are one-off and that were offset by other cost reductions. Highlighting our three main businesses, GeT practically reached BRL1 billion in EBITDA almost 70% of the total strong growth, 11% already considering the consolidated results, including UEGA reducing the EBITDA of BRL34 million in 1Q 2021, to a negative of BRL6 million this year, because of the low dispatch as I said. And just as a reference, without the effect of UEGA, the growth would have been 15%, a very strong growth based on the execution of a consistent strategy for efficiency improvement, and cost reduction, conclusion of projects new acquisitions, and mainly inefficient management in energy commercialization. Copel Mercado Livre continues at the top of the largest commercialization companies in Brazil, with the strategic importance in the commercialization of energy in the Copel Group with a strong potential for sustainable growth, capturing or tapping into opportunities for the biggest – bigger opening of the free market and in terms of results same level of last year, undoubtedly a more challenging year considering the higher volatility in the prices of energy."
}