{
    "symbol": "ELP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 01:56:09",
    "content": " And I would like to start the presentation with a pleasure of sharing the delivery of another quarter of consistent operating results, in which we reached adjusted EBITDA of 1.5 billion representing a growth of over 9% in relation to the same quarter in '21, followed by a very strong cash generation of 1.4 billion. A little bit of history in 2020 based on a favorable decision made final in a lawsuit of 2009 by Copel, it was recognized the right to include the full value of ICMs from the PIS/COFINS calculation base and the immediate effect was an average reduction of 3.8% of the energy bills for Parana consumers as of July 2020, until then Copel, this has already transferred to consumers by means of reductions in tariffs adjustments by of 2.3 billion. With a retroactive write of over five years before that is to say Copel obtained the right to recognize over 16 years of credit paid or overpaid, this was recognized in the balance sheet of Copel Dis 2020, the immediate effect, I think, July of 2020 was a reduction --every reduction of almost 4% in the energy bills consumers. This has already been final and including the extraordinary impact as you can see the adjusted EBITDA of 1.5 billion in 2Q shows the consistent evolution in the year, almost 11% year-to-date to June 30 plus 9.4 in the quarter. On the next slide, I highlight the three main businesses we have already touched upon all of them GeT exceeding 1 billion of EBITDA in the quarter strong growth, like 12% growth, year-on-year already considering the consolidated results, including UEGA, a sound growth based on the execution of a consistent strategy for improvement of efficiency and cost reduction. Copel Mercado Livre free market continues at the top of the biggest trading company in Brazil, with the relevant strategic importance in the energy trading of the group with a strong potential for a sustainable growth, capturing many opportunities because of the opening of the free market with a very positive outlook in terms of results a growth of R$2 million in the adjusted EBITDA undoubtedly a challenging year considering the higher volatility of energy prices. Before we go ahead, I would like to highlight the improvement in efficiency and cost reduction, which are pillars of our strategy, we continue to seek opportunities by means of investment in new technologies and process reviews, tools, prudent investment that we start to see positive results from these already, and this will continue. I would like to remind you that is leverage still has the impact of the non-recurring results of 2021, such as the say of telecom, the renegotiation of GSM, the settlement of CRC last year, which occurred in the third quarter, and we will continue to focus on the improvement of a more balanced capital structure with our dividend policy and our investment policy. Bruno, we have already mentioned here that our policy does not consider any purge of extraordinary fact, let it be EBITDA and the net income as they are no exclusion, but the policy itself beside the minimum to annual distributions, according to the cash generation and the level of leverage and investment capacity and the financial situation, it makes it possible for us to pay interim dividend to extraordinary dividend and then this will be evaluated such as it was last year over the third quarter. But if you look at wind and solar in the portfolio of the company, we already have 13% and our perspective but is that in the next few years and with together with GeT and the new businesses area of the company, we expect to be able to double this expectation so that we may have 1/4 of our generation portfolio be made of wind and sun energy because it supplements this diversification that is very healthy for cash generation for GSF mitigation and for the management of our portfolio withhold. The schedule for the sale of FDA, we have already submitted this to the Ministry of Mines and Energy and they have already forwarded this to the court of account of the union and we hold regular meetings with the Ministry of Mines and Energy to work in all these fronts and to have a definition regarding the price of this grant that may preserve the interests of Copel as well as the interests of the Brazilian electricity sector with the capacity to renew for an additional 30 years the concession of this plant."
}