{
    "symbol": "NVEI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 13:55:27",
    "content": " This was mainly as a result of changes in foreign currency exchange rates, which negatively impacted revenue by approximately $2 million, as the U.S. Dollar strengthened more than we anticipated higher volatility and lower volume than we anticipated in digital assets and cryptocurrencies, which negatively impacted revenue by approximately $4 million. In total, these factors combined contributed approximately to $12 million of revenue headwind in this yearâ\u0080\u0099s second quarter. Looking at our online retail vertical, we showed amazing progress as they had revenue growth of 112% over last yearâ\u0080\u0099s second quarter, and which is driven predominantly by new business. I'll highlight that our investments in our direct sales channel are yielding exceptional results as reflected in the 36% increase in revenue at constant currency in the second quarter within our globally conference direct business, an impressive outcome given that almost all of the headwinds, we are experiencing the quarter impact of this channel specifically. Revenue increased by 19% to $211 million and as Phil mentioned was negatively impacted by three factors; currency exchange rate fluctuations, cryptocurrency volatility and volume mix, which on a combined basis, an unfavorable revenue impact of approximately $12 million as compared to our previously provided outlook range for the quarter. The second quarter, the EMEA revenue, which is our largest region at 57%, of total revenue, increased 28% to $120 million. In terms of gross profit for the quarter, we generated $175 million, which represents more than a $30 million increase or 21% growth as compared to the prior year. Selling, general and administrative expenses increased by approximately $51 million or 53% to $147 million as a result of organic growth as we continue to grow and invest in the business, as well as a result of acquisitions of Simplex, Paymentez and Mazooma which we completed in the latter half of last year. Net finance income was approximately $4 million, compared to net finance cost of approximately $3 million in last year second quarter, primarily due again this quarter of $8 million relating to a favorable change in fair value of the share repurchase liability pertaining to the automatic share purchase plan established earlier this year. Net income for the quarter was $35 million, or $0.23 per diluted share, compared to $39 million, or $0.26 per diluted share in the second quarter of last year. As I mentioned earlier, this yearâ\u0080\u0099s second quarter included a $28 million increase in share based payments, which on its own represented approximately $0.19 per diluted share. For the full year of 2022, we are adjusting our previously announced Outlook to total volume of between $117 billion and $121 billion, revenue of between $820 million and $850 million, revenue at constant currency of between $855 million and $885 million and adjusted EBITDA of between $330 million and $350 million."
}