{
    "symbol": "NVEI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 11:22:01",
    "content": " Turning now to our financial results, total volume for the fourth quarter was the highest it's ever been in any previous quarter, driven by broad based strength across our platform and exceeded 40 billion, increasing 28% on a reported basis and 33% on a constant currency basis over the prior year's fourth quarter. Revenue for the fourth quarter was 220 million, revenue at constant currency of 233 million grew by 10% and was towards the high end of our outlook range. Taking it one step further, that 26% growth rate means that we face approximately 35 million of revenue headwinds in the quarter, which is comprised of 12 million from changes in foreign exchange rates and 23 million from digital assets and cryptocurrencies on a constant currency basis. Looking at the full year results, total volume of 128 million increased 34% on a reported basis and 39% on a constant currency basis, reflecting our rapidly growing market share. Revenue increased 16% to 843 million or 22% growth on a constant currency basis, adjusted EBITDA increased 11% to 351 million, and free cash flow increased at 303 million. It is worth highlighting that for the first time, our E-Commerce Direct Channel in North America represents our largest distribution channel in the region and grew 65% compared to last year's fourth quarter and increased 54% for the year. Beyond these verticals, our growth was widespread, except for digital assets and cryptocurrencies, which for the fourth quarter was down approximately 58% compared to last year's same quarter with indications that it has bottomed and stabilized. To help frame the momentum in the business and our advancements in our go-to-market, new business revenue excluding digital assets and cryptocurrencies increased 23% in this year's fourth quarter. Turning to our outlook for the year, we expect revenue of between $1.22 billion and $1.26 billion for reported growth of between 45% and 50%. On a constant currency basis, revenue grew 10% to $233 million and was aligned with the high end of our outlook range. During 2022, as part of our capital allocation strategy, we deployed $167 million of excess cash -- was repurchasing approximately 5% of our public float, including the repurchase of 1.9 million shares in the fourth quarter. For the first quarter, we expect total volume of between $39.5 billion and $41 billion, revenue of between $248 million and $256 million, revenue at constant currency of between $252 million and $260 million, and adjusted EBITDA of between $92.5 million and $96 million. For the full year 2023, we expect total volume of between $194 million and $200 billion, revenue of between $1.22 billion and $1.26 billion, which is expected to be approximately $2 million higher on a constant currency basis and adjusted EBITDA between $455 million and $477 million. If you guys take a look at it in the press release in terms of crypto revenue from fourth quarter year-over-year, and I'm so proud of this team of what we've done in terms of growth, not just from a revenue replacement perspective, but because we're at scale, those dollars predominantly fall to the bottom line. In terms of thoughts on what we've driven and how we build next year, I think we've done quite a bit of double clicking, but ultimately the performance of the business this year on the exit rate of Q4, 26% constant currency organic growth, really good building blocks in new business."
}