{
    "symbol": "NVEI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 11:52:07",
    "content": " Highlighting several observations of interest for the quarter, the US dollar continued to strengthen driving additional 1.5 million unfavorable FX headwind compared to our outlook for the quarter and impacted revenue by 11.5 million compared to last year's third quarter. In this year's third quarter, our ecommerce direct channel in North America represented 31% of revenue and grew 40% compared to last year's third quarter, while small business represented 42% of revenue and declined approximately 1% for the same period. Looking at EMEA with revenue growth of 4% in the quarter, it is important to recognize that year's performance has been negatively impacted by foreign exchange fluctuations as well as volatility in digital assets, since a significant portion of our digital asset portfolio originates from European operators. Turning now to LATAM, which still growing from a smaller base, saw revenue increased 28% in this year's third quarter as we reached an inflection point in our business in the region is accelerating rapidly. Turning now to our expectations for the fourth quarter, we see three things, continued strong momentum in the business, additional FX headwind of 5 million and approximately 7 million of headwind from digital assets beyond our prior expectations. In terms of gross profit for the quarter, we generated $159 million, which represents more than a $13 million increase or 9% growth compared to the prior year. Selling, general and administrative expenses increased by $43 million or 41% to $149 million as a result of organic growth as we continue to grow and invest in the business, as well as the acquisitions of Simplex, Paymentez, Mazooma which were all completed in the third quarter of last year. Approximately 4.7 million incentive units, representing 38% of the total units outstanding of an exercise price or share price performance condition in excess of $100 or relate to awards with a non-market performance condition that were not achieved at the end of the third quarter. Net finance costs was $3.7 million, compared to $4.6 million in last year's third quarter. As I mentioned earlier, this year's third quarter included a $23 million increase in non-cash share based payments, which on its own represented approximately $0.16 per share. For the fourth quarter, we expect total volume of between $33 billion and $35 billion, revenue of between $197 million and $227 million, revenue at constant currency of between $210 million and 234 million and adjusted EBITDA of between $75 million and $84 million. For the full-year 2022 due to our third quarter performance, we're increasing certain components of our outlook and now expect total volume of between $120 billion and $122 billion, revenue of between $820 million and $850 million, revenue at constant currency of between $861 million and 885 million and adjusted EBITDA of between $341 million and $350 million. So, that's part of it. So, that's part of it."
}