{
    "symbol": "LAB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 22:10:31",
    "content": "  Operator: Hello, and welcome to the Standard BioTools Inc. Third Quarter 2022 Financial Results Conference Call. At the close of the market today, Standard BioTools released its financial results for the quarter ended September 30, 2022. During the call, we will make forward-looking statements about events and circumstances that have not yet occurred, including plans and projections for our business, future financial results and market trends and opportunities. Good afternoon, and welcome to Standard BioTools Third Quarter 2022 Conference Call and the first full quarter with our new executive leadership team in place. The Standard BioTools tools corporate transformation of this company begins with stabilizing what we now call our core commercial business, which will assess holistically on the basis of instrument growth, consumables and service revenue. There remains work to do, but this quarter shows encouraging green shoots of that process with a 30% sequential growth in core products and service revenue. And I reiterate here those stated financial goals achieved 700 to 1,000 basis points improvement in gross margin by year-end 2023, significantly reduced operating cash burn in 2023 and achieve positive free cash flow by year-end 2024. Today, after a prolific period of investment and innovation in next-generation life science tools, almost all businesses are stumbling with the scaling of product development, manufacturing, commercial discipline and execution, customer support and basic fiscal discipline. A key element of our strategy is growth through M&A, and we're methodically advancing conversations with target companies using a disciplined approach and an eye not just on the growth promise, but how we successfully integrate businesses and performance of those businesses over time. On revenue growth, we're beginning to see progress on that front with core product and service revenue for the third quarter of $24.8 million, representing over 30% sequential growth compared to the second quarter of 2022. Moving forward, we continue to focus on our core product and service revenue and its sequential growth to track our progress. Since joining, we successfully rebuilt the Americas sales team, attracting high quality and skilled sales people to drive our commercial efforts forward, which we believe is responsible in part for the early success this past quarter. We're beginning to see the benefits of SBS translate into performance, and we are on the way to achieving our stated goal of 700 to 1,000 basis points and gross margin improvement by year-end 2023. We expect this to result in non-GAAP product and service gross margin of 65% to 68% by year-end 2023, driven by lean transformation in volume growth and value selling. We're spending less today than when I joined, excluding business improvement expenses, which we expect to substantially reduce as we approach year-end. To date, restructuring efforts have improved our operating margin by 600 to 800 basis points or $8 million net on an annualized basis. SBS is not only allowing us to position our core business for future growth, but enables the necessary changes to get the supporting infrastructure integration ready as we look to complement our product portfolio through targeted M&A, which brings me to our third priority, strategic capital allocation. As Michael noted, we are pleased with our results for the third quarter, which showed top line sequential improvement across all the geographic markets we serve. Total core revenue for the quarter was $24.8 million, an increase of 30% sequentially and up 3% year-over-year at constant exchange rates. Other revenue, which includes product development, license and grant revenue for the third quarter, was approximately $500,000 and included the third and final tranche of a legal settlement of $300,000. We are pleased with the sequential recovery in our business in the quarter with 18%, 76% and 43% growth in the Americas, Asia Pacific and EMEA regions, respectively. Our operating results in 2022 include certain items related to the strategic financing transaction and subsequent business improvement actions taken by the new management team, including the ongoing rationalization of our product portfolio and restructuring program announced in August 2022. These items increased operating loss by $6.1 million and $24.5 million for the three and nine months ended September 30, 2022. These business improvement actions are ongoing, and we expect to incur additional related expenses in the fourth quarter of 2022 and into 2023, although at a lower level. Non-GAAP net loss was $20.8 million compared to $25.8 million reported for the prior quarter, primarily reflecting higher revenues and higher gross margin. GAAP net loss for the quarter ended September 30, 2022, was $29.4 million compared to $63.5 million for Q2 2022. GAAP net loss in the second quarter included approximately $25 million of losses related to the forward sales of the Series B preferred stock and bridge loans, and $3.5 million related to the impairment of the InstruNor intangible assets. During the quarter, we incurred a charge of $2.2 million included in cost of goods sold, related to the termination of our microfluidic instrument manufacturing contract. Non-GAAP product and service margin was 47.7%, up from 37.7% for the second quarter but down from 58.9% for the third quarter of last year. Non-GAAP operating expenses were $33.2 million, down sequentially from $34.1 million and compared to $28.4 million for the year ago period. Cash and cash equivalents and short-term investments were $185.2 million compared with $211.2 million as of June 30, 2022. During the quarter, our operating cash burn of about $24.6 million was down sequentially from approximately $30 million in Q2 2022."
}