{
    "symbol": "EDAP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-18 12:54:02",
    "content": " On today's call, we will hear from Marc Oczachowski, Chief Executive Officer and Chairman of the Board; Ryan Rhodes, Chief Executive Officer of EDAP US; and Francois Dietsch, Chief Financial Officer. Before we begin, I would like to remind everyone that management's remarks today may contain forward-looking statements, which include statements regarding the company's growth and expansion plans. I'd now like to turn the call over to EDAP’s Chairman and Chief Executive Officer, Marc Oczachowski. Thank you, John and good morning, everyone. I’ll start by providing a brief and personal updates before turning the call over to Ryan Rhodes, our EDAP US Chief Executive Officer for a review of the US business strategy, and then Francois Dietsch, our CFO will present a financial performance. For the quarter, we generated total revenue of EUR 13 million or $14.5 million, representing an increase of 26% as compared to EUR 10.3 million or $12.4 million in the first quarter of 2021. The increase was driven by a very strong capital quarter, particularly in the US. By any measure, the first quarter was a very strong start to the year due to the investments we've made in our US team and infrastructure last year. At this point, I would also like to provide an update on our expansion activities where we believe HIFU and our clinical utility in indications outside of prostate cancer. As a reminder, we are running a Phase II study evaluating HIFU using the Focal One Robotic platform for the treatment of deep infiltrating endometriosis. As we said before, we believe that treatment of endometriosis may be greatly improved, and the use of HIFU technology could offer an important minimally invasive treatment option for these patients. We look forward to results from this important study at HIFU could really add significant value in the management of complex endometriosis, for which there are no currently effective, minimally invasive options. With over $51 million of cash, we are well financed to continue to execute our US growth and expansion plans while in parallel exploring these and other clinical expansion opportunities. At this point, I would like to turn the call over to Ryan Rhodes, CEO of EDAP US for an update on our US operations. As we pre announced on April 12th, the first quarter 2022 was very successful for us in terms of additional Focal One, and ExactVu placements in the US. Notably all three sales occurred at prestigious academic and integrated health network reference centers to include New York-Presbyterian/Weill Cornell Medical Center, Beth Israel Deaconess Lahey Health, an affiliate of Harvard Medical School, and University of California Davis Medical Center in Sacramento. In addition, we announced the sale of five ExactVu micro ultrasound systems in the US during this quarter. Taking together this was a record quarter for capital equipment sales for the company, and reflects the tireless work of the world class team that we have assembled in the US. Another strong leading indicator, of course, is our sales pipeline. Not only does it continue to grow in terms of absolute dollar value, but more and more of it is comprised by community hospitals, in addition to academic medical centers. This is not surprising, as the vast majority of hospitals in the US are community hospitals, but it is also indicative of the growing acceptance of focal therapy as a leading treatment options within urology suite and hospitals of all sizes. Just a few days ago, we had a notable presence at the Annual Meeting of the American Neurological Association or AUA, which is the largest annual gathering of neurologists worldwide. We exhibited and showcased Focal One, and it was a feature topic during both plenary presentations and instructional courses. In addition, several leading academic medical centers were on hand to give presentations on the growing acceptance of focal therapy in the management of prostate cancer. During the meeting, we supported an accredited AUA course, with hands on skills training, which taught neurologists how to implement focal treatments in their practice, while allowing them to utilize Focal One under the guidance of expert faculty. Additionally, ExactVu micro ultrasound was also featured in three sessions of skills enhancement workshops, led by highly experienced urologists. This year's meeting was the most significant presence that we as a company have ever had AUA and we believe it is a function not only of the growing acceptance of focal therapy as part of a comprehensive prostate cancer treatment paradigm, but also a reflection of our technological leadership position, with the most advanced platform available on the market today. Turning to our US team, as I indicated last quarter, we close 2021 with a right sized team capable of strategically covering multiple geographies. On the clinical sales side, the new clinical sales managers that we added are responsible for driving utilization within existing customer accounts have also had an immediate impact. In summary, overall, I'm very pleased with the trajectory of the US businesses on and while we are not disclosing or discussing Q2 results today, we did enter the second quarter with continued sales and utilization momentum. Total revenue for the first quarter of 2022 was EUR 13 million, the 26% increase as compared to a total revenue of EUR 10.3 million in Q1 2021 when reaching a new wakeup level for our first quarter. Looking at revenue by division, total revenue in the HIFU business for the first quarter of 2022 was EUR 3.8 million as compared to EUR 1.8 million for the first quarter of 2021, it represents a 112% increase. Net income for the first quarter of 2022 was EUR 0.4 million or EUR 0.01 per diluted share, as compared to a net income of EUR 0.8 million or EUR 0.03 per diluted share in the year ago period. As of March 31, 2022, the company held cash and cash equivalent of EUR 46.4 million or US $51.6 million as compared to EUR 47.2 million or US $53.4 million as of December 31, 2021. In summary, we are very pleased with our performance in the first quarter. I think we've referenced out on this call, and we continue to add new centers into that pipeline, I would say, coming after AUA, which was a great event for the company, we continue to see added interest both from the academic centers and community hospitals. So I still think you'll see a lot of movement on the academic side, because they have a strong anchor in treating prostate cancer patients. Our pipeline is made up of both academic centers, Regional Cancer Centers, and of course, community hospitals. So I think as we look outward, obviously, more activity in community hospitals over time, but I think we have an equal mix of both academic and community. Okay, that's helpful, and then maybe talking to regular or irregular seasonality of the business. If I remember correctly, I think Q1 is normally the weakest for all business lines, but obviously Q1 was nowhere near weak, this year. Well, in our business historically speaking for that, in ourselves, Q1 is not the weakest, Q3 usually where it slows down before getting back to very, to a lot of activities in Q4. So we take Q1, Q2 are usually kind of equal than Q3 is a little bit low and Q4 is strongest. And again, as we're ramping up and as we are growing significantly, as you could see, and here today, our US business, this may affect a little bit as well, the seasonality as usual. Okay, and then maybe just last one for me. I think we're waiting for a preliminary read in July, which would set the stage for a final read or decision in around the fall time on whether or not you'll be upgraded to APC level 6, I think there was some data review going on too. Yes, so as mentioned before, we had a call with CMS back in mid middle of February. However, if you look at the inpatient proposed rule that was awarded, the inpatient proposed rule was based on 2021 data. And why I referenced this is the 2021 data shows an increase in procedures and an increase in hospital reported cost, which puts us closer to the payment of APC 6 versus where we're at today at APC 5. I will also highlight and very important, we continue to sell in place systems today based on the reimbursement that is current in the market. This is Joe on for Jason, and congrats on a nice start to the year here. Yes, on OpEx side, spending level trails, and we were expecting that again in the first quarter. And you're clearly demonstrating strong commercial progress, even without taking OpEx even higher than you have, in your current commentaries that measured investments will continue to be made. But what's the right way we should be calibrating ourselves and thinking about the growth of OpEx in the context of top line growth, that's running out of 15% to 20% plus rate, thanks. As commented, by Francois, during the call today, we increase our operating expenses, as again, we're building the company here in the US. So as we get on board, more people, more salespeople, more marketing, and clinical people here in the US, will definitely increase the OpEx. We're not just adding a few people last year, I mean, Ryan has brought on board a number of talented world class people during the first quarter and they came. And we are continuing here to hire, again, first and best people to help developing broader markets in the US so that we continue to increase. Yes, on the balance sheet, I did want to ask it looks like your inventory levels move lower than what we've seen over the past couple of years. I mean, we're as usual diligently work on our supply, manufacturing and inventory. Good morning, Marc, Ryan and Francois. So Marc, and Focal One has been in the US market for about four years now almost to the date. So during this time, and obviously, tremendous work has been put in into commercialization of Focal One. So our regional business directors now we've got a well, that team by a notable vice president Scott Finger, and we've got that team, now trained up active in their accounts covering their geographies. So, again, there's always nuances in terms of sales cycle times. So when hospitals are looking at adding focal therapy strategically, and they recognize the clinical value, and even the economic value, if we get in front of the right people, those cycles, sales cycle times come down in terms of duration. So I would say that over time, I would, it would be fair to say that the cycle times would become shorter. Because they're used to buying, just disruptive medical equipment, and they understand the strategic value. So I think as we build out more of a mix, the cycle times will come down. And I think when customers look at us as a company and look at our product, they want our product. And then on the, any commentary, you can provide on the procedure volume, just to get a flavor for the utility of the unit over the last year, year and half because coming out of COVID, has the number of cases been increasing. Same, just trying to understand how that's working out for you, folks. Obviously, that impacts other pieces within the revenue lines. So we continue to see growth, sequential growth, and quarter-over-quarter double digit growth. We're training more doctors today, as we place more systems, but we're also training additional doctors at current install sites. And I think that's a good sign, meaning more are interested in using technology, and have identified a subset of patients who are ideal candidates for focal therapy. So again, as mentioned, we continue to see sequential growth, double digit growth quarter-over-quarter. No, actually, and we discussed that on the last quarterly conference call. We also working on expanding into BPH treatment, as I said last time we did the two first patients in Lyon, two months ago, and we also are exploring, working on pancreatic cancer, as we said, but it's on a very early stage. So we're engaging in various other indications, again, to get to a full multi-application robotic HIFU platform on the long term as the vision of the company. Yes, I mean as I said earlier today, I mean, we will be at the end of the third period in September. And as we said, as well in the past, we will continue to build clinical studies and potentially a Phase 3 study. Okay, well, that concludes our call this morning."
}