{
    "symbol": "KN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 13:00:02",
    "content": " We reported first quarter revenues of $201 million, flat with the same period a year ago, driven by higher revenues in Precision Devices, offset by lower shipments in the Audio segment due to weak consumer electronics demand and continued supply chain shortages. Audio revenues of $146 million were down 11% from the same period a year ago, driven by a challenging supply chain and weak microphone demand in the smartphone and compute markets. The Precision Device segment delivered revenues of $56 million, up 47% from prior year, driven by strong organic growth in defense, industrial and med-tech markets and an acquisition completed in the second quarter of 2021. Audio segment gross margins improved 40 basis points over 2021 levels, driven by lower factory spending and favorable product mix, partially offset by lower factory capacity utilization in our MEMS microphone business. Precision Devices segment gross margins were 45.6%, up 920 basis points from the prior year, driven by favorable product and customer mix, productivity gains, improved factory capacity utilization and an acquisition completed in Q2 2021. Revenue from the Audio segment is expected to be down 7% from Q2 2021 due to lower demand for MEMS microphones and continued global supply chain challenges, which are partially offset by increased demand in the Hearing Health market. We estimate gross margins for the second quarter to be approximately 41% to 42%, down 90 basis points from the year ago period driven by lower factory capacity utilization in our MEMS microphone business and an unfavorable mix due to lower shipments to the higher-margin compute market. But I think from my perspective, Suji, is and I feel like we are still increasing our operating margins, we are increasing our EPS and so this is a really good story that says that when we get back to growth in our MEMS microphone business, you can really see the power that’s going to come in this business in terms of profitability and also cash flow."
}