{
    "symbol": "KN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 20:10:08",
    "content": " We reported second quarter revenues of 188 million, down 12 million from the same period a year ago driven by weak demand for MEMS microphones, partially offset by increased demand in Hearing Health and our Precision Devices segment. Audio revenues of 129 million were down 14% from the same period a year ago, due to weak global microphone demand for consumer electronics, COVID lockdowns in China, and excess PC and smartphone channel inventory. The Precision Devices segment delivered revenues of 60 million, up 19% from prior year driven by growth across most end markets with the highest growth coming from defense, industrial and medtech markets. Audio segment gross margins finished 300 basis points below 2021 levels, driven by lower factory capacity utilization in our MEMS microphone business partially offset by lower factory spending and favorable mix in our Hearing Health business. Precision Devices segment gross margins were 46.7%, up 350 basis points from the prior year, driven by favorable mix, productivity gains and higher factory capacity utilization. Lastly, the cost reduction actions we're taking today support our strategy of focusing on higher value solutions, which should enable us to deliver on our mid-term financial targets of 22% to 24% adjusted EBIT margin and 15% to 17% free cash flow margin earlier than we communicated last November. We expect total company revenue to be between 170 million and 185 million, down approximately 24% from the same period a year ago, driven by lower shipments of MEMS microphones in connection with weak consumer electronic demand and excess compute and smartphone channel inventory. Revenue from the audio segment is expected to be down more than 30% from Q3 2021, primarily due to lower demand for MEMS microphones driven by the macroeconomic headwinds we've discussed. We estimate gross margins for the third quarter to be approximately 37% to 39%, down 390 basis points from the year ago period, driven by lower factory capacity utilization in our MEMS microphone business, an unfavorable mix due to lower shipments to the high margin compute market. We're expecting 15% to 25% sequential growth for the total company, driven by Precision Devices and Hearing Health and a modest increase in microphone shipments as channel inventory is expected to improve. We think gross margins going into -- assuming we're running it at reasonably high capacity, kind of 90% in the MEMS microphone business, we think gross margins would be 42% or above in 2023."
}