{
    "symbol": "KN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 21:29:06",
    "content": " In the quarter Knowles generated $197 million of revenue, which was down 16% versus the prior year, driven primarily by weak consumer electronics and market demand and customers inventory adjustments in consumer MEMS and MedTech & Specialty Audio. We reported fourth quarter revenues of $197 million, down 16% From the year ago period, driven by lower shipment volumes and consumer MEMS mics and medtech and specialty audio, partially offset by higher revenues and precision devices. The precision device segment delivered revenues of $63 million, up 9% from the prior year, driven by growth in medtech, EV, defence and industrial end markets. In medtech and specialty audio, fourth quarter segment revenue was $2 million, down 13% versus the prior year as our customers reduced inventory levels and we faced difficult year-over-year comparables as the second half of 2021 benefited from strong COVID recovery. Consumer MEMS mic revenues of $72 million was down 31% versus the prior year, driven by weak global demand for consumer electronics, channel inventory adjustments and COVID related issues in China. For the full year, gross margins finished at a record high of 47.2% and up 250 basis points over prior year levels, driven by favorable product and customer mix, factory productivity improvements and the acquisition we completed in the first half of 2021. Medtech and specialty audio segment gross margins were 51.6%, up 120 basis points versus the prior year, driven by favorable product mix and foreign currency benefits. For the full year, MSA delivered record gross margins of 49.9%, up 270 basis points over prior year levels, driven by favorable product mix, productivity improvements and benefits related to foreign exchange. Consumer MEMS microphone gross margins for the fourth quarter were 23.9%, down more than 11 percentage points versus the prior year, driven by significantly lower factory capacity utilization, pricing and unfavorable mix, partially offset by benefits to the restructuring actions implemented in the second half of the year. For the full year, gross margins were 28.2%, down 960 basis points from the prior year, driven by unfavorable capacity utilization and product mix, partially offset by benefits of the restructuring actions announced in August. For full year 2022, total company gross margins were 40.6%, down 110 basis points from 2021 with record annual gross margins in both the PD and MSA segments, more than offset by significant year-over-year margin declines in the consumer MEMS mic segment. We estimate gross margins for the first quarter to be approximately 32% to 35%, down eight percentage points from the year ago period, driven by low factory capacity utilization and unfavourable mix in our consumer MEMS mic medtech and specialty audio segments. Right now, I would sit there and say for this year for 2023, we would expect another 30% to 40% growth in terms of revenue, so that it will be over -- probably over $20 million in revenue. If you look at Q4 and actually the numbers I gave in Q1, the benefits are fully of the restructuring, we announced last August are entirely baked into that, I've talked before about a $45 million run rate, which is about 180 million annualized, that's kind of what I would expect sitting here today that is up over 2022 levels, and it's really driven primarily by incentive comp."
}