{
    "symbol": "CVEO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 15:47:03",
    "content": " The key takeaways from our call today are we had strong first quarter with year-over-year revenue growth of 32% and adjusted EBITDA growth of 57%, primarily driven by increased occupancy in our Canadian lodges and Australian villages, coupled with increased Canadian Mobil camp activity. Due to these recent customer conversations and updated customer forecasts in terms of headcount, as well as our strong first quarter results, we are raising our full year 2022 revenue adjusted EBITDA guidance, which I will detail later in the call. During the first quarter, we generated adjusted EBITDA of $25.6 million, operating cash flow $2 million, and free cash flow of $700,000. The increased adjusted EBITDA we experienced in the first quarter of 2022 as compared to the same period in 2021 was largely due to increased build rooms in our Canadian lodges and increase Canadian mobile camp activity, coupled with increased Australian village billed rooms. The year-over-year decrease in operating cash flow and free cash flow was primarily due to an increase in working capital in the first quarter of 2022 as a result of timing of payments, and receipts that is expected to unwind in the second and third quarters of this year. The increase in both revenues and adjusted EBITDA was largely driven by a 32% year-over-year increase in billed rooms related to the recovery in oil prices, and the reduced effects of the COVID-19 pandemic coupled with increased mobile camp activity. On a consolidated basis, capital expenditures for the first quarter of 2022 were $3.6 million, which was relatively consistent with the $3.4 million invested during the same period last year. Based on the first quarter results and our improving outlook for the remainder of the year, we are raising our full year 2022 revenue and EBITDA guidance to $660 million to $675 million of revenues and $95 million to $102 million of adjusted EBITDA. Based on the increased EBITDA and the consistent CapEx guidance that I just outlined, expected interest expense of $10 million for the full year 2022, minimal to cash taxes this year."
}