{
    "symbol": "CVEO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 14:55:24",
    "content": " The key takeaways from our call today are, we had a strong second quarter, with year-over-year revenues up 20% and adjusted EBITDA 15%, primarily driven by an increase in Canadian lodge build rooms and increase Canadian mobile camp activity, as well as an increase in Australian village builders segment, where performance coupled with improving customer demand drove our upward revision to our full year guidance. During the second quarter, we generated adjusted EBITDA of $37.1 million, operating cash flow of $21.7 million and free cash flow of $17.6 million. As Bradley mentioned earlier, the increased adjusted EBITDA we experienced in the second quarter of 2022, just compared to the same period in 2021 was largely due to increase build rooms in our Canadian lodges and increase Canadian mobile camp activity, coupled with increased Australian village build room. Revenues from our Canadian segment were $109 million, as compared to revenues of $83.3 million in the second quarter of 2021. Results for the second quarter of 2022 reflect the impact of a weakened Canadian dollar relative to the U.S. dollar, which decreased revenues and adjusted EBITDA by $4.4 million and 1.2 million, respectively. Results for the second quarter of 2022 reflect the impact of a weakened Australian dollar relative to the U.S. dollar, which decreased revenues and adjusted EBITDA by $5.3 million and $1.2 million, respectively. On a consolidated basis, capital expenditures for the second quarter of 2022 were $5.1 million, compared to $3.2 million invested during the same period of 2021. Based on our second quarter results and improving outlook for the remainder of the year, weâ\u0080\u0099re raising our full year revenue and EBITDA guidance to $660 million to $675 million of revenues and $95 million to $105 million of EBITDA -- adjusted EBITDA. As previously announced, we are raising our full year capital expenditure guide -- expenditure guidance to $24 million to $29 million, with the increase related to capital spending tied to the Wapasu Creek lodge contract renewal. Based on the increased EBITDA and CapEx guidance that I just outlined, expected interest expense of $10 million for 20 -- for full year 2022, minimal expected cash taxes and our expected free cash flow forecast is in the range of $56 million to $71 million, modestly down from the previous free cash flow guidance of $60 million to $72 million."
}