{
    "symbol": "REXR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 19:00:05",
    "content": " We completed 5.1 million square feet of lease activity during the year, achieving leasing spreads of 81% on a GAAP basis and 59% on a cash basis. Our team closed on a record $2.4 billion of investments for the full year, 90% of which were acquired through off-market or lightly marketed transactions, thereby enabling substantially above-market projected return on investment. Looking forward, Rexford is exceptionally well-positioned with embedded internal NOI growth of 43%, equal to an incremental $200 million of NOI contribution over the next 24 months assuming no further acquisitions and assuming todayâ\u0080\u0099s market rents without further growth. Thanks to the hard work of the Rexford team, we are pleased to announce an increase in our first quarter dividend to $0.38 per share, which represents a 21% increase over the prior year. Based on these unique market dynamics and our current leasing activity, we believe there is potential for upwards of 15% market rent growth this year within our infill Southern California markets. With regard to the investment market, we continue to see marketed transactions within our infill markets trading at cap rates in the mid-3% to low 4% range as buyers are still drawn to our marketâ\u0080\u0099s consistent outsized rent growth and stability through economic cycles. For the full year, we completed $2.4 billion of investments across 52 transactions totaling 5.9 million square feet and 31.5 acres of land for near-term redevelopment, which, in aggregate, are projected to generate an unlevered stabilized yield of 4.8% on total cost. With regard to the fourth quarter, we completed $358 million of acquisitions, which are projected to generate an unlevered stabilized yield of 5.4% on total investment. Subsequent to quarter end, we closed two stabilized transactions totaling $405 million, which are currently generating an aggregate 5.1% initial unlevered yield, growing through contractual rent increases of about 4% per annum. Rexfordâ\u0080\u0099s differentiated acquisition strategy continues to enable substantial growth opportunities with $405 million of investments closed year-to-date, $125 million in our near-term pipeline and 250 million square feet of off-market opportunities with identified catalysts tracked through our proprietary origination methods. With regard to our repositioning and redevelopment activity, for the full year, we stabilized 7 projects totaling $140.1 million in overall investment at an aggregate 8.9% unlevered stabilized yield, generating an estimated $175 million of value creation. These investments have a remaining incremental spend of $385 million and are expected to generate an aggregate unlevered yield on total cost of 6.5%, representing an estimated $500 million of value creation, assuming todayâ\u0080\u0099s market rents and no further rent growth. For the full year, same property NOI growth was 7.4% on a GAAP basis and 10.5% on a cash basis, driven by our record 2022 leasing spreads of 81% and 59% on a GAAP and cash basis respectively. As a result of this strong performance and Rexford continued commitment to delivering superior total shareholder return, our Board declared our first quarter dividend of $0.38 per share, representing a 21% annualized increase over the prior year. Average same property occupancy for the year is projected to be 97.5% to 98%, and bad debt as a percent of revenue is projected to be 35 basis points. Hey Jason, Iâ\u0080\u0099ll add to that, that when you look at our acquisition pipeline, I mean, weâ\u0080\u0099re seeing â\u0080\u0093 continue to see strong yields approximately 5% initial yield on that $125 million pipeline and 6% stabilized yields."
}