{
    "symbol": "QSR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 13:09:04",
    "content": " We closed out the year with momentum, having made great progress across a number of important initiatives, including driving strong sales growth at Tim Hortons Canada, launching our Reclaim the Flame plan at Burger King U.S., increasing our net new restaurants year-over-year, improving operations and enhancing the digital guest experience. We finished the year on a strong note, growing fourth quarter consolidated comparable sales 8% year-over-year and net restaurants over 4%, which led to system-wide sales growth of 11% year-over-year, excluding Firehouse Subs in Russia. These results were aided by continued growth in our digital channels, with global digital sales up 24% year-over-year to over $3.5 billion in the fourth quarter, representing over 1/3 of consolidated system-wide sales. In addition, our ongoing efforts to improve our digital capabilities helped drive fourth quarter digital sales growth of 36% year-over-year reaching approximately 11% of system-wide sales. France, our leading international Burger King market, saw over 25% system-wide sales growth year-over-year reaching $1.6 billion in system-wide sales in 2022, and Spain reached $1.3 billion in system-wide sales. During the fourth quarter, Firehouse Subs saw a net unit growth of 2.4% and relatively flat comparable sales, resulting in a 3.9% year-over-year increase in system-wide sales. Our growth rate was also reduced by another 4% related to a few additional drivers, including a $9 million decrease in cash distributions received from various joint ventures, a $7 million year-over-year increase in bad debt at Burger King, largely related to the recent BK U.S. franchisee insolvency Josh mentioned, and a $5 million increase in segment G&A, excluding Firehouse. Our strong free cash flow conversion allowed us to continue executing on key aspects of our capital allocation strategy, including commencing our Reclaim the Flame plan at Burger King U.S. and returning roughly $240 million of capital to shareholders through our industry-leading dividend, which we declared for Q1 at $0.55 per common share unit with a full year target of $2.20 per share in 2023, marking the tenth annual year-over-year increase in our dividend. And I should add on the whole, very strong unit economics in our international businesses, which ultimately, if you combine great franchisees, who're well capitalized with strong unit economics, that's what's going to drive your net new store growth. Joshua Kobza, Restaurant Brands International Limited Partnership - COO of Restaurant Brands International Inc  Yes. Joshua Kobza, Restaurant Brands International Limited Partnership - COO of Restaurant Brands International Inc  Yes. Reclaim the Flame looks like it's working, some of the new advertising and focus on the Whoppers is working and that's helped both sales and as I mentioned, profitability, which was up about 40% in the fourth quarter."
}