{
    "symbol": "MSM",
    "quarter": 2,
    "year": 2023,
    "date": "2023-04-04 11:53:06",
    "content": " Maybe to put a little bit of a finer point on the modeling, because there is a lot of noise like, especially if you think about the fourth quarter prior year with the 53rd week, I would think about for the second half that the contribution to growth from price is between 300 basis points to 400 basis points, such that the year looks like a 400 basis points to 500 basis point contribution from price. So, obviously, we continue to do really well with Mission Critical, that's going to continue to help us in the second half, probably, not surprisingly, we're tracking ahead of the $15 million savings target for the year. And then I think the second thing I'd mentioned Tommy to your question about the initiatives is just the kind of ongoing productivity engine that we've been generating inside the company, which is really what you're seeing is kind of the spirit of the next evolution of Mission Critical, which is deploying things like lean and continuous improvement, getting a lot more organic kind of grounds-up feedback and ideating the projects and the productivity opportunities. But then, in terms of second half dollars, obviously, there is some dependency there, depending on the volume number that you're modeling, but I would suggest definitely a step up in dollars for the third quarter and then depending where you model Q4, obviously pick-up your volume change, but I think Q4 is where you'll probably see a bit more productivity benefit from us than maybe what would be historically typical. So that's sort of the way -- the one other color I'll add Dave is, just as you think ahead beyond 2023, I wouldn't take the $20 million plus and just overlay it on top of -- there'll be other puts and takes with gross margin. But what I would say is, obviously, the spirit of what we've been doing here over the past two and a half years definitely continues on in the Mission Critical 2.0, but it does look a little bit different in terms of how we execute inside the company, sort of the size of the projects that we're taking on and then where the benefit shows up."
}