{
    "symbol": "MYRG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 21:52:15",
    "content": " I'd like to welcome you to the MYR Group conference call to discuss the company's fourth quarter and full year results for 2022, which were reported yesterday. We finished 2022 with strong financial performance in the fourth quarter and full year revenues of $3 billion, setting a record high for the eighth consecutive year. The 2023 construction outlook released in January by the Dodge Construction Network projects an 8% expansion in power and utility spending, up to $56.4 billion this year as demand on our nation's electrical infrastructure increases and the need for viable clean energy sources grows. Fourth quarter 2022 revenues were $864 million, another record high, which represents an increase of $218 million or 33.7% compared to the same period last year. Our fourth quarter T&D revenues were $513.7 million, a record high for our T&D segment with an increase of 45.4% compared to the same period last year. C&I revenues were $350.3 million, a record high for the C&I segment with an increase of 19.6% compared to the same period last year. Fourth quarter 2022 net income was $24.6 million or $1.46 per diluted share, both were record highs for MYR compared to $20.7 million or $1.20 per diluted share for the same period last year. Fourth quarter 2022 EBITDA, also a record high, was $52 million compared to $41.4 million for the same period last year. We have continued to maintain strong funded debt-to-EBITDA leverage ratios that is 0.23x leverage as of December 31, 2022, partly as a result of our record high quarterly free cash flow of $65.2 million achieved during the fourth quarter of 2022. In summary, our deepening and expanding customer relationships, thanks to strong project execution and client collaboration, combined with new contract wins and a burgeoning clean energy transformation market, positioned MYR Group well in the fourth quarter and throughout 2022."
}