{
    "symbol": "BEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-03 14:42:09",
    "content": " Our multi-asset class category recorded $2.3 billion in positive net flows for the quarter, driven by the Franklin Income Fund that has an approach that is adjustable to changing market conditions with $75 billion in US AUM, the income fund has also seen increased interest from investors in Asia and Europe and the strategy was recently launched into the SMA vehicle to meet client demand. Your line is open. I think, if you take a look at active flows for US mutual funds as an example for the month of March, the industry without something like $71 billion and 75% or so of that, was in core taxable fixed income. Your line is open, sir. So just like we do with the rest of our specialist investment managers, it's really an opt-in model and we've had discussions with them about where they're strong and where they need some help and we're filling in the gaps which we think will help their already strong sales process get even better. Your line is open, sir. And it's -- Alex it's a different -- it's really addressing a slightly different question, but while we're on the topic, I think it's worth noting from a financial perspective, the operating income impact of the flows you're referencing, I'm not just referencing Western I'm referencing just the broader parts of fixed income are relatively low, compared to the positive operating income impact we're getting from the growth in alternatives and other growth areas that we've referenced. Your line is open. Your line is open, sir. So if you take a look recently of what we've been where we've been flattish in SMAs, it's really because we've seen some outflows on the legacy side with groups like Western and ClearBridge, but strong inflows onto newer SIMs that we've onboarded onto the platform like Martin Currie, Franklin Templeton, Fixed Income the Canvas platform. But as I've mentioned beforehand, if you're talking about M&A, for example, these transactions are structured in a way that is sensible in this market in particular, the capability to be able to do larger things with in a structured way so you need less upfront is something that means that that amount of excess cash, let's say, can be stretched to create a much larger opportunity if there is one out there for us. Your line is open. Your line is open."
}