{
    "symbol": "CURV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 19:13:09",
    "content": " We've navigated a year of retail challenges with new leadership in many parts of the organization, elevated inventory levels resulting in a higher promotional environment and decreased customer discretionary spend. Essentially focusing on all things that drive product sales for the company, we believe that with Liz Munoz focused on design, Vivian's expertise in marketing and e-commerce, my involvement in product selection as well as Mark's leadership of inventory planning, marketing, e-commerce and planning functions we have a strong team focused on delivering the very best product for our customers. In the distribution center, we put in place new technology that has increased our capacity and allows us to deliver product to our customers faster than ever before, much improved over last year. We've also just - this didn't really apply as much to last year, but some of the nice things that we're seeing early this year, as we've just switched to a new digital marketing agency with a very clear strategic direction to build customer file throughout all categories, reactivation new customers and then focus on retention and frequency as well. But to your point in reinforcing what we said in the call, what has really worked for this business over many years is the customer experience that she has in the dressing room in the stores as a new customer, her conversion into an omni customer and the incredible lifetime value - and dedication that customer has with very high retention rates. And so, we're - we have a calendar for the year of introducing new ideas to this customer, which - so there are two things that we really think about the business, is store expansion, customer acquisition related to that and the drive to omni. I think on a multiyear basis, as we start accelerating store openings, we will also supplement that customer acquisition with more investment in marketing as we move through and not just marketing for top of the funnel, but marketing to actually also drive customers to the stores, so that they can convert at a higher level there and become omni."
}