{
    "symbol": "SNEX",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-08 14:28:02",
    "content": " Factoring this in, the securities rate per million declined 20% to $422 in the first quarter, as compared to $529 in the prior year. Securities net operating revenues, which deducts the interest expense in aggregate, as well as the peering costs and IB commissions, increased 29% versus the prior year driven by increased volumes. Interest and fee income on client balances was $86.2 million, up over 900% as we realized the impact of the cumulative interest rate increases off the back of a 56% increase in our total client float, which now stands at $9.8 billion. We recorded operating revenues of $654.8 million, up 45% versus the prior year. Excluding the acquisition gain of $23.5 million and the intangible amortizations we recorded, adjusted net income of $55.3 million, up 27% over the last year and up 2% on the immediately prior quarter. Our Commercial client segment was up 26% in segment income off the back of a 20% increase in operating revenues, with strong performances from our physical business following the acquisition of CDI, as well as the effect of higher interest rates. Introducing broker commissions declined 4% to $36.8 million in the current period principally due to declines in our independent wealth management and retail FX/CFD business, which was partially offset by incremental expense from the CDI acquisition. Interest expense increased $138.6 million versus the prior year, primarily as a result of the $93.3 million increase in interest expense related to our institutional fixed income business, which Sean noted earlier, as well as a $36.1 million increase in interest paid to clients on their deposits as a result of the significant increase in short-term interest rates. Interest expense on corporate funding increased $2.6 million versus the prior year, also as a result of the increase in short-term interest rates, as well as an increase in average borrowings. Variable compensation increased $18.1 million versus the prior year, due to the increase in net operating revenues and represented 31% of net operating revenues in the current period, compared to 32% of net operating revenues in the prior year period. Fixed compensation increased $5.9 million versus the prior year with the growth principally related to salary and benefit costs of increased head count, which increased 13%, as compared to the prior year, which was partially offset by an increase in deferred compensation. Other expenses increased $23.7 million as compared to the prior year to $110.2 million, which also represented a $3.8 million increase over the immediately preceding quarter. As compared to the prior year, trading systems and market information increased $1.6 million, primarily in our securities business. In addition, professional fees increased $4 million versus the prior year principally due to higher legal, accounting and other consulting fees. Non-trading technology and support increased $1.8 million due to non-trading software implementations, and selling and marketing expenses increased $1.9 million principally due to increased campaigns in our retail FX/CFD business, as well as additional hosted conferences and marketing expenses across our businesses. Finally, depreciation and amortization increased $3.6 million as compared to the prior year due to incremental depreciation related to internally developed software, as well as higher average leasehold improvements and intangibles acquired. Our Commercial segment added $29.8 million in operating revenues versus the prior year, however declined $2.8 million when compared to the immediately preceding quarter. This increase was driven by a $20.7 million increase in interest earned on client balances versus the prior year as a result of a 25% increase in average client equity, as well as a significant increase in short-term interest rates. In addition, operating revenues from physical transactions increased $16.3 million, compared to the prior year principally due to the acquisition of CDI, as well as an increase in precious metals activities. Segment income was $82.8 million for the period, an increase over the prior year and preceding quarter of 26% and 3%, respectively. Operating revenues in our Institutional segment increased $182.2 million versus the prior year primarily driven by $115.5 million increase in securities operating revenues, compared to the prior year as a result of a 56% increase in the average daily volume of securities transactions, as well as the increase in interest rates. Operating revenues increased $3.1 million and $3.9 million in the listed derivative and FX products, respectively, driven by growth in both listed derivatives and FX contract volumes. Finally, interest and fee income earned on client balances increased $56.7 million versus the prior year as a result of the increase in short-term rates, as well as a 106% increase in average client equity. Interest expense related to fixed income trading and securities lending activities increased $93.3 million and $2.2 million, respectively, as compared to the prior year, while interest paid to clients increased $33.1 million. Fixed compensation and benefits increased $1.7 million versus the prior year as we build out our product offering, while other fixed expenses increased $5.6 million, including a $1.7 million increase in professional fees, a $1.5 million increase in trading systems and market information. Operating revenues in our Retail segment declined $25.9 million versus the prior year, which was primarily driven by a $27.3 million decrease in FX and CFD revenues as a result of the 29% decline in RPM, as well as a 10% decline in FX/CFD average daily volume as compared to the prior year. Operating revenues from securities transactions declined $4.1 million, while operating revenues from physical contracts added $2.5 million, as compared to the prior year period. Other fixed expenses increased $6.5 million, compared to the prior year driven by a $1.1 million increase in selling and marketing, a $1.8 million increase in depreciation and amortization, $600,000 increase in non-technology and support costs and a $300,000 increase in travel and business development. Closing out the segment discussion on the next slide, operating revenues in Global Payments increased $13 million versus the prior year driven by a 23% increase in the average daily volume and a 7% increase in the rate per million as compared to the prior year. Overall operating revenues were $654.8 million in the current period, up $204.3 million or 45% over the prior year. However, the $5.2 million positive variance in revenues in unallocated overhead is primarily related to an increase in unallocated interest income net of an FX hedge-related loss as compared to the prior year period. The positive variance in unallocated overhead of $15.5 million was driven by the $5.2 million positive variance in revenues I just mentioned, as well as a $23.5 million gain on acquisition, which was partially offset by a $4.1 million increase in variable compensation as a result of improved performance, a $2.3 million increase in professional fees, a $700,000 increase in depreciation and amortization, a $900,000 increase in trade systems and market information and a $1 million increase in travel and business development. We achieved very strong results in the fiscal first quarter 2023, delivering double-digit increases in operating revenues and net income, which resulted in diluted EPS of $3.62 and an ROE of over 27% for the quarter. These results included a $23.5 million non-taxable gain on the acquisition of CDI, which contributed $1.11 of earnings per diluted share and a significant increase in interest income, reflecting the growth in our client assets and higher interest rate environment. 20-years ago, the stock price was $0.64 and the market value of the company was $1.5 million, and the annual operating revenues were well less than $10 million."
}