{
    "symbol": "USAP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 11:09:02",
    "content": " Gross margin expanded as expected to 12.6% of sales in the second quarter, excluding the positive AMJP grant of $1.8 million and charges for the liquid metal spill at our Bridgeville melt shop of $3.6 million. To add additional perspective, our second quarter backlog increased $124 million or 125% from the second quarter last year. We ended the second quarter with total debt of $84 million, an increase of $8 million from the first quarter due mainly to working capital needs. Our aerospace sales increased 51% to $66 million in the first half of 2022 versus the same period a year ago, which shows the extent of the turnaround in the aerospace market. In the second quarter of 2021, heavy equipment sales totaled $9.3 million or 24% of sales. The power gen market became our fourth largest market in the second quarter of 2022, a 72% sequential increase in sales, which totaled $2.2 million or 4% of sales. General industrial market sales in the second quarter totaled $1.8 million or 4% of sales, a decline of 45% from $3.4 million or 7% of sales in the first quarter and 18% lower than the second quarter of 2021. Our sales for the second quarter reached $52.2 million, which represents a 9.7% increase sequentially and a 35.5% increase versus the second quarter of 2021. Second quarter gross margin totaled $4.7 million or 9.1% of sales, an increase from 8.5% of sales in the first quarter of 2022 and 5.6% of sales in the 2021 second quarter. Gross margin was unfavorably impacted by the liquid metal spill on our Bridgeville melt shop, which caused $3.6 million of expense in the second quarter, net of a $1.5 million insurance recovery payment received in the quarter. The spill costs of $3.6 million include fixed assets and consumable supplies lost in the event, internal labor and vendor spend related to cleanup activities and incremental operating spend incurred due to the spills impact on productivity throughout the plant, as well as a direct charge of $1.3 million of plant fixed costs that would have otherwise been inventoried if the melt shop operated for the entire quarter. Selling, general and administrative costs in the second quarter totaled $5.3 million or 10.1% of sales, which is an increase of about $200,000 compared to the 2022 first quarter and about $100,000 compared to the 2021 second quarter. Capital expenditures for the second quarter were $3 million, an increase compared to the first quarter."
}