{
    "symbol": "USAP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 16:09:03",
    "content": " To summarize the fourth quarter compared to the third quarter, net sales increased 22%, premium alloy sales jumped 69%, aerospace sales rose 27%, order backlog hit a new record high of $288 million. In addition to the $10 million quarterly increase, sales were up 30% from the same quarter of 2021 and the highest since the first quarter of 2020. Premium alloy sales reached a quarterly record of $13.5 million or 24% of sales, a 92% increase from the fourth quarter of 2021. Inventory was reduced to $154.2 million versus $158.9 million at the end of the third quarter, reflecting lower raw material on hand as well as supply chain issues have basically lessened and lower material costs flow in through work in process. Aerospace sales for full year 2022 also demonstrated substantial growth, increasing 50% to $137.5 million or 68% of total 2022 sales. In the heavy equipment market, our second largest market, fourth quarter '22 sales were $5.6 million or 10% of our sales, which is 10% lower than the 2022 third quarter and off 38% in the fourth quarter of 2021. The oil and gas end market was our third largest market in the fourth quarter of '22 with sales of $5.3 million or 9% of sales, an increase of 42% from the third quarter and 29% higher than the fourth quarter of 2021. The general industrial market was our fourth largest market in the fourth quarter of 2022 with $3.6 million in sales -- or 6% of total sales, an increase of 59% from 2022. Power gen market was $1 million or 2% of sales in the fourth quarter, down 33% sequentially and 12% lower than the fourth quarter of 2021. Our sales for the fourth quarter were $56.2 million, representing an increase of 22% sequentially and an increase of 30% versus the fourth quarter of 2021. Fourth quarter 2022 gross margin totaled $2.4 million or 4.3% of sales, a decrease from 6.4% in the third quarter and 8.7% in the 2021 fourth quarter. But we also experienced several unplanned outages, key production units in December, and the impact of our previous liquid metal spill continue to linger, the estimated negative impact on profitability in the fourth quarter due to the related cost impacts from those items was $1.1 million in total. Selling, general and administrative costs in the third quarter totaled $5.6 million or just under 10% of sales, in line with our expectation. Our reported operating loss for Q4 was $3.2 million, about $850,000 worse than Q3, which reflects the cost of sales items outlined previously and our higher SG&A expenses, partially offset by our increased sales volume and base selling prices. Our fourth quarter EBITDA totaled $1.7 million, bringing our full year 2022 EBITDA to $12.8 million. Our CapEx decreased to $1.1 million for the fourth quarter, and as a result, we increased total net debt through those activities by $3.7 million. The net debt increase shown on our statement of cash flow primarily reflects incremental revolver borrowings of $4.7 million during the quarter and $1.8 million of cash received at closing of our new lease financing arrangement related to the capital project to expand our vacuum arc remelt facility at our North Jackson, Ohio plant, net of $2 million of cash on our balance sheet and about $750,000 in total payments made on our term loan facility and prior leasing arrangements during the fourth quarter. However, we had a gross margin problem, came in at $4.3 million versus $6.4 million in the third quarter mainly due to $2.4 million of surcharge and material cost misalignment, unplanned outages at several key facilities and the weather we ran into in December."
}