{
    "symbol": "USAP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 14:16:05",
    "content": " Our backlog increased 11% to reach a new record of $246.3 million, including $73 million in premium alloys or 30% of the total backlog, up from 26% last quarter. In line with our announcement from last week and as reported this morning, shipment volume in the third quarter was 19% lower sequentially due to three factors; the residual effects of the liquid metal spill at our Bridgeville melt shop in the second quarter; the ongoing labor shortage and supply chain challenges resulting in intermittent production outages at key facilities; and an unfortunate spike in COVID cases at our Dunkirk test lab late in September, which curtailed final testing and product certifications necessary for shipping. On the other hand, net sales were up 24.3% versus the third quarter last year and year-to-date sales of $146 million, are up 30% from the same period of 2021. Third quarter premium alloy sales of $8 million were down 9% from the 2022 second quarter, but represented 17% of total sales. Gross margin in the third quarter slipped to $3 million or 6.4% of sales and included $600,000 benefit from the jobs grant received under the AMJP program, $2 million in expenses related to the spill after effects and operating challenges, and $1.5 million in negative misalignment between surcharges and total material costs. Second quarter 2022 gross margin was $4.7 million or 9% of sales, including a $1.8 million benefit AMJP program, offset by $3.6 million in costs related to liquid metals spill. Within inventory, raw material inventories were reduced $3 million or 13%, while work in process inventory increased $11 million or 10% as electric arc melting production doubled over the spill impacted second quarter. Aerospace sales represented 69% of sales, totaling $32 million, down 11% from the second quarter due solely to the production obstacles that impeded our shipments. Third quarter aerospace sales were 42% higher than the third quarter last year and increased 48% to $97 million in the first nine months of 2022 versus the same period a year ago, demonstrating the ongoing turnaround we are seeing in the aerospace market. The heavy equipment market remained our second largest market in the third quarter of 2022 with sales of $6.2 million or 13% of sales, which is 14% lower than the second quarter and off 18% from the third quarter of 2021. The oil and gas end market was our third largest market in the third quarter of 2022, with sales of $3.7 million or 8% of sales. The general industrial market became our fourth largest market in the third quarter of 2022 with sales of $2.2 million or 5% of sales, an increase of 21% from the 2022 second quarter and up 4% from the third quarter of 2021. Power generation market sales totaled $1.6 million or 3% of sales in the third quarter, which is down 30% sequentially, but up 83% from the third quarter of 2021. Our sales for the third quarter were $46.2 million, which represents an 11% decrease sequentially and an increase of 24% versus the third quarter of 2021. Third quarter 2022 gross margin totaled $3.0 million or 6.4% of sales, a decrease from 9.1% of sales in the second quarter and an increase from 6.2% of sales in the 2021 third quarter. Profitability in the current period was again unfavorably impacted by the previous liquid metal spill, which caused negative impacts to gross margin of $2 million in the third quarter and net negative impacts to adjusted EBITDA of $1.5 million after considering the incremental insurance recovery recorded this quarter. The spill costs of $2 million include higher material costs realized on late melt, increased internal labor, contractor and vendor spending related to catch-up activity, margin loss on shipments that were either late or missed entirely within the quarter due to the production impacts of the spill, as well as the impact of disruptions in productivity and gross production levels caused by lingering spill issues. Selling, general and administrative costs in the third quarter totaled $5.3 million or 11.4% of sales, flat to Q2 and an increase of $270,000 compared to the prior year third quarter."
}