{
    "symbol": "SEDG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 18:10:04",
    "content": " Our solar business grew quarter-over-quarter by 21%, driven by growth in all segments and geographies, including record quarterly revenues in the United States and 14 European countries, including the Netherlands, Italy, Poland, Spain, Switzerland and the UK. However, this year, we have seen significant increase in demand already in the first quarter and the growth in our megawatt shipments from Q4, 2021 to Q1, 2022 was 40% in the residential segment and 52% in the Commercial segment. Total revenues for the first quarter were a record $655.1 million, a 19% increase compared to $551.9 million last quarter and a 62% increase compared to $405.5 million for the same quarter last year. Revenues from our Solar segment, which include the sales of residential batteries were a record $608 million, a 21% increase compared to the $502.7 million last quarter and a 62% increase compared to $376.4 million for the same quarter last year. US solar revenues this quarter were a record $265.2 million, a 3% increase from the last quarter and represented 43.6% of our solar revenues. Solar revenues from Europe were a record $285.4 million, a 48% increase from the last quarter and represented 47% of our solar revenues. Rest of the World Solar revenues were a record $57.4 million, a 10% increase compared to the last quarter and represented 9.4% of our total Solar revenues with a very strong quarter in Israel, Australia and Japan and a record quarter in Taiwan. We expect this to continue in the second quarter and gradually ease from the third quarter onwards as we ramp Mexico and decrease the portion of Chinese-made products for the US market The second is related to costs paid to our contract manufacturers in order to continue manufacturing during the Chinese New Year period and are one-time in nature, and for ramp-up expenses in Mexico, China and Vietnam that will continue through the end of this year The third element is the increase in revenues from batteries out of our total product mix which have lower gross margins. On a non-GAAP basis, operating expenses for the first quarter were $98.9 million or 15.1% of revenues compared to $94.1 million or 17.1% of revenues in the prior quarter and $76.2 million or 18.8% of revenues for the same quarter last year."
}