{
    "symbol": "SEDG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-13 20:50:03",
    "content": " Note that in the first quarter -- fourth quarter of 2022, 52% of the batteries attached to new PV installations with our inverter systems were of our own battery and 48% were batteries from other suppliers attached to our inverter systems. In these countries, in particular and across our global markets in general, growth this quarter came from a higher portion of sales of inverters and optimizers versus batteries and as a result of the strong demand for our products for new solar installations. Revenues from our solar segment, which include the sales of residential batteries were a record $837 million, a 6% increase compared to $788.6 million last quarter and a 66% increase compared to $502.7 million for the same quarter last year. Solar revenues from the United States this quarter were $305.5 million, a 21% increase from the last quarter and a 19% increase from the same quarter last year, representing 36% of our solar revenues. Solar revenues from Europe were $473 million, a 1% decrease from the last quarter and 145% increase from the same quarter last year, representing 57% of our solar revenues. Rest of the World solar revenues were $58.5 million, a 5% decrease compared to the last quarter and a 12% increase from the last year, representing 7% of our total solar revenues. This has a further decrease compared to the 24% last quarter and is mainly attributed to the ramp of our manufacturing in Mexico, which is supplying the majority of our residential products to the United States an increased portion of U.S. commercial products coming from our production site in Vietnam. On a non-GAAP basis, operating expenses for the fourth quarter were $119 million or 13.4% of revenue, compared to $108.3 million or 12.9% of revenues in the prior quarter and $94.1 million or 17.1% of revenues for the same quarter last year. And therefore, while we actually believe that we will see margin stabilizing maybe a little bit higher than what we guided for in the Analyst Day, there is still some way that we expect us to continue and get towards getting to our 20% to 22% of net operating margins on the overall business as we will see more batteries in the mix. But generally speaking, we are seeing we are expecting strong momentum and maybe some softness in the next quarter or two or a few quarters, but the long-term -- mid- and long-term outlook for the market is positive, and we're building the capacity in order to meet it with domestic manufactured product and not only in the residential segment, obviously."
}