{
    "symbol": "SEDG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 20:55:20",
    "content": " Revenues from our solar segment, which includes the sales of residential batteries were a record $687.6 million, a 13% increase compared to $608 million in the last quarter and a 59% increase compared to $431.5 million in the same quarter last year. Your line is open, please go ahead. Your line is open, please go ahead. Here the lockdown that  mentioned in Shanghai not only created a situation where we paid a little bit more in Q2, it actually took away three weeks of manufacturing during the quarter that we now need to expedite through Q3, but still by the way even had it been for the regular exchange rate, we would see our gross margins going up. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. But again, itâ\u0080\u0099s not so much due to the demand necessarily being even, I think that probably, although residential is growing very fast, our commercial is probably growing a bit faster for sure in megawatt just because of the dynamics that we mentioned before of companies looking at fitting out tens of factories with solar also to compensate for the power â\u0080\u0093 for the increases in power prices and also for ESG need. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And here, I think on the heels of Zviâ\u0080\u0099s answer when it comes to the operating margin, the difference is not very large between residential and commercial, because on one hand, the residential on let's say kilowatt basis enjoys the better gross margin, but requires a little bit more of a high touch sales or a high touch, I would call it usage of operating expenses, where at the same time when you are selling, when you're making one sale of commercial system, the ASP per watt is smaller, but in essence, the OpEx associated with it is also relatively small simply because it's a single deal."
}