{
    "symbol": "SEDG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 22:15:28",
    "content": " Total revenues for the third quarter were a record $836.7 million, a 15% increase compared to $727.8 million last quarter and a 59% increase compared to $526.4 million for the same quarter last year. Revenues from our solar segment, which includes the sales of residential batteries, were a record $788.6 million, a 15% increase compared to $687.6 million last quarter and a 65% increase compared to $476.8 million for the same quarter last year. Solar revenues from the United States this quarter were $251.6 million, a 19% decrease from the last quarter and represented 32% of our solar revenues. Solar revenues from Europe were a record $475.7 million, a 46% increase from the last quarter and represented 60% of our solar revenues. Specifically, the impact of the euro devaluation in comparison to the average exchange rate of the last quarter is translated into a reduction of $31.7 million in revenues and 360 basis points of gross margins. Despite the 360 basis points negative impact of the euro devaluation compared to the last quarter and the increased portion of batteries within our overall mix, this quarter-over-quarter increase in gross margin as a result of the price increases we have implemented globally and of our disciplined execution on the operational activities where the increase in manufacturing capacity, coupled with reduction in shipping prices, contributed 140 basis points of reduced shipping costs to our gross margin. On a non-GAAP basis, operating expenses for the third quarter were $108.3 million or 12.9% of revenues compared to $109.6 million or 15.1% of revenues in the prior quarter and $83.8 million or 15.9% of revenues for the same quarter last year. Of course, once the euro is getting stronger against the U.S. dollars, we're benefiting because, as I mentioned in the prepared remarks, we have today over EUR 800 million or euro-denominated balances on our balance sheet, and therefore, simply take $800 million and take the difference in the quarter, and you'll see exactly what's going to be the impact. And we do expect them to diminish and be reduced towards the second -- end of the second quarter of 2023, where the biggest issue there is actually the ramp-up of our Mexican facilities that will require less overseas shipments going into the United States and will also free the capacity that we have today in China, Vietnam, Israel and Europe for shipments in Europe itself. Last quarter, as you mentioned, it was 15%, with the growing volumes and especially 3 phase batteries that are going to Europe where -- we believe today that the pricing is a little bit more reflecting a little bit better margins. And also, by the way, this quarter, we sold approximately 40% -- $40 million more inventory just related of materials coming into Sella 2 of the production that we see there. The general trend is that while we will see -- as we mentioned, again towards the end of the second quarter of '23 return to the guided margins we believe, at least, to the guided margins of the Analyst Day, this is usually on the heels of the fact that revenues are expected to grow and margins to improve and expenses will usually not grow at the same pace as revenues."
}