{
    "symbol": "CLOV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 18:22:03",
    "content": " Ladies and gentlemen, good afternoon, and welcome to the Clover Health Third Quarter 2022 Earnings Conference Call. I would now like to turn the call over to Ryan Schmidt, Investor Relations for Clover Health. Joining me on the call today to discuss the companyâ\u0080\u0099s third quarter results are Vivek Garipalli; Clover Health Chief Executive Officer, Andrew Toy, the companyâ\u0080\u0099s President; and Scott Leffler, our Chief Financial Officer. I'd also like to caution you that we may make forward-looking statements during today's call, that are subject to risks and uncertainties, including expectations about future performance. Factors that may cause actual results to differ materially from expectations are detailed in our SEC filings, including in the Risk Factors section of our most recent Annual Report on Form 10-K. Information about non-GAAP financial measures referenced, including a reconciliation of those measures to GAAP measures, can be found in the earnings materials available on our website. Our wide network approach powered by Clover Assistant, enabling great primary care, helped deliver a solid set of results for the third quarter. I'm proud of the hard work being done by everyone at Clover so far this year, leading to consistently improving financial results in our insurance line business and a maturation of our noninsurance business. Importantly, I also believe that this quarter's results further illustrate our positive momentum towards achieving profitability. We delivered significant improvement in insurance MCR, continued stability in adjusted SG&A spending and strong revenue and live growth relative to the prior year period. Clover Assistant continues to be a key differentiator in our mission to improve every life, by supporting physicians in catching and treating conditions earlier. We continue to see MCR performance that is over 1,000 basis points better for returning members, whoâ\u0080\u0099s PCPs used Clover Assistant, as compared to members whose PCPs do not. We believe this differential in MCR performance is evident that Clover Assistant is in fact, helping to improve clinical outcomes. Finally, I am pleased by our increased focus on operational excellence at Clover, which contributed to our maintaining 3.5 stars on our flagship PPO plan. Our Q3 results were highlighted by significant improvement in our insurance MCR to 86.3%, and I am excited to see that our focus on sustainable insurance operations, bringing Clovers to more doctors and our consistent improvement of Clover Assistant platform capabilities are having such a meaningful impact on performance. Therefore, our 2022 results are not yet reflective of the favorable impact that we expect from being paid on 3.5 stars beginning in 2023. While some uncertainty exists due to typical end of year seasonality in medical expenses, as well as the ongoing risk of COVID surges, we are revising our 2022 insurance MCR guidance to reflect our overall improved performance and positive momentum. As I've previously discussed, we are now highly focused on striking the right balance between growth and profitability. We believe our coal assistant enabled model gives us a structural advantage over other industry participants, allowing for profitable above-market growth. However, it is a well-understood attribute all MA plans as new members typically represent a headwind to MCR as it takes a year or two to comprehensively diagnose health conditions and bring members under care management. To be clear, we expect to continue to grow membership above market rate, but we also expect overall growth in life that will be lower than previous years. With regard specifically to 2023, we believe that the current AEP season will be especially competitive with some of our competitors improving their benefits in an attempt to come in line with our offering. That said, while others can try to match our insurance plans, we believe they lack the ability to manage care on a wide physician network, which is what Clover assisted us towards us. Our Q3 non-insurance MCR was 104.2%, which is a result that we intend to improve. ACO Reach is an innovative program and its rules and benchmark rates continue to be adjusted by CMMI, resulting in some amount of unpredictability. Given the program environment and the learnings with our participants, we have modified our ACO to target an MCR lower than 100% next year and have made adjustments to the number of physicians participating in the ACO Reach program. Despite having many new participation for 2023 that would have allowed for a substantial program growth, we have decided to significantly decrease the total number of participating physicians. And importantly, we very much believe these adjustments will result in a sustainable business line with an MCR below 100%. To be clear, we continue to strongly believe in Clover Assistant being used for the entirety of a physician's Medicare panel, including fee-for-service. We believe these other programs could be a very good fit for a number of these physicians, and we will provide more updates here as they come about. I also want to echo that I am proud of Clover's performance this year, and look forward to building upon our positive momentum next year, when we're paid at 3.5 stars on our flagship PPO plan. As Vivek and Andrew mentioned, our Q3 results were highlighted by significant improvement in insurance MCR, which improved to 86.3% this quarter from 102.5% in Q3 of last year. Our year-to-date insurance MCR through Q3 also demonstrates the meaningful improvement over a more extended period, with Q3 year-to-date MCR improving to 91.7% from 107.1% in the Q3 year-to-date period last year. That said, the insurance MCR does reflect favorability from prior periods and we don't view 86.3% as a go-forward run rate. Our non-insurance MCR was 104.2%, elevated versus Q3 of 2021. As Andrew mentioned, we're excited about the changes we're making to the program, which we believe will result in an MCR below 100% for the non-insurance line in 2023. During the third quarter, insurance and non-insurance revenue growth of 32% and 163% respectively was driven by growth in live vendor management, resulting in total revenue of $857 million and net medical claims incurred of $840 million. Looking forward to 2023, we expect the insurance line to continue to grow at above market rates, although somewhat moderated from recent years. In addition, the decision to reduce the scale of participation in the ACO program will result in a reduction of our non-insurance revenue by up to two-thirds. As Andrew mentioned, we still expect non-insurance to be a $1 billion revenue line of business. Both of these changes are reflective of our increasing emphasis on profitability and will drive continued improvement in MCR and adjusted EBITDA performance, ultimately driving us towards profitability. Third quarter adjusted SG&A, which we previously referred to as adjusted operating expenses was $75.3 million, representing 9% of total revenue, a modest improvement since last quarter and down nearly 800 basis points year-over-year. Adjusted EBITDA for the third quarter was negative $58.3 million, improving significantly from a loss of $79.7 million in the prior year period. As a result of another strong quarter and favorable momentum, we are updating our guidance for the full year 2022 to include an improved insurance MCR range of 93% to 94%. We estimate that full year non-GAAP adjusted SG&A will be between $320 million and $330 million, representing adjusted SG&A as a percentage of revenue between 9% and 10%. Furthermore, while we are not providing explicit stand-alone guidance for the fourth quarter of 2022, we do expect Q4 revenue for each line of business to be similar to our results in this third quarter. In conclusion, we recorded strong financial results during the third quarter with a meaningfully improved insurance MCR, coupled with strong insurance revenue and lives growth and great operational execution, which will benefit us in the future. First, a big thank you to the entire Clover team and all of the extremely hard work that has led to a very good quarter. The continued evolution of Clover Assistant is having a bigger and bigger impact on our results, and I believe that trend will only continue. Firstly, Andrew's transition to CEO is going extremely well, and there's no better person and leader to be at the helm of Clover for the next many years to come. And speaking as the largest Clover shareholder, I am very confident he will deliver for me and for all of our current and future shareholders in ways that will be spectacular and shocking in a good way over the next many years. Now looking ahead, Firstly, it's important to remember that the public and private markets and yet to see a healthcare company achieved a positive disruptive impact at scale versus just the slice of it. Healthcare, education and energy production are three industries where positive disruptive impact at scale has not yet been proven out. I've been fortunate to be a part of building and investing in businesses at all stages of life cycle across outpatient, hospital provider, revenue cycle, medical device, data, technology and therapeutics, domestic international as well as many businesses outside of healthcare. One conclusion I've come to over the years is that the vast majority of the public market value of healthcare companies today has been created on the back of medical cost inflation and more simply, healthcare cost inflation in excess of GDP growth has accrued to mass market value, plain and simple. Any investor who believes it will be straightforward for large and small companies to pivot from a business model or benefiting from medical cost inflation to a model benefiting for medical cost reduction is not only wrong but also delusional, and has likely never tried to pivot a business in that seismic of a fashion. From my vantage point, I would be very surprised if three things I'm about to describe do not manifest itself within the next 10 years. In 10 years, that number will be at least 10% and more likely 30% or higher. Second, a significant amount of healthcare technology being developed today has nothing to do with aiding clinicians and making better clinical decisions. In 10 years, the most valuable healthcare technology companies will be driving true clinical intelligence to clinicians. For healthcare technology, a huge portion of our R&D spend is around the Clover Assistant and clinical intelligence for clinicians. In 10 years, I strongly believe that it is possible for Clover to have made the biggest positive impact in healthcare, while simultaneously accruing the largest market value in healthcare in excess of any healthcare company that exists today. When I look across the healthcare CEO landscape and my top three list of where value will accrue, it's obvious to me that Andrew's head and shoulders above anyone else out there. What that means is that those rules can still change, rates are being tweaked, the models being adjusted, so we still intend to be one of the larger participants in that program, but we're very excited to extend fee-for-service into other areas too. So you'll see us move away from having everyone is fee-for-service just an ACO REACH, and then we'll discuss more about motion into MSSP and having a blended portfolio for fee-for-service, and we'll talk more about that in the future. I just wanted to go back to commentary on how you're thinking about 2023, right, including the benefit from this year's star performance on revenue. I think for next year, I think you flagged that before in the past there's a 300 to 500 basis point benefit to insurance MCR. So, yeah, there's a number of different drivers that we have going into 2023 that we think will take us from our -- what we think is a significantly improved performance and run rate here in 2022. I think that we mentioned in our comments earlier that we view the run rate coming out of 2022 is being more or less in line with the full year 2022 guidance of 93%, 94%. And in terms of the insurance line MCR, you're right, we have made comments in the past around the incremental impact from the 3.5 -- being paid on 3.5 stars is being 300 to 500 basis points. Just as we're entering the AEP period for this year, and you guys pulled back on the number of counties, new counties you were going after. I know you said you're expecting maybe a little bit lower growth rate versus past years because of the competitiveness, but still above market rates. We've always tuned how we look at growth, because we are able to grow without having to put a lot of capital into marketing. So this year, we really are adjusting our growth rate, not because of competitiveness, but because the faster we grow, the more new members we have, and because it takes a year or two to bring them under care management that provides a headwind to MCR and our path to profitability. So because we are absolutely focused on MCR profitability and operating expenses, we decided to moderate growth a little bit, and therefore, that will provide a tailwind towards that pathway in our breakeven point. Again, in that same vein there, the more returning members we have who are under Clover Assistant management, that's where we see our model really coming to a turn. So because we're choosing down growth a little bit this year and going into next season, we'll have more of those returning members, especially in South Jersey, in Georgia. And because that percentage of returning members will be higher, we expect to see significant improvements in MCR and we look forward to reporting more on that next year. Not every single doctor is at that 100% MLR as they go through, but we have a strong belief that they engage well with the model, they have care management programs in place that are complement to our care management programs and so we really feel like thereâ\u0080\u0099s a lot of tailwinds that haven't performed well as they go into next year. And more broadly, we are looking across the entire business to make sure that we're operating at the most efficient level, and it's an area that we're going to prioritize as we get into 2023, just as part of our overall broader efforts towards profitability, not necessarily something I would like specifically for the DCE side of the business. I was going to add to Andrew's comments as well, Kevin, that we had made a comment earlier that we view the order of magnitude of the go forward, non-insurance line of businesses being around $1 billion and not revenue. So we could have grown the program quite significantly, like this year. I think the way that we should look at it is that the pathway into value-based care is probably not straight from fee-for-service into upside downside, which is what if your reach is, but we provide -- we plan to provide a more gradual pathway where people can go enter. I have a lot of folks, like I said, we have a lot of applicants and they could move into an upside-only program like MSSP move through the various stages of MSSP and then when appropriate graduate is there something like the ACO reach program. We think that's closer to what CMS envisions anyway, and it's unusual that will be ACO reach up about, as to having multiple sort of peers that they can participate in the fall this data from Clover Assistant in serving us, which here they should be in, we think can provide a very strong advantage in terms of selecting the right program for a doctor. I'm looking very much looking forward to 2023, when I will share our next quarter results with you all as CEO of Clover. I'm very proud that Clover is strong, purposefully evolving, and we're definitely heading in the right direction. His vision inspiration, I believe that health care can truly be both different and better than what it currently is are all core to Clover philosophy and integral to why I began this particular journey. In the last few years, there are many things that Clover has executed on under Vivekâ\u0080\u0099s leadership and vision that were far from common wisdom and were deemed to be impossible. When Clover started, we were the only plan really offering incredibly strong plan benefits on a PPO, and we see now that other plants are copying our model. Years ago, we launched our own Complex Care Program betting at the future of Chronic Care Management was in the home. We believe it's actually one of the largest in New Jersey, and we see others moving to that model of care. And of course, we have always believed that primary care is critical and a forming physicians with technology to simply help them make better decisions without forcing them to do anything they don't want to do is crucial."
}