{
    "symbol": "CLOV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:09:06",
    "content": " And some of those effects obviously fluid to do with the economic, all of that inside that overall MCR that we've seen, and we've decided to take an approach where we're going to look at what happens none of us really know what's going to happen with COVID going forward. So as you're pointing out, our more mature markets do have a lower MCR, and we do think that there's a lot of opportunities for our newer markets, not just South New Jersey, but also Georgia to look like our mature ones overtime. So, we're last checked, I think a little bit north of 60% of eligibles, clinical eligibles are actually enrolled in Clover home based primary care, obviously, the most acute portion of population while we're growing at a pretty rapid clip as well. So it's a little too early and we're waiting for data signals to see that as we revert back to hopefully a more normal or a little bit post-COVID world, what the effect will be in South Jersey, but I really did want to show that to your point, like the MedEx side of things were different from a different regional basis. And then, I guess, any stats just show about kind of -- I was under the impression that kind of doing the Direct Contracting was really going to help accelerate that I would expect to see a higher percentage of MA lives go up because you'd be engaging doctors a lot more ways, which means you've captured more and more patients, but it's sort of surprising to see it coming down even though you are growing in new markets a little bit surprising to see come down. Basically, what we're seeing -- yes, so what we're seeing right now in the index, it's kind of like the reverse form of the COVID question is it's a little bit difficult for us to disconsolate what is in the COVID trend versus a non COVID trend, because what we really have is like conditions of procedures done with a COVID diagnosis, for example, in the inpatient setting, or we'll see how many total COVID diagnosis they are. And that's something we alluded to is our ultimate goal is to cover the entirety of the Medicare panel and enable physicians to feel like because exceeding value-based care with their entire Medicare panel, and that'll be a really great place to be. And I think it's always important to remember that while growing, even today, there's about a little over 1000 basis point differential on MCR for returning members whose PCP is used the Clover Assistant versus those who don't. And then, we just announced I think today, our new Head of Value-Based Care, again, emphasizing our focus on the ACO Reach program, and the fact that we truly believe that Clover Assistant can help us bring physicians who normally don't participate in value-based care into programs like this. And we are actually getting a lot of inquiry from our CA partners around that because they really -- there's no difference between how they care for folks clinically, folks who are on Medicare based upon which Insurance company or what their form of insurance is, whether they're on M&A, Clover M&A, fee-for-service. And just to close, while we feel very good about where we are today, there's really great and really hard work being done this year to drive continued progress and enabling this is the Clover System, it's providing us a growing technology moat while we're making a meaningful and positive impact in health equity, along our mission to improve every life."
}