{
    "symbol": "SNPS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-30 18:28:05",
    "content": " We continue to execute well and are confident in our business heading into FY 2023 driven by our strong technology portfolio that is expanding customer commitments, robust chip and system design activity despite moderating semiconductor industry revenue growth, and a resilient and stable time-based business model with $7.1 billion in non-cash backlog. For fiscal year 2023, the full year targets are; revenue of $5.775 million to $5.825 billion; total GAAP costs and expenses between $4.49 and $4.537 billion; total non-GAAP costs and expenses between $3.81 billion and $3.84 billion, resulting in a non-GAAP operating margin improvement of more than 100 basis points; non-GAAP tax rate of 18%; GAAP earnings of $10.28 to $10.35 per share, cash flow from operations of approximately $1.7 billion. And in a context like that, Synopsys has the good fortune to have a business model that is very stable and self-sustainable, but also a set of customers that have no interest in going up and down in their R&D force, because it's a continual investment over typically products that take two to three years to develop, and so I think we provide a good solidity in pretty much all the fronts. Very strong, but also significant increase in design complexity and more importantly, chip design cycle times, Aart, I'm wondering is the complexity and cycle time dynamic requiring your customers to use hardware emulation and prototyping as an integral part of the verification and software development process versus it being somewhat discretionary five, 10 years ago. So, let me zoom out a little bit on your question because generically, I think you're pushing absolutely on the right buttons, which is that while many of the things we've done in the past have been sort of point efforts, point tools and so on, for the last decade, we have started to integrate many tools more forcefully together because that's the only way of solving problems of complexity where power and speed and thermal and locations and reliability strongly intersect."
}