{
    "symbol": "SNPS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-18 19:47:10",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Synopsys Earnings Conference Call for the Second Quarter of Fiscal Year 2022. As a reminder, today’s call is being recorded. Before we begin, I’d like to remind everyone that during the course of the conference call, Synopsys will discuss forecasts, targets and other forward-looking statements regarding the Company and its financial results. In addition to any risks that we highlight during the call, important factors that may affect our future results are described in our most recent SEC reports and today’s earnings press release. With that, I’ll turn the call over to Aart de Geus. We delivered an outstanding second quarter, exceeding all of our guidance targets and reaching record revenue, operating margin, earnings per share and cash flow. GAAP earnings per share were $1.89, with non-GAAP earnings of $2.50 and non-GAAP ops margin of 37%. With our significant first half strength and high confidence in our business, we are raising guidance substantially for the year. We expect to grow annual revenue approximately 20% to pass the $5 billion milestone, drive further ops margin expansion and grow earnings per share by more than 25%, while generating approximately $1.6 billion in operating cash flow. This is synonymous to stating that in both, consumer and business applications, the need for electronics and chips is relentless, chips for data capture and IoTs, for data transmission, for data storage and, of course, for faster high-bandwidth and dedicated computation, plus a huge and intensifying need for more security and safety. We’ve seen growing demand, not only from our traditional semi and systems customers, but also from impactful new entrants such as hyperscalers, a mounting number of start-ups and nontraditional systems companies across vertical markets. Notwithstanding macroeconomic choppiness in an uncertain geopolitical environment, these companies are investing heavily in highly complex chips, systems of chips and chiplets and security initiatives. Our innovations, particularly in AI-driven design flows and at the intersection of hardware and software, are crucial for our customers and have fueled our accelerating momentum. In addition, our IP focus, particularly in high-speed connectivity and advanced interfaces supporting multichip design is second to none and yielding excellent business growth. The reported results were truly remarkable, as much as 20x productivity improvement, 7% to 25% lower power and a dramatic reduction in turnaround time with a single engineer completing four design blocks in half the time that had previously took four engineers. Critical to the high impact of DSO.ai is our powerful digital design solution, resulting in significant cross-selling opportunities and competitive wins at cornerstone semiconductor and systems customers. In Q2, two major hyperscalers selected Synopsys’ highly differentiated Fusion Compiler product for multiple advanced designs. At our user conference, I had the opportunity to highlight not only some of the exciting capabilities to come such as using AI and verification, but also how Synopsys overall is technically helping to transform EDA design more broadly. Our custom design solutions, for example, are seeing strong market disruptions as well, including 19 full-flow competitive displacements year-to-date. Over the past year, revenue grew double digit in this area, with adoptions ranging from large semiconductor companies designing at advanced nodes to automotive to memory vendors. With advanced chips -- while advanced chips are the foundation of continued scale complexity, electronic systems now increasingly grow systemic complexity by tightly connecting many chips and the software to drive them. Here, too, business momentum continued with another excellent quarter as demand remains very high, especially in the AI, high-performance compute and automotive markets. In Q2, we enhanced our comprehensive AI IP portfolio with the introduction of the industry’s highest performance neuroprocessor IP. We can report significant traction with our interface and foundation IP, achieving more than 30 3-nanometer design wins for high-performance compute and networking, as well as notable wins in mobile applications. In automotive, our decade-plus investments, safety certifications and market engagements are not only generating continued momentum with leading semiconductor suppliers, but also with OEMs and Tier 1s now developing their own chips. Demand is high, and we’re heading towards another record year. While demand is broad-based across customers and geographies, we continue to see significant growth in usage expansion at many of the largest hyperscalers in the world. Second, multi-die, sometimes called chiplet-based system design, is driving a strong need for innovation. Synopsys is uniquely differentiated with our 3DIC Compiler solution and the industry’s leading portfolio of die-to-die interface IP, both of which are essential. Our focus and execution are driving adoption momentum with engagements across multiple market segments, including AI servers, automotive, telecom and aerospace. Of course, our EDA customers have been using cloud compute for years, but true flexibility hasn’t been available until now. In Q2, we expanded our cloud offering with the industry’s first broad-scale cloud SaaS solution. Synopsys now offers three cloud approaches usable for peak demand to full deployment: One, bring your own cloud with pay-per-use access on the customer’s choice of third-party cloud provider; two, a SaaS model with tools, flows and Microsoft Azure-based compute; three, hardware-based verification with ZeBu Cloud. Bolstered by momentum of products and consulting as well as broadening geography strength, we delivered another strong quarter with 20% year-over-year growth, exceeding our internal plan. Internationally, we had our best quarter ever, reaching 10 new countries that we’ve never sold to before through our channel partners. Over the past year, we’ve launched significant new products in each of these areas, and customer response has been excellent. Building on a wave of technology innovations, fueling growth, strong and resilient markets and excellent operational and financial execution, we’re poised to cross the $5 billion mark revenue milestone this fiscal year. With that, I’ll turn it over to Trac. After surpassing $4 billion in revenue in 2021, we expect to grow 20% and cross $5 billion in 2022 as our growth accelerates for the third straight year. We generated total revenue of $1.28 billion, up 25% over the prior year, with strength across all product groups and geographies. Total non-GAAP costs and expenses were $809 million, resulting in a non-GAAP operating margin of 36.8%. Non-GAAP earnings per share were $2.50, up 47% over the prior year. Semiconductor & System Design segment revenue was $1.17 billion, up 25%, with robust demand for EDA software and IP. Software Integrity segment revenue was $113 million, up 20%. Turning to cash, we generated a record $750 million in operating cash flow. We ended the quarter with cash and short-term investments of $1.72 billion, and debt of $24 million. We are raising our full-year outlook for revenue, operating margins, earnings, and cash flow. For fiscal year 2022, the full year targets are revenue of $5 billion to $5.05 billion, this represents 19% to 20% growth and a $225 million increase versus our prior outlook. Total non-GAAP costs and expenses between $3.35 billion and $3.38 billion, resulting in non-GAAP operating margin improvement of approximately 250 basis points. Non-GAAP earnings of $8.63 to $8.70 per share, representing 26% to 27% growth. Capital expenditures of approximately $145 million, up from our prior guidance as we consolidate our campus at headquarters to create a more efficient and economical footprint. And based on our strong momentum, we expect to deliver 20% revenue growth 250 basis points of non-GAAP operating margin improvement, more than 25% non-GAAP earnings growth and $1.6 billion of operating cash flow in fiscal 2022. With that, I’ll turn it over to the operator for questions. I want to ask a multipart question on the backlog, up, I believe, roughly 50% year-over-year and mid-single-digit percent or high single-digit percent sequentially. And here we sit today with the potential for your company to grow 20% this year, and that’s obviously much -- well, I guess, it’s technically within your long-term view of double-digit percent growth. So, I’m wondering if we can get an updated view on your long-term revenue growth target. Well, right now, we’re not changing any targets for the long term, but clearly, we’re at the right end of the double digit answer. And in general, I would say that we feel that we’re in a strong position that has a potential to continue for quite a while by virtue of not only building up the backlog, but more importantly so, by the conjunction of the demand in the market and what we have to offer being particularly well aligned. So, I think, the Company is very strong right now, and you saw that we changed the objective for the year considerably from where we started the year. Well, I wouldn’t say it’s a surprise. Obviously, the markets around us have a lot of noise up and down and sideways, but we cater to a part of the market that is highly competitive where there is a renewed understanding of how important chips are for differentiation in literally every field you can think of. And so, that is an area where the customers want to move faster with better tools, with faster solutions, and I think we’re well positioned in that. Because in December, we are coming off of several years of very strong growth and margin improvement. So, right now, we’re feeling -- we’re feeling like we’re executing well against the opportunity ahead of us, and the outlook is really positive. If we kind of back into the 4Q kind of implied framework, and I know Q4 is typically kind of one of the lower points on margins, but this year, it seems a little bit lower than on a sequential basis. Well, I’ll start with the fact that we are raising the overall margins for the year by 250 basis points versus ‘21. So, it’s a really strong improvement. Good hiring, and frankly, the other part that’s contributing to it is the fact that the outlook is so strong that we are increasing our variable compensation accrual in the back half of the year. First question, Trac, just kind of around something that you mentioned last quarter and just thinking about durations haven’t changed, but backlog orders well ahead of plan, et cetera. And I’m just wondering if you could comment a little bit about kind of the pricing environment as you’re seeing expansion of tools across large customers, et cetera. I’d say, the pricing environment is pretty healthy for us right now. And as you heard in Aart’s comments or prepared remarks, they are creating a lot of value for our customers. And the ability -- when you’re coming to an engagement of the customer with really good products that’s solving their problems in a much more efficient, effective and scalable way, it’s a much more constructive conversation on pricing. You’re right with both, meaning that in decades ago, clearly, was EDA driving things, and then you would sell some IP in some of the regions that have come online, let’s say, in the last 10 years, IP has often been the first decision-making point and then the EDA followed. And in the system world, it’s a little bit of both. But very often when people decide about what architecture they’re going to build, they make big decisions on the building blocks and then they immediately look in the catalog from Synopsys, okay, which building blocks can I have, ready to go or which ones can I get with some modifications. So, I think they’re sort of, in my perspective, two sides of the same coin. When I look at your numbers, it looks like your IP growth so far in this fiscal year has been far above your long-term target, like mid-teens. Well, as you know, so far, we want to hold on to the general directives that we’ve given for the long term. At the same time, there’s no doubt whatsoever that IP was particularly strong this quarter and actually has been strong for quite a while. And so, IP tends to be a little lumpy because you often sell IP over a period of time and then the customers pick it up as they need it, or some of the things that are subject to milestones if they want to have IP that’s modified for their purpose. So, it’s not always as easy to predict as some of the other things that are more time-based. But overall, they reflect very well the new designs, the new chips, but also the new types of chips. And we’re particularly strong already in those interconnectivity blocks that will be used when you put chips in very, very tight proximity, sometimes also refer to as chiplets. And so, that’s a whole new wave of opportunity for us. I know during the quarter, there was a press article about the subpoena -- the administrative subpoena you received probably like last year, by the end of last year. Well, there’s not really an update. We received this, if I’m not mistaken, in November ‘21. And so, typically, you get a number of questions, and then there’s some follow-up on those questions. So, it’s wait and see, but we’re following up, and no issues from our perspective so far. I’m wondering if it is possible to maybe compare the new product cycle we seem to be in at the moment and thinking of DSO.ai fusion verification, hardware, 3DIC? I think when you talk about things like DSO or some of the hardware-software interaction, you’re essentially talking about a new state of the art. And having had the privilege to be here for a long time, I strongly feel that the early days of synthesis felt very similar to what we’re doing right now with AI applied to our own design flows, because it is so revolutionary from a computer science point of view as AI has essentially brought a whole new way to look at problems through the lens of can you recognize patterns versus can you do deductive calculations. And we have already demonstrated literally a month after month new results that are getting better and better, and also broadening the applicability beyond just design but also in verification. And so, I think there’s a long runway with that. And then, you went through a period of time thinking about fiscal ‘19, ‘20 and actually a lot of 2021 where your backlog, it was solid but sequentially stable. And now we’ve had 1 big step up, and actually this quarter is another big sequential step-up. We have always wanted to say that backlog goes up and down because if you do, let’s say, a large transaction over multiple years, you get your backlog to go up, and then it gradually decreases as the revenue is recognized and then it gets renewed. Now, of course, we have many renewals, so it’s not that spiky in aggregate. On the other hand, there’s no question that our business is strong and that we have many growing renewals and are broadening the portfolio of what we offer as a company. It’s even better that the backlog is increasing because of run rate growth, as Aart described. Aart, you cited you all know that there is much that is new in EDA in terms of certainly accelerated growth, new customers, new customer requirements, new products and the like. And so, when we think about, for example, the thing that you started in your comments with AI -- and by the way, there’s a very interesting Synopsys presentation this morning at the ANSYS conference on AI. So, the question with respect to AI is how confident are you that the platform that you have is viable for 5 to 10 years in terms of capacity, performance and meeting the needs of a wider and wider set of device types, so that the kind of walls perhaps at some of the earlier tools eventually ran into, AI doesn’t necessarily run into. For you, Trac, you raised the midpoint of your non-GAAP expense expectation for the year by $95 million. Secondly, I think the AI capabilities that we have right now and that we’re building are actually quite broad in terms of the applicability. And if you add the very fact that on the side here, we have just announced that we also have a SaaS model for cloud, that’s theoretically saying, \"Oh, there’s infinite compute waiting for you if you want to pay the price.\" And I don’t know I want to be light-hearted about this, but the fact is that compute is not a limitation for us right now. I think what will be the challenging part is that all the problems that we’re addressing are highly systemically complex, meaning there are so many different things that play together, and you have to nail every single one of them, otherwise, the system doesn’t work. And that plays absolutely to Synopsys’ strength because we are deep in every area that we touch, and we’ve put a high degree of emphasis now for a number of years for Synopsys to migrate its thinking from scale complexity to systemic complexity. Trepidation on the execution is always there, but I think we’re on a roll here. The second part of what’s driving expenses is what I highlighted earlier, which is an increase in -- with a strong increase in the outlook for the year, it’s also allowing us to accrue more for the variable compensation to reflect the overachievement. On the hiring front, our outlook for the year of 250 basis points improvement in ops margin contemplates our ability to hire and our ability to continue to invest in the business. And when I look at your EDA growth, like 9% kind of full year, more like 11%, last year was 10%. So, I don’t see the same acceleration that you are describing. So, I just want to make sure I’m looking at things apples-to-apples. So, that’s the first question that I have. Well, in all areas, we’re outgrowing our competition. And if you recall, it’s not that many quarters ago that we were referring to IP as in the mid-single-digits growth rate. And today, we’re clearly in the double digit. And part of the explanation I tried to give a little bit earlier is that, in a number of situations, IP is leading as IP is, in many ways, the shortcut of EDA, right, which is you have design that’s already done. And so, the combination of IP and EDA actually works really well together, and one should take them in aggregate. And in aggregate, the Company is essentially predicting for this year what is a 19% to 20% growth. And some of the areas that we have highlighted, such as DSO.ai, but I could have also highlighted SLM or a few other areas that are relatively new, we’re doing really well. And as a result, the comparisons are -- you’re comparing any particular quarter this year relative to the last year, it’s going to stand out and seem unusual. But I would -- if you zoom out and look at the full year, we’re delivering north of 25% EPS growth. It feels like everything you are saying on the call is that there are structural drivers that are accelerating the growth of your business, and yet you’re not taking up the financial model. Where the questions are coming from with regards to changing our multiyear model, we literally just are six months into this, and we updated you all on a raise in the model back in December. It’s premature to be talking about changing our model midyear, while we still have six months left in the business to go. Well, you can see in our disclosures that we are seeing very strong growth in all geographies and across all the product lines. We don’t disclose, obviously, the customer detail, but the growth in -- all these areas are driven by really strong growth across the broad customer base. So, I -- we’re not attributing the change in the model or the outlook for the year to any one area. And so, on that basis, we appreciate your support, and we’ll be talking to you shortly in the one-on-ones."
}