{
    "symbol": "ACHV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 23:06:07",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Achieve Life Science Second Quarter 2022 Earnings Conference Call. Today on the call from Achieve, we have John Bencich, Chief Executive Officer; Dr. Cindy Jacobs, President and Chief Medical Officer; and Jerry Wan, Principal Accounting Officer. Not only did we announce successful efficacy and safety results from our Phase III ORCA-2 trial in April, but we also received grant funding from the NIH, allowing us to proceed with the initiation of the Phase II ORCA-V1 trial in adult users of e-cigarettes. These were 2 major milestones for us to reach in the first half of the year, and we are pleased to continue delivering on our commitments. As you likely have heard or read recently, there is great attention and debate surrounding smoking and nicotine e-cigarettes in the U.S. political arena. Tobacco use continues to be the leading cause of preventable disease and death, resulting in more than 480,000 American lives lost each year. We are in agreement that action must be taken to save lives, to improve the health of smokers and to reverse the increasing youth nicotine addiction trend. And while they may limit access to an increased scrutiny of available products, they do not solve the nicotine addiction problem at hand. With the recent FDA actions on e-cigarette products, including JUUL, we have already seen reports of e-cigarette users considering a move back to combustible cigarettes. If approved by the FDA, cytisinicline would be the first non-nicotine prescription treatment for smoking cessation approved in nearly 2 decades, offering hope to the millions of smokers who want to quit for good. As announced in April, we are one step closer to accomplishing our goal with the first Phase III trial results in hand. The study evaluated both 6- and 12-week treatment duration of cytisinicline, and all participants received standard behavioral support throughout the trial. The ORCA-2 results were overwhelmingly positive, indicating that smokers who received cytisinicline were 6 to 8x more likely to quit smoking compared to smokers who received placebo. The results of ORCA-2 trial will be submitted for journal publication this year, and we look forward to presenting additional data sets from the trial at future medical conferences. Smoking cessation prescription therapies historically have had black-box warnings and high rates of troublesome side effects such as abnormal dreams, insomnia, nausea and vomiting, which increases treatment discontinuation and limits the overall utilization of current products. We think offering a more tolerable product should help maintain strong treatment compliance, leading ultimately to better outcomes for smokers looking to quit. As we look ahead to the next milestone for the smoking cessation program, we continue to anticipate enrollment completion for our second confirmatory Phase III trial to occur by the end of the third quarter this year. We look forward to the next update on ORCA-3, which we expect will be when enrollment has completed in the coming months. In June, we initiated our Phase II ORCA-V1 trial, thanks to the continued funding from the NIH and NIDA, which awarded us the next $2.5 million in grant funding to conduct this trial. ORCA-V1 aims to enroll approximately 150 adult nicotine e-cigarette users in the U.S. and is led by our ORCA-2 PI, Dr. Nancy Rigotti, Professor of Medicine at Harvard Medical School and Director of the Tobacco Research and Treatment Center at Massachusetts General Hospital. Other timing for weekly vaping abstinence will also be assessed as secondary outcomes, for example, between weeks 3 to 6 as well as any reduction in nicotine vaping during the 12-week period. There is great enthusiasm and interest in ORCA-V1, and we are encouraged by what we are seeing thus far in terms of patient recruitment for this trial. While it is believed that noncombustible forms of nicotine present lower health consequences than traditional cigarettes, complete abstinence from nicotine is ultimately the goal for many. In a survey conducted by Achieve of vape and e-cigarette users, approximately 73% of participants stated they intended to quit vaping in the next 3 to 12 months. We believe cytisinicline has great potential to meet the needs of this population, who are ready to quit nicotine for good. I would like to provide an update on our cash position as of June 30, 2022, as well as review our operating expenses for the second quarter. As of June 30, 2022, the companyâ\u0080\u0099s cash, cash equivalents, short-term investments and restricted cash were $29.4 million compared to $43 million as of December 31, 2021. As a reminder, approximately half of the cost from the ORCA-V1 trial are funded through the grant from the NIH. With respect to our statement of operations, net loss decreased to $10.4 million for the quarter ended June 30, 2022, compared to $11.3 million for the same quarter of 2021. Net loss for the 6 months ended June 30, 2022, decreased to $18 million compared to $19.3 million for the same period of 2021. Operating expenses decreased for the quarter ended June 30, 2022, due to lower costs associated with the completion of the ORCA-2 trial. We continue to make tremendous progress with the cytisinicline development program, especially with the announcement of positive Phase III ORCA-2 results and the initiation of both our ORCA-3 and ORCA-V1 trials. With a compelling efficacy and safety profile and a shortened treatment regimen, cytisinicline has the potential to make a strong impact in a market that has lacked innovation and new treatments in over 15 years. The most successful prescription smoking cessation product was CHANTIX, which had peak global sales of $1.1 billion before it was withdrawn in 2021 for safety concerns. There are currently only 2 non-nicotine prescription products available to the 30 million-plus smokers in the U.S., generic CHANTIX and generic Zyban. Despite being tainted with its historical black-box warning and disruptive side effects, generic CHANTIX is anticipated to reach approximately $300 million in U.S. sales over the coming year. We believe that cytisinicline's product profile, including robust efficacy, high tolerability and shorter duration of treatment, has potential to resonate in this underserved market. We look forward to sharing with you our continued progress in the back end of this year, including completion of enrollment in our ORCA-3 and ORCA-V1 studies as well as potential for publication of the ORCA-2 results. At this time, I'd like to turn the call over to the operator and take any questions you might have. Weâ\u0080\u0099re looking at the timing for the NDA, the latter half of next year. As far as additional CMC, Iâ\u0080\u0099ll let John kind of go over that, but thatâ\u0080\u0099s kind of on the same time frame for coming together by the end of next year. I think the clinical pieces are in motion, as Cindy mentioned. Then on the CMC side, we're working with Sopharma, our partner on this, to get the validation batches up and running later this year. On the validation batch side, so what we've been focusing on is really stockpiling product in advance of commercial launch. I think as we get into next year more fully, we'll refine further kind of the batches that will be out there and ready for launch. I will say that there has been continued interest in the program, and we expect that would likely continue as we move the program forward. But going forward with the OpEx here on the R&D side, I was just wondering any comments on what to expect maybe in 2023 or second half of â\u0080\u009822. So as Jerry mentioned on the call, in terms of expenses, we would expect those to be elevated, especially in the third quarter now that we're up and running on both ORCA-3 as well as ORCA-V1. As we get to full enrollment on those and patients start to roll off of study, which will kind of progress into the early parts of 2023, we would expect those R&D expenses to taper off quite significantly. But as Cindy mentioned, we do have a couple of other trials in terms of TQT and renal impairment that will be running in parallel with those trials as well. But just wondering, I think data from ORCA-3 is first half â\u0080\u009823. I think at the moment, we're focused on getting ORCA-3 enrollment complete. I think once we have that in hand, we'll be able to clarify further kind of where that puts us in terms of where we might expect top line results. I think as we move forward, we'll be able to narrow in on the timing of that. And just lastly, you talked about potentially a publication of ORCA-2. So on the medical conference front, I think historically, one of the core forums for us has been SRNT, or the Society for Research on Nicotine and Tobacco. The biggest of those events is the annual U.S. conference, which is typically in kind of late first quarter of the year. So I think we're looking at what makes sense, but I would stay tuned, especially for that annual U.S. conference is the one that we'd be focused on. So we have seen, I would say, global interest. Historically, we've seen, I would say, overweight interest out of Asia, but we also see interest out of Europe as well. But for us, I think the most interesting would be a single global partner as opposed to dividing this up into multiple regions around the globe. So over the last 1.5 months or so, we've really been kind of getting everything up and running. And as we mentioned on the call, we're quite encouraged with what we're seeing so far in terms of interest on the recruitment side. I mean, thatâ\u0080\u0099s a little bit outside of the kind of what youâ\u0080\u0099re looking at. But I think, yes, clearly, if you remove nicotine or lower them considerably, you're probably going to get people either smoking less or smoking them more deeply to get the same nicotine that they're used to getting. So I think either way, this is going to be several years out before any potential disruption. And I think the beauty is at that stage, we'll likely be on the market and be there ready for smokers if the cigarettes that they're used to smoking is disrupted. I think the only thing I would note, so we did mention that it looks like a run rate probably north of $300 million at the moment in terms of where they're at. But I think itâ\u0080\u0099s a good data point out in the market just in terms of continued interest in smoking cessation products overall, including as we move forward to market here in the next couple of years. So on the vaping trial, we've got 4 out of 5 of the sites that are fully activated at this point. And I think of -- just a reminder, we've got Nancy Rigotti from Harvard Mass General as the PI. And then we basically looked for 4 other sites that were high-quality, high performers on our previous studies as well. But I think at the moment, we've been guiding likely the first half of next year. Obviously, a big range will be triggered off of enrollment, but first half of next year for top line results. Yes, I mean, there is continued interest for cytisinicline around the globe. I think we are aware of some other smaller trials being run across Europe as well as thinking to Asia or Mongolia, some work being done. None of it is really as, I think, analogous to what we put together here in the U.S. But I think as some of those come out of their interesting data points, then we'll be sure to share that with everyone. Iâ\u0080\u0099m just thinking of the timing of it to have even late breakers at SRNT, but if you could let us know on those would be great. So I think barring any major disruptions, we would anticipate having some data sets at the annual U.S. SRNT conference in the spring of next year. Between now and then, we've been focused on working with the investigators on ORCA-2, including Dr. Rigotti on getting the ORCA-2 results published, and we're going to focus that on high-quality journals. If someone's going to crack a way to make this synthetically, we want it to be us so we can protect that administration, that way of producing it. So our focus here in real time has been more on stockpile, as I mentioned earlier, getting 3 to 4 years of launch material in hand at the time of commercial launch. Early days on that, but we think having another growing cycle in the Southern Hemisphere would make sense. I mean, I think not just post ORCA-2 data, but I think overall, historically, we have seen continued interest around cytisinicline. I think as I mentioned earlier, historically, it's probably been overweight to Asia. I think in terms of appetite, I think until these things move ahead to the point where we start to get into contracting and things like that, itâ\u0080\u0099s a bit hard to predict outcomes. But I do think as we move forward, the closer we get to commercializing this, the more and more interest that it will be on the program. Thanks, operator, and thanks, everyone, for joining us today and for your continued interest in the company. We look forward to sharing additional information with you in a couple of months, and thanks again for joining us."
}