{
    "symbol": "ACHV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 21:33:05",
    "content": " Today from Achieve, we have John Bencich, Chief Executive Officer; Dr. Cindy Jacobs, President and Chief Medical Officer; and Jerry Wan, Principal Accounting Officer. Thank you, Nicole and thanks everyone for joining us today. In 2022, we achieved significant milestones that were crucial to advancing cytisinicline and to meeting our key objectives for the year. We are proud to have executed successfully on numerous critical activities, including the completion of our first Phase 3 trial for smoking cessation, which yielded highly positive efficacy and safety results. We secured grant funding to initiate our first vaping cessation trial, which exceeded our expectations in completing enrollment early due to the great enthusiasm at the sites and with study participants who wanted to quit vaping. We also strengthened our intellectual property position, concluding the year with a total of 15 granted patents and 46 pending patents, including expirations extending out until 2042. Along with our partner, Sopharma, we completed the build-out of a new API facility, expanding our global manufacturing capacity to meet expected commercial requirements. In 2002, we also engaged in numerous productive strategic discussions with potential partners. With that, our focus turns to the upcoming milestones and priorities for 2023. Next quarter, we will have two trials reporting top line results, first, ORCA-V1, our Phase 2 trial for nicotine vaping cessation, followed by ORCA-3, our second Phase 3 trial for smoking cessation. Beginning with ORCA-V1, in approximately 4 months of initiating enrollment, ORCA-V1 had randomized 160 adult users of nicotine e-cigarettes across 5 clinical trial sites, partially funded through grant support from NIDA and NIH, ORCA-V1 aims to explore this population for two reasons. First, we believe that cytisinicline will be as effective in vaping cessation as it is in smoking cessation given its mechanism of action on the nicotine receptors in the brain; and second, there is a significant and growing unmet need in this area. We believe this effect will be applicable to other modalities of nicotine administration more broadly, including vaping. Additionally, we have demonstrated that cytisinicline has a very well-tolerated side effect profile, which may be particularly important for treating â\u0080\u0093 treatment compliance and ultimately successful outcomes. According to data released by the CDC in November 2022, approximately 2.5 million high school and middle school students in the U.S. were using e-cigarettes. Our vaping study, ORCA-V1, focuses on adult users of e-cigarettes, of which there are an estimated 9 million in the U.S. alone. While we are not currently seeking a pediatric indication, it may be a potential consideration for future research, presenting another opportunity for cytisinicline to make a significant impact on public health. This study population is clearly a younger one, and we will learn a lot from the results of this trial. Similar to the smoking cessation trials, the primary endpoint is biochemically verified continuous abstinence during the last 4 weeks of treatment. However, in these trials, the biochemical verification is based on systemic cotinine levels, which is a metabolite of nicotine. As previously stated, we are on track to report top line results in the second quarter. Also expected next quarter, our results from our second Phase 3 trial of cytisinicline for smoking cessation. ORCA-3 mirrors our previous Phase 3 ORCA-2 study in evaluating efficacy, safety and tolerability of 3 milligrams cytisinicline dosed 3 times daily for either 6 or 12 weeks compared with placebo. Identical to ORCA-2, the primary endpoint is biochemically verified continuous abstinence during the last 4 weeks of treatment. Each treatment arm will be compared independently to the placebo arm, and the trial will be determined to be successful if either or both of the cytisinicline treatment arms show a statistical benefit compared to placebo. Similar to ORCA-2, ORCA-3 was designed with approximately 95% power to be able to demonstrate a continued abstinence benefit compared to placebo at the long-term follow-up comparison at 24 weeks. The ORCA-3 trial aims to replicate the positive results observed in the ORCA-2 trial, which continue to be well received and have been submitted for publication. Earlier this month, additional analyses from ORCA-2 were presented by Dr. Nancy Rigotti at the Society for Research on Nicotine and Tobacco Annual Meeting. The abstinence benefit was observed in subgroups of smokers who received cytisinicline regardless of age, gender, smoking history, previous quit attempts or prior treatments. However, these data continue to affirm our belief in the potential of both 6 and 12-week dosing of cytisinicline for a wide demographic of smokers who are at various stages of their quit journey. Moving beyond the highly anticipated trial readouts, our team is also fully engaged in preparations for New Drug Application, or NDA, filing in the U.S. To lead and organize this process, we have recently hired a full-time regulatory team member who possesses significant experience with NDA filings. With a robust amount of data in hand, particularly non-clinical, we are beginning to draft select sections of the NDA while we await final clinical data. As of December 31, 2022, the companyâ\u0080\u0099s cash, cash equivalents, short-term investments and restricted cash were $24.8 million as compared to $18.2 million as of September 30, 2022. The increase in cash over the prior period was due to our private placement, which closed in November 2022, providing incremental net proceeds of approximately $17.9 million. As stated at the time of the financing, we continue to believe our current cash balance is sufficient to provide runway into late 2023. The company incurred a net loss of $11.2 million for the quarter ended December 31, 2022, as compared to a net loss of $7.2 million for the same quarter of 2021. Operating expenses increased for the quarter ended December 31, 2022, as we fully enrolled in both the ORCA-2 Phase 3 trial and the ORCA-V1 Phase 2 trial. As a reminder, approximately half of the cost from the ORCA-V1 trial are expected to be funded through a grant from the NIH. To wrap up, we made great strides in advancing cytisinicline in 2022. We will maintain focus on delivering top line results from two important trials during the second quarter of this year, continuing our preparations for the NDA and furthering partnering discussions once data is in hand. Like many of you, we have faith in the potential of our product to make a significant impact in the lives of smokers who are struggling with nicotine dependence and searching for alternative solutions. The impact of smoking affects millions each year resulting in over 400,000 deaths in the U.S. alone. Approval of cytisinicline would introduce the first new treatment option in nearly 20 years, with the potential to positively transform the lives of millions. Thank you for joining us today, and weâ\u0080\u0099d now like to open the line for questions. Your line is now live. So as we outlined on the call today, weâ\u0080\u0099re looking at both ORCA-V1 and ORCA-3 results here in the second quarter. And as weâ\u0080\u0099ve guided, ORCA-V1 is going to be the first that comes online, and thatâ\u0080\u0099s likely first half of the second quarter if weâ\u0080\u0099re going to parse things out and then ORCA-3 coming in the second half of Q2. But right now, weâ\u0080\u0099re looking at first half of 2024 for NDA submission. And then with respect to the debt you have coming due in December and particularly in light of everything thatâ\u0080\u0099s happened over the last week or so with SVB, any thoughts on your ability to maybe move that out to the â\u0080\u0093 I think, the contract or the agreement allows for that to be bumped out years, if Iâ\u0080\u0099m not mistaken. But what we know as of today is that all of our deposits, first and foremost, are 100% backstopped by the Fed and the FDIC, which is a great result over the weekend. As you rightly call out, we do have the ability to extend the maturity by 1-year based on discussions with the bank and internal approvals, but thatâ\u0080\u0099s something they have been open to, and I think we will continue those dialogues. And from everything weâ\u0080\u0099re hearing, including early this week, the bank continues to operate as it did before the disruptions over the weekend. So we havenâ\u0080\u0099t seen any interruptions in terms of our ability to access our cash and everything weâ\u0080\u0099re hearing is that on the credit side of the bank, everything is proceeding as well. So, that work will continue, but we are encouraged by what we are seeing there, and we will continue to work with them to make sure that they are ready for an FDA inspection down the road. Your line is now live. Question for you guys and Cindy, if you are available, since 2018, you have had an agreement with the FDA on cytisinicline pediatric study plan. Since obviously, vaping has become more important as you have ORCA-V1 results coming up next quarter. If we get positive data with our V1 and we move forward with that as a possible additional indication I am sure that, that will have follow-on discussion, but not for smoking cessation at this time. I was just going to say just with respect to generic sales, as I think we have been updating folks over the course of 2022, we did see Endoâ\u0080\u0099s year-end earnings results and they had over $300 million of generic Chantix sales for year-end 2022. So, I think it continues to demonstrate just how robust this market remains, and thatâ\u0080\u0099s with virtually no sales and marketing expenses that they are deploying there, just a pure substitution play. So, I think overall, we are encouraged from what we are seeing on the generic side. I think our inclination is that when Pfizer was having issues with the manufacturing and carcinogen problem with Chantix, there was a number of docs that just frankly stopped writing. Your line is now live. So, I mean just to remind everyone, the mechanism for cytisinicline is specific to the nicotine receptors in the brain. So, we do believe there should be broad applicability across smoking, vaping, chewing tobacco, snus, kind of any form of nicotine addiction. I think when we look at e-cigarettes in particular, I think it is difficult to triangulate exactly whether we should expect lower or higher odds ratios there. So, I think any activity here is going to be positively received. And I think for over an odds ratio of two, which is what we see with existing smoking cessation products, is kind of the minimum entry point. So, our belief has always been that this product is best suited in the hands of a pharma or a large biotech group that already has an existing primary care footprint in place. And I think thatâ\u0080\u0099s something that we have been in discussions with potential partners, and that will continue with data. And there is, I think as you are alluding to, quite a bit of efficiency at the top three deciles. So, if we look at kind of this category overall, 30%, at least looking at historical Chantix scripts, were being written by about 7% of the physicians in this category or about 11,000. But at the end of the day, we think this is best suited in the hands of a large pharma. So, thanks everyone for joining us today."
}