{
    "symbol": "ACHV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 20:08:06",
    "content": " As John mentioned, we are pleased to report clinically robust and statistically significant results for both primary and secondary endpoints for 6 weeks and 12 weeks of cytisinicline treatment compared to placebo in this trial. Study participants were randomized to 1 of 3 arms, and received either 6 weeks cytisinicline followed by 6 weeks of placebo or 12 weeks of cytisinicline or 12 weeks of placebo. After 12 weeks of cytisinicline, 32.6% of smokers had quit smoking compared to only 7% of smokers treated with placebo. This resulted in an odds ratio of 6.3 with a p-value less than 0.0001, meaning of smokers treated with cytisinicline had 6x the odds or likelihood of quitting smoking compared to smokers treated with placebo, and it was highly statistically significant. For the secondary endpoint at 24 weeks, 21.1% treated with 12 weeks of cytisinicline were nonsmokers compared to only 4.8% treated with placebo. This gave an odds ratio of 5.3 for remaining a nonsmoker at 24 weeks after 12-week cytisinicline treatment, and also had a p-value of less than 0.0001. After 6 weeks of cytisinicline, 25.3% of smokers had quit smoking compared to only 4.4% of smokers treated with placebo. For the secondary endpoint at 24 weeks, 8.9% treated with 6 weeks of cytisinicline remained nonsmokers compared to only 2.6% treated with placebo. Efficacy for both the 6- and 12-week treatment arms of ORCA-2 exceeded what was previously reported for cytisinicline, proving our hypothesis that the higher 3-milligram dose given for a longer duration has improved outcomes for smokers. As the ORCA-2 showed if a smoker was very motivated and quit smoking by 3 weeks and continued nonsmoking to 6 weeks, and they didn't want to take any more treatment, that would be then the 6-week treatment. But for those individuals that stop smoking within 2 to 3 weeks, it's not that they have to continue for another 9 to 10 weeks of treatment because what the data will show is that there was no risk of relapse in those individuals if they switched to placebo or they stayed on cytisinicline."
}