{
    "symbol": "VSTO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-28 14:17:02",
    "content": " These include our strong quarter one earnings performance, our planned acquisitions of Fox Racing and Simms Fishing, trends we are seeing across the marketplace and our businesses, strong growth from product innovations and lastly, an update on our planned separation. In Q1, we posted our second best sales record ever of $803 million, up 21% over the prior year, driven by continued shifts in outdoor lifestyles and recreation, the strength of our brand portfolio, new product innovation and execution excellence. We believe this reflects two dynamics; first, they're selling to higher end more affluent consumers less affected by inflation; and second, they're participating in higher growth categories, which is a key reason we acquired these businesses as well as our planned acquisitions of Fox Racing and Simms Fishing. As Chris mentioned, sporting products set a record in the fiscal first quarter, delivering $511 million in revenue, which is a 40% increase from the prior year. Q1 EPS increased 33% to $2.31, driven by strong sales growth, profitability expansion, a slightly lower tax rate and a roughly 2.5% decline in outstanding shares, which was minimally offset by higher interest expense. EBITDA declined to $39 million, reflecting 13.5% margin, primarily driven by higher SG&N expense related to acquisitions higher supply chain costs and lower operating leverage in our legacy businesses due to lower sales. For the full fiscal year, we expect sales to increase to $3.2 billion to $3.325 billion, up 7% year over year at the midpoint; sporting product sales in the range of $1.725 billion to $1.775 billion and outdoor product sales in the range of $1.475 billion to $1.55 billion; adjusted EBITDA margin between 21% to 21.5%; adjusted EPS between $7.05 and $7.65; and free cash flow generation between $310 million to $360 million. We expect sales for outdoor products in Q2 to be in line with first quarter sales decline with growth weighted toward the second half of fiscal year â\u0080\u009823, reflecting the inventory loading in which benefited both Q1 and Q2 last year. So it's a similar math or as you see our base business, you will see contraction in gross margin from Q1 onwards, mainly in ammunition business, efficiency, higher labor costs and then outdoor product business, the continued higher supply chain cost, product cost and also reduced operating leverage, because sales is not growing as much as we ."
}