{
    "symbol": "INGR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 13:40:02",
    "content": " We finished the year strong, delivering record top line performance for the fourth quarter, with sales growing 13% and adjusted operating income increasing 49% or up 57% on a constant currency basis. Turning to our full year net sales bridge, 15% net sales growth has been driven by $1.3 billion of not only price pass-through but also improvements to our customer and product mix. North America operating income was $565 million, up 16% versus the prior year, driven by favorable price mix and expanded raw material risk management. South America operating income was $169 million, up 22%, which increases predominantly driven by favorable price mix, partially offset by higher corn and input costs. Asia Pacific operating income was $93 million, up 7% versus prior year, with favorable price mix that was partially offset by foreign exchange impacts and higher input costs, notably in Korea. EMEA operating income was $110 million for the full year, up 4% compared to the prior year due to favorability in Europe, which was partially offset by macroeconomic challenges in Pakistan and foreign exchange impacts across the region. As we've guided for the year, we believe our net sales will be up mid-double digits again this year in comparison to last year with the majority of that increase coming from price mix, and that reflects the continued pass-through of inflation, again, as well as what I referenced earlier, the effective customer and product mix management. I think we really expect high single to low double-digit OI growth just for the full year, barring kind of any significant changes in the layout of our raw material costs, primarily outside of the U.S.\n And as it relates to customer and product mix management, specifically the conditions, as I referenced in the market over these last 2 years has allowed us to work with those customers that we believe are going to be the best strategic partners for us longer term."
}