{
    "symbol": "GCI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:35:30",
    "content": " In lockstep with the increase in our digital-only subscribers, our digital marketing solutions business has experienced year-over-year core revenue and core client growth of 14% and 13%, respectively, as well as we've seen now four consecutive quarters of double-digit adjusted EBITDA margins. Evidence of this is the growing success we have with our digital initiatives and our digital revenues, which were $251 million in the first quarter, growing 9.7% and equaling a third - over a third of our total revenues. As I mentioned earlier, our digital marketing solution business experienced year-over-year core revenue and core client growth of 14% and 13% in the first quarter, respectively. For Q1, total operating revenues were $748.1 million, a decrease of 3.7% as compared to the prior year quarter. And in Q1 2022, digital revenues were $251.1 million and represented over 1/3 of total revenues, increasing 9.7% on a same-store basis year-over-year. Adjusted EBITDA totaled $64.2 million in the quarter, down $36.3 million or 36.1% year-over-year, but above our Q1 guidance range of $55 million to $60 million. The Publishing segment revenue in the first quarter was $670.4 million, a decrease of 4.2% as compared to the prior year and down 2.9% on a same-store basis. As we mentioned earlier, the Q1 margin reflects cost pressures we are experiencing in a number of key categories, including postage, contract labor as well as higher newsprint prices which were up 37% in the first quarter as compared to the prior year, all of which equates to approximately $15 million negative impact to adjusted EBITDA on top of the investments made in content and marketing to support growth in our key pillars. For the digital marketing solutions segment, total revenue in the first quarter was $109.7 million, an increase of 8.2% year-over-year on a same-store basis. Adjusted EBITDA for the digital marketing solutions segment totaled $11.2 million, representing a strong margin of 10.2% in the first quarter and the fourth consecutive quarter of double-digit margins. Looking at the full year, we are reiterating our prior guidance as described in today's earnings release with respect to same-store total revenues, net income and loss attributable to Gannett, net cash flow provided by operating activities, free cash flow, adjusted EBITDA and ending digital-only subscribers."
}