{
    "symbol": "LPG",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-01 16:18:05",
    "content": " Additionally, a live audio webcast of todayâ\u0080\u0099s conference call is available on Dorian LPGâ\u0080\u0099s website, which is www.dorianlpg.com. Good morning, everyone, and thank you all for joining us for our third quarter 2023 results conference call. With me today are John Hadjipateras, Chairman, President and CEO of Dorian LPG Limited; and Tim Hansen, Chief Commercial Officer. Should one or more of these risks or uncertainties materialize or should underlying assumptions or estimates prove to be incorrect, actual results may vary materially from those we express today. Additionally, let me refer you to our unaudited results for the period ended December 31, 2022 that were filed this morning on Form 10-Q. In addition, please refer to our filings on Form 10-K, where youâ\u0080\u0099ll find risk factors that could cause actual result results to differ materially from those forward-looking statements. Good morning and thank you for joining Ted, Tim, and me to discuss our third quarter financial year 2023 results. That was much interesting information which I think, you will â\u0080\u0093 may want to note and take, and we will follow with. After me, Tim will present and then â\u0080\u0093 ultimately, Ted will present and then Tim, including the $1 irregular dividend announced today, we will have returned over $500 million to shareholders since our IPO. Our board has focused on returns to shareholders, while remaining commercial â\u0080\u0093 retaining commercial flexibility and ensuring a strong balance sheet. For the quarter our EBITDA was $76.2 million, and net income was $51.3 million. Ted will give you details and, of course, answer any questions you may have on our quarterâ\u0080\u0099s financial results. Global exports increased 4% this past quarter, and up 6% for the year with support primarily from North America. U.S. exports increased 6% or 700,000 metric tons from the third calendar quarter supported by favorable arbitrage economics, which persist today. 2022 U.S. volumes were up 3%, an increase of 1.3 million tons from 2021. Middle East export volumes showed continued growth, despite maintenance in some terminals in the beginning of December. Annual volumes out of the region are up 18%, increasing by 6.4 million tons from 35.9 million tons in 2021 to 42.3 in 2022 driven by reversals to OPEC+ production cuts. On the shore side, Dorianâ\u0080\u0099s operation, we continue to work hard to ensure the well being of our crew, especially our Ukrainian and Russian seafarers and their families. On the performance side, we have been very focused on our strategy to comply with the 2023 IMO emission regulations, the EEXI and CII. And its January short-term outlook report, the EIA said it now estimates are U.S. LPG exports will grow 15.9% in 2023 year-over-year. The U.S. is now producing well over 100 million tons of LPG a year, with 2022 numbers coming in at about 106 million tons. My comments today will focus on the recent capital allocation events, our financial position liquidity and our unaudited third quarter results. At December 31, 2022, we reported $129.8 million of cash, which was net of the $40 million dividend payment made at the beginning of the month. Of January 30, 2023, we have roughly $165 million in cash, with the increase from December 31, reflecting the January distribution from the Helios pool. Also, as John mentioned, we will pay another $1 per share, which is an irregular dividend or roughly $40.3 million in total of dividends on or about February 28, 2023 to shareholders of record as of February 15, 2023. Once paid at the end of February, Dorian will have paid over $300 million in dividends and repurchased nearly $229 million in stock, representing 18.8 million shares, which together totals nearly $530 million in capital returned to our investors since our IPO in 2014. Our Board continues to take a pragmatic quarter-by-quarter review of the companyâ\u0080\u0099s performance, the LPG chartering market environment and other macroeconomic and industry factor to determine whether to pay, and if so, how much in dividends. With a debt balance at quarter end of $635.6 million, our debt to total capitalization stood at 43.2%, and our net debt to total cap is of course even lower given our large cash balance. Moving into this calendar year, we will take delivery of our dual-fuel new building from Kawasaki at the end of March, as well as 3 long-term time chartered-in dual-fuel ships, representing nearly 20% growth in our commercially managed fleet. With these additional vessels, our cash cost per day will increase to $24,000 to $25,000 a day, but I would also note that these vessels offer higher earnings potential given their size, fuel efficiency and dual-fuel optionality. For the discussion of our third quarter results, you may also find it useful to refer to the investor highlight slides posted this morning on our website. Turning to our third quarter chartering results, we achieved a total utilization of 97.8% for the quarter with a daily TCE per operating day as those terms are defined in our filings of $52,768 yielding a utilization adjusted TCE of about $51,630, that again is TCE per available day. Spot TCE per available day, which reflects our portion of the net profits of the Helios pool for the quarter was about $52,583. Also, the overall Helios pool reported the spot TCE including COAs of approximately $57,000 per available day for the quarter. As many investors and analysts look to model the business, we would note that a 2-month lag Baltic is more in line with the actual cycle of the business. Our team books voyage is about 30 days out and the average load to discharge voyage â\u0080\u0093 i.e., 1-way voyage is about 30 days. Our daily OpEx for the quarter was $9,739, which is up marginally from the quarter ended September 30, 2022. The crew costs, which include crew travel, appear to have found a new normal as crew cost per day has been relatively stable over the last 3 quarters, and spares and stores were actually down sequentially. Total G&A for the quarter was $6.9 million and cash G&A, thatâ\u0080\u0099s G&A excluding non-cash compensation expense was $5.9 million. Included in the $5.9 million is approximately $200,000 that we spent to provide accommodation and food to the families of our seafarers affected by the war in Ukraine. We also recognized about $250,000 of performance-based bonuses for some employees in the quarter. Thus, our core G&A for the quarter was about $5.5 million, which is consistent with our expectations. Our reported adjusted EBITDA for the quarter was $76.2 million, up sharply from the prior quarterâ\u0080\u0099s $46.2 million. On that basis, total cash interest expense for the quarter was $6.6 million. Our hedges saved us $1.4 million in cash interest this period, and we recently extended our existing hedge profile to ensure that the 2022 debt facility is 80% hedged and towards maturity in 2029. Although, we currently hold an 87.5% economic interest in Helios, we do not consolidate its P&L or balance sheet accounts, which has the effect of understating our cash and working capital. Thus, we believe itâ\u0080\u0099s useful to provide some additional data in order to give a more complete picture. As of Monday, January 30, 2023, the Helios Pool held $20.5 million of cash on hand. In addition, as John noted, weâ\u0080\u0099ve committed to 3 additional scrubbers. The balance is market outlook, operating and capital needs of the business and appropriate level of risk tolerance given the volatility in shipping. With a continuing solid freight market backdrop, we remain cautiously optimistic about our cash flow generation over the coming months. The October to December 2022 call for increased LPG export as well as import demand, which translated into a current freight market. The quarter is often characterized by seasonality as Asian importers tend to stockpiled for the winter, and 2022 was no exception. North American exports set a record for exports for the quarter, while South Korea and Japan posted a strong import level also held by demand for LPGâ\u0080\u0099s piling to navigate the cold winter. The East of Suez market saw the BLPG1, which is a benchmark for   continually offers strength from the quarter prior, despite a free flow during the golden week holidays in the Far East. Meantime, market players also had to plan with long lead times, because the west market was seen fixing in those 5 to 6 weeks in advance of the low delay hands . On the 21st of November, we saw record high BLPG1 posted at $148 per metric tons. December was relatively quiet, as the seasonal back rotation in the markets impacted the product market, and a significant downward correction was seen in the second half of December. The rest of Suez market likewise saw a rising market during October and November, with a downward correction in December. The rest of Suez market was also impacted by delays at discharge, but also had to contend with increasing delays for transiting the Panama Canal. The Western Suez market did not climb at the same pace as Suez market, partly due to the fact that ship ownersâ\u0080\u0099 being enticed to lock in firm earnings and longer voyages, which increased the competition for cargoes known to be destined for the Far East discharge ranges. By September, a weakening in arbitrage, as you can see on investor deck online, due to the forward delivery prices of product in the Far East, the activity levels in the last few trading days of calendar 2022, this resulted in a significant freight market reductions. Whereas in the summer, the balance shipping market demonstrated that the VLGC market could weather seasonal summer doldrums, the early into demonstrated how strong the market will rise when shipping demand increased. This remain, however, market players attempting to understand the impact of the new COVID-19 normal in China, and whether world recession is looming in the horizon. Also, thereâ\u0080\u0099s reasonable optimism of increasing demand for LPG in China, once a hard landing of sudden opening is handled with more PDH to recover on stream and the industry operating on more stable basis. As I said in the beginning, I think, weâ\u0080\u0099ll have the remarks briefly that John Lycouris had prepared briefly read now, and then weâ\u0080\u0099ll go back for questions. Starting with our scrubbers, fuel spreads for calendar fourth quarter2022, our third quarter 2023 widened between LSFO and HFO benefiting our scrubber vessels with improved wage economics averaging about $5,831 per day net of our scrubber OpEx costs. In addition, scrubbers reduced not only stocks, but also significantly reduced Particulate Matter and Black Carbon, and we feel are necessary precursor for putting future Carbon Capture systems on our vessels. Pivoting to our ESG strategy, our immediate focus is on our fleetâ\u0080\u0099s IMO mandated EEXI and CII rating, which will come into effect in stages in 2023. Weâ\u0080\u0099ve also implemented real-time data monitoring, as we mentioned before with sensors that track performance and optimize onboard operations and voyage completion. In addition, we have contracted 3 additional scrubbers, which will be installed in the next 2 quarters for 3 of our vessels which have upcoming drydocks. Weâ\u0080\u0099re continuing to improve our energy efficiency onboard our vessels with a focus in vessel performance and emissions improvement, and weâ\u0080\u0099re continuing to study technological innovations and advances as they mature and implementing them as soon as we can. Itâ\u0080\u0099s a nice solid quarter, obviously, and it looks like more is on the way here, especially given what weâ\u0080\u0099ve seen in the spot market here in the past week or so. I would say the dollar dividend you declared, I think, clearly youâ\u0080\u0099re conditioning us to â\u0080\u0093 or I think, Iâ\u0080\u0099m being conditioned to expect these payments. And you mentioned in your opening remarks, the Board takes a more pragmatic approach to the payout each quarter. And our â\u0080\u0093 the way we think about the dividends are as part of a whole, which includes â\u0080\u0093 it has included in the past buybacks, and now they could include them again; dividends, obviously, and reserves for a rainy day and for investment, including renewal. So up until now, as you know, weâ\u0080\u0099ve invested only in one new ship, we feel that weâ\u0080\u0099re covered with the 3 double fuel ships that weâ\u0080\u0099ve chartered in, plus the new building that weâ\u0080\u0099re taking in for ourselves. Weâ\u0080\u0099re investing a little more in the scrubber because we feel that, that has given us good returns and we think the prospects are good. And, I think, we should say that they are equal weight in â\u0080\u0093 thatâ\u0080\u0099s how we view them, equal weight within every quarterâ\u0080\u0099s capital decision allocation, which is kind of long-term and medium-term. Just out of curiosity, you mentioned that those will carry a cost thatâ\u0080\u0099s about two-thirds of the initial program a few years ago. I think, generally, people have just assumed that it would be more costly today. I think the production really, because youâ\u0080\u0099re right, it should be more expensive. But if you compare it to the first time we put scrubbers on board, which was in our initial 2 new buildings, itâ\u0080\u0099s not only a third â\u0080\u0093 itâ\u0080\u0099s probably a third of the cost, not just a third offer. I mean, I think the other thing if there was some costs when we initially did the first retrofit, so basically Iâ\u0080\u0099m not a technical guy, but like high tech MRIs of the structure to see exactly where to put stuff. So itâ\u0080\u0099s all the learning curve, I think like John said. What do you think in terms of timing, it sounds like, I think, Theodore had mentioned in the second and third quarters, you expect to complete them. Weâ\u0080\u0099ve modeled for the time being 30 days, thatâ\u0080\u0099s what itâ\u0080\u0099s worked out to historically. Weâ\u0080\u0099ve done a little bit better than that sort of 27, 28 days, but weâ\u0080\u0099ve assumed 30 for our internal modeling purposes. It would, except itâ\u0080\u0099s worth remembering, Omar, that when we normally do our special surveys, we actually are only in dock for 15 days. And maybe, Tim, just whatâ\u0080\u0099s been going on, I guess, with the spot market here recently kind of came into the year a bit softer kind of a little lower looks like the first couple of weeks and then here a bit of the past week or so weâ\u0080\u0099ve seen a big jump. Yeah, I think, itâ\u0080\u0099s a combination of things that probably at the end of December we came from a very high point, and as we closed in on Christmas and the arbitrage closed in a little bit. Then you had kind of two weeks of quietness before people got back in the seat and in that time, itâ\u0080\u0099s really that you can say the broker setting the politics that kind of dictates the market without any much action. But also at the same time, as we came back, we normally see the quiet of the Chinese New Year, but this year, due to the cold spells suddenly hitting Asia, we actually saw the Chinese coming back during the Chinese holidays, which normally they take a week or so to before they get back in their seats. So the demand really picked up due to the cold spells in Asia, and we saw them   even during the holidays, which we normally donâ\u0080\u0099t see. So, of course, that demand open the up and kickback the action in the market. And, actually, when we then saw that there was actually not a length in the shipping market, which became apparent quite quickly. But as there was no demand, the previous week or activity at least and then that kind of make the market dropped quite quickly, and then it rebounded actually to probably where it should have beenâ\u0080¦\n Got it. How do you sort of think about the current order book, one in five, I guess, versus the existing fleet, and thatâ\u0080\u0099s the delivery schedule in 2023 versus kind of some of the petchem build out in Asia and sort of the ability of the market to sort of absorb that new tonnage. Weâ\u0080\u0099re generally, I think, a little bit more optimistic than some other people. So, of course, one thing that you canâ\u0080\u0099t hide is, obviously, is evident to everybody is at 46 ships or so delivering in this year. But, what we think, we believe, weâ\u0080\u0099ll balance this out to see the additional production, especially from the U.S, which have surprised quite a lot on the upside. So when we model that we see kind of around 20 ships absorbed due to that increase of volume at least, and thatâ\u0080\u0099s without any inefficiency. And then as we mentioned a few times if the Panama Canal delays, we do see them increasing. But, again, even though that is that is kind of easing off, you are going to have a significant amount of LNG carriers built for the next year or delivering in the next year. And we also are going to see more Panamax container ships are delivering, and the new regulations in the Panama also allowing larger container ships actually to go through as they do not have to check the trucks into the box anymore. And then, we have â\u0080\u0093 as Theodore mentioned earlier, the regulations on the EEXI and CII, which will have an impact on the shipping fleet as the SEC normally goes very close to full speed, where you see the tanker markets and the dry markets previously has not been running on full steam. I mean, you have about 260 new Panamax container ships on order and about 250 LNG new Panamax ships on order. So this will â\u0080\u0093 not all of them will naturally use the canal, but there is more ships going in that way. And, I think, the LNG from the U.S. eventually even though youâ\u0080\u0099ve seen it lately due to the war going into Europe. And we have also seen LPG carriers probably being the hard ahead of those, because we are excluded from booking ahead, where other liners and LNG carriers that can speculatively booked slots a year ahead. So, I see this increase continue, and also the Panama Canal authorities have increased the cost of the LPG carriers passing. I guess the LPG carriers is the smallest ship that can pass the canal â\u0080\u0093 that canâ\u0080\u0099t pass the old canal, and ask giving the least revenue. So we see significant increases of the actual transit cost plus people is most of the time having to bid for the auctions, which goes everything from $100,000 to $2 million on the auction fee. And that configuration has gone due to the delays and due to the uncertainties and the auction fees, of course, which also you donâ\u0080\u0099t know what will be. And then, if I could just squeeze in one more on this, I think, Ted in the prepared remarks said that the Baltic rate reflects Ras Tanura-Chiba route. And if Iâ\u0080\u0099m hearing correctly, itâ\u0080\u0099s almost something like he doesnâ\u0080\u0099t view that as maybe as central important route relative to the actual rates that you guys are seeing at your charter desks. Because itâ\u0080\u0099s not just AG East, obviously, itâ\u0080\u0099s a western route. And even the West is both AG, and then U.S. Gulf East, but also U.S. Gulf to the continent and other short-term. But first, I want to Ted to address the reason why he said the lag and the 100%, because when you â\u0080\u0093 I noticed that most analysts now use a 1-month lag on the VLGC rate on the AG rate. But, I think, Iâ\u0080\u0099d like Ted to have to explain to you why we think the 1-month lag will not reflect the actual earnings, because the lag in the receipt of freight is at least 2 months. Our guys are booking now here at the beginning of February, for voyages that wonâ\u0080\u0099t complete until at the earliest sort of April, and maybe even further out. And so, as a result, when youâ\u0080\u0099re trying to do undertake a modeling exercise, and given how the loaded â\u0080\u0093 sorry, the revenue recognition accounting works, you really tend to find that, there are 2-month lagged average is going to be a lot better. Tim will give you more on the specific trade lines and thereâ\u0080\u0099s some â\u0080\u0093 the rates behave differently there, particularly weâ\u0080\u0099ve seen U.S. Gulf to Northwest Europe be a sweet spot, but Tim will comment on that. But itâ\u0080\u0099s really just simply a better â\u0080\u0093 look, if thereâ\u0080\u0099s no perfect way to do this, we acknowledge that we wanted to give a little guidance to the investment community about how to maybe narrow or make it somewhat more accurate. We booked somewhere around 9 to 10 voyages a month, so 20 some odd working days in any given month. So it becomes quite tricky to strike broad averages, but we at least feel that looking at it 2-month lag is going to give you a better indication of what we expect to see in for quarter or what you can expect to see when we deliver quarterly results. But as Ted mentioned, thereâ\u0080\u0099s basically three routes, so the Ras Tanura-Chiba, or East of Middle East to Far East; and then thereâ\u0080\u0099s a route U.S. Gulf to the Far East and U.S. Gulf to Europe. But you can say, our trading is probably 80% out of the U.S. and 20% out of the AG. So you can say it will have a bigger impact fixing on U.S. to the East, and then the AG to the East, or U.S. to the West. So that route is really the most significant route I would say to match it up and, of course, people will change from one patient to the other. One of the routes is paying far less than the other ones, but itâ\u0080\u0099s a matter of like, how do you deploy your ships, and which cargo do you for and where do you come open. So what I would kind of watch out for that as well to kind of judge your readings and they are like said on the AG East, the index route doesnâ\u0080\u0099t take into account kind of our waiting and it doesnâ\u0080\u0099t take into account, I think time as well auction fees for the Panama Canal. And then you have like a premium market has been U.S. to the West, where thatâ\u0080\u0099s a difficult market to operate in, because you are open quite close to the low posts. And as I mentioned before, sometimes the fixtures are 5 to 6 weeks ahead, when we fix the ship, so youâ\u0080\u0099re hardly opening the AG, when you are opening the Far East story when you fix the ships, let alone open 14 days on the low port. So if you kind of figure out how to manage it, and then the attractive market for some, so â\u0080\u0093 but that also again when you then your earnings is really depending on where I come open on the previous whereas if Iâ\u0080\u0099m open in the West and go to the Far East, of course that will give you a significantly higher return on discharge versus balancing from the East, and then ending up on a short version in the West. So these are kind of the variances as you see and as we fix sometimes 5 to 6 weeks ahead, if the market is tight; if the market is not so tight, and you will fix 2 to 3 weeks ahead in the West. But in the East, they will be more like 10 to 30 days ahead. So 30 days in the tight market, 10 days Iâ\u0080\u0099m not sure tight markets. And thatâ\u0080\u0099s, of course, again, kind of the lack that you would have to use would depend on how tight is the market and how hard to fix that. Thank you very much everyone for joining us, and we look forward to next quarterâ\u0080\u0099s call."
}