{
    "symbol": "BBU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 06:34:02",
    "content": " Before we begin, I'd like to remind you that in responding to questions and talking about our growth initiatives and our financial operating performance, we may make forward-looking statements. On the call with me today is Cyrus Madon, Chief Executive Officer; Denis Turcotte, Chief Operating Officer; and Jaspreet Dehl, Chief Financial Officer. We're also joined today by Stuart Levings, Chief Executive Officer of Sagen our Canadian residential mortgage insurer. I'll turn the call over first to Cyrus to provide an update on our business, and then Stuart will talk about recent developments at Sagen. We're well positioned heading into the second half of the year, and we're progressing initiatives to crystallize significant value. Like most, we're facing headwinds around inflation and supply chain challenges across our businesses, but the durability of our earnings has been a significant advantage for us. In fact, on a same-store basis, our EBITDA is up 10% over last year. It's too soon to predict when these inflation headwinds will ease and some may not for a while, but we continue to work with our management teams to take appropriate action to support performance if the environment worsens. Since our last update, we closed 3 of our recently announced acquisitions, including the $8.5 billion acquisition of CDK Global, our technology services and software solutions provider to the automotive dealer industry. This is a high-quality business with recurring contracted revenues, low ongoing capital requirements and high margin potential. Even with the recent widening of credit spreads, we were able to finance the transaction at favorable rates. Apart from growth, we've turned our attention to initiatives that should generate significant proceeds and crystallize value for our business. In May, we launched a process to sell Westinghouse, our nuclear technology services operation, which generated good interest from prospective buyers. Diligence is ongoing, and we're optimistic this will result in us reaching an agreement to sell the business. In the interim, we were able to complete a dividend recapitalization from this business that generated about $800 million in proceeds, of which BBU's share was $315 million. Since our acquisition 5 years ago, we've made significant progress to build value in the business. Like many of you, we're disappointed in the trading price of our units and shares. We're confident, though, that as we execute on our plans and continue to build long-term value in our business, the trading discount will close over time. With that, I'm going to turn it over to Stuart, but I first wanted to just express our thanks to Stuart and his team at Sagen who have done a wonderful job for us. And I hope you take this opportunity to ask Stuart, any questions you might have about the business he's running. Our proven business model, disciplined risk management and high-quality insurance portfolio position us well to manage through economic headwinds over the coming months. Sagen is a market leader operating in a concentrated, highly regulated industry with natural barriers to entry. Our business model produces an attractive financial profile, generating strong margins, earnings and cash flows that have proven to be resilient through prior housing and economic cycles. In Canada, mortgage insurance is mandatory for home purchases with a down payment of less than 20%. We ensure predominantly first-time homebuyers with strong income and credit profiles, retained to purchase entry-level homes with an average price of approximately CAD420,000. These buyers are often double income families, 25 to 45 years old with growing household incomes. Our portfolio includes mortgages originated across the country, concentrated around large urban areas, leading to a regionally diversified mortgage insurance book, which limits exposure to correlated economic risks. Our business has performed exceptionally well over the last few years, benefiting from record levels of new underwriting activity, strong home price appreciation and low mortgage default rates. These premiums will be amortized into earnings over the next 5 years, providing the business with predictable revenue and the ability to absorb higher default rates as the housing market and economy slow. Over the past 2.5 years, we've worked together with the Brookfield team to execute on a value creation plan, including growing our market share, improving our expense ratio, enhancing the yield on our investment portfolio and optimizing our balance sheet and capital efficiency. These enhancements have improved our return on equity to 20%, allowing the business to provide meaningful distributions to shareholders, including BBU. Looking ahead, we expect to see a more challenging environment with reduced levels of housing sales and some price softening. Rising interest rates, high consumer inflation and the expectation of slowing economic activity have led to a growing consensus for home prices in Canada to fall by 10% to 15% from their peak in the first quarter of 2022. This represents a modest pullback from the approximately 50% gain in home prices seen through the pandemic, and we believe that several factors, including continued undersupply of housing and positive immigration trends, including the target to welcome over 400,000 new immigrants per year to Canada will act as a floor to home prices. Approximately 80% of the insurance portfolio is backed by fixed rate mortgages, providing borrowers with payment stability in a rising mortgage rate environment. The majority of the remaining variable rate mortgages have constant payments, where only the mix between principal and interest is impacted by fluctuations in rates, thereby providing a similar degree of payment stability. In addition to the quality of our insurance portfolio, strong oversight and regulation, including mandatory loan amortization, full borrower recalls and debt service stress test for all insured borrowers served to mitigate the risk of borrower devil. For example, all insured borrowers in Canada are subject to a stress test that builds in a cushion for affordability in a rising rate environment. Borrowers must qualify for mortgage at a minimum qualifying rate, which is the higher of the benchmark rate, currently 5.25% or the rate offered by their lender plus 200 basis points. Furthermore, insured borrowers facing financial hardship as a result of significantly higher payments at mortgage renewal can extend their amortizations under our loan modification program. Consequently, rising rates are not typically a driver of mortgage delinquencies. Unemployment, which sits at historical lows with the consensus forecast for moderate increases over the next few years typically has a more pronounced impact on mortgage delinquencies. While unemployment drives the frequency of delinquencies, changes in house prices influence the likelihood of claims and degree of loss given default. That said, due to the significant level of house price appreciation over the past few years, our portfolio has an average loan-to-value of 60%, which means many borrowers today have significant embedded equity in their homes. For example, even in house prices declined by 40% and unemployment reached 10%, both of which would be well beyond current consensus forecast, the business will continue to generate positive net operating income and cash flows. As Cyrus mentioned, we had an excellent second quarter, generating adjusted EBITDA of $543 million compared to $381 million last year, with stronger results across all 3 operating segments. In Infrastructure Services, we generated adjusted EBITDA of $205 million compared to $125 million last year. In May, the business completed the acquisition of BS Energy to enhance its outage and maintenance service capability. In April, we completed the acquisition of our lottery services and technology operations, which contributed $25 million to adjusted EBITDA during the quarter. We've also secured a few new customer wins since closing our acquisitions, including a 10-year contract to provide products and services to the operator of the U.K. National Lottery. The overall demand environment remains stable, and we're continuing to benefit from high utilization levels on existing units on the way. We're also making progress on increasing the penetration of value-added products and services, which is helping to enhance margins. Pricing in a favorable mix of increased margins on advanced battery sales contributed to results despite the impact of higher labor, commodity and transportation costs. Also, just as a reminder, prior year results benefited from very strong aftermarket demand as global lockdowns and travel restrictions as eased. And finally, our Business Services segment generated second quarter adjusted EBITDA of $166 million compared to $145 million last year, and adjusted EFO of $151 million for the current quarter. While Australian Healthcare Services generated improved adjusted EBITDA of $21 million this quarter, the operating environment remains challenging. Elevated labor cost and high COVID-19 infection rates of patients and staff are resulting in cancellations of planned surgical procedures, which are having an impact on overall performance. Lastly, our Brazil fleet management operations continue to perform well. We were able to acquire the business for value, which will double the size of our existing fleet management platform in Brazil and to support our growth plan. As Cyrus mentioned, during the quarter, we generated a dividend from a nuclear technology services operation that was paid to all shareholders. With that, I'd like to close our comments and turn the call back over to the operator for questions. Yes, Geoff, there's nuclear regulatory bodies that would have to approve it. If it's a foreign buyer, we have to go through a U.S. CFIUS process. But is a sale also a possibility or is an IPO the more likely option for theâ\u0080¦\n Look, it's possible. We just wanted to be ready for when the capital markets are open, they will open at some point in time. So, we think it's just a good alternative to have and be ready. Sagan, when you take a look at -- going back to the 1990s sizing downturn, I think your combined ratio peaked around 90%. Today, we're still at extremely low combined ratios, I mean, in Q2, you had a negative loss ratio. So as you've heard us say before, in that $0.15 to $0.25 loss ratio range, which would imply sort of a 35% to 45% combined ratio range, which is still very, very profitable. As you know, we had a lot of products back then that were riskier, drove a lot of our losses, and we just don't underwrite those these days because we're not -- we can't. How should we reconcile the confidence in the Westinghouse sale process with the...\n Devin, you're cut out. Operator, maybe we'll move to the next question and then come back to Devin. Because you incorporated a healthy discussion around Sagen, I wanted to ask a pair of questions about the end game for that investment. We've improved our ROE from 13% as a public company to consistently around 20% now, and our expectation is to be able to maintain that. And in terms of the sort of value over time, we're now generating strong distributable cash with a 20% ROE, and we should be able to maintain that given the leverage we have in place and some of the other changes we made with Brookfield being on board as owners. As far as the -- any further plans, I think that will be back to Cyrus. So, for Sage and specifically, this business is generating 20% cash return to us. If we can get a very large premium to our entry prices, then it might become attractive, what are alternative uses of capital, all the things we think about in capital allocation. The team has done a phenomenal job, and we think that these sorts of returns should be sustainable over a cycle. But otherwise, that's the sort of thing we would think about. And it might be a little premature to be having this discussion anyway, but I always felt like public market investors, when Sagen was public, struggled to price in the left tail risk and have associated with an  housing shock and that's why it really never attracted the multiple you might otherwise have expected it, too, just based on the level of underwriting margins that was able to achieve in a buoyant housing market environment. And again, this might be a little bit premature to be had in this discussion, but I just wanted to feel that out a little bit. I think if we can continue to demonstrate the high returns we've demonstrated, it's possible this could be related in the public markets compared to where it was trading. You also need to reflect upon the fact that its previous controlling shareholder was in some form of, I'm going to say, financial stress, if not distress and I think that probably weighed quite heavily on the sale price of Sagen. Look, our decision on CDK is really based on the fact that it's a great business. So, we've had a chance to really get into the cuts we're doing onboarding. And as we did -- we talked about the fact that we did a dividend recap at Westinghouse, and that allowed us to free up some cash. So, from, again, capital allocation perspective, we made the decision that it was a good idea to allocate a little bit of capital from BBU to CDK. So, we're continuing to have people engage, talk people looking at the deals. And sort of co-investment interest is still there, maybe it's taking a little bit longer, but we haven't seen any kind of significant deterioration in that interest from LC. But broadly speaking, there's a very high level of interest for their co-investment. So, I wanted to start with Cyrus, how we should reconcile the confidence at that Westinghouse sale process with the broader challenges in financial markets and that slowdown in private market transactions that was referenced in the letter. They need to work through those commitments over time before they can free up capacity to do a set of new deals, and they're not through that yet and as a result of that city to do a set of new deals, and they're not through that yet. And as a result of that, I'd say, generally transaction activity or private equity for financial sponsors is slow generally across the board. On the other hand, for high-quality credits for investment-grade borrowers, for infrastructure buyers, there's lots of financing available. So, it really depends on what you're buying and what kind of buyer you are and what level of financing you're putting on. So as the Westinghouse level, we've got about -- the $3.7 billion, $3.6 billion of leverage and then plus the $100 million dividend recap. Can you speak to the competitive environment for mortgage insurance in Canada, I think we saw CMHC loose some market share over the last few years. It's very apparent CMHC have decided to reverse course a little bit in terms of the underwriting changes that they made, and they are intent on recovering some market share. At Sagen, we're very confident in our position in our offering in terms of customer service and differentiation. Right now, what they're hearing, what they CMHC are hearing is that we're not just going to revert back to levels of share we had with you before. I think the landscape has changed now from a competitive dynamic, and we are confident that we can maintain our market share in that 36% to 38% range. Thinking about the ROE outlook, you mentioned 20% as being sustainable normalized periods. But in actual fact, in a year like this and in last year's environment, we're probably frankly more like a 23%, 24% ROE. But at the same time, there is some room on that in terms of being a bit more capital efficient, and that will help to offset some of that increase in loss ratio as well. Stuart, some of the headlines reading today is around trigger rates on variable rate mortgages. Of the remaining 20%, the lion's share is uncapped variable, but payments don't change, right, as the rate goes up until they hit a trigger rate or term renewal. We think that we're probably a good 100, 150 basis points out still before we start to hit some trigger rates. And even at that time, if those lenders have to reset payment, the fact of the matter is, as you know, perhaps some prior discussions, we are able to deploy some of our loan modification tools to address any payment shocks such as the extension, et cetera. We have filed a registration statement with the securities regulators, and we intend to keep that, I'll say, fresh and alive in case market conditions have become positive. That's going to be -- that's not going to be a near-term event for us as we said on last call, simply as we want to get the leverage down on the company before we can think about monetization. But we're going to be ready for it or when the timeâ\u0080¦\n Okay, perfect. Can you provide a bit more, I guess, greater perspective in the hotter housing markets last few years, the GTA, Vancouver area, et cetera. Early enough, some of the more urban and suburban markets were even hotter than core centres like Toronto, Vancouver as the pandemic effect played out and people moved outlets -- but ultimately, we've always played in the bottom end of that range, given our $1 million cap. So, price sensitivity drives some of the softening in housing markets. The more expensive homes are seeing bigger corrections or drops in prices now, lower end properties in terms of price range. So, these will likely mean borrowers don't have 50% of equity. So, my understanding of the business is that the government contracts are fairly kind of long-dated and predominantly fixed rate. There's no question we're seeing a little bit of inflation, paper and ink being the primary drivers in this case. So, it's early stages in this situation because we're only 3 months into it but our 100-day plan is -- has been executed exactly as expected. So at this point, we're actually optimistic and we've committed to Cyrus we're going to beat our underwriting in this case. I'm going to go off of memory and then we can circle back and give you a more precise, but I think we've got about BRL 3 billion of debt within BRK. Thanks, everyone, for joining us, and I look forward to speaking to you next quarter."
}