{
    "symbol": "SGH",
    "quarter": 2,
    "year": 2023,
    "date": "2023-04-04 22:33:02",
    "content": " SGH achieved record non-GAAP gross margins of 28.9%, and non-GAAP earnings per share of $0.76 which exceeded the high end of our guidance range on sales of $429 million. In Q2 IPS had another record quarter of sales at $222 million, which represented 52% of total SGH sales, reinforcing the transformation we are going through at SGH. For the second quarter of fiscal 2023, LED solution sales totaled $56 million or $0.13 of overall SGH sales. Despite the continued macro-economic headwinds, we reported a solid quarter in Q2, helped by on operational discipline and the strength of our IPS segment, which had both record revenues of $222 million, as well as record segment operating income of approximately $38 million. In Q2 our overall services revenue totaled $55 million, up from $36 million in the year ago quarter, helped by the inclusion of Stratus Technologies, which we acquired in the beginning of this fiscal year and product revenues were $374 million. Second quarter revenues by business unit was as follows: IPS had a record $242 million, LED had $56 million and Memory at $151 million. In addition, operating expenses benefited in the second quarter of 2023 from $1.4 million in financial credits in Brazil, which was down from $2 million in the first quarter of 2023 and down from $6 million in the year ago quarter. Consistent with past practice, net accounts receivable, days outstanding and inventory turnover are calculated on a gross sales and cost of goods sold basis, which were $573 million and $463 million respectively for the second quarter, and as a reminder, the difference between gross and net revenue is related to our logistic services, which is accounted for on an agent basis, meaning that we only recognize the net profit on logistics services as revenue. Our GAAP and non-GAAP diluted share accounts for the third quarter is expected to be approximately 50 million shares based on a current stock price, and cash capital expenditures for the third quarter were expected to be in the range of $12 million to $15 million. As we mentioned at the outset, we continue to operate the business very well, and the resilient nature of our business, generating the cash that Ken alluded to over $1000 million in the quarter with record non-GAAP gross margins."
}