{
    "symbol": "SGH",
    "quarter": 1,
    "year": 2023,
    "date": "2023-01-03 21:36:03",
    "content": " In the first quarter of our fiscal 2023, revenues totaled $465 million, which exceeded the midpoint of our guidance range. And IPS revenue came in at a record $211 million for the first quarter, up 46% sequentially and up 78% compared to our Q1 fiscal â\u0080\u009822. For the first quarter of fiscal 2023, LED Solutions revenues totaled $63 million. With the addition of Stratus in the first quarter of 2023 our overall service revenues reached $75 million, up from the $33 million in the year ago quarter. Operating expenses were up primarily due to the inclusion of Stratus, which accounted for $18.7 million of our operating expenses in the first quarter Operating expenses also benefited in the first quarter of 2023 from $2.6 million in financial credits in Brazil, which was up from $2 million in the fourth quarter of fiscal â\u0080\u009822 but down from $5.9 million in the year-ago quarter. And consistent with past practice, net accounts receivables days outstanding and inventory turnover are calculated on a gross sales and cost of goods sold basis, which were $843 million and $725 million, respectively, for the first quarter. Our non-GAAP operating expenses for the second quarter are expected to be approximately $75 million, plus or minus $3 million, and up slightly from the first quarter, in part due to the timing of nonrecurring engineering costs to support our IPS business. If we look at the services component and you look at those that have higher visibility, and I would exclude things like implementation services or logistics services that come in but can come in, in any period in a different size, itâ\u0080\u0099s probably in the neighborhood, I would say, in that $50 million range, plus or minus, that are more on an annual recurring basis or we have better visibility even looking out to a year. Thatâ\u0080\u0099s probably -- those longer-term services are probably in that $45 million to $50 million range a quarter, and then there are more kind of onetime or point-in-time type of services that can occur in every quarter."
}