{
    "symbol": "HITI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-17 20:49:05",
    "content": " Before we begin, I'd like to remind everyone that certain statements made on today's call and contained in the company's press release dated March 17, 2022, released earlier today, may contain forward-looking information within the meanings of applicable securities laws. The use of any of the words could intend, expect, believe, well projected, estimate, estimated, and similar expressions and statements relating to matters that are not historical facts are intended to identify forward-looking information, and are based on the company's current beliefs or assumptions as to the outcome and timing of such future events. We want to be clear that such forward-looking statements represent the company's beliefs about future events, plans, or objectives, which are inherently uncertain and are subject to numerous risks and uncertainties that may cause the actual results or performance to differ materially from such statements. Additional information about both the material factors and assumptions forming the basis of our forward-looking statements and risks, and which could cause actual results or performance to differ materially, and the material factors or assumptions that were applied to make such conclusions, forecasts, or projections in forward-looking statements on this call, are contained both in a readily available document, available upon request and in our regulatory filings available on SEDAR and EDGAR under the company's profile. In addition, today's call may contain future oriented financial information known as FOFI, within the meaning of Canadian Securities Legislation about prospective results of operations, financial position, or cash flows based on assumptions about future economic conditions, and courses of action, which FOFI is not presented in the format of a historical balance sheet, income statement or cash flow statement. The FOFI has been prepared by management to provide an outlook of the company's activities and results and has been prepared based on a number of assumptions, including the assumptions contained under the heading entitled Cautionary Note Regarding Forward-Looking Statements in the company's press release dated March 17th, 2022, released earlier today. However, because this information is highly subjective and subject to numerous risks, including the risk discussed under the heading entitled Cautionary Note Regarding Forward-Looking Statements in the company's press release dated March 17, 2022, released earlier today, and under the heading Risk Factors and Risk Assessment in the company's public disclosure. In the first fiscal quarter ended January 31, 2022, the company recorded consolidated revenue of $72.2 million, representing an increase of 88% year-over-year and 34% sequentially. Retail revenue was $71 million in the first fiscal quarter of 2022, up 93% year-over-year and 35% sequentially due to contributions from acquisitions, stores rebuilt organically as well as same-store sales growth."
}