{
    "symbol": "HITI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-14 21:24:06",
    "content": " At this time, I would like to welcome everyone to High Tide Inc.â\u0080\u0099s Third Quarter of 2022 Unaudited Financial and Operational Results Conference Call. Good evening, everyone, and welcome to High Tide Inc.â\u0080\u0099s quarterly earnings call. Joining me on the call today are Mr. Raj Grover, President and Chief Executive Officer; and Mr. Rahim Kanji, Chief Financial Officer. Earlier today, the company released unaudited highlights from its financial and operational results for the third quarter, that ended July 31, 2022. Before we begin, let me remind you that during the course of this conference call, High Tideâ\u0080\u0099s management may make statements including management's expectations, or estimates of future performance. All such statements, other than statements of historical facts, constitute forward-looking information or forward-looking statements within the meaning of the applicable securities laws and are based on assumptions, expectations, estimates and projections as of the date hereof. Specific forward-looking statements include, without limitation, all disclosures regarding future results of operations, economic conditions and anticipated courses of action. For more information on the company's risks and uncertainties related to forward-looking statements, please refer to the company's press release dated September 14, 2022 released earlier today. Although these forward-looking statements may reflects management's current beliefs and reasonable assumptions based on the current available information to management as of the date hereof, we cannot be certain that the actual results will be consistent with the forward-looking statements in the future. Accordingly, we caution you not to place undue reliance upon such forward-looking results. It is now my pleasure to introduce Mr. Raj Grover, President and Chief Executive Officer of High Tide. Regarding the results, total revenue for the third quarter was $95.4 million. While it continues to be a very competitive market for cannabis, High Tide continues its strong momentum forward. Our sequential revenue gains were primarily in Canada, driven by significantly higher same-store sales, as well as adding more stores to our corporate network. While we are very excited at the Q3 revenue figure, we know that revenue grew throughout the quarter and beyond. In fact, we calculate that we are on an annual revenue run rate exceeding $400 million today. Second only to Canopy Growth, which refer its last reported quarter was on a $440 million annual run rate. While our revenue levels are only about 10% apart, we can't help but highlight the discrepancy between their market cap of $2.2 billion and ours at $135 million. The change was due to a shift in mix with more revenue coming from our Canadian cannabis business, which now stands at 85% of total revenue. While our Canadian business carries a lower margin, it is important to note that the gross margin percentage we earned by selling cannabis in our stores was stable sequentially in Q3 versus Q2. Adjusted EBITDA for Q3 2022 was $4.2 million, representing our 10th straight quarter of positive adjusted EBITDA, up a 176% versus Q3 2021 and up 77% versus Q2 2022. You will recall that in the second half of last year, we cautioned the market regarding two items, a new layer of costs related to NASDAQ Listing and the initial impact of a discount club model. We indicated that these two items would depress EBITDA in the short term, however, we expressed confidence that we would grow through them and would pay off in a few quarters. Same-store sales in Q3 were up 18% versus Q2, and 46% versus Q3 of last year. Driven by both these very impressive same-store sales figures, as well as opening new stores we estimate a national market share excluding Quebec to have been over 7% in Q3, up from 6% in Q2, and 5% in Q1. Our store count is at 140 today, and we continue to feel good about hitting our target of 150 by the end of the calendar year, through a combination of organic openings, and accretive M&A. Note that this quarter's results do not include the addition of nine stores from Choom, representing our largest bricks and mortar transaction since we acquired META. This is the third public company's assets we've acquired in the last two years, the other two being META and Smoke Cartel. We continue to see lots of inbound from operators making inquiries, and looking to us as the acquirer of choice. This puts us in a position to be extremely strategic and selective to make sure that whatever opportunities we choose to pull the trigger on are compelling in terms of our approach of being both highly accretive and a strategic fit within our diversified ecosystem, thus creating long term value for our shareholders. As the largest shareholder of High Tide, it does pay me to use our shares to acquire companies at today's depress multiple, but we remain true to our strategy. Because of how selective we are and the terms we can get, that continue to add more and more to our revenue and EBITDA. However, the way we have positioned ourselves over the last many quarters to organic growth and accretive M&A should result in higher EBITDA and market share for us to be properly valued on as the broader cannabis capital markets recover. We will also note that despite evaluating several opportunities over the last 12 months, we did not pull the trigger on any options types agreements with cannabis operators in the U.S., such agreements would have us issue more stock without clarity on when we can recognize the related financial benefits. Given our network relationships and execution, we are confident that we will still be ready to go with operating bricks and mortar locations in the U.S. when federal legalization occurs. Our entry into the U.S. will be additionally supported by the three million existing ecommerce customers we have outside of Canada, 80% of which reside in the United States. We have been focusing on our current business, the results of which are playing for all to see in our release today. As everyone is painfully aware, valuations across the cannabis landscape have come down significantly across the board, often driven by weakening fundamentals, unlike High Tide where our fundamentals are improving with every passing quarter. Our innovative discount club model continues to catch fire across Canada and our entry into British Columbia in mid-July, provides more of a national platform to keep growing. Our Cabana Club membership has now surpassed 750,000 members, which you will recall seemed like an incredibly ambitious target when we originally set it less than a year ago. And as they represent over 90% of our daily transactions, we are working on ways to start monetizing this base by introducing Cabana Elite, our premium offering, which should over time only further reinforce loyalty and profitability. Recall that our Discount Club offering is anchored by our points of differentiation, not simply offering a lower price, such as our unique loyalty plan, our years of experience in the consumption accessories manufacturing business, our top tier international CBD brands, as well as our white label offerings under the name Cabana Cannabis Co. Our Cabana Cannabis Co product that launched in Saskatchewan in June has been well received, and we have another 10 product skews under development. We aim for Cabana Cannabis Co products to represent 25% or so of our sales in the longer term, which again should help significantly boost our bottom line. While our Canadian business continues to outperform, we have seen some continued softness in our consumption accessories in CBD ecommerce businesses. Now that restrictions have largely east, people are readjusting and are able to go back to brick and mortar stores, which we are definitely seeing in our stores. We are encouraged by initial signs of stabilization in our ecommerce businesses, looking at the start of Q4 versus the end of Q3. Ultimately, our core bricks and mortar business in Canada represents 85% of our consolidated revenue, and it is firing on all cylinders as demand for THC products tends to be more recession resistant. Our CBD and accessory ecommerce businesses performed very well in previous quarters, where our bricks and mortar business was temporarily depressed due to the initial impact of the discount model and NASDAQ Listing cost. While we continue to dominate the Canadian retail landscape, let's also quickly discuss an up and coming opportunity for High Tide Germany. While we expect to get further clarity soon, our expectation is that a bill will be introduced in Parliament by the end of Q1 '23, which will allow foreign operators such as High Tide to apply for and receive retail licenses. So in conclusion, we are extremely happy with our performance in Q3 as it represented a breakout quarter in terms of our revenue and EBITDA trajectory. We are unmatched in terms of retail leadership with 140 locations, generating strong organic growth which is complemented by highly accretive M&A, putting us in a position to now be running neck and neck for the most cannabis revenue in Canada. Our concept and market share keep getting stronger, which should help us with markets that are more down the road like Germany and the U.S. as they open up. Despite a very difficult macro environment, our team has its head down, and it's moving our business forward every day, working on driving sales, identifying new complementary business lines, streamlining operations, focusing on cost control to improve cash flows even further, as well as working with regulators and evaluating strategic and accretive M&A opportunities. Four years into legalization in Canada and with foothold in other markets, it's clear that we have the best team in the business and for this I'm eternally grateful. With that, I will now turn the call over to Rahim Kanji, our Chief Financial Officer, to discuss our financial results. In the third fiscal quarter ended July 31 2022, the company recorded consolidated revenue of $95.4 million, representing an increase of 98% year-over-year and 18% sequentially. Our gross profit was $25.8 million in the third fiscal quarter of 2022, representing 27% of revenue versus 28% in Q2. The model sequential decline was explained by the increasing mix of revenue of our Canadian bricks and mortar, which carries a lower gross margin profile. While the ultimate consolidated gross margin in subsequent quarters will depend on the mix of revenue, which will be influenced by organic growth rates and future acquisitions, I can say that our gross margin percentage in Canada has been holding steady. Speaking of, while our revenue rose $14.3 million sequentially, our two primary expense items salaries and wages and benefits, and general and administrative only rose by a combined $1.5 million. This allowed 13% of the revenue increase, or $1.8 million to flow to adjusted EBITDA. Our adjusted EBITDA margin increased from 3% in Q2 to 4.5% in Q3, due to our ongoing emphasis on cost control. While our sales are going great, we are now looking at how we can tighten our ship even further and enact operational efficiencies to get more down to the bottom line. In Q3, we raised $5 million in non-convertible subordinated debt followed by $11.5 million in an oversubscribed equity offering and paid out our secured debt holders. Our cash flow from operations before changes in non-cash working capital was $2.3 million in the quarter, showing significant gains versus the $1.6 million generated in Q2 this year, and negative 0.2 million in Q3 last year. We are almost at the finish line with Connect First and we expect to close our $19 million non-dilutive credit facility imminently, which should provide more than sufficient resources to keep growing and executing on our objectives. Due to a default by Halo, High Tide was able to seize the shares of Halo Kushbar Retail Inc., taking control of three operating cannabis retail stores in Alberta. Specifically, we acquired three existing Canna Cabana branded stores in Ontario, which were previously owned by a lottery winner and we absorbed the only Canna Cabana franchise we ever had in Calgary. Accordingly, we now fully own all of our 140 locations, with the exception of one store in Sudbury, Ontario, where we own a 50% partnership, and two stores in Manitoba, where we have a 49% interest in two stores which are inherited from the META acquisition. In closing, Q3 was a record breaking quarter for High Tide, and we continue to see strong customer loyalty for our brands and products heading into Q4 and beyond. So look, Federico, we are very excited about launching Cabana Elite, which we have messaged the market that we will be launching it at some time, towards the end of this year. We actually have all of the perks lined up and measured and we are just getting embedded with all the different regulators in the country, as you can understand, we are dealing multi provincially in Canada. But you know, I would be a bit immature to speak about what exactly those terms would be, one, I would like to keep this in my back pocket still until we actually launch it. So we are currently working on it, I canâ\u0080\u0099t give you some color on pricing, it's going to be around the $50 to $60 annual mark or $5 a month. But like I said, I'd be able to share that more towards the end of the year when we launched that program. So with every passing order, we should be able to announce more and more paid memberships, which will again boost our bottom line every passing quarter. And, you know, we are very attuned with what's actually happening in the market. So we're very happy where the margins are right now and let's say the margins didn't go backwards, the High Tide advantages our ecosystem is so diversified and unique that we can always go and get some more margin to add to our portfolio. So we don't see any trouble going forward in terms of margin, at the moment margins remain very stable for ourselves in Canada across all provinces. Thank you for your question. I would appreciate an update on your M&A plans, particularly in Ontario province where you are capped on the number of stores. And if you are seeing those opportunities, and I think you did mention this in your prepared remarks, would those be similar kind of valuation levels to trailing EBITDA, that we've seen in the past. So, there's tons of M&A opportunities that remain for us, on purpose, and we've slowed down in terms of our international acquisition and more ecommerce related acquisitions, one, we wanted to see how things unfold with ecommerce with discretionary spending down. But on the brick and mortar front, we have been very active, in terms of M&A, with our last acquisition being adding nine stores from Choom. But like I mentioned in my prepared remarks, it pains us to issue stock at these levels. But at the same time, I'm very aware of if the acquisition is accretive, we want to do it, we're adding more and more value for High Tide shareholders in the long term. In fact, over the next few weeks, you should hear some more M&A transactions from us, especially related on the brick and mortar front. On the on the valuations, we are already known in the market with every single transaction that we've done has been highly accretive to High Tide results. And we're picking up these businesses at 3.5 times four times EBITDA, which is very, very accretive to us. However, we are being very selective because we have a lot of inbound requests for us to take a look at these small operators, independent and some also even some regional chains. But nonetheless, there must be a strategic or geographically welcome location that we would like to see in our portfolio. And at the same time, they have to be highly accretive to our results. Again, going back to the prepared remarks, Rahim I heard you talking about there's still been some opportunities to tighten up the ship. And as I commented, our revenues are in a very good trajectory, it's going as expected or far beyond our expectations, we're now looking at sort of our cost basis. With the scale and size that we have now we have the ability to look at some of the costs that are fixed in nature, and try to bring those costs down so we can get the benefit, right, going right to the bottom line. There's core services that, that go up with the expansion of every store, you hire, like store level staffing and some other expenses. And as you grow, and as you get that scale, you're able to negotiate those costs with vendor now because your volumes have gone up. So we're always looking at those opportunities, where we can make our operations more efficient, and have that cost savings go right to our bottom line. Thank you for your question. Our next question comes in from the line of one Doug Cooper with Beacon Securities, your line is now open. Hi, good evening, everybody, and congratulations on the nice quarter. So Raj, just curious, if I take a look at the macro environment, the Canadian market has essentially flat lined and Alberta your largest market is essentially flat for the past six or seven months. The results coming from kind of major participants, whether it be Auroraâ\u0080\u0099s loosing tons of share, and Canopy loosing tons of share, Tilray is losing share, Fire and Flower clearly loosing share, the members were not very good. Our innovative discount club model has proven to take market share outside of Quebec, and we are now 7% of the market share this quarter, which was only 6% last quarter and 5% quarter previous to that. Again, as I highlighted in my prepared remarks, our loyalty plan, which is very differentiated in the country, our vertical integration on the consumption accessories front, there's no other player that has this experience. And also, launching innovative ideas like our Cabana Cannabis Co. white label program that is now live in Saskatchewan, but also going in Ontario. So this quarter also we added $14 million plus to our revenue on the brick and mortar front, our costs to offset that was only $1.5 million. And all of this is adding up to run our business more efficiently, we're all we've also created a very attractive concept. So you can see that with the speed of membership that we are getting, where it's 750,000 members. And it's also put us in a really good position to now monetizing this membership base, which takes it to another level. And just follow up on the M&A side, there has been some talk that, in Toronto, particular, maybe a third of the stores are about to go under. Unfortunately, Doug, we're seeing more than just anecdotal signs of store closures, and also regularly, we get these inbound requests of unprofitable stores considering to sell. And we will pick up a lot of this business one organically with what we already have in the market with our 140 stores, and others constantly we are doing good accretive M&A deals, but we're being very, very selective on what we purchase, we can buy everybody and we don't want to. But this happens to every industry when it's right sizing and the right sizing is now going on but we're already very healthy, Doug. Our long term goal initially was 200, and I always like to under promise and over deliver, but I think we can now get to 250 stores looking at what's happening in the market, especially in provinces like Manitoba and Saskatchewan and Alberta where there's no cap. So, things are looking really good on that front in terms of the market right sizing and you will see us announcing more of these M&A transactions related to brick and mortar in the coming weeks ahead. First question for me on the supply chain, you mentioned last quarter prioritizing sourcing your Canna Cabana locations over your legacy wholesale business. However, I'm very hopeful that we'll have over 100 locations fully installed by the end of this year. When it comes down to prioritizing between the wholesale business and the retail business, we made that very clear to the market that, retail is less than 1% of our overall business, our wholesale is less than 1% of our overall business and we have always been a retail focus company. And we're doing exactly that on that front because we prioritize Canna Cabana and because we prioritize accessories on our ecommerce platforms, we're doing quite well with the supply chain, we are not seeing any issue whatsoever. Now, if I our wholesale business was a lot bigger than we would have to ration a little bit into wholesale, but we're not having to do that. Just looking for color on new potential SKUs you could roll out there, there's obviously an opportunity within some of these alternatives, cannabinoid segments that offer maybe some better pricing dynamics than just regular CBD. So Nick, we always want to introduce new products into the market, because it's that small incremental revenue to what we already have. And over the last quarter, we press release that we were starting, we were launching the sales of D8/D9, that launch has gone relatively slow for us, just considering dynamics of supply chain for the vendors because we don't make these products ourselves, particularly depending on state by state regulations. And then we're always looking at the brand new cannabinoids that are coming out, cannabis is an amazing plant. And we are actively looking to bring in more products on that particular basis and also expand other lines such as our pet lines and get into cosmetics, high end cosmetics on the CBD side. Thank you for your question. So just on the average revenue per store and 131 store, nearly about 640,000 or 650,000. Something like that in the quarter in Canada, so 2.5 million run rate per average stores? When we look at -- compare against the market, and we're right at the average or above the average in most of our stores. So, we have very high volume stores, and yet some average stores and some a little bit lower. But on average, we seem to be doing better than the market average per store. Look, we're always looking for as Raj mentioned, looking for that accretive acquisition. So we're always looking for those qualities in a location before we make a decision, but Iâ\u0080\u0099ll give Raj to maybe add more color to that. And when we look at their revenue levels, and where the locations are, there's nothing to see there. And unfortunately these businesses will cease operations sometime, so depending on their holding capacity. Now, if I'm buying three stores and one store is doing 1.4 and the other store is doing 2.2, and the other store is doing over $1.8 million, yes, we will take it as a combined package. We have done that in the past because we know even when we buy these stores at these levels, we are going to make them better by launching our own model which is a discount club model to the Canna Cabana stores. So, we -- if it's below $1.8 million, we don't entertain it, if it's a group of that averages to $1.8 million, game on. But as we continue to execute Doug, it becomes more and more clear to the market, which is our investors, and also our competitors, that where this business is going and who are the real players in the market. So, join the High Tide family and let's ride this wave together. However, like I said, as long as they're accretive as long as they meet those minimum thresholds, we're going to go for it. Thank you for your question. Now, I'd like to turn the session back over to High Tideâ\u0080\u0099s Chief Executive Officer, Raj Grover, for final comments. Thank you, operator and thank you to everyone for your interest and continued support for High Tide."
}