{
    "symbol": "HITI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-14 19:55:21",
    "content": " At this time, I would like to welcome everyone to High Tide Inc.’s Second Quarter of 2022 Unaudited Financial and Operational Results Conference Call. Good evening, everyone, and welcome to High Tide Inc.’s quarterly earnings call. Joining me on the call today are Mr. Raj Grover, President and Chief Executive Officer; and Mr. Rahim Kanji, Chief Financial Officer. Earlier today, the company released unaudited highlights from its financial and operational results for the second quarter ended April 30, 2022. Before we begin, Please let me remind you that during the course of this conference call, High Tide’s management may make statements including, with respect to management's expectations, or estimates of future performance. All such statements, other than statements of historical facts, constitute forward-looking information on forward-looking statements within the meaning of the applicable securities laws and are based on assumptions, expectations, estimates and projections as of the date hereof. Specific forward-looking statements include, without limitation, all disclosures regarding future results of operations, economic conditions and anticipated courses of action. For more information on the company's risks and uncertainties related to forward-looking statements, please refer to the company's press release dated June 14, 2022 released earlier today and our latest annual information form and our latest management discussion and analysis, each filed with the securities -- regulatory authorities at sedar.com or on EDGAR at www.sec.gov. Although these forward-looking statements reflects management's current beliefs and reasonable assumptions based on the current available information to management as of the date hereof, we cannot be certain on the actual results that they will be consistent with the forward-looking statements in the future. It is now my pleasure to introduce Mr. Raj Grover, President and Chief Executive Officer of High Tide. Welcome to High Tide Inc's financial results conference call for the second quarter ended April 30, 2022. Total revenue for the second quarter was $81 million, this was up 98% year-over-year and was up 12% sequentially. While it continues to be a very competitive market for cannabis, all our sequential revenue gains were in Canada, driven by significantly higher same store sales, as well as adding more stores to our network. We continue to post the second highest revenue level among all Canadian cannabis companies that report in Canadian dollars only behind Canopy Growth, a company with a $1.7 billion market cap versus ours at $170 million. As a percentage of revenue, gross profit declined from 32% in Q1 2022 to 28% this quarter. Adjusted EBITDA for Q2 2022 was $2.4 million, representing our ninth straight quarter of positive adjusted EBITDA, which is unmatched in the Canadian retail cannabis sector. While we are pleased with our EBITDA of $2.4 million this quarter, we highlight that as the only pure play cannabis retailer trading on NASDAQ, direct ongoing cost incurred associated with our NASDAQ listing amounted to over $750,000 this quarter. We are grooming and feeding these newer stores to catch up to the maturity levels we need them to reach to become EBITDA positive and we expect this to continue, given the pace at which we are acquiring and building new stores. As we open up more stores, which we expect to continue to do, the percentage of bricks and mortar revenue should increase versus other business lines. We are at 126 stores today, well on our way to our target of 150 by the end of the calendar year. On our last quarterly conference call, I provided some data showing how well our innovative discount club model has been received. Today, I'm pleased to highlight that this growth accelerated significantly during Q2. According to multiple data services, total cannabis retail sales across Canada were 6% higher in the month of April when our Q2 ended, when compared to the month of January when our Q1 ended. In contrast, our same store sales alone were 20% higher in April versus January. Accounting for the one fewer day in April, our same store sales were on a daily sales run rate ending Q2 that was 24% higher than we ended Q1. We have seen consistent growth and outperformance versus our peer group since we launched the discount club model on October 20, 2021. Our same store sales alone, not including the new ones we added, were up a tremendous 43% comparing the month of April to the month of October, whereas the entire Canadian market, including the addition of new stores was only up 3% during this period. Accounting for the one fewer day in April, same store daily sales were up 48% in April versus October. While offering unbeatable prices is one key factor in our discount club, it is a lot more than just that, in terms of leveraging our unique points of differentiation for consumers. None of our retailer peers have this line of business, so no one can touch us in this area. We have seen Cabana Club membership skyrocket from 245,000 on October 20 to over 550,000 to date. We reach out to our members regularly via emails and text messages to showcase our brands and products, having been the first cannabis retailer to launch market versus member pricing and this differentiated model has contributed to increasing repeat business and loyalty. We have always been innovative in our marketing strategies as recently highlighted by our 42,000 car giveaway on  (ph), which we have decided to now make an annual event. The final key differentiating pillar of our discount club model, which I'm particularly very excited about is our Kibana Cannabis Co. house branded product line, which first hit our store shelves yesterday in Saskatchewan. Many of them are strong businesses as evidenced by the recent acquisitions we announced and there are many more in the pipeline, which we are working towards acquiring at highly accretive multiples for our shareholders. So our bricks and mortar Canadian business continues chugging along and it's hitting new highs, even in this very competitive market. However, there was some softness in our international business, which largely consist of online sales of CBD and accessories resulting in our revenue run rate outside of Canada now representing $70 million annually. Specifically, Q2 is a seasonally slower quarter in retail as it compares to the holiday season. COVID had driven extraordinary gains in e-commerce over the past two years, with pandemic restrictions having now largely been eliminated, consumers are renormalizing their buying habits towards in-store purchases, including our own with a temporary cooling off on sales for e-commerce players, despite a very positive long term growth trajectory. Overall, our international business continues to perform well and its prospect remains very bright. So in conclusion, Q2 was another great quarter for High Tide. We are putting up more stores both organically and via highly and immediately accretive acquisitions, and all while generating healthy positive adjusted EBITDA for the ninth straight quarter, again unmatched in the Canadian retail cannabis industry. This is in part due to our aggressive approach to market share growth by leveraging our full and unique ecosystem and expanding our loyalty offerings, which we plan to monetize in the future. With that, I will now turn the call over to Rehan Kanji, our Chief Financial Officer to discuss our financial results. In the second fiscal quarter ended April 30, 2022, the company recorded consolidated revenue of $81 million, representing an increase of 98% year-over-year and 12% sequentially. Our consolidated gross profit was $22.7 million in the second fiscal quarter of 2022, representing 28% of revenue versus 32% in Q1 2022. Our Canadian bricks and mortar business grew its share of revenue sequentially and as it carries a lower gross margin, which resulted in the consolidated level declining. While the ultimate consolidated gross margins in subsequent quarters will depend on the mix of revenue, which will be influenced by organic growth rates and future acquisitions, I can say that we have identified and are actively taking advantage of opportunities to increase our gross margin percentage in Canada. While consolidated revenue rose by $8.8 million sequentially, salaries, wages and benefits were essentially unchanged. General and administration administrative expenses increased by $807,000 sequentially, this was due to the new store openings in the quarter, a contribution of full quarter of new lease operations, and increase in general corporate expenses. As a reminder, the facility will consist of two $15 million components, a $15 million term portion upfront at a very attractive 5.19% fixed interest rate, part of which would pay off $5.5 million of existing debt and a 15 million M&A master line facility, which will help support the cash portion of future M&A allowing future transactions to be less dilutive. Our cash flows continued to be strong in Q2, our cash flow from operations before working capital was $1.6 million in the quarter, essentially equal to the $1.7 million generated in Q1. That said, we continue to invest in working capital and CapEx to support more organic store growth, which is clearly generating more sales. With that, I will now turn the call over to the operator to open the lines for the question-and-answer session. I want to focus a little bit more on the retail store, the four wall metrics here and kind of dig into the gross margin, and your High Tide focus increased profitability on the retail side there. So Scott, retail, our consolidated gross margins are sitting at 28%. If you separate retail gross margins out and include our data revenue, we are close to 23%. If you take the data revenue out of that, we are close to 16%. The good news is Scott that, we have gone through that initial phase of really going after the market share and now we are clear leader emerging as everyone can see in our sales number and our absolutely exponential same store sales growth. So I am feeling very confident that this quarter and next, this current quarter that we are in, we actually have some opportunity to increase our margin slightly. So we may see a slight margin increase on that front, but at the very least, we are going to remain very stable on our brick and mortar margin front. And in the case of inflation and people have limited dollars today, if we talk about our overall consolidated gross margin profile, we also feel that our international business gross, where it stands today, our gross margins remain stable. So I don't see this deteriorating any further from where we are today consolidated, as I see some opportunity on a brick and mortar side now to slightly increase our margins at the retail level. The margin expectations from that and strategically the opportunity delivery, what percentage of kind of provincial sales do you think can come from delivery outside the retail and the online sales now currently. So Scott, we've always been forward thinking with our offerings and we launched delivery on demand in February. But what we are noticing for delivery, especially for us, Scott, is that, we are a very differentiated brick and mortar concept. We have maybe 700, 800 additional SKUs than our next competitor when it comes to accessories and other offerings. So what we are starting to notice is, customers really prefer coming to our stores. Our store traffic continues to go up month-over-month, quarter-over-quarter. I don't see that business line particularly growing exponentially, but I definitely see it holding stable here. And because we charge our customers a $9.99 fee for that delivery on demand initiative that we've launched, it has not hampered our gross margins. In fact, we are doing better on delivery gross margins than previously before announcing that delivery on demand initiative. So overall, delivery remains a very small part of our business. But because our concept is so differentiated, we are sort of the  (ph) of cannabis where we have a lot of consumers come in and they love to browse through our stores. And we like that too, because it helps our average basket go up when they come shop in our stores. But we are more inclined to continue to develop our brick and mortar concept, because it's very differentiated from any other retail offering that's out there today. My first question is, you continue to outperform the industry in terms of same store sales growth quite substantially. I was really hoping someone ask me this question, because I'm so excited to report our 23% sequential increase on same store sales growth. This is followed by another 23%, 24% that we put out in the quarter prior to this. But we are becoming more and more known in the Canadian retail landscape, Frederico, and that's just equating into -- while others are having stream difficulties are not facing fierce challenges, our same store sales continue to rise. I don't have a crystal ball to see what it would look like towards the end of the year or next year, but we are already very comfortable to where this level is at today and we see the opportunity to slowly start to increase our margins again if we have to. And particularly exciting part for us Frederico was, April saw -- the broader market in April saw only a 6% same store sales increase, while on a daily sales run rate basis, we saw a 24% increase. And like I said, because our concept is so differentiated and we are the only group in Canada that has that leverage with accessories, which we are further leveraging into our system. And then when the time, Frederico, because we have such a diversified ecosystem we can go back to more CBD opportunities, we can go back to more accessories opportunities. While the capital markets are taking a breather or more than a breather, I should say, we've kept our interest on our business line that's absolutely exploding. But when the time is right, we can always go and get more margins in our ancillary business lines, which we don't even have today. As you can clearly see, we've slowed down on international M&A and very much purposely – purposefully because we have a reason to do so. We know what we have in our heads in terms of our brick and mortar concept, which is today the leading concept in Canada, but tomorrow I see that as a leading concept in United States and then globally, potentially in Germany as well. But I don't see us going there right now, because our brick and mortars is not only stable, but it's definitely on the rise. My second question is, you mentioned your M&A strategy for e-commerce platforms. Just given the macro environment there in terms of session fears, inflation, and capital becomes scarcer. So, Frederico, biggest of our network and because of our deep roots in cannabis since 2009 when the company really started, we know all the players in North America and a lot of the players in Europe. I've been pushing some of the deals that we've had in the pipeline and the other groups are patiently waiting, because they still want to do a deal with High Tide, but I just can't justify where we are sitting at our stock price currently in the market to go be doing some bigger deals on the e-commerce side. If I saw that it was an opportunity that we could lose, I would have expedited those deals, but I don't see that happening because there's not many other groups that are out there that are even competing with us at this level on the e-commerce front. As you can see, we are very responsible, we are doing highly accretive deals for our shareholders, we are consolidating the Canadian market typically at a 3.5 time multiple of EBITDA, which we basically set the -- we set that price in the market. Canada is on the raise for us, has a lot of opportunities in the pipeline that we want to monetize and take advantage of. There's multiple groups that are the  (ph) extremely competitively extremely reasonable levels where our stock is trading right now, and they want to come join the High Tide family. So we're going to continue looking at those opportunities and a couple of very selective e-commerce opportunities, which I just don't want to pass on. If we take your latest quarter retail revenues of $80 million, of which we assume $59 million are Canadian retail sales and your Cabana Club memberships of 550,000 active members. But then again, don't quote me on it, because I don't have the data in front of me, but that number seems quite low. So at 550,000 you can argue about 60% to 70% members that are very active in making transactions on a regular basis. So if you use a percentage of those membership to come up with the basket value, it probably gets to very close to what we're generating right now. I wouldn't know how much members are spending at our stores versus other stores, but I can definitely tell you one thing, Matthew. That number has now gone north of 90%, we're actually sitting at 94%. Our US CBD is all sold online, with the exception of NuLeaf doing about $2 million to $3 million in wholesale revenue. And US CBD amongst all CBD players, when inflation is soaring at the rate it is, people are more concerned about filling their gas tanks and getting food on the table than buying pipes, bombs and CBD products. So we're seeing the same type of softness in international e-commerce on all sort of disposable income going down, nothing out of the ordinary one way or the other, it's very much in line with what the global trends look like. I also feel that the long term trajectory for e-commerce, which is practically all of our CBD business is very, very strong. So we are going to continue looking at more CBD businesses and we're going to continue looking at more online CBD businesses, because that make a lot of sense to us, because we already have platforms such as NuLeaf that can service the United States through its facility -- it's cGMP certified facility that we have in Denver, Colorado. So our cannabis sales in Canada remain very strong and increasing as we play in the value segment, which is very appealing to consumers in North America, especially right now with everything that you pointed out around inflation. So from that perspective, we practically -- we couldn't have timed this better in terms of the timing of our discount club model. It's now a brick and mortar business, it has now become 78% of our overall business. This has gone up from, I believe, 72% or 73% to 78% now. I don't want to put them out on this call, but you will see them come through, through some of the press releases that we have planned once these plans are mature in the not too distant future. But what we can control is entering new markets, because our brands are extremely high quality and they're very well recognized in the markets where we operate. So we are now going to open up new market opportunities to continue momentum where we are seeing some softness, but our core business, which is our value concept in Canada, again, I couldn't have timed this better. We're very, very happy as the business is growing. We are continuing to see same store sales growth, which is 78% of our business. Second question here, let’s switch gears to the e-commerce and accessory side of the business. In prior calls, obviously, you had mentioned several times that supply chain issues were a factor there. We all know that and -- that can be clearly seen in our depleting wholesale revenues, our wholesale has come down to close to $1 million from almost $2.5 million or even less now. It's now taking seven to eight months and it's exaggerated a little bit in China because of what is happening there, we are trying control having the zero COVID policy. So what we are doing, Andrew, in the meanwhile is, we're prioritizing our entire business to service Canna Cabana, because that is the core of our business, that's where we want to win the landscape, we want to make this into a global concept. So we have still managed to keep Canna Cabana fully loaded with accessories, but that has come at the expense of our wholesale business, and that has also come at the expense of certain online e-commerce platforms servicing consumers with consumption, accessory. Although to a much lower magnitude, it is not a big deal on the logistics side because, again, it's retail for us and we prioritize retail over wholesale. CBD has not been affected by supply chain, it's all locally produced, so there's no issues there with supply chain. On the question of Delta 8 and Delta 9, look, Andrew we are an opportunistic company, we made a conscious decision when we initially purchased a NuLeaf and FAB that maybe we didn't -- we were unclear about the regulation around Delta 8 and Delta 9. So we are basically bringing these sales back to life starting with Delta 8 and getting into Delta 9, we have made a conscious decision to not sell these products in 12 states that are identified that don't allow them to. I would now like to turn the session back over to Higi Tide's Chief Executive Officer, Raj Grover for final comments. Thank you, operator, and thank you to everyone for your interest and continued support for High Tide."
}