{
    "symbol": "KO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 10:05:06",
    "content": " Instead of trying to forecast and predict the many directions things could move, we are focused on delivering on our key objectives: firstly, pursuing excellence globally and winning locally through relentless consumer centricity to continue the top line momentum; secondly, investing for the long-term health of the business and raising the bar across all elements of our strategic flywheel; thirdly, generating US dollar EPS growth to deliver value for our shareowners. Your line is open. And what will remain is a good, strong underlying momentum of our business that has been powering the last five years, and we are confident we'll continue to power the years ahead at the sort of level of top line relative to the long-term growth model that we have previously talked about. Your line is open. Your line is open. Your line is open. We're going to see continuations into 2023 of different sorts of packaging options, whether they be drives around returnables, whether they be drives, which obviously tend, given the economics of returnables to have lower price points, whether you see, for example, in emerging markets, the greater use of 1-liter packaging instead of larger packaging for at-home occasions, we're going to continue to see a lot of opportunity to push forward right across the world with affordability options. Your line is open. Your line is open. Your line is open. Yes, we believe we're going to be more competitive because we understand the consumers and we're going to gain share, but we can lead the beverage category, deliver more growth for you and be a disproportionate share of your rate revenue growth relative to other categories,' which is what, for example, was demonstrated last year in Europe, where I think we led -- we added more revenue growth than any other system for retailers in Europe last year. Your line is open. Yes, package mix will continue to be a factor, as it has been in previous years and prior to the pandemic, Clearly, as we pursue a dual strategy of keeping consumers in this franchise with affordability and looking for premiumization opportunities, the two can somewhat offset each other, one's dilutive, one's accretive, but they're both valuable strategies that need to taken forward. Your line is open. Your line is open. Your line is open. Your line is open."
}