{
    "symbol": "AMX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 01:20:04",
    "content": " Well, the first quarter of 2022 was marked by sharp increases in interest rates very much across the board with five-year U.S. inflation rates nearly doubling and ten-year rates rising from 151 to nearly 250 as concerns of our growth inflation rates led investors to revise or projections regarding future monetary policy moves by the Fed and other Central banks. Both prepaid and postpaid revenues maintained the rough pace at 8% and 5.2% respectively on a sequential basis, much higher than the 1.4% and 1.0% rate posted the year-earlier quarter. Broadband service revenue expanded faster in the Dominican Republic 15%, Peru 11% and Eastern Europe 8%, while Corporate network revenues rose more rapidly in Eastern Europe 23%, Brazil 16% and Colombia and the Dominican Republic 12% each. The market is very competitive, both I think what we have been doing is that these last quarter, I think it’s good, it’s still growing in postpaid and postpaid very good growth, 300,000 also growing in prepaid and it’s been good on beyond the Skype I’m talking about peak I think on the peaks – on the peak side, we grow 20,000 in broadband one-off, and it’s very important. I think we finally close OE, we have around 12 million customers, almost 5 million in postpaid and the rest in 18 in prepaid BRL2 billion and what I can tell you is that we have been working on preparing our network and we are ready to take all these customers and of course we’re going to have very good synergies. Thank you very much. I think 5G is going to give us a better ARPU to our postpaid customers, I think we’re going to have more customers and that ARPU in 5G saw very still in some countries that we need to, that we have provide some frequencies hope they do what soon bought in the countries where we already have a Spectrum. Thank you very much. So, we can check on more detail, but I don’t think it’s any difference between Mexico and the other countries are could be a little bit different depending on the competition but our overall what the strategy on 5G is give more for more and I’m to try to upgrade our 4G or 3G customers to 5G and that’s more or less what we have. Thank you very much. Thank you very much."
}