{
    "symbol": "ASTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:04:06",
    "content": "  Operator: Good afternoon, and welcome to Astra's Third Quarter 2022 Financial Results Conference Call. Good afternoon, everyone, and thank you for joining us for Astra's third quarter 2022 quarterly results call. During our call today, we will reference non-GAAP financial measures, which we believe to be useful to investors as our management team uses these non-GAAP financial measures to plan, monitor and evaluate our financial performance. These forward-looking statements refer to future events, including Astra's future financial outlook. When used in this call, the words anticipate, could, enable, estimate, intend, expect, believe, potential, will, should, project and similar expressions, as they relate to Astra are as such, a forward-looking statement. These forward-looking statements are subject to a number of risks and uncertainties, and as a result, Astra's actual future results and performance may differ materially from those discussed in this call. We encourage you to review our filings with the SEC in which we describe the factors that could cause actual results to differ materially from our current expectations, including those updated risk factors included in our quarterly report on Form 10-Q. Finally, I would like to remind everybody that this call will be recorded and will also be made available for replay via link available on the Investor Relations section of our website. With that, I would now like to turn the call over to Chris Kemp, Astra's Founder, Chairman and Chief Executive Officer. I'm excited to also have our incoming Chief Financial Officer, Axel Martinez; and our Chief Business Officer, Martin Attiq, on the call with us today. During this call, we will review our operational and financial performance during the third quarter, review guidance for Q4 and provide an update on our launch services and spacecraft engine businesses. Now during the third quarter, we made some difficult but necessary decisions, which will allow us to focus on our near-term priorities with the appropriate level of resources, while also extending our financial runway. In the past quarter, we've announced 237 cumulative committed orders of the Astra Spacecraft Engine as of today, an increase of over 130% last quarter, including orders from Airbus OneWeb Satellites, Maxar and Astroscale, among others. We continue to make progress towards the development of Launch System 2, which I'll speak about more in a moment. We continue to build out of a new 60,000 square foot facility in Sunnyvale, California, dedicated to the production ofAstra Spacecraft Engines. We strengthened our core leadership team, including hiring Axel Martinez, as our new Chief Financial Officer; and , as our new General Counsel. And we ended the quarter with approximately $151 million in cash, cash equivalents and marketable securities. This quarter, with the backdrop of continued macroeconomic and geopolitical uncertainty, increasing inflation and interest rates and equity market volatility, the team has prioritized resources on our core businesses. Specifically, we are focusing investments in delivering reliable spacecraft engines to our customers, which is rapidly becoming an important revenue stream for Astra, while focusing launch system development on reliability and a successful first flight of Rocket 4. We continue to explore opportunities to develop or partner in the development of our space services offerings, as it remains a significant part of our long-term business strategy. As a reminder, last quarter, we announced that we have increased the design point of Rocket 4 and to deliver up to 600 kilograms to mid-inclination low Earth orbit over the course of the product life cycle. We focused our resources on designing and delivering our new launch system with improved reliability and operational excellence, increased payload capacity and an increased launch cadence. Since our last earnings call, we have completed the first design loop of Launch System 2, including Rocket 4, the ground system and software. We provisioned critical test infrastructure, including upgrades to the first-stage engine test end and commission new launch system, valve test stands and other test infrastructure at our Alameda factory, and we designed and released tooling required to manufacture the Rocket 4 stage propellant tanks. We expect to continue releasing important details and development milestones in the coming weeks and months, including the release of our first payload user guide for Rocket 4, which will allow customers to better understand the capabilities of our rocket and features of our launch service. As we discussed last quarter, Astra leverages its mass manufacturing capabilities to develop and produce products required for the next-generation satellites and space services. While our launch services will bring customer payloads to space, the Astra Spacecraft Engine is a key space product that delivers satellites into their final orbits, helps them maintain their orbits, avoid collisions and ultimately deorbit them at the end of their life to reduce space debris. Since the last earnings call, we've announced an additional 134 committed orders for the Astra Spacecraft Engine since June 30th, 2022. This adds up to 237 cumulative committed orders since July 1st, 2021, inclusive of the 14 committed orders acquired at the part -- as part of the Apollo Fusion acquisition. As a reminder, orders are delivered to customers over a mutually agreed time line, which is typically 9 months to 12 months from contract signing. First, I am pleased to join you all on my first earnings call as incoming Chief Financial Officer of Astra. I am excited to bring what I've learned from scaling hyper-growth technology companies, including Google and Uber to Astra, as we work to build a sustainable and scalable business. Revenues in Q3 were $2.8 million, driven by the delivery of spacecraft engines, as we now have completed the second Astra Spacecraft Engine program. This resulted in our first GAAP quarterly gross profit since Astra's founding, totaling $1.7 million. GAAP operating expenses included R&D expenses of $32.8 million, reflecting our continued investments in our core products. Sales and marketing expenses of $4.1 million, reflecting investments in ongoing sales efforts for launch services and our spacecraft engine. And G&A expenses of $19.2 million, reflecting ongoing investments in key systems and technologies, among others. Now let's talk about all of the one-time items during Q3, 2022. The reorganization, together with a sustained decrease in the Company's share price, existing of substantial doubt about the Company's ability to continue as a going concern and macroeconomic factors resulted in the Company's determination that triggers were present, therefore, indicating that the carrying amount of certain company assets may not be recoverable. As a result, we recorded a non-cash impairment charge on long-lived assets of $70.3 million related to property, plant and equipment, a $58.3 million impairment of goodwill, a $2.1 million impairment of our trademark assets; and a $2.7 million charge related to definite-lived intangible assets. Additionally, a loss on change in fair value of contingent consideration was $11.9 million, as a result of higher revenues forecasted in estimating the fair value of contingent consideration. As a result, total one-time items for the quarter were $142 million. Given these one-time non-cash items on a GAAP basis, our third quarter net loss was $199.1 million. On a non-GAAP basis, third quarter adjusted net loss was $45.2 million. Q3 adjusted EBITDA was a loss of $41.4 million, a $7 million improvement compared to last quarter. We ended the quarter with cash, cash equivalents and marketable securities of $150.5 million and no debt outstanding. In addition, we also continue to evaluate various sources of capital, as we carefully manage our financial runway. On October 6, Astra received a deficiency notice from NASDAQ, as our per share closing bid price remained under $1 for 30 consecutive trading days. While we cannot directly control short-term market volatility, we are taking measures to increase top line growth, decrease expenses and add capital to strengthen our balance sheet, which we believe will ultimately be reflected in our share price. As Chris mentioned, we focus our operating plan on the delivery of spacecraft engines and the successful fresh flight of Rocket 4, allowing us to optimize our operating plan and increase our financial runway amidst market volatility. As a reminder, our fourth quarter guidance and guidance is subject to various important cautionary factors referenced in the section below entitled Forward-Looking Statements in our Form 10-K, including risks and uncertainties associated with the ongoing COVID-19 pandemic and the decision to discontinue the product of launch vehicles supported by the Launch System 1.0. In the fourth quarter, we currently expect adjusted EBITDA loss to be between USD42 million and USD45 million. As we shift our near-term priorities to focus on our space products and launch services businesses, our guidance will focus on the metrics that we use to manage our business, thus, we will not be providing guidance on depreciation and amortization, stock-based compensation and cash taxes at this time. On the Astra's Spacecraft Engine, you should continue to expect quarterly variability in shipments until we began ramping up production to support committed customer deliveries beginning in Q1, 2023. As of today, we have cumulative committed orders for 237 Astra Spacecraft Engines, including 14 units we acquired with the Apollo Fusion acquisition on July 1st, 2021. The vast majority of our spacecraft engines have been ordered in 2022, and we continue to see strong customer demand for our spacecraft engines. As a reminder, spacecraft engines are typically delivered 9 months to 12 months from contract signing, and Astra recognizes revenue only upon delivery of the spacecraft engines to our customers. We continue to expect the remainder of 2022 and 2023 to be transformative periods for Astra, as we further develop our new launch system and scale production for our spacecraft engines. Before we conclude the call, I'd like to personally thank all of the Astra employees, who have been impacted by the head count reduction. And finally, I'd like to thank Kelyn for her leadership and helping Astra become a public company and our finance organization's hard work, as we've made it through this transition. So the agreements with Airbus OneWeb Satellites, and I've got Martin in the room, so I'm going to let him provide some more color on that. As folks know in the market, Airbus OneWeb Satellites provided the OneWeb Gen 1 satellite buses, and they have not yet made a determination on who's going to supply the -- or has not been announced, who's going to supply the OneWeb Gen 2 buses. I think in the past, you had mentioned -- you did -- you submitted something about the spectrum and seeing spectrum, and it sounds like you're sort of deemphasizing that now. I don't recall the details of the original plan, but -- because wondering if there's any sort of like residual value that you can sort of salvage with the spectrum that you had, I think, wanted before. And I think one of the things that we tried to make clear here is that space services is the North Star for the Company, and some of the space technology and the space launch services are enabling of that long-term vision. But given the contracts that we have on hand for both spacecraft engines and for launch services, given the current economic climate, cost of capital, availability of capital, it's pretty clear, our focus should be on delivering for customers that have purchased spacecraft engines and launches. Our plan, as Chris mentioned, right, is to focus our operations in our top 2 priorities, which is the spacecraft engines and the development of the new launch system. Like as you know, many companies are particularly with capital markets being what they are, what's happening to the stock market, companies are revaluing their assets. Over the past 1.5 years, we've seen -- that product becomes space qualified, and that team has been transitioned to a team that's focused on quality, engineering and production and scale. And so it's a process that you'll see with the development stage company being brought into a company, where we have customers like Maxar, Airbus OneWeb Satellites that really demand the level of focus on quality and scale that you're not going to see it a small early-stage company. And we're through that focus, I think we're going to give the team here a new level of energy and intensity around flying Rocket 4 and having that flight work and on delivering these spacecraft engines for our customers. And I think, frankly, it's going to energize the team to have that focus, and we're pretty excited about it, frankly. When we talk to employees and we talk to customers, frankly, one of the most important things is that we have the time to deliver on the contracts that we have, we have time to come back and fly Rocket 4 successfully. And so when we set out to do this, we looked at what gets us well into 2024 from a runway perspective and it required some tough choices to be made, and I think the team understands that."
}