{
    "symbol": "ASTR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 22:10:03",
    "content": " We announced 278 committed orders as of today, March 30, including customer contracts with Airbus OneWeb Satellites, Astroscale, Maxar Technologies, and LeoStella, among others, representing approximately $77 million of contract value, the majority of which is expected to be delivered in 2023 and 2024. And in 2022 and early 2023, in spite of the challenges, we stayed the course and completed the buildout of our new Rocket 4 and spacecraft engine production lines and invested heavily in the people and equipment needed to increase the quality and reliability of our products and services. GAAP operating expenses in Q4 included the following; R&D expenses of $29.1 million, encompassing our continuing investments in our core businesses, plus cost related to our spacecraft engine, customer delivery; sales and marketing expenses of $3.9 million, reflecting investments in ongoing sales efforts for launch services and our Astra spacecraft engine and G&A expenses of $24.5 million, including ongoing investments in key systems and technologies among others. Fourth quarter, capital expenditures were $7.6 million, and primarily related to the continuing investments in the development of launch system 2.0 and the delivery of our Astra spacecraft engines. And I think that's all we've shared publicly, and I think the investments that we've made in CapEx, both in the rocket production line and in the spacecraft engine production facility, we're critical for meeting these customer contracts that we have and bringing the cost of these products down to where we can compete in the market where we want to compete, which is kind of with a scaled launch services product. And that is why we have made the investments that we've made in the new Rocket 4 production line and I hope you're all able to come out and see us at Spacetech Day on April 25, because you'll see that, you'll see this -- you'll see the Rocket 4 production line, and you'll see the investments we've made to scale production of the launch vehicle."
}