{
    "symbol": "ABST",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-23 23:03:05",
    "content": " On as-if combined basis, our ARR is now $210 million versus $123 million ending fiscal â\u0080\u009821 and adjusted EBITDA is $56 million, up more than 75% from the prior yearâ\u0080\u0099s $32 million. We introduced one of our first product integrations when we incorporated our application resilience technology with NetMotionâ\u0080\u0099s network resilience capabilities, now rebranded as Secure Access, our network access solutions uniquely give organizations the ability to support remote worker productivity, with an engaging user experience, while improving the security posture with its zero trust capabilities, and bringing the concept of resilience into the high growth zero trust market. Our customer success team delivered the best retention metrics we have ever seen across all of our products, which contributed to record levels of enterprise and government net dollar retention, and continued -- our continued investment in our OEM and distribution channels was a key driver and growing new logo ARR by 70% in fiscal â\u0080\u009822 versus fiscal â\u0080\u009821. ARR grew in fiscal â\u0080\u009822 with -- ARR growth in fiscal 2022 was driven primarily by our enterprise and government sector, which grew 17.3% of 10.7% in the prior fiscal year, partially offset by the performance in our education vertical, which still grew a healthy 11.7% but faced the tough comp. The strong ARR growth was composed of record new logo ARR of $14 million versus $8.5 million last year, and net dollar retention that grew to 108% from 106% at the end of fiscal 2021. Looking at our Q4 results, adjusted revenue was $54 million, up 12.7% from Q4 fiscal â\u0080\u009821 impacted by the tough education comp, and fewer Secure Access conversions, the solid revenue performance was driven by continued growth in our total ARR base. For fiscal â\u0080\u009823, we expect adjusted revenue to be in the range of $241.5 million to $246.5 million, representing revenue growth of 14.8% to 17.1% year-on-year."
}