{
    "symbol": "ABST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-10 22:57:07",
    "content": " I would also like to remind everyone that this conference call is being recorded today Tuesday May 10, 2022. With me on today's call are Christy Wyatt, President and Chief Executive Officer of Absolute Software; and Ron Fior, Interim Chief Financial Officer. Before beginning our formal remarks, Absolute Software would like to remind listeners that certain portions of today's call may contain forward-looking statements that reflect current views with respect to future events and conditions. Any such statements are subject to assumptions, risks, and uncertainties that could cause actual results to differ materially from those projected in these forward-looking statements. Any forward-looking statements contained in today's conference call are made as of today's date, Tuesday May 10, 2022. And Absolute Software undertakes no obligation to update or revise publicly any of the included forward-looking statements whether as a result of new information, future events, or otherwise, except as may be required by applicable security look. For more information on the assumptions, risks, and uncertainties relating to these forward-looking statements, please refer to the appropriate section of the Company's most recent MD&A, which is now available on the Absolute Software's website and will also be available on SEDAR and EDGAR. Education ARR represented 22% of the total ARR and grew by 7% year-over-year, which is consistent with seasonal education purchasing and is also a function of the normalizing demand of COVID peak during the last March quarter. As a part of that expansion, we added Nuvias as our DACH distributor to assist us in reaching customers in the Benelux region and more recently Orca technology in Australia and New Zealand. As a result, we exited the quarter with 13.6 million active endpoints connecting to our cloud services, an increase of 2 million devices year-over-year. Since it has been about a year since the announcement of the NetMotion acquisition, I thought I would provide an update on the critical development work happening across the two key product segments within our business. Absolute secure endpoint, which is how we now reference our Absolute Visibility Control and resilient products and Absolute Secure Access our VPN and ZTNA solutions previously known as NetMotion. This quarter, we launched Insights for Endpoints offering IT and security teams, the ability to leverage their absolute data, to assess devices, applications, and data inventory performance and security trends across their entire device population. One of our customers, a financial institution in Texas, acquired Insights to monitor and manage the health and compliance of critical security controls, including SentinelOne, Tenable and CrowdStrike. You may recall last quarter I shared with you details about one of our customers who experienced a ransomware attack and how we were able to leverage our unique connection to the device, even while it was in a compromised state to remediate the risk and restore the device without requiring a rebuild of the system. This quarter, we launched a new offering called Ransomware Response, anchored by our patented self-healing technology that can communicate with and control the endpoint to restore health and assist in recovery. We've seen strong customer interest, including one new customer who was previously hit by an attack in which they were unable to quickly recover. And they are now looking to Absolute, to monitor and maintain the health of their critical endpoint security solutions and to respond if or when a second attack occurs. We continue to invest in the rapid expansion of our application persistence catalog, which today lists 81% more persistent titles than this time last year. And in parallel, we are enabling new Application Persistence as a service partners with the ability to integrate their applications independently with the Application Persistence platform, which leads me to my second update on Absolute Secure Access. In our Secure Access portfolio, we have completed our integration with the Application Persistence platform, making it the industry's first and only BIOS-enabled, self-healing, resilient ZTNA solution. By resilient ZTNA we mean that it is not only integrated with APAS, but also that it has a resilient deployment architecture, and expanded network in ZTNA policy intelligence. In the first few weeks of availability, we had more than 50 customers activate the self-healing feature. One large construction firm that specializes in standing up major infrastructure projects is leveraging our resilient zero trust capabilities to ensure access permissions are being validated as employees move between networks and as a result, they are eligible for cybersecurity insurance discounts. Our Secure Access portfolio also achieved two critical security certifications, SOC 2 and Common Criteria EAL 4+. By achieving these certifications, we are conveying to our customers even more confidence that these capabilities have gone through rigorous standards based testing and review. We are very pleased with the progress of this integration, as well as the momentum we are seeing across the industry. In Q3, we were recognized in Gartner's Market Guide for Zero Trust Network Access. And finally, we were honored to be recognized in G2's 2022 Best Software Awards for the Best Security Products list in the Endpoint Security category. Many of you may be familiar with Ron as he was an advisor for Absolute a couple of years ago, and was instrumental in the success of our NASDAQ listing. As a reminder, we are reporting revenue on an adjusted basis that excludes any IFRS purchase accounting impact on deferred revenue. In addition, our year-over-year comparisons are based on an as-if combined basis that concludes the net motion results of a year ago period in fiscal 2021, but does not factor in any U.S. GAAP to IFRS adjustments. Adjusted revenue was $54.5 million for Q3 fiscal 2022, up 18% from the prior year on an as-if combined basis from Q3 fiscal 2021. At the end of Q3, approximately 70% of the secure access, ARR portfolio was on subscription arrangements up from about 66% at the end of Q2. Total ARR came in at $202.9 million as of March 31, 2021 16% year-over-year growth on an as-if combined basis. Recall that unlike revenue, ARR is not impacted by the IFRS revenue accounting requirements and is free from the complexity and periodic distortions found in revenue. The solid overall ARR growth was driven primarily by continued strength in enterprise and government, which grew a record 18% year-over-year on an as-if combined basis. We see this being reflected in improving enterprise new logo ARR growth and net dollar retention, which I will talk about in more detail shortly. Now turning to education, if you recall, Q3 of 2021 marked the high point in COVID-related surge spending and saw education ARR growth of 35.3%, that period. As we enter the two seasonally strong education quarters and see normalized comparisons, we expect to continue to see stable ARR growth in education. New logo ARR was a solid $3.2 million, up 5% on an as-if combined basis from a year ago. Adjusted EBITDA for Q3 was $13.8 million, a margin of 25% of adjusted revenue. As a reminder, cash collections generally lag ARR growth by a quarter. That said, we expect operating cash margin to continue trending above adjusted EBITDA, though, there will be seasonal fluctuations between the quarters. Taking a look at the balance sheet, we ended the March quarter with $69 million in cash, up $8 million from the prior quarter based on our strong cash flow from operations, including debt service and dividend payments. With respect to operating expenses, we continue to increase our investment in product development and our go-to-market capabilities to take advantage of the growing opportunities to work from anywhere and ZTNA. However, as we have discussed in previous calls, adjusted revenues in the first three quarters of fiscal 2022 have benefited from the accounting treatment of maintenance to subscription migrations that destroyed the revenue ramp. Absent these migrations, adjusted revenue guidance call for continued sequential increases to revenue in line with the growth in our ARR base. Please recall that our adjusted revenue growth rate guidance for fiscal 2022 and our other year-over-year growth metrics are presented on an as if combined basis and are calculated based on the combined company fiscal 2021 financials, and do not include any adjustments for purchase accounting or GAAP to IFRS conversions. As of March 30, 2021, the remaining value of deferred revenue write-down that we will be taking going forward over future periods is approximately $4.6 million. The deferred revenue write-down was $5.3 million in Q1 fiscal 2022, $3.9 million in Q2, and $2.5 million this quarter, and will drop significantly as we enter fiscal 2023. With that, we appreciate your time and support, and we’re glad to open the call for any questions. Ladies and gentlemen, at this time, we’ll begin the question-and-answer session. Please go ahead with your question. So the nature of the conversations at the customer level, what you’re doing to aid the sales force, I know you made some changes there to capitalize on that. And then, ultimately, how that’s going to translate to financial metrics as you become more strategic. We’ve talked a lot about the increased spending around zero trust, but that whole shift is actually shifting a lot of focus on endpoint security as a whole. And so what we’re finding is that the opportunity to go in and talk to customers about funded zero trust projects, things that we know are in their roadmap in the next 18 to 24 months. And I think that’s why, these are such – there’s such a nice sort of complementary nature to these two pieces in using self-healing resilient ZTNA, they also see the ability of self-healing security. And then start to think about the application of resilience onto other products, and then vice versa in customer areas where we’re actively already engaged with them on healing their VPN or other ZTNA solutions, we can show them a better path. I think Gartner says, it’s going to go from $820 million in spend this year to something like $1.6 billion in the coming years. What we’ve done to enable the sales force, we’re doing – we continue to do a lot of training around force management. We’ve continued to build out both the demand generation function, as well as kind of putting together the integrated customer story. This is – as we kind of go into Q4, it’s a nice moment for us, because we have all of the connecting to the platform and we start to be able to tell that bigger picture story about how resilience and resilience ZTNA can also work together. So we’ve seen some nice lift, I think, in both the pipeline as well as in some of the results. I mean, I think if we take a look at the opportunity ahead of us, we see so much more, as we move into – closer into FY2023. And maybe just as a quick follow up for Ron, obviously, nice to see cash flow in the quarter, raising revenue and EBITDA guidance. Just curious, I think you had some comments about cash flow I may have missed, but how to think about cash flow for rest of the year and bigger picture on capital structure, just how you’re thinking about options that you’re considering in servicing the debt. I understand that you’re in the interim CFO position, but it’s a question that we often get from investors in terms of right type of capital structure in servicing the debt. Well, in general, obviously we feel pretty good about our ability to generate cash. I mean, you’ve seen it very consistently over this last year or so. And even before that we generate a lot of cash on a regular basis and continuing as the company continues to grow, we expect that amounts to in fact, increase. I mean, our coverage ratio is declining pretty significantly just on a naturally – just as a natural function of our growing EBITDA and our growing cash flows. So at this stage, we’re obviously going to keep an eye on it. We’re going to be very careful and with the interest rates rising and everything else like that, but that’s really where we are right now today. If I wanted to add a moment to that, I think we started out at the beginning of this year talking about the flexibility that we wanted, but also saying that we were very comfortable with our ability to service the debt and continue to generate cash and invest in growth. And I think as we’ve gone through the year, we’ve demonstrated our ability to be able to execute across all three of those. And so, maybe longer-term when we’re in a less volatile environment, we could look at other more creative ways. Please go ahead with your question. I guess, Christy, just curious, you’ve been calling out ransomware incidents and how you’ve helped some customers dealing with this. So I think while we’ve talked a lot about self-healing security and the capabilities of the platform, ransomware was an interesting opportunity to really put it in context of something that customers are struggling with each and every day. And so, I think I mentioned a little bit earlier that today we see a ransomware attack happen almost maybe once every 11 seconds, we predict that it’s going to accelerate to something like once every two seconds. And so while people think of us as sort of self-healing security, really helping them understand what having that undeletable persistent connection to that device can mean. We can remediate some of the risk and we can oftentimes get that device kind of back into a healthier state where it can start taking care of itself again without having to rebuild it from iron, which is something that nobody really wants to do, especially when users are remote. And so it really has shown a bright light on the power of self-healing, the power of Absolute reach and our scripting capability and having that lifeline to those devices. And so being able to kind of package that up very neatly and being able to go and have that conversation with customers large and small, I think ransomware response as a very horizontal product. And just with the strong enterprise quarter, just wanted to clarify was both, I guess, secure endpoint and secure access, above expectations. So, we’re still very early on in cross sell, because as I said, this is the first quarter we have the platform integrated with Persistence. Although I think, we feel very good as we sort of look at the pipeline as it’s combining in front of us. We still have secure access operating as a specialist team within North America, it’s more integrated internationally. But we are seeing a lot of customer interest, and I would say we see that accelerating as we come through the second half of the year, where customers are really leaning in and wanting to understand from whichever side of the business, they started on the capabilities of the other side. And again, really being able to leverage the self-healing ability within the previous NetMotion client, the secure access products is a really great way of showing the power on both sides. I know education’s a smaller part of the business now, and it’s lapping some tougher growth comparisons. I mean, I think that’s about in the right neighborhood, I think in this particular. And so, but I think, we continue to see a lot of demand. We continue to see a lot of growth, and that is somewhat unique to us as well, with some of the new restrictions on the ECF funding. And I think one of the benefits of Absolute is, we’re actually in the hardware. But again, I think we see it turning into a nice run rate, healthy business. So, we don’t see it turning back to the pre-pandemic state. Please go ahead with your question. So on the product integration initially I think we’ve sort of laid out a path for, I’ve talked about where we see the first three touch points being, the first of which is what we’ve already accomplished around the integration with the Persistence platform. The second we've talked about is really, how the user experience starts to touch one another and you shouldn't really think of that as a single common console or sort of one, we don't need to integrate the solutions top to bottom, but being able to look at the data holistically so we can think about risk holistically. We can think about the different pieces of telemetry that coming from the various different parts of the platform from the bios, the operating system, the applications on both sides and being able to sort of view a or have a view of risk, and then being able to take action against that risk. And so that's really the third step, which will be how do you invoke action and set up rules that are enforceable across all of the different places where we have the opportunity to influence the device of the behavior. And you'll start to see more interesting milestones as we go through next year, along that sort of data strategy and roadmaps that we've talked about for quite a while now. On the selling team, I think one of the interesting pieces is really being able to use the data to tell that story. And if you do get a chance to sort of take a look at one of the – I think it's in the company overview, that's on the website right now, and it'll be in our upcoming investor presentations. And that's a very powerful tool for the selling organization, both in dimension as well as in introducing some of these new use cases to our existing customers. I was just curious, you've obviously seen a fairly significant bump up and you tested EBITDA margin guidance since the start of the year. In this last quarter, we will obviously, as we become more normal and theoretically more normal, in our office posture and those kind of things, if people are coming to the office, we're going to have to spend a little bit more on office issues and things like that. That seems like that's gone an upward trend, so we're going to continue to be balanced, but we expect a good solid 20% plus EBITDA margin. And then one last question on capital allocation, there's a prior question on kind of the debt. And also with rates going up here, I believe the debts a variable rate, is it do you guys have interest and trying to lock it in at a fixed rate and then as well as just generally with what's going on in the overall markets and also your share price, is an NCIB also part of the consideration as you look at capital allocation. We have a quarterly, and we can in fact, look at locking it in over, shorter periods of time over, six months a year and do things to do that. But right now it is a variable rate loan yes, right now the interest rate is 7% and for this next quarter. And so a half – full percentage point of change would be the equivalent of $2.7 million on a full year and so a 0.5% is going to be, roughly half of that 1.3, 1.4. So we feel pretty comfortable that we can, handle those things at this point in time, but we'll obviously look for opportunities to see what makes sense. I think, right now we're very much focused on driving the business forward and continuing to invest as we wrap up the year and go forward. Please go ahead with your question. I think that it's coming from both our investment of direct sellers, as well as our expansion with our partners. We are continuing to invest and continuing to build up and you'll see us do even more as we go into next year and building out the channels and the direct selling capability in, all our international theaters with a number of our strategic partners and also resellers. And so I think we have part, a couple of the announcements we made on the earlier in the quarter was some new distribution partners, a more traditional distribution, especially within EMEA. We are also doing a little bit more in APAC starting to invest in regions like Australia, we're doing quite well in Japan, Latin America has always been strong for us and continues to be strong. It sounds quite broad because we are in fact a global organization, but we are quite focused when we think about the theaters we want to go into and which partners we're going in with. I never say never, but I don't think that's really our focus right now. We're always taking a look at the technology landscape and whether there is interesting partnerships for us, or aqua hires, or interesting tuck-ins that would grow our technical capability. So we're always looking, but we do primarily look at the next year as one of increasing investment into our roadmap. And so much we're doing to kind of bring those to our partner community that, I think, we have quite a lot on our plate right now. A year ago, we shared with you the strategic rationale around our acquisition of NetMotion to leverage our unique persistence and intelligence platforms into a new, large and growing market. And from that platform, we have a unique intelligence and data platform, which customers can now access through our Insights products."
}