{
    "symbol": "ABB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 09:22:03",
    "content": " But before we begin, I would like to draw your attention to the information regarding Safe Harbor notices and our use of non-GAAP measures on Slide 2 of the ABB presentation. And with that, I will hand you over to Bjorn and Timo to take you through our results. First, I was really good to see the customers remain very active. Our orders reach $9.4 billion, the highest quarterly level in recent years. These strong orders, and the top-line somewhat hampered by component shortages resulted in a book-to-bill of 1.35. Admittedly, it was supported by low corporate cost. But looking at operations, we had three business areas which performed well. But I expect this to improve from here on, that is of course, assuming external challenges do not escalate. We have a global imbalances in the supply chain, and now also the whole comprehensive COVID lockdowns in China. On that topic, I am pleased to see that both Tarak and Morten have come off to a running start in their new roles. Lastly, I'm pleased about the new buyback program. As mentioned, orders intake reached a record high level it was driven by strong development across most of our customer segments and all regions. And we saw a strong double-digit growth in the short cycle, the process industry related business as well as in service. Revenues improved at a good pace of 7% driven by positive volume growth, as well as good pricing execution. All business areas reported positive comparable revenue growth of between 99% to 11% except for robotic and discrete automation, which is where the supply shortages of semiconductors was the most notable. Again, we saw strong double-digit growth in all three regions. In the Americas there in important U.S. market increased by 46%, supported by all business areas. In Europe, most of the top 10 markets showed strong growth rates. That said, on the slide, you see that Germany improved by only 4%. It was good to see continued strength in China, which improved by 26% supported by all business areas. Let's turn to Slide 6, and the earnings outcome. Our gross margin was 32.7% in the quarter, which is a slight decline of 20 basis points from last year. This is primarily due to the divestment of the high margin Dodge business, but also due to a drop in Robotics & Discrete Automation. In total, we saw a slight improvement of 10 to 20 basis points to the margin when adjusting for the lower than expected corporate costs and divestment of Dodge. Overall, Q1 was solid start of the year. And with that, I hand over to Timo to take us through the numbers in more details. And as we go through the different business areas, this will be clearly evident. Here, we still saw a very strong demand driving orders to clearly above $4 billion with a comparable growth rate of 29%. With strength spread across all customer segments, we actually saw double-digit order growth in all of the divisions, including the newly formed service unit. Volumes also contributed, but were somewhat impacted by supply chain disruptions. Overall, it was yet another quarter with a book-to-bill ratio above one and the backlog increased to a record high $6.5 billion. I'm sure you remember that in Q1 last year, Electrification took prompt actions on pricing in order to set off the oncoming headwind from higher raw material prices, while still enjoying the benefits of low input costs due to hedges versus this stuff comparable from last year. The operational EBITDA margin declined 80 basis points to 15.4%, mainly due to subdued performance in distribution solutions business, while the team has continued to do a great job on tightly managing their price lists. Looking ahead into the second quarter, we expect similar growth rate as in Q1 and somewhat of a sequential margin improvement. Let's then move on to Motion, which also had a very high order level. Like in previous quarters, it is probably fair to assume some positive impact from customers preordering in the current inflationary environment. Neither did we see any slowdown in the strong customer activity towards the end of the quarter, nor in the early days of April. Comparable revenues improved by 9%, supported by both volumes and strong pricing execution, the semiconductor shortages started to ease somewhat sequentially, not least due to the implemented product redesigns, and the validation of alternative suppliers. This means that on higher volumes and strong pricing activities, we more than offset the missing 90 basis points, which the Dodge business contributed to the same period last year, as well as cost inflation from raw materials and freight. For the second quarter, we expect comparable revenues to grow at least at a similar rate, as in Q1, and margin to remain broadly stable with Q1. We now turn to Slide 9 and Process Automation, where we continue to see strong demand across most of the customer segments, particularly in marine as well as mining and metals. As a result, base orders continue to grow at a double-digit rate, while the total order growth rates 6%, weighted upon by the de-booking of approximately $190 million. Overall, the impact of semiconductor shortages was still somewhat less than anticipated. The operational EBITA margin of PI was 13%, up 200 basis points from last year. On Slide 10, we turn to Robotics & Discrete Automation. The demand environment continues to be very strong for RA and orders were up 60% on a comparable basis, driven by high customer activity in both divisions. In Robotics, both the auto segment particularly driven by EV investment in China, as well as the non-auto segments continue to be strong. At the same time, revenue generation continues to be adversely impacted by delayed customer deliveries caused by the semiconductor shortages. On a sequential basis, the supply situation deteriorated somewhat. Although the supply chain should remain strained, we expect the first quarter to be the low point for Robotics & Discrete Automation, assuming we do not see further deterioration of the China lockdown situation. Overall, the decline in volumes triggered under absorption of fixed cost in RA. Adding to that the impacts from inflation of input costs and freight, the positive contribution from cost and price measurement measures were more than offset and in total, the operational EBITA margin declined by 570 basis points to 6.7%. Looking into Q2, we anticipate some effects on RA's operation operations from the COVID related lockdowns in the Shanghai area. We expect the comparable revenue growth to remain negative, but the operational EBITA margin to sequentially improve. That said, when looking at the operations, I'm pleased to say that we successfully managed to offset cost inflation through the improved impact from higher volumes. The reduction of losses incurred in non-core businesses help margins by about 30 basis points, while acquisitions and divestments were 30 basis points diluting on a group level, mainly due to the negative impact from the Dodge divestment. On Slide 12, we move to the usual cast picture. And while cashflow tends to be seasonally softer in the first quarter, the negative $564 million from operating activities was a bit weaker than we had anticipated. Q1 cashflow also reflects a higher payout of employee incentives due to the strong financial performance in 2021, where Delta to the COVID year 2020 is particularly large, as well as approximately $170 million of cash paid for income taxes related to the E-Mobility and Turbocharging separations. I'm sure, you remember from our Capital Markets Day that we still have expected impacts from two large legacy projects in non-core. And during the second quarter, we expect to complete the full exit of one of our two main exposures left in our non-core business. This is likely to trigger a non-operational charge of approximately $200 million in restructuring related expenses, primarily relating to contract settlements. Hence, there would also be a corresponding cashflow impact when paid. This is still not absolutely certain, but I wanted to call it out, so that if it happens, it doesn't come as a surprise. As Bjorn also said, we are still confident that we will achieve solid cash flow for the full-year. And before I hand over to Bjorn, let me just update you on our active portfolio management actions. Regarding our planned listing of e-mobility, we continue to aim for completion during the second quarter, assuming constructive market conditions, i.e. On the other hand, we have this idea that we will not rush to make the final decision between a spin off or a sale of turbocharging or Accelleron as it is now called. But now, we are looking to make the final decision before the end of Q2 has also Bjorn mentioned at the AGM. So overall, despite the uncertain market environment, ABB is moving to the right direction. We are growing in the right businesses in line with our stability, profitability and growth strategy and continued improvement in our backlog gross margin is testament to ABB also improving long-term quality of revenues. And on that note, I would like to hand back to you Bjorn. And I will end with some comments on the sustainability on Slide 14, before I finish up with the Q2 outlook. We estimate that our products sold last year supported our customers to reduce their Greenhouse gas emissions by 11.5 megatons after the first year, which is a good start towards the target of at least 100 megaton reduction by 2030. It is not on this slide, but I also want to mention that we reduced our own CO2 emissions by 39% compared to the 2019 baseline. Finally, on this slide, I just want to mention that going forward, we will have a 20% weight of our ESG metrics in our long-term incentive plan. At lastly, on Slide 15, we take a quick look at our expectations for Q2. For revenues, I just noted that it tends to be seasonally stronger in the Q2 compared with the Q1. In this environment, we expect the margin to improve slightly quarter-on-quarter. And with that, I let Ansi take over to guide us through the Q&A. And with that said, let's now open up for Q&A. And for those of you who want to put through your questions through using the online tool in the webcast, there should be a field in the bottom right corner of the screen where you can type your question. So I wondered if you could talk about in the first instance to the dynamics in China, obviously lockdown, is going to affect everything. But I guess if you could give us a little bit more color around the end markets and the divisions, that would be helpful. And I -- in particular, would like to hear about EL exposure and the residential construction market too. And then in follow-up, I wonder if you could just talk a little bit to this de-booking of an order in process. Okay, maybe I'll start with the de-booking. Yes, that is another word for a company going bankrupts put it that way. So it's a shipyard, that went bankrupt, and we had to revert an order of $190 million. And if no financial impact actually, on our profit from that one. First, China had a very strong order intake, it's just saw 26% up during the quarter, which is exaggerated a little bit from the robotics. So robotic had a very, very strong orders in China. A lot coming also from automotive e-mobility actually in China, where we taking some really great orders. If you look at China from ABB perspective, we have three production hubs, I would say. One is Shanghai, which is mostly related to the robotic side, then we have Xiamen, where it's more Motion and Electrification, and then we also had Beijing. What other happened now is the shutdown in Shanghai, which of course affected our robot factory, there which has been closed for three weeks. We expect it to start opening up on Monday, that's the signals, but of course, it's an zero vision in China, which means that any kind of COVID breakout in your factory would of course, immediately shutdown the factory. And when we look at the different businesses, yes, it's correct that Electrification was the business, which is more or less flat compared to last year, while the other businesses showed good growth. We also, just to say we've seen also orders develop very well also during the second quarter during the first two weeks. China is -- it's a big market for us, we have 60,000 people, it's about 60% of our turnover. And so far, it's now getting a little bit better in Shanghai. But of course, if there will be shutdowns in any of other regions that will have impact during Q2. Yes, that's of course a good question. There were two things that happened a lot to part of the quarter, which we simply didn't know that were going to happen in Q1. So first of all, we had a real estate game, which we didn't know that it was going to execute did exactly at this point in time. And then we had kind of like real cost decrease in corporate cost, maybe in the area of 5 million to 10 million. So that's the reason why, why we didn't see this coming going into the quarter fully. And with that, we'll take the next question from the conference call. So when you go all the way to free cash flow, you are correct to point out that we have couple of headwinds which were not there '21. And so if we just assume all other things equal in a similar drop through, we could also see a little bit lower free cash flow than '21. And if you would take this what you mentioned, possible $200 million impact Q2 out and correct for the bonuses, it should be a very, very strong cash here as we see it. And then if we look at networking capital, we should now start to see move to the other direction. And I'm saying that simply, because we still had a very low comparable order growth, Q1. As you saw now for Q2, the comparable is 24%. So in that sense, the book-to-bill should start to move now against let's say closer to one, which of course would be a more normal type of situation. Of course, this again assumes that nothing extraordinal doesn't happen on the external market like a full lockdown in China or something which would of course, then impact our deliveries. I know you have some exposures there, but can you remind us what they are and how significant, if we do have a big wave of LNG liquefaction and regasification CapEx. And first, I think we believe that, of course, trying to be a less depending on Russian gas. On the LNG side, I mean, that's more related to our marine business, which is the ASTI port, where there are a number of ships being built today in Korea, where we have ASTI port on them. And they're being done and they are they have been delivered already, where those ships will end up in their undersea that will be Korea, who will be dealing with that. Well, I mean, if those things will need DCS and automation as some of them most likely will. So I think overall, if you look at this, let's call it energy reshoring for lack of a better word, that should be a positive thing for ABB, because our exposure is more in Europe. So all of those should be, I would say rather a positive. Yes, if Europe will be buying from U.S. And but of course that will take a little bit time to build up the right terminals and to be able to start the export. Yes, I think that -- I think this was a good move. I would say, we have two good leaders, both Tarak as well as Morten. It's important that when you lift stones, it should not be the dirt that you have put there yourself. So it is important, I think it's great to see Morten, putting his thoughts and his hands on the Electrification with some fresh eyes, I think that were good. And as he goes off Tarak with his great knowledge about acquisitions, and also implementing the non-open -- more acquisitions into the business of Motion. And that our Motion businesses is actually very much focused on profitable growth, meaning that we do expect that we will see a number of acquisitions within this business going forward. I think so far, both of them have a lot of energy, and very motivated in their new positions. Good morning, it's Martin. And obviously, we're hearing lots of things about potential issues in whereas in Germany, Italy, or elsewhere. I mean if you look at the orders during the quarter, we saw a strong actually in all three regions, that even though North America was the strongest one, which was over 40% and Europe we see over 20% that actually included de-booking. So overall, the demand is and for me really to see what is the underlying happening in the market. I think it's very interesting to look at the service market, which is a quite a big part of have us over 30% of our business. And that was up 15%, which from an aftermarket. So yes, it's quite overall, as you see in our different businesses, we see it strong in Robotics & Discrete Automation. But we also see very, very strong Electrification, as you saw more or less a record growth number for Electrification and also strong in Motion. Process Automation if you do revert that de-booking, it's actually 15%. I mean, it's difficult to say how much of this, of course, is coming from longer lead times there is a certain amount of that, but we looked into this quarter start and the demand continues on the same high level. But on long-term, it's for until the end of the year, it may be a little bit too far away to make, because of uncertainties in the market. But for the second quarter, I think we expect to have a robust orders. Obviously, there's a number of drivers here since it began under absorption. But if you would see sort of excise the under absorption, I mean, are you able to pass through some of the cost inflation in the orders that you are delivering. Yes, I mean, first, the volumes for Robotics is down 11%, 12%, which is quite dramatic to be a bit to be honest. And it's a little bit tough for them, because suddenly they get the commitment from some suppliers and then in the middle of the quarter, they get the de-commitment, which means that they are standing with half built robots, which is of course driving both inventory and waiting for components. So it becomes inefficiencies in the production, then the order book is quite long, which means from order to delivery, which means that when orders were taken, many of what's being delivered out today was taken for a price, which was before the inflation started. And it can be difficult actually to negotiate up prices with customers when you already committed to certain deliveries, but they are focusing on this. When you look at our bridge, it's actually fairly easy math this time. And we were actually this time able to more than offset the material, the raw material cost with pricing. But it was a -- of course an important contribution on us being up this 10, 20 basis points on comparable margin when you take out the corporate impact, and also correct for Dodge, as we also said earlier today. If you look at your exposure to energy intensive industries in Europe, chemical fertilizers, some of these downstream businesses. As a positive on one side, you've got potential risks from them just not being competitive and stop producing at all, particularly, if we get any gas rationing or something like that later in the year. Yes, I think you're relating a lot to PA at the moment. And there's two parts of PA, PA 50% of the PA revenues is actually service and spare parts today. And that is of course, reflecting the activity out in these businesses. And it's a good profitable part of the business and normal, quite agile from ups and down. When we look at the process industries, the different divisions, of course, it varies a lot. But in these transition towards newer energy types, we are of course, very active. And we are supporting many of the company both in becoming more energy efficient, but also in transition from oil and gas to renewables. So we are very active in many of these projects, not least in the Nordic part, in green steel, it's in battery manufacturing renew. The other part which is important for us, we are looking at every project and we have said that we are not prepared to take businesses with low margins. So we are looking at the quality of the businesses that we are going in, but we have strong customer relation and they really value our offerings and the value that we can help these customers with. So if you have a chance to look in and participate, that will give you some exciting part of the business and why we believe in this business going forward. Obviously, you spoke about potential further impact from China in terms of COVID restrictions, which are not included in that sense. Yes, of course, we know China's zero vision, which means that a lot of things can happen. But it, of course, includes what we have seen until today, and that is the Shanghai area. And we have three manufacturing hubs which are important, where Shanghai is one of them. And if we don't end up in a big outbreak, we think we believe it's going to open more and more in a couple of weeks where we go for 100% capacity again. So we just want to say that if there will be a major lockdown in any of the other two big production hubs, of course, it will have an impact on the quarter. But so far, we don't know anything of them, that there is nothing today that is still tending in this direction. And on the -- earlier in the year, you mentioned that you would expect all business areas in terms of profitability to improve this year. Robotics, I've been very clear that Robotics is a 15-plus business and I'm still saying that. And if you remember last year, the first quarter when we saw the volumes are coming up and they are pushing this part, we were up already in 12.5%. Thank you very much. So apologies for laboring the point, but to come back on Robotics, what I was interested to understand is if we went back two years to the Capital Markets Day in February 2020. At the time, I think the division was doing a 12% margin and the goal still is 13% to 17%. First, I think that we have a good offering. Also the strategy that moving away from this low-margin system business in automotive, we strongly believe and focus on some of the more profitable segments like logistics and general industry and so on. And I mean the demand, it's difficult to complain about that. The frustration is, of course, that you will have customers that are being delayed in deliveries. And that is, of course, cumbersome for the division. When I looks at the cost part, of course, when you -- they had the Capital Market Day, when you met them, that was before this new environment with inflation that we are living in today. So of course, that all material has gone up. And besides that, they've been buying semiconductors on the black market for prices which are totally horrendous. So yes, the costs have gone up dramatically in this part. But as I mentioned before, the order books are quite long, which means that many of the orders that we are delivering out at the moment is, of course, taken before these price increases were implemented. So I think they're doing a lot of good stuff in the division, but it's like a perfect storm. And then contemplate hits everything at the same time, and it is, of course, cumbersome to mitigate. But yes, it's a great business. That holds the execution side around switching the systems and all of that stuff or lowering the systems mix, should we say, from automotive. I think this system business, yes, we have -- we are not taking any of those orders. Still, of course, automotive, and especially electric vehicles, is a very growing segment at the moment. And during this quarter, we saw good orders from China, big orders on the electric vehicle side, where we actually have a pretty good market share. So there is a lot of investment being taken place, and we are part of that. So there are, of course, still automotive industries in our order book. Just on -- just to clarify, I think it was Daniela's question around cash. But if I look at the operating cash flow, you were growing at -- or you were delivering $1 billion plus per quarter in the second half of last year. So, yes, that's what we are saying. Of course, the visibility is not exactly super at the moment into that. But what is really, really important is that our inventory is of good quality. Actually, our receivable, if you look at, late receivables days went actually down. Electrification had quite a bit of revenue fairly late in the quarter, which then sort of dropped the cash to the other side into Q2. So with all we know at the moment, your postulation is correct, i.e., we should see that kind of operating cash flow. Within the cash flow, there is this $390 million of accrued liability. No, that is actually on the upper level of the cash flow statement. And of course, the impact is now -- this delta impact is bigger than ever because, first, we had quite low performance 2020, because that was the COVID year. And I think it's a good practice for the company, we didn't change any of our targets even when the COVID came, so that's when we had quite low payout. So of course, the delta became even bigger between cash flows '21 to '22 Q1, Q1. Thank you very much. Bjorn, you don't seem to be very concerned about cost inflation and supply chain issues in light of -- at least from my perspective, what seems to have been a worsening of the situation since you reported Q4. And also, if you can share any details on your reasoning here would be very helpful. I mean, I'm not concerned about cost increases and inflation, that is not a correct statement because, of course, this is a situation we haven't seen in 30 years. And I've been in the business for 35 years, so it was a very long time ago, we had to deal with these issues. What I feel very confident about what we have seen here during Q1 is that the divisions have been very successful in offsetting some of these costs, increased costs, in price increases. So -- and that, of course, only possible if there is a good value in what your deliveries are. So from that perspective, I think our divisions have a very well working pricing strategy also going forward. So of course, there are these kind of things that we are nervous of. We are expecting to have a, I'll call it, good revenue growth during the year as well, as we say today. And of course, we should then get also drop-through through fixed cost leverage, which also happened during Q1. Second question, just quickly. Have you seen any impact or sort of demand increase from onshoring or -- and if your customer is moving production, say from China to Europe or U.S. on the back of the issues we've seen in the past couple of months? I think just looking at our own operations, and of course we are looking to do sourcing, making sure that we also have access to raw material as a component from the region where actually the factories are operating. And of course, that is a little bit of a risk factor. So that is, of course, changing. So I think in the same way as we are trying to offset these, other companies are also. I have two questions, please. And in particular, at RA, given the widening gap between order growth and revenue growth there. The de-booking side, of course, coming from a customer, which has actually gone bankrupt. And I think from our divisions and from our businesses, they have a strong belief in their order books. But, that said, that there is probably some effects coming because of longer lead times, which means that they are moving some of the orders at an earlier stage. I think that's…\n Can I make one more comment here, please. Also contractually now in this situation with higher backlog, we are actually -- where we take new orders, we are putting cancellation fees in place in many businesses. So we are clearly managing in a way that the cancellation will, of course, become more difficult. I mean, if you look at where order book is up from last year, $4.1 billion, it's not a small number. So taking new orders, of course, the new orders have to be better quality and better certainty. The future, of course is might be a little bit different, but this is the case at the moment. Yes, on the energy price increase, yes, of course, when energy price is going up and oil and gas prices, that, of course, drive investments and operations in these areas. And of course, we are, in Process Automation, also dealing with these customers which are, of course, more optimistic about the future today than maybe a year ago. So yes, we are gaining in Process Automation, both from the energy transformation towards renewables, energy efficiencies in this all our customers, but also some of the increased demand in these traditionally energy sources. So yes, I think that is probably the case. I mean you saw the Electrification growth during the quarter, which was on a record level in part. So yes, I'm sure that in this Electrification, there is a lot of this transformation towards energy efficiencies and maybe also transforming to new energy sources. One of the areas where we've seen enormously high growth, which is, of course, a very small part of ABB, that is the e-mobility where the orders are double as high as they were last year. So I mean, that's huge growth numbers. Thank you very much. Thank you very much."
}