{
    "symbol": "EXTR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-27 15:50:24",
    "content": " Net-net, I'm incredibly excited to see our team execute at such a high level across the organization, from our product team delivering incredible innovation, from our sales and marketing teams driving demand, our supply chain and ops teams delivering products in a challenging environment, and the cross-functional support from all the other organizations are putting Extreme in a position for unprecedented growth in top line, cash flow and earnings in future quarters and years to come. Strong demand for our portfolio of products, services and subscription drove year-over-year bookings growth of 24% in fiscal '22 and 8% in Q4. Based on this methodology, our ARR reached $103 million in Q4, that's 47% year-over-year and 8% quarter-over-quarter. SaaS deferred revenue was $157 million at the end of Q4, up 40% year-over-year and 10% quarter-over-quarter. Services and subscription revenue of $91.1 million in Q4 was up 11% year-over-year, taking the total for the year to 350.6 million, up 13%. The growth of cloud subscription and service renewals drove the total deferred revenue sitting on our balance sheet to $402 million, up 16% from the year ago quarter and 8% sequentially. On the other end, services and subscription non-GAAP gross margin improved to 70.7% in Q4, up from 64% in the year ago quarter and 65.1% sequentially driven by high mix of subscription and maintenance and lower professional services revenue based on the timing of certain high touch stadium deployments. Your line is open. And so, Alex, you're rightfully pointing out kind of just how we're looking at bookings, which is really our measure of true demand, and then versus revenue and our revenue outlook is really a function of a supply chain and product that we're able to release, given the massive backlog that we built up and the continued strength of bookings. Your line is open. Your line is open. Your line is open. Your line is open. We did some back of the envelope math, but typically when you have $100 worth of backlog that you're not able to deliver between the services and subscription assuming attach rate for service and assuming different attach rate for subscription, you should assume around 15% of that 500 million of backlog gets released, that's potentially $75 million worth of subscription and services business that can be generated over time. Your line is open."
}