{
    "symbol": "TLYS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-02 18:10:04",
    "content": " However, relative to our pre-pandemic performance in fiscal 2019, we delivered comparable net sales growth with consistent product margins, improved gross margin as a result of lower occupancy costs and higher operating income in the first quarter despite significant cost increases that have occurred since then in wages, freight, fuel and insurance. In addition to discussing our fiscal 2022 first quarter operating performance compared to last year's first quarter, I'm also going to intersperse a few data points relative to the pre-pandemic first quarter of fiscal 2019 for added perspective. Total net sales were $145.8 million, a decrease of $17.4 million or 10.7% compared to a company first quarter record of $163.2 million last year due to going up against last year's pent-up demand and stimulus impacts. Total net sales from physical stores were $117.5 million, a decrease of $10.2 million or 8% compared to $127.7 million last year, with a comparable store net sales decrease of 10.8%. E-commerce net sales were $28.3 million, a decrease of $7.2 million or 20.3% compared to $35.5 million last year. Compared to the pre-pandemic first quarter of fiscal 2019, total net sales increased by 11.9% with a comparable net sales increase of 5.8% comprised of a slight decline from physical stores of 0.7% and an increase from e-commerce of 42.3%, reflecting the general shift in consumer behavior towards online shopping over the past three years. Gross profit, including buying, distribution and occupancy expenses, was $43.8 million or 30.1% of net sales compared to $54.8 million or 33.6% of net sales last year. Buying, distribution and occupancy costs deleveraged by 190 basis points collectively despite decreasing by $1 million in total due to carrying these costs against the lower level of net sales this year compared to last year. SG&A was $7.2 million higher than in the pre-pandemic first quarter of fiscal 2019 due to wage inflation, e-com-related marketing and fulfillment costs associated with online sales growth and increased insurance premiums. Since the end of last year's first quarter, we have paid aggregate special cash dividend stockholders of $61.6 million. Total capital expenditures for the first quarter were $2.6 million compared to $5.5 million last year, the decrease being primarily due to earlier new store openings last year. We expect the combination of buying, distribution and occupancy costs to deleverage by approximately 270 to 320 basis points, primarily due to carrying these costs against a lower level of net sales and SG&A to be approximately $47 million to $48 million. This compares to record net sales of $202 million and record earnings per diluted share of $0.66 for the second quarter last year, which doubled the previous company record for second quarter earnings per share. So we don't think that, that low end that I mentioned of mid-160s makes any sense because we reported $161.7 million of sales in the second quarter of 2019, and we are seeing a comp increase relative to 2019 with 12 additional stores. But as we look at the second quarter, really looking at a fairly consistent level of dollar spend in that bucket of cost, it's just going to go up against a $25 million to $30 million lower sales figure."
}