{
    "symbol": "CELC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 08:14:05",
    "content": " In July, the U.S. Food and Drug administration or FDA granted breakthrough therapy designation to Celcuity's lead drug product candidate gedatolisib, an investigational pan-PI3K/mTOR inhibitor, for the treatment of HR+/HER2- locally advanced, inoperable or metastatic breast cancer that has progressed after treatment with a CDK4/6 inhibitor in combination with a nonsteroidal aromatase inhibitor. In our submission seeking breakthrough status, we provided detailed clinical safety and pharmacological data with a focus on our early phase study, evaluating gedatolisib in combination with palbociclib and fulvestrant in patients with advanced breast cancer whose disease progressed on a CDK4/6 inhibitor. To advance the development of gedatolisib we're conducting a pivotal phase three clinical trial known as VICTORIA-1 to evaluate the safety and efficacy of gedatolisib in combination with fulvestrant with or without palbociclib in adults with HR positive, HER2 negatives advanced breast cancer, whose disease progressed while receiving prior CDK4/6 therapy. Yes, so these, these are right for the FACT-1 and FACT-2 trials, these woman would receive the therapies that we're studying in the case of FACT-1 it's Herceptin, Perjeta, and chemotherapy, which is standard of care for HER2 positive patients in new adjuvant setting. And then in the second line setting, what was compelling about the data, what we the inference we drew from that data was that even though the patients have progressed, most of them on palbociclib, because that's has 75% to 80% share of CDK4/6 marker. So even though these patients had received in progress on their CDK4/6 endocrine therapy, when you added data, they had a significant response to that 63% response rate and the registrational data that was reported in the  3 trial, which was palbociclib, fulvestrant, reported only 25% response rate. And that may be that we can extend the benefit patients get from their prior therapy if that pathway or that inhibitors blockading a pathway that's cooperative with PI3K that we can extend potentially the treatment benefits of the drug that was used in the first line setting which is essentially what we're doing now essentially saying, maintain the pressure on the tumor on these pathways with palbociclib and fulvestrant in this case, and then blockade this escape route, and essentially, put the equivalent of a clamp on the signaling that's driving proliferation."
}