{
    "symbol": "SMTC",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-29 21:22:06",
    "content": " In fiscal '23 for Organic Semtech, our growth drivers of data center, LoRa-enabled, PON, broad protection industrial and automotive platforms drove record non-GAAP gross margin of 65.1%, up 180 basis points. In Q1 fiscal '24, we expect operating expenses of approximately $99 million at the midpoint of guidance, reflecting a full quarter of Sierra and the customary increase in compensation expense is typical at the start of the new year. Semtech Organic delivered a record operating profit of $212.7 million, up 5% versus the prior year, with minimal revenue growth due to gross margin expansion and controlled expenses. One -- first, we expect to see our growth drivers of data center, PON, 5G wireless regain their growth momentum as the business environment normalizes, but more importantly, become more regionally balanced as we see revenue run for these products in North America later this year. In Q4 of fiscal year '23, net revenues were $167.5 million, Organic Semtech contributed $152.5 million, slightly above the midpoint of our guidance. In Q4, total IoT revenues were $58.8 million, 18% higher sequentially and 34% higher on an annual basis and represented 35% of total Semtech revenues. In FY '23, Organic Semtech also achieved record gross margins of 65.1%, record operating income of $213 million and record EPS of $2.80. In FY '23, our SIP product group grew 4% annually and achieved record revenues of $304 million, driven by record PON revenues of $142 million, which grew 58% annually and record 5G revenues of $11 million, which grew 18% annually. However, the broader ITA protection business achieved record revenues of $80 million and grew approximately 9% year-over-year. In FY '23, our organic Wireless and Sensing business grew 40% to achieve a record $200 million. And I think for FY '25, I wouldn't be -- I'm not guiding to it, but I would probably still expect to see something in the neighborhood of 150 to 200 basis points of gross margin expansion just because at that point, the expectation is that the environment has normalized and business is -- a lot of the macro issues have gone out and the Semtech business, right, is rebounding to the levels that we expect."
}