{
    "symbol": "RILY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 22:09:03",
    "content": " Additionally, I think it is important to recognize that this first unlevered purchase of $400 million of receivables will not only result in strong returns, but it was also fortuitous as we monetize a portion of our equity assets at the end of 2021 when equities were much higher to fund these purchases. For our third quarter ending September 30, B. Riley reported total revenues of $340.4 million, down from $381.5 million in the prior year period. Operating adjusted EBITDA was $106.2 million for the quarter, compared to $101.1 million in last year's period. Some highlights from our balance sheet as of September 30, include $232 million in unrestricted cash and cash equivalents, $1.2 billion in net securities and other investments owned and $815 million in loans receivable, which includes our performing receivables portfolio and our loan book. Segment income increased to $124 million up from $88 million in the prior year period, primarily driven by increased interest income from loans and securities lending. In Wealth management, segment revenues decline to $48 million for the quarter, primarily impacted by our strategic decision to part with a significant number of brokers and certain businesses previously affiliated with National Securities. Third quarter financial consulting revenues were $23 million driven by sustained demand for valuations to services, to support loans and transaction financing and our expertise in bankruptcy restructuring and forensic accounting. In our Auction and Liquidation segment, revenues were $7 million for the quarter, primarily driven by ongoing projects in Europe and smaller liquidation projects in the U.S. As we have stated previously on calls, results from this business are variable due to the episodic impact of large retail liquidation engagements. In addition, our investments in Hurley and Justice brands, which are recognized in our Capital Market segment contributed dividend income of $7 million for the quarter. I think somebody could â\u0080\u0093 some could argue that maybe that business would lessen a little bit given the current environment, but I would let everybody know that freight cost them roughly $50 million of EBITDA last year, and freight has come back to close to pre-COVID level. Weâ\u0080\u0099ve made a couple announcements there, so I think youâ\u0080\u0099re going to see a pickup there thatâ\u0080\u0099s averaged $1 million to $2 million of EBITDA per month over a long period of time, it was a little less the last couple of years as there was a lot of liquidations. No, that makes sense. No, that makes sense."
}