{
    "symbol": "RILY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 21:55:23",
    "content": " On a consolidated basis, total revenues were $42.7 million for the second quarter and 240  portfolio, year-to-date investment loss of 292, but decline in our investment book, our operating business has generated strong performance in the second quarter. Financial consulting revenues were $24.3 million with segment income of $4.3 million, driven primarily by bankruptcy restructurings, forensic litigation consulting matters, in addition to appraisal engagements and real estate dispositions completed during the second quarter. Principal investments, our Communications and Other segment revenues increased to $42.5 million for the second quarter, up from $19.6 million in the prior year period, primarily due to the addition of the Lingo Communications and Marconi Wireless businesses and segment income was $7.6 million for the quarter. As well our investments in Hurley and Justice Brands, which are recognized as Capital Markets segment, contributed income of $7.4 million for the quarter. At June 30th, B. Riley Financial had approximately $216.1 million in unrestricted cash and cash equivalents, $1.1 billion in net securities and other investments owned and $770.8 million in loans receivable. Net of debt, B. Riley Financial's cash and investments totalled approximately $61.5 million at June 30th. I think that as we look at all the things that did happen this quarter, I mean, underwriting business was $9 million in the quarter versus $385 million last year. And to think that and to see that we still are profitable about our broker dealer, we haven't closed â\u0080\u0093 we closed Lingo in the middle of the quarter, we have not closed Bullseye, which we think once it kind of gets going, we'll add with synergies $15 million to $20 million of EBITDA. So I don't think â\u0080\u0093 I think underwriting means a lot more to us from a size perspective than the opportunities and restructuring, but that's not to say that we're not â\u0080\u0093 we don't â\u0080\u0093 we think we're really well positioned to get some mandates and pick up from where we left off in early 2020 where we were really starting to see momentum there. So while there's not been a lot of activity in the underwriting side, and it's been kind of challenging, I would estimate there's $8-ish million a year in incremental cash on cash that we're getting versus last year. So it might pick up a little bit, but I gave you, sorry, if I wasn't more specific, I gave you kind of like, we look at it every day and I think the number as of right now is in and around $8 million, maybe a little bit higher, better than last year."
}