{
    "symbol": "RILY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 22:37:01",
    "content": " Throughout 2022, we continue to execute our strategy amid a tough environment with markets taking back the investment gains we saw in 2021, contributing to a net loss of $168 million for the year. For the fourth quarter ending December 31, 2022, B. Riley reported total revenues of $327 million, down from $422 million in Q4 2021. For the full year ended December 31, 2022, total revenues were $915 million, down from $1.7 billion from the prior year. As of December 31, we had $269 million in unrestricted cash and cash equivalents, $1.1 billion in net securities and other investments owned and $702 million in loans receivables. At year-end, we had a total cash and investment balance of approximately $2.1 billion, which includes approximately $54 million of other investments reported in prepaid and other assets. Excluding investments, our Capital Markets segment generated operating revenues of $542 million with segment operating income of $232 million for the year, reflecting lower levels of investment banking and underwriting activity. Underwriting, ATM and banking advisory activities within B. Riley Securities all increased sequentially compared to Q3 with notable deals completed during the quarter, including a $75 million equity follow-on for AST SpaceMobile, $125 million combined debt and equity raise for , a $119 million follow-on offering for , along with several notable sell-side transactions, including the sale of  juices as well as the sale of a  brand to . Assets under management for the business increased substantially year-over-year to $330 million as of December 31, 2022. In our Financial Consulting segment, revenues totaled $99 million for the year with segment income of $16 million for the year related to B. Riley Advisory Services and B. Riley Real Estate. In our Auction and Liquidation segment, revenues increased to $74 million for the year driven by an increase in retail liquidation assignments with legacy and repeat clients in the U.S. during the quarter and 2 large European projects, which added sizable profits in December. This segment also includes our investment in the Hurley and Justice brands and dividend income received from those investments, which totaled $28 million for the year as well as revenues related to the licensing of trademarks for our 6 brands portfolio. But -- so for 2022, as we define recurring was about $325 million of operating EBITDA. And he turned Targus from what was an overleveraged bankrupt company to a business that have recapped dividends out to the shareholders and had no debt and was generating $50 million, mid-$50 million in EBITDA. That business last year to mid-50s EBITDA but had freight costs that were punishable as much as like $15 million, $20 million. So if we were to run rate that for next year, it would be --\n What I would say is I don't think we're going to find -- so we've freed up a lot at $400 million over the course of 14 months on Badcock. But the Lingo -- and the Lingo and the BullsEye kind of the small telecom business that we have, they only contributed in 2022 $9 million -- $10 million Lingo and BullsEye, which is an acquisition we made together. And then thinking of that core capital market service and fee, so it's been the $65 million to $70 million run rate on that line. Factors that could cause such actual results to differ materially from those contemplated or implied by such forward-looking statements include, without limitations, the risks described from time to time in B. Riley Financial, Inc. periodic filings with the SEC, including, without limitation, the risks described in B. Riley Financial, Inc.'s annual report on Form 10-K for the year ended December 31, 2021, and in our quarterly reports on Form 10-Q for the quarters ended March 31, June 30, September 30, 2022 under the captions risk factors and management's discussion and analytics of financial condition and results of operations as applicable."
}