{
    "symbol": "QUMU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 18:56:07",
    "content": " During today’s call, management will make certain statements with respect to the company’s expected financial results, company’s go-to-market strategy and efforts designed to increase the company’s traction and penetration with customers. Since joining the company, I have played a key role in the development and execution of Qumu’s strategic roadmap, which emphasizes growing our cloud business, leveraging innovative technology, and scaling our SaaS revenue base. As COO, I spearheaded Qumu’s partner led sales motion and customer experience efforts, which continue to be a critical element in our ability to secure new logos, deepen customer relationships, and drive higher retention and cloud conversion. Most recently, I led operations and strategy for Teradata, a $1.8 billion revenue analytics company, where I played an important part of the company’s successful transition from a perpetual license business model to a subscription based cloud first revenue model. The innovative solution which is available to AT&T customers today brings video content management and streaming enterprise signage, IPTV, all enhanced by AT&T’s fiber and 5G networks and the Qumu video engagement platform together in one solution. And if you look at just our usage on the platform, we’ve seen a 54% increase in total platform users year-on-year, which means that a lot of customers are just really using more and we’ve seen like a 2x increase in just a-sync and video views over the last three years. And with our strategic plan we expect to see from the VCC business, we are seeing at least a 70% and above retaining of that business, because customers are choosing, as we call it , to stay on the current version or upgrade, or potentially migrate to the cloud and that cloud conversions are what’s really leading to a lot of our SaaS growth as well."
}