{
    "symbol": "NRP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 00:17:03",
    "content": " NRP generated $83 million of free cash flow in the third quarter and has produced $199 million of free cash flow in the first nine months of the year, resulting in the best start to a year in the history of the partnership. $249 million of this debt has been permanently retired with cash on hand, with the remainder temporarily refinanced under our lower-cost five-year revolving credit facility established in August. We have paid out $24 million of common unitholder distributions through the first three quarters, which is a 46% increase over the same period a year-ago. Once our debt is repaid and the $250 million of preferred stock is redeemed, common unitholders will have no competing stakeholder claims on free cash flow generated by the partnership. During the third quarter, we generated $82 million of operating cash flow and $75 million of net income. With the new five-year revolving credit facility we executed in the third quarter of 2022, we increased our borrowing capacity from $100 million to $130 million and now have revolving credit available to us that does not mature until 2027. When compared to the prior year quarter, segment free cash flow and net income improved $42 million and $36 million, respectively, primarily driven by stronger demand in pricing for metallurgical coal. Our Corporate and Financing segment costs for the third quarter of 2022 decreased $2 million as compared to the prior year quarter, primarily due to lower interest expense because of less debt outstanding. In addition to the significant progress we made to derisk and delever the partnership in the first three quarters of 2022, on October 31, we fully retired all outstanding 918 senior notes due 2025 at a redemption price of 102.281%, utilizing cash on hand and $70 million of borrowings on our new credit facility. Regarding distributions, in August of 2022, the partnership paid a quarterly distribution of $0.75 per common unit and a quarterly cash distribution of $7.5 million to our preferred unitholders. And today, we announced third quarter distributions of $0.75 per common unit and $7.5 million cash to our preferred unitholders to be paid later this month."
}