{
    "symbol": "YUMC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 01:54:02",
    "content": "  Operator: Thank you all for standing by, and welcome to the Yum China First Quarter 2022 Earnings Conference Call. I'd now like to hand the conference over to your first speaker, Florence Lip, Senior Director, Investor Relations of Yum China. Joining us on today's call are our CEO, Ms. Joey Wat; and our CFO, Mr. Andy Yeung. Due to the current COVID restrictions in Shanghai, we are dialing in from different locations today. Before we get started, I'd like to remind you that our earnings call and investor presentation contain forward-looking statements, which are subject to future events and uncertainties. Now I would like to turn the call over to Joey Wat, CEO of Yum China. Shanghai, Tianjin Jilin and Guangzhou were among the places to experience extended periods of lockdown. Shanghai, one of the most impacted cities, has been locked down for more than a month now. Even regions with new cases have tightened containment measures, in line with the dynamic zero-COVID policy. Compared to 2020, it's far more complex to keep our stores open get our employees to work and obtain necessary approvals. Our store operations, delivery and supply chain have been heavily impacted due to ever-changing restrictions. I want to thank our frontline employees at restaurants and logistics centers, our delivery riders and our stars at the back office for working tirelessly during this difficult time. They performed health check at restaurants, delivered food using their own cars and served as customer service representatives. Soon after the lockdown in Shanghai started, where most business activities have come to a halt, we became one of the few and first authorized food suppliers to serve the communities. We also provide ready-to-eat products to the elderly living alone and KFC to children's, both kids and quarantine centers. During the lockdown, the demand for KFC and Pizza Hut products surged. Many of our customers go on social media like WeChat and Bing, equivalent of TikTok in China, expressing their longing for our signature products. Nationwide, we quickly adjust marketing campaigns and simplified menu to streamline operations. Seizing the demand for home consumption, we promoted new retail packaged products, such as steak, pasta and fried rice. Despite the citywide lockdown, we were able to keep about 10% to 15% of our stores open for delivery or takeaway in April. To serve as many communities as possible when mobility is heavily restricted, we introduced community purchasing across all brands as early as mid-March. We also promoted new retail packaged foods, which are perfect items, ready to eat and easy to store under this circumstance. But swiftly implementing these initiatives, we were able to generate 40% to 50% of pre-lockdown level of sales in Shanghai despite having very limited stores offering off-premises services only. In other words, 10% to 15% of our stores generated 40% to 50% of our pre-lockdown sales in Shanghai. KFC optimized its community purchasing menu to just one item, the fried chicken combo as it is one of the most desired food items during lockdown. Our customers share their appreciation on social media, quoting that having KFC fried chicken is the happiest moment in the last month and our fried chicken is a comfort food and nourishment of the sold. Our customers were so excited to receive high-quality, well-packaged and safe products during lockdown. In just a few days, we set up a temporary drop-off and pickup site, not far from Shanghai, to support the region under lockdown. Our digital infrastructure provides real-time visibility to store inventory, allowing us to precisely forecast the material demand managed supply chain routes and minimize wastage. I hope by now, you have a better picture of the challenges that we face and even in situations like this how we find ways to serve our customers and communities. This is the third year for the COVID pandemic, so it is understandable that pandemic fatigue may be settling in. As we look ahead, I'm confident that as long as we focus on new opportunities remain in a way, both with our initiatives, the agile in our action and control our cost structure, we can get through this challenging time and become even stronger. I'm pleased that Jonathan Huang, previously, the General Manager of KFC, is now our first Chief Customer Officer. He will be the head across functional initiatives, including cross-brand customer loyalty program and delivery initiatives. He will also oversee COFFii and JOY, Lavazza and Taco Bell. With Jonathan's strong technology background and deep understanding of the organization, I'm confident that he's the best leader for this role. Warton Wang, our Chief Development Officer, foresee Jonathan as the new KFC GM. Warton joined KFC as an operations management trainee 24 years ago, and work his way up. He led various initiatives to improve KFC's business operations, innovates performance and business model. As Joey mentioned, our team put in tremendous efforts to sustain operations, mobilize and fully utilize available resources to drive sales and proactively manage costs. We achieved a profitable quarter, demonstrating the resiliency of the business. We continued to grow by opening 329 net new stores and ending the quarter with over 12,000 units. By brand, KFC same-store sales were 91% of prior year's level with same-store traffic at 86%. Average ticket grew 6%, mainly due to the increase in delivery mix, which has a higher average ticket than dine-in. Pizza Hut same-store sales were 95% of prior year's level, same-store traffic was at 97%, while average ticket was down by 2%. Restaurant margin was 13.8%, down 490 basis points compared to last year. Cost of sales was 31.1%, 90 basis points higher than last year. Cost of labor was 26.2%, 90 basis points higher than last year. This is due to sales leveraging, rate inflation of 5% and higher delivery rider cost from higher delivery mix. Occupancy and others was 28.9%, 110 basis points higher than last year, mainly attributable to the sales leveraging impact and 10% increase in utility prices. G&A expenses increased 14% year-over-year in constant currency, mainly due to consolidation of Hangzhou KFC and Lavazza as well as increased compensation and benefit expenses. It also includes the amortization of intangible assets acquired, roughly $60 million per quarter that went through the end of this year. Below the operating profit line, we incurred a $30 million mark-to-market net loss on our equity investment this quarter. As the COVID situation deteriorates, we faced even stronger headwinds in the second quarter. Eastern China, the most economically vibrant regions in China, is severely impacted this time. Eastern China is also our most important market, accounting for around 30% to 40% of our store mix and sales mix. Apart from Shanghai, many large cities, such as Guangzhou, Suzhou, Tianjin, Shenzhen and Jilin were also partially locked down in April. In April, our same-store sales declined more than 20%. In addition, around 3,000 stores were temporarily closed or provided only delivery or takeaway services. As a reminder, store providing only delivery and takeaway services are included in our same-store sales calculation. Sales leveraging impact will be more pronounced, too, as sales and margins are seasonally lower in the second quarter. Furthermore, we continue to face several cost headwinds, including the surge in commodity prices, rates and utility prices. Barring a significant improvement in external conditions in May and June, we expect to operate at a loss in the second quarter. In addition to what Joey mentioned, we are adjusting our marketing events and promotional activities, temporarily postponing store remodels, negotiating rent relief, optimizing raw material cost structure and implementing G&A austerity. Now looking past the very tough business environment in the near term, our efforts will have a long-term positive impact. Powered by healthy store economics, we are confident to further expand our store network. KFC and Pizza Hut new store linking healthy store payback at 2 years and 3 year, respectively. While we expect a slower pace of store openings in the second quarter due to COVID, we still intend to achieve our full year target of 1,000 to 1,200 new units. In turn, Yum China will have the exclusive right to upgrade the brand in China for 50 years. At the end of the first quarter, our remaining authorization was approximately $1.4 billion. We are confident that this investment will widen our strategic moat, drive sustainable growth and capture attractive long-term opportunities in China. First of all, we are very grateful with our own business model. This is Yum China, particular KFC and Pizza Hut, a fantastic business model that we can do well. The timing is good, but it's also proven again and again during challenging times, this is a very resilient business model. So we are very grateful, and we still can capture 40% to 50% of sales in Shanghai with 10% to 15% of store. In terms of competitive landscape, it's still a bit difficult to tell, particularly in Shanghai or locked down cities because we are still going through it, but I think this is definitely the time that differentiates the company with solid operating capability and also prudent financial arrangement versus the others. So fortunately, I think for Yum China, both our operation and digital capabilities and also our prudent financial philosophy helped us through the difficult time. But for the country -- for the city and the province that are still going on with our normal business operations, the business is as usual. And for Pizza Hut, we just launched the new menu for the year, which is, again, 40% improvement of the menu items on the menu. So this is still going on, and we still have like our very famous Crazy Thursday for KFC and Screaming Wednesday for Pizza Hut as value program. But for cities that are in lockdown such as Shanghai or Guangzhou or Shenzhen, we put the promotion because the focus is about maximizing our limited resources to meet the customers' unmet need. Here, we really have the unmet need because the rather small percentage of our stores can open and we also put back our menu. As I mentioned earlier, in KFC case, we only offer one combo, which is for our chicken. Sorry, ladies and gentlemen, it looks like Joey's line has dropped once again. And given all the challenges, the operation we're facing, could you give us a bit update about the trends in Eastern and the Southern area close to the end of April or May, i.e., the latest trend? Especially, I think in Southern China, it seems like the situation is better than Eastern region. So just to give a little bit color of if the lockdown, kind of what the impact could be. And following on that, also, because you mentioned that there is a simplified menu, and also in the normal areas, we also offer the normal menus. So I want to understand a little bit further, under such a complicated situation, how do we manage the logistics and also procurement, especially I understand that the transportation disruption bottleneck is still there. Andy has mentioned earlier about his thought and our thought about Q2 and the early May trading, so I'm going to comment on the trading pattern. As I mentioned earlier, in Shanghai's case, when we don't have enough rider or our rider are being quarantined, our own back-office staff volunteer to deliver whenever we could if we can get the license or approval to go out and deliver. The train right now is about 50% below the pre- COVID level, which is -- before compared to 2020. With the weekend, it's doing slightly better because it's a bit more functional. And by region, interestingly, despite the outbreak in the southern part of China and Eastern part of China, Eastern part of China is still doing better in terms of same-store growth. It's a very resilient part of the country, and we are very focused on Eastern part of China, so this is not a bad news. In terms of the logistics and procurement, I -- as I mentioned earlier, I think our team is just absolutely amazing. And not to mention, this is our own in-house logistics supply chain, and they will stay at night. We traditionally use trucks to move goods around, and you probably know that it has become a bit challenging to move goods around across province, so we use rail mainly to take the goods to the west. And then with sea freight, we can put our goods into sea freight and send it to Tianjin to cover the north part of China and then to Guangzhou to cover southern part of China. And also because this is our in-house team, so we can move the supply between the stores and between the brands and to also minimize the wastage. Again, it has proven our investment in supply chain and also in digital capability, a very important strategic moat because now we have visibility, digital visibility of a real-time store so that we know exactly what stocks. With the visibility, we can be a lot more efficient to keep up the surprise as much as we could and also minimize the food wastage, particularly when food is a challenge for Shanghai. So that's where we are. And then not to mention other than logistics and procurement, all these things, what really help is externally our innovations in new retail. And by second week of March, we can see the potential opportunity in new retail with Shanghai was sort of in soft lockdown. And literally within days few days, we come up with the initiative of community purchasing across all the brands, not only KFC, Pizza Hut, Lavazza and Taco Bell and all the brands, and we do it together. And the package would also allow us to be more efficient with the logistics process because the new retail packaged food, these are much better food to store and to move around in bulk. And with this challenge comes opportunity because Yum China is very well positioned to capitalize with extensive store network, our membership, our online channel and already established channels via third parties such as Jingdong or Tmall for the new retail as well. So meaning that the other is -- for the rest of the nation, we are seeing like a much weaker same-store sales trend. One is, obviously, we're referring to the overall Eastern part of China not impacted by -- while that's not significantly impacted by the COVID situation. For example, Shanghai, obviously, because of the lockdown is significantly below the national average. And so I think what we're referring to is that overall, the situation in Eastern China. Outside of Shanghai, it's is probably still performing quite busy. As you know, Eastern China is the most vibrant economically speaking, regions in the country, account for a big part of GDP, a strong growth rate. Now obviously, there's some regional differences. For example, northeastern part of China this year and over the last couple of years had been hit by wave after wave of COVID. And so I think overall economically speaking, the northeastern part of China is also less wipe compared to, for example, Eastern China. And obviously, our strategy, our store network expansion would also factor that in as we open new store. I think it's very important to keep in mind the sales decline or same-store sales decline in recent months driven by COVID surge, Omicron surge, which resulting in very strict proactive measure and health measures. That I had to say, as I mentioned on my prepared remarks, have an impact on the restaurant industry, but also on obviously the nonmanufacturing service sectors in China as well and also the manufacturing sectors. We're doing a lot of things, obviously, to try and to address the short-term challenges both in terms of how to use our existing resources. One, obviously, is to continue to provide service to our customers, to manage cost, to value positions and also meet the demand in the impacted regions. And then we also have cost control, as we mentioned. It's not only for the short term, but also looking to cost structure in longer term, how we can emerge better. There's a lot of white space deal, so we can expand and grow. If you look at between second half 2020 and the first half of 2021 when things become ratably more stable, we were able to capitalize on the rebound, the recovery and also the opportunity that presents in terms of both sales and also margins. But what I'm also referring to is on the membership sales as a percentage of system sales, where it's strong from 60% to 62%. And obviously, in this period of time, like maybe it may not be impacted. If we have 100% member sales, then that would be problematic for us in the long term because that means we're not attracting a new customer to purchase at our stores. We don't basically pursue a number for membership sales, and we don't particularly think that having higher membership sales would necessarily be better. I think this is a healthy level, where we have a good mix of our member sales and then also a good mix of new customers coming to our store. So in terms of our store network expansions, I think it's wealthy to keep in mind that we employ a very disciplined strategy for store network expansion, and we continue to see good opportunity. And our store economics, our payback period reflect that disciplined approach and also the strong economics. So if you look at KFC, for example, the payback period for those new stores were 2 years. And for Pizza Hut, it's about 3 years. That's because over the past few years, we continue to innovate in our store model. On the other hand, I think obviously, COVID and the new store is not immune to COVID. But I think if we look at the situation, if the prolonged situation, obviously, longer term, you will see that impact reflected in our payback period. As We have mentioned, obviously, in the first quarter, we're going to slow the store expansion because of the COVID situation right now. On average, if you look at our store portfolio, the store are either new or have been remodeled over 5 years. Unless obviously, like as I mentioned, COVID situations have been very prolonged and then will impact our store unit economics, that we'll may go back and devalue it. So the important thing for us, is we look after is obviously the return on our investment, the heat rate, success rate of our new store. And then obviously, going forward, how close the market is trending to our expectations. So hopefully, when we look at the longer-term strategy, there's no change to it. As I mentioned before, 2021 new store opening they were able to reach breakeven within 3 months. So that's very healthy and, the payback period is very healthy. So not much in the long-term change our view on store network expansion, and we see a lot of space in the low tier cities as well as potentially improving current density in the urban area for our premise consumptions. So if I look at like a KFC per store sales per year, like in 2019, it was close to like RMB 8 million per store. That's lower number in 2020 and even a lower number in 2021, probably because we opened more stores in lower-tier cities. So for store average sales, I would like to take a step back and share that KFC and Pizza Hut both has a range of store models. There are some big store, have more seating, and there are some smaller stores that is more off-premise-driven. And this is incredibly important because if we keep chasing the average store size, then we miss the big opportunity in terms of the convenience. And as Andy just mentioned earlier in our new store opening strategy, the store density within our current top-tier cities is incredibly important. And then, of course, we are opening a store in the lower-tier city as well, as you mentioned. And if you just think theoretically within the same 5 kilometer, if I have more store there, then the convenience and the speed of delivery is much higher and more efficient. And let's say, Pizza Hut, for the new store that we opened this year, 70 to 80 of the stores are smaller stores. When it comes to retail, new retail, it's still early days. Last year, for 2021, our sales was about, give and take, about USD 80 million, and that doubled the sales the year before because we have been incubating this business for a few years now. And as of quarter 1 this year, we further doubled compared to the previous year. So for the quarter 1, we are talking about close to USD 40 million new retail sales. I mean when we put it in the entire business, we have a pretty big base, so we are talking about 1% to 2%. But then if we only lockdown cities such as Shanghai, we can be talking about 10%, 20%. Or even in smaller business, 50% for the emerging brands. But as I mentioned earlier, we are in a very good position to do that because we have the product, we have the store network and we have our online channel and we have our own logistics and delivery capability. And so for new retail business, even though it's still relatively small, it's profitable, which is very, very difficult to achieve. So that's where we are. And it's proven to be particularly important in difficult times like this, and we are so glad for the flexibility and agility of the new retail that brought us in the middle of the pandemic. Thank you so much for sharing the store sales and different formats, Joey. If I observe like correctly, I actually also observed your per store number of employees declined by around 30% in between 2021 to 2019. So if I assume like things are back to normal one day, actually there is a hope for like a labor cost productivity gain like to show like in your financial results. And back to 2015, 2016, we have -- 2015, we have 7,000-plus stores. Right now, we have 12,000 stores, we still only have 420,000 staff. And then during the lockdown of Shanghai, some store are operating 5 to 10 people, but this is not sustainable. But there will be some innovation coming out of this because we are pushing our thinking into sharing management headcount across the store, which is something that we learned from ourselves in our deliveries, rider, sharing among few stores. So you did mention in your prepared remarks about the group purchase, which is a very new model in Shanghai. The second question is for the market consolidation, really, we are seeing the top time like COVID situation always a good opportunity to consult at market. We still remember that in the second quarter 2020, post the first week of COVID, you guys are consulting market immediately. Unfortunately, it looks like Joey's line has dropped once again. While we connect, Joey, let me address the second question, which is about the consolidation opportunities in the marketplace. I think as we have mentioned on our capital acquisition strategies, obviously, we have put a lot of emphasis on investing in CapEx to drive organic growth and then also to build out strategic moat. We have the KFC, quick service restaurant business. We also have COFFii and JOY and Lavazza in the coffee business, and then we also have the Chinese goods business. But at the worst time, we have 10 to 15 stores open in Shanghai. But as of right now, we have about 40% of our stores open. So given this prolonged and fluid situation about COVID restrictions and lockdown in China, so I'm just wondering what kind of cost-cutting measures management has put in place or considered putting into place to deal with this situation. And also, I remember back in 2020, there are quite a few government grants given to Yum China during the COVID period. Christine, so let me address your questions regarding obviously the cost control and cost reduction. I think obviously, we're looking at from a COS side, pretty strong inflationary press globally. And so we will continue to work with our supply chain to our long-term supply chain partner to manage, that is -- that will be including potentially a longer-term contract. We -- as you mentioned before, our contract usually work in a quarter or 2 ahead of time. For example, for coffee bean, we have locked up supply contract that would last us to 2023, and that will help us to mitigate that. Obviously, not everything can be done like that. But I think we'll -- we have a very smart, logical and supply chain folks here that have a lot of experience and historically deal with different environment -- inflation environment. As we mentioned, utility price is up 10%. And the other one is we will continue to deploy technologies across our supply chain to make sure that we both have a flexible -- flexibility to deal with given potential scenarios, but also make them more efficient. We are able to very flexibly to redefine their supply chain network, the routing and using both railroad and sea freight to flexibly manage our logistic operations. Also, we see technology being employed in store operations in the back office. Now all in all, obviously, is in terms of margins or cost, the biggest driver is actually sales. And then also, in the longer term, obviously, we're looking at potentially restructure some of our cost base, including brand and rental relief, as you mentioned. In 2022, in the first quarter, the government has launched some relief program for COVID. But I think for the most part, those programs are aimed at small to medium tender prices. For rental relief, I will continue to work with the landlord, not only is for rental relief, but also in the longer term, as you mentioned. We don't target to a growth number for our stores, but we would like to have a quality store open. So we would continue to grow the landlord to make sure that our rental cost structure is competitive in the long run, and that's most important. But I think -- the biggest driver for office margin, as I mentioned, is sales leveraging and deleveraging. And then also, if you look at energy costs also go up. All in all, I think like as we mentioned, those are the smaller factor, but the sales leveraging is the biggest. Basically, I want to understand your opinion here, how much of your cost of good sold and also the restaurant has fee. Because so P&L, so I don't see that the run, 30%. Brian, I think your line was coming in and out, but my -- I guess your question is about cost, I mean particularly variable costs versus fixed costs, in our -- okay. So I think as I mentioned before, obviously, the key cost structure for us is largely variable cost is the wall input and paper and packaging for our products. And so we have a hybrid model, obviously, we have full-time workers and then we also have a large part-time workforce that on a more flexible scheduling basis. In terms of O&O, as you mentioned, the rent, a big part of a large percentage of the rent, 80% of that have a variable component to it. And in terms of dollar side, it is probably -- depending on the sales, obviously, use is wearable. So a number of times, maybe 40%, 50% of that, above 50% or so at this time, about it's wearable for rent. And then we also have, obviously, marketing expenditure and all that reflects around that. So your overall cost structure, I think it was fair to say that majority of our cost are flexible wearable. But we also have a very large portion of them is fixed, including our G&A expenses. For example, salary for our headquarter staff, local operations and then the fixed cost in the rental. So -- but we -- as we mentioned before, we're doing a lot of things to control costs in the near term, but also looking into longer-term structure. For example, like G&A and in the short term may be impacted by sales leveraging and deleveraging. And then -- but in the long term, our goals would keep G&A growth to be below sales growth, for example. We'll use technology improve our deposits and store format, et cetera, to make sure that in the long haul, our labor productivity is in a good trend. And since the COVID hit several big cities in China, so if this trend continues, we want to know how it will impact our store opening such as maybe we can only find the store locations in lower-tier cities and less-impacted regions . We look at this Taco Bell opportunity in -- for a very, very long time. If we look at, let's say, Pizza Hut we are already in 700 cities. So if we in the coming 3, we want to open at least 225 stores. And honestly, it's not that. So obviously, we have looked into the Taco Bell business for a number of years. But as Joey mentioned, we still have a lot of opportunities, not only for our existing brands, KFC have to enter, but obviously, for Taco Bell. If we look at the reason why we are confident about stepping it up, obviously, we have experiment with the brand quite a bit with the format, the pentamer and whatnot. And then I think some of the product testing that we have earlier to make us more efficient and flexible are showing some very encouraging sign, especially for the newer smaller format, which is about 1, 2 square meters and lower capital expenditure and with simplified menu. I think if you look at the store performance, that give us quite a bit up. Again, like we -- obviously, it's really important for us with any store opening is the dicing process. And so in terms of our Taco Bell is we -- I think we've seen that in the urban top-tier cities, pretty popular with younger generations. So -- and then if you look at -- during the lockdown period, the brand also did quite well with the product offering as well as the delivery coverage. Over the next few years, you should see more growth in that brand, and then we would obviously separate investment with Taco Bell international to drive that store and that growth Thank you."
}