{
    "symbol": "BHG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 10:36:02",
    "content": " Good morning, and welcome to Bright Health Group's fourth quarter 2022 earnings conference call. Leading the call today are Bright Health Group's President and CEO, Mike Mikan; and CFO and Chief Administrative Officer, Cathy Smith. A reconciliation of the non-GAAP to GAAP measures is available in the company's fourth quarter press release, available on the company's Investor Relations page at investors.brighthealthgroup.com. Good morning, everyone, and thank you for joining Bright Health Group's fourth quarter 2022 earnings call. I will then briefly discuss our ongoing efforts to exit the ACA marketplace insurance business, before turning the call over to Cathy to go over our fourth quarter and full year 2022 results. As you may recall, in January, we provided an overview of the strategic focus for the continuing business, and how it is built for success in value-driven care. Importantly, when we speak of value-driven care, what we are focused on is the value layer of healthcare, the common set of value additive capabilities across managed care and care delivery that drive consumer satisfaction and better health outcomes at a lower cost of care. As a reminder, our continuing business consists of two segments: Consumer Care, which includes our value-driven care delivery business; and Bright HealthCare, which is our delegated senior managed care business. And as we continue to execute on our efforts to rightsize the business, we expect adjusted EBITDA to be profitable in both segments and at the enterprise level in 2023. In our Consumer Care segment, our value-driven care model has demonstrated differentiated results, and because of that, it has attracted significant commitments from payers in each of our core markets. Approximately 65,000 of those lives are attributable to our ACO REACH business with the balance being a mix of value-based care contracts with our payer partners, including Marketplace, Medicare Advantage and Medicaid Consumers. In the first year of these contracts, we have been prudent in the level of risk we're assuming and have eliminated the downside across our contracts to focus on achieving adjusted EBITDA profitability in our Consumer Care segment. However, consistent with our belief in value-driven care, we will continue to move these contracts to greater risk sharing and fully capitated models over time. Our expectations for the Consumer Care segment have not changed, but due to a revised revenue recognition accounting treatment, which Cathy will explain further, we now expect revenue of $1.1 billion or greater in our Consumer Care segment. We have been building strong relationships with our payer partners in our Consumer Care segment, and because of our aligned model, have been able to quickly attribute live this year and engage with our members. This segment is well positioned for capital-efficient, long-term growth and we continue to build a strong foundation, serving aging and underserved consumers that have unmet clinical needs through our fully-aligned care model. We continue to focus on integrating the business, executing operational improvements and driving towards segment profitability in 2023 on an adjusted EBITDA basis. In addition, we had strong performance in the annual enrollment period and started the year with over 120,000 Medicare Advantage consumers, resulting in positive net consumer growth in California. And as a reminder, given our strong positioning in special needs plans, we expect to grow within the year and our forecasting ending the year with over 125,000 Medicare Advantage consumers. As Cathy will discuss in a moment, there are several elements that impacted our financials related to the discontinued business, specifically one-time and exit-related winddown costs. However, if you exclude such costs, we met the 2022 annual guidance range for medical cost ratio and adjusted EBITDA that we set last March. Since the changing composition of our business for 2023 means that outside of the Medicare Advantage business, historical results are less informative for our future performance. From there, I'll provide an overview of the continuing business' performance and then review our 2023 outlook. Our $350 million credit facility was fully drawn as of the end of Q4, when factoring in the $46 million letter of credit committed to support our direct contracting business. The credit facility had a minimum liquidity covenant, which required us to maintain $200 million in cash, limiting our short-term flexibility. With that in mind, I'd like to touch on some information that will be included in our 10-K. Our financial statements will include a going-concern qualification, which is predicated on the company's ability to obtain additional capital to fund our ongoing operations over the next 12 months. Our current credit facility is set to mature early next year, and we have continued to work on options for the credit needs of the business. We continue to settle the remaining claims for the discontinued operations and gain additional insight on the risk-adjustment liability, based on the latest  report received in February 2023 with claims paid through December 2022. In the fourth quarter, revenue for the continuing operations was $551 million and $2.4 billion for the full year. The Consumer Care segment contributed $364 million and $1.8 billion for the fourth quarter and full year, respectively. For reference, our California Medicare Advantage operations achieved an approximately 92% MCR in 2022, excluding prior-period claims. The fourth quarter adjusted EBITDA loss was $109 million for continuing operations, and the full year adjusted EBITDA loss was $233 million. It is important to note that this includes approximately $500 million of non-cash charges, investment impairment charges, exit-related costs and restructuring charges. In addition, other non-GAAP adjustments of approximately $100 million, including 2022 investment losses, would bridge our full year 2022 adjusted EBITDA still within the guidance range provided in March of last year. Value-based care consumers were up modestly in Q4 to approximately 530,000, including over 410,000 from Bright HealthCare, 46,000 from direct contracting and over 70,000 from other value-based external payer relationships across Marketplace, Medicare Advantage and Medicaid. Of the Consumer Care lives, approximately 30% were directly attributed to our clinics. And as we said in our update in January, we have been very successful in retaining those lives through our expanded external payer contracts, as well as moving consumers from affiliate relationships to being served through our clinics. In the fourth quarter, we recognized the full year 2022 change in revenue recognition and associated medical costs, moving from gross to net revenue recognition for some third-party payer contracts. Further consistent with the full year 2022, Consumer Care includes Bright HealthCare commercial lives, which gets eliminated with enterprise reported consolidation. In direct contracting, now ACO REACH, we demonstrated strong performance in our first full year, with a full year gross margin of more than $8 million, and approximately breakeven on an adjusted EBITDA basis. In summary, our fully-aligned care model performed well in 2022, delivering solid performance with external payers and in direct contracting. While our expectations for the continuing business in 2023 are consistent with our view provided at that time, due to the change in revenue recognition for value-based care contracts, we are forecasting a lower revenue range for 2023. It is important to reiterate that we are managing significantly more external lives and their underlying medical costs than last year, but we have structured performance-based contract with prudent levels of risks. In Bright HealthCare, we expect end-of-year Medicare Advantage consumers served to be greater than 125,000, and we expect the medical cost ratio for the segment of 86% to 88%. In Consumer Care, we expect a total of 275,000 to 300,000 total value-based consumers, including approximately 65,000 from the ACO REACH program and 210,000 to 235,000 from our value-based relations with other payers across Marketplace, Medicare Advantage and Medicaid. We expect both operating segments of our continuing business to be profitable on an operating income basis, excluding non-cash charges. And we expect those segments contribution, combined with a total company adjusted operating cost ratio between 13% and 14%, to result in enterprise adjusted EBITDA profitability for the year. We are confident in our path to adjusted EBITDA profitability for 2023, and I want to provide a little more detail on the bridge items in each segment that support our forecast. In Consumer Care, the largest driver of improving profitability is membership growth, new payer agreements, mix shift of more consumers served through our clinics versus affiliates, and growth of our ACO REACH members. On a GAAP basis, the segment operating loss in 2022 was also depressed due to an intangible asset impairment that is not expected to recur in 2023. In our Bright HealthCare segment, the year-over-year profit improvement was primarily due to pricing, RAF increases due to  (ph) continuity and medical cost management initiatives. As a reminder, our California Medicare Advantage business had a medical cost ratio of approximately 92%, excluding prior period claims in 2022. On a GAAP basis, Bright HealthCare 2022 results also included a goodwill impairment charge that is now forecast to recur in 2023. As we look ahead to 2023, we are confident that our continuing business is well positioned for both the current market environment and the future, as we expand our refined model. We're serving the fast-growing aging and underserved consumer segment, and we see significant opportunities for future growth across both our continuing business segments: Consumer Care and Bright HealthCare. Before we turn it over to questions, I want to thank the team at Bright Health for their hard work as we make this transition in our business and as we focus on making healthcare right together. I mean, the biggest driver is the rate increase, but we do expect as we -- if you know, Josh, we've grown -- since we've acquired our MA business in California, we've grown significantly. So, now that we've got several -- couple of years of memory continuity, naturally, we've improved coding, and so we're going to get a lift with respect to RAF, or we expect a lift in RAF next year, and that -- we think that's worth about 100 basis points. And then, how you bridge from the kind of normalized 92% MCR in 2022 to the midpoint of our range of 87% is 100 basis points of medical cost initiatives working with our delegated senior care partners and trying to drive down -- continually drive down unnecessary costs. So, first of all, our business going forward, Josh, is -- as we've talked about, is a very different risk profile. We believe it's adjusted EBITDA profitability going -- profitable going forward, cash flow positive at the both segment level with less volatility. As we've worked through the last of couple months, we've done a really good job of paying down claims, working with our state regulators to get fixed liability around the clean component of the discontinued operations. So, we believe every day we're getting closer to fixed and certain liability around the discontinued ops and that's very consistent and in line with what we booked at year-end. As Cathy said, our current cash position is about $150 million on the corporate side, Josh. What we had said previously at the J.P. Morgan conference is, we believed we would end 2023 with about $200 million to $300 million of corporate cash or risk-based capital that would come back to us over time, likely early '24 -- in 2024. And then, in addition to that, our long-term investment portfolio that's invested in treasuries and fixed income, given the rising interest rates, we had an unrealized loss of about $70 million that will now turn into a realized loss as we exit the business and pay down the remaining obligations, both claims and risk adjustment in 2023. So, with our $350 million credit facility that we have today, that was coming due next year regardless, we knew we had to renegotiate that. So, we're working with our Board and our advisors to, at a minimum, replace the credit facility with full access to liquidity and put in a permanent capital structure that is more representative of the credit risk profile of the business going forward. So, hopefully that gives you a perspective on our cash needs and the current situation we have with our credit facility that's coming due next year. So, it sounds like the $200 million to $300 million is closer to zero based on where you are today with the true-up and the realized losses, and that's probably what has to get solved for by the end of April. So, as you know, the majority of our business in 2022 was the partnership between our Consumer Care segment and our Bright HealthCare business. While we did have -- do have external payer contracts in 2022, the majority of the business was with Bright HealthCare. And so, when we decided to exit the ACA insurance business with respect to being an insurance carrier, we very much believe that we've got a strong integrated platform that can perform well with other payer partners. And so, we went to the Marketplace in addition to the current group of payers that we have relationships and we expanded those with other payers to develop a relationship in an aligned way to serve, as we say, the commercial marketplace, the Medicare marketplace and Medicaid. And hence, that was the impact with the limited downside and especially in year one contracts with our risk arrangements in the ACA marketplace, which we think was the prudent thing to do. And we want to move to full risk contracts across all of those product categories, because that's where we believe you're going to get the best performance. And then, if you split out, there is somewhere between 10,000 and 15,000 Medicare Advantage that are full risk contracts. And the remainder of the risk, I would call, are partial or performance-based with a collar around upside and downside, but they are value-based arrangements, as I said, which will over time move to greater risk. So, the first bucket is, as we've moved into third-party payer contracts, we structured those contracts to be what we think is a good balance for us going forward for profitability. And then, next to your point, we did note in the prepared remarks that our owned clinics while serving those value-based care lives performed better than what we saw in the consumers that are associated with the affiliate clinics. Remember, in 2022, we had a relationship with Bright HealthCare in the ACA marketplace, significant start-up cost to invest in Florida last year, invest in Texas this year as year one, and they were full downside risk. And so yes, our expectation is going forward for the lives that we're serving in those markets with our -- with the relationships that we've established with external payers will perform better for us in 2023. Sorry, you ask about -- I think you're asking about the RADV decisions that are coming out and if that' it, I would say we're still...\n Not RADV, but more the proposed MA rate update and the 3% coding adjustment, the changes in code ICD-10, limiting some of the codes, that aspect of the rate update? We're focused on 2023, and we've offered up the bridge to get us from the restated medical cost ratio of 92% to our midpoint of 87%, which includes the rate for this year and about 100 basis points related to risk adjustment. I don't know the total number, but I know that incrementally we would have another $600 million or so of revenue had we grossed up completely, that would have been in the range -- the higher end of the range that we had given previously. Justin, we can follow up with you with more of an accurate number of the total cost of care related to our risk-based contracts. With respect to the contracts, we are intended to have a -- our contracts have essentially a targeted total cost of care, medical loss ratio, which we entered into an agreement with our partners and then we are sharing upside and downside. As we said, as we enter into a new market or a new partnership, we need to understand the book of business, the referral patterns, the network contracts and preferred networks that we're working with, all of which we hone in on over time with our alignment model to improve results. And as we gain more knowledge of the consumer base, the referral patterns and all of those managing the care, we're willing to take on more risk, because we know we can manage it better from a local capability perspective at the point of care than just the insurance or managed care side of the business. We expect a pretty comparable -- we performed well in the first year in conjunction with our partners, our alliance physician partners, but as well in our own clinics. So, we're -- and we think around the 98% loss ratio or so is our expectation for 2020 -- it was for 2022 actuals and we believe it's the expectation for 2023. And for the operating expense improvement in that bridge, both on the Consumer Care front as well as corporate, I think, Cathy, you mentioned that those ranges reflect actions that have already been taken."
}