{
    "symbol": "COTY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-25 12:06:12",
    "content": " At this time, I would like to welcome everyone to Coty's Fourth Quarter and Fiscal 2022 Question-and-Answer Conference Call. As a reminder, this conference call is being recorded today, August 25, 2022. Please note that earlier this morning, Coty issued a press release and prepared remarks webcast, which can be found on its Investor Relations website. On today's call are Sue Nabi, Chief Executive Officer; and Laurent Mercier, Chief Financial Officer. In addition, except where noted, the discussion of Coty's financial results and Coty's expectations reflect certain adjustments as specified in the Non-GAAP Financial Measures section of the company's release. The first is just on Travel Retail, China and e-commerce. And then Sue, I'm going to ask you a tough question. I'm hoping you're willing to answer, but there's been a lot made about the carrying relationship in that portfolio of brands. So first, let me start with the first part, which is around the strength of the business. Indeed, the Travel Retail, e-commerce and China, I will say a few words about China later, are clearly our Travel Retail and e-commerce, key contributors to this I would say, best-in-class performance that we had in Q4 and in fiscal '22. I really hope that everyone will recognize today and now that these 8 quarters of results on par or ahead of expectations of our guidances and of course, most of our peers, it's clearly hopefully going to be recognized as a great achievement. When it comes to Travel Retail and the fact that Travel Retail has been a key contributor, it's true that for all of us, specifically those who've been traveling, we've seen now there is a huge surge in terms of travel worldwide. And this surge of travel, of course, translates into beauty figures, if I may say, specifically at Coty. Year-on-year, to take 1 example, it's 3x -- triple-digit growth, sorry, in terms of what we are seeing there. This is across the full board of categories, our fragrances and specifically our highest end fragrances and more artisanal or niche fragrances are doing fantastically well, gaining market share, thanks to Travel Retail exclusives, but also thanks to the level of innovations. Our new category, because we entered the -- before the pandemic Travel Retail was 1 category channel, it was mainly fragrances. Now Travel Retail is fragrances, Prestige Makeup and of course, skincare. And on Prestige Makeup there, we've been doing also fantastic figures, thanks to the different brands, the Burberry Makeup, Gucci Makeup or more recently, Kylie Cosmetics, which had fantastic results in the top airports around the world. And last but not least, this channel is now fully benefiting from the repositioning of Lancaster from a sun care to a skin care brand, that started first in Hainan, but that's currently spread into Mainland China at Sephora as an exclusive partnership. And we've seen that this brand has been posting a double-digit growth in fiscal '22, which overall also had to do a lot with Travel Retail performance. This is clearly, I would say, the case in the Prestige division. And this honestly, I have to say, it's a big satisfaction for us because our brands are becoming dominant brands on social media, specifically CoverGirl, of course, but also Rimmel. We've done a recent launch called Thrill that happened at the end of the quarter and beginning of Q1, that's doing fantastically well, 100% co-created with TikTok-ers. So clearly, this part of the business is a key contributor. And you can imagine that in the coming quarter, it is going to continue to be a key contributor. On China, of course, like everyone, we've been impacted by the lockdowns at the end of Q3 and during Q4. That's what we have seen in Q1, now 2 months into Q1, is that China has fortunately strongly rebounded. We are seeing double-digit growth, not at the level of what we had inside prior to the first, I would say, slowdown because of the restrictions, but very, very strong performance. And overall, Coty China had a plus 11% performance in fiscal '22 to be compared to a market that was minus 1%. Now concerning the second part of your question, first of all, I'm not giving, as you can imagine, to do a lot of comments on speculations. But what I can tell you is that our long-term partnerships with our top fashion houses are continuing to be of a great quality and the other thing that I would like also to stress now that you're asking me the question is that I'm taking again this opportunity to repeat, that no key license is up to renewal before 5 years So everything else is speculation. Of course, I think the resiliency of beauty is pretty clear during downturns. And then the second question is just maybe an update on what's going on with inventories at Retail, given that they're managing their inventories very tightly right now. So again, what I can tell you when it comes to the macro and what we are seeing currently, which is the best indicator of what we will hopefully oversee is that the beauty category is not showing any sign of slowdown, specifically when it comes to Prestige, but also the premiumized part of Consumer Beauty. Clearly, consumers are more than ever have to say, premiumizing, which is again, I guess, for all of us is a kind of surprise in the middle of this inflationary pressure, that they are premiumizing more and more. And during Q4, what we have seen is the movement, if I take the fragrance category, moving from Eau de Toilette to Eau de Parfum which are more expensive because more concentrated versions of scenting. This movement is confirmed and it's only accelerating, I have to say. We see them trading up in Prestige behind categories such as fragrances, but also behind categories such as Prestige Makeup. And on the Consumer Beauty side, the part that's the best preserved. And if you listen to what some of our partner retailers have been sharing recently during their earnings, it's clearly the premiumized part of the Consumer Beauty that's doing fantastically well. Probably, I would say that in the past, we were putting on 1 side the things that are priced and then things that are very, very affordable. I do believe that in beauty today, the market will be all about cool or desirable brands, be it from Max or Prestige and not cool and not desirable brands be it from Max and Prestige. over protected probably because this has become, I would say, we call it the fragrance index or the fragrance effect. It's clearly these products that are not only female but also male, fragrances are really consumed today by men, women, Gen Zs, Latins, et cetera, in the years to take this example. And these are categories that I do believe because they are making you look or feel better, are becoming more and more essential categories rather than what we could consider as categories that you would shop only when you're okay. In terms of inventory, to answer the second part the retailers have indeed excess inventories in some other categories, but not in beauty. In fact, if you listen again to the earnings from the different retailers, if there is 1 preserved category, it's in the beauty. So Javier, I would take the question. So consumer beauty, on the first question on supply chain. And I would say, it's not specific to consumer beauty. So number one, indeed, I mean, the issue we raised last time in our last webcast this is the result, I remember when we had the call, we were telling you that this was really in good progress. However, from a global standpoint, Obviously, as our peers, we are not immune from current supply issues. But definitely, we are well protected, and we know we have a service level which is in the low 90s, which is a good performance. So why we are protecting this is definitely because we worked now for several quarters on dual sourcing, on local sourcing and also, we had also some contracts on freight, which could protect us. And as you can imagine and as you know, this is a daily focus from all the teams, we need to keep a strong improvement and control on supply chain. So also you have both elements, and this is indeed what we have to manage. Second, -- you are absolutely right, consumer beauty profitability moving better than expected. So the recipe which has really improved the gross margin, this is something which is really absolutely in the DNA of Consumer Beauty teams, thanks to all the levers mix. So this is really a key element, the new innovation we are launching are really premiumized and really helping definitely the mix on the gross margin. But I mean assisting every time in a very granular manner, in a very detailed manner, so it's very, very precise and also optimizing cost of goods because rationalization of the portfolio is platforming, which is really a key element. We raised a few times that when we are doing astute innovation, for example, CoverGirl we can use the same platform then to replicate a Max Factor or Rimmel, and by doing . And then, of course, we are using this money to inject the media in the new city. Since we had the question that indeed in Q3, the level of A&CP was rather high in consumer beauty this was a conscious decision to support all those initiatives and then indeed now delivering sustainable profitability in consumer beauty and obviously, we continue in fiscal '22 and beyond. It looks like you're expecting about 200 basis points of margin improvement in the first half, but -- prior to the second half. It's obviously a space that you have great color into, but it is becoming more and more crowded. And first of all, I really want to remind that on some of the metrics on top line and EBITDA, indeed, I mean, our fiscal year '23 guidance is completely in line with the midterm guidance that we gave you, remember in November. So definitely, the marginal guide implies this, but I would say it's still a little too early to go more in that between H1 and H2. So it is really definitely we continue the gross margin expansion, disciplining fixed costs, investing and delivering this full year guidance. Now navigating H1 and H2, it may be something that we adapt during the year depending on the evolution of all the metrics. So I'm going to take the second part of the question, which is around celebrity and influencer-led brands. This is a very, very competitive part of the business. I think all of us, we see a lot of brands launched on a daily basis, almost daily, so it's very, very competitive. There is a selection that's happening because the ability to have a go-to-market that's strong as a Coty go-to-market, to be present in hundreds if not thousands of stores globally, this is clearly an element that selects a lot of DTC brands as potentially becoming bigger brands. In terms of right level of investment, as you can imagine, these brands are born on social media. They have natural A&CP, if I may, call it like this because of the reach of the different people who are reaching to the communities on a daily basis. And therefore, there is less need to overinvest in media, like we do it on classical brands. So it's really this kind of, I would say, compromise that we need to find depending on the brand and depending on the kind of innovation. So again, when it comes to the first part, which is the contribution, as you can imagine, we do not share figures of how much this brand is going to contribute to the growth of the company. But clearly, the start of this new line is very good. And something that's for me and for all of us is a very, very strong sign is that the best-selling item is not a single product, the best-selling item is the full line of 9 SKUs, which is priced at $575. So for us, if consumers are ready to spend $575 on a set of 9 products, it means a lot in terms of how they trust the brand, how they trust what we are doing together on this brand. What I can tell you about the fiscal â\u0080\u009923 guide, it's not dependent on this launch. It's really that my job and Laurentâ\u0080\u0099s job and the job of all the people at Coty, is to build a growth that's as balanced as possible in terms of geographies. You've seen that, in fact, not being overexposed to China protected us recently. In terms of categories, we are working hard to make sure we have all categories in hand so that whatever happening in 1 category or the other, we can accelerate in 1 category versus another in terms of brands, not being dependent from any brand. And clearly, this is something that's a key element that is part of the way we are building the net revenues not only for fiscal '23, but also into our algorithm that we presented to you a few months ago. Well, in terms of what are the key building blocks for our fiscal '23. The quick follow-up would just be, Laurent, you did note some buckets of gross margin in the prepared remarks. So I mean, first of all, let me remind, as you noted, I mean, gross margin expansion in fiscal '22 close to 400 basis points. So you can really see that all the actions, all the initiatives that we put in place delivered strong results. We still have some initiatives that we are implementing to continue gross margin expansion, definitely not at the same reason as we had this year, and it confirms really, as I just shared, that we are very confident in moving to the mid 60s gross margin by '25. And again, we see concrete results of what we have achieved in fiscal '22, which is really the premiumization of fragrance either in segments and also makeup and the next phase indeed in the skincare, but also in Consumer Beauty. We, obviously all the new innovations that we are launching, are margin accretive. So we see that driver and we continue in fiscal '23, and it's part of the strategy and all the initiatives that we'll be having. Number 2 is definitely pricing, and I can elaborate a little on this because this is a key element. And again, it's really quality of execution. So we are definitely, from a top line standpoint, weâ\u0080\u0099re doing very well. Then on cost of goods, definitely, there is a strong headwind due to inflation. So it's 2% and also cost of goods, we have strong intangible actions which will help the gross margin. We are also working as of now on platforming of the value analysis reviewing all the formulas, either Consumer Beauty or Prestige and really with the objective to simply find the formula to standardize and also to have late differentiation. And by doing this, we are making savings in procurement, but also in manufacturing. This is uncaptured in the all including umbrella, and this will keep supporting gross margin expansion in '23. And again, same flywheel to keep fueling all the key initiatives that we have in the growth agenda. Sue, maybe building on your comments earlier around balance across the portfolio. And given the macro comments you made earlier and current momentum, I'm guessing Prestige is to, again, be an amplified driver of growth, but perhaps you could just talk through the magnitude and sensitivities there, number one. So let's start with the first part, which is around how we are building in such fiscal '23 growth. As you can imagine, there is what we call at Cotyâ\u0080\u0099s fragrance index that's happening , which is clearly about this category clearly supporting the growth of the beauty category not only in the U.S. but globally. And we see it continuing to premiumize to commend higher pricing with a lot of innovations, either from our artisanal brands or more mainstream brands. So clearly, this is going to hold us clearly during fiscal 2023. Clearly, we will continue to execute on our makeup strategy, Prestige makeup strategy. There, again, the brands that we are having in this area are growing superfast and therefore, there are going to be key contributors even if the base is smaller. So by definition, in absolute value, it's just a contributor, but still it's a key one. And last but not least, we are, for the first time, starting to operate a full skin care line in China. I'm thinking about Lancaster, but hopefully going to slowly but surely become a key contributor in our growth agenda. So to see by nature because of the markets and because of the fact that we are adding categories is going to be in a way, a key contributor to fiscal '23. I remind you that the Prestige business is 60% of our net revenues, while Consumer Beauty is more or less 40%. I'm thinking about Thrill Seeker that started in U.K. behind the Rimmel brand, but having fantastic start. It's the first product that has been co-created 100% with TikTok in mind with TikTokers as not only creating the products but also part of the campaigns, holding and facing the campaign in front of consumers. But also in the U.S., CoverGirl, we are activating one of the most powerful franchise behind CoverGirl, which is Simply Ageless. And this line, every time we put money and investment behind, we see it growing super, super fast, and we are also still including recently in the most recent launches. So clearly, this is, I would say, the way we described how we have built fiscal '22. Now when it comes to China, what we are seeing is that -- of course, they have been lockdowns, there have the pressure on consumption, including e-commerce. But what we are seeing now 2 months into the first quarter of fiscal '23, at least for Coty is that the spike in our sales is back to, I would say, levels that are not the same as the ones we had beginning of calendar '22, but very, very strong double-digit level. China is so small for Coty that anything we do, just doing the right things is a potential upside for the whole business there and therefore for the company. And then just touching on the recent Ant partnership that was announced, weâ\u0080\u0099re excited to hear that. So let me start with the first part, which is around what we are seeing in product Cosmetics and how much of this is driven by reopening versus something that's more sustainable, if I understood quite right, the question. So what I can tell you is that what we are seeing is on top of the strong categories that were booming during the lockdowns and post pandemic, I think of anything that has to do with eye products, be it mascaras, growth products, lash growth serum, eyeshadows, et cetera, we are seeing the rest of the categories back to growth, including lip color But not any kind of lip color interestingly, the launches that are doing the best at Coty and specifically, I think about CoverGirl in the U.S., it's seeing rebounds. Rebounds that probably are mixing the right things that people are looking for, which is on 1 side a hint of color and on the other side, a lot of care. And this is for me a sustainable trend, if I may say. There will be more and so people are going to look for more pigmented makeup, moments where they will look for less pigmented maker. But whatever will happen, what I call skin side makeup or healthy makeup whatever you like name, this is the key trend behind the consumption of this category in the U.S., that we also see the same things more or less around the world in other regions. And therefore, to add on to the Travel Retail huge figures, remember, I shared with you that Travel Retail is back to the levels pre-pandemic. But this is still with a minus 20%, minus 30% less passengers, so having all these consumers back to this channel can only confirm the importance of Travel Retail. I guess first, just on marketing spend, ad marketing spend. Is there any particular benchmark you're using and then sort of more specifically, it was up 600 basis points as a percentage of sales year-on-year, obviously contributed to strong growth. So Mark, so indeed, as you saw in '22, I mean, we were able to step up significantly our level AnCP, and now to be in the range of a high 20%. We are making very clear that high 20s is really for us, -- is a accurate level and definitely within our flywheel. Now definitely, within high 20s is really the way. And again, the granularity is really how we spend the money. So definitely, its really the quality of execution. So definitely, the allocation of this money, everything is defined through ROI KPI, both in Prestige and in Consumer Beauty. And definitely capturing the trend that Sue have just explained, and I want to dig also on the well-balanced good points, because then we can allocate per geography in a balanced manner, per category and also per brand. So this is definitely what we are doing, is allocating the initiatives really per ROI. Another element also because, of course, we are talking about percentage, per dollar, that is also within AnCP, we have also some productivity and optimization initiatives. Definitely, if I take an element that we are calling other AnCP, which maybe is less visible, of course, media is very visible. But there are also some other areas which, I would say, are nonworking where we have also really improving umbrella, some strong productivity initiatives. I can just give you some examples about samples, textures, marketing materials, which are basically area where we have some optimization. But always with the same mindset that optimization productivity we are doing on this line, we can reallocate in the working media and push definitely the business agenda. I mean there is -- I mean -- and we don't answer this level of detail, but what I can tell you again is that, of course, Prestige gross margin, as you know, I mean, is higher than Consumer Beauty. But again, as I shared several times and the gross margin agenda is valid for both segments. To elaborate a little more within -- Consumer Beauty, definitely that all the initiatives that we are making, so Prestige Makeup, e-commerce, but also geography, we mentioned about China, all these initiatives are really driving gross margin accretion. Super happy again to report these results, again, best-in-class results, and we hope to talk to you soon about what's happening in Q1. Ladies and gentlemen, this does conclude today's call and webcast, and we appreciate your participation."
}