{
    "symbol": "COTY",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-08 11:47:07",
    "content": " My name is  Please standby, your program about is about to -- At this time, I would like to welcome everyone to Coty's First Quarter Fiscal 2022 Results Conference Call. It's a simple one with strong revenue growth combined with growth margin and cost initiatives, synergy  profit expansion and strategic investments, which in turn drive future growth momentum. First, our Q1 revenue growth surpassed our expectations and guidance with growth coming from both our Prestige and Consumer Beauty segments. We continue to see a very strong demand for Prestige products, particularly fragrances in the U.S. and China, with an impressive rebound in travel retail. Meanwhile, we continue to see a recovery and improvement in Consumer Beauty with particularly strong trends as at both CoverGirl and Max Factor. This was fueled by a significant gross margin expansion of nearly 500 basis points, as well as further cost reductions. The substantial gross margin expansion we have seen, is a true testament to the strength of our business model as we double down on a creative innovation and continue to preimmunize our portfolio. Despite this, our adjusted EBITDA increased almost 70% equating to 550 basis points of margin expansion. Our growing confidence in the momentum drives our increased sales guidance for the year, supported in particular by our initiatives across fragrance and cosmetics. We continued to experience very robust prestige fragrance trends, particularly in the U.S. China and travel retail with nearly all brands exhibiting strong growth in the quarter. The Americas region grew 23% like-for-like in the quarter, supported by double-digit growth in the U.S. as well as growth contribution from Latin America, Canada, and Brazil. EMEA sales rose 17% like-for-like, with the most impactful contributors being the UK, Russia, as well as local travel retail. The Asia-Pacific region increased 29% like-for-like, with local travel retail tripling year-on-year and China seeing nearly 50% growth in the quarter, proving our efforts in turning this market into a powerhouse are bearing fruits. I am very pleased with our first quarter results, which continued our very strong pace of profit growth. Our profit was driven by strong gross margin improvements, allowing us to continue to reinvest in our strategic growth initiatives, thereby further fueling top line growth momentum. Starting with our gross margin performance, our Q1 adjusted gross margin of 63.4% increased by nearly 500 basis points from last year, and 250 basis point from last quarter. Our gross margin performance was driven by favorable mix, both from the outside growth of Prestige, as well as favorable product mix within the categories, lower excess and , fixed costs absorption on increased sales, pricing and revenue management, supply chain productivity, and material cost reduction program. As such, we have a very clear, multi-pronged, multi-year gross margin attack plan in place, while we also expect we will continue to benefit from positive channel, category, and regional mix shifts. This is a result of both the agility of our supply chain and procurement teams, as well as our structure and drivers of our business model, where we are over driving gross margin accretive channels, categories, and innovation. The net result of all these proactive effort and business design decision is that our service level in Q1 was very strong in the mid '90s and actually higher than the prior year, which has allowed us to both over-deliver on our sales guidance for the quarter and deliver close to 500 basis points of growth margin expansion year-on-year. And our outlook for Q2 service labels is in a similar range despite higher than initially anticipated demand, which is also enabling us to raise our full-year sales guidance. While we do expect the impact from inflation in materials and freight to be somewhat higher in H2 '22, the impact is quite manageable, and we continue to expect our gross margin to expand in fiscal year '22. Fueled by revenue management initiatives in both Prestige and Consumer Beauty, submit benefit of Prestige expanding as a proper option of the mix, improved absorption from higher production volumes, and broader productivity efforts. First, we had a very busy launch calendar in the quarter, particularly within Prestige. Finally, we continue to invest behind to repositioning of CoverGirl, Rimmel, and Max Factor, which also promise results supporting Consumer Beauty business stabilization. We achieved approximately $60 million of cost savings during the quarter with a front-loaded delivery of our fiscal 22 savings target to enable sufficient flexibility in the P&L to deliver profit, yet reinvest in our brands during this critical holiday period. And we remain well on track to reach our fiscal '23 target of a total of $600 million of savings, while we also continue to identify savings projects beyond fiscal '23. Our adjusted EBITDA performance was exceptionally strong in the quarter, increasing 67% year-over-year to $279 million. This significant improvement was driven by strong sales growth, robust market -- gross margin expansion, and fixed cost leverage. Turning now to our EPS which included the following drivers, adjusted EBITDA for Q1 of $279 million, depreciation of $78 million, income tax expense of $40 million, which equates to a tax rate of approximately 29% in line with our expectations. As we previously noted, we expect a higher tax rate this year given our global principal jurisdictions are now in Amsterdam and in the U.S. $8 million of those are item and $29 million of adjusted preferred dividends. While not included in our adjusted EPS, during the quarter, Wella's fair market value rose by $390 million. First, consistent with what I said last quarter, we continue to expect interest expense in the mid $200 million for fiscal '22 reflecting a lower net debt balance offset by somewhat higher cost of debt post the recent refinancing. Third, on the preferred dividends following today's announcement actions with KKR, we anticipate a roughly $7 million quarterly run rate going forward following this transaction and assuming no further conduction of preferred shares. Now moving to free cash flow for the quarter, which was strongly positive despite Q1 typically being a seasonally weaker cash flow quarter as we build inventory for the key holiday consumption period. Turning to our capital structure, we ended Q1 with a financial net debt balance of approximately $4.96 billion, which is a decrease of over $200 million from Q4. This is largely, the result of our strong free cash flow, factoring a 40% stake of Zeta at quarter-end, valued at approximately $1.65 billion. Based on our current ownership stakes in Zeta, our economic net debt at the end of Q1 '22 would have been closer to $3.9 billion. It's a sizable cash inflow for this transaction, coupled with the expected strong free cash flow in Q1, reaffirm our confidence in ending calendar year of '21, with financial net debt to EBITDA to up 5 times as well, to end calendar '22 with leverage of 4 times. For some time now, we have seen straight keys to further unlocking shareholder value at Coty, growing our sales on profits, deleveraging our Balance Sheet, and the last being simplifying our capital structure. During the first half of this year, our capital structure has become significantly more simplified to KKR's conversion of approximately $50 million preferred shares combined with the subsequent redemption. Yet, 2 transactions of around $75 million KKR preferred shares in exchange for a roughly 14% staking data. However, these developments were a net positive for Coty, as well as for our shareholders, including significant even further reduce the other hang of KKR's preferred shares ownership. Conformation of the significantly higher value of , with approximately 40% appreciation versus the initial evaluation, while also proving the liquidity of the asset, freeing approximately $65 million of cash on the lower preferred dividend that we can use to further reinvest behind brand or used to have  . So, we continue to make strong tangible progress across our six strategic pillars in the first quarter, with many more milestones plans for fiscal 22 beyond. As you all know, CoverGirl has been our first area of focus within Consumer Beauty and I'm very pleased with the success we are seeing today. CoverGirl is the inventor of key makeup and leads this high growth area in the U.S., which is nicely accretive to our cosmetics portfolio. This has been supported by our strong launch cadence of clean, vegan, and cruelty-free beauty products, including Clean Fresh makeup and Lash Blast Clean Mascara. In fact, we believe this renewed focus on clean makeup is further supporting our gains with key demographics, as well as key retail partner such as Ultra, who is elevating CoverGirl as a leading example of an established mass brand, leading the path to clean beauty. I'm proud to say that since our reboot of CoverGirl at the end of March, the brand has gained market share in 4 of the last 7 months and we expect the momentum to continue. Importantly, CoverGirl is finally gaining shelf-space in total in the U.S., led by a key retailer where the brand is significantly outperforming the cosmetics category and also improving productivity. While Kind & Free is still only in pre -launch phase with a full national rollout and full media support going live in Jan, we are already beginning to see  sales at key retailers picking up in recent weeks. As previously mentioned, we have some outstanding fragrance launches during the quarter, further supporting our success in this key category. Globally, this is a first for us, with a key innovation seeing such strong immediate success across major geographies. In two of our key markets in Continental Europe, Germany and Italy, Flora  is also very strong, supporting the Flora line to be number 8 in Germany while Gorgeous Gardenia is the number one female fragrance in Italy. The fragrance is also gaining strong traction in China, where it has been renting as a top 10 CMS fragrance and longer our key brick and marked our retail partners, as well as on CML. Within men's fragrances, we launched Burberry Hero during the first quarter, where the fragrance is similarly seeing great success across all key regions and the fragrance remains on track to be a global nail icon. Hero has been the number 1 men's fragrance launch at many of our key retail partners since the launch, with its sellout results far exceeding our initial class. In China, Hero is also now a top 10 male fragrance since launch as many of our key brick and most our retail partners and on Tmall. This collection's so very strong sell-out trends within the first moments of becoming available online, leading to overdeliver relative to our initial plans. It's also important to note that with the relaunch, we have made Kylie Cosmetics significantly more productive than the initial range with fewer skews but delivering very high sellout. The growth continues to be phenomenal, our Gucci makeup sales in the quarter tripling year-on-year. Moving to our fourth strategic priority of building e-com and direct to consumer, we continue to experience very strong growth with e-com rising 23% year-over-year. Both Prestige and Consumer Beauty, saw growth exceed 20%. On a total Company basis, eCommerce represented a mid-teens percent of revenue at the end of the first quarter, that from a low-teens percent from last year's first quarter. This icon was chosen as the fragrance crush in August, still posting triple-digit sellout growth for the month despite lapping last year's launch. I'm pleased to say that despite this mix at backdrop, our China sales grew close to 50% in Q1. In addition, Chloe continues to be a standout performer, with sell-out doubling year-over-year, led by the  premium fragrance collection,  De Fleur This achievement is particularly notable given the limited amount of media support that we have given Chloe attributed flow, however, we remain very committed to further building on this success to become a more significant player within ultra-premium and a seasonal fragrance in China, as well as across the globe. As we have detailed, we saw very strong Prestige revenue growth in Q1 at 34% like-for-like growth, which in particular was amplified by the shipment of the key fragrance launches I have just discussed. Given the strong cost reductions and profitability in Q1, we intend to reinvest more in marketing spend in Q2 to further boost our sell-out during this critical holiday period, capitalizing on the unprecedented momentum our brands are seeing. We therefore expect our Prestige sell-out in Q2 to accelerate to high - teens growth, with selling a bit below sell-out following the Q1 pipe sale. From a profit perspective, our strong gross margin and profit growth in the first quarter is further enabling us to fuel the growth investment in Q2. As a result, we expect to deliver first half of fiscal '22 EBITDA growth in the low-20s, year-on-year, with EBITDA margins up approximately 100 basis points versus first half of fiscal '21. We therefore, need to invest to secure our near and mid-term growth that will be more and more profitable given the high-margin nature of this new businesses and our outstanding profit delivery in Q1 is allowing us to do just that. We now expect fiscal '22 like-for-like growth, low to mid-teens above our prior guidance of low-teens growth. We are confident that our gross margin attack plan, the creative innovations we are introducing, such as Rimmel Kind & Free, or Gucci Flora, and the continued premiumization of our portfolio, which fuel gross margin expansion for the year as compared to fiscal '21. As we are intentionally reinvesting our gross margin gain and cost-savings in our brands to maximize value and drive sustained momentum for the business into second half and, of course, beyond. We ended Q1 with the sales ahead of our guidance, while also delivering very strong gross margin expansion in both sequentially and versus last year in a volatile inflation and supply chain backdrop. Our Q1 exemplifies what we intend to do through this year, as well as the  circle cycle we had created with strong sales and gross margin fueling our profit and reinvestment. So again, we're pleased very much with this gross margin performance in the quarter with -- as you've said, it's 500 basis points of improvements year-on-year and up 250 basis points from last quarter. Of course, the first one, and it's something that I've been insisting on since me joining Coty one-year ago, a more favorable mix, both from outside growth from Prestige, as well as a favorable product mix within the different categories. And -- and you saw already the result last year, because last year we were already back even better versus Fiscal '19 and above 60%."
}