{
    "symbol": "IRBT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:17:11",
    "content": " While we still anticipate a meaningful acceleration in our second half revenue, we now expect second half revenue growth of 18% to 26% over last year's relatively soft second half, which had been impacted by component constraints. Along with a better second half gross margin, we also plan to carefully manage spending, which will translate into low double-digit operating profit margins in the second half of the year that will enable us to convert a full year operating profit margin of 3% to 4% into 2022 EPS that ranges from $1.50 to $2.10. Similar to the refunds we received for our 2020 tariff exclusion, we expect that U.S. Customs will issue multiple refund payments over the next 12 months, although the timing of any and all payments is at the discretion of U.S. First quarter 2022 operating expenses of $119 million increased by 10% due to primarily higher sales and marketing costs attributable to working marketing programs and increased personnel costs. We currently anticipate that approximately 65% of our 2022 revenue will be generated in the second half, which implies Q2 revenue in the range of $290 million to $318 million. In contrast to an expected first half revenue decline between 9% and 13%, we anticipate 18% to 26% growth in the second half of 2022 over the same period last year. In terms of product diversification, we remain on track to generate over $40 million in 2022, air purifier revenue with more than 70% of that coming in the second half of the year. In terms of our second quarter spending, we anticipate Q2 operating costs of $143 million to $144 million or 45% to 50% of total revenue. The combination of substantially stronger revenue, gross margin improvement and prudent spending is expected to enable us to deliver second half operating income of $116 million to $119 million. Well, certainly, the reason -- one of the reasons why the air purification performance for the year has a larger second half to first half ratio than the Roomba is because -- completing the integration, completing the efforts we're doing to fully integrate the Aeris product into the iRobot line is underway."
}