{
    "symbol": "TTEK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-06 15:50:16",
    "content": " Operating income was $84 million in the quarter, up 20% year-over-year, which reflected a 70 basis point increase in our operating margin over last year. Our net revenue increased 13% year-over-year from $638 million to $720 million, which represents an all-time high for any quarter in the company's history. Our operating income increased at an even faster rate, up 20% from last year, reaching a third quarter record of $84 million and increasing our operating margin by 70 basis points from the same quarter last year. And finally, we delivered $1.09 in earnings per share, which is up 15% from the $0.95 that we produced last year and is a new all-time high of $1.09 for the third quarter and the second highest earnings per share of any quarter in the history of the company. And finally, our work for our U.S. federal clients represented 27% of our net revenues in the quarter and was up 8% year-over-year if we exclude the onetime impact of our Afghanistan wind-down that took place almost a year ago now. The strong performance from our operations resulted in a top line growth, with third quarter revenue of $890 million and net revenue amounted to $720 million, which was above the upper end of our guidance range of $665 million to $715 million. Our reported operating income came in at $84 million this quarter, up 20% over last year. Our improved operating income for the third quarter was largely driven by our 19% growth in the CIG segment net revenue, coupled with a 44% growth in CIG's operating income. Cash flows generated from operations for the third quarter totaled $98 million, an increase of 42% over last year. Because of how our 52-, 53-week fiscal year works, we had an extra week in last year's Q4, which we do not have repeating this year that will result in a year-over-year impact of about $50 million or 8% of net revenue, which we highlighted on our previous earnings call. So in total, the net revenue amounting to $614 million should be utilized as a baseline for the year-over-year comparison to the fourth quarter and fiscal 2022 guidance that Dan will provide in the next few slides. First, our guidance for the fourth quarter is for a net revenue of a range of $676 million to $726 million for net revenue and an associated earnings per share of $1.13 to $1.18. This guidance both for the fourth quarter and for the year includes -- for the fourth quarter includes intangible amortization of $3.4 million, which is approximately $0.05 per share, effective tax rate of 26% for the fourth quarter, it assumes we have 54 million shares -- diluted shares outstanding, and it does exclude any contributions of revenue or income from acquisitions that we completed during the fourth quarter or the remainder of the year."
}