{
    "symbol": "PSMT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-02 00:13:08",
    "content": " Net merchandise sales came in at $990 million, just shy of $1 billion, which represents year-over-year growth of 13.6% after a negative 2.9% currency impact. Total gross margin for the fourth quarter of fiscal year 2022 as a percentage of net merchandise sales was 15.5%, or a 40 basis point decrease from the fourth quarter for fiscal year 2021. However, in terms of total dollars, the gross margin - total gross margin increased by $15.3 million or approximately 11% versus the same quarter of the prior fiscal year. For the fourth quarter of fiscal 2022, the average sales price per item has increased by approximately 9% compared to the same period of the prior year. For example, our U.S. fresh category for fiscal year 2022 saw private label sales growth 30% versus the comparable prior year period. Total net merchandise sales were $324.1 million, an increase of 12.1% over the same period in the prior year. And comparable merchandise sales for the four-week period ended October 2, 2022, increased 7.8% compared to the comparable period last year. However, once again, currency fluctuations continued to negatively impact that merchandise growth and comparable net merchandise sales by 2.0% and 2.1%, respectively, in the first month of the fiscal quarter. Total revenues and net merchandise sales came in at $1.02 billion and $990 million for the quarter, respectively, increases of 12.3% and 13.6%, respectively, over the comparable prior year period. Our comparable net merchandise sales growth for our fiscal fourth quarter was 9.2% for the 14 weeks ended September 4, 2022. In Colombia where we had nine clubs open at quarter end, net merchandise sales increased 7.6%, primarily due to opening a new club in Q1 2022, and we had comparable net merchandise sales increase by 2%. Net income for the fourth quarter of fiscal 2022 was $23.3 million, or $0.75 per diluted share, compared to $19.5 million, or $0.63 per diluted share, in the comparable prior year period. Net cash used in investing activities decreased by $42 million for the 12 months ended August 31, 2022, compared to the prior year, primarily due to the decrease in the current period of purchases of certificates of deposits due to improved availability of U.S. dollars in Trinidad."
}