{
    "symbol": "PSMT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-07 16:02:03",
    "content": " And earnings for the first quarter grew 10.1% to $30.5 million versus $27.7 million in the prior year period, yielding diluted and basic earnings per share of $0.98 in the current quarter versus $0.90 in the prior year period. Total revenues and net merchandise sales for the quarter were $975.4 million and $944 million, respectively, representing increases of 11.2% and 12.6% over the comparable prior year period, respectively. Our comparable net merchandise sales growth for our fiscal first quarter was 9.4% for the 13 weeks ended November 28, 2021. By segment, in Central America, where we had 27 clubs at quarter end, net merchandise sales increased 15.6% with a 14.1% increase in comparable net merchandise sales. In the Caribbean region, where we had 13 clubs at quarter end, total net merchandise sales increased 5.4% and comparable net merchandise sales increased 5%. Total gross margins on net merchandise sales came out at 16% for the quarter, which is substantially in line with the 16.1% margins for the same period last year. SG&A expenses increased $11.2 million compared to the prior year primarily due to the addition of 3 new clubs and our continued investment in technology and talent to support continued growth, but decreased by 20 basis points as a percentage of total revenue. Net interest expense decreased $0.4 million for the first quarter, primarily due to the short-term borrowings compared to the prior year period when we drew down on short-term lines of credit as part of our efforts to secure adequate cash to cover contingencies arising from COVID-19-related risks. Net cash used in investing activities decreased by $38.3 million compared to the prior year, primarily due to the decrease in purchases of certificates of deposit compared to the same 3-month period a year ago from the significant improvement or decrease in our balance of Trinidad dollars on hand versus the prior year. In closing, we are very pleased with the results achieved during the first quarter of fiscal 2022 and believe that we are off to a good start to our fiscal second quarter, driven by the 10.1% comparable net merchandise sales growth in December."
}