{
    "symbol": "PSMT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-08 16:17:02",
    "content": " Operating income grew 7.4%, and that's despite currency headwinds, which impacted total and comparable net merchandise sales by 3% and 2.7%, respectively. During March, ending on March 31, 2022, total net merchandise sales were $338 million, an increase of 9.9% over the same period in the prior year. When comparing this second fiscal quarter versus the comparable prior year period, online sessions increased 8%, leading to an increase in digital orders, online orders, up 12%. As Sherry mentioned, we are very excited to have crossed the $1 billion sales threshold for the first time this quarter, with total revenues and net merchandise sales coming in at $1.04 billion and $1.01 billion, respectively, representing increases of 10.8% and 12.6% over the comparable prior year period, respectively. Our comparable net merchandise sales growth for our fiscal second quarter was 10.3% for the 13 weeks ended February 27, 2022. Foreign currency fluctuations had a negative impact on net merchandise and comparable net merchandise sales growth of 3% and 2.7% or approximately $26.3 million and $24.2 million, respectively. By segment, in Central America, where we had 27 clubs at quarter end, net merchandise sales increased 13.6%, with a 10.6% increase in comparable net merchandise sales. Foreign currency fluctuations had a negative impact on net merchandise and comparable net merchandise sales growth in Central America of approximately 1.8% and 1.9% during the quarter, respectively. In the Caribbean region, where we had 13 clubs at quarter end, total net merchandise sales increased 13%, and comparable net merchandise sales increased 13.1%. Foreign currency fluctuations had a significant negative impact on merchandise and comparable net merchandise sales growth in Colombia of approximately 14% and 13.1% during the quarter, respectively. Net cash used in investing activities decreased by $51.7 million for the 6 months ended February 28, 2022, compared to the prior year, primarily due to the decrease in balances of certificates of deposit compared to the same period a year ago due to a significant improvement or a decrease in our Trinidad -- balance of Trinidad dollars on hand versus the prior year. The $78.7 million change from cash used in to cash provided by financing activities for the 6 months ended February 28, 2022, is primarily the result of obtaining the additional trend related financing in the current year, along with lower net repayments of short-term debt compared to the same 6-month period a year ago when we were repaying short-term facilities accessed at the early stages of the COVID-19 pandemic. The other part is that if members are able to continue to see increasing benefits and marketing benefits through how PriceSmart does business, the way we take care of them during COVID, the way we are focusing on well-being, the ethics by which we operate, the increased services and convenience for their experience, whether it's in the club or it's online or through delivery, the more valuable that membership becomes -- the more valuable the membership becomes, the more reliable the membership income."
}