{
    "symbol": "PSMT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-12 14:53:04",
    "content": " Although our total gross margin dollars increased 4% over the comparable prior year period, merchandise gross profit as a percent of net merchandise sales was 14.2%, a decrease of 170 basis points from the same period in the prior year. Total net merchandise sales was $321.4 million, an increase of 15.5% over the same period in the prior year and comparable merchandise sales for the 4-week period ended June 26, '22, increased over 11.8% compared to the comparable period last year. Total revenues and net merchandise sales came in at $1.03 billion and $999 million for the quarter, respectively, increasing -- sorry, increases of 15.1% and 16.5% over the comparable prior year period, respectively. Our comparable net merchandise sales growth for our fiscal third quarter was 12.8% for the 13 weeks ended May 29, 2022. Foreign currency fluctuations had a negative impact on net merchandise sales and comparable net merchandise sales growth of 2.3% and 2.2% or approximately $19.1 million and $18.6 million, respectively. In the Caribbean region, where we had -- excuse me, 14 clubs at the quarter end, all of our markets had positive comparable net merchandise sales growth with total net merchandise sales increasing 21.4% and comparable net merchandise sales increasing 17.4%. In Colombia, where we had 9 clubs open at quarter end, net merchandise sales increased 25% and comparable net merchandise sales increased 18.1%. These significant growth levels were achieved despite the impact that the devaluation of the Colombian peso had on merchandise and comparable net merchandise sales growth in Colombia of approximately 7% and 6.8%, respectively, during the quarter. Net cash used in investing activities decreased by $32.6 million for the 9 months ended May 31, 2022, compared to the prior year, primarily due to the decrease in balances of certificates of deposit compared to the same period a year ago due to a significant improvement or a decrease in our balance of Trinidad dollars on hand versus the prior year. The $100.3 million change from cash used in to cash provided by financing activities for the 9 months ended May 31, 2022, is primarily the result of obtaining additional Trinidad-related financing in the current year along with lower net repayments of short-term debt compared to the same 9-month period a year ago when we were repaying short-term facilities accessed at the early stages of the COVID-19 pandemic. Our omnichannel members, those who shop both online and in club, made approximately 3 more orders than in-club only members during the third quarter and orders for this category of member grew 14%, with the average spend for this group growing 25% compared to the prior year fiscal third quarter."
}