{
    "symbol": "RVLP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-20 12:04:06",
    "content": " Starting with the economy, I think bridging from JDâ\u0080\u0099s last comments, our view is that weâ\u0080\u0099re fairly under-penetrated across the board in esthetics, and even eye care, so while the economy is certainly headline news, we believe that weâ\u0080\u0099re not seeing a material impact and weâ\u0080\u0099re too new as a category, so itâ\u0080\u0099s hard for us to really judge based on what weâ\u0080\u0099re hearing from others as well. In the first quarter, weâ\u0080\u0099re spending a lot of time working with the accounts that have previously ordered, getting them to work through the product, make it become an everyday part of their practice, and as JD mentioned, seeing nearly 50% reorders in Q4 gives us a really strong signal that traction is gaining here. Again, and weâ\u0080\u0099ll be following up with everyone after the call to help in the refinement of modeling conversations, but I think itâ\u0080\u0099s fair to say that we will ramp in a similar manner to last year because right now in this quarter, weâ\u0080\u0099re heavily focused on the reorder customer and making sure that we get traction, because we donâ\u0080\u0099t want to end up sort of six months down the road from now and many people havenâ\u0080\u0099t really worked it into their practice, so thatâ\u0080\u0099s really important for us. We like what weâ\u0080\u0099re seeing, weâ\u0080\u0099re going to be out later on with more information to help in the modeling, but again as I mentioned to Louise, I think our revenue trajectory will look similar to how it did last year in growth, but again in the first quarter, weâ\u0080\u0099re going to be careful because we are driving that reorder business and we want to be mindful of that, because weâ\u0080\u0099re not spending nearly as much as what the consensus would have out there because we have no competition, so thereâ\u0080\u0099s no need for us to worry about bundled rebates to physician practices with this product, so we are developing leverage within the P&L so we can grow consistently and carefully. Yes, once we see a cadence where weâ\u0080\u0099re getting a few patients per day, I think that can be roughly 10% of their time - not a major part of their day, but right now most of our practices arenâ\u0080\u0099t really giving us two a day or one a day, so we spend a lot of time on events with them and trying to bring in their local influencers, build the momentum, and then also weâ\u0080\u0099ve got to train the practice, which is quite easy for this product and, quite frankly, weâ\u0080\u0099re getting a lot of help from the front desk in the assessment, which is unusual because itâ\u0080\u0099s very easy to diagnose, if you will, and look for a very interesting result with this product because weâ\u0080\u0099re happy to provide samples, so thereâ\u0080\u0099s no risk to the patient. Weâ\u0080\u0099re spending time right now ensuring that all of that is working, and remember this is a fairly unique and complex platform in the sense that weâ\u0080\u0099re able to connect patients that are coming into offices that we otherwise would not have direct visibility or line of sight in terms of walking out the door with an Upneeq prescription or box in our direct dispense model, and giving our business but also providers the ongoing connectivity to prescribe and allow our pharmacy to pull through refills and ongoing customer orders. Itâ\u0080\u0099s going well, weâ\u0080\u0099re excited about it, and I think itâ\u0080\u0099s going to add, and Brian touched on this, a completely different dimension to the scalability of our business because we know from the original business model, where everything was coming through our pharmacy, which still constitutes a nice piece of the business, that patient behavior results in refills, so when weâ\u0080\u0099re able to be connected with new patient starts in that way, weâ\u0080\u0099re able to pull through refills, so it is going to be a meaningful addition and enhancement, and I think a value-add to both patients and providers. Thatâ\u0080\u0099s more of an organic marketing tool that we can leverage based upon the experience and enthusiasm of this product being introduced to a practice, and I think where it really helps us is continuing to raise not just broader awareness in terms of patients that are going to new practices, that are added, and having the ability to learn about the product, but also the consistency of experience across a growing number of accounts. At the end of the day, weâ\u0080\u0099ve got to expand the top of the funnel and help practices pull through that expanded top of the funnel, and itâ\u0080\u0099s a little bit of the traditional push-pull concept, so we leverage their social media to introduce patients and then weâ\u0080\u0099re in there, rolling up sleeves, figuring out the most efficient way to make this a routine part of what theyâ\u0080\u0099re doing because of the patient satisfaction and the results that weâ\u0080\u0099re getting as we continue to expand the new patient start piece of our business, day in and day out."
}