{
    "symbol": "REXR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 18:49:02",
    "content": " Rexford's outperformance is a reflection of our entrepreneurial business model, focused on creating value by increasing the quality and functionality of industrial property throughout infill Southern California, the nation's highest demand and lowest vacancy industrial market, with over 1 billion square feet of industrial property built prior to 1980, within a nearly two billion square foot regional infill market, we are favorably positioned with proprietary access to an exceptionally deep wealth of value creation opportunities. Over the next 24 months, we project approximately $172 million equal to 43% of annualized cash NOI growth embedded within our current portfolio, assuming no further acquisitions and based upon today's market rents. To fuel this growth and to ensure we are well positioned to capitalize upon emerging opportunities in today's dynamic market, we continue to maintain an exceptionally strong, low leverage balance sheet closing the quarter at 13.5% net debt to enterprise value. Based on Rexford's internal portfolio metrics, market rents for comparable space continue to accelerate, increasing by 49% over the prior year, which continues to mitigate the impacts of higher construction costs. Please proceed with your question. I was just going to say, just on your -- on the other part of your question, whether we should buy today or wait, I think you're asking what's happening with cap rates and demand for assets and we've seen moderate adjustments in cap rates, but really it's the mark-to-market that's driving the opportunities out there for us in terms of being able to find opportunities that others in the market don't have access to and being able to stabilize those at very accretive yields. West that we bought just a couple months ago, we underwrote to a 3.9% yield with, I think we were protecting a $1.35 in rent and it looks like, and this is not the done deal yet, but we have, a lot of interest tenants circling and we expect that we hope that there's a strong potential. Please proceed with your question. Well, we don't really prognosticate in that way to be honest, but I think we've probably seen, Howard, Laura feel free to comment, but we've probably seen upwards of 20% plus or minus market rent growth year to date. But maybe just stepping back, just thinking about issuing equity, obviously there's the current cost on your current earnings, but given the significant mark-to-market in your portfolio, how do you think about it more of a sort of longer term, like a five year basis of issuing that equity today and diluting investors, buying something that yet has upside in it. Please proceed with your question. We continue to see market rank represents in our portfolio and growth within, in our rental rates that's at this point helping us overcome some of these construction costs increases and we're seeing yields continue to be at around 6.7% consistent with prior quarters on our repositioning and lead developments. Please proceed with your question. Orange County has been up, I think they're about 5% quarter-over-quarter and really, I think the lowest increases we've seen probably been more around some of the LA markets, but still strong rent growth and when you really dive into the stats, just in our portfolio, all these markets are performing very well in terms of the rent growth. Your question was, , how should investors think about our tenant credit, and if I try to separate myself from Rexford put myself in the investor's shoes and be objective, and just look at the data over the last 20 years I think that the Rexford tenant credit in the aggregate is the best credit you can find in the market period of any asset class, not just industrial and far better than any other industrial read, just very different. Please proceed with your question."
}