{
    "symbol": "ATEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 20:00:15",
    "content": " During the course of today's call, management will make forward-looking statements, including statements regarding its projections for future operating results, potential revenue growth, industry and customer trends, focus on investment in go-to-market strategy and infrastructure, capital allocation strategy, M&A opportunities, supply chain constraints and expectations, it's positioning, it's repurchases and dividend programs and its market share. Driven by continued adoption of our proprietary security led solutions, revenue increased 14.9% year-over-year, our gross margin was better than 80% despite continued supply chain challenges and input cost pressures, driving higher levels of operating income, EBITDA and net income. Our revenue growth continues to be driven by our proprietary security led product revenue, which on a trailing 12-month basis, is now up 26%, backed by secular tailwinds overall product revenue, which is a leading indicator of future recurring service revenue increased 21% versus Q2 of 2021. From a geographic perspective, revenue from the Americas grew 33.7% year-over-year to $38.6 million reflecting our investment in commercial initiatives in the Americas, and strong demand for our solutions. Over the past year, our product revenue growth rate with existing customers has consistently exceeded our target growth rate, demonstrating our ability to successfully leverage our strong install base and bolsters our confidence in delivering 10% to 12% consolidated growth compared to the prior year. Second quarter revenue was $68 million, up 14.9% year-over-year, the second highest quarter revenue in our history. Product revenue, which is a leading indicator for future revenue was $41.5 million representing 61% of total revenue, up 20.7% year-over-year. Revenue from Asia, including Japan was $21.6 million down 7.1%, compared to $23.3 million in the second quarter last year, which is exclusively due to the depreciating yen to dollar currency exchange rates. As you can see on our balance sheet, our deferred revenue was $127.9 million as of June 30, 2022, up 10% year-over-year. Non-GAAP operating expenses in Q2 were $38.7 million compared to $35 million in the second quarter last year, reflecting increasing investment in our growth priorities, including cybersecurity technology and commercial execution. As Dhrupad mentioned, we are now well positioned to achieve our full year revenue target of 10% to 12% growth year-over-year and full year adjusted EBITDA margin of 26% to 28% of revenue. So there is some push and pull, of course, with war in Europe and things like that the sales cycles are a little bit longer, but we don't see deliberate choice, where somebody's saying we will put this off for six months or nine months and I think Hamed, I would relate it back to because our solutions are directly linked to customers revenue generation, or maintaining quality or performance of networks versus just modernization."
}