{
    "symbol": "UAA",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-03 13:05:05",
    "content": " This was driven primarily by 160 basis points of COVID related supply chain impacts driven by elevated freight costs particularly ocean freight, 50 basis points from higher promotions and discounting versus last year, 40 basis points of various unfavorable channel regional and product mix impacts and 30 basis points of negative impacts from changes in foreign currency. This increase was primarily due to plan marketing investments carried forward from our transition quarter, as well as higher workforce wages due to last year's teammate compensation increases, legal expenses related to on-going litigation matters along with higher consulting and technology related spending. Given a tough year-over-year comparison, we expect gross margin to be down approximately 550 to 600 basis points in the second quarter, due to negative impacts from elevated promotional activities, increased freight expenses, shifts and channel mix and growing pressures from changes in foreign currency. Your line is open. Colin, I want to ask you about given there's obviously change in leadership and now that you're interim CEO, how do you think about the mandate from the Board to drive growth -- top line growth for the company versus sort of maintain the discipline that the company has showed over the last few years compared to maybe where it was 2013, 2014, 2015 and control pricing, control brand management, control the brand equity and make sure that like the brand continues to move forward in an elevated way. Your line is open. Your line is open. Your line is open. Your line is open. And it's something that we've spent the last probably three years really digging in, whether it's through the restructuring, through the operating model work to really understand all the levers within our SG&A cost structure and which ones that we can change or drive differently while still protecting the brand, while still protecting a lot of that top funnel marketing spend, and really reallocating some of those dollars to go heavier into the digital investments that Colin was talking about. Your line is open. But at the same time one of the disciplines we've put in place over the past couple of years is kind of what I call our big wheel, small wheel kind of model from the point of view, there are certain things that are just going to take time to do because that's the cadence that we need to have in place to run the business and produce the kind of innovative kind of solutions we come up with. Your line is open."
}