{
    "symbol": "UAA",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-08 10:11:04",
    "content": " To support this, we're making progress on the strategic refinements that we introduced on our last call, including broadening our product aperture to address the non-active moments of an athlete's day, maintaining UA performance and delivered with culturally relevant style, activating with greater precision to reach our target audience and inspirational muse of the 16 to 20-year old far city athlete and advancing our segmentation strategy across the spectrum of good, better and best, with a heightened focus on better and best level product offerings. Your line is open. Your line is open. Your line is open. And in North America, we talked about this a little bit already, but we are seeing a softer retail environment, but we continue to invest in building our own DTC, and that's really a key focus for us, thinking through how do we actually talk directly to consumers, opening the store in New York is a great example. Your line is open. Your line is open. Your line is open. When you think about the footwear growth and the continued potential there, and how small our footwear business is in total to our mix, when you step back and look at where we are from an international perspective and being able to return to healthier growth in Asia Pacific as we get past COVID more, EMEA is a very healthy market for us, and we're driving forward there as well. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So our focus is more about trying to elevate the brand and again, protect the core and elevate for more or want the better way of putting it, is kind of how we're spending our time and thinking through the product we're developing, the stories we're telling the consumer we're engaging with and the entire strategic evolution that we've got in place and we're working through will hopefully help us deliver against that. And I think some of that also goes to the enterprise mindset within the company, whether it be the alignment of our leadership team and being able to make tough calls and drive through and prioritize further to be able to protect the bottom line or even if we just think about all the teammates that we have across the world and how much they're looking out for the brand, and trying to spend as if it's their own money and kind of make $1 spend like $3. And it's just been -- I don't want to say the word easier because these are tough decisions but we've been able to act more quickly and more proactively on the cost structure, and we're going to continue to do that as we drive into next year and beyond. We have a strategic refinement that we're putting in place at this moment in time, and they're starting to build out and starting to flow through the markets and starting to flow through to work with our teammates to kind of bring it to its full manifestation around â\u0080\u0093 and I'm excited about how that's all going to come together."
}