{
    "symbol": "GSIT",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-29 23:15:03",
    "content": " Revenue in the second quarter of fiscal year 2023 grew year-over-year by nearly 15% to $9.0 million, the midpoint of our guidance range. As of September 30, 2022, GSI Technology's cash balance, which includes cash and cash equivalents as well as short and long-term investments was $38.9 million. In the second quarter of fiscal 2023, sales to Nokia were $1.2 million or $13.6 million of net revenues compared to $1.9 million or 23.8% of revenues in the same period a year-ago and $1.3 million or 14.7% of net revenues in the prior quarter. Selling, general and administrative expenses were $2.4 million in the quarter ended September 30, 2022, compared to $2.8 million in the prior year quarter and $2.7 million in the previous quarter. Second quarter fiscal 2023 net loss included interest and other expense net of $14,000 and a tax provision of $37,000, compared to interest income and other expense net of $8,000 a tax provision of $42,000 for the same period a year-ago. Total second quarter pretax stock-based compensation expense was $661,000 compared to $716,000 in the comparable quarter a year-ago and $638,000 in the prior quarter. At September 30, 2022, the company had $38.2 million in cash, cash equivalents and short-term investments and $628,000 in long-term investments compared to $44 million in cash, cash equivalents and short-term investments of $3.3 million and long-term investments on March 31, 2022. Stockholders' equity as of September 30, 2022, was $58.7 million compared to $64.5 million as of the fiscal year ended March 31, 2022. Given the current global economic environment, our current expectations for the upcoming third quarter are net revenues in the range of $6.3 million to $7.3 million with gross margin of approximately 53% to 55%. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And then, of course, the outlook is going forward beyond this quarter, that we're probably looking at more into what like the second calendar quarter of next year before something can really develop and on the Gemini-I in terms of revenue streams, solid revenue stream. Please proceed with your question."
}