{
    "symbol": "GSIT",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-26 18:24:05",
    "content": " In the third quarter of fiscal 2023, sales to Nokia were $1.3 million or 20.0% of net revenues compared to $1.9 million or 24.0% of revenues in the same period a year ago, and $1.2 million or 13.6% of net revenues in the prior quarter. Selling, general and administrative expenses were $3 million in the quarter ended December 31, 2022, compared to $2.8 million in the prior year quarter and $2.4 million in the previous quarter. Third quarter fiscal 2023 net loss included net interest and other income of $61,000 and a tax provision of $84,000 compared to $15,000 in net interest and other income and a tax provision of $64,000 for the same period a year ago. Total third quarter pretax stock-based compensation expense was $654,000 compared to $740,000 in the comparable quarter a year ago and $661,000 in the prior quarter. At December 31, 2022, we had $35.2 million in cash, cash equivalents and short-term investments and $0 in long-term investments compared to $44 million in cash, cash equivalents and short-term investments and $3.3 million in long-term investments at March 31, 2022. Stockholders' equity as of December 31, 2022, was $54.8 million compared to $64.5 million as of the fiscal year ended March 31, 2022. Regarding our outlook for the upcoming fiscal fourth quarter, we anticipate net revenues in the range of $5 million to $5.6 million, with gross margin of approximately 49% to 51%. Do you feel like you're very close now in that by the end of the current quarter, say, the end of March, that you'll be able to actually have orders in Gemini for Gemini-2 going forward or is -- or do you envision that it's still going to take more time into the -- in the June quarter or the September quarter. And if something's got to really start to happen here in terms of getting -- and the interesting thing is that with this decline that is being seen in your business, generally speaking, I mean when I say your business, I mean, the general business associated with the chips, it would seem like what has been happening in the last couple of three quarters generally for the industry, would really put you in a position to take advantage of really getting up on track and going with some business that would be developed from what you've been trying to accomplish in, say, the last year. But with you having something new to bring to the market that we -- it would be possible for GSI to really take advantage of maybe some momentum because of what's happened in the industry going downward and that if you're really getting close now to introducing innovations that you've been working on in Gemini-2, I would think that the shareholders of your company should be certainly looking forward to a turnaround in revenue stream beyond the first quarter -- beyond this current quarter."
}