{
    "symbol": "EEX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 00:47:02",
    "content": " We have several growth levers at our disposal, including: one, the multiyear post-COVID recovery of live events that's taking place; two, our unrelenting focus on customer centricity and satisfaction, which drives retention and opportunity to attract new exhibitors, sponsors and participants; three, pricing, which has always been a tool in our toolkit; four, new event launches; five, continued high-quality mergers and acquisitions; and six, exciting growth from our SaaS e-commerce platform that is complementary to our live events and helps our customers generate higher returns on investment. Before we begin, I'd like to note that during the quarter, we received final proceeds of $149 million related to our insurance litigation settlement for the events that were impacted by the COVID-19 pandemic in 2020 and 2021, bringing total pandemic-related insurance proceeds to $373 million. On that basis and adjusting for the scheduling mismatches between 2022 and 2021, organic revenues for the third quarter of 2022 were $56.6 million, an increase of $14.2 million or 34% as compared to organic revenues of $42.4 million in the same period last year. Adjusted EBITDA was $149.7 million in the third quarter as compared to $8.6 million in the prior year quarter, reflecting the impact of the insurance proceeds received in September. Excluding insurance proceeds, adjusted EBITDA would have been negative $1.3 million as compared to $7.5 million in the prior year, with $13.3 million of the decline attributable to the timing of trade shows, as I previously described. Year-to-date, which absorbed the bulk of the calendar shifts just discussed, we generated adjusted EBITDA, excluding insurance proceeds, of positive $31.7 million as compared to a loss of $23.8 million in the first three quarters of last year. Excluding insurance and other items, free cash flow would have been $6.2 million as compared to $8.2 million in the prior year quarter, again, impacted by the timing of events in 2021."
}