{
    "symbol": "CSTE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 11:19:02",
    "content": " In addition on this call the company will make reference to certain non-GAAP financial measures including adjusted net income, adjusted net income per share, adjusted gross profit, adjusted EBITDA and constant currency. A reconciliation of these non-GAAP measures to the most directly comparable GAAP measures can be found in the company's second quarter 2022 earnings release, which is posted on the company's Investor Relations website. The second quarter of 2022 marked another period of significant progress for Caesarstone, in which we achieved our sixth consecutive quarter of double-digit year-over-year revenue growth led by North America, resulting in record second quarter revenues of $180.3 million. Overall, our results were largely in line with our expectations as we demonstrated further progress against our multi-pronged growth strategy, while navigating through a complex global environment. During the quarter, we were able to grow revenues in the US, our largest market by almost 20% while also successfully implementing pricing actions that helped us mitigate impacts from increasing costs for raw materials and shipping. In turn, we were able to improve our margins on a sequential basis as expected for two quarters in a row. As we work to increase our direct presence in our markets as a path to help us gain additional market share, we are excited to report that in July 2022 we acquired a leading distributor in Sweden, establishing our first direct go-to-market presence in the EU. Additionally, and in furtherance of our multi-material growth strategy, we remain focused on introducing our new global porcelain collection under our Caesarstone brand that will be launched in the third quarter of this year. While we are executing against our strategic growth plan, we are carefully monitoring the cost environment, recently announced an additional price increase in July to help offset the rising cost of shipping and raw materials. Moving into the second half of 2022, we are confident that the execution of our Global Growth Acceleration Plan is providing for fundamental improvements in our business despite some quarter-to-quarter volatility that we will continue to work through. We are well aware of the potential period of economic uncertainty that lies ahead and I feel confident that through the actions we have taken over the past four years, we are better positioned than ever to accomplish our objectives. Next, improved efficiencies at our Richmond Hill facility in the US has put us in a better setup to locally serve the North American region, resulting in shorter lead times and cost savings. Third, establishing a new leadership team with the right core disciplines as a global organization has provided us with an ability to better allocate and prioritize our resources. Fourth, our regional realignment has helped us to streamline our regional leadership and cost structure and allow for quicker decision-making with global and local teams working much more closely together. And lastly, the introduction of our multi-material growth strategy has expanded our addressable market and diversified our business into other attractive countertop product categories beyond quartz. These actions along with other significant actions we have taken through the Global Growth Acceleration Plan have also allowed us to push through the pandemic, the global supply chain crisis and the more significant inflationary pressures our industry has seen in years. As view forward, we will continue to leverage our world-class brand, innovative go-to-market initiatives and multi-material product offerings to drive additional value for our shareholders. On a constant currency basis second quarter revenue was higher by 13.7% compared to the same period last year, primarily due to higher pricing across our global footprint, particularly in North America. In the Americas, constant currency sales were up 20%, mainly due to the growth in Canada and the US. In the US, sales were up 19.5% driven by strong organic growth. In Canada, sales were up 20% year-on-year on a constant currency basis, driven by strong performance in all channels with IKEA sales continuing to experience strong year-over-year growth. In the APAC region, constant currency sales were up 5.4%, Australia which accounts for the majority of our sales in the region and saw year-over-year growth on a constant currency basis despite continued headwinds from supply chain issues that improved during July. In the EMEA region, constant currency sales grew 11.7%, primarily reflecting solid performance in the UK, as well as in our EMEA indirect business. In Israel on a constant currency basis, sales were lower by 19.6% in the second quarter, mainly reflecting competitive pressures in the region. The year-over-year difference in gross margin, primarily reflected higher shipping and raw material prices and unfavorable foreign exchange rate fluctuations that were partially offset by favorable product mix and selling price increases. As we have discussed in previous quarters, we continue to experience pressure from rising costs associated with shipping and raw materials, given the ongoing tight supply environment impacting our industry. In the second quarter of 2022, we were impacted mainly from shipping cost increases across our global footprint. In response, we expect to partially mitigate this impact through an additional price increase that went into effect during July 2022 in several of our markets. The first quarter price increase that went into effect on January 1, 2022, and our second quarter price increase that went into effect in April 2022. Excluding legal settlements and loss contingencies, operating expenses for the quarter were 22.1% of revenue compared to 22.3% in the prior-year quarter, mainly due to higher revenues. Adjusted EBITDA in the second quarter was $17.1 million, representing a margin of 9.5% compared to $18.8 million, or a margin of 11.5% in the prior-year quarter. Adjusted diluted earnings per share in the quarter was $0.20 compared to adjusted diluted earnings per share of $0.21 in the same period last year, on a similar share count. Based on our net income performance during the second quarter and the year-to-date period, our Board declared a dividend of $0.25 per share, with a record date of August 17, and payment date of September 7, 2022. Turning to our balance sheet, Caesarstone's balance sheet as of June 30, 2022 included cash, cash equivalents and short-term bank deposits and short and long-term marketable securities of $62.2 million with a total debt to financial institutions of $18 million. Overall, our best-in-class product offerings, successful integration of our acquired businesses and targeted efforts to enhance the customer experience through the expansion of our CS Connect platform are all driving fundamental improvements across our business. Looking ahead, we will continue to navigate the complex global operating environment with a prudent focus on improving our margins and operational leverage, careful cost management and the implementation of price increases where necessary. With our strong brand, premium product offerings and innovative go-to-market initiatives in place, we are well seated to advance our position as the multi-material global countertop leader in 2022 and beyond. Originally, we thought it's going to be probably one-third growth by volume and two-thirds by prices. As we are continuing with our price increases across the majority of our regions also in July after two price increases that we already did during this year first in January and the second in April, we see higher portion of the increase in revenues, as we are reiterating our guidance coming from prices and lower portion coming from volume. Currently, we are taking all the necessary actions including controlling expenses as we did in the previous two quarters for the remainder of the year, but other than that we currently -- we don't see any major change in our... \n We -- Thomas in addition, we are monitoring quite carefully our inventory levels. As we haven't seen any drop in demand so far, we continue to monitor those inventory levels and adjust them as necessary in the future. Although, we kept prices, as Yuval just mentioned, cost of raw material and shipping cost at a high level, but stable. Well, so far through all year long, we're kind of experiencing quite strong demand to our product as we are more dominant in the R&R channels. It is, I suppose, quite a strategic decision to make sure that we are not coming with too big portion of revenue with fixed prices to major projects."
}