{
    "symbol": "ICMB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 15:23:11",
    "content": "  Operator: Welcome to the Investcorp Credit Management BDC, Inc., Schedules Earnings Release of First Quarter ended September 30, 2022. Your speakers for today's call are Mike Mauer, Chris Jansen and Rocco DelGuercio. Thank you, operator, and thank you for joining us on our first quarter call today. At this time, I would like to turn the call back to our Chairman and CEO, Michael Mauer. Despite the slowdown in the U.S. economy and broader market volatility, the credit quality of our portfolio remains stable and overall underlying portfolio companies operating performance has been generally steady. For context, we made four new investments during the quarter. Over the prior four quarters, we averaged 6.5 new investments per quarter. This quarter, we were successful in deploying our new capital at an average yield of 10%. Given the macro environment, we have become increasingly focused on sector selection, and lending to industries with resilient end markets that have recession-resistant and countercyclical attributes. In addition to becoming incrementally more selective on new deals, we also continue to be diligent in our portfolio management and risk mitigation. I'll finish with commentary on our NAV, nonaccrual investments, our leverage, the dividend and our outlook for 2023. First, we invested in the club financing for LLC to support the acquisition of the company by JMC Investment. is a designer and manufacturer of add-on equipment for OEMs and in the construction, waste, long care and snow removal markets.Our yield at cost is approximately 10.9%. We also invested in the revolver, term loan and common equity of Archer Systems and the acquisition of the company by Fortress Investment Group. We invested in Evergreen North American Industrial Services, a portfolio company of the Sterling Group. We also invested in the club financing of PVI Holdings, Inc. to support the LBO of the company by middle ground capital. After quarter end, we invested in one new portfolio company and have had no realizations. Using the GICS standard as of September 30, our largest industry concentration in the portfolio was professional services at 13.7%, followed by IT services at 9.5%, Internet and direct marketing retail at 8.5%, trading company and distributors at 8.2% and commercial services and supplies at 6.4%. Our portfolio of companies are in 22 GICS industries as of quarter end, including our equity and warrant positions, which is an increase of 2% from the previous quarter. As of September 30, we had 37 portfolio companies, also an increase of two from June 30. For the quarter ended September 30, 2022, our net investment income was $2.3 million or $0.16 per share. Our debt investments during the quarter had an average yield of 10%, while realizations and repayments during the quarter had an average yield of 10.6% and fully realized investments had an average IRR of 11.6%. The weighted average yield of our debt portfolio was 11.9%, an increase of 190 basis points from June 30, approximately 64% of the change is a result of the increase in LIBOR SOFR. As of September 30, our portfolio consisted of 37 portfolio companies. 91.8% of our investments were first lien, and the remaining 8.2% is invested in equity, warrants and other positions. 99.6% of our debt portfolio was invested in floating rate instruments and -- excuse me, and 0.4% in fixed rate investments. Our average portfolio company investment was approximately $6.5 million, and our largest portfolio company is Fusion at $14 million. We had a gross leverage of 1.64 times and a net leverage of 1.56 times as of September 30 compared to 1.57 times gross and 1.48 times net respectively, for the previous quarter. As of September 30, we had seven investments on nonaccrual, which included all three PGI, three investments in 1888 and one investment in Deluxe. With respect to our liquidity, as of September 30, we had $7.4 million in cash, of which $6.5 million was restricted cash with $25.5 million of capacity under our revolving credit facility with Capital One. Additional information regarding the composition of our portfolio is included in our Form 10-Q, which was filed yesterday. First, I would like to address the NAV decline in the quarter. Last quarter, we expected the current quarter NAV to recover modestly. First, we saw the spread tightening that had occurred in the beginning of the previous quarter reversed itself in September. Part of our current quarter NAV decline was attributable to a decrease in the marks 4 Arcade Bioplan, ArborWorks and career building. On ArborWorks experience -- ArborWorks experienced some volatility during the quarter due to a decline in disaster recovery business as a result of a historically low year in terms of buyer acreage burn, in the region that ArborWorks serves. As discussed in the previous quarter, CareerBuilder's underlying business has been experiencing challenges that some time. For confidentiality reasons, we can't go into -- we can't give any additional information about the company's performance. We continue to remain optimistic for a positive conclusion for our investments, and we think that the short maturity provides a driver for M&A or capital markets activities. As mentioned last quarter, we expect to see our growth in net leverage continue to converge. As of November 7, our gross and net leverage were 1.61% and 1.6%. As we have previously stated, the adviser will waive the portion of our management fee associated with the base management fees over one turn of leverage.We covered our September quarterly dividend with NII. On November 11, our board of directors declared a distribution for the quarter ended December 31, 2022, of $0.13 per share and a supplemental distribution of $0.02 per share, both payable on January 10, 2023, to shareholders of record on December 15, 2022. While we are officially reducing the regular dividend of $0.15 per share, the net effect this quarter is unchanged from previous quarter. Looking ahead, we remain highly focused on risk management and finding investment opportunities with strong structural protection and attractive investment characteristics. Our ultimate goal has not wavered and is, as always, focused on capital preservation and maintaining a stable dividend. Thank you very much. Our first call first, our first -- the first person we have a question for is Sean-Paul Adams with Raymond James. In relation to your markdowns for last quarter, you had a greater than average proportion of markdowns related to credit. The December quarter, we're just starting to do our reviews for the quarter. I think like anybody out there who deals in credit, obviously, the sharp rise at short-term rates has given us some cause for concern on interest coverage levels. On the other side of that in the many years that Mike and I and the team have been doing this, we've never seen this level of interest coverage in deals. And that's due to the fact that a lot of the deals we have, have 35% or 40% to 60% of equity underneath them. And just as far as the specific credits, Mike have walked through the couple of credits where we had some issues last quarter. This quarter, we're not we're not really thinking about anything too differently. Thank you very much. You already cut back the base dividend, but nonaccruals were up this quarter, leverage went up, and it seems like if the economy really does tack that you guys would be vulnerable to some material impacts. So I wouldn't read too much into the movement that you saw on a net leverage basis there was not, in our view, material from quarter-to-quarter. But you are right, it's above our range, and we want to get in the range of the 1.25%, 1.5%. I think one of the key things is every new investment we're doing right now, we're focused around really three things, and that is the equity cushions are growing from where they have been historically. Recently, on average, we've been over 50% equity cushion. We're not doing any covenant light, new deals and we're very focused. And I think this is one that critical things in a tough environment around when you look at EBITDA, how, I'll call it, clean EBITDA is how much there is as far as adjustments in it. On 1888, it's in a sector that is robust, and we're working with them to try and find ways to maximize return on that. Thank you very much. Chris, I'll let you -- I'm not sure we've ever given it on a consolidated basis. I mean, is the kind of the lowering of the core dividend, but keeping the overall total dividend the same, is that more of a function of potential deleveraging of the portfolio or credit quality issues that you guys could potentially have just because when you look at your earnings today, you guys are going to have a tailwind of interest rates going forward. But meanwhile, you guys are reducing kind of that core level of dividend payout. And so on an absolute yield, I don't know that you'll see us get a widening plus a widening of the spread plus the SOFR uplift. And when we think about the dividend, we want to make sure that the core dividend will always comfortable covering. But I think just from a signaling, we want to make sure that, that core is around all the dynamics that we see going on right now. Obviously, you all don't control the stock price or the valuation of your company, but you do control the fundamentals of your business and as we are rapidly approaching calendar 2023, what are the -- what are some areas that you all are looking to improve upon the fundamental performance of Investcorp that you think that could hopefully increase investor interest and potentially close that discounted valuation. Well, listen, we're -- the same old song in that we're always looking at strategic ways to grow it. But away from that, and I think that's kind of outside of our control because those come and go inside our control, the other thing we're focused on is building the base of private, which will decrease the OpEx and will help again on the dividend and the performance. So we've got to continue to build that base, and we're actively working on that right now. Thank you very much."
}