{
    "symbol": "ICMB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-08 21:12:03",
    "content": " :\n 00:12 Welcome to the Investcorp Credit Management scheduled Earning Release of Second Quarter Ended December 31, 2021. Your speakers for today’s call are Mike Mauer, Chris Jansen and Rocco DelGuercio. 00:38 Thank you, operator and thank you all for joining us on our second quarter call today. 01:55 At this time, I’d like to turn the call back to our Chairman and CEO, Michael Mauer. We supported LBO acquisitions and existing portfolio companies, among other uses of proceeds. This diverse set of investments continues to support the portfolio rotation, we began earlier this year. 02:30 As we promised last quarter, we've added to our total count of portfolio companies decreased concentrations in a number of industries we lend into and maintained a moderate average position size, all with the goal of increasing the stability of our results. We completed the restructuring of Fusion Connect in January, as well as the conversion of 1888's Term Loan B into equity. 3:10 It continues to be challenging to maintain price and structure in a highly competitive market environment, but we were successful in deploying our capital at an average yield in excess of 8% during the quarter. I'll finish with commentary on our investments, on non-accrual, the restructurings of 1888 and Fusion Connect, our leverage, the dividend and our outlook for 2022 as well and as always, we'll end with Q&A. We invested in the first lien loan of LaserAway, a portfolio company of Ares Management. We participated in the revolver, term loan and made a small co-investment in the equity. 05:21 We invested in the revolver and first lien loan, the South Coast Terminals backing it’s LBO by Platform Partners. We also invested in the revolver delayed-draw term loan and first lien term loan of Xenon Arc, which provides tech enabled distribution solutions for specialty chemicals and materials. 05:59 We participated in an upsizing of Crafty Apes' term loan, joining a club deal and supporting the company as it made an acquisition. Finally, we made our first equity co-investment alongside Investcorp’s North American private equity group. RESA Power listed in our scheduled investments as Investcorp Transformer Aggregator LP provides field services, power systems and specialty distribution of related products to utility, power generation, corporate and government customers. 06:49 In terms of investments in our existing portfolio companies, we made a small incremental loan to Gexpro to support an acquisition. Our loans to Gexpro were refinanced after quarter end, which I'll talk about in a moment. Our yield at cost was approximately 12%, as the GexPro we refinance this loan after quarter end. 07:30 We made an incremental loan to Easy Way, which was a new portfolio company for us last quarter. Galaxy's existing term loans were refinanced and the new first-lien loan yields approximately 7.4% of costs. 08:20 We made an additional investment in the first lien loan to AgroFresh, a food sciences company whose products prolong the useful life of fruits. Finally, we provided a small incremental loan to ASI to help the company make an acquisition. As I mentioned last quarter, our loan to ZeroChaos was repaid in full, as a company was acquired by PRO Unlimited. This was always intended to be a short-term hold and we are very pleased with the outcome and with our IRR, which was approximately 24.4%. 10:54 After quarter end, we had both investments and realization in two portfolio companies. First, our loan to Gexpro was fully refinanced with the realized IRR of approximately 10.4%. We took part in the new club financing for the company, which includes a new first lien term loan, delayed-draw term loan and revolver commitment. The exit term loan was fully refinanced, it’s called premium with a realized IRR of 13.4%. We also participated in the company’s new Series A preferred equity, which has a PIK coupon of 12.5% and the yield at costs of approximately 13.1%. 12:06 Using the GICS standard as of December 31, our largest industry concentration was commercial services and supplies at 12.5%, followed by Internet and direct marketing retail at 8.3%, energy equipment and services of 7.6%, professional services at 7% and software at 6.4%. Our portfolio companies are in 23 GICS industries as of quarter-end, including our equity  positions. As of December 31, we had 38 portfolio companies, an increase of two from September 30. For the quarter ended December 31, 2021, our net investment net income was $2.1 million or $0.15 per share. 13:42 The weighted average yield of our debt portfolio was 8.16%, an increase of 4 basis points from September 30. As of December 31, our portfolio consisted of 38 portfolio companies, 95.3% of our investments were in first lien and the remaining 4.7 is invested in equity warrants and other positions. As of December 31, we had four investments on non-accrual, which included all three investments in PGi as well as Deluxe and one investment on partial accrual Fusion take back loan. 15:06 With respect to our liquidity, as of December 31, we had $36.1 million in cash and -- of which $19.8 million was restricted cash, with no unused capacity under our revolving credit facility with Capital One. Additional information regarding the composition of our portfolio is included in our Form 10-Q, which was filed yesterday. After a significant period of negotiations, the term loan B has been fully equitized. This reduces debt at the company by approximately 60%, while leaving the lenders and equity holders interest aligned to cost holdings. Fusion exited bankruptcy two years ago, but with an unsustainable debt structure driven by the structural demand by certain other lenders. Through this restructuring, we hope the company reduce secured debt by approximately 80%. 16:31 To take back loan, which was the bulk of the company’s debt was equitized into Series B equity and will convert to common shares upon the receipt of regulatory approvals, which we anticipate will occur later this year. As I stated last quarter, we think that 1888 PGi infusion have limited ability to introduce negative volatility to our NAV at this point. Instead, we think the growing number of equity investments in the portfolio, while small in terms of fair value at this point has the potential to appreciate over the coming years. 17:18 Our gross leverage this quarter was 1.74 times, above our guidance of 1.25 to 1.5 times. This quarter, especially active investment cycle included unexpected fluctuations in the timing of investments in repayments, including a need to hold cash for closing on deals after quarter end. As we have previously committed, we waived the portion of our management fee associated with base management fees over one turn of leverage. 18:08 We covered our December quarterly dividend with NII looking at our portfolio on a run rate basis, we expect to continue to cover the dividend in March and going forward. Our Board of Directors declared a distribution for the quarter ended March 31, 2022 of $0.15 per share payable on March 31 to shareholders of record as of March 11. 18:56 For the six months ended December 31, we invested in nine new portfolio companies and eight existing portfolio companies. 19:30 As we enter 2022, we have visibility into probable repayments as well as several promising deals in the pipeline, which will enable us to continue our portfolio rotation. Please state your question. I mean, just kind of, I mean the take-back term loan was marked down in the December quarter of this year, and then the restructuring occurred after that. I mean, I think you said 9.6% on new loan on that, that seems pretty attractive for a business that has had some trouble over the year. So I mean can you give us any color on that, I mean why that's -- for something that's come to restructurings in a couple of years that pricing seems pretty good on the new loan. So it may be a little less, -- little lighter on the rate but the economics of the deal un total, since it was kind of think it as a strip. I mean there's a payable, obviously that so not all that cash is available to pay down to net against the leverage. 23:33 So Robert, I'm glad you asked that because there has been some activity post quarter end. How long will it take us to get there and we're going to there today, the 1.5 net of everything. 24:30 So the key thing is, we want to operate in this of call it, 1.40 to 1.50 and we're going to blip up and when we see things coming in order to fund in advance of the repayments. That's kind of what we were doing at December quarter end because we had some visibility getting down at 1.25 as kind of a, I'll call it a target rate would be we'd be operating in a 1.10 to 1.30 range because of repayments that come in, in advance of being at that 1.5. Obviously, there were two revolvers, functional during the quarter. So -- because we had the two facilities because we had the UBS facility through mid-November, we incurred this $485,000 in interest of which 150 of it was breakage fee look at it. Please state your question. And as you know, we've got -- I'll call it, round figures 30% odd fixed rate in our liabilities. So we've got fixed on part of the debt, we will have a little bit of increase, but on the asset side, we're seeing -- I’d say stability to a little bit of lift on the LIBOR plus 5.5 (ph) to 600 where everything was, and we're seeing a little bit of lift to that not a lot on the spread right now. Please state your question. It sounds like you guys have a decent amount of insight into the quarter in terms of where repayments are coming in, in that sort of thing, but just kind of taking into account where you guys stand today on a gross basis and then that combined with your unfunded commitments, I believe there are around 14 million, correct me if I'm wrong there. We -- always there is probably an overstatement, but we always have a small handful of more liquid names in the portfolio that we can cycle out of. We will at or around the level where we have of mark, the never a guarantee, but that's what we did this current quarter. And how much insight do you have on those unfunded commitments per se, of how much do you think are readily available to be drawn by your portfolio companies versus that are subject to milestones and maybe unlikely to be drawn upon. We’d assume conservatively that we are kind of a run rate of the portfolio, we had about 1.5 -- 1.45 to 1.5 times leverage."
}