{
    "symbol": "ICMB",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-07 17:28:07",
    "content": " Your speakers for todayâ\u0080\u0099s call are Mike Mauer, Chris Jansen and Rocco DelGuercio. Thank you, operator and thank you for joining us on our fourth quarter call today. Before we begin, Rocco will give our customary disclaimer regarding information and forward-looking statements. At this time, I would like to turn the call back to our Chairman and CEO, Michael Mauer. This quarter and the 10 weeks since quarter end, has seen significant volatility in the broader markets as the Fed hiked rates several times and both supply chain and inflationary pressures continued. Despite the impact that credit spreads have had on the fair value of our debt investments, the underlying operating performance across most of our portfolio continues to be strong. We continue to execute under our plan to co-invest in equity positions with Investcorpâ\u0080\u0099s North America private equity group, with one new position this quarter. Although the market has been active despite this volatility, we havenâ\u0080\u0099t chased deals with unattractive structures, even where we are comfortable with the fundamental investment opportunity. Even in the face of the macro economic backdrop, we remain focused on investing in middle-market companies with attractive free cash flow characteristics, defensible market positions and strong management teams and sponsors. Iâ\u0080\u0099ll finish with commentary on our NAV, non-accrual investments, our leverage, the dividend and outlook for 2023. First, we invested in the club financing for American Nuts, which supported the refinancing of the company and the acquisition of DSD Merchandisers. We led our third equity co-investment alongside Investcorpâ\u0080\u0099s North American private equity group, CrossCountry Consulting, listed in our schedule investments as Victorâ\u0080\u0099s CCC Aggregator LP is a business advisory firm offering corporate advisory services to Fortune 500 companies. We invested in the new last out term loan, which had a yield at cost of approximately 11%. Regarding our other realizations the new Gexpro loans made in the first quarter were repaid in April, as the company merged with Lawson Products. Although we are pleased with the return on the revolver and the delayed draw, the IRRs are not meaningful given the short holding period. We have fully realized our position in Assia, which was acquired by DZS. After quarter end, we invested in 4 new portfolio companies and had 1 realization in an existing portfolio company. First, we invested in Archer Systems, which supported the LBO of the company by Fortress. We invested in Evergreen North American Industrial Services, a portfolio company of the Sterling Group. We also invested in the club financing the PVI Holdings, Inc. to support the LBO of the company by MiddleGround Capital. Lastly, we fully realized our position in Linux, as the company made a substantial acquisition and refinance its debt. Using the GICS standard as of June 30, our largest industry concentration was professional services at 11.6%, followed by IT services at 9.3%, internet and direct marketing retail at 9.0%, household durables at 7.4%, and trading company and distributors at 6.7%. Our portfolio companies are in 20 GICS industries as of quarter end, including our equity warrant positions. As of June 30, we had 35 portfolio companies unchanged from March 31. As of today, we have 38 portfolio companies. For the quarter ended June 30, 2022, our net investment income was $2.5 million or $0.18 per share. Our debt investments during the quarter had an average yield of 10.4%, while realizations and repayments during the quarter had an average yield of 12% and fully realized investments had an average IRR of 23.7%. Although this was distorted by the timing of a delayed draw before the repayment of GS operating, which created an exceptionally high IRR, excluding GS operating, the IRR was 15.3%. As of June 30, our portfolio consisted of 35 portfolio companies, 91.9% of our investments were first lien and the remaining 8.1% is invested in equity warrants and other positions. As of June 30, we had 6 investments on non-accrual, which included all three investments in PGI, two investments in 1888, and one in Deluxe. With respect to our liquidity as of June 30, we had $9.2 million in cash, of which $6.6 million was restricted cash with $31 million of capacity under our revolving credit facility with Capital One. Additional information and the composition of our portfolio is included in our Form-10 which we expect to file on Monday, September 12. With that, Iâ\u0080\u0099d like to return the call back over to Mike. First, Iâ\u0080\u0099d like to address the decline in NAV this quarter, which is driven from a variety of factors, including the broad-based market movement in credit spreads and a few specific portfolio companies, including Techniplas, CareerBuilder, and PGI. Approximately one-third of the change in unrealized depreciation in value of investments for the quarter is related to the markdown of the Techniplas position, which was driven by inflationary headwinds into the auto sector and volatility in the public equity markets. If we look at the trends in the stock price of the public comps set we use, the significant decline from the quarter ended 3/31 to the quarter ended 6/30 has recovered with modest broad-based gains over the past few weeks. However, we are optimistic that a constructive conclusion is possible and we believe that short maturity provides a catalyst for M&A or capital markets activity. Our fair value takes into account movement in broad market spreads as well as company-specific factors, both positive and negative. Since June 30, spreads have tightened fairly significantly, making us optimistic about a reversal of some of these mark-to-market effects. As mentioned last quarter, we expect to see our gross and net leverage generally converge. As of September 2, our gross and net leverage were 1.63x. As we have previously stated, the advisor will waive the portion of our management fee associated with base management fees over 1x leverage. Through the calendar year to-date and fiscal year end June 30, the company has earned its dividend and is expected to earn its dividend through the next quarter ending September 30. On August 25, our Board of Directors declared a distribution for the quarter ended September 30, 2022 of $0.15 per share payable on October 14 to shareholders of record as of September 23. Looking ahead, we remain highly focused on our risk management. Although we cannot predict the timing of the Fedâ\u0080\u0099s actions, we believe the portfolio is well positioned to benefit from any increase in short-term rates and defensively positioned to navigate broader macro and geopolitical challenges. In your prepared remarks, I mean you said the underlying operating performance of most of the portfolio companies remained strong, obviously some not the case. I mean you outlined some specific ones, obviously, CareerBuilder, etcetera. Are there any others, because if I do the math, it looks like you said just over a third was mark to market which implies two-thirds wasnâ\u0080\u0099t. I think if you look at CareerBuilder, and Techniplas, those two account for I think over half of the NAV write-down, and then a third of it being market spread. So, you are between 80% and 90%. I mean if we look forward, rather than the numbers you have already seen, which obviously are backwards looking in terms of performance numbers. I mean also in the prepared remarks, you talked about staying away from certain industries, right. I think the last three quarters or four quarters in particular, we have been really focused on lower leverage companies. When I look at the bulk of our companies, they are two plus and three plus times levered. And on all of our management calls, we are asking about more labor input costs and things of that nature, in addition to the diligence we are doing upfront. And today, I donâ\u0080\u0099t think any management teams are really bullish on labor costs, but by and large, they have them a, under control and b, taken other costs, saving initiatives out of their cost of goods sold to a lot for that. I would just add a couple of things that on the ones that Chris highlighted that we have been focused around lower leverage, there is two other key things. Itâ\u0080\u0099s typically been at the high end, low-50%. Itâ\u0080\u0099s been significant equity and junior capital, and principally equity below as in all new deals. To your point around cash availability, and we have done a lot of sensitivities around LIBOR increases beyond where we are, as well as sensitivities to EBITDA deterioration and we feel very good about the portfolio. If I can one more, on the dividend, obviously, you said you expect to earn it in the September quarter and I realize itâ\u0080\u0099s hard to project out long-term especially with the Fed doing whatever they are going to do. But just conceptually to earn the dividend with NAV where it is right now, hopefully it will be bounced, but where it is right now, you need an income return on equity before realized gains and losses or unrealized as well of about 9.5%. Do you believe that the business at this size, with the management fee structure, the cost of debt, etcetera, the overhead costs, can the business sustain a 9.5% income although we long-term which is what you even as rates move, thatâ\u0080\u0099s what you need to earn the dividend. The â\u0080\u0093 as of June 30th, the non-accruals based upon a fair value are 1.08% approximately $2.5 million fair value. So, the names have not changed, the amounts have actually gone down quarter-over-quarter. So, that non-accrual fair market value was 3.4 in March, and is now 2.5. And then I guess in terms of your operating leverage, taking it all in and understanding to Robertâ\u0080\u0099s point earlier about the dividend, you are operating at a very high leverage at a time when the economy can really weaken and your credit quality can erode quickly. And we have â\u0080\u0093 I think we are over 1.7 at a point earlier, either December quarter or March quarter. And can you sustain the dividend at a 1.25 leverage ratio, or would it have to be higher than that? Obviously, with rates going higher BDCs are going to benefit from that mainly floating rate assets in there. As we watch LIBOR and SOFR go up, we have had contracts that keep rolling off and resetting all of those resets were causing, a, average to increase. While they are widening, not tightening, which is in my experience over 25 years, that wonâ\u0080\u0099t continue for the high-quality borrowers where you keep seeing the base rate go up, you will see a little bit of contraction on spread. And we are continuing to see first lien and â\u0080\u0093 first lien or first lien stretch, but first lien loans have significant equity components in new deals. I would say that if you go back two quarters, three quarters, the average yield was probably around 8.40, 8.50 on the portfolio that has increased new deals we are looking at on the low side are 9 to 9.5. So, for where it is today, as well as the spread and assuming a OID of 2%. So, long way of saying if you look at our portfolio today, I think there is some increased potential in it. I wouldnâ\u0080\u0099t say itâ\u0080\u0099s significant, in my definition of significant would be over 100 basis points on average."
}