{
    "symbol": "MTCH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 11:26:05",
    "content": " Tinder performed well in the quarter, delivering direct revenue of $449 million, up 13% year-over-year, 20% on an FX neutral basis. Indirect revenue was $14 million in the quarter up 7% year-over-year, as we continue to see strong demand for ads in our products and rates increased year-over-year. Sales and marketing spend excluding Hyperconnect decreased $13 million or 10% year-over-year, the second straight quarter where we saw year-over-year reduction as we continue to reduce marketing spend at our more established brands and to show ROI discipline overall. Product development cost excluding Hyperconnect grew 51% year-over-year and were 10% of revenue, as we increased headcount particularly at Tinder and Hinge in a highly competitive labor market. While we expect the second half of the year to be below our growth targets, we believe the company remains positioned to deliver accelerating revenue growth as we move through 2023, driven by improved product execution at Tinder. Here's the way that I kind of think about the back half for the year generally, Q3 and Q4, which is between what we expect to deliver now for the back half of the year and versus what would have resulted in our hitting our recent guidance, which was low end of the 15% to 20% range for 2022. We think that Hinge will contribute nicely to the overall company margins and still grow at the levels that we've been talking about as we've been providing our outlook, which, as we say, is 50% for this year and we think we'll be very strong into 2023 as well. And also we'll start to see stronger revenue growth, stronger revenue generation from Tinder in particular as the new team really starts to accelerate and build momentum, and that will help drive momentum on the product development side as well as should help overall company margins because as I mentioned in my remarks, the fact that Tinder which is a very high margin business is not contributing as it has been, does have a significant effect on the overall company margin."
}