{
    "symbol": "FET",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:22:05",
    "content": " It begins with market fundamentals, propelling investment in energy production, revenue increasing global activity and higher capital equipment spend, margins expanding through operating leverage and portfolio optimization, and with our asset light business model, converting EBITDA into free cash flow. Importantly, we turned EBITDA in over $17 million of free cash flow in the third quarter. For the fourth quarter, we are guiding revenue of $180 million to $190 million and EBITDA of $16 million to $20 million. Bottom line, even including this additional expense, our third and fourth quarter EBITDA results will put us at the top end of our full year guidance of $50 million to $60 million. We are pleased that our third quarter free cash flow was just over $17 million, keeping us on track to be within our previous expectation for back half 2022 free cash flow of $30 million to $40 million. Our EBITDA to free cash flow conversion of nearly 100% benefited from keeping accounts receivable and inventory balances relatively flat, despite increasing revenue and from the lack of a quarterly cash interest payment. Completions segment revenue was $72 million in the third quarter, an increase of $6 million or 9%, despite the number of completions in the U.S. being essentially flat. In our Production segment, revenue was $34 million, up 14% as both product lines experienced double-digit revenue growth. So $125 million of net debt post a conversion pro forma for Q3, and wanted to guide ahead to continue free cash flow generation, both in the fourth quarter here as well as into 2023. If we think about this Q4 revenue run rate and some growth on top of that as we go into â\u0080\u009823, given the outlook for both international and domestic, when it feels like weâ\u0080\u0099re knocking on $800 million plus of revenues for next year, Lyle, you talked about 25% to 40% incrementals."
}