{
    "symbol": "MAPS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 20:56:04",
    "content": " During this call, we'll make forward-looking statements including statements about our business outlook, strategies and long-term goals. For a discussion of risks and other important factors that could affect our actual results, please refer to our SEC filings available on the SEC's website in our Investor Relations website as well as the risk and other important factors discussed in todayâ\u0080\u0099s earnings release. Since then, we may have made announcements related to the topics discussed, so please refer to the company's most recent press releases and SEC filings. Also during this call, we'll discuss certain non-GAAP financial measures and it isn't to financial information prepared in accordance with GAAP. We posted $49 million in Q4 revenue, $2 million in Q4 adjusted EBITDA and ended the year with $29 million in cash, while continuing to be debt free. Further, we grew our paying clients by double digits versus last year despite challenges in our end markets. In my first quarter back at the helm, our team's focus was stabilizing revenue and getting back to our operating culture of driving profitability. And while there is still work to do, we're pleased with the progress we've made so far and are confident we have the right team and strategy in place. The cannabis industry is facing additional headwinds as we deal with over regulation, the slow rollout of new licenses across the country, a lack of government support combined with high taxes from all levels of government, commoditization of cannabis products, frozen capital markets, limited access to banking, and a thriving black market. Given the nature of our users, each user engagement that we send to our clients, whether online or offline, creates meaningful value, especially in times like these. As we've been getting back to our roots and focusing on making the plant front and center, both brands and retailers alike want to associate their brand with Weedmaps, given how we engage and help shape the culture of cannabis. As I mentioned last quarter, the key for us in 2023 is focus. We are focused on three things: our marketplace experience with users, delivering undeniable value to our clients, and doing all of that with a goal of profitable and sustainable growth. For example, we're engaging with expert scientists cultivators and breeders across the country to tell the terpene and micro cannabinoid story across Weedmaps. We're also engaging with Dr. Bonni Goldstein, our former Medical Director and leading cannabis physician to create educational content on the therapeutic effects of cannabis. Weedmaps has historically been and will continue to be a safe place for users to find cannabis for wellness, and to help treat serious conditions and ailments. We're also working to improve the shopping experience of our users by enhancing our taxonomy,  and our search results to make search more intuitive across our platform. Weedmaps has historically been the authoritative source for all things cannabis, and will continue building on that marketplace reputation by differentiating our content, user experience and data in 2023. Next, we'll focus on delivering undeniable value for our clients to improve their returns. We plan to expand our advertising solutions across product categories, giving our clients more ways to reach our high intent users mid funnel and impact our purchase decisions. We will make it easier for our clients to onboard, integrate and grow with Weedmaps regardless of their tech stack, and we will support our clients with local activations, retailer appreciation tours, brand collaboration and exclusive merchandise drops  so they can leverage the power of Weedmaps brand to tell their own stories. Finally, we'll focus on driving profitable and sustainable growth. Rather than a one size fits all approach to markets, clients and solutions will be disciplined in how we prioritize investments. We'll be pulling back spend against some of our newer non-marketplace solutions, while we evaluate the product market fit of these offerings. We've already done the heavy lifting, removing excess layers of management across the company, simplifying processes, and changing the way we work to drive sales and savings. Deeply invested and successive Weedmaps, and will continue to drive our pace as we do our part in driving profitable growth for the industry. And though 2023 will be challenging, we believe that the future of the cannabis industry is bright and exciting for those with a vision, knowhow and willingness to take it on. And we know how to leverage data to not only acquire customers, but to showcase the products that will keep them coming back. Until then we'll continue executing against our focus priorities, and leading from the front as we take the industry through this next stage of growth. It's time like these were the power of Weedmaps brand, the value of our marketplace and the strength of our leadership position within cannabis truly signed with our users and clients. Thanks, Doug, and hello to everyone on today's call. Q4 revenue came in at $49 million resulting in a 5% decline for total second half revenue, consistent with our prior guidance. While our adjusted EBITDA continues to be impacted by provision for doubtful accounts, we saw these non-cash charges narrow in Q4 as we expected. Adjusted EBITDA prior to these charges was $4 million, reflecting the cost reduction actions we took throughout the quarter. While our growth continues to be impacted by and market headwinds, which are driving reduced levels of spend by clients, we continue to expand our client base. And when looking at spend levels by existing clients, we're seeing signs of stabilization, with our net dollar retention continuing to hold that level is consistent with the prior quarter. Our net dollar retention within California, which continues to be our largest region at 54% of Q4 revenue expanded in Q4 versus the prior quarter. We rationalize a number of areas across the company reducing access management layers within our sales and marketing teams, and eliminating our cross functional  in favor of a new centralized operating structure. Our adjusted sales and marketing and G&A declined by 14% and a 11% as a result, with product development increasing by 11% versus last year. We reported a net loss of $61 million for the quarter, which includes $6 million in stock-based compensation along with approximately $56 million in other non-recurring charges. The bulk of which is related to the valuation allowance we took against our deferred tax assets, which is a non-cash charge, along with severance payments associated with the headcount reduction we executed during the quarter. More information on these charges is available in our earnings release and will be in our Form 10-K. We close the year with $29 million in cash, continue to be debt free and are comfortable with our liquidity position. In light of recent events, we're monitoring our banking situation closely and feel comfortable with the security of our cash deposits. Lastly, as noted in our release, we have reported in our Form 10-K, a material weakness on our general IT controls related to internal user access and change management over certain systems that are relevant to our financial reporting. According to our outlook, we're confident that the sharp focus on our marketplace, client value and profitability will help us navigate through the continued end market headwinds impacting our skilled markets. We expect to expand our paying client base given the opportunities we see, but also expect to see continued pressures on revenue per client across several of our skilled markets as a result of the ongoing declines across our end markets. Given these headwinds and general uncertainties in the current macro environment, we will not be providing full year guidance on revenue or adjusted EBITDA. We expect Q1 revenue, which is our seasonally lowest quarter will be slightly down versus Q4 at $47 million given seasonality related to the Q4 holidays. On profitability, we expect double-digit adjusted EBITDA margins and positive cash flow in 2023. We're starting this year with a run rate level of adjusted OpEx that's consistent with where we were after we closed our go public transaction, and prior to accelerating investment. To that end, we expect Q1 adjusted EBIT DA will be approximately $4 million as we ramp investments heading into the 420 holiday. As Doug noted, 2023 will be a year to remember as we drive a focus at our priorities. Arden, so really nice progress in the margin front and Q4 and what's implied in Q1. And when we've gone through cycles of accelerating investment, how we've been able to kind of show shortly after that investment acceleration ends the cash flow kind of generation that our business model supports, right. So back in fiscal 2019, when we went -- last went through an investment acceleration year. You'll see in fiscal 2020, I think that's what you're referencing, the EBITDA and cash flow that we were able to generate, coming off the heels of that. Obviously, we've done a lot of heavy lifting, as Doug referenced, over the last quarter. Come January and in terms of your second question around, where do we find these opportunities, I'd say: a, there's a general kind of mindset of let's find productivity and operate leanly across the company. Now, with that being said, a lot of the cost reductions that we took in Q4 were very surgical around certain areas. And what I characterize those areas, as is: a, we eliminated a lot of excess kind of management layers and infrastructure that we had created. So we have created a number of cross functional orgs across the company, that candidly we're slowing  ability to get our teams to move at the speed at which they wanted to. And then if you looked at the other areas where we've really accelerated investment, it's a lot of our go-to-market kind of teams. And so what we've done is been a lot smarter round, kind of pruning our go-to-market resources to kind of align with the market opportunity that we see in the near-term. And so we took a hard look at how our teams were working and try to see where we could, again, remove redundancy to get more productivity. And why I say that is, in theory, when we're dealing with healthy marketplace dynamics, we would like to see that number not grow too much, because we're continuing to expand in new regions, right. And as we talked about in the past, as we're expanding in new regions, those tend to be lower spend levels versus our skilled regions. Now, the issue that we're having in this environment, as we talked about for the last few quarters, is that across our scaled markets, specifically California, Colorado, Oklahoma, as folks have seen with a third-party data, end market GMV continues to decline, continues to decline on a quarter-over-quarter basis. If you look at the data year-to-date in 2023, so far, it's been sequentially down for the better part of the Q1 to date period. And so we're very mindful of that dynamic in terms of how remodeling out plan and planning against those skilled markets or the skilled states of California, Oklahoma and Colorado. What I will say though, is outside of those three states, we're seeing very healthy demand trends amongst your clients. We're seeing healthy demand trends, in terms of not only our ability to grow our paying client base, but also spend levels across these regions. We've got our eyes focus specifically on those three states to just to get a read around client tone and health of our clients, because it's still touching go obviously in those three states, but outside of that it's business as usual as getting after the opportunity. So as we referenced earlier on the call, we still have some residual charges, cash costs related to the cost reduction efforts that we took in Q4. So we talked, or we filed in our aka last quarter, the severance charges related, the headcount reductions that we took. So we talked about just under $11 million of cash charges when we thought our  December, we've paid out over the course of Q4. What I will say is, we've fully thought through the severance charges that have -- that are left to go in terms of our liquidity and cash management and planning and the like. We've sized our cost base at a level where we have clear line of sight towards generating positive cash flow, regardless of what happened in California, Colorado, Oklahoma. Okay, second question has so third-party kind of metrics, we look at similar web  shows the time on the platform is down pretty significantly and accelerated year-to-date. I know, you're still kind of evaluating that, going back to draw board what youâ\u0080\u0099re disclosed, but your sales teams also, obviously have to be armed with something to the value. There's no doubt there's absolute pressure across the board, on the marketplace, but we're still dialing in to see what the best metric is that reflects the health of our marketplace. But there are pockets of what we used to do great at Weedmaps, which is kind of tell the plant story. And then these new features that we discussed, like category based allows us to really penetrate lower in the funnel. Final question, I guess I'll just ask and this is a realized you can't control the market. But if you think if you step back and think about the original thesis of the Go Public transaction, a lot of it was the kind of take advantage of being a public cannabis play and being kind of most capital efficient. And if you're not rewarded for that, do you see the strategic value in remaining there and given you've got cash flow insight, this is a capital efficient platform, you're going to have more options than others. Listen, we're focused on executing the answer plan. Obviously, it's a tough capital markets environment. But for us, we're focused on what we can control, what we control is executing against the plan that we have. So I guess first, one for Doug, so you've been back with the company for about four months now. And I had one for Arden, it seems like the allowance for doubtful accounts kind of keeps coming up, I guess curious how we think about the cadence of that through the balance of the year. So as I'm getting out there and talking to folks, the one thing that does come up is, because a lot of budgets are compressed in the industry, they're really reading on Weedmaps, to tell their brand story. So kind of bring in some of the old gang back in the company has been exciting as well, because we've been able to build some relationships with the MSOs and brands on the East Coast, that were a little elusive to us. So, what we're really doing now is focusing on the marketplace, our data and our search. We're really developing our content, which we think will help in all markets. And through our data integrations and bringing kind of the pros back around, that's really our goal is to be the thought leader. But the main takeaway that I've gotten from most folks is that, it's tough. And even on the second question you had, you're right, we did have bad debt expense again, in the quarter, it was about just over $2 million. Listen, it's still touching go, as I mentioned before, in those three states, and with end market declines, trending the way they are we continue to be very kind of vigilant around not only collections and or gross, AR growth. One of the big moves that we made starting the year was to put the accountability of our collections back into the hands of a lot of our account teams, because they're quite successful in terms of managing that client relationship."
}