{
    "symbol": "HCCI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 08:18:33",
    "content": " The total first quarter revenue exceeded expectations at $139.4 million, which helped produce record first quarter EBITDA of $24.1 million, which was up 45.5% compared to EBITDA in the first quarter of 2021. During the first quarter of fiscal 2022, oil business revenue was a record high for a 12 week quarter at $54.7 million, an increase of $18.8 million or 52.3% compared to $35.9 million in the first quarter of fiscal 2021. Additionally, our base oil sales volume of 11.8 million gallons during the quarter was slightly higher than the volume of base oil sold during the first quarter of 2021 and further contributed to our record revenue performance. Despite the move upward in the acquisition cost for our used oil feed stock if you compare our pay oil during the first quarter to the last time crude oil price was at a similar level during 2014, our paper oil was approximately $0.60 per gallon lower during the first quarter of 2022, compared to that earlier period. In the first quarter of 2022, we generated $139.4 million revenue, compared to $105.4 million in the same quarter of 2021, an increase of $34 million or 32.2%. This compares to net income of $9.2 million or $0.39 per diluted share in the year earlier quarter, which represents a basic earnings per share increase of 41% compared to the first quarter of 2021. Oil business segment first quarter revenues of $54.7 million, were a record for a 12-week quarter represented an increase of $18.8 million or 52.3% compared to the first quarter of fiscal 2021. From a profitability standpoint, oil business segment profits before corporate SG&A expense increased by $8.4 million or 83.1% to $18.5 million, which represents a record for a first quarter. The operating margin was 33.7% in the first quarter of 2022 compared to 28.1% in the first quarter of fiscal 2021, the higher operating margin compared to the first quarter of 2021 was mainly due to an increase in the spread between the net back on our base oil sales and the price paid or charged to our customers for the removal of their used oil. From a used oil collection perspective, our rug truck loading efficiency also increased by 1.5% in the first quarter of 2022 compared to the first quarter of 2021. This increase was achieved in spite of the fact, that we increased the number of used oil collection sales and service representatives by approximately 12% during the quarter compared to the first quarter of 2021. The increased efficiency combined with more reps, led to a 16% increase in internally collected used oil volume during the quarter compared to the first quarter last year. The change between our net charge for used oil, during the first quarter of fiscal 2021 to net pay for oil during the first quarter of fiscal 2022 was $0.39 per gallon. Sequentially, our pay for oil increased by $0.04 per gallon from the fourth quarter of fiscal 2021 to the first quarter of fiscal 2022. As a result of these factors, and the inflationary impacts Brian mentioned earlier in both segments, our total company operating costs increased by $25 million or 32.6% during the first quarter of 2022 compared to the first quarter of fiscal 2021. We generated $24.6 million in cashflow from operations during the quarter, which represents a 51.8% increase compared to the first quarter of 2021. We also generated free cash flow of $15.4 million during the first quarter of 2022, compared to $10.9 million during the first quarter of 2021, for an increase of 43%."
}