{
    "symbol": "HCCI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 14:28:04",
    "content": " During the fourth quarter of fiscal 2022, Oil Business revenues increased 14.3% to $75.3 million compared to the fourth quarter of fiscal 2021. Oil Business segment operating margin performed better than expected for the fourth quarter of 2022, but decreased 7.3 percentage points to 26.4% compared to 33.7% during the same period of 2021. In the Environmental Services segment revenue for the fourth quarter of 2022 was $165.8 million compared to $103.7 million for the same quarter of 2021, an increase of $62.2 million or 60%. Environmental Services segment profit before corporate selling, general and administrative expenses was $35.1 million or 21.2% of revenue compared to $22.8 million or 22% of revenue in the year-ago quarter. As Brian mentioned, our Oil Business segment revenue increased 14.3% to $75.3 million compared to the fourth quarter of fiscal 2021. From a profitability standpoint, Oil Business segment operating margin was $19.9 million or 26.4% of segment revenue during the fourth quarter compared to $22.2 million or 33.7% in the year-ago quarter. On the used oil collection side of the business, our weighted average pay for oil increased by $0.22 per gallon in the fourth quarter of 2022 compared to the fourth quarter of 2021. The Environmental Services segment reported revenue of $165.8 million, an increase of $62.2 million or 60% during the quarter â\u0080\u0093 compared to the fourth quarter of fiscal 2021. The organic revenue increased during the fourth quarter compared to the prior year quarter was driven by both volume and pricing in our parts cleaning, wastewater vacuum and antifreeze businesses, and primarily volume in the containerized waste and field services businesses. Revenue from the Patriot Environmental acquisition during the fourth quarter was $36.6 million, which represented 35.3% of revenue growth for the segment compared to the fourth quarter of fiscal 2021. On a sales per working day basis, overall Environmental Services segment revenue increased approximately 57.9% compared to the prior year quarter. This represents the third consecutive quarter of record EBITDA, adjusted EBITDA of $42.1 million with 17.5% of revenue and represents a 17.9% increase compared to the prior year quarter. Your line is open. But just from a pricing breakdown, we've seen in most of the lines of business, and I mentioned â\u0080\u0093 I called a few of them out the last quarter and probably for the last couple of quarters, we've seen roughly a 50-50% or 50-50 breakdown, maybe a little more skewed towards volume in one quarter in 2022 and price the other, but pretty close to 50-50 as far as price and volume that's driving the increase. Your line is open. Your line is open. Your line is open. Your line is open."
}