{
    "symbol": "HCCI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 16:30:02",
    "content": " Mark will provide additional detail, but total third quarter revenue exceeded expectations at $172.2 million, which helped produce a record adjusted EBITDA of $43.5 million, which was up 37% compared to EBITDA in the third quarter of 2021. During the third quarter of fiscal 2022, Oil Business revenue was a record high for a 12-week quarter at $65.5 million, an increase of $14.7 million, or 28.9% compared to $30.8 million in the third quarter of fiscal 2021. Oil Business segment operating margin decreased slightly to 40.6% in the third quarter of fiscal 2022, compared to a record high of 42.8% in the third quarter of fiscal 2021. The lower operating margin compared to the third quarter of 2021 was mainly due to an increase in transportation-related expenses, increased downtime at the re-refinery and other inflationary pressures across the segment, which offset an improvement in the spread between the netback on our base oil sales, and the price paid or charged to our customers for the removal of their used oil. In the Environmental Services segment, revenue for the third quarter of 2022 was $106.7 million, compared to $72.3 million for the same quarter of 2021. Environmental Services profit before corporate selling, general and administrative expenses was $24.8 million or 23.2% of revenue, compared to $17.3 million or 23.9% of revenue in the year-ago quarter. In the third quarter of 2022, we generated $172.2 million in revenue compared to $123.2 million in the same quarter of 2021, an increase of $49 million or 39.8%. This compares to net income of $18.5 million or $0.79 per diluted share in the year-earlier quarter, which represents a diluted earnings per share increase of 24.1% compared to the third quarter of 2021. From a used oil collection perspective, our rug truck loading efficiency increased by 2.2% in the third quarter of 2022, compared to the third quarter of 2021. Oil production volume along with higher hydrogen, natural gas and catalyst costs led to an increase in our operating costs at re-refinery of approximately 51% on a per gallon basis compared to the third quarter of last year. Environmental Services segment reported revenue of $106.7 million, an increase of $34.3 million or 47.5% compared to the year-ago quarter. Revenue from the Patriot acquisition during the third quarter was $13 million, which represents 12.2% of the revenue growth for this segment compared to the third quarter of fiscal 2021. Our overall corporate SG&A expense of $18.6 million represents an increase of $4.2 million or 29.4% compared to the year-ago quarter, driven by an increase in salaries and benefits as well as amortization of intangibles from acquisitions made during the second half of 2021. Your line is open. Your line is open. Your line is open. Your line is open. So I think that for the fourth quarter, add in that factor, where the Street is at $1.36, street numbers would come in a little bit on the base of the original legacy but because of what you're saying in used oil, the environmental solutions would be flat sequentially and therefore, I add in Patriot and I'm up from where we are. Your line is open."
}