{
    "symbol": "EME",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 13:50:18",
    "content": " Overall, the quarter went about as expected for us, with a little more pressure on operating income margins in our Domestic Construction and Building Services segments due to the disruptions caused by supply chain issues and the Omicron variant. Over the next several slides, I will augment Tony's opening commentary and review each of our reportable segment's first quarter operating performance as well as other key financial data derived from our consolidated financial statements included in both our earnings release announcement and Form 10-Q filed with the Securities and Exchange Commission earlier this morning. Excluding the impact of businesses acquired, first quarter consolidated revenues increased approximately $239 million or a strong 10.4% quarter-over-quarter. Before reviewing the operating results of our individual reporting segments, I would like to highlight that each of our segments had strong revenue growth in the quarter and that our consolidated revenues of $2.59 billion represent a new first quarter record that is only eclipsed by 2021's fourth quarter, which generated the highest quarterly revenue in our long history. Excluding incremental acquisition revenues of $34.9 million, this segment's grew -- this segment's revenues grew organically 6% quarter-over-quarter. Increased project activity within the commercial market sector, exclusive of the telecommunications submarket sector as well as growth in each of the manufacturing, health care and transportation market sectors were the primary contributors to this segment's quarterly revenue growth. Selling, general and administrative expenses of $252.6 million represent 9.7% of first quarter revenues and compared to $224.1 million and 9.7% of revenues in the year ago period. These supply chain delays not only impacted project timelines, but also led to labor productivity and efficiency challenges, which is a major contributor to the significant reduction in this segment's operating margin quarter-over-quarter. Further impacting gross profit margin was a shift in the portfolio of project work being performed by the segment's commercial site-based services division, including a quarter-over-quarter decline and certain add-on work, such as COVID-19-related cleaning and sanitation services and an increase in more traditional facilities maintenance-type projects. However, gross margin of 13.6% is lower than the 14.8% in last year's first quarter, which set new first quarter records for both gross profit and gross margin. Needless to say, with our growth in revenues during the quarter, we did eclipse 2021's first quarter gross profit and we established a new quarter 1 gross profit record. Diluted earnings per common share in the first quarter was $1.39 as compared to $1.54 per diluted share for the prior year period, despite the quarter-over-quarter reduction in EPS, the first quarter of 2022 represents our second best earnings per share performance in a first quarter. Working capital has decreased by just over $109 million, largely as a result of the decrease in cash just referenced which was partially offset by an increase in accounts receivable, given the revenue growth during the period and a decrease in accrued payroll and benefits due to the incentive payments made during the quarter that I previously mentioned. Total debt, exclusive of operating lease liabilities remains nearly identical to that as of December, and EMCOR's debt to capitalization ratio has increased modestly from 10.4% at year-end 2021 to 10.9% at March 31, 2022, given the reduction in our shareholders' equity resulting from our share repurchase activity during the first quarter. Together, our 2 domestic construction segments experienced strong construction project growth in the quarter and RPOs increased by $865 million or 22.7% from March 2021. All 3 business divisions under U.S. Building Services, our commercial site-based services, government services and mobile mechanical services saw RPO increases from the year ago quarter with mobile mechanical services RPOs increasing $272 million. Continuing a trend we saw throughout 2021 RPO growth was broad-based in the first quarter across most market sectors with commercial RPOs, including hyperscale data centers and high-tech semiconductor projects increasing 28% year-over-year. Yes, Sean, the only thing I would add to Tony's comment is we're presuming that revenue is going to continue to grow at the levels it did in the first quarter and presuming we're going to get some incremental improvement in margin contribution, which clearly we believe that or otherwise we would have changed guidance."
}