{
    "symbol": "GATX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 14:34:09",
    "content": "  Operator: At this time, I'd like to welcome everyone to the GATX 2022 Fourth Quarter and Full-Year Earnings Call. Good morning everyone, and thank you for joining GATX's fourth quarter and 2022 year-end earnings conference call. I'm joined today by Bob Lyons, President and CEO; Tom Ellman, Executive Vice President and CFO; and Paul Titterton, Executive Vice President and President of Rail North America. For more information, please refer to the risk factors included in our earnings release and those discussed in GATX's Form 10-K for 2021, and in our other filings with the SEC. And then I'll turn it over to Bob for additional commentary on 2022, as well as our outlook for 2023. Earlier today, GATX reported 2022 fourth quarter net income of $48.4 million or $1.36 per diluted share. The 2022 fourth quarter results include a net negative impact from tax adjustments and other items, of $0.18 per diluted share. For the full-year 2022, GATX reported net income of $155.9 million or $4.35 per diluted share. The 2022 and 2021 full-year results include net negative impact from tax adjustments and other items of $1.72 per diluted share and $1.08 per diluted share, respectively. As noted in the release, we currently expect 2023 earnings to be in the range of $6.50 to $6.90 per diluted share. I'll provide some brief comments on 2022 performance versus the outlook we had coming into the year, and then try to provide some additional color on the 2023 guidance we gave in this morning's press release. Before jumping in, I want to thank our employees for their continued focus and the effort they've put forth over the past year. Across GATX and all of our businesses, Rail North America, GATX Rail Europe, GATX Rail India, Trifleet, and our engine leasing business and partnership with Rolls-Royce, everyone performed at a very high level. I fully expect we'll carry that momentum into 2023, all with the goal of continuing to generate attractive risk-adjusted returns for our shareholders. So, let's start by looking back first at 2022, and I'll try to do so briefly. One, Rail North America performed better than planned. So, let's look a little bit more specifically at each one of those. At Rail North America, in the middle of the year -- in the middle of 2022, we updated our earnings guidance based on strong secondary market activity. That continued in the back-half of the year, so for the full-year we came in higher than planned. Second, the lease rate environment for existing railcars was very favorable. But one of the key things was, is that customers were very focused on retaining holding on to the cars they had in their existing fleet. Therefore, lease rates increased throughout the year and lease revenue came in stronger than planned. Third, with demand for existing railcars is as high as it was, you end up with a very high renewal success rate, which we indicated in the press release. And when there's less churn in the fleet there are fewer service events, and that has a positive impact on expected maintenance expense. So, in summary, at Rail North America versus the expectations we had coming into the year, we ended up with higher remarketing gains, higher revenue, and   maintenance expense. And while it's still well below pre-pandemic levels, the trend was helpful. And that led to Rolls-Royce & Partners Finance, our joint venture, posting higher operating income and having to deal with fewer customer credit issues than we assumed. While demand was very strong, Rail International had to contend with significant market disruption. But I would like to note in the face of these challenges, our teams did an outstanding job manning our business day to day. Thatâ\u0080\u0099s a testament to our team, to our customers, and to the reach we have into the markets in which we participate. Much like railcar renewals, a lot of our investment volume comes in very small lots. Letâ\u0080\u0099s turn to 2023, as Shari noted we expect EPS to be in the range of $6.50 to $6.90 per diluted share. This would represent another very strong year, especially following the exceptional EPS growth of approximately 20% posted in 2022. Within Rail North America, we expect another very good year in terms of lease rates. With the full-year impact of last yearâ\u0080\u0099s rate increases flowing into this year and continued increases in rates, we see lease revenue up $30 million to $45 million in the year ahead. As interest rates continue to rise over the course of the last year, it did not have a significant impact in our financial results last year. So, where se sit right now we see total interest expense at Rail North America increasing $15 million to $30 million in the year ahead. Is that we can bring assets to market that are of interest to people, other investors regardless of the cycle or interest rates or other macro events. We see that continuing in 2022, and we expect remarketing to come in at the same heightened levels that we saw this past year. So, incorporating these factors, we expect segment profit at North American Rail to increase up to $50 million over 2022 already strong results. At Rail International, we anticipate seeing positive contribution to segment profit growth from both GATX Rail Europe and GATX India. And we are looking to add 1300 to our fleet in 2023, a level similar to the past year. Hopefully, that turns out to be a cautious expectation, but itâ\u0080\u0099s the correct one to take right now given the supply chain issues that continue in Europe. Importantly, our team in Europe has done an outstanding job of moving lease rates higher. In India, the overall rail market continues to develop. Quite frankly, the only issue for us in India right now is whether we can get access to wagons to keep pace with demand. Based on strong demand internationally, we see segment profit at Rail International increasing $10 million to $15 million in 2023. At Portfolio Management, the biggest driver obviously is our engine leasing activity both at Rolls-Royce and Partners Finance and through our direct investments. As we noted in the press release, we added $150 million worth of engines to our directly owned portfolio in the fourth quarter. Also at the joint venture level, we expect to see continued albeit gradual improvement in air travel and a steady improvement in the health of international airlines. But unfortunately, inflationary pressures everyone is facing will manifest itself in higher SG&A expense at GATX in the year ahead. So, SG&A is forecast to increase approximately $10 million in 2023. But on the flipside, on our other expense line where we recognize our pension expense, we expect to see a decline of $10 million. So with our tax rate coming at a similar level to 2022, the items I just mentioned drive our earnings guidance of $6.50 to $6.90 per share. Looking at investment volume, we again anticipate being north of a billion in 2023 which will be another excellent year. In the final comment on the guidance and the assumptions that I just outlined, this is one of the most unpredictable environments I have ever dealt with the GATX in my 25 years here. And Paul and Tom, who are also here with me here with today, are also 25-year-people at GATX and they would say the same. The war in Ukraine continues on, interest rates and inflation remain at elevated levels and global supply chain issues while they may not be as acute as they were over the last 12 months, but still an issue. And to close before we go on to questions, while I thanked our employees at the onset of the call, I especially want to thank our employees who work on our maintenance network. Your line is open. We're going to bifurcate that; I'll take the first part, and Tom will take the second part of your question. So, with respect to absolute rates when we think about sequential improvement from the previous quarter, broadly speaking, for both tank and freight cars, we're seeing sequential improvement in the low teens. That's going to vary by car type, but certainly substantial sequential improvement in lease rates. So then, for the LTI, going forward, we would expect to see a level similar to what we've seen through the course of this year, where, quarter-to-quarter, it varies, but a steady drumbeat of the increasing lease rates. And then, I wanted to ask about RRPF as well, just because the contribution went up pretty significantly in the fourth quarter relative to the third quarter. Yes, Justin, so you've been following us a long time and know that that remarketing piece, just like it does in the rail business, can move around quite a bit quarter-to-quarter. So, first of all, just to give you the numbers, for the fourth quarter the operating piece was about $12 million and the remarketing piece was about $13 million. That going forward, Bob mentioned in his opening comments, that we expect increasing contribution on segment profit. Again, calling the exact timing and magnitude of the remarketing is something that's pretty challenging. Okay, and just, lastly, to clarify on that Portfolio Management guidance for 2023. So, that contribution is -- in Portfolio Management is in total, and you would expect to see about somewhere in the order of two-thirds one-third RRPF contribution to   contribution. Your line is open. In the past, when you had -- you've had a strong upcycle, I think they've gotten as high as 70 months, and although that was all the way back in 3Q '07. And as you noted, it's been in the low-30s all year. Last quarter, we noted that the LPI term is starting to get pretty disconnected from the actual renewal term on a fleet-wide basis. So, last quarter, we gave you that number, we provided that average renewal term for all quarterly renewal activity. For the fourth quarter, it's 61 months. And for the full-year, it's 52 months. So, I would focus much more on that 52-month year-to-date number much more so than the quarterly number I provided. As we look forward, we would expect, directionally, that term to increase in 2023. And so, we'll buy when we can generate a positive NPV from buying, and we'll sell when we can get a higher price than our hold value. And I'll add actually that within in the secondary markets, we are seeing some increasing ability for us to be successful while sticking to our investment discipline. And so, I'm cautiously optimistic that we're going to see more success in the secondary markets. Certainly, the indications are that we're seeing that right now. Yes, Matt, and just to add to Paul's comment too, I've been encouraged actually on both sides of the secondary market as 2022 unfolded. And we're seeing, I think, similar trends here in the early part of 2023 for opportunities to sell, but also to be a little bit more successful in our bidding activity on the buy side. And given our activity and our presence in the market, we see portfolios and we see the -- kind of the offering packages from both, the big and the small sellers. And we've seen, I would say, that the success rate has also been driven by the fact that we've seen some offerings of assets that are of particular interest to GATX in where we have a set view and a very, potentially, unique view on trends over the longer-term. But you would think with rising interest rates that that would somehow eventually lead into less activity in the secondary market, but we haven't seen it. And currently, investors, clearly they're still searching for hard assets with a very good yield attached. And we have high-quality assets with high-quality customers on long-term lease, very strong high-quality cash flow. And so, there's still a robust market for those. We've used this strong market to originate attractive leases which will allow us to sort of restock the portfolio of potential sale, going forward. So, that's one of the benefits of a strengthening market like this is it allows you to continue to reload your potential future secondary market offerings. Your line is open. We could be in a situation of, I would think accelerating velocity, potentially, and freight coming down the other side of it. First of all, what I want to say is it's going to be difficult to predict railroad velocity. And so, the railroads obviously are trying to hire, they're trying to improve service right now. We do continue to have the view though that there is -- we refer to as freight on the sidelines, freight that is not moving right now that could move in the network if service were improved. So, when we look out and look at the possibility of improved velocity, improved network fluidity, we don't necessarily see that as a downside as we might have seen in the past because we think there's freight that wants to be on rail that will move on to rail once the service is available to take it. So, I would describe us as more optimistic in the face of potentially improving velocity than we might have seen in other cycles. Yes, and Allison, I'll add to that too, Paul's comment there that, as we've said historically, better the higher velocity and more opportunities for the railroads is not something that we fear. And so, we don't want a situation where customers are frustrated because they can't move product by rail and look elsewhere. So, we feel much better and, as Paul said, more optimistic about the fact that if they do improve velocity we know, from talking with customers, there's product there ready to go on rail. And then just a question on boxcars, it seems like there's been a structural decline in terms of amount of scrap, and it's not necessarily surprising, but just want to understand how you view that period, I see you investing, but maybe not at the level of the scrappage rate. We're going through a cycle because there were a huge number of boxcars built in the 1970's, really up through 1981, and those are scrapping out. So, what we're seeing here is the ageing out of the fleet, and then the replacement investment in higher-capacity newer cars to address that. We also think that, to the extent we see more modal shift to rail, particularly ESG-driven modal shift in the future from companies that want to reduce their carbon footprint, the boxcar could really be a beneficiary of that. So, I would say right now, for us, the boxcar portfolio has been a good portfolio for us. Your line is open. So, we are finally in a position now where we can report that for most of the portfolio -- for the significant majority of the portfolio, lease rates are now generally over their long-term averages. It's higher for certain car types, lower for other car types. And I would say right now, slightly higher across the board for tank than it is for freight. So, we are, as we are in all rising rate environments, particularly when rates get above our long-term averages, we are going to work with our customers to incentivize them to choose longer-term leases. And lastly, it certainly sounds, at least with tone, that you're more enthusiastic about investing acquisitively in North American rail assets today than you have been in your recent quarter. I -- what I would say is, up or down market, GATX is always interested in adding assets to the portfolio, particularly rolling stock. And so, the diversified fleet that we have, there's no asset out there we're not familiar with. And absolutely, we want to continue, that the portfolio is very -- the franchise is very scalable. But yes, we're always -- there probably isn't many portfolios or many assets that change hands out there that we don't get a look at. I mean -- but to follow up, it certainly seems like your enthusiasm on something happening sooner rather than later is different than it has been in recent quarters. Well, I don't think our view has changed materially over the course of the last few quarters, or last few years for that matter. I think the earlier -- the comment earlier on this call really referred to smaller opportunities that we've seen, one-off asset-type acquisitions that we've been able to execute because we like a particular asset. Your line is open. First question would just be on some of the market dynamic, so, you talked about, I think, sequential low double-digit lease rates in tank and freight which would -- have been acceleration from my guess, the 5% or less last quarter. So, it's really more of the same phenomenon we've talked about in recent calls, which is to say you have an existing railcar market that is relatively tight, and that's been driven by a fair bit of scrappage. And it's been driven by the fact that, thanks to high new car prices and labor availability, the new car production that we're seeing is not consistent with past upswings in the market. So, you have less new capacity coming in, you've had older capacity going out, and you've had relatively low velocity, coupled with what we think is a continued relatively robust underlying demand to move freight by rail. So, it's really all of those things that have created tightness in the fleet and that have allowed us to increase prices. I mean, if you look back to the crude boom, you had an industry that produced new cars at a rate of up to 80,000 a year. So, that's one of the key differences in this market. And then the scrappage rate, I guess, at least on your book, so about 500 cars per quarter. Given the size of our fleet, Justin, that's a pretty reasonable number on a quarterly basis in our annualized -- just based on the eight cars that will be aging out of the fleet naturally, thatâ\u0080\u0099s about the right number. And then just a couple of nuanced questions, what is the marketable security account on your balance sheet the $148.5 million -- or the short-term investment number related to the $148.5 million? And on the tax rate you mentioned sort of a similar going forward in that 25%-ish range, so, nothing unusual there. And then lastly, just -- you mentioned the break down the increase in expected segment profit in Portfolio Management between RRPS. And then, we added to it this quarter with an additional $150 million of investment. And, Justin, weâ\u0080\u0099ll continue to look for opportunities there as well to kind of methodically, systematically add to that portfolio."
}