{
    "symbol": "ADV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 21:30:08",
    "content": "  Operator: Ladies and gentlemen, good afternoon, and welcome to Advantage Solutions Fourth Quarter and Full Year 2022 Earnings Conference Call. At this time, I'd just like to turn the conference over to Kimberly Esterkin, Investor Relations for Advantage. Thank you, everyone, for joining us on Advantage Solutions fourth quarter and fiscal year 2022 earnings conference call. During this call, management may make forward-looking statements within the meaning of the federal securities laws. These statements are based on management's current expectations and involve assumptions, risks and uncertainties that are difficult to predict and could cause actual results to differ materially from those expressed or implied by such forward-looking statements. Actual outcomes and results could differ materially due to a number of factors, including those described more fully in the sections titled Risk Factors and Management's Discussion and Analysis of Financial Condition and Results of Operations announcement in the Company's filings with the Securities and Exchange Commission. The Company does not undertake any duty to update or revise any forward-looking statements whether as a result of new information, future events or otherwise, except as required by law. Our earnings release, which was issued today, presents reconciliations of these non-GAAP financial measures to the most comparable GAAP measure, which can be found on the Investors section of our website at advantagesolutions.net. And now, I'd like to turn the call over to Advantage's CEO, Dave Peacock. Today is my first earnings call since joining Advantage, and it also marks my exactly one month of the Company. In the past four weeks, I've spent time with our team to understand the state of our business. In my brief time here, I've seen new opportunities for our company which serve as constant reminders of my decision to join this team at this time was the right one. In talking with our clients, it's clear that the work we do is highly valued and critical to the success of their businesses. It's also clear that Advantage's capabilities are as relevant now as they've ever been, given the challenging labor market for our retail customers and given intense competition among CPG players. As I consider the experience of working an Advantage for our associates, we need to be more intentional in our on-boarding efforts and provide a clear path for those associates who are looking to advance within our company. For the ninth consecutive year, Advantage holds the number one market share in essential sales and marketing services and the number one position in experiential and event marketing. With not quite 30 days under my belt, I'm continuing to fully immerse myself in our business, and we'll spend the next few months building a further understanding of our capabilities our challenges and the opportunities that will allow us to deliver value to all of our stakeholders in years to come. First, our relentless focus on the core value proposition to customers. Next, this business should provide strong cash flow yield, and this will be a guiding focus for how we operate going forward. A strong balance sheet is the foundation of any good business, and we will reduce our debt level and associated ratios over time. Fourth, people make all the difference in this business. And finally, we must have optimized processes supported by systems and analytics that are executed with precision and how a company like ours leverages scale and relative market position most effectively and creates value for all constituents. I'm excited about this team's commitment to deliver, and I look forward to sharing more about our strategy in the months to come. It's great to have you as part of the team, and I'm looking forward to continuing our partnership together. On a consolidated basis, fourth quarter revenues improved 6.8% year-over-year to $1.1 billion. Revenue improvement was driven by the strength in our lower-margin business services, including retail and merchandising services, which was partially offset by a decrease in third-party selling and retail services. Marketing segment adjusted EBITDA of $35 million was down 42% year-over-year, driven largely by the ongoing spend and inflationary impact of recruiting, wage and employee benefit expenses, coupled with headwinds in our higher-margin digital business services. In the aggregate, as anticipated, adjusted EBITDA margins came in at 10.2% and down 470 basis points year-over-year, reflecting a decline of 320 basis points in the sales segment and 690 basis points in the marketing segment. In October, we conducted our annual impairment test, which led to the non-cash goodwill impairment of $1.368 billion and $205 million non-cash intangible asset impairment charge. These impairment charges were mainly due to a sustained decline in the Company's quoted share price, headwinds from inflation and the rising interest rates. Our net debt to adjusted EBITDA finished in the fourth quarter at approximately 4.5x, and it remains our goal to delever our balance sheet and reduce our leverage ratio over time, and we are open to considering very initiatives that adhere to that goal. For the full year, we achieved levered free cash flow conversion prior to earnouts or M&A of approximately 20% of adjusted EBITDA, which we believe will improve in 2023. Staying in line with prior quarter, our debt profile remains healthy, and we have no meaningful maturities in the next four years. At the end of the fourth quarter, our total funded debt outstanding continued to be approximately $2 billion. For the year, we anticipated adjusted EBITDA in the range of $400 million to $420 million prior to adjustments related to any acquisitions and divestitures. While this is a decline from our 2022 results, we believe it is prudent given the continued industry headwinds and the uncertain macroeconomic conditions. As the quarters progress and we have more visibility around our business, we will revisit our annual guidance. While we do not provide revenue guidance, I would note that as we refine our business and refocus our efforts on our core areas of strength, we will, as just noted, consider several strategic alternatives such as making divestitures of certain business services that do not align with our main focus areas. These divestitures could result in a decline in our revenue and EBITDA, but as currently contemplated, would improve our overall leverage position. With that said, I'd like to provide some more insight into why as of the date of this call we believe this is the right adjusted EBITDA range for the year. Relative to our previous expectations, this has resulted in a more gradual rebuild on our in-store sampling and demonstration business services as well as our retail merchandising business services despite continued demand for our offering. While labor is starting to show signs of improvement, this improvement is slower than the Company had previously anticipated. And in the fourth quarter, Advantage made approximately 1,500 net new hires. Second, inflationary pressures have also negatively impacted the profitability of our business. In operating our workforce subscale, we're not able to fully leverage certain fixed costs in our labor-intensive business services which has negatively impacted our margins. Furthermore, we continue to see a price lag associated with our sales business segment given the ongoing higher-than-average increase in wages, travel, gasoline and other expenses. In the new year, we will continue to pursue pricing opportunities to offset wage and ancillary spend increases and preserve margin. While the year-over-year wage inflation slowed to mid-single digits in the second half of 2022, compared to high single digits to low double digits in the first six months of the year, this is still well above our long-term inflationary rate increases. As labor costs increase, we remain diligent with regards to pricing and continue to approach our customers for price increases. Although securing labor remains challenging, we remain confident that the business will continue to build back this year. Operational redesign, technology enhancements, efficiency initiatives and aligning pricing to value are not only enabling us to weather the current environment but are also helping us to establish the necessary building blocks for long-term success. Dave, I wanted to start with you given your fresh perspective here is clearly, there's some headwinds facing the Company. And then internally, we've got to find ways to deliver on our clients and customers' expectations, leveraging technology, being more efficient, really understanding and decomposing our time to serve in the market. And then as Brian referenced in his comments, you will see, I think, a demonstration business continue to bounce back. We were encouraged to hear in last week's Cagney sessions, so much discussion around innovation. And typically, where there's innovation, there's a desire for sampling and to get products in front of people. So, we've got a number of levers that we can pull both internally and then you get the macro environment that we're optimistic eventually will be more favorable for our business. I mean I think it's been an issue, and I think even it's on one of the slides here. I think, have had 18 or 19 different client meetings, a lot of traveling and understanding what's important to them, how we should be tracking their business alongside them, getting ahead of any gaps in performance or opportunities for better performance in the marketplace. It is not an overly complex business, but it's a highly executional complex business, and it requires a lot of attention to detail. And I think as I've spoken to clients, I've been reassured of the value we provide. The moment of truth for a lot of our brands, products and with their consumers is it's retail. So, I think it's building on that continuous loop, reinforcing that value proposition and always demonstrating a strong ROI that justifies the value we're creating for them. And more organized now than they were a few years ago, and they're also competing on price. And I think, Brian, you've said a couple of times that when we've talked over the last year that you haven't lost any customers yet to price, is that still the case. But at the end of the day, we need to focus on our clients and customers and the job we're doing for them. We've got a great relative market position in just about all of our businesses with more than 60,000 employees with over 3,000 clients and a significant position in the marketplace, both with retailers and with our branded CPG companies, we've got a unique perspective being at that intersection on the business and especially with the breadth of categories and business we worked on. So first, starting with your confidence in the $400 million to $420 million for next year. If we take where you finished the year and we apply normal seasonality to it, normally deliver like 30% of the EBITDA in the fourth quarter. First, I'd say, while there's been historic average as it relates to where -- how our EBITDA has -- where it's been derived by quarter in this environment, especially when you have the volatility of both the labor market, you've got timing of pricing rolling in relative to contracts. The percentage of EBITDA that comes from a quarter may change, number one. If you look at Q4, first of all, if you look at the COVID impact of '21 versus not being COVID in '22, and you look at the quarter -- second quarter to second quarter, third quarter to the third quarter and just apply it trending for Q4, that's about half of the difference. And then also in Q4, specifically, we have a timing difference in the sense of for demo, we had a price increase in Q4 of '21 to address wage inflation in '22. We did get a significant price increase in Q4 of this year, but it's effective Q1 of '23. And then also, we've had headwinds, which I'm sure you've seen in the sector on the digital advertising aspects that hit us in Q4 as well. So it's -- there's a some differences within the quarter that we think give us confidence, I guess, going into our $400 million to $420 million for next year. I know you didn't give revenue guidance for next year, but we can all kind of back in just some reasonable assumptions. And it implies like you in the mid-9s, mid- to high 9% EBITDA margin range, which is, it's kind of similar to an outsourced manufacturer for CPG companies or a private label supplier to retailers. And I don't think it's unreasonable to assume that they're going to look to you as something similar, an outsourced provider or sort of basic production or a here in this case, basic labor. And if you try to get greedy like any private label manufacturer would and chase a higher margin, you're going to lose business and it becomes just sort of spiral where you get stuck in this 9% to 10%, which can be fine, right, in terms of cash generation, if you're generating good cash. A couple of things to think about when you make that comparison, one, I do think this could be -- should be a low teens margin business long term. A little bit of labor cost mix, if you will, kind of full-time hourly relative to part-time hourly as it relates to just the full pin wouldn't change as far as the number of people. When I looked at the top 10 categories in private label, they're anywhere from, on average, on a 10 to 20 different contract manufacturers where we're in a different situation where you've kind of got what I'd say kind of three national alternatives, us being the largest regional network and doing it yourself. And when you factor in the thought that we do believe that this could be slightly higher margin, and look, right now, if you look at trading multiples of where some contract manufacturers have traded historically, at least in the last seven years, you apply that multiple to our business, and we should have a $5 stock price today. So to your point, it's not all bad, but I think there are differences. And I layer in the fact that we need to, and I mentioned in my prepared comments, be very dogmatic about leveraging the insights we benefit from being at sort of this intersection of CPG and retail, brand and private label, and make sure that we're finding as much value as possible for our clients. And we think the revenue side of these businesses is absolutely critical, not diminishing the production side. But if we're the partner we should be with our clients and customers, the support we provide should come with a premium. Well, I think one, we have, some of that's going to start rolling through, as Brian said, as you move in through the year. But we have taken steps in that regard over the last call it, 12 months, you do see contractual timing also impacting our contract timing impacting sort of a lag as it relates to when you can capture price with certain of our businesses. You've made a number of acquisitions in the last three years, telling into roughly $250 million of outlays. So I think when you look at it, it's not easy to say it from like an apples-to-apples basis because a lot of the businesses we're acquiring. We're requiring a servicing capability that we can leverage our relationships with the clients, our relationships with the retailers, the depth and breadth of our personnel, our technology. So, we run them together with the businesses, not separately. I'm saying historically, we've talked about paying on average mid-single digits multiples. Ladies and gentlemen, since there are no further questions, I would like to turn the conference over to Dave Peacock, CEO, for closing comments. Our scaled talented team is a true source of competitive advantage for our company, and we intend to unlock this value as we work to better enable the organization to drive growth."
}