{
    "symbol": "ADV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 23:23:02",
    "content": " Our data and technology-driven services, which include headquarter sales, retail merchandising, in-store and online sampling, digital commerce, omnichannel marketing, retail media and others, help brands and retailers of all sizes get products into the hands of consumers anytime, anywhere, in any channel in which they choose to shop. Revenues continued to grow solidly in the quarter, up approximately 16% year-on-year, driven largely by the continued recovery in our in-store sampling and demonstration services, along with further growth in retail merchandising services and international businesses. As anticipated, our first quarter adjusted EBITDA declined 13% from the prior year period, reflecting the following: a shift in revenue mix with historically lower margin demo business regaining momentum; the ongoing reinvestment activities I just referenced, most notably in the quarter related to staffing and recruiting; continued challenges in our foodservice business; and we also experienced an unusual increase in the amount of self-insured medical claims. Turning to segment results for the first quarter, revenue growth remained strong in our sales segment, up 11% year-on-year, driven by growth in retail merchandising services and a healthy rebound in the COVID-impacted international business. Our revenue growth in Q1 was primarily driven by continued improvement of our sampling and demonstration following the return of in-store events, strengthened by our retail and merchandising services, including solid contributions from an acquisition we made in September as well as ongoing recovery of our COVID-impacted international businesses. Turning to our Q1 adjusted EBITDA results, the year-over-year decline was predominantly due to higher labor costs to increase headcount in support of our return to full-scale operation in our in-source sampling and retail merchandising, along with continued challenges in our food service businesses; increased investment in new technology; and unusually high medical benefit expense. As we look ahead, we anticipate our revenues and adjusted EBITDA will be significantly stronger in the back half of the year as compared to the first half, supported by the ongoing recovery and scale of our sampling, administration and international businesses and continued strong contribution from our digital marketing services."
}