{
    "symbol": "GTLB",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-06 20:04:02",
    "content": " Our One DevOps platform drives compelling business outcomes providing our customers with what we believe to be distinct competitive advantage, being able to build, deploy, and secure software better (ph). In the first quarter of fiscal 2023, we exceeded our guidance with revenue of $87.4 million and this represents revenue growth of 75% year-over-year. We are in the midst of a generational disruption, whereby we believe all companies are becoming software driven businesses and this requires an increasing number of companies to embrace modern software development practices, to deliver captivating mobile and digital experiences to their customers, as well as engage in cloud migrations, designed to provide agility and future proof (ph) their development, operational and infrastructure requirements. Based on a study conducted by Forrester Consulting and commissioned by us, GitLab customers saw 407% return on investment within three years of deployment of our DevOps platform. I will quickly recap our first quarter results for FY 2023 and key operating metrics, introduce guidance and conclude with some additional context regarding our business, and how strong demand for our DevOps platform translates into a strong financial profile. Revenue of $87.4 million this quarter represents an increase of 75% organically from the prior year As of quarter end, we had over 5,100 customers with ARR of at least $5,000 compared to 4,500 customers in the prior quarter and over 3,100 customers in the prior year. The Ultimate tier is our fastest growing tier, now representing 39% of annual recurring revenue for the first quarter of FY 2023, compared with 26% of annual recurring revenue for the first quarter of FY 2022 and continuing to grow in excess of 100%. For the second quarter of FY 2023, we expect total revenue of $93.5 million to $94.5 million, representing a growth rate of 61% to 63% year-over-year. As I mentioned last quarter, we will incur approximately $20 million of incremental expenses related to the resumption of travel and in person customer marketing events as well as new public company costs that were not incurred in the first three quarters of FY 2022. If you exclude JiHu, we almost had identical non-GAAP operating income for this quarter versus the quarter last year, we grew revenue 75%, which basically added $38 million of revenue for the same absolute profitability. It was a great quarter overall and happy that we committed to guidance at the midpoint of delivering $400 million in revenue, which is approximately 59% year-over-year growth."
}