{
    "symbol": "TH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 14:17:04",
    "content": " I would now like to turn the conference over to Mark Schuck, Senior Vice President of Investor Relations. Good morning, everyone and welcome to Target Hospitality's second quarter 2022 earnings call. The press release we issued this morning, outlining our second quarter results can be found in the Investors section of our website. This call will contain time-sensitive information as well as forward-looking statements which are only accurate as of today, August 9, 2022. Target Hospitality expressly disclaims any obligation to update or amend the information contained in this conference call to reflect events or circumstances that may arise after today's date, except as required by applicable law. For a complete list of risks and uncertainties that may affect future performance, please refer to Target Hospitality's periodic filings with the SEC. Leading the call today will be Brad Archer, President and Chief Executive Officer; followed by Eric Kalamaras, Executive Vice President and Chief Financial Officer. Good morning, everyone and thank you for joining us on the call today. Target has intentionally aligned itself with premier customers, including the United States government, who find increased value in the flexibility and premium service offering Target provides. We continue to experience consistent increases in customer demand across our HFS segments, supported by strong demand fundamentals. As a reminder, this contract represents a 60% increase from the initial contract we announced in 2021 and includes significantly enhanced amenities and support services for a population of approximately 6,400 individuals. This is a clear illustration of our commitment to diversify and expand Target's end markets, while simultaneously high-grading counterparty exposure and contract structure. These elements, along with Target's unmatched operating capabilities and distinct core competencies create the optimal scenario to pursue a balanced portfolio of value-enhancing growth initiatives. In the second quarter, we experienced continued strong demand fundamentals and positive momentum in customer activity, predominantly driven by the materially expanded government services contract we announced last month. The significant increase was attributed to the expanded humanitarian contract that we announced on July 6 which had an effective date of May 16, 2022. As a result, the new humanitarian contract contributed approximately six weeks of earnings during the quarter. As a reminder, Target's Government segment including the expanded humanitarian contract center around annual minimum revenue commitments. Additionally, the expanded humanitarian contract includes variable services revenue that will align with monthly changes to community population. This increase was driven by sustained momentum in customer demand for Target's premium service offerings, supported by constructive economic and demand fundamentals. While Target has significantly grown its revenue and adjusted EBITDA over the past year, we have remained diligent in appropriately managing cost components across the organization. Recurring corporate expenses for the quarter were approximately $8 million and illustrate our ability to significantly grow the business, while incurring minimal incremental corporate costs. As a result of this scalable business model, we anticipate recurring corporate expenses to remain around $8 million to $9 million per quarter through 2022. Total capital expenditures for the quarter were approximately $37 million, with $35 million related to the substantial infrastructure enhancements associated with the expanded humanitarian contract. As a reminder, this expanded contract will result in a transitory increase in 2022 capital spending. However, this increase will be balance sheet neutral with continuing leverage improvement occurring by year-end 2022. Further, Target anticipates additional balance sheet strengthening continuing into next year, with the expectation of having 0 net debt by year-end 2023. We ended the quarter with $10 million of cash and total available liquidity of $114 million, including $104 million available under the company's $125 million revolving credit facility and a net leverage ratio of 2.3x. Additionally, this strong financial position creates the optimal platform to continue pursuing our strategic growth aspirations focused on further expanding the company's long-term opportunities. These broad-reaching opportunities utilize key elements of Target's existing capabilities including construction and facilities management, offering long-term growth opportunity pipelines. These strategic growth initiatives will focus on utilizing Target's existing operating capabilities to pursue a balanced portfolio of value-enhancing opportunities across Target's existing end market portfolio and adjacent end market applications which we believe provides the greatest opportunity to continue accelerating long-term value creation. Our record-setting second quarter results are a direct reflection of our superior operating capabilities and unmatched network flexibility which supports Target's unique position as North America's largest provider of premium vertically integrated hospitality services and solutions. These attributes have supported strong demand from our world-class customers, including the United States government which has significantly strengthened Target's financial profile. This operating platform creates the ideal scenario to continue pursuing value-enhancing growth initiatives, focused on expanding Target's long-term growth pipeline. Look, no change from the last time we all talked, it's actually progressing very well. We've hit all the milestones, some of the turnover already on some of the buildings as well for the customer. So as we think about this, the thing about utilization there, we're not going to be specifically disclosing what that trend looks like. And then specifically, it will depend partially on how the government decides to nominate its variable component which is a question mark for us. So look, we expect it to continue to improve over the next few months and then we get to more of a steady state. As we think about the margin movement, what I would say is this. So look, there is a ramp, as you can imagine, right, in a big project like this. And so as we think about moving this forward, you obviously have the numbers that we put out for Q2. Look, those will continue to move in the right direction as we move through time here. I would imagine as occupancy increases, we would see a bit of margin improvement assuming that the margin rate, the gross margin of the West Texas facility will be attractive relative to overall corporate rate. Just kind of circling back by year-end, Brad mentioned probably the expansion should be largely complete or certainly the bed parts by October if everything goes as planned, it sounds like it is. Look, on the margin specifically, a couple of things to bear in mind. So you're right, as we continue to get occupancy levels there, that does -- that margin will continue to get better. However, there's also an effective economic promote, if you will, in terms of how we think about the margin, because there's the minimum revenue piece and then there's the variable piece. And so as you get additional per head numbers, occupancy in the variable piece, that incremental margin actually steps down slightly from the minimum. So either way, in the short run, youâ\u0080\u0099ll see margin get better. As you move out in time and as you get additional occupancy there, there is a bit of a plateauing effect as it relates to margin. I would just say everybody knows how much money is being spent, what type of facility this is that we're delivering. Even if on the side, even if yes, you do have diminishing on the improving incremental margin, your absolute dollars are still going up is, I think, the takeaway point there. I'm guessing there's no update but just any thoughts on long-term extension of this government contract, it's a frequent question. Really no update there, Scott, other than what weâ\u0080\u0099ve all talked about, you look at whatâ\u0080\u0099s being spent upfront on this project, just the overall design of a purpose-built really look at this very similar to what happened at our Dilley project and itâ\u0080\u0099s being built for the long term and we expect that to continue on. Even though itâ\u0080\u0099s a one year with a six month option on this first contract, we look at this as does our partners as a long-term solution. Look, it's -- I think any way you cut it, this has been a transformative project for the company and extremely accretive and so no change there. And so I think the outperformance you're largely seeing is a function of when you do projects like this, sometimes the margin in the early months can be front line a bit. And I think as well as just look good, solid operational execution was what drove that. Sometimes we see -- we do see a little -- a couple of percent degradation in that fourth quarter on the HFS side specifically just from holiday turnover, particularly in December time frame. I guess just last one, kind of maybe putting in perspective how we should view potential upside to guidance for the full year in terms of maybe what you are kind of implying in your expectations on the variable side of the contract. So we have not, as you know, specifically given a variable occupancy component or an occupancy component at all. And so until you know that number, you canâ\u0080\u0099t -- you really canâ\u0080\u0099t determine too much more in terms of upside. And I think the first was the HFS South piece of the business, it feels like -- and I want to sort of get your sense for this but it feels like the revenue growth sort of was lagging rig activity and completion activity in the quarter. Look, I wouldn't say there's anything going on that is not reflective of our expectations that we've really had for some time. However, I think even last quarter, I had indicated that the pace of progression has started to slow and moderate to levels that are feeling much more stable. If you're looking at the top line, we did a little bit of an improvement there. We did have some degradation on margin, although that has nothing to do with the activity level, that is more of a function of some lower costs we had last year relative to some higher costs we had this year and just as part of enhancing the business, a little bit of mismatching cost there which impacted the margin. But look, our margins were up in HFS, South, specifically 100 basis points quarter-to-quarter sequentially. The last thing I would say is that labor is a -- look, it is a lagging component by a quarter or so, typically three, four months. And so as an improvement gets better in the market, we will tend to see that increase from the labor side. Okay, it's not a huge piece. I would tell you, I mean, your point is right, not a lot of folks that are setting with the assets that we have, the ability to get those installed, construction done in just really a few short months. The variable component of the new contract, I think itâ\u0080\u0099s like $185 million a year. And I think the other question around that is, I would think -- and correct me if Iâ\u0080\u0099m wrong but as I look into next year, the government wouldnâ\u0080\u0099t be spending this money if they didnâ\u0080\u0099t expect the occupancy rates on that piece to be very high. So as it relates to the linearity, it is not exactly linear because when I was talking to Scott about the margin movement and the promote in that, that causes it not to be quite linear. So as that is to say differently, that as you do see additional occupancy there, you will continue to see nominal dollars continue to increase, albeit at a slightly lower rate than you would have seen in prior quarters, okay, on prior volume periods. As it relates to your point on spend and volume, it has been our expectation that look this facility will be utilized to a level that a government sees fit. But certainly, to your point, it's certainly something that the government obviously is intending to use at a fairly fulsome level. Look, I think there are several right from building maintenance to facilities management, inclusive of catering. A lot of that, I think, fits within exactly what we do today. If you look the organic side for us, it's continuing on with what we're doing, growing some of the HFS side but more getting into the full government services, not just what we do today. I think, Stephen, the other point that I would mention and Brad had in this is if you look at the entirety of the solutions that we provide today, generally, those are full turnkey solutions. So meaning maybe you don't provide all the solutions, maybe provide a handful of our suite of solutions to a variety of different applications. It's to take Target from a business that has talked about $500 million of revenue and very substantial margin and pushing that to over time, close to $1 billion in revenue, right, with the numerous contracts, whether -- and look, whether that's with government or whether that's with other business and industry or combined. And -- but doing it in a way that it's smart, doing it in a way that we are not putting a number of legs to the stool so that none of them are meaningful at the end of the day, doing it in a way that's been very, very complementary to what we're doing. And look, we have seen a number of opportunities. To be clear, there are opportunities out there and we are looking and evaluating those and we'll continue to do so. But to Brad's point, there are a lot of opportunities for us, whether it be full turnkey or whether it be in a disintermediate fashion. If our model is correct, then you have a lot of visibility, youâ\u0080\u0099re going to generate probably $200 million-plus of free cash in â\u0080\u009822 -- excuse me, in â\u0080\u009823 and â\u0080\u009824. So look, you're right. As we think about this cascade of those, there's an orderly operation of events there for us. Our objective is to get leverage down to a point where we have maximum flexibility to continue to diversify the business, the way we've talked about just a moment ago. And then -- look, initially, then looking at the balance sheet in ways that we can optimize that a little bit. But look, putting ourselves in a spot where we can reduce indebtedness is kind of priority number one. As we think about priority number two, it will be to continue to have excess capital where we can be additive to a transaction. Then look, failing either priorities one or two, that puts you back in the spot to think about dividend share repurchases, et cetera. But again, there's a lot of progression that we need to go through. But hopefully, that gives you a kind of an order of cadence as to which we may think through this. Before we close, I would just like to give a big thank you to all of our dedicated Target Hospitality team members. Without you leading the way every day and taking care of our customers, we would not be able to deliver the record-breaking results we did today. With that said, I would like to thank all of you who joined the call today and we look forward to speaking again in November."
}