{
    "symbol": "TH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 17:56:04",
    "content": "  Operator: Good morning, and welcome to the Target Hospitality First Quarter 2022 Earnings Conference Call. Please go ahead, sir. and good morning, everyone, and welcome to Target Hospitality’s First Quarter 2022 Earnings Call. For a complete list of risks and uncertainties that may affect future performance, please refer to Target Hospitality’s periodic filings with the SEC. Target’s first quarter results continue to exemplify the strength of Target’s operating position which continues to benefit from positive momentum in customer activity across Target’s premier network of communities. Target’s top-tier customers continue to find added value in the size and scale of our network, which provides premium hospitality solutions and unmatched logistical flexibility for their labor allocation requirements. Additionally, the intrinsic value of Target’s network has supported an over 90% customer renewal rate for more than 6 years. These elements have supported continued strength in customer activity, resulting in 6 consecutive quarterly increases in HFS-South customer demand. Additionally, these strong demand fundamentals and Target strategically located communities supported the reopening of previously idled assets during the first quarter of 2022. Additionally, Target continues to benefit from its increased concentration of critical humanitarian support services it provides to the United States government. Target’s Government segment represented over 58% of first quarter 2022 revenue, supported by a fully committed minimum revenue contracts backed by the U.S. government. These growth initiatives are focused on broadening Target’s end markets, while significantly expanding our long-term growth opportunities. As it relates to our latest government service contract, which began in March of last year, we continue to have active discussions regarding the extension of this contract. As part of the U.S. government’s plan, there has been a fiscal year 2022 annual appropriation of approximately $8.8 billion. We are encouraged by the sustained momentum experienced in the first quarter of 2022 and believe we are well positioned to continue benefiting from our strategic position as North America’s leading provider of comprehensive hospitality solutions and value-added services. In the first quarter, we experienced continued strong demand fundamentals and positive momentum in customer activity. The significant increase was attributable to an additional U.S. government contract award executed in March of 2021, which contributed approximately $33 million of revenue in the quarter. As a reminder, Target’s Government segment is supported by minimum revenue contracts, which are fully backed by the U.S. government. This increase was driven by sustained momentum in customer demand for Target’s premium service offerings, supported by strengthening economic fundamentals. While Target has significantly grown its revenue and adjusted EBITDA over the past year, we’ve remained diligent in appropriately managing cost components. As a result of this scalable business model, we anticipate recurring corporate expenses to remain around $7 million to $8 million per quarter through 2022. Target continues to benefit from an efficient operating structure and scalable business model, which has allowed the company to match increasing customer demand with little incremental capital requirements. We ended the quarter with $6 million of cash and total available liquidity of $115 million, including $109 million available under the company’s $125 million revolving credit facility. The company has remained focused on preserving financial strength its achieved over the last few years and has a net leverage ratio of 2.6x, which represents a 60% improvement from the first quarter of 2021. These discussions have evolved to include the potential for a significant increase in contract scope, including expansion of existing facility amenities due to the strong continued demand for this critical service offering. The United States government has recently published a detailed summary outlining the capacity and facility requirements for its domestic humanitarian aid program, which encompasses the services Target is continuing to provide as part of the 2021 contract. The U.S. government has allocated a meaningful amount of resources to addressing this ongoing humanitarian crisis including the appropriation of approximately $8.8 billion for unaccompanied children in fiscal 2022 alone, highlighting the critical nature of the humanitarian support services Target is providing. As a result, Target has executed short-term contract extensions to ensure the continuity of our critical services while contract terms are being finalized. As a reminder, the government’s direct prime counterparty to this contract is a leading national, nonprofit organization. As a result of Target’s and our customers’ past performance, we are pleased with the direction of contract renewal and extension discussions and look forward to providing additional information in the foreseeable future. As a result, we reiterated our preliminary 2022 financial outlook, which consists of revenue between $325 million and $335 million, and adjusted EBITDA between $125 million and $135 million with $12 million to $17 million of capital spending. These attributes support robust operating margins and strong cash flow generation, creating an ideal scenario to simultaneously pursue strategic growth aspirations focused on expanding Target’s long-term growth opportunities. Our strategic growth initiatives are  around the strength in Target’s core -- existing core service offerings, which offer the opportunity to unlock value through unique elements of our core competencies. Key elements of Target’s holistic hospitality solutions naturally translate across a wide range of commercial and industrial applications, including disciplines such as construction and facilities management, modular solutions, hospitality services and logistics. Our strong first quarter results illustrate Target’s ability to efficiently meet our varying customers’ needs while positioning the company to continue pursuing value-enhancing growth opportunities. A couple of things for me, if you don’t mind. I know it’s minor, but just curious what’s going on there. And look, I think as you’re seeing a sequential quarter, we have fewer days in the quarter. We are seeing, bear in mind, it’s a positive, but there is a lag between what we see  demand and what actually is happening in the spot level. We’ll typically see a lag of a few months to maybe a quarter or 2 depending on just how things shift there, but as the commodity prices come up as development happens, there is a little bit of a lag there. And so optimistic on how that looks, but I do think it’s probably more back half weighted than front half weighted as a function of some of the lag that we’re talking about. It’s going -- look, it’s going to be primarily more service integrated. And then when you -- just I’m curious on the Government side, and I know you probably can add a whole lot more color. But when you think about this extension that you’re talking about, and you’re obviously pretty confident that you’re in a good spot. I’m just trying to think about this, and this may just be my lack of knowledge on the government side. Look, I’m sure there are some options out there. It’s more about how big is the expansion going to be, taking it from an emergency influx care facility to a more permanent care facility, which adds a lot of things, and you’ve probably seen some of the public memos out there it’s education, it’s medical. We have a great name and a successful track record which is huge, especially when you’re taking care of children. Look, I think the way to think about working capital to give you a little bit of context in this is when we structured the large government contract last year, we had a large upfront payment on that. And then from there, things will normalize from more of a normal working capital trend than you would have previously expected  it’s just complete timing. We should be able to address, especially where we’re at today with them. And I guess just wanted to confirm that you’re saying it’s rolling over month-to-month, the existing contract that is safe to assume that, that was extended through the end of May. Greg, It’s not quite through the end of May, but you’re in the right ZIP code, and that’s an evergreen. Technically from a contractual perspective, it’s month-to-month. But look, we hope that that’s a signal that the -- there’s an announcement hopefully soon. And as you get closer to finalizing the contract, maybe they’re a little shorter, right, which is a good thing for us. We thought we were -- we’re finished with the final design, just late as last week, give you a little color, they came back, they increased the scope. So we had to add some buildings, give them a price increase on some things just because we’re adding square footage, but still on track to get this done fairly quickly, we believe. But this is a -- while it’s a very large project for us and the government, I think all of us got to remember, it’s a small piece of the puzzle in relationship to everything else the government is working on for immigration. Remember, we’re just handling unaccompanied minors. So while it is big, we’re pressing. At the same time, with the cash this business continues to generate, we’re also looking at inorganic growth. And frankly, that we have passed on just because the risk and the return just, look, it just wasn’t there. And we’ll continue to look at those, but we’re also disciplined and so we’ll just -- we’ll keep you posted, and we’ll -- I think we’ve got some exciting things that we’re looking at, and hopefully, we can push those across the finish line. So I think on the HFS side of the business, as I mentioned, we’re probably looking at about 10% year-over-year growth on that kind of Q4 to Q4 exit. Look, I do think there’s going to be additional margin expansion there on the HFS side. On the government side, because there was a pretty significant ramp-up period for the government occupancy last year, you probably see on a relative basis that, that margin come down a little bit. However, I think corporate-wide, you’ll continue to see the margin increase in the neighborhood of kind of 50 to 100, 150 basis points through the course of the year. So I think what you’re seeing, really, as you look at the performance this quarter, we continue to see that getting better as we move through the year. And then, of course, hopefully, we have some other things that we can announce that we’ll obviously propel that. Just curious, would -- I mean based on Brad’s comments, it seems like you have pretty deep discussions on this contract. And then if I flip back to HFS-South, I think -- as I sort of think about this, there’s a difference in rate between sort of committed rooms and any kind of callout rooms and I’m curious how we should be thinking about rooms under contract that are in your guidance versus potentially callout rooms and maybe the impact that might have on ADRs. And maybe the second thing to bear in mind here is that be a little bit careful on the ADR because the ADR in certain contracts, particularly for some of these large contracts, is really just a function of the number of rooms that have come through the system based upon the revenue based on the contract. So if we have a fixed revenue amount that’s coming from the contract and you bring more rooms to us, right, your effective ADR actually comes down slightly. As we’ve talked about in the past related to consolidation because of the size of our network and the nature of our agreements as a preferred provider for the largest publicly traded oilfield service companies operating in the Permian Basin, consolidation, we absolutely benefit from some of those names that you’ve mentioned. Clearly, we’ll continue to support the Permian today on a consolidated basis or on an individual basis. Please go ahead, sir."
}