{
    "symbol": "WTER",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-15 10:15:05",
    "content": " Good morning, everyone, and thank you for joining us for The Alkaline Water Company's Full year fiscal 2022 earnings conference call. During the call, we will be making forward-looking statements within the meaning of the Safe Harbor provisions of US securities laws, and we may make additional forward-looking statements during the question-and-answer session. For additional information about factors that may cause actual results to differ materially from expectations and about material factors or assumptions applied in making forward-looking statements, please consult the company's Form 10-K, which was filed yesterday and its other reports filed with the SEC on EDGAR and with Canadian security regulators on SEDAR. In addition, such forward-looking statements and any projections as to the Company's future performance, represent management's estimates as of today, July 15, 2022. Actual results could differ materially from those contemplated by any forward-looking statements as a result of certain factors, including, but not limited to, general economic and business conditions, competitive factors, changes in business strategy or development plans, ability to attract or retain qualified professionals, as well as change in legal and regulatory requirements. So participants on this call, who may not have already done so, may wish to look at those documents as the company will provide a summary of the results discussed on today's call. In a moment, I will turn the call over to our new CEO, Frank Lazaran, who'll give you an overview of the company's fiscal year 2022 results and our preliminary outlook for fiscal year 2023. Following Frank's comments, David Guarino, our Chief Financial Officer, will provide an overview of the company's financial results. Then we'll be joined in the Q&A portion of our call by our Chief Marketing Officer, Tom Hutchison; and Frank Chessman, our Executive Director of Sales and Operations. Before turning the call over to Frank, I'd like to spend a moment introducing our new CEO to our shareholders. As a 40-year veteran of the retail food industry, Frank brings decades of commercial and C-suite experience in scaling organizations, optimizing operations, and driving innovation in the retail sector. Prior to Marsh, Frank served as the Chief Executive Officer, President and Director of Winn-Dixie Stores, Inc., which was a publicly traded company and one of the largest supermarket chains in the Southeast. Good morning, everyone, and thank you for joining us for The Alkaline Water Company's full fiscal year 2022 conference call. Before we begin, I'd like to recognize that much of the success and growth we've experienced as a company over the past 10 years is due in large part to the vision and leadership of company co-founder and former CEO, Ricky Wright. We wish him the best, and we thank him again for the time and effort he gave to this company leading Alkaline88 to become a top 10 value-added water brand with a foundation of strong sales and a growing national footprint. And you will hear details and our progress to-date of our company-wide review process, which we anticipate will result in benefits to our bottom line of $4.5 million to $5 million annually once fully implemented. I'll reiterate, these initiatives will not negatively impact top line sales, but rather, we will continue to drive revenue, while simultaneously improving the bottom line and increasing shareholder value. This pivot put us on the pathway to profitability comes on the heels of fiscal year 2022, in which we saw our best sales quarters in company history. Not only did we report record revenues this year, but the second and third fiscal quarters represented year-over-year growth of over 50%. We finished with our strongest sales quarter yet, bringing our full year fiscal 2022 revenue to approximately $60.6 million, a 32% increase over last year. As the company refocuses on profitable sales, we are confident that we will continue to see double-digit year-over-year sales growth in fiscal year 2023 and therefore are issuing sales guidance of a record $70 million for the fiscal year. We just wrapped up our first quarter of fiscal year 2023 and will report on the final numbers in mid-August, but early results for the first quarter indicate another record quarter. But despite the slowdown, beverage revenue is still growing and according to Beverage Marketing Corp., the hydration category, which contains waters and sports drinks is still projected to grow 11.6% in wholesale dollars, down slightly from 13% growth reported for last year. According to the Nielsen data, Alkaline88 consistently outpaces the category in sales and unit growth and is a leader amongst the other top 10 value-added water brands. For the 52-week period ending May 21, 2022 in all outlets combined, excluding Convenience, Alkaline88 had the second fast year-over-year growth in both dollar and unit volume amongst top 10 value-added water brands. We believe that Alkaline88 will continue to be a consistent leader in both unit and dollar growth compared to other top 10 peers, even as we refocus on becoming a profitable brand. Compared to the overall value-added category, we had more than double the year-over-year growth rate in dollar volume and more than eight times the category growth in unit volume. As we face economic headwinds, Alkaline88's strong track record gives us confidence for continued growth. And let's not forget that year-over-year, Alkaline88 is taking up more shelf space, more room and shopping carts, and more market share from global beverage giants as an independent company that was founded just 10 short years ago. Our consistent growth is largely attributable to the steady addition of new clients and the expansion of SKUs within existing clients, thanks to the hard work of our sales and marketing teams. Additional accounts, including many up and down the street stores were added, thanks to the work of our direct store delivery partners, who continue to deliver results above even our ambitious forecast. Last earnings call, we shared that a key part of our growth strategy was to add over 10,000 new stores in fiscal 2023 as well as expand SKU count in a possible 15,000 stores of existing clients. Just stays into our second quarter of fiscal 2023, we are already two-thirds of the way to our SKU expansion goal and are well on the way to meeting the new store goal as well. In addition to new stores and SKU expansion, a third important factor in our growth is, of course, Alkaline88 drinkers, who continue to drive organic growth of our deliciously smooth water. New client acquisition, SKU expansion and organic growth have proven to be strong forces for our brand, which will assist in mitigating some of the external economic pressures that the industry is experiencing. However, let me reiterate, Alkaline88 is well positioned to continue to be a category leader in growth and brand expansion. These include adding a new SKU to approximately 8,000 CVS stores for this summer, selling a new one gallon club pack in almost 600 Sam's Clubs across the country. New premium clients like Roundy's and AFEs, along with the expansion of our DSD network. In both sales channels and geographic markets, The Alkaline Water Company is gaining ground. Our rollout of strategic DSD partners in important regions around the country is improving our in-store brand presence, market penetration and top-line growth. As The Alkaline Water Company continues to build on our brand's strong foundation, we clearly understand that our shareholders expect more than just sales growth. In the 40 days since I assumed the role of CEO, we have begun an extensive review of the entire organization, working diligently and leaving no stone unturned as we create a plan for sustained profitable growth. As we continue to pursue growth, the company will have a laser focus on providing and achievable pathway to profitability, driven by cost structure optimization, margin enhancement and a more disciplined approach to capital management. They are a highly capable plant and their full line production will help us meet growing demand in the region, as well as provide logistical benefits to reduce expenses for improved profitability. We also recently announced the addition of Century Springs, which brings Alkaline88 production to the Midwest for the first time. In addition to the newly added co-packers, we are reviewing our co-packing and raw materials networks in order to optimize the production capacities and efficiencies of each partner. Thirdly, we are conducting a thorough evaluation of all outside services across all facets of the company, from marketing to sales to distribution, where redundancies or other inefficiencies exist, we are cutting cost, will be leaner as we continue working with the best of the best to deliver a great product to our customers. We clearly understand the sense of urgency that we must exhibit to improve profitability, and I'm pleased to share that we have already instituted changes that will result in over $2 million in savings over the next year. The change is necessary to realize the remaining $2 million to $3 million in additional benefits will go into effect gradually over the foreseeable future, and we'll continue to identify additional ways to move Alkaline88 towards profitability. Rather, they are intended to support sales growth by making us a stronger company overall. As such, I can assure you that under the new review process, we will turn CapEx expenses requests around in a timely manner so as not to slow down any necessary allocation of capital that will help move our business forward and provide financial benefits. Before I begin, I'd like to encourage interested listeners to review our press release announcing our financial results and our Form 10-K that we filed yesterday with the SEC for a more detailed explanation on some of the year-over-year variances I'll be highlighting today. Our revenue from sales of our products for the fiscal year ended March 31, 2022, was $60.6 million, a year-over-year increase of approximately 32%. This increase reflects organic growth, SKU expansion within our existing retailers and new sales of our products to additional retailers throughout the country. Gross profit for the fiscal year ended March 31, 2022, was approximately $15 million, while net loss for the year ended was approximately $39 million. The change in the year-over-year loss was primarily due to increased costs in raw materials, freight costs and an increase in our total operating cost of $22 million. Net cash provided by financing activities for the year ended March 31, 2022, was approximately $25.2 million as compared to approximately $19.4 million for the year ended March 31, 2021. Before I turn it back to Frank, I'd like to reiterate our full year guidance for the fiscal year ended March 31, 2023. As I've mentioned throughout the call, there is a new focus on disciplined and accountability throughout the organization. Before I turn the call over to the operator for questions, I'd like to reiterate that we are working diligently to put our company on the pathway to profitability while continuing to drive top line sales. Top line sales growth, no matter what has been the standard model for growing CPG companies for years now. And over the past decade, we have seen peers in the water and beverage industry drive their top line sales at all costs. Now, with the changing economic clients that has also seen global beverage and CPG companies putting much greater emphasis on the bottom-line it is vital for a CPG company like ours to not only drive sales and market share, but also to define and execute a clear path to making money. I'd like to reiterate, I clearly understand that at Alkaline88, the innovation of a prior leadership was vital to growing the brand and continuing to grow market share, which led to our double-digit comps, and we'll continue to do so. So, I don't want anybody to mistake that just because we're going through this review of the company, that we are not going to be focused on different product lines, et cetera. But I -- obviously, I -- you and I don't know each other, and it's sort of difficult for me to put together the pieces of your overall strategic thinking from what we've been able to share thus far. Let me -- what I want to do here, Kevin, is I'd like to first tell you from my perspective that we haven't announced yet, but there's several key announcements that will be coming in the near future of additional doors that we are authorized to be in, and we'll announce those very shortly. As I mentioned in the call about the goal that we had to get SKU expansion into existing retailers, because let's face it, we look at it, we have the organic growth of our existing products and then we have the new SKU growth. But -- if you'll allow me, I'd like to turn this over to Frank Chessman, our Executive Director of Sales Operations. We have had tremendous response over the past year in terms of additional SKUs in stores organically, having added over 15,000 stores with additional items. We're very proud of our large sustainable value proposition large bottles, we're clearly the leader in the market, and there's no one close. But clearly, we are a brand that's regarded by the retailer as the innovators in the alkaline water space. And then having a new fresh cap that is dispensed â\u0080\u0093 the only one that dispenses product into an alkaline water clearly not only innovative, but unique and a true value to the consumer. That's why I was looking for some insight on the network, co-packers, doors, and particularly your fresh cap product and introduction throughout your full distribution chain. And our spokesperson Shaq, who will be talking about this product and this launch it's just a perfect fit when you have an NBA Hall of Fame athlete, bringing credibility to a product like that, incidentally, he loves it. One item I'd like to mention as it relates to what Frank discussed and by the way, a great job, Frank, I appreciate that update, is that one of the plants right here in Phoenix is putting capping line in as we speak. But again, if I could just kind of -- not to cut off there, Kevin, but one thing I would just like to emphasize is that while we are clearly driving toward a pathway to profitability, we're not doing things here that are going to impact negatively our top line. And if you could get a flavor of it, I believe, clearly from the conversation with Frank, I am very happy when I walked into this organization, and I've known Frank Chessman a long time, this type of sales organization he's assembled, I've already met a good number of his folks, and these people are clearly driven to drive the top line because we get it. Well, I can tell you, our target is to add an additional 15,000 stores over the next fiscal year. Over the past year, we've added in terms of just new retailers, about 12,000 plus in terms of retail locations. And then in addition, our organic growth will add, I believe, over 20,000 stores with new SKUs this year. So great organic growth along with new store growth for us to take us to our new guidance number, which we believe is very achievable. At Alkaline88, we are committed to continuing to drive the top line, as evidenced by the guidance we presented to produce annual sales of $70 million for fiscal year 2023 amidst these trying economic times. There is currently in place a much more disciplined approach to capital management, and we're developing plans for additional funding when the need arises to support our growth and protect shareholder value. While improving our profitability, we will not lose sight of the importance of top line sales growth and will not compromise that growth. Once again, I'd like to thank you for joining us and for your continued interest in The Alkaline Water Company."
}