{
    "symbol": "HRMY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 12:13:09",
    "content": " The average number of patients on WAKIX increased to approximately 3,900 in the first quarter which is reflective of the anticipated once yearly seasonal dynamic of managed care reauthorization and patient assistance program reverification, typical for branded specialty products in the first quarter each year. I'm excited as we head into the second quarter with momentum in all the following areas; strong top line prescription demand and continued growth in the average number of patients on WAKIX, the broadening of the depth and breadth of our prescriber base, strong market access for WAKIX and continual improvement in access for type one patients. And your second question about net patient adds moving forward, although we're not providing forward-looking guidance, we do anticipate returning to the prior quarterly growth in average patients moving forward in 2022. And, what we're seeing, although it's still very early enrolling on our third year of commercialization is WAKIX is falling right in the middle of that range and it's consistent with what the expectations are from patients from health care professionals. Obviously, it's reflective in our average number of patients on WAKIX for the first quarter, but absent that, and the Patient Assistance Reauthorization, we're very confident we would experience similar patient growth in terms of average number of patients from prior quarters. But we exited the first quarter with approximately 4,100 active patients on WAKIX and I think exiting patients is likely a better metric for the true demand in Q1, given the anticipated seasonal payor dynamics that we experienced. So we're simply just allowing that opportunity and we're expecting the second quarter to build those relationships, learn their geographies, really start to get out and educate those healthcare professionals with the impact of likely new prescription uptake and new patient starts in the second half of the year at the earliest if that helps. So those are really the drivers, I think this is very much an educational opportunity for us and we continue to see growth in new prescribers, as well as increasing the depth of our prescriber base, meaning patients starting a second or third patient on WAKIX with a prescription. Going through the literature in terms of the broader epidemiology, it's potentially up to 70,000 to 80,000 patients in the U.S. And you raise a good point, it obviously and in sleep medicine community, it's an active discussion, idiopathic hypersomnia exists along a continuum or a spectrum in terms of patients with type one narcolepsy, type two, and then IH."
}