{
    "symbol": "HRMY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 11:07:08",
    "content": " At this time, I would like to welcome everyone to the Harmony Biosciences Second Quarter 2022 Financial Update Conference Call. Our presenters on today's call are John Jacobs, President and CEO; Dr. Jeffrey Dayno, Chief Medical Officer; Jeffrey Dierks, Chief Commercial Officer; and Sandip Kapadia, Chief Financial Officer. I would now like to take a few minutes to highlight our progress on each of the three pillars of our growth strategy in the context of Q2 2022 performance, which you can see on slide three. Starting with pillar one, which is to optimize the commercial performance of WAKIX. In Q2 â\u0080\u009822 we delivered a strong quarter for WAKIX as we surpassed the $100 million mark for the first time in quarterly revenue, achieving net sales of $107 million, a 45% year-over-year increase for the quarter. WAKIX business fundamentals remain strong with the second quarter representing our best quarter of performance in top-line prescription demand in over two years. Let's move on to pillar two, which is to expand the clinical utility of WAKIX beyond narcolepsy. During the quarter, we made good initial progress on our Phase III INTUNE Study for WAKIX in idiopathic hypersomnia where we were able to initiate multiple sites and have been actively enrolling patients. This morning we announced a new agreement with Bioprojet, which is designed to leverage its drug discovery capabilities in combination with our proven commercial expertise in the US market to develop innovative therapeutics based on pitolisant. If successful, these efforts could expand Harmony's franchise in narcolepsy by yielding one or more new products with the potential to launch during the WAKIX lifecycle. As we have said before, we began our business development efforts early in our company history so we can take the time to be thoughtful and prudent in what we acquire and flexible in the types of deals we are able to consider. To achieve this, we intend to leverage our strong and growing financial position to acquire additional assets across a range of development stages, including both early and later stage with the potential to launch both during and after WAKIX lifecycle. We have approximately $260 million in cash, cash equivalents and investments as of Q2 and we anticipate that we will continue to generate more cash each quarter from WAKIX sales. Overall, I'm extremely pleased with the progress on our three pillar growth strategy during Q2 and we are well positioned for the remainder of the year to continue delivering on our plans for growth. We made significant strides in advancing our narcolepsy business in the second quarter, both net revenue and underlying business fundamentals as seen on slide four. Net revenue for the second quarter was $107 million, which represents an approximate 45% increase from the same quarter previous year. Our solid performance since launch continues to reflect not only the resilience and commitment of our team, but also speaks to how the overall benefit risk profile of WAKIX aligns with the significant unmet need in the narcolepsy market. The average number of patients on WAKIX increased to approximately 4,300 in the second quarter. We saw further growth in new prescribers of WAKIX in the second quarter of 2022, both in writers of traditional narcolepsy treatments, as well as health care professionals who have been reluctant to prescribe the other available scheduled narcolepsy treatments. I mean, they have written a prescription for WAKIX for two or more of their adult narcolepsy patients since launch. We successfully hired experienced award winning representatives with established relationships to add to our existing outstanding field sales team and that all new representatives trained and active in their territories by April 1, in line with what we communicated in our previous earnings call. As we move into the second half of 2022, we anticipate beginning to see the benefits of this expansion. In summary, I'm excited about our continued strong performance. Thank you, Jeff and good morning everyone. Starting with our development program in idiopathic hypersomnia or IH, we continue to be very excited about this opportunity and are receiving a lot of interest from both patients and healthcare professionals who manage patients with IH. After initiating our Phase III registrational trial in adult patients with IH in April, known as the INTUNE Study, we held a live face-to-face investigator meeting in early June before the Annual Sleep Conference The investigator meeting was very well attended and generated excellent momentum during the start-up phase of the trial. If this Phase III trial is successful, it could represent the next new indications for WAKIX in adult patients with IH. With this, we are on track for topline data readout from this study later this year in the fourth quarter. The full dataset will also include other secondary outcomes of interest, including behavioral symptoms, cognitive function and hyperphagia. Finally, with regard to pediatric narcolepsy and a pediatric indication for WAKIX, you may recall that our partner Bioprojet completed a Phase III trial in pediatric narcolepsy patients. In the meantime, we are committed to obtaining pediatric exclusivity for WAKIX and plan to submit a request for a pediatric written request or PWS later this year. To conclude, we have made significant progress in our clinical development programs as Harmony's clinical enterprise continues to grow. We are excited about the early momentum in our INTUNE Study, a Phase III registrational trial in adult patients with IH. In addition, we look forward to top line data readout from our Phase II proof of concept trial in patients with PWS in Q4. Thank you, Jeff and good morning everyone. Our second quarter performance is also shown on slide seven, eight, and nine. The growth in operating expenses is primarily driven by our ongoing commercialization of WAKIX, our recent sales force expansion and the enrollment in our Phase II proof-of-concept studies in PWS, DM and our Phase III registrational trial in IH. As a result of our strong top line performance we had improvements in operating profitability as we reported second quarter 2022 operating income of $33.1 million compared to $23.3 million, a 42% increase versus the prior year quarter. During the second quarter of 2022, we generated approximately $34 million of cash from operation and ended the quarter with $258.9 million of cash, cash equivalents and investments as of June 30. As John mentioned, we're excited about our new agreement with Bioprojet. Our strong cash position provides us with the flexibility to pursue this agreement, while maintaining sufficient capital to continue to execute on our commercial clinical and business development priorities. Looking ahead, we do expect typical headwinds from summer seasonality in Q3 followed by a strong Q4. In conclusion, our continued strong performance for the WAKIX and the resulting cash generation is enabling Harmony to make important investments in our business, while maintaining profitability and adding to our strong cash balance for business development activities to acquire additional assets. So in summary, our continued strong performance positions us well to execute on our three pillar growth strategy. Based on the first half results and demand trends we are seeing for WAKIX as we enter the second half, we're confident that 2022 can be our best year yet in company history. Your line is now open. One would be from -- I think  could you describe to us the relative impact of the two different practices that you described, those traditionally prescribed a narcolepsy therapies and then those that were more hesitant to do so. Thanks for the question. So when you're thinking about the two different segments, the initial audience that are the oxybate prescribers, writers of traditional scheduled medication. The additional 1,000 physicians that we added to our target universe that had picked up prescribing WAKIX that were not prescribers of the other scheduled treatment, they manage about a 10% of the patient opportunity. And then, Chris, on your second question, this deal allows us to focus on developing new innovative therapies based on pitolisant in partnership with Bioprojet with the focus on narcolepsy. And regarding IP, Chris, what I will say and can say is, it's Harmony's policy to file patent applications alone or with our partners on all patentable inventions that strengthen our assets and it's also our policy not to discuss any pending patent applications, of course, due to competitive reasons. Your line is now open. Yeah, obviously, we're extremely pleased with the strength of our underlying business fundamentals. And you're correct, the Q2 growth really reinforces the underlying organic demand for WAKIX. We built on the momentum, as you noted in March, we had a very strong quarter and I would say that the momentum leaving and exiting Q2 was as strong as coming out of Q1. So as you seen, Q1 has seasonal payer dynamics, insurance resets, re-authorizations, higher gross to nets. So they're going in, they are educating medical staff and getting new writers on and reminding physicians of the benefits of WAKIX. But I would not assume that the new sales force addition will do much to mitigate the typical seasonal dynamics, because those are outside of the control of what Harmony does. So I would just expect that normal typical type of ebb and flow -- ebb and flow to our business, but we do expect overall in the second half as a whole to see, as Jeff was saying, that impact of our sales representatives. Your line is now open. Congrats on the quarter, and thanks for taking our question. Just first, I know you also kind of talked about kind of the 300 to 400 new patient adds per quarter. What we did say is that we, we strongly anticipate continued growth of WAKIX due to the strong underlying demand of the product. Looking backwards, you can see what has occurred, but we're not going to provide forward-looking guidance on it. And  again, I would just harking back to John's response to Danielle is just considering the seasonal dynamics in the second half of the year as you're thinking about our business in that ebb and flow we expect. And then, Jeff Dayno, I think the next question was on mechanism of action. And as you probably know, the prototypical disorder of that hypocretin deficiency is patients with narcolepsy. So that results in overall sleep-wake state instability, that leads to the excessive daytime sleepiness as a key symptom in patients with Prader-Willi in addition to the cardinal symptom of hyperphagia. Your line is now open. So obviously, new patient starts continue to be extremely strong. And as reported, it was the strongest quarter we've had in over a year, but we also saw strong refill behavior. And so, when you're thinking about refilling behavior, it obviously has a reflection on the average number of patients. And then again, you may have a smaller portion of discontinuation in year two and three for chronic medications, which is consistent across the industry. And although we haven't shared specific discontinuation rate information with respect to WAKIX, we're extremely pleased with how the products being received, it falls well within that range, we continue to hear great feedback from healthcare professionals and patients. I think with regards to overall timeline, as you'll notice on clinicaltrials.gov, we estimate about two years to complete the trial and towards top line data readout. Your line is now open. If we didn't comment that previously you see an increase in gross to net in the first quarter, given  that we provide, higher government-related discount and that tends to reverse in the second quarter. And so what you are really seeing in the second quarter is really related to the change in gross to net and we would expect that to be relatively stable for the balance of the year, some fluctuations quarter-over-quarter, but generally, I mean those are the key factors . Also, congrats on the bio Bioprojet deal, and if I could just -- if I could revisit that in terms of I guess how we could think about when you might provide us more color on what those were I will consider is lifecycle management strategies might look like or additional  based formulations. And then my last question is, I think many of us are interested in knowing at what point the company will be in a position to start providing forward-looking guidance. But it's premature to comment now on any additional color or provide necessarily timing at this stage for that commentary, but as we reach key milestones in the development of those programs and the advancement of this program, we'll be excited to share with you and the rest of the investor community on that. When it comes to guidance Sandip, did you want to comment just on when we might contemplate providing forward-looking guidance for the first time as a company. Yeah, I think generally we've -- we wanted to see how things will progressed post COVID and impact to sales force expansion and other things in order to give us enough confidence in terms of the guidance. In the meanwhile, we try to provide least enough qualitative as well as a couple of indicators that help you at least from a modeling perspective, but I think the natural point would be is start of next year. Your line is now open. So I just want to confirm, were there any one-time sort of impacts on the gross to net basis like true ups or any other inventory things that might have impacted the top line this quarter. I think just as we said, what we saw in the second quarter were generally just a reversal of a lot of the gross to net impact if you want to call it from first quarter, there were no major swings at least in the quarter regarding any major true ups or adjustments. No, I think looking at Q2, the trade inventories relatively normalized for the quarter and we anticipate that to remain relatively consistent through the balance of the year. And then on the Bioprojet deal, I'm just curious because we've talked a lot about potential BD to supplement revenue durability beyond the WAKIX patent life. Look Corinne, what I'll say is the addition of HBS-102 last year and now the new agreement with Bioprojet, they are important steps in our journey to building a diversified portfolio in neurology. We're not going to comment on timing in the clinic right now, these are early development phase. And so, what we're going to do is as we hit key milestones we'll be excited to share that with the investment community over time. In terms of development costs that would be rather minimal this year, so in generally, I would say, it will start picking up next year in terms of significant costs there. We have an agreement that we would share at least the first $40 million of costs as part of the development program, 50-50 and after which we would . Your line is now open. And as a corollary to that is, should we think about this as primarily a lifecycle management type of situation or you're potentially going to be looking more broadly with the idea that, yes, these are molecular entities that are based on pitolisant. First, I mean, we remain confident in the strength of our IP and developing new therapeutics in partnership with Bioprojet is not a reflection of our current patent portfolio for WAKIX. As we stated before, we have patents expiring in 2029 and factoring a patent term extension, and our pursuit of pediatric exclusivity for WAKIX has the potential to extend into 2031. We're excited about the deal with Bioprojet, which allows us to focus on the development of new innovative therapeutics based on pitolisant in a way life cycle management, but also in other indications that are mutually agreed to by the parties. And so, as these are early in development, so as we learn more through those programs in our co-development with Bioprojet we will be glad to share further thoughts on strategy and focus areas in the future on those things. So if you're thinking about IHS as an opportunity, it definitely an accretive opportunity to WAKIX. We're not seeing a lot, but I do think that there is a very strong interest in that. Thanks for the question. I think just at a high level, as Jeff mentioned, we have seen a lot of interest from both patients and the sleep medicine community with regards to pitolisant for IH. And obviously we're excited about Phase III INTUNE trial, looking at pitolisant for adult patients with IH and we will continue to provide updates on that as we advance the trial. Your line is now open. Is it difficult to differentiate even if it's by exclusion, just how that works since now there are products that are approved for both narcolepsy and IH. So I think this IH is a very active area in this Sleep Medicine community, a lot of, obviously, discussion about it and new learnings with new treatment options that are out there. So I think that it evolves along sort of the spectrum in terms of Type 1 narcolepsy, Type 2 narcolepsy and then IH. But as John alluded to, ultimately it is a diagnosis of exclusion rolling out patients with narcolepsy and other disorders that result in excessive daytime sleepiness, mainly related to sleep disorder breathing and other conditions. We are taking a similar approach, so it is a similar approach as a proof of concept and we're looking at -- we like to, because  has never been studied in patients with DM1. So we feel it's prudent to generate data sooner rather than later, signal detection and get to sort of a decision point with regards to a further development program. So short answer, it is a very similar approach, Phase 2 proof of concept and we are building some momentum, we've opened sites in Canada, Frank, we're in Quebec region where there's a large founders population of patients with DM1. And as weâ\u0080\u0099ve said, we are looking to top line data readout in 2023 next year and we'll provide more color on that timing later this year."
}