{
    "symbol": "HRMY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 14:32:03",
    "content": " We delivered another strong quarter in Q4 finishing the year with continued momentum in our commercial business for WAKIX, as well as in the advancement of our clinical development programs for pitolisant. For 2023, we expect continued growth for WAKIX and believe that the vast market opportunity which remains in narcolepsy, along with a differentiated product profile of WAKIX provides us with the ability to grow wake up for years to come. We are in a solid position to execute on pillar three as our business fundamentals with WAKIX remain strong and we ended the year with approximately $346 million in cash, cash equivalents and investment securities. For the full year of 2023, we expect another strong year of revenue growth for WAKIX and remain confident in WAKIX being a potential 1 billion plus franchise in the years to come along with narcolepsy and other indications. With a strong commercial performance and anticipated future growth of WAKIX in narcolepsy serving as our foundation, we look to our lifecycle management programs to drive additional growth for Harmony in the coming years. And as you heard in our remarks for this year, we expect continued growth for WAKIX and I believe that the large market opportunity remains in narcolepsy and along with the differentiated product profile WAKIX, it provides us the ability to grow the brand for years to come. As Sandip and Jeff has shared looking into Q1 we do expect year-over-year growth in the quarter and continued growth in the average number of patients for WAKIX and as we interact fourth year of commercialization, as Sandip has shared, we kind of have an anticipated rhythm to our business. And as I've shared, Harmony remains a growth story and our focus on the advancement of our lifecycle management programs for pitolisant, acquisition of new assets and business development to build out our pipeline, in addition to our strong underlying business fundamentals of WAKIX in narcolepsy. And I do believe that from what I understand that the synergistic benefits of looking through and within hypocretin and histamine, I think WAKIX is well-positioned as future potential products come into the marketplace, the big opportunity, lots of brands, and I think what you see every year, David is all boats rise, all brands are growing and we're really excited about the difference that we're making in the lives of people living with narcolepsy. But even with that Q1 seasonality, Chris, we've talked about, we do expect revenue growth on a year-over-year basis for Q1 and continued growth in the average number of patients on WAKIX in Q1. So our thinking around that our strategy is obviously to  as a novel molecule with a novel mechanism of action and WAKIX performing well in the marketplace, we're looking at opportunities and currently working with Bioprojet in new enhanced formulations which will give us an opportunity potentially for new IP around some of the innovation in the formulation aspect of that an opportunity to explore the dosage range more and obviously extend the runway for further development. We could take the current development programs that we're working on now and then eventually move them to new formulations with a longer runway and longer opportunity in the market as well as pitolisant continues to be an interesting molecule and the potential is through developing programs in additional and new patient populations based on its mechanism of action, working through histamine, not just around EDS, but other symptoms we're exploring in our current programs fatigue as an outcome, as well as the potential impact on cognition. So we feel there's a strong understanding by an investor base of our business relatively consistent in a way of one product and certainly continue to be confident in the outlook, as there's additional growth opportunities as both Jeffs discussed, and clearly the potential to be a billion plus franchise in the coming years in narcolepsy, and I think he will continue to evolve that over time. The second part of your question with respect to discontinuation rates, it's been relatively consistent since our launch and when we shared publicly available data that about 30% to 50% of all patients on all treatment options by the end of 12 months tend to discontinue and either medicines in this category WAKIX has traditionally and we've seen over the past three years being in that range, obviously is a chronic condition when patients are out 12 plus months, you might see a small percentage of those patients fall off in any chronic condition."
}