{
    "symbol": "FERG",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-27 12:56:02",
    "content": "  Operator: Hello, and welcome to Ferguson's Fourth Quarter and Year-End Results Conference Call. Good morning, everyone, and welcome to Ferguson's fourth quarter and year-end earnings conference call and webcast. Thank you, Brian, and welcome, everyone to Ferguson's fourth quarter and year-end results conference call. On today's call, I'll cover highlights of both our full-year and our Q4 performance. As a result, we delivered adjusted operating profit growth of 41% for the full-year and adjusted diluted earnings per share growth of 45%. We made appropriate investments in working capital during the year, which supported our above market revenue and profit growth, resulting in a record 40% return on capital employed. Our business continues to drive solid cash flow, which enables us to continue to invest for growth. Growing the ordinary dividend sustainably through the cycle is an important part of our capital priorities, and the Board has recommended to increase the total final ordinary dividend by 15%. Our balance sheet remains strong and at the bottom end of our leverage range with 1x net debt to adjusted EBITDA, putting us in great position commencing the year ahead. Businesses like plumber supply broadened the reach of our existing footprint in St. Louis, expanding our relationships to new customers. Acquisitions like D2, Triton and STE bolster our geosynthetic and erosion control capabilities within our market leading Waterworks customer group. We leveraged our consultative approach, our scale, global supply chain, and strong balance sheet to support our customer's projects. This operating profit performance, coupled with the execution of our share buyback program drove adjusted diluted earnings per share growth of over 20%. Demand remains strong across our markets through the year, and we continue to take share across both residential and non-residential end-markets. Residential, which comprises just over half of our U.S. revenue, saw good growth in both new construction and RMI. As we've discussed previously, we focus on maintaining our balanced end-market mix, and while growth rates will fluctuate through time, we seek to maintain this healthy balance. We were pleased to deliver gross margins of 30.5%, which were down 90 basis points year-over-year as expected, driven primarily by strong prior year comparables during a period of rapid commodity price inflation. We tightly controlled costs, generating strong operating cost leverage and delivered adjusted operating margins of 10.7%, while continuing to invest in our talented associates, supply chain capabilities and technology program. Adjusted diluted earnings per share grew by 20.3%, driven principally by the growth and adjusted operating profit, and the impact of our share buyback programs partially offset by higher interest in tax in the quarter. We delivered adjusted operating profit of $829 million, an increase of $141 million or 20.5% over the prior year with operating cost leverage driving an 11% adjusted operating margin. We have provided a breakout of revenue growth across our largest customer groups in the U.S. As Kevin outlined, we saw strength across both the residential and non-residential end-markets with all customer groups performing well in the quarter. HVAC where the majority of our business serves the residential end-market grew by 18% with a two-year stack of 43%, while residential digital commerce grew modestly against a strong comparable. This quarter's growth was predominantly driven by inflation, supported by strong public works demand, continued residential growth and growth in non-residential end markets. Commercial, mechanical and other non-residential customer groups saw good growth in the quarter with supportive markets. This was partly offset by the adverse impact of foreign exchange rates, resulting in total revenue growth of 10.5%. Adjusted operating profit growth of 25% significantly outpaced revenue growth as we tightly controlled operating costs, generated strong operating leverage and achieved an adjusted operating margin of over 8%. As we look at the full-year performance, revenues are up 25.3%, 23.5% on an organic basis with gross margins broadly in line with last year. Adjusted operating profit growth significantly outpaced sales, up 41.1% with operating margins expanding 110 basis points to a record performance of 10.3%. Adjusted diluted earnings per share grew by 44.6%, supported by strong profit growth and share repurchases, and our balance sheet remains strong as we moved into the bottom end of our target leverage range. As we've discussed over the last several quarters, we continued to invest in working capital in both inventory to ensure we have the best levels of availability for our customers during this time of supply chain challenges as well as receivables driven by sales growth. Tax increased over the prior year due to higher profit and timing of payments and we continue to invest in organic growth through CapEx, principally invested in our supply chain and technology programs. First, we are investing in the business to drive above-market organic growth principally through working capital and CapEx. Finally, we remain committed to returning surplus capital to shareholders, principally through share buybacks, and we intend to operate towards the low-end of our target leverage range. Our organic investments, as I previously mentioned on the cash flow side, were principally driven through working capital to support our customers and growth during times of supply chain disruption. Receivables have supported customer growth, increasing slightly faster than overall sales, principally due to changes in business mix, and we continue to see low collectability risk. CapEx investments are broadly split between our market distribution center rollout, technology investments in both front-end customer facing capabilities, as well as the modernization of our backend systems and investments in our branch network. During the year, we distributed over $500 million of dividends and have proposed a 15% increase to the final dividend. From an acquisition standpoint, we invested $650 million during the year, bringing in approximately $750 million of incremental annualized revenues. While the pace of deal activity in the market has started to slow, we maintain a good pipeline of potential deals and we remain focused on executing our consolidation strategy. Finally, during the year, we returned $1.5 billion to shareholders through share repurchases, reducing our share count by over 11 million or about 5%. This left approximately $500 million outstanding at the end of the year, which we have topped up by an additional $500 million today, leaving us approximately $1 billion remaining on the share repurchase program as we begin fiscal 2023. We expect to deliver low single-digit revenue growth for the year, driven by continued organic market share gains and the benefit of fiscal year 2022 completed acquisitions. We expect growth rates to continue to be strong at the start of the year and compress as we move through the year, driven by increasingly difficult comparables, a reduction in inflation and a deterioration in market volumes. After stepping up adjusted operating margins by 230 basis points over the last two years, we would envision some normalization and provided a range of between 9.3% to 9.9%. Our adjusted effective tax rate should stay broadly consistent at approximately 25%, and CapEx is expected to come in between $350 million to $400 million. While there are macroeconomic headwinds on the horizon, markets we compete in have historically grown above GDP and there are structural characteristics that give us confidence that the markets will continue to be supportive over the long-term. On average, we delivered 370 basis points of U.S. organic market outperformance over the past five years, this year being no exception. As I talked about earlier, we compliment this organic growth model by consolidating our fragmented markets with consistent bolt-on acquisitions. In the past five years, we've completed over 50 acquisitions, driving 2.2% incremental annual revenue growth from those acquisitions. We stayed focused on the unique needs of our nine customer groups that work together to help make our customers complex projects simple, successful and sustainable. They, again, outperformed our end markets by helping to make customers projects more simple, successful and sustainable during a period of supply chain disruption and cost inflation. The result was an outstanding fourth quarter performance that capped a year of solid progress, building on our market leading positions and our key strengths while investing in the future of the business. We are well positioned heading into the new fiscal year with a balanced business mix between residential and non-residential, new construction and RMI. We have a flexible business model and cost base that allows us to adapt to changing market conditions, and we are maintaining a strong balance sheet operating at the low-end of our leverage range. As we're sitting here today, we still have some pretty good and supportive market growth and revenue growth embedded in what we're doing as well as with some of our Waterworks bidding activity that we're seeing. So we exited the fourth quarter, I call it roughly 20% growth and then moved into the first quarter and through first quarter trading sitting somewhere around mid-teens. So clearly off from that 20% growth rate, but still relatively supportive. As we go through this fiscal year into Q2 and then particularly as we clip into calendar year 2023, we run into both tougher comps as well as inflation moderating just based on those comps, and then as we think about residential markets in particular, expecting a degree of market deterioration. Now if we look at residential, we've still got decent start activity even though permit activity is down 14%. And when you look at the more custom builder and remodeler, their activity and the way that they're booked out would suggest decent demand through, call it, 12 to 18 months. And then perhaps more importantly, as we start to drift towards that non-residential side of the business, we've historically talked about things like data centers and big box warehouse build out. And even as big box warehouse and distribution center build out starts to wane, we've seen good activity around mega projects like onsourcing, electric vehicle, battery and storage, pharma and semiconductors. But as we said, as we go through the fiscal year, comps, inflation moderation, and as we think about what that looks like with residential market pressure, we think that deteriorates through the rest of the fiscal year. If you look at the growth comparables, they do step up throughout the year both on a individual quarter, but also more importantly maybe a two-year stack basis. So our Q1 organic growth comparable is 24.5, that steps up to 28.5 in Q2, but if you look at growth on a two-year stack, organic growth comparables are in the high-20s in Q1, they step into the low-30s in Q2 and then Q3, Q4, we step into the low-40s. So while we expect inflation to reduce, we're not expecting deflation, we are expecting the inflation comparables to rollover as we move throughout the year and that to compress those growth rates. We exited Q4 with about flat volume, so we would anticipate volumes will turn negative as we move throughout the year, resulting in that overall estimate or assumption at this point, recognizing it's early in the year of a market decline in the likely in the low-single digits for the full-year. In terms of our framework, we're still very much committed to over-market performance in that 3% to 4% range. When we think about inventory, we did step up that inventory obviously to take care of great customer fill rate and it served us well with returns on capital at over 40%. Again, normalizations happened across many of our customer groups, but we still see elevated inventory levels in areas like appliances, particularly in the luxury appliance portion; in our Waterworks business group, particularly in areas like ductile iron pipe, PVC pipe, valve and hydrant, and even brass goods as supply chains continue to be pressured on that side of the business. And then in the HVAC customer group, as we think about particularly the Department of Energy Transitions that we're going to be going through over the winter and the need to make sure that we have product available for what is one of our fastest growing customer groups. And just to quantify it a bit, Mike, if you look at just days and inventory as we exited the year, roughly five days more than we had at the end of fiscal 2021. To Kevin's point, particularly in those product categories where we're seeing still supply chain disruption that's driving the majority of that increase. I can't tell you exactly how long we'll run with slightly elevated inventory levels, but we'll appropriately manage it according to what we're seeing in the marketplace from a supply chain disruption perspective. Within the operating margin guidance, could you give us a sense; I think you've called out in the past that you do expect a little normalization that you hope to hold gross margin levels at a relatively high level above 30%. So if you look at the 10.3% that we delivered this year, that at a 30.7% gross margin, and if you recall and we talked about this a lot over the last couple of years, that first half gross margin was extremely strong, driven by rapid commodity price inflation. So that first half gross margin of 30.9%, clearly above the full-year gross margin, clearly above where we're running in the second half at about 30.4%. From a bottom end of the operating margin range, we've talked a lot about the view that we have unlocked a new level of operating margin productivity coming out of our fiscal 2021 results where we produced a 9.2% operating margin, and that continues to frame the bottom end of our operating margin range. Your line is open. Obviously a lot of focus on inflation and we've seen more commodity type products having some ease in overall cost, but still against that backdrop from our perspective, we just see structurally higher inflation on a go forward basis over the next several years with other components that we don't necessarily see coming down. Yes, as you think about how we view the inflationary environment, as Bill indicated, and as we've talked about on this call, we see the inflation comp starting to moderate as we go through the fiscal year. We started to see commodity inflation, which historically has been about 10% of our business back in the fall of 2020, and that flow into finished goods and continues on as we go through the first quarter of this year. We think that there are some structural characteristics that will support that price inflation, particularly on the finished goods side as you think about the labor component inside of that as well as the overall components for our finished goods inventory. As we think about our commodities, we haven't seen any marked movement in a downward direction on the commodity side, particularly in the areas of PVC pipe, cast iron, ductile iron, which are large components of our overall product categories. We have seen some movement in steel and copper, which Bill reflected as we talk about what that gross margin range looks like as we come through fiscal 2023. The way we manage it is simply put working with our customers and our customers customer to make sure that we pass on appropriate price inflation into the projects that we're working with great communication, and then also making sure that we're value engineering projects and we've been fortunate to be able to pass through that price inflation and offset our cost inflation to expand operating margins to a new level. I can't comment on what we think inflation is going to be on the cost of goods sold side as we go forward, but we do believe that there is some structural support underneath the current pricing levels. Generally speaking though, if you look in the more longer term or mid-term, we still see support in that residential market, particularly as you look at maybe even the build to rent or the multi-family portion of that residential business. So the good part about our business is that balanced business mix and the ability for our customers to shift what their focus is potentially from a res to a non-res side, particularly say in that Waterworks business. We do see green shoots in the non-residential side, and again, historically over the last several quarters, we've talked about the build out of distribution centers to support e-commerce. And that balance of our business mix is very helpful, whether that's healthcare and education, whether it's onshoring a manufacturing activity, large projects in the chip arena, downstream chemical, pharma. And candidly, we're seeing great work for our industrial business on refinery turnarounds, roughly 88 refineries that are going to be doing turnarounds that have been largely offset during the pandemic. Again, no crystal ball in terms of what that's going to bring in calendar year 2023, but good support mechanisms. Your line is open. Bill, when youâ\u0080\u0099re discussing the year overall, I think you mentioned that volumes were expected to be down, you said about 2% from known acquisitions today. But to get to that low single-digit growth overall for the year, that would imply that price is up. I was talking about the 2% is the benefit of fiscal 2022 acquisitions, so that's the tail of acquisitions from 2022, the benefit on growth heading into 2023. And then second, as you think about the complexion of the fiscal year playing out, it sounds like you expect some deterioration against difficult comps as you noted. And as you can think about the complexity or the complexion of the year, rather, again, with those growth rates stepping up, we would assume that our growth rates will continue to move down as we move throughout the year. In terms of the second half of the year, will it be a â\u0080\u0093 will it be more of a muted down, very difficult for us to call. But most importantly, as you think about how we're going to manage the business for whatever environment we find ourselves in, we've got a flexible cost base. Bidding activity today remains fairly solid in our Water business, both private and public, candidly both residential and non-residential. To Bill's point, the balanced business mix that we have res, non-res, new construction, RMI and a flexible business model underpinned by a strong balance sheet, we feel like we're in pretty good shape to take care of whatever comes at us. Your line is open. In the press release, you talked about your non-residential business growing faster than the residential. Is the inflation faster on non-residential particularly given the influence of Waterworks, if you could give us any detail on how that breaks, that would be great. If you look at the growth for fiscal 2022, to your point, our residential business grew about 20%, while our non-res grew about 30%, there is slightly higher inflation in that non-res business, particularly in the Waterworks and commercial plumbing business where there tends to be a bit more commodity product, but still good volume growth in both resi and non-resi throughout the year. We'll handle price increases on the finished goods side as we always do, which is passing that along any price increase from the vendor community, passing that along to our customers. But in terms of our expectations in that guidance, we're expecting relatively stable pricing as we move throughout the fiscal year. It's awfully difficult to call sitting here seven, eight weeks into the fiscal year, but that assumption is that pricing is relatively stable throughout the year. We rollover those tougher comps, which compresses the gross rate on inflation as we move through the year. In terms of bolt-on acquisitions, first off, we were quite pleased with the performance as Kevin outlined, completing 17 deals, investing $650 million this year and bringing in about $750 million of incremental annualized revenue, really split between both bolt-on geographic and capability acquisitions. We still see a good healthy pipeline as we look into fiscal 2023, 17 deals and bringing in $750 million was a bit of an uptick from where we've been the last few years. So hard to call the quantum as we head into the fiscal year, but we do have a good pipeline and we'll continue to consolidate the markets. In terms of CapEx, you're right, our guidance of $350 million to $400 million is a bit stepped up from the last couple of years. One of the things that we're really excited about, and I referenced it earlier with Aaron & Company in New Jersey, and the fact that that business brings further capability for residential trade plumbing and HVAC because as we look forward, there's a huge opportunity for us as an organization with what we call the dual trade contractor, that trade professional that does both plumbing and HVAC. We think it's roughly a $32 billion market for us, and making sure that we build out through M&A as well as organically that HVAC and residential trade plumbing capability will serve us well as we go forward. We couldn't be more proud or more pleased with the continued growth and improvement that is delivered by our associates, taking care of our customers and growing our share position inside of an expanding $340 billion North American market. Our mix, our model, and the strength of our balance sheet is going to position us well for the coming year, whatever is thrown at us."
}