{
    "symbol": "FERG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-15 10:54:07",
    "content": " Headcount and variable costs grew to appropriately support volume growth, and we delivered adjusted operating profit of $576 million, an increase of $226 million or 64.6% over the prior year, with adjusted operating margins expanding 180 basis points to 9.3%. As we look at the half year performance, revenues are up 29.1%, 26.4% on an organic basis, with a 90 basis point improvement in gross margins and adjusted operating profit growth significantly outpacing sales, up 62.5% with operating margins expanding 210 basis points to 10.2%. If we look back at the quarter, and really at the first half of the fiscal year, we think that our people, our consultative approach to the market, the value added services, our supply chain capabilities and ability to deliver on time and in full for our customers did lead to some outsize market share gains. If you look at a market in the first half, that group, call it, in the low, maybe to mid 20s and our 27.2 organic growth in the half, we think that that gets to the - above the top end of our 300 or 400 basis points worth of outperformance that we highlighted as a mid-term target during our Capital Markets Day. If you look back to last year, in terms of the comps, we had about a 3% organic growth comp in the first half, that stepped up to 22% in the second half. If you just assume that that low 30s rate continues into the second half on prior year 22% comps that would put you somewhere in the low double-digit organic growth range in the second half, which we think would be fairly realistic, again as we step in with some good sales momentum behind us. In terms of working capital, you're correct for the last, call it four - four to five quarters, we have been investing in working capital, principally on the inventory side of the business, principally to take care of and protect our customers from a supply chain disruption perspective."
}