{
    "symbol": "SUPN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 17:42:04",
    "content": " For the first nine months of 2022, GOCOVRI net product sales were 75.2 million, an increase of 22%, compared to net product sales reported by Adamas in the first nine months of 2021. Oxtellar XR continues to perform well with net product sales of $88 million for the first nine months of this year, representing a 7% increase, compared to the same period last year. Total revenue for the third quarter 2022 was $177.4 million, a 19% increase, compared to $148.5 million in the same quarter last year. For the third quarter of 2022, combined R&D and SG&A expenses were $131.9 million, as compared to $91.7 million for the same period in 2021. GAAP net earnings were 1.7 million for the third quarter of 2022 or $0.03 per diluted share, compared to 21.6 million or $0.40 per diluted share in the same period last year. On a non-GAAP basis, which excludes amortization intangibles, share based compensation, contingent consideration, and depreciation, adjusted operating earnings were 25.4 million, compared to 43.3 million in the third quarter of 2021. Total revenue for the nine months ended September 30, 2022 was 500 million, a 19% increase, compared to 420.7 million in the same period last year. For the nine months ended September 30, 2022, combined R&D and SG&A expenses were 360 million as compared to 272.4 million for the same period in 2021. Amortization of intangible assets for the first nine months ended September 30, 2022 was 61.9 million, compared to 18 million for the same period in 2021. Operating earnings on a GAAP basis for the first nine months ended September 30, 2022 was 11.8 million as compared to 79.9 million for the same period in 2021. Income tax for the first nine months ended September 30, 2022 was a tax benefit of 9.6 million, as compared to an income tax expense of 20.1 million for the same period in 2021. GAAP net earnings were 35.2 million for the first nine months ended September 30, 2022 or $0.62 per diluted share, compared to 51 million or $0.94 per diluted share in the same period last year. On a non-GAAP basis, which again excludes amortization of intangibles, share based compensation, contingent consideration, and appreciation., adjusted operating earnings for the first nine months of 2022 or 91.9 million, compared to 106 million in the same period in 2021."
}