{
    "symbol": "SUPN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:33:06",
    "content": " In total, Supernus achieved in 2022 record revenues of $667 million, up 15% compared to 2021 despite a significant 14% decline or $43.6 million decline in net sales of Trokendi XR. In 2022, GOCOVRI delivered strong growth of 19% and 13% in net sales and prescriptions, respectively, compared to 2021 and exited the year with a solid fourth quarter performance with a record high quarterly net sales of $29.2 million. Oxtellar XR continues to be steady with net product sales of $115 million for full year 2022, representing a 4% increase compared to 2021. For full year 2022, net product sales for Trokendi XR were $261 million, down from $305 million in 2021. Total revenue for the fourth quarter 2022 was $167.3 million, a 5% increase compared to $159.1 million in the same quarter last year. For the fourth quarter of 2022, combined R&D and SG&A expenses were $91.7 million as compared to $122.8 million for the same period last year. Tax expense for the fourth quarter 2022 was $9.4 million as compared to an income tax benefit of $391,000 for the same period last year. On a non-GAAP basis, which excludes amortization of intangibles, share-based compensation, contingent consideration, acquisition-related costs and depreciation, adjusted operating earnings were $57.6 million compared to $46.2 million in the same period last year. Total revenue for the full year 2022 was $667.2 million, a 15% increase compared to $579.8 million for the full year 2021. For the full year 2022, combined R&D and SGA expenses were $451.8 million as compared to $395.2 million for the full year 2021. On a non-GAAP basis, which excludes amortization of intangibles, share-based compensation, contingent consideration, acquisition-related costs, other R&D and depreciation, adjusted operating earnings for the full year 2022 was $148.8 million as compared to $167.3 million for the full year 2021. Please note, total revenue guidance for 2023 assumes approximately $60 million to $80 million of net product sales of Trokendi XR, as Jack mentioned earlier."
}