{
    "symbol": "GEOS",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-09 12:54:06",
    "content": " Hosting the call today from Geospace is Mr. Rick Wheeler, President and Chief Executive Officer. Good morning, and welcome to Geospace Technologies conference call for the first quarter of fiscal year 2023. Iâ\u0080\u0099m Rick Wheeler, the Companyâ\u0080\u0099s President and Chief Executive Officer, and Iâ\u0080\u0099m joined by Robert Curda, the Chief Financial Officer of the Company. In these prepared remarks, I will first provide an overview of the first quarter and Robert will then provide an in-depth commentary on our financial performance. Some of todayâ\u0080\u0099s comments about markets, revenue recognition, planned operations and capital expenditures may be considered forward-looking as defined in the Private Securities Litigation Reform Act of 1995. Yesterday, after the market closed, we released our financial results for the first quarter of fiscal year 2023. We were pleased to see that, revenue for the quarter reached $31.1 million, reflecting an increase of 73% over last yearâ\u0080\u0099s same period. Moreover, the amount represents the companyâ\u0080\u0099s highest quarterly revenue in the last 8.5-years, going back to June of 2014. Factoring in all other expenses, the first quarter posted a narrow net loss of $0.01 per share. However, it must be noted that, the slight loss comes after including $1.4 million in one-time charges. These charges were a combination of restructuring costs, write-offs of Russian inventory and non-recurring repair costs. Those actions stem from our commitment to achieve future profitability through streamlining our operations, reducing operating costs and increasing revenue in each of our business segments. However, a significant amount of OBX related revenue was the result of compensation for OBX equipment that was lost by a rental customer during a survey. We intend to build out additional OBX nodes to replenish this lost equipment in the rental fleet, as demand for both the deepwater and shallow water OBX models continues to strengthen. Combining this demand with an increasing number of shallow water surveys being put out for bid, interest in using our New Mariner nodal technology is also growing significantly. Our strategic diversification efforts continue to bear fruit, as evidenced by the performance of our adjacent market segment. First quarter revenue from these products within 1% of its all time records set in last yearâ\u0080\u0099s third quarter, adding traction to our move toward profitability. As a premier manufacturer and supplier of ruggedized water meter connector cabling, our market position in these products continues to climb. To maintain this position, we work closely with trusted water meter companies to meet the design and specifications of their domestic municipality customers. The breadth of discussions taking place with these partners for specialty cables as well as the Aquana smart valve products gives us confidence, that future growth in this market will continue. With that, I will now turn the call over to Robert to give more financial detail on first quarter performance. Before I begin, I would like to remind everyone that, we will not provide any specific revenue or earnings guidance during our call this morning. In yesterdayâ\u0080\u0099s press release for our first quarter ended December 31, 2022, we reported revenue of 31.1 million compared to last yearâ\u0080\u0099s revenue of 18 million. Net loss for the quarter was a 100,000 or $0.01 per diluted share compared to the first quarter of last yearâ\u0080\u0099s net loss of 6.8 million or $0.52 per diluted share. Our oil and gas product revenue is as follows, traditional product revenue for the three month period ending December 31, 2022 was 2.8 million compared to revenue of 600,000 for the last year. Our wireless product revenue for the quarter was 17.2 million, an increase of 98% compared to revenue of 8.7 million last year. Moving to our adjacent markets product segment, our industrial product revenue for the first quarter was 7.9 million, an increase of 58% compared to last yearâ\u0080\u0099s revenue of five million. Imaging product revenue for three-months ending December 31, 2022 was 2.9 million, a decrease of 8% when compared to 3.2 million from the same period last year. Revenue from our emerging market segments for the first quarter of fiscal year of 2023 is 93,000 compared to 137,000 for the first quarter of fiscal year 2022. The increase in gross profit was due to higher utilization of our OBX rental fleet, higher marine wireless exploration product sales, and increase demand for our water meter cables and connector products. Q1 2023 cash investments into our property plant and equipment were 265,000 and cash investments into our rental fleet is 162,000. Our balance sheet at the end of the first quarter of fiscal year 2023 reflected 12.3 million of short term investments, and we made cash - and short-terms investments and we maintained additional borrowing ability of 8.5 million under our bank credit agreement. Thus, the Companyâ\u0080\u0099s total liquidity was 20.8 million. This concludes my discussion, and I will turn the call back to Rick. After the first quarter closed, our Quantum Technology Sciences Subsidiary secured a new contract with an undisclosed federal government contractor. While the initial dollar amount of the contract is modest, it holds strategic significance in future potential for serving an application unrelated to our previous border security work. In conjunction with multiple active discussions surrounding other unique applications of Quantumâ\u0080\u0099s Analytics Technology, we believe the outlook for projects in our emerging market segment is expanding. As part of our plans for streamlining operations and reducing costs, we anticipate completing the sale of our satellite use facility within the second fiscal quarter. This facility currently houses our OBX rental operations, which we are in the process of consolidating into our main campus location. In accommodating this consolidation, we sold some obsolete equipment after the first quarter closed. With that, this concludes our prepared commentary and I will now turn the call back over to Brittany, our moderator, for questions from our listeners. Now we will take our first question from  (Ph), who is a Private Investor. Your line is now open. Well, we are certainly going to be examining our assets with our property, plant and equipment as far as that goes. I donâ\u0080\u0099t think there is any anticipation of our properties at this point in putting those up for sale, but we are open to doing that. Well, I mean, the market is certainly picking up. But that being the case, we see with what is happening in Ukraine as well as the fact that, China is coming out of its isolation more so from the pandemic, the demand for oil and gas and energy in general is improving. It is true that, we donâ\u0080\u0099t see as much improvement in the land side of things, although there are signs of that also improving. And certainly that is why you see that our OBX, our rental fleet and ocean bottom nodes are driving our revenue at this point in time. Again, we donâ\u0080\u0099t give any guidance to how those things are manifesting in the future as it were, but we do conservatively manage our cash as is exemplified for the - many years gone by. Your line is open. Rick, I would like to start with the comment you just made about the land market and that there are some small signs that it is improving. Well, many of these improvements are coming about in foreign locations. Certainly in the Canada and North America, things are still depressed, but even there we are seeing improvements. To the extent that seismic exploration has just been at such low levels, there is a little bit of pent-up demand that I think that we believe is what might be driving some of that. But overall, it is still too early to tell, what sort of recovery we might see in the land side of the business. So then relative to the new Mariner product, youâ\u0080\u0099d mentioned that, there was increasing interest. It is actually both, but certainly, the Mariner represents a very cost effective solution compared to what has historically been available for ocean bottom nodes. I think we have been successful with that, and it has features that you are not going to find in the general equipment that is out there. That being said, I think that is driving an interest, both on the sales side and on the rental side, but Iâ\u0080\u0099m sure that the rental of those units will certainly be a driving force, and will have to see to what extent the sales also manifest. I think the Mariner has a good future for it, as it were. The OBX technology is serving that industry very well, and the Mariner is going to serve it equally well, if not better. No, I think, you are not going to see one overtake the other particularly from a use case point of view. The data from each of them is completely cross compatible, as well as the systems that operate that equipment can operate both simultaneously and any cross combination of the two. Now, the deepwater OBX is one that has seen some of the very same improvements embedded in its design so to speak. So, it serves a different market, but you are not going to see the Mariner represent a different use case than what the current shallow water version of the OBX uses. So, and they are both going to be able to be mixed together. It is somewhat a combination of both, but it definitely intersects with a completely different market and group of customers than the water meter cables just themselves do. Okay and so in that case, you would be interacting with a real estate owner or property managers that would be making the decision to implement these either with new construction or with existing or with existing apartments,\n That is exactly right and/or the service providers that perform those sorts of services for those property owners. As far as the details of that contract, it is with a very well known federal contractor for very specific and targeted purposes that really arenâ\u0080\u0099t available to be discussed at this point. And I did take note that, that orders was plural as it was written in the release here in the remainder of this fiscal year, so the next nine-months. Well, one of the things that we are doing and quite in the middle of is, expanding the utilization of the Quantum analytics into other spaces. So, much of what we are examining is going to fall into that category, as well there are some additional government agencies that we are in discussions with for things and we do have those expected contracts to be issued sometime this year. Your line is now open. I have been a shareholders a long time, and I think you guys just keep fighting, which is tremendous. And it sounds like things are just starting to turn, which is great. When I look at it, Iâ\u0080\u0099m sort of feeling this year and a half two years to make this work or there is something existential on the horizon. We donâ\u0080\u0099t - looking at our forecast, we think we are in pretty good shape in this next 12-months in a cash positive position. Your line is now open. I mean, Iâ\u0080\u0099m sure it will become very, very evident, as we close that this quarter. Well, the Mariner is not going to begin contributing until later on this fiscal year, I can tell you that. And certainly, the construction of the Mariner is going to be a big part of what that is. I think the revenue from the Mariner is going to be something that, you see more or so in the tail end of the fiscal year and then going forward. And Rick, no discussion regarding PRM, can you give us some idea, if those multiple customers are still interested. And yes, there is not really much discussion because there is not much really new. We have had active discussions with those representatives here at our facilities, as well as being at their facilities. And I think that, to your point, the examination of getting the most out of these deepwater assets is largely what keeps those discussions floating, and in the top of mind. Again, I donâ\u0080\u0099t think we have actually revealed what we think some of those numbers are, but we wouldnâ\u0080\u0099t be bothering with it if we didnâ\u0080\u0099t think it was significant. Certainly, some of it has made its way to the hands of customers, and in fact, that is what we were referring to in this release. While I do see some similarities to what has happened in the past in that regard, there are a lot of things that are very unique to this situation. So, I donâ\u0080\u0099t know that I would have that one-to-one correspondence, but I do understand the analogy you are drawing. Your line is open. Well, I think at the time, earlier on, they were anticipating that they would be putting out a tender sooner than that actually was going to occur. That is why we would say that even amidst these discussions, we donâ\u0080\u0099t expect anything to land in such a way that it would offer the opportunity to generate any revenue in this fiscal year. I mean, these are long standing needs and the fields are have long lifetimes to them and they want to get into that early. And Rick, you said that you donâ\u0080\u0099t anticipate any anything that would lead to revenue this year. I think that is possible, but again, Iâ\u0080\u0099m not putting high probabilities on that occurring given the slip that has already occurred in several occasions on some of these anticipated tenders. And quite honestly, the only ones that need to know that exact number are those that are party to the transaction largely because competitors both in our area and in our customerâ\u0080\u0099s area could try to leverage that information to their benefit in some way. But I will say that, it was significant and that was and we didnâ\u0080\u0099t make note of that to be as transparent as we could in our revenues. But I will also say that, that same the fact that we had quarterly revenues that were the highest, they have been in 8.5 years, within that same span. Even without that sale taken out, there would have been very few maybe three quarters that would have in that time span that would have been better. Your line is now open. And within the commentary, you talked about a path to profitability and that is encouraging to a lot of investors I think and realizing you donâ\u0080\u0099t discuss, could you talk at a high-level on the components you envision to get you to profitability and realizing it is probably is dependent on higher revenue, but as you think about your business plan and your business model, you can highlight the components you need to improve either on a revenue or cost side to get you to where you want to be. I think all fronts are going to have to be pursued, Mike. So those pieces of the puzzle are ones that we are still putting together and we are going to be acting on those, as we discover them. On the revenue side, there is a clear aspect that, revenues need to increase in all of these segments. So there are expansion efforts going on in some areas within the organization, to increase our capacities for very well known products that we see good forecasting on. But as you say, none of which in any specific manner can we really annotate at this point. Well, we are certainly targeting this year, as making significant improvement on that. As far as what you have seen in this quarter, you are going to see more of that as we go forward in terms of our examination of things, restructuring of things, as it were. So it is not something that happens overnight and it is something that requires some really pensive examination, as we go forward on this stuff. So I wish I could give you a timeline, but that would kind of be not really something I could give you something accurate on it. Your line is now open. I think really the bottom-line here is from a qualitative and a quantitative perspective is that, under the current leadership of the company, something like 97% of shareholder value has been destroyed. And the only way you guys have come close to breakeven this last quarter apparently is because of an equipment loss, the Boardâ\u0080\u0099s bloated, management salaries and benefits are always hidden in SG&A, which is always going up. But in the meantime, while the Board and the management team is pretty well compensated, investors are getting host. I mean, the price of oil goes up, you guys lose money. Price oil goes down, you guys lose money. And I think until the investors and the Board are honest about it, you are going to keep losing money. I have always said, you guys have great technology, you have got great R&D. You are sitting on a ton of assets, but the dayâ\u0080\u0099s going to come when you run out of real estate to sell, and you are going to run out of hard assets to sell to buttress your cash position. These are just not adequate answers for investors, and I think the company needs to take a hard look at who really owns that company and start thinking about why these failures are going on year after year after year. Well, I think in many respects, you are really all wrong about how the business operates. I mean, in most respects, we are managing ourselves well -. Well, businesses exist to earn a profit and to increase the value of their shareholders wealth and their investment in that business. Look at your shareholder equity, it goes down every single quarter. Well, I think, that is something that you are seeing, I mean, to the extent that we are restructuring what we are doing and aligning ourselves with those components that are more revenue producing you are going to see that occur. Well, I hope that is true, because honestly, I think this board should be cut in half. You seem like a nice guy, but I think these shareholders would rather have an effective CEO than a nice guy. Well, I mean, somebody just asked your CFO, he, he answered we are going to be cash flow - cash positive. You are selling real estate left and right, but you are going to run out of real estate. Look, this isnâ\u0080\u0099t an indictment of you personally - Rick, but something has got to change, and it is got to change quick. Alright, well, thanks Brittany, and thanks to all of you all who joined our call today, and we look forward to speaking with you again on our conference call for the second quarter of fiscal year 2023 in May."
}