{
    "symbol": "STKL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 21:26:18",
    "content": " Total revenue was up 16% to $240 million, including solid increases in both plant-based and fruit-based driven by a combination of pricing and broad based volume and mix gains across our portfolio. We continued to experience very strong demand for fruit snacks with revenue up 29% in the quarter, which was primarily driven by volume gains on the base business, along with the smoothie bowls, which we recently launched via a private label offering at one of the largest retailers in the world, via a co-manufacturing brand with a massive global food company, and also via our own brand. First quarter revenues of $240.2 million were up 15.7% year over year, with solid gains in both segments. Fruit based revenues increased 18.7% as we benefited from pricing actions implemented in the second half of 2021 along with strong demand for fruit snacks and smoothie bowls, and some one time orders from our largest frozen customer outside of normal distribution, which represented nearly half the revenue growth. The year-over-year decline was attributable to the previously mentioned $2 million of lower gross profit on a consolidated basis, a $1.1 million increase in SG$A, including a special one-time bonus, recognizing the significant improvement in production and $0.4 million of incremental amortization for Dream and WestSoy. On an adjusted basis, we had earnings of $0.6 million or $0.01 per diluted share in the first quarter of 2022 versus adjusted earnings of $1.3 million or $0.01 per diluted share in the prior year period. Cash use and investing activities from continuing operations was $24.5 million, compared with $7.9 million in last year's first quarter, primarily reflecting investments in capacity expansion projects. Mark, I would just, I would remind to you that, raw material inflation is margin -- gross profit margin rate destroying, because if you have $20 million of ingredient inflation, and you pass on $20 million, the cost increases, that reduces gross margin by enough in the case of our business, roughly 100 basis points."
}