{
    "symbol": "STKL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 21:59:07",
    "content": " Plant-based revenues surged 31% to $146 million in the second quarter, another record in our 15th consecutive quarter of revenue growth. In the second quarter, fruit-based revenues increased 7.4% to $98 million, all of which came from growth in our margin advantage Fruit Snacks business. Second quarter revenues of $243.5 million were up 20.4% year-over-year, with continued growth in both segments. Gross profit was $34.9 million for the second quarter of 2022, an increase of $8.6 million or 33% and compared to the second quarter of 2021 and consolidated gross margin was up 130 basis points to 14.3%. In Plant-based, segment level gross profit increased $4 million or 20.3% and to $23.9 million, driven by higher volumes and pricing for plant-based beverages and ingredients, coupled with strong production volumes. In fruit-based segment level gross profit rose $4.5 million or 70.2% to $11 million, driven by pricing actions and reduced manufacturing costs in frozen fruit. The year-over-year growth was attributable to the previously mentioned $8.6 million of higher gross profit on a consolidated basis, partially offset by a $1.6 million increase in SG&A due to higher incentive compensation costs, which were partially offset by reduced employee costs related to headcount reductions in frozen fruit operations and lower business development expenses. In the second quarter, adjusted EBITDA was $22.3 million or 38% higher than $16.1 million in the prior year. Cash used in investing activities of continuing operations was $34.1 million compared with $32.4 million in last year's second quarter, primarily reflecting investments in capacity expansion projects. We are raising our revenue guidance to a range of $930 million to $960 million, up from $890 million to $930 million previously, representing growth of 14% to 18% versus 2021. Our adjusted EBITDA guidance is increasing to a range of $72 million to $78 million up from $67 million to $75 million previously, representing growth of 18% to 28% versus 2021."
}