{
    "symbol": "ROIV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-08-15 11:22:11",
    "content": " So as a reminder, we're excited about where we are at the end of our first quarter this year, with obviously a number of important attributes, including the ongoing commercial launch of VTAMA, which we will spend a little bit of time on this morning, that is backed by a broad clinical stage pipeline, including multiple pivotal and registrational study is currently ongoing. The first is that our LTE data, our long-term extension study data has been published in JAAD and that highlights the 130 day remittive effect off-therapy for patients achieving a PGA of zero on VTAMA that's something that we've talked about a fair amount before and it's something we think is an important differentiating attribute of the drug. But I just want to reiterate some of the features of that program because it's a program that we're very excited about in our late portfolio and because as I mentioned before, we are expecting the final patients to enroll in our lupus study any day now and we think that'll be an important catalyst for us next year and so we wanted to continue to draw attention to that programs. We have two ongoing registrational programs, including a single registrational Phase 3 study in dermatomyositis that we've already initiated as well as a large global Phase 2b study of lupus that's expected to complete enrollment this month with data expected in the second half of next year and that's designed to serve as one of two registrational studies in that indication. Your line is now open. Your line is now open. Your line is now open. Please standby for our next question. Your line is now open. And then maybe most importantly, from a scientific perspective, we're looking at diseases where we think the biology of both TYK2 and JAK1 are relevant and potentially where we're going to see some synergistic effect between TYK2 and JAK1 that will make us better than even a combination of independent JAK1 or TYK2 agents might seem to be based on their data. Please standby for our next question. Your line is now open. Please standby for our next question. Your line is now open. Please standby for our next question. Your line is now open. Please standby for our next question. Your line is now open. I think refills are good indicators of happy patients and we're seeing already refills, some number of refills just a couple months in, which looks great to sign at least some patients are going to use multiple tubes, who's going to be happy on the drug."
}