{
    "symbol": "FENG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 00:42:07",
    "content": " On today's call, management will first provide a review of the quarterly results and then conduct a Q&A session. Before we move on to the prepared remarks, let me refer you to our Safe Harbor statement in our earnings press release, which applies to this call as we will make forward-looking statements. In the last quarter of 2022, restrictions imposed to control the spread of COVID-19 were finally lifted and lockdowns came to an end. Despite the exponential rise in the number of infected cases in December, our teams unwavering commitment to achieve our goals enabled us to close the quarter with the total revenue exceeding our previous revenue guidance. Along with our efforts to improve operational efficiency, operations, operating costs in the fourth quarter decreased by 63% year-over-year, resulting in a profitable quarter. Additionally, we continued to optimize the production and distribution of premium content and improve our iFeng product to enhance user retention and engagement. In Q4, we continued to demonstrate our leading role in the coverage of major events and breaking news, including the year-long Russia-Ukraine conflict with updates on Ukrainian army's counterattacks on referendums in four Russian occupied regions. We also reported on the China, Russia, U.S. standups over the conflict, the Nord Stream incident and looming nuclear threats alongside other major events like the U.S. midterm elections, G20 Summit and the passing of former leader Jiang Zemin. Throughout, we delivered reliable, accurate and timely information, and most importantly, fostered rational discussion among our user community. Our original columns provided extensive coverage of the pandemic from various angles, our health and wellness,  column, Human Intelligence Agency , , not only provided useful information such as home remedies, vaccine usage and when to seek professional help, but also offer insightful analysis on the COVID development. Our commentary column, the message function, published over 100 articles and tackled controversial topics such as the revenues for opening up the overburdened medical system and the challenges faced by individuals with underlying conditions. For example, it reported on the incidents where insurance companies denied pandemic insurance claims and investigated companies that may have unethically profited from the pandemic. Despite the challenges posted by the pandemic, many of our year-end events, our marketing campaigns were successfully carried out online, resulting in a much lower execution costs while achieving viral online exposure. For instance, our 2020 Fashion award created a viral red carpet show, generating 15  million views on social media, followed by the presentation of the Fashion Awards, where we celebrated the most impactful role models in fields such as fashion, culture, art and sports. The performance data of the event reached a historical high with 35 top searches on Weibo, over 2 billion reads and 1.2 billion video plays across the web, making it one of the most high-profile industry events during the year. A hot topic delivered deeper into categories other than news and politics, including finance, technology, culture, entertainment and sports, attracting more diverse user demographics. Besides posting comments, users can comment and vote on each other's comments, with rise and fall in the rankings as people comment both on them, providing more incentive for users to interact. Our opinion poll function, also became a popular tool where users can express an exchange their views regarding the hot topic. Also, we launched an immersive video stream format with an improved algorithm compared to the traditional video layout, the average number of clips played per user increased by 40% and average time spent per user watching videos increased by 30%. After the launch of the immersive video stream format, total time spent in APB per user increased by 8%. On top of it, our season adages curation and recreation of the content greatly improved the effectiveness of the content recommendation. The number of shares doubled, which helped acquire new users and activate existing ones. In addition, our audio books garnered enthusiastic reviews on the third-party platforms like Weibo Live , with multiple titles reaching over 10 million places and ranking the  new book topics. For the real estate vertical, towards the end of 2022, several state support measures were rolled out to boost recovery of the property sector. As a leading media outlet in the sector, our team promptly tracked and intimated these policies, interviewed industry experts and opinion leaders and provided analysis and reports on the major players in the industry, as consumer confidence takes time to rebound, short-time pressure still persists within the tech sector. In response to the challenging environment, we prioritized cash flows, collected historical bad debts and optimized both our business teams through closure and consolidation while streamlining human resources costs. As to e-commerce, despite the sluggish consumer market, our health and wellness and food and beverage sectors performed well during the year-end. By leveraging an extensive product collection and a more efficient algorithm-driven recommendation system, our health and wellness sector achieved a sales breakthrough, doubling the sales revenue compared to the previous quarter. Meanwhile, the food and beverage sector resulted in triple revenue compared to the previous quarter with a special focus on holiday gift giving. To recap, in the fourth quarter of 2022, we remain committed to optimize cost structure and enhancing productivity, all while elevating our differentiation in areas of original content creation, hot topic curation and our flagship APP product. Although there will still be obstacles to overcome, we're dedicated to revitalize our core business and achieve new milestones in revenue diversification. With that, I will now pass the call on to our CFO, Mr. Edward Lu to provide a closer look into our quarterly financials. To elaborate, net advertising revenues were RMB205.4 million compared to RMB279.2 million in the same period of last year. The decrease was mainly due to the reduction in advertising spending of advertisers in certain industries, the intensified industry-wide competition and the negative impact of the COVID-19 outbreak in China in the fourth quarter. As a result of these efforts, income from operations was RMB46.7 million compared to loss from operations of RMB53 million in the same period of last year. Moving on to our balance sheet, as of December 31, 2022, the company's cash and cash equivalents, term deposits, short-term investments and restricted cash were RMB1.15 billion or approximately $167.4 million. Finally, I'd like to provide our business outlook for the first quarter of 2023. For net advertising revenues, we are forecasting between RMB107.4 million and RMB122.4 million. In summary, in the face of adversity posted by the COVID-19 pandemic in the fourth quarter of 2022, we achieved a profitable quarter through our team's continuous efforts and effective cost control measures to increase operational efficiency. In addition, we continued to enhance our content creation and distribution capabilities, upgrade our iFeng app features and investigate new monetization strategies to improve our revenue stream mix. Despite this, we are well prepared with our rich marketing solutions and meticulous services to secure advertising budgets from our clients. Our original premium content and the refined hot topic strategy continue to bring us loyal and highly engaged users, boosting our media brand influence and value. We are also upgrading our products to create an engaging community for users and increase user retention, which also helps to boost the brand advertising sales. To achieve monetization growth, we set clear targets for our social media accounts and evaluate their performance based on metrics, like user reach, engagement, content quality and the user demographics. Additionally, we are offering our technical capabilities of programmatic advertisement to help third-party applications, monetize their traffic further offsetting the pressure. When implemented properly, it can significantly improve productivity and even have a big impact on recommendation algorithms and content delivery. Actually, we are really excited about AI GC and the trend it's bringing to the industry. Moving forward, we will be keeping a close eye on new technologies such as AI GC and potential applications for our business related talent and even investment opportunities just like we did when we found even  in the past. At this time, I would like to turn the call back over to Muzi Guo from management for closing remarks."
}