{
    "symbol": "AVGO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-01 11:19:06",
    "content": " Layering on our stable software business, we expect Q3 consolidated revenue growth of 24% year-on-year to $8.4 billion. As Tom will discuss next in more detail, together with Broadcom's existing software portfolio, we are positioned to create a uniquely powerful value proposition for enterprises, enabling them to develop, deploy and manage their applications securely, seamlessly across every type of cloud and to accelerate the application life cycle for their workloads. As we think about it, VMware's platform really consists of 3 pillars: First, within the core private cloud infrastructure pillar is the category defining vSphere server virtualization platform, vSAN data storage virtualization solution, vRealize cloud management platform that provides automation, analytics and life cycle management for private cloud workloads and NSX, which enables enterprises to manage their entire physical network as a single entity from a single pane of glass. So what's exciting is that when you put the 2 portfolios together, we're delivering an end-to-end solution that enables enterprises to support the 3 major types of application paradigms, including applications that run critical business functions that will remain in private cloud data centers, applications that are being ported to run in the public cloud and new generation applications that are written natively for one or several of the public cloud providers. As we come together with VMware, this represents the same level of transformation for our software business and we stand to benefit from VMware's unparalleled brand, trusted apps, a long-standing position as an iconic software platform within a robust vibrant ecosystem of hyperscalers, solutions and cloud providers and channel partners, among others. Applying this same model to VMware, we are targeting to increase VMware's stand-alone EBITDA of approximately $4.7 billion to approximately $8.5 billion in pro forma run rate EBITDA within 3 years of closing. Based on current business trends and conditions, our guidance for the third quarter of fiscal 2022 is for consolidated revenues of $8.4 billion, and adjusted EBITDA of approximately 63.5% of projected revenue. I think with VMware, when we look at it and we look at the fact that vSphere, going back to the core, serves over 300,000 customers, and we look at the growth that the company is driving with their more modern applications, whether it be for private cloud or public cloud, we see a much bigger opportunity."
}