{
    "symbol": "DCO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 17:10:04",
    "content": " The company's defense business after two years of unprecedented growth in 2020 and 2021 was only down slightly in Q4, but once again delivered solid performance of over $100 million in revenue as we prepare for increasing DoD budgets and FMS in the years ahead. In addition, Q4 commercial aerospace revenues were $43 million or 45% higher than a year ago. Switching to the company's backlog performance, the commercial aerospace backlog increased sequentially for the seventh consecutive quarter from $266 million at the end of Q1 2021 to $450 million at the end of Q4 2022. Beginning with our military and space sector, we posted fourth quarter revenue of $108.4 million, a slight decrease versus 2021, despite being down as mentioned earlier, was greater than $100 million and a solid showing for the business in Q4. Within our commercial aerospace operations, fourth quarter revenue increased year-over-year to $68 million, driven mainly by build rates increases on large aircraft platforms, in-flight products for Viasat and other commercial aerospace platforms. The year-over-year increase reflects $26.4 million of growth across our commercial aerospace platforms, partially offset by $4.7 million of lower revenue within the military and space sector. The year-over-year increase reflects $13.4 million of higher sales across our commercial aerospace applications, partially offset by $4 million of lower revenue within the company's military and space markets. These results reflect $13 million of higher commercial aerospace revenue, partially offset by $0.7 million of lower revenue across the company's military and space customers. Electronic Systems operating income for the fourth quarter was $13 million or 10.8% of revenue versus $15.4 million or 14.6% of revenue in the prior year period, primarily reflecting unfavorable product mix and higher restructuring charges partially offset by favorable manufacturing volume. Itâ\u0080\u0099s going to be â\u0080\u0093 we came in â\u0080\u0093 I donâ\u0080\u0099t want to come write down the number there, but weâ\u0080\u0099re probably going to get tailwind of say $30 million from the offload, maybe $35 million, because we came in pretty good shape. But I will just tell you that, especially in the card area, I mean, we put that note out about Appleton being over $100 million now, which is a 70,000 square foot plant, which is â\u0080\u0093 and thatâ\u0080\u0099s all cards and thatâ\u0080\u0099s all people coming and saying, hey, we want you to do it here as well as, Tulsa now is onto the next phase and weâ\u0080\u0099re expecting really good things."
}