{
    "symbol": "DCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 19:03:06",
    "content": " The company's business in defense as well after tremendous growth of roughly 40% over the past 2 years in 2020 and 2021 was only down slightly in Q2, but still delivered a solid performance of over $100 million in revenue. For backlog performance, the commercial aerospace backlog increased sequentially from the fourth consecutive quarter from $276 million at the end of Q2 2021 to $419 million at the end of Q2 2022, and over 50% increase. The book-to-bill ratio for Q2 was 1.1%, and we are thrilled that for the second consecutive quarter, the backlog for Q2 reached a new all-time high of $976 million for the company. We also ended the quarter with a solid backlog, as mentioned earlier, $494 million, which represents 51% of Ducommun's total backlog. In our commercial aerospace operations, second quarter revenue increased year-over-year to $57.1 million, driven mainly by bill rate increases on large aircraft platforms, business aviation, in-flight products for Viasat and other commercial aerospace platforms. The year-over-year increase reflects $19.5 million of growth across our commercial aerospace platforms, partially offset by $6.3 million of lower revenue within the military and space sector. We posted total gross profit of $34.6 million for the first quarter versus $36.8 million in the prior year period, while gross margins were 19.9% and 23% in 2022 and 2021, respectively. The year-over-year increase reflects $12.8 million of higher sales across our commercial aerospace applications, partially offset by $5.8 million of lower revenue within the company's military and space markets. These results reflect $6.7 million of higher commercial aerospace revenue, partially offset by $0.6 million of lower revenue across the company's military and space customers. Electronic Systems operating income for the second quarter was $13.6 million or 12.4% of revenue versus $14.4 million or 14% of revenue in the prior year period, primarily reflecting unfavorable product mix, partially offset by favorable manufacturing volume."
}