{
    "symbol": "DCO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 12:13:07",
    "content": " First quarter revenue was higher due to Ducommun's overall commercial aerospace growth, up 53% year-over-year, along with continued solid defense business versus prior year though down on a fairly strong Q1 2021 number. The commercial backlog also showed strong signs of recovery, increasing sequentially for the third consecutive quarter from $276 million at the end of Q2 2021, to $377 million at the end of Q1 2022, a very good sign. Beginning with our military and space sector, we posted first quarter revenue of $99.3 million, a decrease versus 2021. In our commercial aerospace operations, first quarter revenue increased year-over-year to $54.1 million, driven mainly by bill rate increases on large aircraft platforms, business aviation and in-flight products for Viasat. The year-over-year increase reflects $18.7 million of growth across our commercial aerospace platforms, partially offset by $14.8 million of lower revenue within the military and space sector. Ducommun's overall backlog at the end of the first quarter was approximately $943 million, an all-time high, reflecting recent growth across our commercial aerospace platforms, setting up the Company for strong topline performance for the rest of 2022 and beyond. We posted total gross profit of $32.5 million for the quarter versus $33.1 million in the prior year period, while gross margins were 19.9% and 21.1% in 2022 and 2021, respectively. Ducommun reported operating income for the first quarter of $9.1 million or 5.6% of revenue, compared to $10.6 million or 6.8% of revenue in the prior year period. Adjusted operating income was $12.3 million or 7.5% of revenue this quarter, compared to $12.3 million or 7.8% of revenue in the comparable period last year. The company reported net income for the first quarter of 2022 of $8.1 million or $0.66 per diluted share, compared to net income of $6.7 million or $0.55 per diluted share a year ago. Adjusted EBITDA for the first quarter was $20.1 million or 12.3% of revenue, compared to $21.1 million or 13.5% of revenue for the comparable period in 2021. The year-over-year increase reflects $12.8 million of higher sales across our commercial aerospace applications, partially offset by $4.9 million of lower revenue within the company's military and space markets. These results reflect $9.9 million of lower revenue across the company's military and space customers, partially offset by $5.9 million of higher commercial aerospace revenue. Electronic systems operating income for the first quarter was $9.4 million or 9.7% of revenue versus $12.5 million or 12.6% of revenue in the prior year period, primarily reflecting unfavorable manufacturing volume and product mix. CG&A expense for the first quarter of 2022 was $5.2 million or 3.2% of revenue versus $7 million or 4.5% of revenue in 2021, the year-over-year decrease was primarily due to lower compensation and benefit costs."
}