{
    "symbol": "GOOS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-11 11:40:44",
    "content": " I think when it comes to fur, we are--we’re continuously investing in upgrades to the performance and the quality and the sustainability of our jackets, and it’s very much more part of a broader evolution of our offering, so as a result we’re not really expecting this to change margins at a channel level, and particularly given the broader suite of investments that we’re making in our products. I’d like to ask about that a little bit as well, but maybe Jonathan, any color on how you thought about conservatism you baked in, in 2Q on a direct-to-consumer basis related to the shifts you just mentioned, and then as we look at some of the math that you laid out, the second quarter looks like it assumes wholesale about 40% below September ’19 levels and direct-to-consumer about 7% below 2019 levels. I think wholesale, we’ve been very clear that we went through something of a reset last year and we do not expect it to be materially different to last year’s level this year, so as you compare back to fiscal ’20 and what happened there, you’ve got to think, first of all, the shipping patterns might have been somewhat different on the one hand, and the absolute size of the wholesale business was materially higher at the same time. As I think we’ve mentioned in the documents, wholesale is about when our wholesale customers want to take the inventory, so the performance in the first quarter is neutral to our expectations for the year; in other words, we are simply shipping it when the wholesale client wants it, which is a bit sooner than we thought. That fundamentally changes the revenue pattern of the business because, first of all, wholesale isn’t the same the size that it was, and secondly the DTC business got a lot bigger, but as I said earlier, with a huge skew to the second half of the year. I think when it comes to SG&A, I think the--you know, if you take what we spent in the first quarter and what we’re talking about for the second quarter, you’ll have a pretty good feel for the rate of growth, and that’s very much aligned with what we gave as assumptions, so against  when I spoke last time."
}