{
    "symbol": "GOOS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-19 11:54:02",
    "content": " Each forward-looking statement, including our financial outlook is subject to risks and uncertainties that could cause actual results to differ materially from those projected. Additional information regarding these forward-looking statements, factors and assumptions is available in our earnings press release issued this morning, as well as the Risk Factors section of our most recent Annual Report filed with the securities regulators. Earlier, we released our Q4 and fiscal 2022 results, as well as our outlook for 2023. Despite the challenges in today's environment, I'm proud that we are closing the year with record sales breaking the $1 billion mark for the first time. We are also ending fiscal 2022 with confidence and conviction in our brand, our business and our team. From a geographic perspective, our retail performance in North America was the biggest driver of growth. APAC was the only region that declined due to ongoing COVID restrictions, including store closures in Mainland China. We do not expect the prevailing circumstances to have a meaningful impact on results in our busiest season, which is reflected in our outlook. Recently, many peers have pointed to continued production and supply chain challenges, as well as logistical delays. This was not a factor for us in the quarter, nor do we expect it to affect the year ahead. We continue to be uniquely insulated against supply chain issues due to our Canadian manufacturing, which accounted for 84% of our total units in calendar 2021. As I mentioned earlier, we marked a revenue milestone in fiscal 2022. Last month, Carrie Baker, a Canada Goose veteran and previously President of North America was appointed President, Canada Goose. Belinda has more than 20-years of extensive experience in China and the Asia Pacific region, and I'm thrilled to have her on our Board. And finally, we are very excited about recent developments to accelerate our business in two key markets in Asia-Pacific building on the successful foundation that we have built in Mainland China over the past four years. Recently, we signed a distribution agreement with  (ph) to significantly grow our South Korea business. This agreement allows us to further develop our brand in the country's best locations, while providing a clear longer term path to retail expansion and direct participation. As well, in March, we announced Canada Goose Japan, a joint venture with our longstanding partner, Sazaby League. In 2022, DTC revenue represented more than two-thirds of our business at $740 million. Not only is our DTC strategy driving revenue growth, but it is driving the most profitable growth for us. In 2022, our DTC gross margins were 76% with contribution margin in the high 40s. In fiscal '23, we plan to continue to expand our retail network adding up to 13 stores globally. We also planned to strengthen our e-Commerce business by expanding our omni-channel operations to the UK, as well as launching a new e-commerce site in Europe. Not only that our direct-to-consumer business allow us to reach consumers when and where they want to shop, it allows us to build deeper relationships and gain even stronger insights. Penny Brook, our Chief Marketing Officer is now also leading consumer experience, and there couldn't be a more passionate person to take this on. Earlier this month, Forbes Magazine named Canada Goose one of the most consumer-centric brands in the world and we could not be prouder. In 2022, we saw our non-parka revenue grow by more than 70%, driven in large part by our lightweight down vests and apparel. In January 2022, I was also very proud to sign Canada Goose to the United Nations Global Compact. We remain absolutely committed to respecting and protecting the fundamental human rights of those directly and indirectly are part of our company and supporting inclusive, safe and healthy working conditions. Before I turn it over to Jonathan to discuss the results and outlook in more detail, I want to thank the global Canada Goose team for all their efforts in building an even stronger foundation for future success. Our confidence is reflected not only in our guidance, but also in our repurchase of over CAD250 million in shares this past year. With fiscal '22 wrapped up, we're pleased with our momentum and optimistic about the year ahead. Despite new waves of disruption in certain markets, we believe current trends in our business are strong. Carrying this momentum into the year ahead, we have many powerful levers to grow and to increase profitability. The current quarter ended on April 3, 2022, and that's one week later than the comparative period. For that reason, we have also provided figures that use the same set of trading weeks in both periods. On a reported basis, total revenue in Q4 increased by 7%. At a channel level, DTC growth was 8% and wholesale growth was 4%. Using the same trading weeks in both periods, total revenue would have increased by 24%, with DTC growth of 28%, and wholesale growth of 8%. Looking at gross margin, it's great to see the power of our algorithm working so well in these times. Both DTC and wholesale gross margins expanded, compared to the prior year, coming in at 76.1% and 33.6% respectively. Going further down the P&L, adjusted EBIT margin expanded to 5.6% and adjusted EPS was $0.04. For the full-year, both metrics landed at the top end of our outlook ranges with adjusted EBIT margin of 15.9% and adjusted earnings per share of $1.09. Moving to our outlook for fiscal 2023, the two things that stand out are the breadth of our opportunities and the resilience of our operating level. Starting with the top line, we expect total revenue of between $1.3 billion and $1.4 billion. The DTC, this assumes low to high-teens comparable sales growth alongside continued expansion of our retail network and our omni-channel capabilities. At this stage of our journey in DTC, like-for-like growth becomes the biggest driver, and we will be providing this to you as we progress through the year. In wholesale, we expect revenue to increase by approximately 6%, continuing our strategy of controlled complementary growth. From a geographic perspective, a major new catalyst is our recently formed joint venture Canada Goose Japan with our former distributor Sazaby League. The timing of this revenue is somewhat later in the year, as wholesale shipments to the JV will no longer be recognized as revenue upon shipment. As Dani mentioned, this unlocks a more significant and profitable Japanese business with a longer runway. We also have a stronger economic model to fund DTC expansion and bring the full breadth of Canada Goose to the consumer, alongside the local expertise of a trusted world-class partner. Alongside continued growth in our core, consumers are embracing our earlier stage categories. In our most recent calendar year, 84% of the units made or purchased were from Canada, followed by Europe with 14%. Moving past revenue, fiscal 2023 represents a major step up in profitability with an adjusted EBIT margin of between 19.2% and 20.7%. This is underpinned by three key drivers, gross margin expansion; lower SG&A growth; and improved retail productivity. At an individual channel level, we feel good about preserving our typical levels, while funding investment in earlier stage categories. To finish on gross margin in wholesale specifically, we have a one-time step-up from the conversion of our Japanese business shifting from our largest distributor market to a joint venture. As we've noted in the past, international distributor sales come in at a significantly lower gross margin, compared to a direct sales to a wholesale partner. For fiscal 2023, we expect a lower level of growth in SG&A. In markets, which are currently unrestricted, we have seen a strong rebound from local consumers, as well as the green shoots in international traffic from North American and European consumers. Our margin outlook is not dependent on a full recovery of international traffic, nor on the return of traveling Chinese consumers. Bringing all of this together, we expect adjusted EPS in the range of $1.60 to $1.90, representing growth of 47% to 74%. In our seasonally smallest quarter, this represents a lower rate of growth than our annual expectation for two reasons. Well, generally consumers in this market are understandably not immediately focused on discretionary consumption. The second dimension is the conversion of our Japanese business to a joint venture, which shifts revenue recognition later from shipment to the distributor to shipment to the wholesale partner. For this reason, and only this reason, we expect wholesale revenue growth to be slightly negative. For adjusted EBIT, we expect a loss between $80 million and $75 million. In addition, improved retail productivity, gross margin expansion and reduced SG&A growth will drive our bottom line. Underpinning all of this is our unique supply chain, which enables us to always have products available and to effectively navigate a more inflationary environment. Your line is now open. And then maybe, Jonathan, just more specifically on the outlook. So I'm very excited to take on the new role and to work alongside Dani as a day-to-day we run global commercial operations, which will give him more bandwidth for long-term strategic initiatives. So when I think about all of the commercial opportunities in front of us, my biggest priority is to make sure that we execute with excellence, and that means being purposeful, disciplined about creating impact in everything we do. And the great news is we have an incredible brand, a strong business model and an incredible team to bring that all to fruition. Okay, and if I may, let me just talk a little bit about China. Obviously, it's -- we've seen Mainland China being negative in Q4. Now, what we do know is that we've seen these types of disruptions before and we've seen that they've been typically quite temporary. And Mainland China has proved to be a market, which has bounced back quite . So in other thinking, we are, obviously, expecting Q1 to be heavily impaired. And then as we move forward, Q2 showing that gradual improvement and a normal level of business in Q3. Your line is now open. Last year, our sell-throughs at wholesale were very, very strong and we're happy with that this year. Our wholesale order book has increased as expected and remain in single-digits, and we will continue to strategically work with  wholesalers sellers to enhance the valuable ramp. I'd add that the wholesale assumptions behind our guidance, obviously, pounded on our order book and so we feel we're in very good shape. Your line is now open. I think pre-COVID several years ago, you have three-year targets closer to the mid to high-teens. So taking those in sequence, as far as the revenue growth is concerned, we're looking at a healthy level of comp growth underpinning how we see the business developing. We're very clear that, that's going to enable us to see some components that together with some unit growth, as well in our like-for-like stores alongside, of course, the development of the retail network. We – obviously, we've shown a range  (ph) has its uncertainties at the moment, but we feel pretty good about this level of growth in this environment and we see this as very consistent with our longer-term ambitions. On earnings, clearly, getting ourselves back to the 20% mark and beyond is very important, it’s something that's a big focus for us. This year marks an important step in that journey, but it's an important step. And so as the business continues to grow, I see this is something that we should expect to see continue for some time to come. Your line is now open. Maybe -- I know you said -- I think you said $60 million, $65 million in distributor change. And then I think when we talked a few quarters ago and in the last quarter, you thought maybe margins could get above 20% this year. So I'm going to -- let's talk about JV, first of all. Obviously, there's an optical change in the reported level of revenues, which is roughly doubled. And so that essentially is -- if you like, the overnight impact on the revenue from that market. Over time, we see this as a very high EBIT margin market and we're very optimistic about it. We see that founded on the development of DTC is an important component of how we participate there, that's how the Chinese market is structured. Obviously, JV is presently a month in, so it's early days, but we're very committed towards them about how we see that changing. When it comes to margins overall, as you just have me described, 20% point on the journey, we're dealing with some uncertainties. Frankly, in this quarter, we're not expecting to do any material business in Mainland China, and that's embedded in the comments that we already made. So as things improve and we're confident they will, then we resume our journey towards the sort of levels we've enjoyed in the past. Pre-pandemic, we were in the 25% range, and we expect to get back there and beyond that and continue on our journey towards 30% as international tourism and profit trends are back to normal to pre-pandemic world. Your line is now open. We continue to enjoy very high ROIs in our store estate, and obviously, that's an area we continue to invest in. The -- we also invest in our manufacturing facilities, as well as part of scaling the business as we continue to grow. But fundamentally, we don't see a very different level of underlying capital expenditure . To the extent that we have -- we build surplus capital up in the business, then we look at it how we -- how else we might allocate it. You've seen in the past, when we believe there are opportunities, we've been in the market and conducted a buyback. Your line is now open. So when -- in terms of the comparable growth, we are assuming two or three things. First of all, we've got the normal impact of pricing, we're developing our product categories, so we expect unit growth. But I think the other dimension is, of course, we do expect a gradual resumption of traffic to continue, and therefore, that's something that we are factoring in as well. We don't feel that this level of comparable growth is egregious as the business continues to go back, and therefore, we feel pretty confident about it. So for North America, we see continued growth. Obviously, we're very strong at home in a mature market, but the U.S., in particular, I would say, is a market where it's very early days. We have opportunities to get outside of the Northeast, and that's what we've already seen through this year and expect that to continue next year as well. Your line is now open. And then maybe, Jonathan, can you -- relative to average unit cost, you had said that the price increases would be above kind of the inflationary aspect of it. Every year, we  and that is because across our best-in-class made in Canada we they perform function first, and I don't believe that there's a better value to product in the market of our kind today. And I think when it comes to thinking about the cost pressures, they're not that significant. But when you're dealing with margins that are fundamentally wide in first place and relatively high AURs, then actually, you don't really see too much pressure on it. The tailwinds include pricing, include scale, include sourcing, and that -- and we invest, of course, in input price inflation, but also in new product development and new category development. And therefore, at a gross margin, at a channel level, we see management's job of keeping the margins where they are and in continuing to invest in the development of the product categories. Your line is now open. And then I think, Jonathan, you talked about Q3 returning to normalized levels of productivity in China. It's -- these are relatively balanced geographically, all including significant contributions from the States, EMEA and Mainland China and Japan, and it's balanced across all those markets and --\n Okay. And then when it comes to China, I think the other thing that's really important to remember is that we have enjoyed and continue to enjoy similar levels of sales density in Mainland China that we do in the rest of the world. So when that business is not impaired in terms of traffic, that's what we enjoy, that's what we expect to enjoy this year. So as far as North America, generally, I'm going to segment that into the U.S. and Canada. I think when it comes to the U.S., we already talked about the fact that we were seeing a very strong rebound in traffic and pre-pandemic levels of sales. I think when it comes to Canada, when it comes to the domestic component of traffic that is coming back to where it was. Obviously, international will come back when it comes back. Your line is now open. I think the important thing to understand here, Mark, is that it's less about the geography and more about the channel. So in other words, what's important to us is how we tell the stories around our new product categories, how we build out consumer franchise and how we make those adjacencies work in our stores around the world. And therefore, we -- that's something that we deploy in Canada and we deploy in the U.S., that we deploy in Europe and we deploy in Asia, and that's the global footprint that we see. Therefore, we don't see a differential in how consumers react to it, because it's all about how we tell them the stories. We may see a difference in how consumers react in wholesale versus on our own stores, because obviously, we're curating the offer much more in our own stores. Yes, Jonathan, just to add to that on top -- and to speak a little bit to footwear, it's a really exciting new category for us, which has done well. That means it's not a significant revenue contributor today, but we do expect that it will be material contributor to the long term. This is part of our playbook, which is to take a disciplined gradual approach to building new categories, and I'm really excited about what lies ahead because I know that this category is a well-balanced category. Your line is now open. I guess, I was just hoping you can elaborate a little bit on your comment that your outlook does not depend on a 100% return of international traffic or return of tourism from China. I mean, we didn't feel it was responsible to include a full return of international tourism from China. But at this point, it's not returned, and we've assumed none of it in our guidance."
}