{
    "symbol": "GOOS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-10 13:59:10",
    "content": " After the speakers’ presentation, there will be a question-and-answer session. Each statement, including, without limitation, discussion of our financial outlook, is subject to risks and uncertainties that could cause actual results to differ materially from those projected in such statements. Additional information regarding these forward-looking statements, factors and assumptions is available in our earnings press release issued this morning as well as in the Risk Factors section of our most recent annual report. The forward-looking statements made on this call speak only as of today, and we undertake no obligation to update or revise any of these statements. Our commentary today will include certain non-IFRS financial measures, which are reconciled in the table at the end of our earnings press release issued this morning and available on our Investor Relations website. Our momentum has continued, putting us on track to exceed $1 billion in annual revenue for the first time ever. Total revenue increased by 26.5%, excluding temporary PPE sales from last year. DTC led the way in its largest quarter, up 49%. We had a sharp improvement in store performance relative to last year, alongside continued digital growth. In the later stages of Q3 and into Q4, a new COVID outbreak and related restrictions have impacted revenue growth and retail traffic in both APAC and EMEA. And in the case of APAC, we've already seen sequential improvement in the past two weeks. While today's environment presents challenges, we remain confident in our long-term trajectory. Looking forward, we are confident in our inventory position going into fiscal 2023 and we're confident in our ability to navigate inflationary pressures. As I mentioned earlier, our global digital business has continued to see strong growth, building on the solid gains that we made last year. I'm proud of the dedication our team has shown delivering against this objective, and we are encouraged by the results that we are seeing across the business. This quarter, non-parka revenue grew by 75%. One highlight I'd like to touch on being our pastel collection, our first full expression of the Canada Goose lifestyle, including sweat, outerwear, accessories and footwear. The collection resonated particularly with women, and we plan to expand this offering later this year. Looking forward to our spring collection, we will launch several new styles, growing our year-round relevance. And tomorrow, we launched our second annual capsule collection with NBA All-Star as part of our multiyear partnership. The collection is made with 100% recycled nylon, responsibly sourced down and uses undyed fabric, significantly reducing the chemical impact of the collection. We delivered a strong performance in the third quarter, with revenue and earnings well above pre-pandemic levels. Brand momentum was exceptional, and our DTC-led distribution was highly productive. Following new COVID-19 variant outbreaks, we have seen lower-than-expected revenue growth and traffic in Asia-Pacific and in EMEA at the end of Q3 and into the current quarter. Our operating environment remains more favorable than it was last year, and we're making great progress on our strategic agenda. Looking at the quarter in detail, total revenue increased by 26.5% to $586 million, excluding the impact of temporary PPE sales last year. As fiscal 2022 is a 53-week year, the additional week in Q3 provided $40.9 million of revenue. In the quarter, DTC led the way, increasing by 49% to $445 million. Higher revenue from existing stores, e-Commerce growth and retail expansion were all significant contributors. As planned, wholesale revenue decreased 15% to $137 million. Throughout the year, we’ve spoken about a normalization of timing with the shift back into Q2. We are finishing the full winter with significantly higher sell-out than last year, and we’re excited to build upon this in fiscal 2023. From a products perspective, our year-round lifestyle relevance continues to grow. In Mainland China, DTC revenue increased by 35%. Following a very strong November, we observed a slowdown in store traffic in December, which carried through into the current quarter. Underlying demand remained strong, highlighted by the low 60s growth rate we achieved online. In Canada, revenue growth was 32%, excluding temporary PPE sales last year. E-commerce increased in the low double digits, together with much improved retail performance. Our established retail stores were all near or at pre-pandemic levels, and digital growth was in the high 30s. Excluding temporary wage subsidies, both are slightly up versus last year and well above two years ago. Total SG&A was $184 million, up 27% from last year. As we’ve discussed throughout this year, we plan to slow down SG&A growth and expand profitability in our peak selling season. Finishing with our revised outlook for fiscal 2022, this reflects lower revenue in Asia Pacific and EMEA in the current quarter. At a macro level, this outlook assumes no material increase in pandemic or economic disruptions relative to what we’re experiencing today. Backing out our year-to-date results with one quarter left in the year, our annual outlook implies the following revenue levels for the fourth quarter. What that means is it’s shifting one week from a high-volume trading period, which represented $40.9 million in total revenue this year. In contrast, the extra week in the shift at the end of this fiscal period is not meaningful from a revenue perspective. In Q4 of last year, e-commerce growth is a high watermark of 123% due to closures and late demand timing. We expect e-commerce to normalize and be largely in line with last year with a fully operational retail fleet, playing a much larger role in our DTC growth. As we see it today, there is no reason why we can’t have strong growth and margin expansion even without a full retail recovery globally. Your line is open. And then finally, it’s encouraging. And what we’re seeing in North America is very much maintained, and we’ve got continued momentum there. I think when it comes to marketing, we are always very deliberate about our investment in marketing. We keep it constant as a percentage of revenue, and we see no change in that over time. So when it came to wholesale, obviously, we’ve had a very positive set of demand circumstances. This year, it was a more typical year and more of our revenue came in Q2 and our sell-through is very strong. Your line is open. I think as we often do, we make our SG&A growth investments typically very front weighted in the year. And then as we get into the peak season, that’s when we see the profit delivery and the margin expansion. And then the first – fourth quarter here, as I’ve said before, was supposed to be a major driver of margin expansion. Timing this year was unfortunate, and it’s magnified the impact, therefore, of our most recent disruptions. To be absolutely clear, this is a sales traffic store – retail traffic story that’s impaired revenues and, therefore, depressed margin. And as a result, we’re in the mid-teens for the year relative to the mid to high teens range that we’ve been talking about throughout the year. Now as we look in terms of fiscal 2023, we see no reason why we can’t expand margins significantly more than the current year, even in this environment. Our DTC productivity critically is improving, and the U.S. has already shown us the upside of a more fulsome retail recovery. I’ll just add to that what Jonathan said, longer term, as retail restrictions and traffic normalize globally, we completely – we intend to recover and we see ourselves eventually going beyond pre-pandemic levels. To Jonathan’s point, it’s completely a traffic story and traffic will come back. Your line is open. Jonathan, I apologize you were cutting in a little bit or maybe just back on Oliver’s question around regional performance. I just wanted to understand a little better the guidance reduction on DTC is around $75 million, which is a lot for a smaller quarter in 4Q, so clearly, there is some regional dispersion, which I think you’re talking about APAC and EMEA. North America sounds pretty healthy, but it sounds like it’s pressure there. To start with the bright spot, U.S. is actually now within very close striking distance of pre-pandemic levels and I underscore that’s without meaningful international traffic. Our highly productive stores in Canada are a bit behind, but they’re much improved from last year, and they’re definitely moving in the right direction. Asia Pacific was a standout for retail recovery last year, but it’s taken a few steps back with the new outbreaks and restrictions that we’ve been dealing with this year. But overall, globally, it’s important to note that we’ve seen much stronger traffic this fall/winter than we did last year and we are convinced that these disruptions are temporary. Your line is open. On the gross margin, I think the non-parka categories were a bit of an impact to the gross margin this quarter. I would assume that, that the mix of non-parka keeps evolving next year as you push into some of those other categories and boots certainly. And then just to follow Jonathan’s question earlier, is it – I know you’ve spoken to EBIT margins much higher even than the 20% over the long term for the business. And that, therefore, gives us a softer base for next year. And assuming that we can see the continued normalization of traffic, that clearly gives us an opportunity for growth quite apart from the organic growth that the business should generate in any event, both through its existing network of stores and wholesale accounts and so on as well as the continued development of the retail network and our technology so – in terms of online and omni. Now turning secondly to gross margin, you’re right that more – our margins are inevitably higher in our parka category. And therefore, as we develop our non-parka business those margins initially are somewhat low. The fundamental part of our margin algorithm, though, is that we create tailwinds and headwinds so that we keep the gross margins in balance, particularly at a channel level. So therefore, we believe that what we’ve said historically, which is mid-70s gross margin for the DTC channel, mid to high 40s for wholesale, is what we should expect to see over time. Management’s job is to keep it in balance, and we believe that we’re demonstrating that we’re able to do that. I think when it comes to EBIT going forward, I’ve said before, there’s no reason why we shouldn’t be expanding margins significantly more than we did this year, even in this environment. And whilst it’s too early to give specific numbers for next year, you’ve heard me talk about the fact that we expect our EBIT margins to move above 20% and towards 30% over time, and that view has not changed. And to add to what Jonathan said at a very high level, we are very optimistic for next year and beyond. We continue to be – we have consistently grown and demonstrated meaningful growth over the past few years, and we see a nice – personally, no reason why that will not continue into the future. And when – and such time when traffic returns, we see it as an even greater accelerator to that growth. Your line is open. And then in the last two weeks, I think you mentioned the last two weeks, it’s picked up. Would love just a little bit more detail on your – what’s happening in that market, what’s affecting your business and your outlook. Thank you for your question. The primary story in China at the moment is COVID-related and restrictions-related, which impaired traffic to stores. I’ll point out that our online business in China was up over 60% in the last quarter, which is really important to note and is a very good sign of consumer demand for our products in China. As I said in my prepared remarks, we’re seeing that traffic build week over week at the moment. I think there are a number of factors going on in China at the moment, whether it’s around COVID, but also right at the moment, obviously, the Olympics are underway in Beijing. We have assumed a more normalized trend in Asia for the remainder of the year based on what we’ve been seeing, and that’s embedded in what we’re saying here. I think the other thing is to think about the way in which our business evolves, typically, January is bigger than February, February is bigger than March. And therefore, the swing factor that’s embedded in how traffic becomes more volatile than the remainder of the year becomes less significant. Your line is open. Thank you very much. I guess, I’m going to say on the China topic. And specifically, what percent is coming through e-commerce versus stores. And then, Jonathan, I want to dig into the product margin, specifically the merchandise margins, you talked about puts and takes. Thank you very much. So China margins typically are robust, certainly at the gross level. And that reflects the fact that we follow the global pricing metrics around the world, and that’s a well-established pattern for us. I think, generally speaking, therefore, we enjoy good levels of productivity. And therefore, the stores are profitable and very good alongside a strong contribution from our e-commerce. And from an EBIT margin standpoint, first of all, the stores and the online in normal times are about the same. The China EBIT margin in and of itself is a little bit more depressed than the other regions because it has embedded in it the operating costs of our partnership with ImagineX, which fall in SG&A. And so although, there were very strong underlying margins, there's a supplementary cost that's been there in the region since day one. When it comes to our product margins, we are not facing huge input cost inflation. And we do have some freight costs either because we’re moving product, we're buying raw materials and bringing them in or because we're shipping our product out. And as our DTC network grows, it means that we have a very robust and sophisticated understanding of price elasticity which means that when you do move prices, you're able to understand the impact on volumes, and therefore, it's very surgical. Your line is open. I think our brand equity, we're seeing the brand equity across all of our markets is very strong. Front of the share of mine that we capture in all markets is growing, especially among the young consumers, a lot of this brand awareness, brand heat is being driven by our – some of our collaborations that we're doing. And yes, so we're very encouraged by what we see from a brand awareness and desirability perspective in all I'd say, three of our geographic markets, both objectively and relative to our competitive set. Your line is open. Our store productivity, when it comes to looking at the new cohorts of stores, we've been very pleased with the stores that we've been able to bring online in the last couple of years. To be honest, it's quite good to be a buyer in a seller's market, and therefore, we've been able to pick up some really interesting property, whether we're talking Southwest Plaza in the U.S. or whether we're talking about stores that we've opened in Germany or one of the stores we've opened in China. Your line is open. Our brand equity in China, specifically, what you're asking about is we see as being quite high, the demand for our products there is high. It's – China is a really large market, and there's room for lots of brands there, and there are lots of brands both international and domestic. And amongst those brands, the demand for our brand is very strong, and we see that in all of our market research that we do in China. In addition to that, I think it's very important that as an international brand that we also market specifically to China for China. And marketing to our consumers there, along with collaborations that we do in market with local designers and – in that way, we continue to keep the demand for our brand from our Chinese fans very high. Your line is open. I wanted to get your thoughts on the significant volatility in your share price on earnings results, specifically in recent quarters. Thank you for your question. I think I believe firmly that is our job to build a long-term and strong, enduring business that will last for decades and generations to come, and I firmly believe that we're doing that. And that's not measured in quarters, that's measured in years and in generations. And so when I look at what we've accomplished year-after-year over the past many years, I'm very proud of what we've been able to accomplish. As you also know, we privilege investment in the business with our free cash flow because that ultimately, we believe, is the best use of funds to generate return to shareholders. That said, at times when we believe that the – there is an attractive share price in the market, it's also an option for us to consider working with our NCIB. Your line is open. So if I remember hearing correctly, China was up 35% but your stores doubled year-over-year. So inevitably, at this level of space expansion, you're going to conclude that there are declines in the comp store base in China. But that said, we are also seeing good growth in our – with the Chinese consumer. And frankly, the disruptions that we're seeing at the moment are pretty much driven by the environmental and extraneous factors that we've been describing. Your line is open. And maybe just stop right there, that's the question. We run our marketing operations in China, out of China, who's on the ground in our office in Shanghai. I think that our social media presence is strong and has really helped drive our brand awareness, our revenue over the year, over the past few years that we've been in China. As you know, we're on Tmall, we’re on JD.com, we’re on WeChat, we’re on Weibo as well. And across all of those platforms, we've been able to cultivate a very strong base camp community in our Chinese marketplace. Your line is open. I don't know, Dani or Jonathan, can you remind us what percent if you go back to fiscal 2020 or calendar 2019, can you remind us what percent was tourist driven. And because I think it was very high, right. I think – and so it would imply that your – the core U.S. customer has grown a lot, I think since 2019 or fiscal 2020? But it does look like – and tell me if I'm getting the math wrong, but it does look like it's been pretty impressive growth in U.S. customers versus two years ago. Yes, there's no question that our business over in the United States has been very strong, very robust and certainly due to an absence of international tourist traffic, that's driven by local population. So we're very pleased with our – obviously, the growth of our equity, our brand awareness and popularity that can be used in the United States. And I think that looking towards the future and the return of international tourism, both to all parts of the world, to North America and to EMEA as well. I think what I'd add to that is we've always said that in normal times, and you're talking about baseline that was normal times. I think that if you look at the U.S., even SoHo now is pretty much doing the same numbers it was pre-pandemic that's really important to say that’s a benchmark. We're also – as you're thinking about the product offer, we are obviously developing our lifestyle offer with the non-heavy breakdown complementary have been breakdown. And that's enabling us to develop the business across the U.S., not just in the cold weather parts. Before we say goodbye for today, I'd like to leave you with one final comment, and that is our foundation is strong and our ability to navigate temporary disruptions is absolutely proven. I look forward to speaking to you all again next quarter, and thank you, everyone, once again for joining us here today."
}