{
    "symbol": "PBFX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 17:03:09",
    "content": "  Operator: Good day, everyone, and welcome to the PBF Logistics LP First Quarter 2022 Earnings Conference Call and Webcast. Good morning, and welcome to today's call. Before we begin, I'd like to direct your attention to the forward-looking statements disclaimer contained in today's press release. In summary, it outlines that statements in the press release and on this conference call that state the partnerships or management's expectations or predictions of the future are forward-looking statements intended to be covered by the safe harbor provisions under federal securities laws. As noted in our press release, we'll be using certain non-GAAP measures while describing the partnership's operating performance and financial results. For reconciliations of non-GAAP measures to the appropriate GAAP figure, please refer to the supplemental tables provided in today's press release. As mentioned on previous calls, the 2022 partnership revenues reflect the lower minimum volume commitments for the East Coast rail facilities, which took effect as of January 1. Today, we announced a distribution of $0.30 per unit. Good morning, everyone, and thank you for joining us on today's call. Adjusted partnership EBITDA was $56.6 million, which includes approximately $700,000 of noncash unit-based compensation and environmental remediation costs associated with the East Coast Terminals. During the first quarter, we spent approximately $1.4 million in total CapEx, including roughly $1 million for maintenance. For the full year 2022, we currently expect capital expenditures to be approximately $14 million, including $12 million for maintenance and $2 million of regulatory spend. Consistent with our commentary on the PBF Energy earnings call this morning, our near-term efforts are focused on a successful refinancing and credit extension of the revolver and unsecured notes due 2023. I guess if you think about the current pace of deleveraging, you guys just took down another $25 million; that phase continues, it looks like the credit facility will basically be repaid in about 3 quarters. I'll take the first, and then Erik can take the second, which is, obviously, we're in the midst of historically disruptive times in the world and to predict what the world is going to look like in a year is not selling in our purview at the moment. And as we sit here today, we are trying to balance what the appropriate level of floating rate along with fixed rate debt, at the same time, matching up tenor with contract life. And ultimately, the overall mix between revolving debt that can be borrowed paid down versus term debt that ultimately has an unsecured structure, assume some type of no-call provision, but we believe there are multiple ways to finance PBF Logistics. So our view has been, let's get priority #1 done on the large ABL, and then we will be able to transition and use that positive momentum with a successful refinancing effort on PBF Logistics. I imagine you've got escalators in your contracts to help pass that on, but just curious if you're seeing any impact yet. And we've been working certainly with and we'll continue to work with our largest customer being PBF to make sure that we've got a relationship that works on both sides, but it's been manageable from PBFX as a perspective. This concludes today's conference, and you may disconnect your lines at this time."
}