{
    "symbol": "GTES",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:20:04",
    "content": " At this time, I would like to welcome everyone to the Gates Industrial Corporation Q4 2022 Earnings Call. Good morning, and thank you for joining us on our fourth quarter and full year 2022 earnings call. I'll briefly cover our non-GAAP and forward-looking language before passing the call over to our CEO, Ivo Jurek, who will be followed by Brooks Mallard, our CFO. Before the market opened today, we published our fourth quarter 2022 results. On this call, we will refer to certain non-GAAP financial measures that we believe are useful in evaluating our performance. Reconciliations of historical non-GAAP financial measures are included in our earnings release and the slide presentation, each of which is available in the Investor Relations section of our website. Please refer now to Slide 2 of the presentation, which provides a reminder that our remarks will include forward-looking statements within the meaning of the Private Securities Litigation Reform Act. We'll be attending several investor conferences over the next month, including the Citi Global Industrial Tech and Mobility Conference, the Barclays Select Industrial Conference, and the Evercore ISI Industrial Conference. With that, let's start on Slide 3 of the presentation. Underlying demand was stronger than expected in North America and EMEA, especially during the second half of the quarter and more than offset the COVID-induced slowdown in China. Importantly, our conversion of orders improved as supply chain inefficiencies ease in the latter part of the quarter, particularly in Europe. We exited the year in a more balanced position with supply, meeting the underlying demand. Our profitability in the quarter improved nicely versus prior year and the resulting margin expansion was consistent with the guidance provided in November, while volume growth contributed to margin performance. We incurred incremental costs to convert past due orders, which modestly impacted the profit flow through. Free cash flow to adjusted net income was well in excess of 300% and benefited from the outline margin improvement as well as higher working capital terms, driven by inventory reductions. Our total revenue was $893 million, which represents core growth of 16% versus the prior year period. We experienced double-digit core growth in nearly all end markets, led by personal mobility, which grew 41%, followed by our Energy and Off-Highway market, which collectively grew approximately 20% year-over-year. In general, we saw stable demand trends with improvements in our fill rates as we move through the second half of the quarter. Fourth quarter adjusted EBITDA was $166 million, which translated to an 18.6% adjusted EBITDA margin and an increase of 150 basis points year-over-year. While we are not completely past supply chain challenges, we are encouraged by the stabilization experienced in the fourth quarter. Our operating income was up significantly year-over-year, contributing approximately $0.10 per share. However, tax headwind of $0.15 per share more than offset the improvement. The Power Transmission segment produced revenues of approximately $552 million in the quarter, driven by nearly 15% core growth year-over-year, offset by an 8% FX headwind. Similar to enterprise, Personal Mobility, Off-Highway and Energy were the leading growth engines for the segment. Our Fluid Power segment posted revenue of $341 million, including 18% core growth and negative FX impact of 3%. We realized solid growth in all end markets with Automotive, Off-Highway and Energy being the outperformers. The result of investments made in 2018, our existing capacity is sufficient to support our growth aspirations via new product development and market expansion well into the future. Our segment profitability improved nicely, fueled by a 45% incremental margin on higher revenues and included improved price cost dynamics compared to the prior year period. Our overall fourth quarter growth rate benefited from relative strength in North America and EMEA, our largest regions. In North America, we realized double-digit core growth in nearly all of our markets, led by Automotive and Off-Highway with each grew more than 20% year-over-year. Our Personal Mobility business grew nearly 80%, the highest quarterly growth rate we experienced in 2022. Finally, our markets in South America and East Asia and India performed well, delivering accretive core growth rates. In aggregate, we were pleased with the growth trends and improvement in supply chain fundamentals. On Slide 7, we show details on our cash flow performance and balance sheet. Our free cash flow was $226 million, which was 317% of our adjusted net income for the quarter. During the quarter, we strengthened our capital structure by paying off our ABL revolver and issuing a new dollar denominated term loan with a maturity in 2029. For 2023, we are initiating guidance for core growth to be in the range of 1% to 5% year-over-year. Within that framework, we have factored flattish volume versus 2022. We continue to see solid demand trends in the early part of the year, providing near-term visibility. That said, we anticipate our customers will rebalance their inventory levels in the latter part of the year because of improved supply chain reliability. At the midpoint, this guidance implies about a 90 basis point increase in adjusted EBITDA margin year-over-year. For the first quarter, we anticipate total revenues to be relatively flat and in a range of $880 million to $910 million. Next, on Slide 9, we provide an adjusted earnings per share wall from fiscal year 2022 to 2023. Relative to 2022, our forecasted adjusted earnings per share is affected by non-operational items such as higher interest expense and a higher expected effective tax rate. Productivity and an improved supply chain, which was a headwind in 2022 are expected to contribute nicely to our earnings growth in 2023. On Slide 10, I would like to provide a brief summary view. Specifically, I would like to highlight the following points. We were pleased with our execution in the fourth quarter, while managing through a challenging business environment. Price cost is in equilibrium on a margin basis, and we intend to protect our margins, should inflation trends escalate versus expectations during 2023. That said, we experienced solid order trends exiting Q4 and through January. Before we take your questions, I would like to review the opportunities we are focused on to enhance our performance and drive shareholder returns as we pivot to the future. First, we are intently focused on several productivity measures ranging from bolstering our supply chain to driving incremental efficiencies in our manufacturing operations. Second, we are accelerating the reduction of complexity across our enterprise by streamlining our product portfolio and minimizing customer complexity below and above the line as part of our 80-20 initiative. In the second half of 2022, we initiated projects in our auto replacement business and have begun to see early returns from the deployment. Third, we continue to invest aggressively in our highest growth areas. As such, you should expect our automotive OEM revenue, mix to get further diluted as we continue to execute on our selective participation strategy over the next few years without affecting the overall growth profile of the enterprise. Lastly, we are highly focused on delivering consistent free cash flow conversion in order to continue to improve our balance sheet. With that, I'll now turn the call back over to the operator to begin the Q&A. Look, from the inventory perspective, I would say that presently, we continue to see the inventory levels to be in line with the underlying market demand. We've seen a pretty resilient strength in the overall markets, and we have very aware of the macro. We are very focused on staying and paying close attention to what's happening in the overall global macro and so we are monitoring the POS reporting from our largest distributors very, very closely. Now on the last call, I've indicated that we see somewhat uneven performance, particularly in the industrial replacement market. And while in one month, you may feel like you are finally starting to see some deceleration, in the next month, order trends reaccelerate nicely. So presently, we feel comfortable with the level of inventories there in the channel, but we are very aware of the fact that as supply chain stabilizes, lease time starting to shrink, we believe that the inventory level in a channel will start to be reduced. And so our view is that we are likely to see that in the second half of the year, and that is what we have taken into account in our guidance. And then, in the second half, as Ivo said, that's when we expect to see more of the rebalancing of inventory. No big impact from one quarter to the next, but just different things that offset the -- or different headwinds that kind of hit the core growth number as we move through the year. Your line is open. In other words, you guys just trying to take a little bit more of a conservative approach to what the end markets look like in the back half of the year given lower visibility. And while we have obviously reasonably constructive on things like energy and automotive replacement for the obvious reasons, I mean, people are driving more low unemployment levels, people have plentiful of jobs. We believe that those trends will -- and very aged car fleets, we believe that, that bodes really well for an end market like automotive replacement. And we believe that as the supply chains are improving, I think customer in a natural way are going to try to ensure that they deliver a decent cash flow. So I think that, that's been a tough part in 2022 for everybody. Obviously, it's encouraging to hear that there was more stability emerging on the supply chain side. Obviously, there's going to be some different dynamics on the volume side as you work through the year. Well, certainly, I think the comps as you move through the year, year-over-year. And then as you move through the year, we had more of the headwinds in the second half of the year relative to some of the supply chain stuff. But as we move through the year, if you think about our full year guidance, at the midpoint, our gross margins will be up over 100 basis points, that will be offset from by SG&A, which has some variable comp element to it, which kind of gets us to that midpoint number of 90 basis points to 100 basis points of improvement year-over-year. Your line is open. Look, I mean, Europe was a very strong performance for us and it was predominantly driven by Energy, Off-Highway and Personal Mobility. But all of our end markets, frankly, in Europe are very solid. Our overall auto business was up in the teens, driven by automotive replacement, strength in automotive replacement. As I had discussed on my prepared remarks, we were able to secure a little more raw materials and that gave us the opportunity to catch up to some age backlog, particularly in the auto space on the PT side. And so just a terrific quarter that the team has executed very well and the end market demand remained very resilient and maybe just -- very the follow-up question, I mean January, January was quite strong as well. As you -- as we see what's going on with inflation, as we see what's going on with our cost, the material cost and the energy costs, freight costs, things like that, I think you're probably a little hot on the price side. Certainly, will be a little bit higher on price in the first half of the year as opposed to the second half. And then I think you also have to remember that in the first half of '22, we also had the China and the Russia headwinds that are going to continue to be there. And you can kind of do the math, if volume is flattish, then the price is kind of in the low to mid-single digit kind of range. Your line is open. Just wondered if you could parse out a little bit the free cash flow guide because I think the guide embeds sort of net income, not growing much in 2023, but free cash flow is up about $150 million and CapEx is up a bit. So look, I think on the net income side, there are some moving parts in 2022, particularly relative to tax, cash versus GAAP tax. We certainly think we're going to see improvement in working capital year-over-year, primarily driven by inventory. And then everything else is kind of flowing through, but tax is a big piece of it, the GAAP tax versus the cash tax in '22 versus the GAAP tax and cash tax in '23 is a big part of what's generating the additional cash flow as we move from one year to the next, along with the inventory reduction. Well, I mean, when you look -- I mean, cash taxes from a percentage perspective is relatively unchanged year-over-year. And then I suppose, secondly, maybe one more for Ivo. But when you're looking at China, it was down for obvious reasons in Q4 and last year as a whole. Maybe help us understand how you're thinking about the volumes in China, the balance of the year. Obviously, 2022 was very challenging in China with the second quarter shutdown -- full shutdown in Shanghai and then, obviously, the end of the year impact from first COVID restrictions and then reopening and the infections that rolled in. Firstly, the first couple of weeks, pretty -- still pretty significantly impacted by COVID, and then you rolled right into Lunar New Year. So we have seen very little activity in January, but the activity is coming back. So we anticipate that Q1 is still going to be down, I would say, kind of in the high-single digits year-on-year, maybe 10% just for the sake of conversation. And then we anticipate that you're going to see a pretty strong rebound in Q2, predominantly because of the comps. Obviously, Q2 of last year was very weak, as I have indicated. But the second half of the year should normalize volume-wise and we actually anticipate that we will see a positive impact from China for the year, but we really need to see February before we can start getting more confident about how that's going to develop. And let me kind of follow up on one thing on the cash flow, too. I think what you also have to remember is over the past couple of years, we've seen a significant increase in working capital, and that's what's driven the cash conversion below 100%. And so while we're going to get better on working capital certainly in 2023, I think just the fact that you're not increasing it as much as you have in the last couple of years, is going to drive the most significant part of that improvement in conversion. Your line is open. Even last quarter, you still sounded reasonably pessimistic about supply chain headwinds clearing quickly, especially in terms of polymer supply. I think last quarter, you mentioned 300 basis points to 350 basis points of headwind on the top line. Look, Q3 was a really challenged quarter. Q4 has gotten definitely better, but we started very slow recovery of the raw material supply. And as I said on the 3Q call, it says, look, our suppliers are actually able to make it more reliably, but we were not able to get it into our factories. It cost us a little bit of money, as I've indicated in the prepared remarks. So my anticipation, Andy, is that we are seeing improvements -- gradual improvements in our suppliers' ability to make these highly engineered resins, but we're still somewhat cautious about having a real predictability in the first half of the year vis-a-vis getting it in the factories as we need to get them through the normal means of transportation. And then last quarter, you talked about, I think, a $45 million footprint rationalization plan. Look, on the productivity improvements, again, I'll come back to kind of the performance that we have seen in 2023. So obviously, when you are struggling getting enough raw materials to keep up your factories operating, it becomes very difficult to actually absorb all the overhead in these facilities as you well know. But more importantly, to be able to get any traction on your kind of standard normalized productivity programs that you have, Lean, Six Sigma, whatever the flavor that you like to call, we call it, the GBS system here. And so we anticipate that if the factories start operating much more normally, we can get pretty aggressively back into the kind of a normalized rhythm of driving productivity as we have demonstrated that we do in the past. And so the headwind would give you actually the ability to kind of revitalize, if you would, your productivity efforts. Your line is open. I just want to go back to 1Q, that the guide for 1Q in a bit more detail. Maybe just looking at it from a sequential basis, looks like sales are pretty flat at the midpoint versus normal history where we have a pretty pronounced uptick into 1Q with the -- obviously, the Off-Highway season. So I'm just curious if maybe the good news on supply chain and that backlog conversion we saw in 4Q, whether that's the offset that I'm kind of asking about here. Look, I would start with, as I've indicated, China down about 10%, and you have a full quarter of the Russia exit. And obviously, if China suddenly gets dramatically better and we are under calling it, we anticipate that the pole would get better, but I haven't seen it in January. And then as I said, we are still facing a little bit of supply chain issues, and we are probably a little bit gun shy on being able to declare a victory on supply chain until we see that stability to become repeatable throughout certainly a couple of the first quarters of 2023. But as I said in my prepared remarks, Nigel, we had a really nice catch up to some past due orders that we have delivered on in Europe, in Power Transmission, and that's kind of would have given us a little bit of an outperformance in Europe in particular. So while order flow remained very robust and the book-to-bill remained above one, I would just caution to -- for everybody to extrapolate that exactly what happened in Q4 in Europe because of the catch-up. I mean if you get to that 100% plus conversion, you've got the kind of â\u0080\u009cproblem of capital deployment, which is a good problem to haveâ\u0080\u009d. So look, we've made a commitment in the midterm to get to 1.5 times leverage. And so as we continue to generate cash, we're going to lock in some of that lower leverage by continuing to pay down debt, reducing GAAP interest, reduce cash interest, certainly over the short term. The capital allocation, for us, we're always going to look at different opportunities and figure out what is going to pay back the shareholder the best. We do believe we need to continue to pay down debt though and reduce not only our leverage, but our gross debt as well. And so I think in the short term, that's what we're focused on. Your line is open. You mentioned strong orders, I think, a few times, maybe just put a finer point on that. Look, we've trimmed some of our past due backlog in the quarter, particularly in Europe, and we've taken a pretty nice chunk from the aged backlog there. Interestingly enough, in January, past to backlog start jumping back up on the strength of order flow. And we just got to see a better flow through of raw materials to ensure that we can keep up properly with -- not only with the flow of orders, but also recover some of the aged backlog that we hold to our customers. Clearly, as a book-to-bill business, not only we not like having age backlog, but we really don't like to have an elevated backlog period. And then I guess just on kind of the surge that you've seen in the fourth quarter, the supply chain improvement, the solid orders. Like, is the strength that you're seeing on the order side sort of representative of, hey, everyone can get more supply. So they're pulling back -- pulling through more product through the supply chain as a whole, but like demand never really changed. And I spent quite a bit of time talking to our customers particularly at this point in time with the volatility and, obviously, watching the macros and watching all the indices that are out there and being very cognizant of the trends that we are seeing, but the general feedback that I'm receiving is reasonably positive. And so when we kind of talk about underlying market demand, we just want to make sure that folks understand that we are looking at it globally, not just from a North America perspective. So at this point in time, I would say that we are very watchful and what is happening in the diversified industrial in the industrial replacement channel. Again, I said it a couple of times, Josh, that's choppy, it's uneven. But I'm just very, very focused on ensuring that we don't miss some trend line and we end up calling it wrongly. But so far, it's been reasonably positive in general. Your line is open. So really, if I do the math, it seems like incremental margins are high 40s. So as Ivo said, there were some encouraging signs, I think, as we work through Q4, but we're not out of the woods yet. If you think about our margins as we move from '22 to '23, core growth at the midpoint is 3%. We would expect to see less fall through on that as it's mostly price cost, and we've said that we're trying to maintain EBITDA margin neutrality as we move through. So I think you're thinking about it the right way in terms of the gross margin improvement not only from the supply chain improvements, but from productivity as well. And then just back on this, the down low-single digit for market for industrial, the industrial and diversified industrial. And I think Ivo, you mentioned choppiness. Maybe just talk, one, about outgrowth. And two, just if you're seeing it equally between the FP and PT side. Again, it's one month and maybe down next month and maybe up. So right now, what we see is that the sell-through from customers remain very, very robust. And as people start getting more comfortable with lead times, I mean, that you will see some movements in order flow, not necessarily driven by weaker demand. And again, we have not seen weaker demand yet from the POS reports, but I think people are just making sure that, on one side, they don't have too much inventory on the other side, they don't have too little. So I would say thatâ\u0080\u0099s probably to one area that we are very, very instantly watching. And -- but that being said, there's also an opportunity as people are getting more raw materials that also could result in higher demand generation because people are simply able to just get everything that they need, which wasn't the case throughout 2022. So we are reasonably balanced in our view as to what we anticipate throughout 2023, particularly in the industrial replacement market. And while we don't want to call it down dramatically, we also don't want to be in a situation where we miss any potential uptick that maybe should the market conditions remain robust. I mean you have the infrastructure investment and you need lots of construction equipment, you're going to be building lots of industrial automation equipment. So we are optimistic about the underlying trend line, but we also want to be realistic about what is happening with ISM and with some of these indices that are being reported on. I know mobility has been something that you've called out, but changed about a big opportunity on the industrial side. So look, I mean, I'm not going to spend much time on mobility, but I think this is a perfect example of how we are driving an organic evolution of our portfolio. Again, I remind everybody that in kind of in 2019, it was kind of a $25 million business, and we kind of exited that -- we exited the year kind of  $200 million run rate, so growing at kind of 10 times in 3.5 years. Now we don't expect to be growing at 10 times over the next 3.5 years, where we are very optimistic about continuing to deliver kind of mid-20s growth rates in mobility and pretty quickly catching up to the size of our end market contribution that we generate in the auto OEM space as an example. Obviously, I've spoken about our Fluid Power business, our innovation available capacity continues to give us an opportunity to outgrow the end market, but those underlying markets, Jeff, are also very robust. Certainly, in North America, Ag, Construction, Heavy-duty, very robust markets. And then I've highlighted that, we've had a very strong growth in our Automotive business with Fluid Power as well. So it's generally speaking, we are very confident about our ability to outgrow the market. And we've demonstrated over the last five years, three years and certainly the last couple of years that we are capable of outgrowing our underlying end markets globally. So maybe a long-winded answer, but maybe providing you a little more color. Your line is open. I guess just a key assumption, maybe headwinds or tailwinds that are worth calling out. Yeah, it would be really helpful if you just kind of give us a walk around the globe for auto and that you expect this year. So as you recall, Automotive OEM business is less than 10% of our revenue presently. And so, look, we anticipate that the overall production is going to be slightly net positive. But you also have to take into account some of the challenges that folks are going to have buying new automobiles when you take into account the increases in prices of new vehicles and, frankly, the interest rates. So while the carmakers may be more capable of producing, will you see some decay of demand in the end market affordability index that I don't know, I'm not an economist. But our view is that globally, you should see Auto OEM builds up kind of slow to mid-single digit. And frankly, we anticipate that we should see low-single digit end market growth. Obviously, a very aged car fleet, high miles driven, high levels of employment bodes well for folks maintaining their vehicles. I think you can see it in some of the reports already that people are starting to drive significantly more than, frankly, they have driven over the last two to three years at an expense of even public transportation. So the setup for automotive replacement business is very strong for 2023 as the situation normalizes, particularly in the supply chain, this should be a net positive for Gates. Yeah, Damian, I think it's very difficult to forecast. Firstly, when and/or if it's going to occur, is it going to occur in second half or is it going to spill into 2024. Again, I will repeat that we are very intensely focused on owning all the trends. The POS trends remain positive, but we are being cautious with our approach for the year. And certainly, one should anticipate that as the supply chains normalize, you probably should anticipate that folks will be optimizing their working capital levels. Your line is open. First, Ivo, you didn't mention it, but I was hoping you have good news about your operations in Turkey with the impact of the earthquake. And then just lastly, you mentioned share gains in Fluid Power. So as we have discussed, we continue to drive our contribution of new products as a percent of revenue up. So as you will recall, we have highlighted that our aspiration is to get kind of to 20% NPI vitality by 2023 across our portfolio. And maybe the follow-on question is, so where you in Power Transmission. In PT, we're kind of in the mid-teens. And as I've highlighted in the past, we are now very laser-focused on revitalizing our portfolio in PPN, we're making good progress on that as well."
}