{
    "symbol": "TOI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 23:10:20",
    "content": " At this time, I'd like to turn the conference over to Mihir Shah, Chief Financial Officer at TOI. Good afternoon, everyone, and thanks for joining us to discuss to TOI's first quarter 2022 results. Before we begin, we would like to remind you that this conference call will include forward-looking statements. These statements include our future expectations regarding financial results and guidance, market opportunities and our growth. These risks, uncertainties and assumptions are detailed in this afternoon's press release, as well as our filings with the SEC, including our registration statement on Form S-1 that was filed with the SEC, and the Form 10-Q, all of which can be found on our website at investors.theoncologyinstitute.com. During our call today, we will also reference certain non-GAAP financial information, including adjusted EBITDA, free cash flow and adjusted diluted EPS. We use non-GAAP measures in some of our financial discussions, as we believe they more accurately represent the true operational performance and underlying results of our business. To support our growth and expansion, we continue to enhance our leadership team in the first quarter. During the past quarter, TOI has made significant progress in addressing the rapidly rising cost of oncology care by executing on our growth strategy. To that end, we recently announced results from our participation in CMS’s Oncology Care Model program, or OCM. Since the start of that program in 2016, TOI has driven savings for Medicare of $9.5 million exceeding our target savings by $5.3 million. In addition to meaningful cost savings, TOI demonstrated above average quality performance based on its aggregate score. I'm very proud of our results in this program, as it speaks directly to TOI's track record of achieving better outcomes for patients at lower cost. TOI continues to support the advancement of oncology payment, design and care delivery. Starting March 1, we entered into a value-based contract with MaxHealth to provide medical oncology care to patients in Pinellas and Hillsborough counties. TOI recently acquired Women's Cancer Care in Fresno, a highly regarded breast and gynecological cancer practice founded by Dr. Christopher Perkins more than 20 years ago. Some other highlights on our progress this past quarter include we opened our sixth Florida clinic in Lakeland, Florida. We opened a DeNovo clinic in Culver City, California, our 22nd clinic in the Los Angeles market and our first in West Los Angeles, allowing us to expand our model further into this important region. After acquiring the radiation oncology practice of  in the fourth quarter, we've been working to expand that location, allowing us to serve more patients in the Long Beach area. And finally, we continue to grow our clinical team adding five new clinicians in the first quarter of 2022. Overall, we're pleased with the progress we've made over this past quarter, and we continue to be optimistic about the expansion of our unique model of oncology care. Starting with the top line, we achieved $55 million of total revenue in the first quarter, a 13.5% increase year-over-year. We continue to integrate the four practice acquisitions and Acqui-hired that we close in the fourth quarter, which contributed approximately $3 million in the period. As we discussed in our year end conference call, we made strategic decision to terminate a large payer contract in late 2020, and this impacted our year-over-year revenue growth in the first quarter. Absent this termination, our revenue growth in the first quarter of 2022 would have been 19.6%. For the first quarter, our gross profit was $12 million and our gross margin was 22.3%, a 1.3% increase over the prior year period. On a GAAP basis, our net income was $19 million for the quarter. For the quarter, our adjusted EBITDA was negative $5 million. When we talk about our adjusted EBITDA, we are not adjusting our clinic or provider startup or acquisition costs as part of this metric. At quarter end, our cash balance was $96 million. For the full year 2022, we are guiding to a revenue range of $270 million to $310 million, representing 33% to 53% growth over 2021 revenue. We continue to make targeted investments in our corporate infrastructure in particular, those related to public company costs and to support our growth. We want to reemphasize that we are not adding back D&O costs to adjusted EBITDA, nor are we adding back any start up costs related to new sites or new providers. In summary, the progress we’ve made in the first quarter are important steps to delivering on our strategy in 2022, a critical year for TOI to demonstrate its model of oncology care in new markets and new service lines. As we continue to expand our footprint and reach more lives, we believe the continued shift to value based care will drive momentum in our business in the near and long term. As we look to the rest of 2022, we are excited about the opportunities ahead to further grow our business, expand our markets and deliver excellent care to more patients and communities. Lastly, we are pleased to announce that our Board of Directors has authorized a share repurchase program for up to $20 million of the company’s common stock through December 31, 2022. Brad, I guess, my first question just on the MaxHealth partnership announced earlier this month, maybe if you can share with us just any color on the structure of that deal and how you're thinking about the opportunity there, and maybe your ability to replicate that, is that the model that we should be thinking about as you expand further into new geographies. It's a gain share agreement where MaxHealth will create sort of two populations of patients: one of which would be the control group, which are patients that are not treated by TOI in that region; and then the intervention group of patients that are treated by TOI. And then over the performance period, MaxHealth tracks the quality and cost and outcomes associated with the patients that we treat. And if we are able to generate savings compared to the control group, while also achieving the quality metrics that we're accountable for then we can share in those savings that we have created. Yes, so, I think, one of the things I was most pleased about in the first quarter was the progress we made on gross margins. So that should continue to translate, a lot of the gross margin benefits in addition to being smarter about our drug purchasing, just the benefits of scale of buying more drugs generates additional scale purchasing discounts. So yes, the Medical Rx transition did negatively impact our growth in our dispensary in the first quarter. So we'll launch our own pharmacy, which will enable us to again begin to fill those scripts for the Medical patients that we previously were able to fill and that at currently at the moment, we're not able to fill; we have a couple of other strategies that we're pursuing as well. We're really excited about TOIs path ahead, and we look forward to updating y'all on our progress on our next earnings call."
}