{
    "symbol": "TOI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 16:40:57",
    "content": "  Operator: Good afternoon, and welcome to The Oncology Institute's Second Quarter 2022 Earnings Conference Call. At this time, I'd like to turn the conference over to Mark Hueppelsheuser, General Counsel at TOI. Before we get started, I would like to remind you of the company's safe harbor language. This call will also discuss non-GAAP financial measures, such as adjusted EBITDA. Before we get into the quarterly details, I'd like to bring your attention to an important development that we expect to give us the financial runway we need to achieve our growth plans. We completed a $110 million strategic investment from Deerfield Management, through senior secured convertible notes. The convertible notes bear interest at 4% per annum and mature on August 8, 2027 and are convertible into shares of the company's common stock. The notes have an initial conversion price of approximately $8.57, representing an approximate premium of 30% over the closing price of TOI's common stock on August 8, 2022. This investment will provide TOI with important growth capital to continue our expansion into new markets, with our differentiated value-based approach to oncology. We remain highly optimistic about our future and we are excited about this new investment from Deerfield, one of the most active and experienced health care investors in the country. As we've discussed before, practice acquisitions and acqui-hires, continue to be an important component of our growth strategy. We completed the acquisition of Women's Cancer Care, the Fresno California practice of Dr. Perkins and Dr. Ge, this May. We completed the acquisition of the Las Vegas practice of Dr. Parikh in July and we completed the acquisition of the Orange County California practice of Dr. Sapra, also in July. These acquisitions expand TOI's network of 93 specially trained physicians and advanced practice providers, across 57 clinics in five states. The addition of Women's Cancer Care opened a new market for TOI, Fresno County and we are optimistic about the growth opportunities for TOI in that market. Our unique model for oncology care is gaining traction in our expansion market, signaling increased need and desire for a more cost-effective solution like ours. We recently opened our 13th market with our expansion into Austin, Texas, where we opened two new specialty cancer clinics, one of which went live in June and one in August. The clinics offer comprehensive medical oncology services, designed to expand access to state-of-the-art oncology care for ARIA patients and will increase access to leading clinical trials cutting-edge programs and exceptional oncologists. Our participation in CMS' oncology care management program or OCM, continues to generate meaningful savings. Since the start of the program in 2016, TOI has delivered Medicare savings, approximately $9.5 million, exceeding target savings by $5.3 million. In the most recent OCM performance period, TOI saw savings of close to $4,000 per patient episode. In addition to these meaningful cost savings, TOI demonstrated above average quality performance based on its aggregate score. I'm very proud of our results in this program, as it speaks directly to TOI's track record of achieving better outcomes for patients at a lower cost, an important validation of our differentiated value proposition. While the OCM model ended on June 30, 2022, CMS has announced a new model that replaces OCM. TOI continues to support the advancement of oncology payment design and care delivery and we believe, we're leading the way for the adoption of more value-based models of oncology care nationally. First, TOI joined the Russell 2000 and Russell 3000 indexes on June 27, an important milestone for us as a public company. And finally, we welcomed several new leaders to TOI; including Melissa Campenni, VP, Strategic Partnerships; and Dave Goodman, VP, Talent Acquisition. Overall, we are pleased with the progress we've made over this past quarter and we continue to be optimistic about the expansion of our unique model of oncology care. We generated $61 million of total revenue in the second quarter, a 22.2% increase year-over-year and a 10.4% increase compared to Q1 2022. As we discussed on our year end results conference call, we made a strategic decision to terminate a large payer contract in late 2020 and this impacted our year-over-year growth in the second quarter. Absent this termination, our revenue growth in the second quarter of 2022 would have been 25.8%. For the second quarter, our gross profit was $11 million and our gross margin was 18.3%, a 2.3% increase over the prior year period. On a GAAP basis, our net loss was $5 million for the quarter. At quarter end, our cash balance was $64 million. With the convertible debt deal that Brad discussed, we will have approximately $170 million on a pro forma basis. For full year 2022, we continue to expect revenue to be in the range of $270 million to $310 million representing 33% to 53% growth over 2021 revenue. Although, the policy was not intended to change the way physician administered chemotherapy drugs built under the Medical benefit are reimbursed in the early part of the year certain Medical managed care plans nevertheless began to transition some of these claims to be payable as pharmacy benefit. With respect to our dispensary, we have historically dispensed oral oncolytics to certain medical patients and some of the scripts are now being covered under Medical Rx insurance, which we are not currently able to fill. In summary, TOI continue to make important strides in our effort to be the leading value-based oncology provider in the country. By adding two new markets and several acquisitions, we are bringing our unique model of care to more patients and more communities. And with the recent $110 million investment from Deerfield, we have more resources and tools to execute on our growth strategy. So Brad in our 10-Q â\u0080\u0093 and Taji in our 10-Q, we do provide the breakout of the fee for â\u0080\u0093 the capitation â\u0080\u0093 sorry, the three different types of revenue patient services revenue is broken down in our 10-Q. But some of the revenue we bill fee-for-service because if we're not capitated for all the services we provide, some of the services that we provide might be billed fee-for-service. So while there are always hard to staff areas and in a national physician practice, there's always going to be some area where we wish we had more doctors or more demand. And as we've gone public and we've had a higher profile and more and more people are hearing about us and learning about what it's like to practice medicine at TOI, we've actually benefited from that and are feeling really good about position demand from a hiring perspective."
}