{
    "symbol": "TOI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 07:53:02",
    "content": "  Operator: Good afternoon, and welcome to The Oncology Institute's Third Quarter 2022 Earnings Conference Call. Today's call is being recorded, and we have allocated one hour for prepared remarks and Q&A. At this time, I'd like to turn the conference over to Mark Hueppelsheuser, General Counsel at TOI. Before we get started, I would like to remind you of the company's safe harbor language. Management may make forward-looking statements, including guidance and underlying assumptions. Joining me on the call today is our CEO, Brad Hively; and our CFO, Mihir Shah. Following our prepared remarks, we'll open the call for your questions. Thanks Mark, and thank you to everyone joining the call today, where we'll discuss our third quarter results. We added five new clinics in the quarter, including the acquisition of Dr. Parikh's two Las Vegas clinics, the acquisition of the Fort Lauderdale, Florida practice, Broward Oncology Associates and de novo openings in California and Texas. This growth expands TOI's network of over 100 specialty trained physicians, advanced practice partners to 60 clinics across 5 states. Our unique model for oncology care is gaining traction in our expansion markets, signaling an increased need and desire for a more cost-effective solution like ours. As mentioned, we recently opened our 14th market with our expansion into South Florida, with the acquisition of Broward Oncology Associates and the announcement of a new de novo clinic in Plantation opening in December. First, TOI received a $110 million strategic investment from Deerfield Management on August 9, 2022, in the form of convertible notes. Second, TOI received the Agency for Healthcare Research and Quality certification as an accredited patient safety organization. We're very proud of this certification as one of our key company tenets is creating a culture of safety, where our teammates feel empowered to provide input to continue to elevate patient quality and care. Third, we're making good progress working through remediation of issues related to SOX compliance as we continue to strengthen our public company infrastructure and procedures. And fourth, we welcomed several new leaders to TOI, including Cristina Green as Vice President of Clinical Research; and Philip Reger, in the newly created Chief Information Officer role. Both Cristina and Philip will play critical roles in our growth strategy as they lead our clinical trials business and IT strategy, respectively. Overall, we're pleased with the progress we've made over this past quarter and we continue to be optimistic about the expansion opportunities for our unique model of care. While we're making important strides as we continue to expand, we have experienced slower-than-expected revenue growth primarily related to delays in closing acquisitions. As a result, we are updating our full year 2022 guidance, which Mihir will outline in more detail. To ensure that our cost structure remains aligned with our revenue growth, we are taking a multi-pronged approach to controlling costs, including reduction of vendor and contract spend and a difficult, but necessary workforce reduction. Now, I'll turn the call over to Mihir to provide additional detail on our third quarter financial results. For our top line, we generated $65 million of total revenue in the third quarter, a 24.3% increase year-over-year and a 6.7% increase compared to Q2 2022. As we discussed in our 2021 year-end conference call, we made a strategic decision to terminate a large payer contract in late 2020, and this impacted our growth in the third quarter. Absent this termination, our revenue growth would have been 27.3%. For the third quarter, our gross profit was $13 million, a 13.8% increase over the prior year period. On a GAAP basis, our net loss was $3 million for the quarter. For the quarter, our adjusted EBITDA was negative $6.7 million. At quarter-end, our cash and cash equivalent balance was $61 million, and we had $87 million in investments. We are lowering our full year top line guidance to a range of $245 million to $250 million, primarily due to delay in closing of acquisitions. Additionally, while we have seen our gross margin improve throughout the year, gross profit is coming in lower than original guidance due to lag in revenue. Therefore, we are lowering our gross profit guidance to a range of $45 million to $50 million and our adjusted EBITDA guidance to the range of negative $25 million to negative $28 million. Despite these near-term headwinds, we have continued to invest in our business supporting our long-term growth trajectory. As a reminder, in January 2022, Medi-Cal implemented a new policy regarding reimbursement of pharmacy services. Although, the policy was not intended to change the way physician administer chemotherapy drugs billed under the Medi-Cal benefits are reimbursed in the early part of the year though Medi-Cal Managed Care nevertheless, began to transition some of these claims to be payable as a pharmacy benefit. During the first three quarters of 2022, we saw minimal impact in our IV chemotherapy drug reimbursement. With respect to our dispensary, we have historically dispensed oral oncolytics to certain Medi-Cal patients and some of the scripts are now being covered under Medi-Cal Rx insurance, which we are not currently able to fill. We continue to actively assess opportunities to mitigate the impact on our business going forward, including launching or acquiring a pharmacy. We want to reemphasize that we are not adding back P&L costs to adjusted EBITDA, nor are we adding back any start-up costs related to new sites or new providers. In summary, TOI continues to make important strides in our efforts to be the nation's leading value-based oncology group. By expanding into new markets and completing several acquisitions in the quarter, we are continuing to make good progress in bringing our unique model of care to more patients and more communities. And with the recent $110 million investment from Deerfield, we have more resources and tools to execute on our growth strategy. And with that, I'll turn it back over to the operator to open it up for questions. I guess, Brad, I'll start by asking, first, as I look at the capitated revenue number that you reported for the quarter, that's down year-over-year. That's a good question, Brian. Like I mentioned, we're trying to be very disciplined with our M&A strategy. And we could have paid more and acquired more practices, but we've been disciplined and as a result that the amount of acquired revenue has fallen below our expectations. So we'll mostly catch up, I think on an exit trajectory but not completely. So, it's certainly something we focus on like a laser here. When we lowered the adjusted EBITDA targets, that does mean we are burning a little bit of additional cash versus our previous estimates. When you look at the amount of cash and cash equivalents we have on the balance sheet versus a $3 million to $5 million change in adjusted EBITDA guidance, it's a pretty small impact to cash runway. So, we feel like we can execute on everything that we need and want to do right now with the cash we have today. For interest, it's mostly related to our financing that we completed in August from Deerfield $110 million. So, I can follow up with you offline, but overall, the interest for the $110 million at 4% is how you should model overall. So, if you look at our balance sheet, you will see the money -- our cash and cash equivalent in three different places. So, the funds are invested at current rate, which is, as you know, recently we are in a really good interest market. Brad or Mihir, so am I reading it correctly, there is no more unclosed acquisition revenue assumed in the guidance. And then maybe just when I think about the delays, I totally appreciate the prudence. So, I do think that we are being more conservative in our timeline estimates of how long it takes to move potential acquisition from first call to closing. And so, we've started to become just more conservative with how long it takes us on average to move something through the M&A pipeline. Because as we said, we're trying to be very disciplined and only acquire practices that really fit our model. So, the more we can get through the top of the funnel, obviously, gives us a greater selection. And so that's adding staff to our M&A team, doing a more rigorous outreach effort and also being smarter with the data of identifying opportunities and physician practices that we think would fit our model pretty well. People are just sort of like, I don't know what's going on, not doing anything. It's a great question, Sandy. So, we're looking at 15 or 20 practices in our pipeline at any given time. So, I'm careful to extrapolate what we're seeing in 15 physician practices to the overall market. One, it's -- particularly with the labor market, it's -- that really hits the small practices. And with labor costs going up, a lot of times, those small prices don't have the ability to weather those labor cost increases. So, I think those two pieces of the economic situation, I think, have caused some of our practices to be more excited about selling to us. The other thing with a recession, if it comes or just in general, now that we're starting to see the employment numbers go the other way, is sort of a rotation. And so, depending on the practice mix of our targets, those practices that tend to focus a little more on the government-sponsored patient populations may be seeing actually some growth with that rotation. And so, depending on the type of practice that we're looking at, the recession and rising unemployment can actually have a positive or negative impact on the target. I feel like there was maybe one more piece of your question that I didn't get to, but let me stop there. If I just do some simple math on the reduction in EBITDA versus the reduction in revenue, it looks like it's slightly more decremental. We're very excited about TOI's path ahead, and we look forward to updating you on our progress on the next earnings call. Ladies and gentlemen, that then concludes today's conference."
}