{
    "symbol": "ESRT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 18:09:07",
    "content": " We had great results in our portfolio this quarter, including over 320,000 square feet of total leasing major lease expansions by existing tenants and a 25% increase in net effective rents in our Manhattan office portfolio in the second quarter year-over-year and 16% increase sequentially. In the second quarter, we signed 37 new and renewal leases totalling approximately 320,000 square feet, which includes 260,000 square feet in our Manhattan office properties, 57,000 square feet in our Greater New York Metropolitan office properties and 3000 square feet of retail. In the second quarter and through July 21, 2022, the company repurchased $53.7 million of its common stock at a weighted average price of $7.90 per share, a significantly discounted level that presents a compelling opportunity to purchase our shares and benefit from multiple sources of New York City upside that are underway. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. I think itâ\u0080\u0099s, weâ\u0080\u0099re getting a really great response from brokers and prospective tenants, reminder, all of the things that tenants are looking for today, and the focus on in terms of health, wellness, in building amenities, neighborhood amenities, convenience to mass transit, newly built spaces, which weâ\u0080\u0099ve been investing in our portfolio for well before COVID, these are all the things that we provide that attract tenants. Please proceed with your questions. All this conversation about older properties, and everyone's going to the newer stuff, what we said before, not everybody wants to pay a $150, $200, $250 a square foot for office space, or even if they wanted to, they canâ\u0080\u0099t and we are a primary beneficiary their with and itâ\u0080\u0099s shown by the strong leasing we did in the second quarter. Please proceed with your questions."
}