{
    "symbol": "ESRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 19:03:28",
    "content": " Tom Durels will cover our healthy leasing this quarter, which totaled 335,000 square feet with strong mark-to-market spreads on new leases signed in our Manhattan office portfolio. We had another solid quarter, headlined by 335,000 square feet of total leasing volume across our commercial portfolio, which included strong mark-to-market spreads in our Manhattan office portfolio for new leases, steady tenant demand for our prebuilt spaces and over 182,000 square feet of renewals. Notable leases signed this quarter include a 79,000 square foot renewal lease with Franklin Templeton at First Stamford Place and with this most recent renewal and previously signed direct leases with former subtenants of Franklin Templeton, we have now re-leased all of Franklin Templeton's 138,000 square feet that was set to expire in September 2024. We also signed a 59,000 square foot direct lease with Alfred Dunner at 1333 Broadway that formerly occupied the space under a sublet from GBG and an expansion lease with Universal Services of America, who we located within our portfolio from one grand such a place to 5017 Seventh Avenue, where they more than doubled in size to 30,000 square feet and the versus original space at One Grand Central Place is already leased to another tenant. We increased our Manhattan office lease percentage by 110 basis points quarter-over-quarter and 240 basis points year-to-date and we're well positioned to increase our portfolio occupancy, and we continue to see strong fundamentals in our multifamily properties. I'm pleased to provide comments on a solid quarter that emphasizes the competitive strength of our portfolio comprised of quality office assets at accessible price points, the Empire State Building Observatory the number one attraction in the United States, strong everyday retail assets with 95% national retail tenancy and our well-located, amenities multifamily assets. Please proceed with your question. I think it will be more towards the middle or high end of that range, depending on when certain leases commence this year in our -- in the fourth quarter, we only have about 68,000 square feet of tenant move-outs, offset by roughly 0.25 million square feet of leases that are signed that should commence in the fourth quarter or first quarter of '23. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}