{
    "symbol": "BG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 12:48:19",
    "content": " Looking ahead, we're expecting to deliver adjusted EPS of at least $12 per share for the full year 2022, and that's up from the outlook we provided last quarter. As Greg mentioned in his remarks, taking into account our Q2 results, the current margin environment and forward curves, we've increased our full year adjusted EPS outlook to at least $12 per share, a $0.50  per share increase over our previous outlook with potential upside depending on market environment and supply and demand balance. As mentioned earlier, our upside scenario of $12-plus reflects incremental earnings driven by the deployment of available free cash flow towards growth investments in addition to the list of identified projects, as well as incremental share repurchases. But as we look at kind of where the balance sheet is today, kind of you're operating well above that kind of baseline earnings level now, and it sounds like you are pretty optimistic about that environment, certainly in the back half of the year and presumably that would persist into '23 based on the way the market sits, that there's excess capital further that's being generated. So the $12 plus - the $1 plus in the out year is really driven by in the model, looking at our available additional capital that's not deployed today. Now it's about taking digital and a focus on continuous improvement because we're now in a position to do that and to make those investments and whether that's improving our supply chain, making it easier to do business with using you know, the sensing, as well as analytics to drive efficiency into our facilities where we've got tests going where we can now get that - the machine can now outperform our best operator in our plants, and those are things that we'll continue to work forward that will be multiyear improvements that we can work against. And I think that's what we're starting to sense and as things have calmed down, the buyers and sellers went away for a little bit why there was market volatility and now they're kind of starting and saying, \"okay, wow, things really haven't changed on the physical side, and this looks pretty tight to the second half."
}