{
    "symbol": "BG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 11:54:02",
    "content": " As Greg mentioned in his remarks, taking into account our third quarter results, the current margin environment and forward curves, we've increased our full year 2022 adjusted EPS outlook to at least $13.50 per share, a $1.50 per share increase over our previous outlook. And I think when you look at just the front-end demand that we have for soybean oil, refined oil today in a market where perhaps even R&D isn't ramping up as quickly as some people would have expected, we're still very tight and forward demand for soybean oil is very strong. Adam, I just -- I'd add to that, that when you look at kind of where we'll end up for the year based on our current forecast, we are going to be up in processing, which when you look at the environment with COVID impact in China, it's been a relatively tough year, high energy costs in Europe, and the fact that we'll finish up in processing is pretty exceptional. I mean if you look at it today, we're -- we've got -- if you just look at today where our credit metrics are with the rating agencies, a 1.3x for Moody's, for example, that would imply $3 billion to $4 billion of dry powder and debt capacity alone, not to mention what we expect to continue to generate in cash. I don't know if there's any real heavy science behind it other than it's just going to be part of -- we've committed to 250 million a year minimum, and we may not do that on one fell swoop, but there could be times going forward where we have a bigger chunk like what you've mentioned. And so when you look out and typically look at where we lock in the crush going forward X amount per quarter, and usually, there's not a lot locked out beyond, say, one quarter or two, there's been a lot of interest in soybean oil pricing out beyond the next quarter or two and probably more than we've seen. But to Greg's point, I think we're going to see -- we expect to see strong demand further out. It just seems like I would actually think that there's a possibility that, that margin can actually go higher, but you're kind of indicating that $400 million baseline."
}