{
    "symbol": "FBHS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 23:05:27",
    "content": " As the unprecedented supply chain and demand environment of the COVID years begins to dissipate on a trailing basis, our three-year organic sales and operating income CAGRs up 10% and 17% respectively, are proof points of the sustainable long-term value created over this period. Beginning with Water Innovations, sales were down 14% in the quarter as channel inventory reductions and a soft China market more than offset mid single-digit POS growth in the U.S. Upgraded Moen and House of ROHL showroom displays are driving double-digit POS lift and our investments in brand and innovation continue to resonate with consumers and customers. Finally, our Cabinets business delivered another exceptional quarter with sales growth of 20% as our transformational efforts continue to deliver and pricing actions become more fully realized in the P&L. This updated EPS outlook for 2022 includes the following assumptions: Corporate expenses of about $130 million, including digital transformation investments of around $20 million and separation costs of up to $15 million, interest expense of $122 million to $124 million, a tax rate around 24.5% to 25% and average fully diluted shares of approximately $131 million. And then the Cabinets business has been exceptional at doing their part to drive profit growth and margin, they're likely to finish this year with pretax operating income in that $390 million to $400-ish million range and then depreciation and amortization, that's probably about $60 million on top of that. But even -- I would step back from that and say, as a business over the three years using 2019 as a basis, you're talking about a business that has -- by the end of this year, even if you cut it off in the third quarter, but it will be about the same at the end of the fourth quarter, a three-year sales growth CAGR of about 9% and a profit CAGR of about 14%. Well, I think, Pat, nailed that -- I mean, I'd say, Mike, just we've stayed focused on the long-term net market outperformance we are on the nine on the top, 14 on the bottom that Pat referenced the almost 300 basis points of operating margin improvement over that time that the business has been able to deliver. So all you're picking up there is -- we have a meaningful amount of inventory to work off the balance sheet next year, probably in the $200 million to $400 million range, somewhere in there, depending on how the year unfolds and what's the most appropriate way to manage our capacity and our vendor relationships, and that will affect the rate at which any kind of raw material change impacts our income statement. Yes, thanks very much guys. Yes, thanks very much guys."
}