{
    "symbol": "ELS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 14:18:01",
    "content": " Your line is open. 16:01 So as far as pacing, I think it's helpful, if we break down the reservation pace between the core properties that did not see a decline in the activity of available sites and that pace is really is 9% in the second quarter and 18% in the third quarter with the highest demand, I think we see in California and the North and Northeast properties. Your line is open. Your line is open. And we do think that we have some pricing power just as you consider what's happening with alternative travel activities, I think hotel rooms are up 40%, our airline tickets are up similar numbers and rental car rates are up similar percentages as well in terms of just being able to take vacation alternative options. Your line is open. Your line is open. 31:08 And I think, Keegan, in terms of just rapidly rising rates and touching on mortgage rates, I think you’re thinking about our portfolio and the majority of our buyers are cash buyers, and we have 95% I think pay cash throughout in the four -- in the first quarter and that's consistent throughout our community. Your line is open. 33:00 Sure, it's Patrick our trend in -- really over the last, let’s say 24 quarters, I think we've had six quarters where we've increased renters. So long-term trend of increasing homeowners and decreasing renters and for the quarter year-over-year were down almost 600 rentals, down to 3,300 overall, so that that is our view of quality of occupancy and emphasizing long-term homeowners as opposed to renters and renters are -- there are part of the business and what we've seen across our portfolio is success in converting those rental homes to homeowners, roughly 25% of our new used home sales in the quarter were to a current residents either homeowners, who were either upsizing or downsizing their current home or renters who are purchasing home in the community. Your line is open. Your line is open. Your line is open. Your line is open."
}