{
    "symbol": "ELS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-19 17:51:06",
    "content": " Annual RV rate increases generated approximately 6.4% growth in the year-to-date period, with occupancy contributing close to 300 basis points of growth. The actual results for the second quarter was 2.4% growth, a variance of approximately $500,000. Year-to-date, combined seasonal and transient rent increased almost 23% compared to prior year, following recovery of our seasonal RV business during the first quarter of 2022. Membership dues revenue increased 9.3% and 10.1% for the quarter and year-to-date, respectively, compared to the prior year. At the end of the second quarter 2022, our member count, excluding our RV dealer free trials, was 3.6% higher than the same time last year. In summary, second quarter core property operating revenues increased 4.9% and core NOI before property management increased 3.3%. For the year-to-date period, core property operating revenues increased 7.2% and core NOI before property management increased 6.2%. During the year-to-date period, only 8% of our noncore property operating revenues were generated from transient rent. New home sales profits, along with our ancillary retail and restaurant operations, generated approximately $4.1 million in the second quarter and $6.7 million year-to-date. I think in terms of cancellations, when you think about the booking window, what we have seen with our customers is when we look -- overall, sorry, those customers who make their reservations 90 days in advance, that represents about 20% of the reservations at the end of the period. So just overall, I think our long-term history and we focus really on the full year activity, not so much quarter-to-quarter but 45% is really kind of the midpoint of the recovery range and it's consistent with what we saw in the quarter. So I mean our third quarter guidance, the 2.5% to 3.5% decline in the combined seasonal and transient, that's based on our current pace for seasonal and transient rents. Transient pace looks similar to the experience we had in the second quarter, kind of evidenced by what we saw over the fourth of July weekend, it's down, call it, 6% to 7%. So as we step into the quarter, that reservation made a while ago represents significantly more than it ends up representing and that's because those short-term reservations, kind of eight to nine days ahead of arrival, they end up representing 60% in total. So each quarter as part of our process for determining any updates that we make to our guidance, we review our property level, our consolidated expenses for the quarter and year-to-date periods and identify any outliers in terms of expected growth. And our second quarter expense results as well as the increase to our full year property expense expectations, they reflect the rapidly increasing CPI environment that we've been operating in throughout 2022; so we saw that."
}