{
    "symbol": "CVLT",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-31 11:01:07",
    "content": " Revenue from large deals, which we define as transactions with greater than $100,000 of software and products revenue was down $10 million versus the prior year and represented 72% of software revenue in the current quarter compared to 76% in Q3 of the prior year. Services revenue, which includes revenue from our customer support agreements, professional services and Metallic was $106 million, an increase of 7% on a constant currency basis, driven by the continued acceleration of Metallic revenue. Services revenue, which includes revenue from our customer support agreements, professional services, and Metallic is expected to be approximately $107.5 million with sequential revenue growth driven by our Metallic business. Your line is open. As I look at kind of Metallic, what's interesting is, you're talking about what sounds like an acceleration of the ARR momentum relative to, I think last quarter you said 75 and I think exiting fiscal '21, it was 50 on ARR balanced. Aaron, actually relative if you look at quarter-on-quarter from a Q3 even versus Q2, the sequential growth we saw Metallic accelerated in fiscal Q3, so that makes us really happy with the results that we're seeing. Your line is open. Your line is open. Your line is open. Your line is open. So it's kind of hard for me to say what of it is real and what is -- and I will say to you that if you look at the combined business, if you look at how our -- notwithstanding the shortfall on the software side this quarter and you look at our new customer additions and you look at the SaaS growth that we've got with Metallic, and you look at the combined 40% to 50% of our customers have both, you're seeing the momentum that we've got in the business. Your line is open. So the best way to think about it, it's kind of trending at similar levels that it's always had in kind of that mid-single-digit year-over-year decline in that customer support revenue is probably the best way to think about it in a steady state model that we're working towards. Where we're headed is that more to come when we get to our next earnings call at the end of fiscal Q4, I think there's a lot of interest in the Metallic business, not just from a revenue but a margin and introductory standpoint."
}