{
    "symbol": "TRUE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 15:03:04",
    "content": " During Q2 we continue to sign and curate dealers for TrueCar+, and grow the available inventory of new used in certified pre-owned vehicles available and continued to see positive momentum in subsequent weeks. During the second quarter, we focused on growing inventory across the state of Florida for new certified pre-owned and used vehicles and started to drive traffic and shoppers through the flow in TrueCar+. We had 80 dealers and more than 7,000 new used and certified pre-owned units and inventory in TrueCar+ at the end of Q2, and we continue to add to this. In light of the work that remains to be done in completing the TrueCar+ product roadmap to become fully functional, we are still defining the appropriate methodology to better understand which orders placed by TrueCar+ users have converted into sales that are participating dealers. After we enable paperwork on TrueCar+ which is a key step, we're seeking expansion out of Florida really across two different paths or tracks, one for new and one for used cars. I just want to add that the rooftop balance will not be a primary metric for TrueCar+, instead, we will grow and curate a network of dealers that we have, and a depth of inventory, and who are committed to delivering a world class marketplace experience to consumers will be prioritized as dealers. Once we enable paperwork within TrueCar+ and continue to add scale, we will have a unique opportunity to offer a true asset light marketplace for new used and certified pre-owned vehicles across multiple brands. And so as we start expanding outside of Florida, you can expect that also we're going to push harder on having made people aware that TrueCar is not a lead generator stand-alone anymore, but actually is a full digital marketplace where people can now effectively transacted by a new used or certain car. So for this specific year, there is no assumption made on additional revenues effectively and we will elaborate on this in much more detail in the future as we articulate how we're actually going to monetize TrueCar+ for which there are various opportunities for us."
}