{
    "symbol": "RRR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:44:09",
    "content": " On a consolidated basis, excluding great management fees, our third quarter net revenues was $414 million, effectively flat when compared to the prior year's third quarter. Our adjusted EBITDA was $182 million, down 1.3% from $184.3 million in the prior year's third quarter. With respect to our Las Vegas operations, excluding the impact from our closed properties, our third quarter net revenue was $411.6 million, up 1% from $407.4 million in the prior year's third quarter. Our adjusted EBITDA was $199.9 million, down 2.1% from $204.2 million in the prior year's third quarter. While we recognize the headwinds in the economy and the adverse impact inflation has on both the company and our customers, our actions taken over the past 10 quarters and our focused efforts to control the controllables have allowed us to continue to generate strong adjusted EBITDA, maintain adjusted EBITDA margin and return over $1 billion in capital to our shareholders since we reopened in June of 2020. The company used the distribution to make its third quarter estimated tax payment, pay its previously declared dividend of $0.25 per Class A common share as well as partially fund the purchase of approximately 496,000 Class A shares at an average price of $38.33 per share under its previously disclosed $600 million share repurchase program. The third quarter purchases bring the total number of shares purchased under the program and through our 2021 tender to approximately 14.2 million Class A shares at an average price of $45.29 per share, reducing our share count at quarter end to approximately 103.9 million shares. Capital spend in the third quarter was $97.2 million, which includes approximately $72.8 million in investment capital, inclusive of our Durango project as well as $24.4 million in maintenance capital. While the quarter presented a return to normal seasonality, significant economic uncertainty and record inflation, our disciplined approach to running our business, coupled with our unparalleled distribution and scale resulted in near record high EBITDA and EBITDA margin, even as we continue to execute on our long-term growth strategy and continue to return capital to our shareholders."
}