{
    "symbol": "RRR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 19:54:06",
    "content": " In terms of same store net revenue, we had the best fourth quarter in the history of our company, and in terms of adjusted EBITDA and adjusted EBITDA margin, this quarter represented our second best fourth quarter ever, only surpassed by last year's strong quarter. On a consolidated basis, our fourth quarter net revenue was $425.5 million, up $3.1 million from $422.4 million in the prior year's fourth quarter. Our adjusted EBITDA was $194.4 million, up 2.5% from $189.7 million in the prior year's fourth quarter. With respect to our Las Vegas operations, excluding the impact from our closed properties, our fourth quarter net revenue was $419.7 million, up 1.9% from $411.7 million in the prior year's fourth quarter. Our adjusted EBITDA was $206.9 million, down 1.1% from $209.3 million in the prior year's fourth quarter, and our adjusted EBITDA margin   up 2.8% from $1.6 billion in the prior year. Our full year 2022 adjusted EBITDA margin was $813.4 million, up 1% from $805.9 million in the prior year and our full year adjusted EBITDA margin was 49.7%, a decrease of 184 basis points from the prior year. While 2022 posed certain economic challenges, such as inflation and higher interest rates, our constant focus on our core operations and our actions taken over the past two years have allowed us to generate strong adjusted EBITDA, maintain adjusted EBITDA margin and return over $1.1 billion in capital, over $10 per share to our shareholders since we reopened in June of 2020. We're going to what's right to the -- what's in the best interest of our shareholders over the long term, Cassandra, but keep looking back, owning the real estate provides max -- provide us maximum flexibility, including the ability to keep our employees through COVID...\n And including the ability to quickly delever like when Durango opens, the company is going to have significant free cash flow to deleverage its balance sheet."
}