{
    "symbol": "GDDY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 23:32:07",
    "content": " GoDaddy turned in a strong year against those financial goals, delivering revenue of $4.1 billion; Normalized EBITDA of $1 billion; free cash flow per share of $6.20 and executing $1.3 billion in share buybacks, meeting and exceeding our targets. Applications and commerce revenue for the year grew to $1.3 billion, representing 13% growth, and Core platform revenue for the year totaled $2.8 billion, representing 5% growth, both in line with the targets we set last year. Core platform revenue decreased 2% to $707 million in the fourth quarter, primarily due to the tough compare to the year-ago quarter when aftermarket benefited from some larger than average transactions we have discussed previously as well as a modest decrease in our hosting business. Unlevered free cash flow grew 17% to $238 million, while free cash flow grew 16% to $202 million delivering $1.29 free cash flow per share in the quarter, a 25% increase over last yearâ\u0080\u0099s Q4 free cash flow per share. I think when you look at us overall and take into account those, youâ\u0080\u0099re looking at around a 6% annualized growth rate before that, when it comes to pricing always nuanced for us, we have a broad set of products across our customer base, and what we continue to look at opportunities to price within the market, where we can take more â\u0080\u0093 we need to take the price, and we continue to look for opportunities to take market share where we can. But commerce continues to make progress going into 2023, weâ\u0080\u0099re seeing a lot of taking â\u0080\u0093 talk about the attach-related to Websites + Marketing, when people are coming through the funnel, weâ\u0080\u0099ve continued to see the progress of our existing customer base or 21 million customers converting over to payments. So it sounds like youâ\u0080\u0099re still committed to the 15% EBITDA, and then the free cash flow guidance gave, and it sounds like weâ\u0080\u0099re stepping off of the commitment to the revenue growth given the macro business."
}