{
    "symbol": "TDC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 23:16:04",
    "content": " Our strong cloud growth demonstrates that our customers recognize the value in Teradata's mission-critical capabilities, as we deliver the best cloud analytics and data platform in the market to navigate through the macroeconomic pressures and recessionary concerns that exist today. Two key highlights in the quarter include: $45 million of reported sequential cloud ARR growth, or $50 million increase in currency that results in a growth rate nearly doubling year-over-year. This includes approximately 80% growth year-over-year in cloud ARR, as reported and in constant currency and free cash flow of approximately $400 million. But as we model that through and look at the expansion rate that we're currently seeing, it still gives us the number of getting to the approximately 80% year-on-year for cloud ARR growth. And the price point â\u0080\u0093 the initial price point of VantageCloud Lake, we've put in through this attractive for those customers to start using it, because we believe that the elasticity that's enabled by that technology will drive good growth into the future. So, we look at cloud lake as an opportunity to get into different workloads experimental ad hoc workload inside our customers, and it's going to be a future catalyst of driving growth as we move forward. I think what we're seeing there Wamsi is, if we have major customers move into alternative technology that tends to be a decision and an activity that they started and planned and executed on based on a decision that was made years back, before we had the cloud capabilities that we've got to today. I think now what we're seeing with the progress that we've made over the last two years, its customers recommitting to is based on the technology architecture, the product announcements that we've made recently, the fact that, we can take them to the cloud in a very effective way is of great interest to them. And once they're in the cloud whether it's we become part of their future technology architecture, the best way that we will continue to engage with all of these customers in the future is to give them the best possible data and analytics capabilities where they need it, be it on-prem or in the cloud."
}