{
    "symbol": "RIG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 13:52:06",
    "content": "  Operator: Good day, everyone, and welcome to the Transocean Fourth Quarter 2022 Earnings Conference Call. Good morning, and welcome to Transoceanâ\u0080\u0099s fourth quarter 2022 earnings conference call. During the course of this call, Transocean management may make certain forward-looking statements regarding various matters related to our business and company that are not historical facts. As reported in yesterdayâ\u0080\u0099s earnings release, for the fourth quarter, Transocean delivered adjusted EBITDA of $140 million on $625 million in adjusted revenue, resulting in an adjusted EBITDA margin of approximately 20%, which when combined with the new fixtures we were awarded in a fourth quarter have helped us to close the full year 2022 on a very positive note. Indeed we think that 2022 will be remembered as a pivotal year in the offshore drilling industry, particularly for Transocean. Offshore contracting activity increased significantly, driving utilization rates and day rates materially higher throughout the year. Needless to say the last several months have been a very busy but rewarding time for the Transocean marketing team as they helped us to secure an incremental $1.5 billion in backlog during the quarter, bringing our full year backlog added to approximately $4 billion. As a reminder of our recent contract awards, in the U.S. Gulf of Mexico, the Deepwater Invictus was awarded a three-well contract with an independent operator at $425,000 per day for an estimated 100 days. In Brazil, the KG2 was awarded a 910-day contract at approximately $430,000 per day including integrated services. Also in Brazil, the contracts for the previously disclosed selection of Deepwater Corcovado and Deepwater Orion for the pool tender have been finalized. As a reminder, Deepwater Corcovado was awarded a four-year contract at $399 per day and is expected to begin in direct continuation of the rigs current program. The Deepwater Orion was awarded a three-year contract at $416,000 per day and is expected to commence in the fourth quarter of this year. Concern on  Energy exercised one well option at a rate of $360,000 per day on its contract with Development Driller III. The average day rate for this incremental term of 773 days is approximately $428,000 per day. In the UK North Sea Transocean Barents was awarded a one well contract with a major operator at a rate of $310,000 per day. Finally and also in the UK North Sea Harbor Energy exercised the third option on its contract with the Paul B Loyd Jr.  wells at $175,000 per day. In November, we announced our minority stake in Liquila Ventures, a joint venture with Lime Rock Partners and Perestroika, weâ\u0080\u0099re excited to partner with these two organizations that have a deep understanding of the offshore drilling market to bring Deepwater Aquila another high load â\u0080\u0093 high hook load, ultra deepwater drill ship to the market. As part of the agreement with our joint venture partners, Transocean maintained the exclusive right to market and manage the operations of this rig. Additionally, earlier this month, we announced our investment in Global Sea Mineral Resources or GSR, a deep-sea mineral exploratory company, which included the contribution of one of our stacked drillships, Ocean Rig Olympia. Contribution of this rig, although further rationalizes â\u0080\u0093 also further rationalizes the global fleet of a nine environment floaters and we believe will ultimately prove to be a better use of this asset benefiting our shareholders over time. Notably, Deepwater Atlas commences its made â\u0080\u0093 contract with the Beacon Offshore and we took delivery of the Deepwater Titan from the shipyard. Iâ\u0080\u0099m very pleased to share that in just its first few months of operation, the Atlas has already set a new record for the longest 14-inch casing run nearly 3.8 miles, likely the first of many records to be set with this new class of drilling asset. I would like to start off by thanking our project and operations teams, our key suppliers and Sembcorp Marine for their remarkable dedication and commitment to complete the construction of our two state-of-the-art eighth generation drillships Deepwater Atlasand the Deepwater Titan. I would also like thank our customers Beacon Offshore Energy and Chevron, who have contracted the Atlas and Titan respectively for trusting us to work with them on their industry leading 28 deepwater development projects. Indeed, Atlas and Titan will be the first two drillships outfitted with complete 20K well control packages including the blowout preventers. In addition to their 20K capable Atlas and Titan are the first and for the foreseeable future, the only drillship fitted with a net lifting capacity of 3 million pounds. The rigs, which also feature extends of deck space and purpose-built areas to accommodate well completion activities are the most capable drills in the world and will ultimately expand the universe of exploration and development opportunities. With the delivery of the Atlas and Titan, Transocean has now brought a total of nine new build and fully contract drillships to its fleet in the past decade. These additions have had a marked impact on the capability and operating efficiency of our fleet to enabled us to refine our expertise, bringing ships out of the yard and into service. Expertise, which we expect will prove invaluable as we put our idle and stacked rigs on contract and return them to the active fleet. Our expectation is that these new builds will perform at the fleet average revenue efficiency level within the first six months of operation, which would be an extraordinary achievement for any new build floater, especially since these rigs are equipped with a variety of serial number one equipment. A successful rig reactivation is not only completing the project work scope in line with cost and time expectations, but also starting operations safely, reliably and efficiently. Over the last several years, we developed and implemented a multitude of technologies and processes to support these pillars, resulting in the delivery of operational excellence across our fleet. Technologies include smart equipment analytics, which allows us to monitor the health and condition of our equipment in real time, permit and barrier vision a custom application which facilitates our ability to call, work, identify and manage risk effectively, and our operations procedure system, OPS, a digital platform which provides our people with the tasks, work designs and verification checks that are necessary to deliver procedural discipline flawless execution. As our industry embarks on this long overdue cycle, drilling contractors must overcome the operational challenges that a company restarting rigs and bringing them back into operations safely, reliably, and efficiently. Because theyâ\u0080\u0099ve been preparing for this reality through the downturn by investing in our people, assets and technology, Transocean has the experience and capability to grow our operational fleet with the high level of performance. We look forward to the opportunity to steadily bring our idle fleet back into service in the safest, most of cost effective manner to best ensure the highest returns for our shareholders. In fact, if current tendering and bid opportunities that weâ\u0080\u0099re aware of the work starting in 2024 and 2025 to develop as expected, demand cannot be met by the current active supply of drillships. Having said that, we were absolutely firm in our position that we will not reactivate a rig unless our customers, there a combination of mobilization fees, day rate and term pay for the entire reactivation plus an acceptable return in the initial contract. Indeed, over the next 18 months, an estimated 82 programs are anticipated to be awarded for a total of 74 rig use of work. Consistent with this outlook, industry analysts predict the number of wells drilled offshore will increase by nearly 15% in 2023. While we currently donâ\u0080\u0099t see the same volume of long-term activity we see in Brazil, the U.S. Gulf of Mexico is expected to remain relatively tight with local supply and demand keeping and relative balance. This region typically demands the highest specification rigs with the highest hook loads, which currently are all under contract. Additionally, based on our direct negotiations, we believe that there could sufficient future demand to bring one or two more rigs into the region on long-term programs. While many opportunities are relatively short in duration there are multiple multi-year tenders including one in Angola with Azule Energy, a joint venture between Eni and BP and one in Romania with OMV. In India, ONGC will require up to three rigs to satisfy its current and upcoming tenders. To fulfill these requirements, rig from other regions will need to be mobilized and as following our announcement that the KG2 is heading to Brazil, there are currently no ultra-deep water rigs available in the region. As mentioned in previous calls, the tax incentives in Norway encouraged record sanctioning over the past two and half years with 35 projects totaling approximately 190 wells sanctioned. As this translates to heightened demand, we believe Norwayâ\u0080\u0099s floater market will see a strong comeback in activity from 2024 that will require rigs to return to meet the expected demand. In summary, our outlook for high specification floating fleet is starkly positive, available active supply of high specification floaters remains bid, and on the backdrop of the other strong demand environment, we anticipate our customers will continue to exempt  secure assets for longer term, which in turn should support the prevailing upward trajectory of day rates. An acute focus on delivering safe, reliable, and efficient operations as well as reducing our debt Transocean is well positioned to prosper and deliver shareholder value as we continue through what we expect should be a sustained multiyear recovery. Through todayâ\u0080\u0099s call, I will briefly recap fourth quarter results and then provide guidance for the first quarter as well as an update of our expectations for full year 2023. Last month we executed more transactions, a $525 million secured financing on the Deepwater Titan and a $1.175 billion refinancing of our four series of senior notes, both transactions of which were well oversee by the market. In the context of todayâ\u0080\u0099s interest rate and or broader get capital market environment these two transactions materially improved our medium term liquidity and further set the stage for us opportunistically delever, simplify and improve the flexibility of our balance sheet. As reported in the press release, which include additional detail on our results for the fourth quarter of 2022, we reported net loss attributable to controlling interest of $350 million or $0.48 per diluted share. After certain adjustments are stated in yesterdayâ\u0080\u0099s press release, we reported adjusted net loss of $356 million. During the quarter we generated adjusted EBITDA of $140 million, which translated into cash flow from operations of approximately $178 million . This was subsequently offset with the $525 million raise in Deepwater Titan, as I mentioned earlier. Looking closer at our results, during the fourth quarter, we delivered adjusted contract drilling revenues of approximately $625 million at an average day rate of $349,000. This is above our guidance and reflects more than anticipated operating days, higher than expected recharge revenue and strong bonus revenue. 2022 cash flow in the balance sheet, we ended the fourth quarter of a total liquidity of approximately $1.8 billion, including unrestricted cash and cash equivalents of approximately $683 million, approximately $275 million of restricted cash for debt service and $774 million from our undrawn revolving credit facility. Revenue guidance is based primarily on firm contracts as listed in our Fleet Status Report, but also includes a speculative  component, which we have a high level degree of confidence. For the first quarter 2023, we expect adjusted contract drilling revenue of $635 million based upon an average fleet quired revenue efficiency of 96.5%. This is slightly higher than the fourth quarter of 2022, largely due to increased activity on certain rigs partially offset by fewer operating days to quarter. For the full year and as Iâ\u0080\u0099ve guided last quarter, weâ\u0080\u0099re anticipating interested revenues to be between $2.9 billion and $3 billion, also based on 96.5% revenue efficiency. This slight quarter-over-quarter increase is primarily due attributable to higher costs included in relation to the contract preparation of the Deepwater Orion and the KG2 for contracts in Brazil, partially offset by lower in service maintenance activities. For the full year, weâ\u0080\u0099re participating earn and expense to be approximately $1.9 billion. For the full year, weâ\u0080\u0099re anticipating net interest expense of approximately $470 million, including capitalized interest of approximately $30 million. Our expected liquidity in December of 2023 is particular to be between $1.3 billion and $1.4 billion, reflecting our revenue and cost guidance and including the $600 million capacity of our revolving credit facility and restricted cash of approximately $210 million, which is mainly reserved for that service. In conclusion, our debt reliability actions over the past 12 months have positioned us well for further improving our capital structure. As more of our rigs transition to higher contract day rates, cash flows model accelerate organically leveraging. We already seeing this with other people with free feed for which estimated average contract day rate is increase approximately $30,000 year-over-year to approximately $340,000 per day as indicated in our Fleet Status Report. Operationally we remain focused, delivering safe, reliable, and efficient operations, which ultimately supports our deleveraging goals and creates value for our shareholders. Jeremy, clearly congratulations on all the work you guys have done over the last couple years and on getting the KG2 to work, that rig was your last title rig. As we look ahead in this year and in the next year, clearly there are going to be, some of your competitors have reactivated rigs. As we think about, your ability to reactivate rigs and whatâ\u0080\u0099s going on in the current market. I think weâ\u0080\u0099ve been very clear in our position on reactivations, that the customer has to pay for it in the first contract, and by that, some form or mixture of upfront payment mobilization fees plus day rate and term that more than pays for the reactivation itself, it actually generates a suitable return for Transocean, and so that may mean that weâ\u0080\u0099re later to, to the reactivation party than some of our peers if theyâ\u0080\u0099re willing to reactivate on spec or for lesser returns. Yes, I think, this is Roddie here, I get to add to that a little bit, so to kind of demonstrate that discipline, itâ\u0080\u0099s often difficult for us to talk about individual tenders and awards and negotiations. However, thereâ\u0080\u0099s a couple great example, one in Brazil, which is, as you know on certain tenders are fully public there where all the results are published. So for example in the pool tender in the lot two basket, thatâ\u0080\u0099s one where we won a job with the Orion, we were also the next rig to be awarded in that line, and the day rate on the rig was $474,000 a day. However, when we went through the details of this and we went through the timeline that Petrobras was going to execute upon, we decided that the cash flows just didnâ\u0080\u0099t meet our return requirements, so we kind of stepped aside from that one and took the disciplined approach of not putting forward the  into that that tender any further. And since then the Petrobas moved to the next operator or the next rig contractor, and thatâ\u0080\u0099s going to be the according to the results of the public tender, the DS-8, which should see their award at $460,000 a day. Weâ\u0080\u0099ll have to wait and see how that turns out, but we just wanted to reassure you that we take that discipline very, very seriously and we have walked away from some contracts because they did not provide return lease as to be adequate. Yes, it seems like these multiyear contracts are going to be pricingâ\u0080\u0099s going to be heading higher. Yes, weâ\u0080\u0099re â\u0080\u0093 it seems like weâ\u0080\u0099re in this air pocket in Norway, in 2023. So as Jeremy had explained, we see that thereâ\u0080\u0099s basically about six rigs moving out of the Norwegian market. Whatâ\u0080\u0099s interesting in that is, if you look at the supply of rigs available to the Norwegian market and you look at the numbers in like 2021 and you compare them to where we are in 2023, in a period of two years, that number has dropped from, in excess of 20, about 22 rigs down to 13 rigs available in 2023. So, as you think about the effect that thatâ\u0080\u0099s going to have, thatâ\u0080\u0099s the stuff that youâ\u0080\u0099re talking about where rigs are moving out of the region, theyâ\u0080\u0099re going to West Africa, some are going to Canada. Thereâ\u0080\u0099s a lot of speculation about some rigs maybe even more than one going to Australia, but also the UK and the stuff in West Africa seems to be growing even further. And the really interesting thing was in discussions that weâ\u0080\u0099ve had with certain larger operators in South America, the next tender that we expect from them is going to be specifically targeting merge units with high efficiency drilling packages. So just to touch on that a little, you mentioned margin earlier, so with the cost basis being a little bit higher and Norway than it is elsewhere thatâ\u0080\u0099s going to be a key driver. So youâ\u0080\u0099ve seen these kind of six rigs move out, fully expect to see three or four more pretty soon. And when those rigs move out, once youâ\u0080\u0099ve got over the hurdle of the movement and as Jeremy pointed out, the customers are paying for those mobilizations now you make better margins outside. So for those rigs to come back to Norway, itâ\u0080\u0099s going to be an increased hurdle for them to come back. With that said, we have line of sight jobs on pretty much all of our harsh environment including the stacked CAT-D and I canâ\u0080\u0099t really disclose the details about that, but essentially itâ\u0080\u0099s safe to say that for all of our harsh environment fleet, including the stack CAT-D weâ\u0080\u0099re in active negotiations for placing in all of those. I think and over the period of this year, youâ\u0080\u0099re going to see pretty much all those rigs get fixtures on them. So weâ\u0080\u0099ve obviously seen a lot loader demand the past nine months, which has mostly been driven by Petrobras and you guys have clearly been the biggest beneficiary of that. But just shifting to the majors, we havenâ\u0080\u0099t quite seen as many large multi-year contracts from that group yet, likely because most of them are beholden to their investors. In fact, we signed two-year contracts with some of the majors in the Gulf of Mexico. The context here is theyâ\u0080\u0099re moving faster than theyâ\u0080\u0099ve ever moved in the past seven years, but Petrobras is really on a different level. But I would argue very smart move because theyâ\u0080\u0099re going to get the bulk of the available rigs and at what we would consider solid day rates, but I think in time they will prove to be an absolute bargain from Petrobras point of view because theyâ\u0080\u0099ll affected mid-400s . And of course as Jeremy had said, once we get into those kind of our 90% utilization rates, that, that, thatâ\u0080\u0099s typically where the inflection point on the next tier of rates comes. Not only because we can push a lot of volume in Brazil, but mainly because theyâ\u0080\u0099re the long-term contracts and we are beginning to see the majors around the world, particularly West Africa are really beginning to focus on longer-term. So youâ\u0080\u0099re going to see in the West African region, several fixtures will be made over the next few months that will be multi-year in nature. Just shifting to costs, so one of your competitors yesterday highlighted higher cost this year for offshore crews in onshore support. Yes, yes, clearly with your inflation currently ongoing and the tight labor market, weâ\u0080\u0099re seeing similar cost increases, Iâ\u0080\u0099d say somewhere in that 5% to 8% area if you blend both the labor plus the O&M costs. Youâ\u0080\u0099ve done some proper work on the balance sheet over the last year, as you mentioned in the prepared remarks. Well, now weâ\u0080\u0099re in a cyclical â\u0080\u0093 and as a result of that, as I mentioned in my prepared comments, we have higher day rates generating a significant cash flow. Clearly, simplifying means taking those four and moving them down to one eventually, but over time, so as you know, thereâ\u0080\u0099s unsecured, there is secured, thereâ\u0080\u0099s PGNs and SPGNs, so clearly the first focus is going to be PGNs. Two other quick ones for me, first one, the Aquila, which youâ\u0080\u0099ll have the marketing rights to. Fredrik, I didnâ\u0080\u0099t hear you very clear, but I think youâ\u0080\u0099re referring to the Aquila, if thatâ\u0080\u0099s the case, we have experienced in doing this, as youâ\u0080\u0099re well aware, we own a third interest in the Norga and we have a similar process whereby we maintain a clean marketing team to avoid any kind of antitrust concerns. But I think what weâ\u0080\u0099ve seen right now is the first in line are not the cold stacked rigs, itâ\u0080\u0099s the rigs that are being completed that are sitting at the yards in South Korea. And several of these are projected to be contracted in Brazil, West Africa and elsewhere throughout this year. We donâ\u0080\u0099t believe that any of those rigs can really start on their contracts in 2023, given the fact that I think thereâ\u0080\u0099s a consensus around at least 12 months to activate a rig from a shipyard or from cold and to prepare the rig foots  contract, because as you know, each operator has their own contracts perfect requirements and equipment for that opportunity. So I think itâ\u0080\u0099s going to be measured mainly because of this constraint, but also because of the fact that there is significant amount of cash required to do this. Clearly, if you sign that contract or similar work today, we would assume that the rates would be much higher. And in addition to that, maybe just give us a quick update on potential to do any secured issuance against that and how we should think about capacity there relative to the Titan. But thereâ\u0080\u0099s several bites â\u0080\u0093 some of them which are in the 20k space, but as Keelan had pointed out, one of the most interesting features of the rig is this super high hook load. We thinkthereâ\u0080\u0099s real demand for these ultra heavy casing strings, and of course she can only do that with that assay, and she happens to be the 20k rig. So looking at the marketed floater fleet, I think we see a little increase in special surveys this year, close to twice as many next year for the entire market floater fleet and the mix of rigs coming up on their second or third SPS is growing. So the industry needs reactivations, maybe some stranded new delivery to accommodate growing demand. At the same time, it feels like shipyards are busy and OEMs have rationalized a lot of capacity in the last four years. So taking a slightly different angle on a prior question, I think you mentioned actually constraints, among contractors as maybe a governing factor for reactivation. Clearly, as youâ\u0080\u0099ve indicated, the reason that it takes at least 12 months to reactive the rigs, because of the challenges that our OEMs are having because they reduce capacity significantly during the . So now as theyâ\u0080\u0099re ramping up, weâ\u0080\u0099re starting to see these challenges because demand from the drilling contractors has improved substantially. No, I think youâ\u0080\u0099ve covered it well, Mark, I would add that we are continually engaged with our major key suppliers to look at the demand forecast that we have through our collaboration agreements and care agreements that we have with those very important suppliers to us, we are able to take a very confident look at the supply chain from their side understand their restrictions and plan around not only their capability, but also our capital equipment that we have on hand to handle those projects and reactivation. Sorry, I just add to that, in some ways, in some ways the capital constraints of the drilling contractors and the supply chain challenges that weâ\u0080\u0099re facing and the shipyards and with OEMs is actually healthy for the industry. We canâ\u0080\u0099t do what weâ\u0080\u0099ve done in the past and overbuild, so thatâ\u0080\u0099s why we think itâ\u0080\u0099s going to be a prolonged recovery because we canâ\u0080\u0099t overbuild as an industry at this point in time. Because not only youâ\u0080\u0099re looking at Petrobras adding significant capacity, but thereâ\u0080\u0099s six other programs from the likes of Shell, Total, Equinor and others that are got to be satisfied as well. So, we dip down to kind of the teens in terms of rig count in Brazil, but itâ\u0080\u0099s going to double over the next little while. So, I think youâ\u0080\u0099re looking at 40, 40 plus rigs. It looks like youâ\u0080\u0099re going to be have operating a fleet of about five, I think vessels there, five drillships there in that country, and just a lot of concentration really around the U.S., Gulf of Mexico and Brazil. And of course weâ\u0080\u0099re now looking at five rigs being contracted there, I would be very optimistic that weâ\u0080\u0099d be able to add one, two or three more to that over the next year or so. And Samantha, just to add to that, your question was a little muffled on this end, so apologize, but I think you were asking a little bit up a question around economies of scale. It requires a tremendous amount of effort and time and energy and experience to run one ultra-deepwater safely, reliably, and efficiently. But then as you add rigs, you donâ\u0080\u0099t have to add much in the way of incremental support onshore. So look, the exploration stuff in Namibia, youâ\u0080\u0099ve now got several operators, who are kind of dipped their toe on that and theyâ\u0080\u0099ve had good success. So, youâ\u0080\u0099ve basically got you kind of two rigs working in Namibia. So, I think thatâ\u0080\u0099s going to be a really solid jurisdiction for the foreseeable future. So the difference here is that you just have even more auditors arenâ\u0080\u0099t interested, so I think thatâ\u0080\u0099s a really positive sign, particularly because they use harsh environment rigs rather than just benign rigs. But again, around the world, I think youâ\u0080\u0099ve seen a lot more discoveries in the last year than you had in some previous years. You will see as we shift towards more development of these fields rather than just exploration, youâ\u0080\u0099re going to see a lot more long-term contracts because thatâ\u0080\u0099s typically how this cycle works in terms of delivering all of those wells in that given timeframe. And if I could just squeeze one more in, itâ\u0080\u0099s kind of interesting that you used that phrase dipping your toes. Because I think earlier this year or last year when you guys first announced your JV into the deep-sea mining, Jeremy used that same phrase about dipping your toes, that sort of exciting new venture."
}