{
    "symbol": "DX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:18:04",
    "content": " At this time, I would like to welcome everyone to the Dynex Capital First Quarter Earnings Conference Call. Good morning, and thank you all for joining us today for the Dynex Capital First Quarter 2022 Earnings Conference Call. The press release associated with today's call was issued and filed with the SEC this morning, April 27, 2022. Before we begin, we wish to remind you that this conference call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. The words believe, expect, forecast, assume, anticipate, estimate, project, plan, continue, will and similar expressions identify forward-looking statements. These forward-looking statements reflect our current beliefs, assumptions and expectations based on information currently available to us and are applicable only as of the date of this presentation. These forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. For additional information on these factors or risks, please refer to our disclosures filed with the SEC, which may be found on the Dynex website under Investors Center as well as on the SEC's website. Joining me on the call is Byron Boston, Chief Executive Officer and Co-Chief Investment Officer; Smriti Popenoe, President and Co-Chief Investment Officer; and Steve Benedetti, Executive Vice President, Chief Financial Officer and Chief Operating Officer. Thank you, Alison, and thank you, everyone, for joining our first quarter earnings call. I am incredibly proud of the Dynex team and the first quarter results we achieved as we skillfully navigated a historically volatile macro environment in which all major bond indices produced negative returns, as you can see on Slide 5. This is the second such rapid market disruption in the fixed income market that we have seen in the last 2 years, during which we generated double-digit returns. In the first quarter, we generated a total economic return of 3.5%. And our total economic return for our common shareholders since January 1, 2020, has been 21.3%, all while maintaining an average book value around $18 per share during this period, as you can see on Slide 6. It's because of the skills of our experienced team, our risk management, our flexible mindset, our disciplined and patient approach to investing and our differentiated top-down macro approach to capital management. As I said many times, we invest your capital with a long-term view. Our team has navigated many complex and volatile market environment, including the 1987 stock market crash, the 1998 long-term capital crisis, the 2008 great financial crisis, the 2013 taper tantrum and, most recently, the pandemic turmoil of 2020 and now the first quarter of 2022. The Russian invasion of Ukraine has intensified the unpredictability of geopolitical risk, and we expect this conflict to have both short- and long-term market consequences. There also continues to be uncertainty around federal reserve actions to combat inflation and the corresponding impact that has on interest rates, credit spreads and the U.S. economy. But with volatility and uncertainty also comes opportunity, and we are beginning to see opportunities to generate attractive long-term returns through increased leverage. We're being measured with our approach, while our balance sheet and our mindset remain flexible. We have adjusted our portfolio and we expect to navigate this environment with patience and discipline as market conditions evolve, looking for opportunities to generate accretive returns. I want all of you, our shareholders, to have confidence, confidence in our team and in our unique and disciplined approach. What makes us unique are our unwavering commitment to ethical principles, our philosophy that starts with risk management and ends with disciplined capital allocation, our sound investment strategies that are based on top-down macroeconomic analysis and, most importantly, our skilled and experienced people who work day in and day out to protect capital and generate attractive risk-adjusted returns to you, our shareholders. And with that, I will turn the call over to Steve Benedetti to give you more specifics regarding our first quarter performance. For the quarter, the company reported a total economic return of $0.64 per common share and comprehensive income of $0.65. Earnings available for distribution per common share, a non-GAAP measure, was $0.44 this quarter versus $0.45 last. Average interest-earning assets and leverage were largely unchanged, while adjusted net interest spread increased 5 basis points during the quarter. Agency RMBS yields increased 11 basis points, while TBA drop income yields improved by 21 basis points. Agency RMBS yields benefited from slower overall prepayment speeds during the quarter, which were 9 CPR versus 11 CPR last quarter. As a reminder, the company predominantly uses treasury futures and swaps to hedge its exposure to interest rate risk. Unlike interest rate swaps, these instruments do not have a calculable periodic cost that can be allocated to current period hedge expense and therefore are not included in earnings available for distribution. Rather, the benefit or cost of these instruments is included in changes in fair value, total economic return, comprehensive income and book value per share. As it relates to book value, the driver of the $0.25 per common share increase resulted primarily from the company maintaining its hedge position throughout the quarter which mitigated declines in the fair value of the investment portfolio as interest rates increase and as RMBS spreads widened. It also reflects the substantial repricing of mortgages and, as such, reflects market yields for our investments based on spot and forward rates on that date. All else equal, assuming projected prepayment speeds and forward interest rate curves are realized as they existed on March 31, the yield on our Agency RMBS assets from a GAAP fair value basis is approximately 3% which drives forward total economic return and is substantially higher than the 182 basis points effective yield for the first quarter based on an amortized cost basis. From a portfolio perspective, investments inclusive of TBA securities increased on a quarter-over-quarter basis by $235 million, mainly due to TBA investments and our $4.9 billion as of the end of the quarter with 91% invested in Agency RMBS and 9% invested in CMBS and CMBS IO. From a hedging perspective, we maintained our notional coverage of approximately $4.4 billion throughout the quarter, principally in U.S. Treasury short positions. That concludes my prepared remarks, and I will turn the call over to Smriti for her comments on the quarter. Let me start by saying we have witnessed historic moves in the first quarter, the fastest drive in yields and the largest percentage change in yields in 42 years. The trend continues into the second quarter, with yields up an additional 30 to 40 basis points across a steeper curve. We also saw the fastest increase in mortgage rates since 1985 to over 5%, levels not seen in 12 years. We believe we're on the brink of a historic opportunity to invest in Agency RMBS, which I will discuss in more detail in my remarks. We've maintained a book value in this environment, ending at $18.24 on March 31 and holding between $17.50 and $18.10 thus far in April. As spreads in higher coupons have widened, we've responded by moving our entire TBA position from lower coupons into UMBS 3s and 3.5s. This adjustment substantially mitigated the adverse impact of spread widening that we've seen this quarter across all coupons, but particularly in lower coupons. The consistent overall theme remains, which is that government policy will be the main driver of returns. We believe that the global economy is in transition from the emergency phase, when aggressive government policies were used to buffer the direct impacts of the pandemic, to the post-pandemic phase, where we face the consequence of massive liquidity infusions and fiscal stimulus. The Dynex team has been prepared for elevated volatility, also the increased probability of surprise factors and a bumpy ride in the markets. We continue to be alert for changes in the economic weather, focusing on future inflation; labor market dynamics; global and domestic growth; the psychology, messaging and actions of central banks; war- and pandemic-related disruptions; as well as domestic and global geopolitics. We are maintaining an up in credit, up in liquidity position, holding significant amounts of dry powder for investment during bouts of volatility and, most importantly, a flexible portfolio and mindset to respond to evolving conditions. I use terms like prepared, ready and respond to highlight our approach. Rather than trying to predict the future, we focus on scenario planning, which allows us to respond rather than react to market events. This allows our team to have a performance improvement mindset, with clear thinking that reduces the emotional component of decision-making. During transitional environment such as the one we're in, our focus is on capital preservation. We measure ourselves, and we encourage you to measure us, on the total economic return that we generate. We believe our shareholders are best served by the preservation of capital in our business model, which is focused on generating returns over the long term. At Dynex, we aim to generate earnings that meet or exceed the level of the dividend while ending up with the same or higher book value per share at the end of a period. By doing this repeatedly, we work towards a strong capital base that is available to deploy for future investment opportunities. And there are situations, like the one we're in, where book value may decline and yet we might still be in a position to make long-term accretive investments for our shareholders as we did in 2020. In this kind of environment, we aim to minimize the damage to book value from controllable losses by focusing on our hedge ratios, positioning across the yield curve and managing our overall leverage to protect capital. By minimizing the downside hits to book value, we reduce the amount of time it takes to recover the capital and earnings. These are the foundational elements of our investment strategy for the environment, and it is exactly what we executed in the first quarter. The largest noneconomic buyer, the U.S. Federal Reserve, is stepping back from the MBS market. And unlike the short burst of spread widening that we saw in 2019 and 2020, we believe the conditions are ripe for a sustained investment opportunity. The Fed has also consistently messaged a desire to own fewer MBS on their balance sheet, providing a structural opportunity for private capital to step in. The MBS market has been the leader in pricing the impact of quantitative tightening, returns are higher now than in 2018, with a significant amount of widening already behind us, possibly the majority of it. From this point on, we anticipate going through a cycle of spread. We've done a good job of preserving our shareholders' capital to date, and it is important to understand that at current levels of returns, we believe we can quickly earn back any incremental book value declines. First, our view of the overall macroeconomic environment, which we still believe to be vulnerable to unexpected shocks. And second, the overall level of mortgage spreads which, while already attractive today, may provide better opportunities at the wider spread levels that we expect. Let me add that at today's level of the balance sheet, we are in position to earn or exceed the level of the dividend in earnings available for distribution for the second quarter. From a hedge ratio standpoint, given the complexity of the global environment and the rapid move higher on interest rates that we've already experienced, we see the chance for rates to go either higher or lower from here, and that calls for a different portfolio strategy. While our hedges remain in the 10-year part of the curve, we expect to be more active in managing our hedge ratio in the coming quarters. We stand ready to deploy capital as we move into this more favorable return environment, and we're looking forward to building a very solid stream of cash flow that will position us to deliver strong performance in the long term. I've also said on these calls that when choosing how to invest your money or assess relative performance in our sector, the key factors for consideration should be management team quality and total economic return performance. Because of our focus on preserving capital, Dynex is now extremely well positioned to capitalize on this big moment in history. If you're running a traditional 60-40 investment portfolio strategy and consider diversifying your fixed income portfolio with either Dynex common or preferred stock, if you're an endowment that leads an annual draw in your portfolio, our above average dividend yield can help meet your needs. If you are in retirement or approaching retirement, you need an asset management team that you can trust over the long term, so you can simply enjoy life. We are an experienced and ethical management team with strong core values, a long-term mindset, a track record of preserving capital and, very importantly, a game plan for navigating the current unanticipated market environment. First off, congratulations on the good book value performance for the quarter. If I look at the available returns that you show in your presentation, despite the spread widening you saw, you're kind of only showing a widening 100 basis points of the potential levered return. So right now, if you think about it, the current coupon is actually 4.5%. So from our perspective, I wouldn't take that as a only 100 basis point change in the overall return. If you really look at the coupon distribution in total, you'll actually see that the returns are higher by the appropriate amount. So probably close to 2% -- 2%, 2.5% quarter-over-quarter. And I know you talked a little bit, it was somewhat coupon distribution, but I guess any more color that you can give us kind of how you kind of navigated the widening of kind of all spreads and still kind of produced a positive book value return in the quarter. Doug, I'm going to start and I'm going to let Smriti follow up with any micro details. We gave you a view of thought process about the yield curve, about anticipated spreads, and we started to position the portfolio at that time. And we literally -- the best thing that we've done for shareholders is remaining calm, patient and disciplined because it's been a gyrating ride from 65 basis points all the way up here to 200 and -- I mean 280, 290 on the 10-year. But we literally sat still with our opinion about the yield curve, about rates, about spreads. You'll recall also back, I don't know, a year or so, we did a couple of capital raises. We're anticipating steeper curve, higher yields, wider spreads. And the best thing I can tell you that we delivered for shareholders is being calm, patient, disciplined and having a short leading the long-term deal. And as literally, if you go back and listen to all those calls, you're going to hear us talk one of my goals is to make our management of this portfolio look to you and other shareholders like a symphony, move from one movement to the next where you enjoy the music the entire time. I would say just on a more detailed perspective, Doug, it's really 3 things. When we talk about hedge ratios, it's really making sure that you understand what the duration of our mortgage security is. So one of the things that we do is we -- I think Wayne Gretzky said, you don't skate to where the puck is, but you skate to where the puck is going to be. I think it's all of the above with respect to saying our asset allocation, it was in lower coupons, lower coupons did great. Our hedge selection was in the 10-year part of the curve, that part has really sold off in line with the assets. And then look, we've been talking about low leverage all along through this period. It's not a popular thing when there's so much carry to be had in the yield curve, but I think it's served us really well. And obviously, as Byron mentioned, this is all driven by a macro view. I guess I was particularly curious in the context of when you look at the effective book yield on your assets, it's substantially below market rates and it seems like there'd be a large amount of yield you could pick up by continuing to move the portfolio up in coupon. So when you're moving up in coupon, typically, you think about I'm going from a discount to a premium, but really you're not. Every quarter, we're really marking our balance sheet to market. Those bonds that now sit at $88, $89 price discount, they're a 3-ish percent market yield. And because we preserve book value, we've really essentially preserved the forward NIM on those assets. So we're watching those to say, is this something -- these are the gauges that we feel like we need to watch to get out of those positions relative to the higher coupons. And right now, just so you guys know, our portfolio of 2 and 2.5, the pools that we own, paid about 8 to 9 CPR last month and that's worth a lot when dollar prices are 11 points below par. So these are -- right now, there are positive carry call option that we have on the portfolio. And so at this point, I would say all these positions are temporary. So the interesting thing about specified pools, I'll just give you some color on -- it's kind of bifurcated between the lower coupons versus the higher coupons. So 2s to through 3s, you've seen just massive reduction in the pay-ups versus TBAs for those coupons, and that's appropriate because the dollar prices on those coupons are so much lower. 3.5s and above, the pay-ups have come down, and they've come down as dollar prices have come down. But in that instance, on the premium side, I say premium, but the higher coupon side, the percentage of theoretical that you're getting is still actually about the same. So in the higher coupons, I think the TBAs are still going to be where we go. The low coupons, they've gotten really beat up. The other thing that's happening in the lower coupons is that because you have bonds that are $88, $89 price now, the seasoning starts to matter. So at this point, I would say 3.5s and above, TBA still look better, cheaper versus specs. 3s and below, we're a little bit indifferent and we'll look to pick up call protection if we think it's really cheap. Just a follow-up on the TBA. Just a follow-up on the TBA. Well, it's partially related. So you can actually see just in the last week or so, the rolls in Fannie 4s has come down 4 ticks. So it's less sustainable, I would say, than it was when the Fed was buying. Without a bid for that production, the specialness in these rules is not going to be sustainable without a very deep bid from a going away buyer. I think the way to think about the hedges at this point, because we have a pretty flat yield curve, that's a factor. So at this point, I think our inclination would be -- to be, I would say, more neutral relative to the level of rates. With respect to the swaptions, it's really tough here when you think about the level of ball. So with everything at a discount at this point, there's less of a need to use swaptions. And we do think about other ways to buy ball, right, like in spec pools or something else. From here, like we are going to be much more active in managing the hedge piece. For me to tell you it's going to be in the 2-, 3-, 5-year part of the curve at this point, don't yet have the level of certainty to say how it's going to be. And I think, Smriti, you suggested that ROEs are up 2%, 2.5%. So -- and the interesting thing about that is that the hedged returns already include, they already include the financing costs going up to 3.5% as implied by the forward curve. The largest noneconomic buyer has stepped away and it's telling you that they're stepping away, they don't want to own more of these. So these levels of mortgage spreads we have not seen since 2018, 2019. So I would say to you that the current returns in the 12% to 14%, I mean, we see mid-teens definitely possible within about of volatility. And when we create -- when these returns are calculated at Dynex, it's a true risk-adjusted return. Like we -- as Smriti said, it's got built in there, a solid rise in rates and financing costs. And I think that's very important because when you ask different companies about their returns, one of the challenges you have is, well, what are they assuming in their calculations. If anything, we're going to be on very disciplined and very conservative in the process. And what's exciting about that is if, in fact, you add assets at these wide levels, I mean you're looking to hold them all over the long term. And then, in fact, some of those risk factors turn out to be better than anticipated, that actually gives you the opportunity to make higher returns. This is really important because we talk about controllable risks like and say hedge ratio durations, et cetera. But when treasuries -- when your hedge and your assets are going in the same direction, you want to be as accurate as possible when those things are moving together. We don't really think about duration gap because it's a real -- it's a spot metric, it tells you what your duration is today, it doesn't tell you how your duration is going to move 25 or 50 basis points from now. And then, Smriti, tied back to your comment earlier, with  Gretzky's comment about skating where the puck will be, that's very important in managing a mortgage-backed securities portfolio. If you are a 65 basis points on the  which is where we are, we believe that all probability, the  is going to be closer to 2%. I think it would be the opportunity to put assets on -- at an accretive level, Chris, relative to the cost of capital. When we think about the risk-adjusted returns, given the macro environment, if we have that opportunity, you would step into that. And you've heard us say probably in June or March of last year, as quantitative tightening comes in, risky assets are going to adjust like the price of crypto, equities, Bitcoin, credit, everything, right, is going to adjust to the liquidity drain that's coming. Yes, that has to be done in the context of this global macro environment that deserves a lot of respect, quite frankly. We're doing it thoughtfully, we're not rushing in. The one thing that I'll say, Chris, and I've said it many times before, we start with our macroeconomic view. And so we think of the long term, we think of a total return experience for our shareholders. And one thing I will say is that we're not your stock where if you're looking for someone to give you 15%, 16% dividend yield, we're not that person. It is really -- there's just -- there's risk, we're prepared for it. We started preparing for it years ago when we first started talking about complex about 6 or 8 years ago, we've leaned into it more and more and the dividend is just one input. We're not -- if you're -- we're looking to generate cash income from our shareholders, and then we're looking to protect the value of our balance sheet while we're generating that cash income. But we are not the product where we're looking to just say, let me just lay out 15%, 16%, 17% dividend yield and then give you a bad total return experience. Jason, at this point, we feel like at the current dividend level, we're okay to navigate any of the REIT requirements. And then pulling way up, what gets -- Byron, Smriti, I guess you guys are constructive on the credit side of the story. Again, Jason, I'm going to start like a disciplined man, I'm going to start at the top, global macro view. And the expected outcomes do not have as high a point, the expected probability attached to them that you would normally think. With that type of backdrop, when you think about credit and credit assets and you look at the sheet we have in our presentation, you'll realize that you're taking on more and more illiquidity risk when you are playing most credit assets. I always like to use the word this is a fat-tailed environment, and we try to say that to my team is to remind them how many factors are in the channel that could surprise us. So when we talk about credit, you're starting to talk about taking more illiquidity risk as you move down in credit. And what I would say also, Jason, there is we don't think it's a good risk reward as before QT has begun. So I would want to see the price of risk assets adjust to a level of liquidity where the Fed isn't supporting large parts of the market, as I've mentioned, all the way from cryptocurrency down to like high-yield credit and so on. In 2007, as spreads widened going into the financial crisis, things looked really attractive from a historical perspective. And if you had stepped into credit at that time, you would have made a colossal mistake. And not that we're saying that's going to be repeated, but there's a lesson to be learned when there's artificial levels of liquidity and cash propping up these assets to wait for a bit before you can really see the true colors, the fundamentals that underlie some of the instruments that are out there. When we think about share repurchases, can you just remind me, I know the stock looks like today is probably getting close to book, which is, I think, a reflective of a great quarter. I think the way to think about it, Jason, is we're telling you and the market that we believe we're on the brink of a historic investment opportunity. And in that environment, cutting the dividend or buying back shares isn't sort of the #1 thing on our list. We think we can make good money, much higher than the level of our cost of capital. So I would very strongly say that, that's our mindset here. And I don't know, Byron, if you wanted to add anything with regards to the strategy or anything else. To our shareholders, thank you very, very much for giving us the opportunity to manage your money. And that concludes our call, and we look forward to speaking with you again next quarter."
}