{
    "symbol": "NWL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 11:41:12",
    "content": " Home Fragrance and Home Appliances declined in the first quarter as they lapped a significant surge in demand in the year ago period due to the pandemic and the passage of stimulus in the U.S., importantly, on both a 2-year and 3-year stack basis, core sales increased in the double-digit range for all 7 business units a fantastic achievement. As we shared last quarter, given the ongoing supply chain challenges that have beset the industry, retailers accelerated orders of seasonal products into the first quarter, particularly in the Outdoor & Recreation and Writing businesses, which contributed to the strong top line results. Despite the significant impact from inflation, Newell's normalized operating margin improved about 50 basis points versus last year, ahead of our expectations, largely reflecting incremental pricing actions and stronger management of overhead costs. Our actions over the past 3-plus years to drive sales growth, reduce complexity and overhead costs, double down on productivity, improve working capital management and build supply chain agility have put us in a much stronger position to effectively address today's challenges. We remain laser-focused on offsetting the inflationary pressure and improving the company's gross margin by implementing the following actions: driving productivity on self-manufactured operations, taking the necessary pricing actions across each business unit, reducing overhead costs, optimizing the effectiveness of promotional spend, and executing on the previously communicated product line exits from low-margin categories, primarily in home appliances and Outdoor & Recreation businesses. Core sales for home appliances declined 1.9% as the business lapped 38.9% growth in the year ago quarter, its toughest comparison of the year. For the full year 2022, we continue to expect net sales of $9.93 billion to $10.13 billion, reflecting flat to 2% growth in core sales and an over 6% headwind from the divestiture of the CH&S business, category exits, closure of some Yankee Candle retail stores as well as unfavorable foreign exchange. For Q2, we are forecasting net sales of $2.52 billion to $2.57 billion, with low single-digit core sales growth being offset by a greater than 8% headwind from the sale of the CH&S business, foreign exchange, category exits as well as closure of some Yankee Candle retail stores."
}