{
    "symbol": "NWL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 13:40:25",
    "content": " This should dramatically reduce fragmentation, accelerate growth and profit trajectory for our international businesses over time and increased depth and breadth franchise outside of the U.S. As part of Project Phoenix in the U.S., we're also moving to One Newell model for several of our top customers, centralizing these teams will simplify our customer interaction, significantly improve the customer experience and strengthen our position as a best-in-class partner. My interactions have led me to the conclusion that the organization is eager and excited about the future because Newell has a robust portfolio of leading brands with strong market share positions which when coupled with the right capabilities should allow us to continue on our journey towards becoming a world-class innovation-led consumer-driven company that can consistently grow sales and expand margins year after year and in doing so, generate meaningful levels of total shareholder return. As we've mentioned before, a key component of our aspiration to become a TSR leader in our industry, is predicated on creating a scaled world-class supply chain that positions Newell as the retailer partner of choice from a service, reliability and capability standpoint, and leads to breakthrough value creation in terms of margins, cash and reduced complexity. Having reached this major milestone in Newell's supply chain transformation journey, we are now at a point where we can begin to fully leverage the new go-to-market model to operationalize distribution and transportation benefits, improve customer service better enable omnichannel solutions and drive broad-based operational excellence across the organization. Net sales for the fourth quarter declined 18.5% year-over-year to $2.3 billion due to a 9.4% decrease in core sales as well as the impact of the divestiture of the CH&S business at the end of Q1, unfavorable foreign exchange and certain category and retail store exits. Since we expect many of the headwinds the company experienced in the second half of '22 to persist in 2023, we are maintaining a prudent bias when setting our demand and supply plans to ensure a heightened focus on cash flow generation, working capital improvement and optimization of Newell's cost structure. Our first quarter outlook assumes the following: net sales of $1.79 billion to $1.84 billion, including a core sales decline of 16% to 18% and a 7% headwind from the sale of the CH&S business on March 31, 2022, foreign exchange and certain category Yankee Candle store exits. But since then, you have Project FUEL, we have Ovid, now you have Project Phoenix, I think the commentary has been that there's no reason this cannot be a 17% to 18% EBITDA margin business longer term as we sort of look past this volume deleverage and so forth as we come out of the cycle."
}