{
    "symbol": "PSTG",
    "quarter": 3,
    "year": 2022,
    "date": "2021-11-23 22:15:26",
    "content": " Modernizing data infrastructure, operation and application, this quarter we announced the latest additions to our product portfolio that brings storage and applications even closer together Pure Fusion, our new software defined multi-cloud self-service storage environment is a major advance that will allow customers to better manage their data in a multi-cloud environment, while enabling developers to deploy sophisticated data storage services on demand. Today all of Pure’s capabilities are available as a service, we continue to see strong growth across Evergreen, Pure as a service and Portworx, which together represent a third of our revenues, Gartner has once again validated Pure’s leadership in both of their Storage Magic Quadrant, recognizing our execution and vision in primary storage and in the rapidly growing file and object market for unstructured data, given our speed and breadth of innovation, it should not be a surprise that more and more customers are purchasing the full Pure portfolio. But hey, when we think about it from a product gross margin or total perspective we look the largest driver really this quarter was the hyperscale or opportunity did have some headwinds, obviously with the increasing component, costs that we saw in the quarter, but that would be a much lower driver, if you will, in terms of what we saw in the sequential and year-over-year drop in the product gross margins. So seasonally it will get a bit worse, but we're not expecting that to make have a major change to in our expectations what business will - how business will perform this coming quarter, what we see is the strong demand and we believe that strong demand is based on fundamentals - fundamental demand, we don't think it's - we don't think that at least for our market, there's a lot of  demand out there and our lead times have stayed relatively low, our customers know that so they can order when they need it, not when not to gain the system. Yeah and Steve I probably wouldn't have much more to add on that, I think as we've got good visibility in terms of how we're looking at Q4 to Charlie's point, demand still is robust in terms of what we're looking at. Yeah, I would say that the - being a bit behind in hiring is across the board, there's no one - let's say, function that stands out to put some context on it, we're seeing somewhat slightly higher attrition than average years, certainly a lot more than last year, last year was very low by comparison to an average year, this this year is a bit higher I would say that recruiting, interestingly is the quality - the quality of resumes that one can bring on for interviews now lot of lots of blocks that we need to fill. But the when we think about the full fiscal year with our guide for Q4 which puts us around 10% non-GAAP operating margin, we're thinking about two to three points of that is tailwind from some COVID related aspects, whether that's less travel, whether that's less physical events from a marketing standpoint or from a hiring standpoint and obviously we're seeing a nice pace, an uptick on hiring."
}