{
    "symbol": "PSTG",
    "quarter": 1,
    "year": 2022,
    "date": "2021-05-27 00:53:05",
    "content": " So, we're seeing it across the supply chain, but again, that's been you know, considered in terms of how we're thinking about our Q2 guide, and that's why in the prepared remarks, I commented that about half of our overachievement for operating profit would be incremental, viewed as incremental to our annual guide. Yeah, well, as you know, it is a subscription based business and therefore, you know, it's a ratable – it takes a while for ratable products to make a big difference, you know, to the top line, but I have to say that, you know, both revenue growth is, you know, we're talking, you know, in and around, you know, doubling of revenue growth, and we've seen a much even larger expansion of pipeline. And so we've really taken the strategy of investing in a full suite of data management capabilities, to be able to help a customer deploy, build, deploy and get to production in multiple environments, whether that's on-prem, in the cloud, hybrid cloud or multi-cloud and you know, across the whole spectrum of development lifecycle, whether they’re just getting started, you know, getting the staging or going to global production scale. I guess I wanted to come back to the question of cost, not so much NAND, because I think that's fairly – seems like it's relatively predictable, but I'm wondering, Charlie, what are you guys seeing in other cost lines, like freight and things like that we hear a lot of people talking about various different upward pressure on, you know, cost into their businesses. We're still, you know, while we might be kind of seeing maybe some green shoots come up, mostly around the promise of people getting back to the office, you know, we’re just three weeks into Q2, you know, we've yet to see any real pickup due to that phenomenon, where we believe we may see that in Q2, and then we'll be in a better position, you know, once we have our next quarter’s earnings of being able to say what the rest of the year, you know, might look like, but given that your all the experience we've had to date this year have been 100% under COVID rules, it a little bit hard to speculate as to the second half of the year. And then, you know, obviously, see, we're very impressed with what's going on with C. And also say that, you know, flash player, acquired, you know, new unstructured data scale up customers at a much faster rate this quarter, that what we saw in the previous year-over-year quarter."
}