{
    "symbol": "ANGO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-06 13:31:05",
    "content": " Turning to our results, we ended the quarter with revenue of $81.5 million, representing growth of roughly 6% year-over-year, led by growth of approximately 30% from our Med Tech segment over the first quarter of last year. Our revenue for the first quarter of FY 2023 increased 5.9% year-over-year to $81.5 million, driven by continued strength and our Med Tech platforms, including Auryon, NanoKnife and thrombus management. Med Tech revenue was $22.8 million, a 29.6% year-over-year increase, while Med Device revenue was $58.7 million, declining 1.1% compared to the first quarter of FY 2022. Our Auryon platform contributed $8.8 million in revenue during the first quarter, a 50% increase compared to last year. Our forecast for Auryon for the year remains unchanged, as we expect to see continued year-over-year growth throughout the course of FY 2023 and generate full year revenue in the range of $40 million to $45 million. Our research and development expense during the first quarter of FY 2023 was $8.3 million or 10.2% of sales, compared to $7.4 million or 9.6% of sales a year ago. SG&A expense for the first quarter of FY 2023 was $36.6 million, representing 44.9% of sales, compared to $33.4 million or 43.4% of sales a year ago. Our adjusted net loss for the first quarter of FY 2023 was $2.5 million or adjusted loss per share of $0.06, compared to an adjusted net loss of $900,000 or adjusted loss per share of $0.02 in the first quarter of last year. The first quarter 2023 we used $24.7 million in operating cash, had capital expenditures of $800,000 and additions to Auryon placement and evaluation units of $2.2 million. At the closing of the revised facility, we drew $25 million on the delayed-draw term loan in connection with the Auryon lasers currently in the field, as well as lasers we expect to place during the first half of FY 2023. The end result of this financing is that we reduced our total available debt facility from $125 million to $105 million, reducing fees paid on unused portions that were unlikely to utilize and adding a delayed-draw term loan to match the cash use of Auryon lasers with their revenue and expense profile. We continue to anticipate FY 2023 revenue in the range of $342 million to $348 million and we expect full year adjusted earnings per share to be in the range of $0.01 to $0.06 as we continue to invest in driving sustainable growth in our key Med Tech platforms, while also managing continued headwinds. So youâ\u0080\u0099re going to see growth the next couple of years come from both sources, new customers coming online due to their increased awareness of the product and our same-store sales going up by really two main factors driving that, Matt, one is the new product innovations weâ\u0080\u0099re doing like the hydrophilic coating, where the arterial thrombectomy indication, things like that, where people can use it for more. So as you put all those together and weâ\u0080\u0099re methodically working through the backorder that we have ending the first quarter at $7.1 million having taken about $1.3 million out, we expect to continue to drive that down in the Med Device business."
}