{
    "symbol": "EGHT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-10 20:40:06",
    "content": " We delivered another solid quarter of ARR growth, non-GAAP profitability and positive cash flow as we continue to advance our strategy of empowering Personas company-wide through integrated contact center and unified communication capabilities. XCaaS now accounts for approximately 35% of combined 8x8 Fuze ARR and given the Fuze enterprise base, we see an opportunity to grow this materially over the next several years. A few recent examples of new XCaaS customers include Radian, which provides industry-leading mortgage and real estate products and services as part of their digital transformation initiative they turn to 8x8 XCaaS and 8x8 Voice for Microsoft Teams to support over 1,700 employees. By implementing the full power of 8x8 XCaaS with Voice for Microsoft Teams and CPaaS SMS API, Think Research will enhance overall customer experience, as they improve agent efficiency and productivity, using new channels to confirm appointments and recruit beta testers for drug trials and new therapies. The 8x8 Voice for Teams direct routing solution was also a significant contributor to the growth in enterprise customers and ARR, as momentum continued to build in the fourth quarter. Customers choosing 8x8 Voice for Teams in Q4 included one of the UK's top 10 universities, the University of Bristol who turned to 8x8 XCaaS and 8x8 Voice for Microsoft Teams to provide over 27,000 students access to new channels. They selected 8x8 XCaaS and 8x8 Voice for Microsoft Teams as a key part of their digital transformation, providing a global communications and omnichannel contact center capabilities, to support over 1,300 employees in 19 countries. Taking the current business performance and market environment in new account including the recent performance of CPaaS we are establishing guidance for fiscal first quarter fiscal 2023 ending June 30, 2022 as follows; we anticipate service revenue to be in a range of $177 million to $180 million, representing 28% to 31% year-over-year growth. You've seen things like our Agent Workspace, Conversation IQ, which takes traditional contact center features, such as speech analytics, quality management and across the whole organization really cool product allows more informal queues to have the ability for visibility for the supervisor to manage professionalism and unified approach to customers."
}