{
    "symbol": "EGHT",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-02 23:09:09",
    "content": " For example, the NHS National Services, Scotland, which handles over 1 million calls per month, supporting Scotland's vaccination health lines and booking services, expanded their 8x8 XCaaS investment since their original purchase in fiscal Q1 2021, they have more than triple their investment in XCaaS, expanding every quarter and now total more than 2,500 UCaaS seats and over 1,300 CCaaS seats. In summary, since I joined 8x8, nearly a year ago, we have strengthened our leadership team aligned our R&D investments to leverage a massive market opportunity and created a C P T culture built on the core 10 of customer first product first and team first, the migration to cloud based communications is just beginning and we are well positioned with differentiated technology market, leading global coverage and a unified platform to optimize customer and employee communications. Last fiscal year, 2021 wholesale CPaaS services contributed approximately 15 million in service revenue in essentially no operating margin exiting this business causes roughly a 3% headwind in FY 22 revenue growth for the second quarter of this year. This part of the business did not contribute revenue down from $1.1 million last quarter and approximately 3 million in Q2, 2021 second quarter non-gap gross margin was 64.2% as expected and higher sequentially as service revenue accounted for a more significant percentage of total revenue. And we are now fully exited our low margin wholesale CPaaS business non-AP service revenue, new margin increased approximately 50 basis points over the previous quarter to nearly 70% and was up 250 basis points versus Q2 2021 non-gap other revenue margin came in at minus 16.6% for the quarter, an improvement from minus 27.7% a year ago, a and sequentially better than the minus 19.6% reduced endpoint shipments were a factor in the margin improvement in total gross profit dollars grew 24% year over year. Your line is open. I'll take the first part of that on the Microsoft Teams, direct routing integration the team's opportunity is obviously very significant just in five quarter since launch we're now at over a hundred thousand users and attaching an enterprise communications platform into the productivity suites and teams being a messaging platform within that is a huge opportunity as the vast majority of those users are not on enterprise communications today. And then on the second part of your question, I think the answer you're looking for and, you know, follow up if I got it wrong, but in the second half of '21, so last year the wholesale CPA business produced about $9 million in total revenue broken down by about $4 million in Q3 and $5 million in Q4 fiscal. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}