{
    "symbol": "ISRG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 20:40:04",
    "content": " As a result of our procedure and capital performance, Q2 revenue was $1.52 billion, an increase of 4% from the second quarter of 2021. Additional revenue, statistics and trends are as follows: in the U.S., we've placed 150 systems in the second quarter lower than the 213 in Q2 of 2021, reflecting a decline of 59 systems associated with trade-in transactions, a softer demand environment, and the delay of some system placements into July. Leasing represented 42% of Q2 placements compared with 35% last quarter and 33% in the second quarter of 2021, the higher lease mix primarily reflected an increase in the proportion of O-U.S. customers that lease a system in the quarter versus purchased, driven in particular by customers in Europe. Second quarter system average selling prices were $1.50 million slightly lower than the $1.54 million last quarter, although system ASPs were roughly flat, lower trade-in volumes benefitted Q2 ASP, offset by an unfavorable impact from the stronger U.S. dollar and a higher mix of lower price Xi systems, primarily driven by customers in Europe. Our overall second quarter 2022 procedure growth was 14%, compared to 68% for the second quarter of 2021, which we believe benefited from a number of procedures which had previously been deferred due to COVID-19. In the U.S., second quarter 2022 procedure growth was 11% year-over-year, compared to 77% for the second quarter of 2021 and 16% last quarter. Outside of the U.S., second quarter procedure volume grew approximately 22%, compared with 51% for the second quarter of 2021 and 25% last quarter. While procedure growth so far in the first half of 2022 has been healthy, the capital pipeline in the U.S. has been softer than in prior periods, mainly due to a lower number of SI systems in the installed base available for trade-in and macro-related headwinds creating pressure on the hospital capital spending. With a three-year compound annual growth rate in procedures of 16% from Q2 of 2019 to Q2 of 2022 and installed base growth of 11% over the same period, utilization of installed systems has continued to increase through the pandemic and first half of 2022."
}