{
    "symbol": "ISRG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 19:04:03",
    "content": " In the quarter da Vinci procedures grew 19%, compared to the first quarter 2021. In our flexible robotics program, Ion procedures grew approximately 350% in Q1, compared with Q1 2021, reflecting continued strength in adoption and utilization of the platform. Overall, Q1 results reflected approximately 19% procedure growth as compared to the first quarter of 2021 and system placements of 311 systems, resulting in an expansion of the installed base of da Vinci systems of approximately 13%. On a three-year compound annual growth rate basis, first quarter procedures grew approximately 15%. Utilization of clinical systems in the field, measured by procedures per system, increased approximately 6% compared to last year. In the US, we placed 186 systems in the first quarter lower than 190 in Q1 of 2021, reflecting a decline of 28 systems associated with trade-in transactions, partially offset by increased placements to greenfield customers. Instrument and accessory revenue per procedure was approximately $1,870 per procedure, compared with $1,940 per procedure in the fourth quarter of 2021, and down 4% from the $1,950 realized in the first quarter of last year. Pro forma gross margin for the first quarter of 2022 was 69.8%, compared with 71.8% for the first quarter 2021 and 70.1% last quarter. As of the end of Q1, we had just over 10,500 employees, an increase of 26% from the first quarter of 2021 or an increase of 20% on a three-year CAGR basis. In the U.S., first quarter 2022 procedure growth was 16% year-over-year, compared to 14% for the first quarter of 2021 and 16% last quarter. First quarter 2022 Ion procedures totaled just over 3,900 in Q1 2022, an approximately 350% increase over the prior year and 34% over the prior quarter. During the quarter, Dr. Peres Shaw along with colleagues from the Robert I. Grossman School of Medicine at New York University and in collaboration with Intuitive published a real-world body of evidence assessing open conversion rates during minimally invasive surgery using laparoscopic, thoracoscopic, or da Vinci robotic surgery across 10 common procedures for benign or malignant conditions. In the second quarter of 2022, our year-over-year procedure growth rate will likely be lower than recent quarters, as Q2 2021 results reflected a strong recovery in procedures as COVID began to subside."
}