{
    "symbol": "GTH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-02 20:02:01",
    "content": " Hello, everyone, and welcome to Genetron's first quarter 2022 earnings conference call. With respect to any non-IFRS measures discussed during today's call, the company's reconciliation information related to those measures can be found in the earnings release issued earlier today. And I will provide financial highlights related to the unaudited first quarter results outlined in today's release, as well as our outlook for 2022. As a leading provider of precision oncology product services in China, our comprehensive portfolio covers the entire spectrum of cancer management from early screening and therapy selection to MRD monitoring and the development of CDx with biopharma companies. Turning to slide four, the first quarter was rather productive for Genetron. The recent highlights include a new CDx collaboration agreement with HUTCHMED for their ORPATHYS, drug for non-small cell lung cancer using our marketed 8-gene lung cancer assay. Receiving the CE Mark of the Seq-MRD kit for the detection of hematologic cancers as well as FusionScan Plus, which uses integrated DNA and RNA as templates for genetic alteration detection. A peer-reviewed publication of Mutation Capsule’s potential in MRD asset development in Clinical and Translational Medicine, as well as 17 clinical data presentations at the American Association for Cancer Research Annual Meeting. In the first quarter of 2022, we grew diagnostics and monitoring revenue by 14% to RMB99.5 million, of which IVD in hospital sales rose 18%, driven by greater adoption of our sequencing platforms in assays, including the Genetron S5 instrument and 8-gene Lung Cancer Assay. On the LDT side of the business, we grew revenue by 14%, of which diagnostic test volume grew about 9% year-over-year in the first quarter. In addition to higher sequencing revenues, the growth was also a result of an increasing biopharma partnerships and the meaningful progress we are making with each. In November 2021, we initiated NMPA registration trial for our HCC early detection assay by beginning the enrollment for the trial of our methylation multi-marker PCR based assay, HCCscan. Based on the nucleic acid testing needs and associate government-led infrastructure builds since COVID, PCR capabilities continue to increase across healthcare systems in China. Based on these dynamics, we believe that adding a high-performing PCR-based assay would be commercially viable, while also providing self-pay patients in lower-tier markets with a cost optimal solution. We have already shared some early retrospective CRC data during our last earning calls, showing over 91% of sensitivity and 95% specificity. On the MRD side, recall that we have announced a exciting multiyear co-development agreement with AstraZeneca R&D China for an NGS-based personalized MRD test for solid tumors in China. MRD testing has the potential to help in the clinical management for patients well before metastatic lesion grow to the size detectable by conventional methods, such as MRI and CT scan. With this partnership, AZ plans to use this co-development MRD test for China-specific solid tumor clinical trials that are designed to incorporate the use of NGS-based personalized MRD test. Concurrently, we're also planning a pilot LDT launch in the second quarter and expect to expand the official launch before year-end. The assay would be developed based on Genetron's patent Mutation Capsule platform, a method for detecting mutation methylation of tumor-specific genes in ctDNA. The mutation capsule platform enables multiple test analysis based on a single cfDNA sample, providing head-to-head comparisons between multiple MRD strategies, such as personalized and non-personalized assays as shown in Slide 9 and 10. The liver data was recently published in clinical and translational medicine, demonstrating the technology's potential in MRD assay development. Beyond tumor-informed MRD assay, we're also exploring tumor naïve MRD approach based on the same technology platform. We continue to be optimistic about the MRD solid tumor market in China and in particular, Genetron's competitive position after the AstraZeneca collaboration. On Slide 11, for seq-MRD in hematological malignancies, our exclusive partnership with Fosun Pharma in China is progressing well. Although, we're pleased with continued support by the healthcare authorities of MRD testing in hematological malignancies in China and we believe that our NGS based seq-MRD represents a innovative and differentiated solution. In the first quarter, we have signed on additional four biopharma partners, increasing the total now to 64 partners. We continue to maintain a strong pipeline, as we have the opportunity to form partnerships through our key products, including Seq-MRD, Onco PanScan, FusionScan and others. So recently, we have announced our CDx partnership with HUTCHMED for savolitinib in non-small cell lung cancer, using our already marketed 8-gene lung cancer IVD assay. As mentioned, our 8-gene lung cancer assays are already gaining very good traction in the IVD in-hospital use market. We're excited about this partnership as it is our second major CDx after our first one CStone for avapritinib, which has entered the NMPA priority review and approval process. In China, the trend of CDx demand is growing stronger, resulting from NMPA's increasing focus on genomic testing for innovative targeted immunotherapies. So now I will turn the call over to our CFO, Mr. Evan Xu, to provide more details on our first quarter financials. In the first quarter, our total revenue increased by 19.8% to RMB110 million, from RMB92 million in a same period of 2021. LDT diagnostic tests sold in the first quarter increased by 9% to approximately 5,560 units. Cost of revenue increased by 30% to RMB49 million for the three months ended March 31, 2022, compared to RMB38 million in same period of last year. As a result, gross profit increased to RMB62 million in the first quarter this year from RMB55 million in the same period of last year. Gross profit margin was 56% for the first quarter this year, compared to 59% in the same period of last year. Specifically, gross margin for our LDT segment was 64% compared to 68% a year ago, primarily due to promotional activities related to HCCscan. For our IVD segment, gross margin was around 50% versus 34% in the prior year, thanks to higher consumable sales. The increase was primarily driven by increased headcount in the sales and marketing team to expand Genetron's core business, including our early screening efforts. And because of the -- partially because of the COVID impact, the revenue growth for this quarter has been affected. The increase was driven by both higher R&D headcount, as well as continued investments in core product development and clinical trial activities such as HCCscan. As a result, operating loss was $180 million for this first quarter compared to RMB109 million last year. On slide 19, net loss for the period was RMB175 million compared to RMB115 million for the first quarter of 2021. For non-IFRS net loss, per ordinary share this quarter is $0.35 and for the prior year was $0.23. We have cash and cash equivalents in the current financial assets at fair value through profit and loss at RMB559 million as of March 31st, 2022. In January, our LDT revenue actually grew rather strongly with a year-over-year growth of nearly 30%. In March, LDT revenue experienced a single-digit year-over-year decline, as COVID cases were rising in Shanghai, Shenzhen and several parts of the country. In April, we saw even more -- even deeper negative double-digit year-over-year decrease for our LDT revenue. Many of you may have heard about the severe COVID-related measures in Shanghai, in particular, that began at the end of March until actually very recently, only until June 1, basically one day ago, Shanghai starts to gradually open up. As a result, it has been extremely difficult for us to conduct any activities in this particular city, which has had a negative impact on our businesses, in particular, LDT revenues. In fact, our lab in Beijing where our headquarter is based is also participating in government-led COVID testing programs. While the situation is challenging for our operations, it has negatively impacted our business – our core business volumes, we are very glad that Genetron could step up and take action against fighting COVID together with relevant government authorities. In regards to our financial guidance, in March, when we provided our 2022 revenue projection, we had anticipated that in challenging business environment would persist and have baked in a relatively conservative assumption. But at this point, we are maintaining our revenue guidance to be around RMB 585 million to RMB 638 million or around 10% to 20% of growth compared to year 2021. I would like to emphasize the strong underlying long-term fundamentals of our business that position us very well to drive substantial growth through continued commercial, clinical and pipeline development execution. Shown on Slides 22 and 23, we remain focused on the development of liquid biopsy-based solutions across the full-cycle cancer management, particularly in early screening, MRD and the CDx, while continuing to ramp up our commercialization efforts and grow our core business. For example, with our 8-gene lung cancer assay, which represents as one of the most clinically important test for non-small cell lung cancer, we continue to believe that the government reimbursement inclusion would be -- could be established for certain regions in the next 12 to 24 months. First on 2Q performance, so I think you mentioned in March and also in April, we are seeing some revenue impact. So, yes, first of all, in second quarter, as I mentioned that April was probably the worst month so far, given the hope that was really -- some of our key markets was deeply in the lockdown mode, in particular, Shanghai and some Northeast provinces. So actually, we saw a double digit, around 30% of decrease year-over-year for April. So, hopefully, by end of second quarter, which means June, we should have catch-up compared to last year in terms of LDT revenue. I think all-in-all, second quarter we -- pretty hit by the COVID in terms of volume and revenue. So therefore, some of our essentially unused lab capacity due to the impact that the COVID has been leveraged to provide the COVID testing, which means that, that part will contribute to some of the revenues in Q2 as well as share essentially some of the costs -- the fixed costs that Evan have just mentioned. So, as we discussed before in previous conversations, this is in fact, a co-development partnership here, which means that both sides will invest into the development and the validation of these assays. First of all, AZ is committed to use this assay and pay for the service, essentially for the assay and the testing service, again, exclusively on all their related China-specific trials. But the both sides are excited that we will be able to co-develop this assay with essentially the technology from Genetron and samples and data from AZ plus the investment from both sides, and we see quite a bright future to incorporate this -- essentially incorporate or commercialize this assay in both the clinical trials as well as to serve the patients in the clinical setting."
}