{
    "symbol": "AN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 13:58:03",
    "content": " 03:52 As we all know success in the used car market, basically dictated by your ability to manufacture great quality, well priced desirable used cars and this clearly covers key elements of the business, including efficient and effective reconditioning for example, but it all starts fundamentally with your ability to competitively acquire used inventory and with strong consumer demand we continue to focus on our self-sourcing capabilities for used vehicles, which I think further strengthened both our franchise dealerships, but also our AutoNation USA businesses. 04:42 Now, as previously announced, the company entered two new markets this quarter with AutoNation USA Charlotte in North Carolina and AutoNation USA in Charleston in South Carolina and our AutoNation USA stores continue to exceed our expectations in these two new stores were both profitable during the first four months of operation and we remain on plan to open 12 additional stores over the year and our target, as you know, is to have over 130 for these stores in operation from coast-to-coast by the end of 2026. 06:30 Great performance from our sales and CFS teams growing our used business and our per unit CFS performance, our service and parts teams led by our technicians, service line  and our parts teams delivered strong performance improvement and as you see all of our associates and frankly that’s -- whether they worked in our dealerships, collision centers, auction or support functions around the country demonstrated the continued clear focus on margin, but also expense control discipline. Towards the end of last year and progressively through Q1, we've been I think strengthening our data analytics with regard to used vehicles not just in terms of being more precise in what vehicles, what segments, what geographies are moving and in which direction, but also how that applies to our inventory levels, and frankly, I didn't like some of the -- as a result of that, frankly I didn’t like some of the profile that we had and I wanted to make sure, whilst we were developed in a very strong quarter that we took the necessary actions to realign it. It's interesting, I think, because what was actually happening today is vehicle have been sold to MSRP and the margins that we are getting are as a result of vehicles being sold to MSRP, I thought that fundamentally that was the business model we supposed to be achieving, and I never was able to achieve it as a CEO of an OEM for all those the reasons partly, because the levels of inventory that were in that retail network have to be turned and they have to be turned in the fashion that meant heavy discounting. 29:38 Yes, I think as we've seen over the last 24-months and we'll continue to say the way that people are valuing companies is changing and will continue to change, but the math that you did broadly was right with the exception of one thing and that is that some of the acquisitions that we're looking at and frankly are pursuing will give us I think a multiple higher than the historical business has been able to generate, because our industry is going to change. 30:18 But one of the things that AutoNation has done is, I think they have not -- there has been a strategy to try and maximize the benefit to the shareholders where capital has been and certainly in the first quarter with everything that was going on and the fact that we are reviewing and have reviewed some of our strategic priorities it was best for us to maintain that activity and you've seen the results come through, but that doesn't mean to say there aren't attractive acquisition opportunities for us, there are, and as the year goes through you'll hopefully see some. I wanted to touch on the new vehicle side of your business and maybe you can speak to, if you're seeing any change in the consumer profile of your new vehicle buyer, either from a credit quality standpoint or median average income and kind of thinking forward as we go through what it could be a potential recessionary environment certainly a rising interest rate environment, how you think your new vehicle business positioned now versus prior cycle. 37:14 In terms of where I think new vehicles going forward, if you looked at the SAAR in the first three months of this year, it's bouncing around $13 million, $14 million and typically those numbers would have been associated with the recessionary period obviously. I think what Joe didn't touch on is one of the efficiencies that Mark Cannon and his team has been able to generate is the way that they are communicating in the use of different media channels and I think that, that typically what we would do is really use the data that's available to see how the demographic that we're targeting in that particular area is consuming information and then just basically built an optimum plan to try and make sure that we hit communication goals and marketing those in the timeframe that we need to launch and he does that individually by each and every market even though there's obviously a lot of commonality and then effectively runs it out."
}