{
    "symbol": "AEL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 23:20:04",
    "content": " Year-to-date through April 30, we have repurchased $253 million of stock at an average price of $39.89 and we expect to repurchase in total approximately $700 million of stock for the full year, meeting our promised goal of capital return and fully offsetting dilution from issuance of shares for Brookfield reinsurance as it grew its stake in American equity from 9.9% to just about 16% in early January. On a sequential quarterly basis, FIA or fixed index annuity sales decreased 10.1% to $883 million, primarily due to lower sales in the bank and broker-dealer channel, while maintaining a leading market position in the independent marketing organization, or IMO space. At quarter end, cash and equivalents in the investment portfolio was $576 million towards the low end of our stated target portfolio allocation of 1% to 2% and down from $2.6 billion at year-end. During the quarter, we invested $4.7 billion at a yield of 3.58%, including $887 million of privately sourced assets at an expected return of 5.41%. Other operating costs and expenses were $58 million in the first quarter, down from $66 million reported in the fourth quarter of last year or a comparable $59 million for the fourth quarter, excluding the year end items related to true-ups and acceleration of execution of the AEL 2.0 strategy. As Anant mentioned, while we continue to build out our teams with specialized expertise and invest in the systems infrastructure and other projects necessary to support our growth as the new AEL, we still expect other operating costs and expenses to run in the $60 million range per quarter for the foreseeable future and manage expenses at a certain level of basis points of policy order funds under management. Your line is open. Your line is open. Your line is open. But between Estate Shield, Select Income Focus and Income Shield, we're going to have the new products probably add in this year, $300 million of sales rounding a bit there, rounding down a bit there, but that's sort of in aggregate between the existing Income Shield in those, they'll transfer on a net basis $1 billion. Your line is open. And like Anant said, from a kind of run rate perspective across those two products, you're looking at about $80 million to $100 million per quarter, that's being written currently. Your line is open. Your line is open. Right, if we grow it by – Pablo, if you grow by $1 billion a year just in this treaty, and we make pricing levels that we have, that's I could set a 170 basis points, that $17 million of earnings, which zero, zero requires capital. Your line is open."
}