{
    "symbol": "AEL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 11:56:13",
    "content": " I will let Jim and Axel walk you through specifics in a few moments, but we continue to see meaningful opportunities to play offense, and will continue to return capital to shareholders, including having repurchased 4.95 million shares in the second quarter at an average price of $38.20. In the quarter, we put an additional $1.4 billion to work in private assets, bringing our total allocation to private assets to 16.6% of the investment portfolio. We were generally pleased with the quarter reporting non-GAAP operating earnings per share of $0.98, driven by strong yields on the investment portfolio, in line expenses and continued decline in share count, driven by our robust capital return execution. During the quarter, we invested $2 billion at a yield of 4.88%, including $1.4 billion of privately sourced assets, at an expected return of 5.10%. As of June 30, the point-in-time yield on our investment portfolio is 4.05%, reflecting the benefit from the increase in LIBOR and the further increase in our allocation to privately sourced assets, partly offset by higher expected expenses, as we build out our investment platform. For the third quarter, we expect an additional benefit of roughly 16 basis points in yield, reflecting the increase in LIBOR on our $5.2 billion of floating rate assets. Excluding prepayment income and hedging gains, adjusted spread was 2.57% in the second quarter, compared to 2.45% in the prior quarter, reflecting strong investment returns, offset modestly by the increase in cost of money. Deferred acquisition costs and deferred sales inducement amortization totaled $133 million, compared to $129 million in the first quarter, reflecting $8 million of additional expense due to lower index credits during the first quarter and partially offset by lower expense due to lower living benefit utilization during the first quarter. Second quarter amortization was $6 million greater than the model's expectations, primarily due to higher interest margin and lower-than-expected index credits. Given the low level of projected index credits and projected increase in net investment spread, we would expect amortization of back-end DSI to be in the $140 million to $145 million range in the third quarter under current best estimate actuarial assumptions. The liability for guaranteed lifetime income benefit payments increased $96 million this quarter, compared to $85 million last quarter, primarily due to lower index credits in the first quarter and partially offset by lower labor utilization and higher lapses than in the first quarter. Second quarter LIBR reserve increase was $34 million higher than modeled expectations, primarily due to lower-than-expected index credits and higher labor utilization than modeled expectations. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}