{
    "symbol": "AEL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:43:14",
    "content": " For the third quarter of 2022, we reported non-GAAP operating income of $114 million or $1.29 per diluted common share compared to non-GAAP operating income of $79.5 million or $0.85 per diluted common share for the third quarter of 2021. Excluding actual assumption updates, which was the first notable item this year and the single notable item for this quarter, operating income for the third quarter of 2022 was $87.4 million or $0.99 per diluted common share compared with $136.3 million or $1.46 per diluted common share in the year ago quarter. On a pretax basis, the effect of the third quarter 2022 updates before the change to earnings pattern resulting from these updates, increased amortization of deferred policy acquisition costs and deferred sales inducements by $19 million and decreased the liability for future payments under lifetime income benefit riders by $53 million for a total increase in pretax operating income of $34 million. Last year, we set our assumptions for aggregate spread at American Equity Life to increase from 2.25% in the fourth quarter of 2021 to 2.40% by year end 2022 and then to move to 2.50% at the end of the eight year reversion period, with a near term discount rate through 2023 of 1.55% and eventually grading to 2.10% by the end of the eight year reversion period. The final major change was to increase our lapse assumptions on non-utilized guaranteed retirement income policies, reduced lapse assumptions on utilized guaranteed retirement income policies and generally increased partial withdrawal assumptions on the total book of business, resulting in an increase in the reserve for lifetime income benefit payments of $20 million and an increase in DAC and DSI amortization of $200 million. Partnerships and other mark-to-market assets, which are reported on a one quarter lag basis contributed $29.8 million to investment income, or 22 basis points to yield in excess of assumed rates of return used in our investment process. Excluding the effects of assumption revisions, deferred acquisition costs and deferred sales inducement amortization totaled $145 million compared to $133 million in the second quarter, reflecting an $11 million increase in expected amortization following the assumption changes I detailed earlier, and $8 million of additional expense due to actual higher surrenders than expected. Third quarter amortization was $7 million greater than new modeled expectations primarily due to higher interest margin lower-than-expected index credits and actual higher surrenders than expected, offset in parts by lower than modeled option budget and crediting rates. Excluding the effect of assumption revisions, the liability for guaranteed lifetime income benefit payments increased $11 million this quarter compared to the second quarter, reflecting an $8 million increase in the expected increase in the reserve following the third quarter assumption changes. The third quarter increase in the liability for guaranteed lifetime income payments was $37 million more than modeled, due primarily to the near zero level of index credits, which increased the reserve by $23 million and small variances in labor utilization, which added $6 million to expense above expectations. For the fourth quarter, our modeled expectation for the increase in the liability for guaranteed lifetime income benefit payments is $72 million before adjustments associated with actual experience in the quarter based on in-force policies as of September 30. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question. So how are we going to fund buybacks on a sustained basis through not doing reinsurance deals that free up capital, which frankly is meant to invest back in growing in funding C1 capital for higher investment income on the spread business is by getting 100 basis points between ALM fees and our ceding commission every year, going up by $3 billion, $4 billion, $5 billion in that number, right."
}