{
    "symbol": "BOX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-02 21:14:05",
    "content": " and our expectations regarding our financial performance for fiscal 2023 and future periods, including our free cash flow, gross margins, operating margins, operating leverage, future profitability, net retention rates, unrecognized revenue, remaining performance obligations, revenue and billings, and our expectations regarding the size of our market opportunity, our planned investments and growth strategy, our ability to achieve our long-term revenue and other operating model targets; the timing and market adoption of and benefits from our new products, pricing models and partnerships. We grew fourth quarter revenue 17% year-over-year, a fourth consecutive quarter of accelerating revenue growth and delivered operating margin of 21% and RPO of 19%, which is greater than revenue growth and is an important leading indicator of the strength of our business. We also made meaningful updates to our governance functionality to help support customers' legal hold and document retention needs with security, compliance, data governance and privacy capabilities remaining, one of the most critical reasons customers choose the Box Content Cloud, we will continue to make prudent investments to extend our leadership position and reaccelerate growth in this area. To drive these efforts over the past couple of years, we have worked to optimize our customer renewal and expansion notion, target high-value and repeatable use cases that differentiate Box, expand our ecosystem of system integrators and partners to bring Box to market for larger enterprises and double down in key regions and segments as well as leveraging our digital channel for growth. For the full-year of FY '22, we delivered annual revenue growth of 13%, which includes a roughly 60 basis point tailwind from foreign exchange rates. We also delivered revenue growth plus free cash flow margin of 33%, exceeding our initial 30% target and achieving a significant improvement from the 26% we recorded in the prior year. Q4 revenue of $233 million was up 17% year-over-year, a fourth consecutive quarter of accelerating growth and above the high end of our guidance. Q4 gross profit of $175 million was up 20% year-over-year, exceeding our revenue growth rate by 300 basis points. For the first quarter of fiscal 2023, we anticipate revenue of $233 million to $235 million, representing 16% year-over-year growth at the high end of this range. For the full fiscal year ending January 31, 2023, we expect FY '23 revenue to be in the range of $990 million to $996 million, up 14% year-over-year at the high end of this range. Finally, we expect our FY '23 revenue growth rate combined with our FY '23 free cash flow margin to be at least 37%, 200 basis points higher than our previous target and a 400 basis point improvement from last year's outcome of 33%. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}