{
    "symbol": "MODG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 18:57:03",
    "content": " Full year 2022 revenue was just under $4 billion and full year adjusted EBITDA was $558 million, up 22% and 25% year-over-year on a 12-month or full calendar year basis. We delivered over $1.5 billion in revenue and $235 million in adjusted EBITDA, growth of 26% and 31%, respectively, on a 12-month or full calendar year basis. For the full year 2023, we now estimate revenues will be approximately $4.45 billion, up approximately 10% to 12% and an adjusted EBITDA will increase approximately 11% to 15% to $620 million to $640 million. On a segment basis, our full-year outlook assumes continued success at Topgolf with approximately $1.9 billion of segment revenue and approximately $300 million to $320 million in adjusted EBITDA. During 2022, we generated record net revenue of $3.996 billion, a year-over-year increase of 28% or 32% on a constant-currency basis, driven by broad-based strength across each of our operating segments. Lastly, full-year adjusted EBITDA was $558 million, an increase of 25% or 42% constant currency compared to 2021. For the fourth quarter, net revenue was $851 million, an increase of 20% compared to Q4 2021 or 25% constant currency. Our fourth quarter 2022 non-GAAP seasonal operating loss was $25 million, a 42% improvement compared to Q4 2021 due to the strong revenue growth. At the segment level, Topgolf contributed $410 million in revenue in the quarter, a 22% increase over 2021, reflecting strong same-venue sales growth and additional new venues. Adjusted EBITDA for Topgolf was $43 million, down $3 million compared to Q4 2021 due primarily to higher preopening and marketing expenses. Golf Equipment capped off a very strong year with Q4 revenue of $190 million, an 18% increase over Q4 2021, or a 25% increase on a constant-currency basis. Segment operating income increased to 103% to 700,000 of income compared to a $25 million seasonal loss in Q4 2021, as pricing and volume benefits more than offset higher input costs and foreign currency headwinds. Lastly, our Active Lifestyle segment had revenue of $252 million, up 17% or 28% on a constant-currency basis compared to Q4 2021. Total company CapEx for full year 2023 is expected to be approximately $255 million, which includes $80 million of CapEx for the non-Topgolf business. For the full year, we estimate net revenues will increase approximately 10% to 12% to be within the range of $4.415 billion to $4.470 billion. Topgolf segment revenue is expected to be approximately $1.9 billion, driven by new venue development and same-venue sales growth. We expect full year 2023 adjusted EBITDA will increase approximately 11% to 15% to be within a range of $620 million to $640 million, with Topgolf generating approximately half of that adjusted EBITDA, the total company EBITDA estimate includes a $20 million negative FX impact. We expect Topgolf segment revenue of just under $400 million, driven by same-venue sales growth and the revenue benefit from Topgolf venues recently opened in Q4. The Topgolf segment adjusted EBITDA in the quarter will be slightly below the $42 million we generated last year, driven by higher marketing expenditures and a return to full staffing in the venues."
}