{
    "symbol": "MODG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 23:15:25",
    "content": " We now expect this segment to be up 12% or more for the full year and increase from the approximately 10% we said previously, as demand continues to remain strong in the key U.S. and Asia markets, supply chain restrictions have abated, and we're having strong market share performance. For the second quarter consolidated net revenues was $1.12 billion, an increase of 22% compared to Q2 2021. Looking at our segment performance Topgolf contributed $404 million in revenue in the quarter, a 24% increase over 2021 and reported same-venue sales growth of 7.9% compared to 2019. Golf Equipment had another excellent quarter, generating $452 million in revenue, a 13% increase over Q2 2021, driven by the continued high demand, strong market shares, and improve supply in Golf Equipment, which allowed for an inventory catch up at retail. Second quarter 2022 non-GAAP operating income was $135.1 million, up $17.1 million year-over-year, a 14.5% increase. Lastly, Q2 adjusted EBITDA was $207 million, up $43 million or 26% over Q2 2021 and our EBITDA margins improved to 18.6% compared to 18% for the same period last year. Our inventory balance increased to $604 million at the end of the second quarter of 2022 compared to $534 million at the end of the fourth quarter 2021 and compared to $335 million at June 30th, 2022 -- I mean, excuse me, 2021. For the full year, we expect total CapEx of approximately $325 million, net of reimbursement including approximately $250 million for Topgolf and $75 million for the non-Topgolf business. Our full year adjusted EBITDA forecasts also increased and is now projected to be $555 million to $565 million, which assumes approximately $235 million to $245 million from Topgolf. For the full year 2022, adjusted EBITDA is expected to increase over $100 million compared to 2021. Given the second half launch timing of Golf Equipment products in 2022 versus 2021, we expect Golf Equipment will be down mid to high single-digits for the third quarter, but is expected increase double-digits in the fourth quarter, resulting in 12% or more growth for the full year. We expected adjusted EBITDA will increase by approximately $40 million in the fourth quarter compared to 2021, resulting in an overall increase of 19% for the second half of 2022."
}