{
    "symbol": "PGR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 16:05:27",
    "content": " Excluding catastrophe losses, our third quarter company-wide combined ratio improved 1.9 points year-over-year and illustrates the significant work we've done to combat the effects of inflation and working towards achieving our goal of an underwriting margin of at least 4%, specifically in personal auto. Auto quote growth coupled with continued improvement in conversion, as our competitors raised rates, led to auto new application growth of 20% in the quarter including the highest August and highest September combined to channel new application volume that we've seen in the company's history. And there's also, I think been increases to sort of the non-used car pieces of severity and medical costs and wage inflation sort of impacting things, is being able to stick to that and try to drive growth here. So now that spot rates have gone down a little bit and softened, some of those carriers are going -- some of those owner operators are going back to carriers, we do have a couple coverages, non-trucker liability and GL where we can keep those pits, when they're not -- when they're away from doing business with the carrier that they're part of. So while our expense ratio is lower now, like I said, we're really bullish on growth for this quarter because of what we being in the ambient shopping and just the environment based on our competitors' spending and our competitors' rates. I think what's important is to get back to Tricia's comment about we will spend when we can afford to spend based on the calendar year targets, when the spend is efficient relative to lifetime performance on the media, and frankly when we need to spend to drive growth. So right now we have some states, a couple of big ones on the coast where we don't yet have adequate rates on the street and we're optimizing obviously the efficiency of our expenses there given our loss ratios are high because we can't get the rate that we need under the expected losses. Like Pat said, it's a little bit more difficult to â\u0080\u0093 we're really encouraging agencies that, as one of the many variables to make sure we get â\u0080\u0093 we give our combined customers the best rates, if their driving behavior warrants the same. I didn't hear the last part of your question, but the first part of the question is, we always believe that we put good business on the books, because we have so many variables that, as long as we can make our target profit margin, of course, that's different in new renewal, agency direct in each day, we always believe that the business we put on the books should be able to reach our target profit goals. As far as your quote-to-bind ratio question, there's a lot of moving parts in there, because when you have massive increases in shopping, you have different motivation levels of customers and conversion rate is, obviously, dependent on the mix of business that's shopping, how competitive our pricing is relative to where they're shopping from, because they're always comparing for a prior insurance customer what they're paying today versus what they could pay tomorrow. And that's where we think the power of segmentation, particularly in the agency channel, where comparative raters create effectively a transparency of rates across different carriers and segmentation and pricing accuracy enables us to grow in the right places, while avoiding adverse selection that potentially goes to our competitors."
}