{
    "symbol": "CVGI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 13:59:05",
    "content": " In fact, although, CVGâ\u0080\u0099s revenues were up about $10 million for the full year, our vehicle businesses offset a $100 million decline in industrial automation. We now expect the weakness in industrial automation to continue and we have taken additional actions to show higher short-term profit improvement at the same time as we go about our business of changing our revenue and business mix away from Class 8 and customer concentration towards a wider spectrum of commercial vehicles, electrification and automation, especially in the electric vehicle industry. So right now we have higher vehicle production than expected, corrected prices, a larger cost out program thatâ\u0080\u0099s already underway and we believe we expect it to offset the industrial automation weakness and new business wins program focused on lower cost startup programs tied to vehicle electrification and automation. Looking at the full year of 2022, while inflation seems to have peaked and cooling off in certain areas, it temporarily suppressed our quarterly results in our vehicle businesses during the year and we negotiate a price recovery and cut costs to offset these areas. At the same time, weâ\u0080\u0099re very focused on improving our long-term revenue mix and profit profile and continued executing our long-term growth strategy of obtaining new business, which is primarily focused on long-term agreements to produce electrical systems on electric and autonomous commercial vehicles. As Iâ\u0080\u0099ve already alluded to, we delivered strong new business wins during the year on a multitude of product platforms and weâ\u0080\u0099ve institutionalized this with a five year goal of securing approximately $100 million per year in new wins going forward. Highlighted on Page 9 and based on our current outlook and the momentum of our new growth programs, we secured from our new business, we believe our sales within the Electrical Systems segment will continue to grow to nearly 40% of our revenues in 2027 and significantly outpace the growth in the overall commercial vehicle market. Our Vehicle Solutions segment fourth quarter revenues increased 13% to $142.8 million compared to the year ago quarter, primarily due to material cost pass-through and higher volume. Operating income for the fourth quarter decreased to $3.7 million compared to operating income of $5 million in the prior year period, primarily due to a lack in price recovery versus cost inflation and higher than planned start up costs. Our Electrical Systems segment achieved revenues of $47.1 million, an increase of 23% as compared to the year ago fourth quarter, resulting from material cost pass-through and contributions from the new business wins. Our Aftermarket and Accessories segment revenues increase 28% to $34.1 million compared to the year ago quarter, primarily resulting from increased sales volume and increased pricing to offset material cost. Adjusted operating income was $3.7 million, an increase of 95% compared to $1.9 million in the year ago fourth quarter. Our Industrial Automation segment produced fourth quarter revenues of $11 million, a decrease of over 70% as compared to $37.5 million in the fourth quarter of 2021, due to lower demand levels. Operating loss was $11.9 million a decrease compared to the operating income of $3.1 million in the year ago quarter, primarily attributable to the previously mentioned lower sales volumes and an inventory charge of $10.4 million. So on the price and cost side, weâ\u0080\u0099ve had a big improvement coming into this year, Joe, as we had expected, and in the Vehicle Systems business, the Industrial Automation business is still very low level and, we just rip the cost out of it and right sized it as we should, but our vehicle businesses are still doing quite well and further rebounding from where we were in the fourth quarter."
}