{
    "symbol": "AME",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 12:25:05",
    "content": " AMETEK delivered outstanding results in the first quarter with strong sales growth and excellent operating performance, driving robust core margin expansion and earnings which exceeded our expectations. Overall orders in the first quarter were $1.7 billion, an increase of 22% over the prior year period, while organic orders were up 18% in the quarter. Core operating margins were 25.5%, up an impressive 140 basis points versus the first quarter of 2021 with strong core margin expansion in each operating group. EBITDA in the first quarter was $434 million, up 22% over the prior year, with EBITDA margins up 29.7%. This outstanding operating performance led to earnings of $1.33 per diluted share, up 24% versus the first quarter of 2021 and above our guidance range of $1.24 to $1.28. Sales for our Electronic Instruments Group were $987.8 million, up 25% from last year's first quarter. EIG's operating income in the first quarter was $244.8 million, up 80% versus the prior year, while EIG operating margins were 24.8% in the quarter. EMG's operating income in the first quarter was a record $128.2 million, up 22% to the prior year period. EMG's operating margins expanded an exceptional 250 basis points, just 27.2% which includes an approximate $7 million gain on the sale of a facility in the quarter. For the second quarter, overall sales are expected to be up low to mid single digits compared to the same period last year, and second quarter earnings are expected to be in the range of $1.27 to $1.30 per diluted share, up 10% to 13% versus the prior year. To summarize, AMETEK delivered a strong first quarter with solid orders and sales growth, strong margin expansion and a high quality of earnings, allowing us to increase our earnings guidance for the year. While investment resulted in lower cash flows and free cash flow conversion in the first quarter, we continue to expect a strong 110% free cash flow to net income conversion for the full year. Our process businesses were up 20% in the quarter, strong demand organic sales growth, contribution from the acquisitions of Magnetrol or and Alphasense. So if we were operating at 100% of supply chain, and everything else that was going on, we probably would have shipped another $50 million plus out in the first quarter. You know, as I told you, couple of quarters ago, customers are giving us an early look into their demands, that's continuing, and but I really see no slowdown at all on that, at 22% orders and 18% orders growth and it is broad based and I think, on an order basis, organic orders EIG was 19 and EMG was 15, so both very strong."
}