{
    "symbol": "AME",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 12:14:09",
    "content": " AMETEK had another excellent quarter, with stronger-than-expected organic sales growth, outstanding operating performance, robust margin expansion and record earnings. Second quarter sales were a record $1.51 billion, up 9% over the same period in 2021. Operating income in the quarter was a record $365 million, a 15% increase over the second quarter of 2021. Operating margins were 24.1% in the quarter, up 130 basis points from the prior year with strong incremental margins. This outstanding performance led to record earnings of $1.38 per diluted share, up 20% versus the second quarter of 2021 and above our guidance range of $1.27 to $1.30, driven by stronger-than-expected sales and excellent operating performance. Sales for our Electronic Instruments Group were $1.03 billion, up 10% from last year's second quarter. Second quarter operating income was $265.1 million, up 70% versus the prior year and operating income margins were 25.8% in the quarter. EMG's second quarter sales were a record $486.3 million, up 7% versus the prior year with organic sales growing 11% in the quarter. EMG's operating income in the second quarter was $124.4 million, up 11% compared to the prior year period. EMG's second margins were excellent at 25.6%, up 70 basis points versus the prior year. During our first quarter earnings call, we noted that the COVID driven lockdowns across parts of China were expected to delay some China sales from the second quarter into the second half of the year. With our strong results in the second quarter, continued solid order momentum and record backlog, we have increased our full year earnings guidance. For the third quarter, we expect overall sales to be up in the high single digits compared to the same period last year, and third quarter earnings are expected to be in the range of $1.36 to $1.38 per diluted share, up 8% to 10% versus the prior year. As Dave noted, AMETEK delivered excellent results in the second quarter led by strong sales and orders growth and tremendous operating performance. Capital expenditures in the second quarter were $26 million, and we continue to expect capital expenditures to be approximately $125 million for the full year, or about 2% of sales, reflecting our asset-light business model. To conclude, our businesses performed exceptionally well in the second quarter, delivering strong sales growth, outstanding operating performance and a high quality of earnings in a very challenging environment."
}