{
    "symbol": "AME",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 13:50:05",
    "content": " AMETEK delivered record results in the third quarter, with stronger-than-expected sales growth and outstanding operational execution, leading to earnings above our expectations. Third quarter sales were a record $1.55 billion, up 8% over the same period in 2021. Operating income in the quarter was a record $385 million, a 14% increase over the third quarter of 2021, while operating margins were 24.8% in the quarter, up a robust 140 basis points from the prior year, with strong margin expansion in each operating group. EBITDA in the quarter was also a record of $463 million, up 12% over the prior year, with EBITDA margins a record 29.8%. This outstanding performance led to a record of earnings of $1.45 per diluted share, up 15% versus the third quarter of 2021 and above our guidance range of $1.36 to $1.38. Sales for our Electronic Instruments Group were $1.05 billion in the quarter, up 7% from the third quarter of last year. Third quarter operating income was $272.7 million, up 11% versus the prior year. EMG's third quarter sales were a record $497.7 million, up 8% versus the prior year, with organic sales growing 13% in the quarter and foreign currency at four-point headwind. EMG's operating income in the third quarter was a record $136.5 million, up 19% compared to the prior year period. EMG's third quarter operating margins were a record 27.4%, up an impressive 240 basis points versus the prior year. In the third quarter, sales from new products introduced over the last three years was 27%, a record level for our Vitality Index, reflecting the great work of our teams. For the fourth quarter, overall sales are expected to be up mid-single-digits compared to the same period last year, and fourth quarter earnings are expected to be in the range of $1.45 to $1.47 per diluted share, up 6% to 7% versus the prior year. We delivered record performance, strong orders and sales growth, robust margin expansion, increased our earnings guidance for the year and acquired two strategic businesses. As Dave highlighted, AMETEK delivered outstanding results in the third quarter with strong sales and orders growth, excellent operating performance and a high quality of earnings. Capital expenditures in the third quarter were $28 million, and we expect capital expenditures to be approximately $130 million for the full year or about 2% of sales. Operating cash flow was $327 million, up 7% versus the third quarter of 2021. Free cash flow was $299 million in the third quarter, up 6% from the prior year and free cash flow to net income conversion was 100%."
}