{
    "symbol": "TEAM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-04 21:07:08",
    "content": " Many are in the different stages of their planning, whether that's from a technical perspective or budgetary perspective, and we are increasingly getting good at those conversations, about honestly the larger ROI savings that customers get, when they move to the cloud, whether that's reducing administrative costs, their own hardware costs and of course unlocking a ton of new innovation in our cloud. And the one thing that's worth calling out, that we've seen literally just in the last month is that the cohort of customers that came in the April, May and June timeframe are converting to those paid plans at a slightly slower rate than what we've seen in previous quarters. So we've historically said, it's roughly 30% of our cloud migrations come from data center customers, which proves that stepping stone statement. And I don't, specifically know how much that drives into the overall 10% growth that we've shown that drives our overall cost growth but you can see roughly a third of our customers are coming from data center. I think the other thing I would say is that, we continue to, as Cameron mentioned earlier, be incredibly focused on not just the unit economics of our funnel, the product where the growth funnel in terms of free and our evaluations and trials and we're obviously incredibly well instrumented there and we really understand the value of spending a dollar on marketing or sales and the conversion rate of expansion through our customer base. And it's a testament to the investments we've made over the last couple of years and performance and scale in regulated things like band fees, specific financial services regulation requirements in Germany that allowed us to open up that door and have that serious conversation about getting them to the cloud. And there's not typically one specific part that we see our customers take, but we're very comfortable and feel very great about that going forward given how sticky our products are and how much additional functionality they can unlock across the organization once they start becoming a customer."
}