{
    "symbol": "ECC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 21:18:04",
    "content": " As of year-end, our CLO equity portfolio's weighted average remaining reinvestment period stood at 3 years, and this is down just modestly from 3.2 years as of the end of the third quarter, and it's actually in line with where the portfolio stood at the beginning of 2022. So despite the passage of 12 months through our proactive portfolio management, the weighted average remaining reinvestment period on our CLO equity portfolio remains substantially unchanged, which we believe continues to drive the portfolio's outperformance relative to the broader CLO equity market. The company's fourth quarter GAAP net income was comprised of total investment income of $32.5 million and net unrealized appreciation on certain liabilities held at fair value of $20.7 million, offset by total net unrealized appreciation on investments of $26.8 million, realized capital losses of $3.6 million, expenses of $13.5 million and distributions on the Series C preferred stock of $0.5 million. This is across all of Eagle Point has been in the secondary market where we're able to pick things up, weighted average yield of new things we put in the ground, high teens, low 20s over the last 6 months in the CLO equity market on a loss-adjusted basis -- so that's where we're putting most of our investment dollars to work today. If you look back in our history, we've had years with almost no taxable income where our common distributions, the vast majority of which were return-of-capital because there was no taxable income, even though we had GAAP earnings perhaps and other years where we have losses on GAAP but gobs of taxable income that when -- and it's very difficult to predict because even if everything is going swimmingly, tax outlook can change and a bunch of losses could be realized in the last month of the tax year. And then when I look at -- when I look at the -- what you've done post year-end, the 2.6 million shares of common, and now you -- looks like you're tapping into the Series D. I think that's trading around a little bit over an 8% yield. In general, we're going to continue seeking and even in -- while most of the new things in the ground have been from the secondary market, we focus on CLOs with longer remaining reinvestment periods even in the secondary market. And even if we don't, it just gets a little more expensive to hold and cash flows would go down a little, but not in a situation where -- we're never a forced seller, and that's such an important part of our CLO investment program."
}