{
    "symbol": "MOTS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 20:58:03",
    "content": " While we discussed during the call, the very real impact that the pandemic has had on our business for much of the last two years, I also outlined the important milestones we've achieved during that time, including the significant progress we've made in advancing our technology with the FDA clearance of Pure-Vu EVS, establishing a clear plan for pursuing outpatient reimbursement with the development of a large multi-center clinical trial and the expansion of our customer-facing team through increased investment in commercial resources. But what also has been enabled through EVS, as we talked about on the last call because they're able to load the device onto a dirty scope, they're going into startup procedure on an outpatient basis, finding that the patient is at prepped well and saying, give me Pure-Vu, put it on in less than 60 seconds and completing that a case where in the past, they would have either had to struggle through it and try to get the case done or cancel that procedure and bring the patient back. But what they are and what they're proving to do is be very helpful to us in terms of giving us access to go through our thinking around study design and what we're trying to achieve and making sure that collaboratively, we're heading down the right path to ensure that if we're going to make this investment, it's going to ultimately hopefully yield the right information that they're looking for. But Boobalan, I'll just remind you and other folks listening, why this is so important for the company in terms of kind of an upcoming catalyst is, this is strategically important to allow us to unlock obviously, reimbursement and hopefully gain access to the very large outpatient market, as we talked about before, over 18 million procedures a year. But in terms of the sales and marketing elements, I think we're looking at probably closer to a 50% increase, if you look at it year-over-year when you're incorporating both the personnel costs and the non-labor costs, obviously, with COVID, hopefully, mostly behind us, some of the activities on the non-labor side, attendance at trade shows and communications and travel and things like that are -- have a bit of an uptick as well."
}