{
    "symbol": "SAIC",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-06 13:23:06",
    "content": " At this time, I would like to welcome everyone to the SAIC First Quarter Fiscal Year 2023 Earnings Conference Call. And joining me today to discuss our business and financial results are Nazzic Keene, our Chief Executive Officer and Prabu Natarajan, our Chief Financial Officer. Today, we will discuss our results for the first quarter of fiscal year 2023 that ended April 29, 2022. Earlier this morning, we issued our earnings release, which can be found at investors.saic.com, where you will also find supplemental financial presentation slides to be utilized in conjunction with today’s call and a copy of management’s prepared remarks. These documents, in addition to our Form 10-Q to be filed later today, should be utilized in evaluating our results and outlook along with information provided on today’s call. I am proud of the financial results we delivered in our first quarter, representing our sixth consecutive quarter of positive organic growth, positioning us well to deliver on our full year plan. After my remarks, Prabu will discuss results for the quarter in greater detail and provide our updated outlook. I would like to spend a moment discussing the results of some recent work we initiated internally to ensure all of our stakeholders, our employees, our customers, our partners and our shareholders better know who SAIC is, why we do what we do and the values that drive us. For over 50 years, SAIC has worked hand-in-hand as a trusted partner of the U.S. government, advancing our country’s most critical no-fail missions. Our legacy and leadership in enterprise IT and systems engineering and integration, coupled with our proven ability to provide solutions with speed to value, are competitive advantages that we leverage to drive profitable growth. The progress we have made on further strengthening our culture and our continued focus on the mission, have directly contributed to the improving financial results we have delivered over the past several quarters. In the first quarter, we reported revenues of approximately $2 billion, representing total growth of approximately 6% and organic growth of 4%, both of which were ahead of plan. Our first quarter results, combined with recent business development success, give us greater confidence in our increased revenue guidance. While we continue to go to market and manage the business around our two customer-facing operating sectors, I want to highlight our key capability offerings that span those sectors, which we define as our growth and technology accelerants, GTA and our Core, as shown on Slides 6 and 7 of our earnings presentation. In fiscal year ‘22, GTA accounted for roughly 27% of our total revenue and a greater share of our operating profit. Our leadership within these domains is reflected in recent rankings from Gartner, which placed SAIC’s IT services market share at number one by revenue for the United States government vertical for both infrastructure implementation and managed services and application managed services. We expect to increase our GTA revenue to over 35% of the portfolio within the next 3 years, reflecting strong growth from this area of our business at accretive margins. As we transform our portfolio towards a greater share of GTA over the next few years, we intend to grow Core as well. Our strategic focus going forward will remain centered on creating the most rewarding and differentiated experience for our employees, investing in markets with growing demand where SAIC has enduring competitive advantages and allocating capital to drive improving financial returns for our shareholders. While SAIC’s legacy and technical leadership has been in providing engineering expertise to help solve our customers’ toughest challenges, we see more opportunities going forward to use these skill sets better to capture additional value as a technology integrator. Recent program awards, which give us confidence in this strategy, include a key win in classified space and our expanding role as integrator on the Mark 48 program. We delivered strong performance in the quarter, with revenues ahead of our plan at roughly $2 billion, representing total growth of 6%, of which 4% was organic. We delivered an adjusted EBITDA margin of 8.7%, primarily impacted by the timing of indirect expenses and remain on track to meet our full year guidance of 8.9% with good visibility into expected margin improvement through the rest of the year. We reported adjusted earnings per share of $1.88, which benefited from the more favorable revenue performance in the quarter. Our trailing 12-month book-to-bill is roughly 1.0 and we expect this to improve over the next few quarters based on recent competitive new business wins still in protest, representing over $1 billion in total contract value and squarely aligned with our GTA areas of focus. Importantly, the mix within our pipeline continues to change with new business now representing roughly 70% of the value of submitted proposals, both materially higher sequentially and at this time last year. We also see good progress in driving a greater share of our pipeline within markets that align with our longer term growth objectives as represented by a greater share of opportunities within GTA, as Nazzic discussed. Based on results for the quarter and our updated outlook for the year, we are increasing our revenue guidance by 1% at the bottom end to a range of $7.43 billion to $7.55 billion. Our guidance continues to assume low single-digit declines in 2Q and 3Q due to certain contract transitions before inflecting to low single-digit growth in 4Q, largely due to the benefit of additional working days. We are maintaining our full year margin guidance of approximately 8.9% and expect improvement in the second half of the year, led by a more favorable mix and the timing of certain new investments. We are increasing our EPS guidance by $0.10 to a range of $6.90 to $7.20, which continues to assume an effective tax rate of approximately 24%. Finally, our guidance for fiscal year 2023 free cash flow of $500 million to $530 million is unchanged and I would remind you that it represents an over 10% increase at the midpoint versus fiscal year 2022 and assumes that the Section 174 amortization provision is deferred. Based on expected working capital trends and final payments related to the Halfaker acquisition, which both impacted first quarter results, we expect to generate 40% of our full year free cash flow in the first half of the year and 60% in the second half. Our capital deployment priorities are unchanged and we remain committed to a prudent deleveraging of the balance sheet, with a bias towards deploying excess free cash flow towards our share repurchase program. At this time, we do not expect to adjust our capital deployment plans as a result of the uncertainty related to Section 174 legislation and plan to repurchase between $200 million to $250 million of shares for the year after having repurchased approximately $100 million fiscal year-to-date. As we noted in our earnings press release, the Board of Directors authorized a new share repurchase program for an incremental 8 million shares, representing approximately 16% of our shares outstanding, which we intend to utilize over the next 3 years, market conditions permitting. We believe this authorization also reflects our ongoing commitment to effectively allocate capital and the confidence we have in executing our plan to drive sustainable, profitable growth and the energy we are investing to structurally improve our cash conversion. I am proud of the results we delivered in the quarter and believe our strategic focus on investing in GTA, while sustaining our core business strengths, position us well to maintain our forward momentum. Your line is open. So when we think about the guidance, it implies organic growth down 1% for the remainder of the year versus 4% organic for Q1. Just a couple of comments as we think about the quarter and the guidance and I will let Prabu provide some color, but I want to take the opportunity, first and foremost, to tell you in the team and extend it to our 26,000 employees how proud we are of the performance that we did have in the quarter. As you referenced, on-contract growth was certainly a key component of that and we have tremendous opportunity to continue to drive that throughout the year. And so we are very, very pleased with how we sit today and how the year is shaping up, giving us greater confidence in our ability to execute the growth over the course of the year. So, with respect to the quarter itself, good strong revenue performance to start the year, I think I would think about the outperformance in Q1, there is roughly half time and half what I call true performance goodness in the quarter. So, we certainly had good momentum in the quarter delivering better growth than we expected even internally. Second data point, we reflected in the prepared remarks that we expect as a result of the contract transitions to have modest contraction in Q2 and Q3 and then reflecting back to low single-digit growth in Q4 of this year. Obviously, the extra working days in the fourth quarter will certainly help organic revenues in Q4. To the extent we have good success in keeping those awards and pulling the revenues associated with those earlier in the year, you’ll start to see some modest improvement to the outlook for Q2 and Q3, probably more likely Q3 than Q2. But to me, that’s what I think, fundamentally drives where we end up in terms of the quarterly cadence for revenue itself. So to me, I’d say a good start to the year, 9 months left in the year. And I think I’m really especially pleased with the dedication, the intensity with which we executed in Q1. And if I don’t get them right, just reask, but I wanted to give a little bit of color. So on the slide, that’s in the slide deck, you can see where we’ve shaded in blue, kind of a proportion of the revenue that we achieved today in each of those areas, just to give you a sense for which ones are greater, which ones are less. We don’t have specific numbers to report to you on those at this juncture, but that should give you some color as to what areas we have more revenue and what areas we have less. As it relates to a couple of examples, so if you think about the secure cloud environment, Cloud One is a program you’re probably aware of where we support the Air Force, providing a one-stop shop for all the cloud migration activities. And then in the systems integration and delivery program, you’re probably familiar with Mark 48 torpedo where we provide the manufacturing assembly, the test and delivery for that torpedo program in support of the Navy. Your line is open. Maybe just following up on that question for a moment, Prabu, you mentioned your 50% of the growth in the quarter is kind of Core business performance. And then how repeatable is that through the rest of the year versus the pull forward where it looks like you reiterated the second, third and fourth quarter growth rates. So I’d say, just headwinds associated with AEGIS for the next, say, 12 months or so. And in terms of kind of what’s implied in the guidance, Gavin, I’ll probably reiterate one of my earlier comments, which is we have some new business out there in protest about $1 billion to $1.1 billion. And to the extent we get turned on those contracts are laying sooner than what’s implied in the modest contraction for Q2 and Q3, we will start to see some revenue pickups from those newer programs. And as a surgical practice, we don’t comment on things that are in protest and we’re just going to wait this out and see where we end up, but there is potential here for some modest improvement over the course of the year. And hopefully, we have a chance to do a little bit better than what’s implied in the guidance right now. And then maybe just asking about the pipeline, one thing that struck me is that the backlog has grown quite a lot and you still have a record pipeline. Yes, I’m glad you asked the question, Gavin. I think for us, Nazzic and I especially, it’s really important to think about the pipeline over a really long period of time. And it has been – this company’s focus for several years now to ensure that we have the right quality in the pipeline; two, that we have enough length in the periods of performance, so we actually have tangible visibility into the growth of the backlog and obviously, the funding levels with the pipeline. So I’d say fundamentally, I would attribute the increase in the size of the pipeline to real goodness from our BD teams, our sector presidents that are driving growth within the business. So that’s what’s driving fundamentally, most of the increase in the pipeline. There is always an element of budget associated with – you’re seeing the end markets broaden out a little bit, but I’d say it’s probably less of a driver at this point. I would say at this point, it’s just solid execution, ensuring that we are bidding the right kinds of things and ensuring that we actually have accretive returns from a shareholder perspective and where we deliver value consistently. And I’d say the last thing I put on Facebook, the NASA AEGIS loss was a big part of the portfolio, and we lost 2% of our top line. Your line is open. Although we’re referring to it for the first time in the acronym on this call, this has been part of the strategy that we’ve been in development of over the last couple of years. We want to be more – certainly be transparent with you all, let you all know what we’re focused on and how we see that maturing over the course of the next couple of years. If you think back to the last couple of acquisitions, you referenced organic and I’m going to circle back. The numbers that we’re sharing with you, the aspirations, the goal is to get to a greater percentage of our portfolio in the GTA is predominantly organic. As Prabu provided a little bit of commentary on the pipeline, as we look at our pipeline, as we pursue and put our investment dollars to capturing new business, we want to make sure that we are focused in those key areas, not at the expensive core, but to disproportionately grow that part of the portfolio greater than the core part of the portfolio so that we can, in fact, differentiate ourselves in the market, be more competitive in areas we have solutions, we have capabilities. And in terms of the margin rates, we tend to think about this business as being roughly 200 to 300 basis points higher margin than the Core part of the business. Recognizing if we have greater success than what’s implied in the PowerPoint chart, we end up driving margins a little bit higher. So I’d say fundamentally, no significant change there is how we’re impressed. And if you then do the math to bridge to last year’s free cash flow, the remainder was primarily working capital change, including higher bonus payments in Q1 of this year compared to Q1 of last year. So as I sort of normalize for those two things, we end up with free cash flow in that circa $160 million to $170 million on a normalized basis with my year on normalized, but that’s how we think about it. Your line is open. Prabu, SAIC’s leverage is towards the higher end of the industry. And we’ve even said at points in time, we may be a little bit lower and at points in time, we may be a little bit higher. As it relates to the capital deployment and buyback question sort of how we think about it, we are deploying free cash flow in ways that maximize shareholder value. So as I think about it, we also think about the capital deployment in the context of the excess cash we generate on an annual basis. And therefore, as we think about roughly 8 million shares of incremental authorization and what’s implied in terms of the share count out there, at roughly 8 million shares or so. And I’d say this one is a little bit larger than the prior ones, but not out of tune with where we’ve been historically on capital deployment. So we think there is capacity here in the organic cash generation of the business for us to be able to fund the repurchases out of excess capital, and we can, we believe, do this in a leverage-neutral way. That’s very helpful, Prabu. Just a follow-up to some of your comments earlier on thinking about the puts and takes of the business, I mean one of the larger would seem outstanding items is just the Vanguard contract, which I believe is one of your largest contracts, and it’s supposed to be recompeted into a multi-award contract that’s going to be called Evolv. On Evolv, it’s – so we are watching. But again, I think it’s anybody’s guess as to whether that happens or not this year. So, it’s about 200 bps to 300 bps higher than that. Your line is open. Thank you very much. Hi Cai, it’s Nazzic. Certainly, the budget process has helped, I think with some certainty, but outlays have been slower, and I think you probably heard that throughout the industry. As Prabu mentioned, we do have over $1 billion of new business in protest. And so if you kind of partnered that with the rest of Q1, I would say it was a relatively strong quarter as it relates to bookings. Obviously, as the government continues to execute on their budget, as we get towards year-end, we keep a close eye on some things that certainly could bubble up, but I would just characterize things as really normal for us. I would say broadly supported by the environment, as Nazzic said, we are not seeing that translate necessarily into higher outlays on a month-to-month basis. In fact, looking at the data for the last six months of the government fiscal year, I cannot think of a year where the outlay pace has been slower in the last 20 years, candidly, except maybe 2003. So, the data implies the slowness in the outlay, recognizing we have got a few months left here in the year, and we are likely to see some pressure build up in the system for higher outlays, but we are just going to have to sit back and watch it. But as of at least April, we have not quite seen it in the data, but I think that’s exactly right. And we do take a fair amount of time looking at what’s in the pipeline and not just the key win , but also the key goal and likely pressure on timing. And therefore, we are just mindful of that and converting that backlog into revenue, it seems a little bit harder in a tough labor market. In addition to what I would consider normal bookings that happened over the course of business, we are very focused on driving on-contract growth. And so in addition to what I will call the normal blocking and tackling of winning new business, booking new business, clearing protest periods, our team is doing an exceptionally good job and executing on contract growth, retiring some of the ceilings, and we are really seeing some of that in our revenue performance. I know that there are various pieces, but it’s also an expanded re-compete. Cai, I am going to try to answer that as best I can, but I am fairly certain you are not going to love my answer, I can’t give you a lot of color. Some of them will be work streams that aren’t in our kind of our long-term strategy and some are absolutely those that we believe we have a very strong position, permission to win, and we will absolutely win our fair share. But with all that being said, I really can’t quantify it for you. So, at this juncture, I really can’t give you an answer. So, that’s the best I can tell you at this point. Thank you very much. Your line is open. And I think there is a slide in the deck as we think about the value that we – the value creation for our employees, we are very focused on ensuring that we have put together a competitive benefits package. So, I would just say that we are seeing chat over greater than we would like, but consistent with industry. So, I don’t – it’s something we pay attention to, but it’s not something that I think causes undue risk to the organization, probably actually the opposite. In some cases, it’s very similar skill sets. So, I don’t view it as a radical shift in the type of people, the type of labor and it will just continue to build on the great workforce that we have today. As I talk to colleagues in the industry, and even in other technology industries, I think there is a common view that we may have already crested that we are seeing some of the less acute labor challenges across all the United States and technology. And I think that, that could be good for companies like us that need to do some hiring. So, I think it’s too early to tell. But I think just based on some conversations, one could have an opinion that maybe we have seen the crest and it’s getting better. But again, that’s not his opinion. Thank you very much. Your line is open. And so I would say, absolutely, we have seen good growth in our space portfolio. We see continued opportunity in our space portfolio, really spanning all of those areas of the growth sellers. And one for Prabu, if you achieve the 65-35 split for GTA versus Core in your fiscal 2025 as you have targeted, what is the implication on your current 8.9% margin? And of course, our aspirations are always higher than what’s on a PowerPoint chart. And again, as we flagged, it’s one of many avenues left for us to improve margin across the company, and this happens to be a really attractive one to grow the company and improve margins at the same time."
}