{
    "symbol": "SAIC",
    "quarter": 4,
    "year": 2023,
    "date": "2023-04-03 14:00:24",
    "content": " We have reported strong fiscal fourth quarter results with revenue of $2 billion, up 10% year-over-year or 2% when adjusting for the 5 extra working days, again, benefiting from strong execution and a continued focus to drive on-contract growth, which allowed us to overcome revenue pressure from contract transitions. Our fourth quarter free cash flow of $148 million resulted in full year free cash flow of $457 million, which included a roughly $90 million impact related to Section 174 cash tax payments, partially offset by related cash tax benefits of approximately $20 million. Adding back the Section 174 and other related cash tax payments, we achieved free cash flow of $525 million, $5 million ahead of the top end of our prior guidance and represents growth of 12% versus fiscal year 2022. While our book-to-bill of approximately 1.0x is generally in line with our average over the prior year, our trailing 3-year book-to-bill is over 1.2x and we continue to be confident around our ability to generate stronger rates of organic growth for two reasons: one, our win rates on new business pursuits is strong, highlighted by the two new wins, which Nazzic mentioned; and two, our recompete win rates are returning to normalized levels in recent quarters as we annualize recompete loss headwinds in the quarters ahead, partially in our fiscal second quarter and fully in our fiscal third quarter. Our supply chain business consists of a portfolio of contracts, which contributed roughly $645 million to revenue in FY â\u0080\u009823, approximately $35 million to $40 million of adjusted EBITDA and $30 million of free cash flow. For clarity, the combined impact from these two transactions on our FY â\u0080\u009824 financials will be a $650 million reduction in revenue and $35 million reduction in adjusted EBITDA, resulting in a roughly 30 basis point benefit to year-over-year margins. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So, if we think about the changes we have made, which is really to balance the incentive comp structure on the three components of the business that Prabu just highlighted, obviously, revenue growth, margin expansion and cash, we believe that all three of those are necessary for us to achieve our long-term strategy and to drive shareholder value creation. Your line is open."
}