{
    "symbol": "SAIC",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-05 14:03:06",
    "content": " Our results to-date contribute to our increased revenue guidance for FY â\u0080\u009823 and to our confidence in being able to deliver organic growth, improve margins and drive 10% free cash flow growth in FY â\u0080\u009824 despite an over $100 million revenue headwind from fewer working days next year. We are expecting FY â\u0080\u009824 free cash flow of approximately $560 million, driven by earnings growth, a continued focus on working capital efficiency and a $50 million year-over-year benefit from having made our final payroll tax deferral payment in FY â\u0080\u009823. Our view that the repurchase program represents the best ROI for our excess free cash flow is informed by three factors: one, the confidence we have in our ability to deliver earnings and free cash flow in excess of market expectations over the next several years; two, our belief that stronger financial performance versus our peer group will drive improved relative valuation; and three, recent transactions, which indicate still robust demand from the private markets for businesses with our end market exposure and cash flow durability. On Slide 14, we provide an illustrative view of our free cash flow potential over the next few years, which assumes roughly 2.5% revenue growth and 10 basis points of annual margin expansion. Your line is open. Your line is open. Your line is open. At the end of the day, as you think about the free cash flow potential growth for this company over the next several years, we think working capital tends to be less of a driver to improving free cash flow in the outer years. So as we think about it with a very nominal set of assumptions, we think we can continue to very nicely grow the free cash flow, recognizing, of course, as we caveat it, this is not intended to be free cash flow guidance for the next 3 or 4 years, but itâ\u0080\u0099s a directional view for where we think the potential for this company is in terms of being able to generate the free cash flow and then deploy the cash flow effectively over the next several years. Your line is open. If you adjust it for the 5 fewer working days next year, in the fourth quarter, but 4 days overall, we think that translates to a growth rate of about 3% to 3.5%. Your line is open. Your line is open. Your line is open. Your line is open."
}