{
    "symbol": "TRI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 12:32:04",
    "content": " By turning to first quarter results by segment, the Big three businesses achieved organic revenue growth of 7%, reflecting broad strength. As background, organic revenue growth of Legal has accelerated 4% in 2018, and '19, to 6% in 2021, and Q1, 2022, driven by several factors. Westlaw Edge continues to add about 100 basis points to Legal’ s organic growth rate is maintaining a healthy premium and is expected to continue to contribute at a similar level going forward, supported by the planned release of Westlaw Edge 2.0 during the second half of this year. Turning to our profitability adjusted EBITDA for the Big 3 segments was $584 million up 11% from the prior-year period, a 42.9% margin rising 190 basis points. I will remind you the Change Program operating costs are recorded at the corporate level moving to Reuters news adjusted EBITDA was $37 million, $9 million more than the prior year period, driven primarily by revenue growth. Global Print's adjusted EBITDA was $53 million with a margin of 37%, a decline of 290 basis points due to the diluted impact of lower margin third-party brand revenue. As Steve outlined, we've increased our full-year 2022 outlook for total TR and Big 3 revenue growth, we now forecast total organic revenue rising by approximately 5.5%, and Big 3 by approximately 6.5% up from the prior 5% and, 6%, 6.5% respectively. Looking to the second quarter, we expect revenue growth for total TR and the Big 3 to be comparable to our updated full-year forecast of approximately 5.5% and 6.5% respectively. We expect our adjusted EBITDA margin to be approximately 200 basis points to below the full-year outlook of approximately 35% due to the normal seasonality in our Tax and Accounting segment, and the cadence of Change Program investments. The key factor with that 80% recurring is that Multiyear Contracts as a reminder, approximately 60% of our Legal revenues under Multiyear Contracts, about 40% of our Corporate's revenue multiyear and 10% of Tax and Accounting is multiyear as a key point. I think from a financial lens perspective, Westlaw Edge 1.0, we've been sharing consistently has been generating about 100 basis points of organic growth for us, very consistently, over the last four years since we launched it in July of 2018, we fully assume and we have strong confidence that Westlaw Edge 2.0 will continue that."
}