{
    "symbol": "TRI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 08:43:01",
    "content": "  Operator: Good day, everyone and welcome to the Q2 2022 Earnings Call hosted by Gary Bisbee, Head of Investor Relations. Good morning, everyone and thank you for joining us today for Thomson Reuters' second quarter 2022 earnings call. I'm joined today by our CEO, Steve Hasker; and our CFO, Mike Eastwood, each of whom will discuss our results and take your questions following their remarks. Throughout today's presentation, when we compare performance period-on-period, we discuss revenue growth rates before currency as well as on an organic basis. And we're starting to benefit from meaningful tailwinds driven by a step change in complexity of regulation and compliance in our Legal, Tax and risk-related markets. Due to the Q2 revenue strength and healthy book of business or annual contract value growth, we are raising our full year revenue outlook. We now expect to see total revenue rising by 6% and Big 3 revenue by 7%, up from our prior views of 5.5% and 6.5%, respectively. Overall, the strong first half provides confidence that we're on the right path to achieve our 2022 and 2023 targets. While market concerns around slowing economic growth and inflation have increased, our business is well positioned. We also benefit from our Change Program efforts which will significantly boost our margins, cash flow and earnings in 2023. Through July 31, we've purchased $394 million of our shares and we look to complete the program within 10 months. As a reminder, our acquisition focus includes workflow software and automation in our Legal and Tax markets and Risk, Fraud & Compliance and targeted international expansion. For example, in Legal Professionals, we see a sizable opportunity to play a critical role in the tech-driven transformation of the legal profession. We are uniquely positioned to provide customers with a smarter, seamless experience through the combination of our highly differentiated research content and expertise with workflow software. We continue to assess both organic and inorganic opportunities to further expand our capabilities and integrate our leading content with workflow solutions that drive automation and better outcomes for our customers, particularly around legal documents and contract drafting. Organic recurring revenue again grew 7% with organic transactional revenue up a robust 13%, aided by a calendar shift and the return to in-person events at our Reuters Events business. While we expect transactional revenue growth to moderate in the second half, we see recurring revenue momentum continuing. Adjusted EBITDA increased to $561 million, reflecting 200 basis points margin improvement to 34.7%. Excluding costs related to the Change Program, the adjusted EBITDA margin was 36.6%. This strong performance resulted in adjusted earnings per share of $0.60, up from $0.48 in the prior year period. The Big 3 businesses achieved organic revenue growth of 7%, reflecting broad strength. Legal continued its recent momentum, delivering a fifth consecutive quarter of 6% organic growth. The Legal market remains healthy across all key segments: small, mid- and large-sized U.S. firms, government customers and in key overseas markets. For example, Westlaw Edge adoption continues to drive revenue and we continue to expect annual contract value penetration to approach 75% by year-end from 65% at the end of 2021. Second, Practical Law which contributes to growth in both Corporates and Legal segments, continued a strong performance with a quarter of double-digit revenue growth. And third, our Government business grew 8% organically and we see acceleration as likely in the balance of the year. And finally, Global Print organic revenues declined 1% which was better than expected, due to higher third-party print revenues and timing benefits that we expect to normalize in the remainder of 2022. In summary, we're very pleased with these results and we're excited about the momentum that's building within our businesses. Now let me take a few minutes to discuss our Corporates segment and our Risk, Fraud & Compliance businesses and why we are confident in the growth prospects of both. As we did last quarter, I'd like to provide some incremental transparency around our portfolio with a brief discussion of our Corporates segment and our Risk, Fraud & Compliance or RFC businesses. The segment was formed in the fourth quarter of 2018 to better serve, innovate for and penetrate corporate users for our key Legal, Tax and RFC offerings. For full year 2022, we are confident in achieving the 7% to 9% organic growth target we previously set for 2023. Key double-digit growers which are circled in green on the slide, include Indirect Tax and Confirmation from our Tax portfolio, Practical Law and HighQ from Legal and CLEAR from RFC, amongst others. In total, double-digit growers in our Corporates product portfolio comprise 39% of segment revenue and are growing at a mid-teens year-over-year rate. As we described last quarter for our Legal Professionals segment, a healthy mix shift toward these more rapidly growing offerings is contributing to our Corporates momentum. Looking forward, we remain confident in the long-term growth potential for the segment driven by our building momentum, a healthy product portfolio and corporate demand for actionable insights and efficiency-driven workflow tools, combined with significant addressable market and white-space penetration opportunities. Building upon this Corporates discussion, I'll expand on our Risk, Fraud & Compliance businesses. However, our RFC businesses are also an important driver for Corporates which generates a bit over 40% of our RFC revenue. We have several businesses that make up our RFC franchise, led by CLEAR, a leading public record solution. TRSS provides a combination of information, technology and security-cleared analysts to support government customers in mitigating global risk and improving public safety. There have been several key drivers of this growth, including an expanding number of use cases across government and corporate customers; enhanced functionality that has bolstered usage and pricing; and growth of access through APIs which has also boosted our partnership efforts. Looking forward, we believe that our RFC businesses are well positioned to deliver revenue growth in the teens over the next few years. It brings billions of data points from public records and third-party databases together to deliver insights for investigative, compliance, risk mitigation and fraud prevention purposes. Historically, CLEAR has focused on building an aggregated data set that enables investigators to perform a single search across multiple sources to uncover connections and identify risk-related information aided by customizable and easy-to-navigate dashboards. In recent years, we've added decisioning tools and configurable analytics around identity verification and entity risk indicators and scoring. We've also added incremental content, including sanctions lists and business beneficial ownership data. We believe CLEAR is a market leader with several advantages, including robust identity resolution technology, comprehensive content, real-time data connections, strong data source transparency and a compelling analytics-driven dashboard. The graphic on Slide 12 illustrates how CLEAR can help customers prevent, detect and investigate risk and fraud by answering key questions about their potential customers or counterparties. These questions demonstrate the critical need for a deep understanding of entities, both people and companies, relevant for government and corporate customers across numerous use cases, ranging from criminal investigations to identifying human trafficking networks to KYC and AML compliance as well as others. To bring our RFC efforts to life, let me close with a real-world example from our Government business. Since implementation, Thomson Reuters has been a key partner in helping California to stop $125 billion of fraudulent claims. We're proud of the work done by our Risk, Fraud & Compliance teams which help support safe communities, uphold the integrity of government entitlement programs and support robust compliance efforts. Now let me turn it over to Mike, who will provide more detail on the second quarter results. As a reminder, I will talk to revenue growth before currency and on an organic basis. Organic growth was driven by Practical Law, FindLaw and our Government business. It is maintaining a healthy premium and is expected to continue to contribute at a similar level going forward, supported by the planned release of Westlaw Edge 2.0 later this year. In our Corporates segment, organic revenues increased 9% for the quarter driven by recurring revenue growth of 9% and transactional revenue growth of 8%. CLEAR, Practical Law and Indirect Tax were key drivers of the recurring revenue. However, we see recurring revenue growth momentum continuing. And finally, Tax & Accounting's organic revenues grew 9% driven by recurring revenue growth of 11%. Organic growth was driven by Ultra Tax, audit products and the segment's businesses in Latin America. Total and organic revenues increased 12%, exceeding expectations due to strength in our Professionals business. In particular, Reuters Events drove the growth as it benefited from both a favorable event calendar shift into Q2 and also the return of in-person events. Lastly, Global Print total and organic revenues declined 1% in the second quarter, ahead of expectations. On a consolidated basis, second quarter organic revenues increased by 7%. Adjusted EBITDA for the Big 3 segments was $524 million, up 8% from the prior year period with a 40.7% margin rising 80 basis points. As a reminder, the Change Program operating costs are recorded at the corporate level. Adjusted EBITDA was $44 million, up $9 million from the prior year period with a margin of 23.3%, up 310 basis points. Global Print's adjusted EBITDA was $50 million with a margin of 35.4%, a decline of 250 basis points due to the decrease in revenues and the dilutive impact of lower-margin third-party Print revenue. In aggregate, total company adjusted EBITDA was $561 million, a 12% increase versus Q2 2021. Excluding costs related to the Change Program in both periods, adjusted EBITDA increased 9%. The second quarter's adjusted EBITDA margin was 34.7% or 36.6% on an underlying basis, excluding costs related to the Change Program. Second quarter adjusted EPS was $0.60, up from $0.48 in the prior year period. Consistent with previous quarters, this slide removes the distorting factors impacting our free cash flow. Working from the bottom of the page upwards, the cash outflows from the discontinued operations component of our free cash flow was $25 million more than the prior year period. Also in the first half, we made $186 million of Change Program payments as compared to $28 million in the prior year period. If you adjust for these items, comparable free cash flow from continuing operations was $685 million, $7 million lower than the prior year period, primarily due to higher annual incentive plan bonuses. In the second quarter, we achieved $64 million of annual run rate operating expense savings. As a reminder, we anticipate reinvesting $200 million of the projected $600 million of savings back into the business for a net savings of $400 million. Spend during the second quarter was $67 million, comprised of $30 million of OpEx and $37 million of CapEx. For the full year, we continue to expect $305 million of Change Program investments which would bring total 2021 and 2022 cumulative investments to approximately $600 million. As Steve outlined, we have increased our full year 2022 outlook for total TR and Big 3 revenue growth. We now forecast total organic revenue growth of approximately 6% and Big 3 organic revenue of approximately 7%, up from the prior 5.5% and 6.5%, respectively. Looking to the third quarter, we expect revenue growth to be 50 to 100 basis points below the updated full year forecast due to lower transactional revenue and more normalized growth rates for Reuters News and Global Print. However, we expect fourth quarter revenue growth to improve from Q3. We expect our third quarter adjusted EBITDA margin to decline 300 basis points sequentially from Q2 due to normal seasonality, timing of Reuters Events and the cadence of Change Program investments. We expect Q4 margins to be the high watermark of the year, aided by seasonal strength from our Tax Professionals segment and scaling Change Program savings. In summary, we remain confident in achieving our 2022 and 2023 targets, supported by the strong first half and healthy underlying momentum in our key businesses and markets. Over time, we continue to believe we can achieve faster revenue growth, higher profitability and significantly higher free cash flow as we benefit from transforming to a content-driven technology company. You raised the '22 organic growth guidance by 50 basis points which is great to have a few quarters in a row of raising the guidance there, so congrats on that. But we think it's very prudent, given the various macro factors, to wait to complete our full year planning process in the next few months. But based on the first half of the year, the strength of our underlying book of business and the execution of our sales and go-to-market team, the execution against our Change Program, confidence is very high. But it's more what you mentioned, Toni, in regards to going through the planning process and being very prudent in assessing the macro factors but all signals are very positive. So Mike and Dave Larson conduct our QBR, quarterly business review process and that comes in late September, October. And as you know, we have -- 80% of our revenue is recurring. Just one additional point there, Toni, in regards to that, getting through the plan process, so you mentioned also, as we complete the year, the visibility, to Steve's point, at 80% is recurring in nature. So as you know, we like to spend an enormous amount of time with customers and getting a deeper and deeper understanding of their businesses. I think based on my conversations with the heads of small, medium, large law firms, tax and accounting firms and some of our corporate and government customers, I would say that to date, their results have been pretty solid. And so far, in 2022, they've seen pretty robust demand through their litigation practices through their restructuring. But I think the -- our customer base has the same stance that we have which is sort of proud of results to date but I think a bit of healthy paranoia as to what might come next and just watching very, very carefully for some early signs of softness. Toni, I would supplement with 2 additional points that we monitor, our renewal rates or retention rates. And also on the pricing front, our pricing is slightly higher in 2022 versus 2021. Just quickly, I know it looks like you did an acquisition in the quarter. And Steve, a question for you, just a recurring one really. Just wondering if you can give us an update on your assessment of the, I guess, the progress you've made and the shortcomings to date of your initiative to improve really the customer experience. So our most recent acquisition was of a business called ThoughtTrace which is based in Houston, Texas, run by a very talented executive by the name of Nick Vandivere. But we've done a lot of work with them prior to the closing of the acquisition and, as you can imagine, an awful lot more since closing the acquisition as to how we can extend that capability into a broader set of commercial verticals. So whether that's financial services or pharmaceutical or you name it, we're looking at it. The second part of your question with relation to the Change Program, look, it's a complicated program with many moving parts, as you know, Tim but we have spent a good chunk of the $600 million onetime investment. So from a financial standpoint, the Change Program is in great shape and it's delivering what we expected it to. I think the sort of components that are going -- amongst a number of the components that are going very well would be our cloud conversion, firstly. Secondly, the progress that Jason Escaravage, our cyber leader, has made in terms of addressing our strengths around cyber fraud and compliance. And then last but not least, we've done a lot of work on our location strategy and where we want our go-to-market talent, where we want our product and engineering talent and so on and so forth. And mainly, it's converting these investments and capabilities into customer satisfaction. And I'd call out our go-to-market leaders for navigating their way through this environment with the backdrop of the pandemic, the backdrop of inflation and increasingly, economic unease, an enormous amount of change and disruption being driven by the Change Program. And yet, our price has gone up a little bit, our renewal has gone up a little bit and our organic growth is headed in the right direction, notwithstanding all of the disruptions and turmoil that we've imposed on ourselves. So I'd say the punchline, Tim, is so far so good on the Change Program with lots of work left to do. At the end of June, we were 47%. Price is included therein but price is up only slightly, Kevin, in 2022 versus 2021. That will continue to increase as we progress in '22 and '23, given the multiyear contracts, as I mentioned earlier in regards to Toni's question there, so primarily the underlying health of the business. The book of business that we have, Kevin, at June 30, coupled with the pipeline for the remainder of the year, were really the drivers for us increasing our guidance by the 50 basis points. In regards to retention, we're seeing slight increases across the firm. But we still have significant opportunity on a weighted average basis using revenue as the benchmark, not number of customers. But based on revenue, we're slightly over 91%. And just a reminder, Kevin, our recurring revenue growth rate, we're forecasting at 7% for the full year. Steve, when you talked about the M&A criteria, you touched on the legal software and workflow space. And then secondly, just with respect to 2023, maybe for Mike, when you think about inflation, I mean, obviously, you have a significant labor component. So as you know, we've got a pretty robust pipeline of M&A that we're looking at. Focused on automation, workflow automation tools that drive efficiency and take many hours out of key tasks for our Legal, Tax & Accounting and Risk, Fraud & Compliance and Government customers. That's really the sort of area of focus, also with an eye to some selected international expansions. Within Legal, yes, look, we're very bullish. So every head of a law firm is asking us the questions around how can our tools, how can our research content and our tools combined help them be less reliant on hiring new lawyers or additional lawyers to drive growth. So as we look at the life cycle management, document management, further workflow tools, we see a pretty big opportunity. And the TAM is growing in a meaningful way because traditionally, it's a profession that's underspent on information and technology and arguably overspent on real estate. Aravinda, on the second part of the question in regards to 2023 and inflation, I would say both for 2022 and for our 2023 guidance, based on how we see inflation of the top line and bottom line, we have fully incorporated our current view into '22 and '23 guidance. To your point there on labor, we certainly provided higher merit increases in 2022. We're working very closely with our HR team, Chief People Officer in regards to 2023 there. The other element of inflation that we monitor with Jennifer Prescott leading the Print businesses, paper print and postage, we've certainly received -- incurred some inflationary increases on the cost there but we've been able to offset majority of that with our pricing. So managing pricing, coupled with the increased labor cost and other costs, we think we're managing all of those aspects very well. But with those puts and takes, we think we've fully incorporated them into our guidance for '22 and '23. First, I would say that we're continuing to invest in our Change Program where we've centered that on improving our customer experience. First, our Westlaw Edge 2.0 which will be released later this year within Legal, that's an important area for us. Practical Law that we highlighted during our May 3 earnings call, Practical Law helps both our law firm customers and also our general counsel customers within Corporates. Risk, Fraud & Compliance, as Steve discussed today, impacts both our government customers and also our corporate customers is another area. Over within our Tax & Accounting Professionals business, Ultra Tax that I referenced during the prepared remarks today. So outside of our Change Program, Heather, the key focus for us is in regards to investing in our products to help our customers there. And it's very balanced across our portfolio, including within our Latin America region and also Asia and emerging markets. Yes, I mean, it's -- if you go back to our Investor Day presentations at the start of last year, we talked about 7 growth initiatives. And as a follow-up, when you think of 2023, if there is a downturn, if you were to see some sort of sales impact on the margin side, you have the benefit of the cost cutting with Change Program. I think, Heather, for '23, we remain confident in achieving our guidance of 39% to 40%. In regards to any revenue headwinds, where we would potentially see those first would be in transactional revenue which includes our Reuters Events. I'd say Reuters Events is having an incredibly good year, over $20 million of revenue in Q2 for us there. As I mentioned, we expect it to normalize in the second half for us. But for margin, 39% to 40%, back to Aravinda's point, we have lots of puts and takes that we can manage and pull. Yes, not -- Heather, not to be flippant about it but should we head into a recession, be it a broad and deep one or a relatively shallow one, we view it as an opportunity, an unequivocal opportunity to emerge stronger relative to our customers and be better able to -- relative to our competitors and better able to serve our customers. And we think a more difficult economic backdrop will provide us with an opportunity to further those leads which, should it happen, we'll be looking forward to. Heather, back to your first questions on areas of investment, I think the areas of investments just intentionally make us stronger as we go through '22 and certainly position us, to Steve's point, for '23. Maybe Mike, just an update on Westlaw Edge 2.0, if that's still on track for some launch in the back half of this year. And maybe a bigger-picture question, it's my understanding in terms of Thomson's internal AI and machine learning capabilities, you went down that path many, many years ago. And obviously, you're leveraging it into products like Westlaw Edge. Drew, we confirm that we will launch Westlaw Edge 2.0 in the second half of this year. More importantly, our customers will be super pleased when we launch it later this year. In the meantime, Drew, the team, our go-to-market team within Legal Professionals and Corporates, they continue to work with our customers on Westlaw Edge 1.0. We're approaching 70% penetration with Westlaw Edge 1.0 but 2.0 will definitely launch later this year, Drew. They have been instrumental in Westlaw Edge 1.0 and have been, I think, even more influential as we think about the launch of 2.0. And the opportunity for us is to, in along the lines of being a content-driven technology company, is to increasingly add AI and machine learning to our unique content and best-of-breed software. We've done more of that in the Legal Professionals area but we are starting to ramp those efforts up across the portfolio, including in Tax & Accounting and Risk, Fraud & Compliance, amongst others. So our Indirect Tax proposition, I would say, in terms of its size is not a #1 or #2 to the earlier points made but it's closer to 3 or 4. We're matching that but we'd like to -- we'd certainly like to have a bigger, more robust presence and move into a #1 or #2 position over time. In regards to the sales cycle, we're not -- we're watching it, as you can imagine, incredibly closely with all of our segment leaders and subsegment leaders there. But just given the government procurement process, it's a little bit more variable in nature, a little bit less predictable than our other businesses right now. I do credit, Scott, our sales teams for that, both our direct sales reps but also account managers, client managers, customer success managers, all the different resources that we apply to supporting our customers there. And the other thing to note is that we're investing in our growth initiatives, particularly around tools that drive efficiency. The conversations remain very healthy with customers where they can see a tangible, measurable increase in their own efficiency. So fewer hours required to achieve core tasks, fewer bodies required to achieve core tasks, that's really a big area of focus. And that embraces Westlaw and Practical Law, HighQ, ThoughtTrace and extends into our Tax & Accounting propositions. Just in the last 2.5 years, I think our teams, the sales go-to-market teams have done a hell of a job adjusting in this hybrid environment, virtual environment, supporting our customers that way. But right now, we're not seeing any significant change, Scott. Obviously, revenue is up 50 bps, twice over the last 2 guidance increases. Here, I think we're doing a good job managing the puts and takes, as I've discussed earlier but certainly inflationary pressures is one that we're watching very closely. And then thirdly, I would mention, we're very -- being very prudent, eyes wide open on macro factors just during the remainder of the year. Steve, just a sort of big-picture question. I mean I think of some of the old-time law partners that I know and if you walk into their office and started talking about AI and cloud-based solutions, they'd look at you blankly. I mean if you sort of looked at our business 5 or 10 years ago, you'd see on the research side a knowledge -- Chief Knowledge Officer or a librarian who was very much the sort of gatekeeper and curator of the research content for the practicing attorneys. Now more and more, the attorneys themselves would look direct into our products and they're very adept at doing so and providing us feedback. The other thing that occurred during COVID amongst the senior-most, longest-tenured lawyers, including managing partners, because they went to work from home for the first time in their careers. And that's a really healthy dynamic for our business because the more users are directly exposed to the experience and as we invest behind Charlie Claxton and our UX and design teams to improve that, we think the stickiness of those products goes up and that the chances of renewal at healthy price increments goes up, too. I think, Nica, I think that's the last question."
}