{
    "symbol": "WEC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 21:31:07",
    "content": " Before the conference call begins, I remind you that all statements in the presentation, other than historical facts, are forward-looking statements that involve risks and uncertainties that are subject to change at any time. In addition to the assumptions and other factors referred to in connection with the statements, factors described in WEC Energy Group's latest Form 10-K and subsequent reports filed with the Securities and Exchange Commission could cause actual results to differ materially from those contemplated. During the discussions, referenced earnings per share will be based on diluted earnings per share, unless otherwise noted. After the presentation, the conference will open to analysts for questions and answers. In conjunction with this call, a package of detailed financial information is posted at wecenergygroup.com. And now it is my pleasure to introduce Gale Klappa, Executive Chairman and WEC Energy Group. First, I'd like to introduce the members of our management team who are here with me today. We have Scott Lauber, our President and Chief Executive; Xia Liu, our Chief Financial Officer; and Beth Straka, Senior Vice President of Corporate Communications and Investor Relations. Now as you saw from our news release this morning, we reported second quarter 2022 earnings of $0.91 a share. A warm start to the summer, solid results from our Infrastructure segment and continued execution of our capital plan were major factors that shaped yet another strong quarter. In light of this strong performance, we're again raising our earnings guidance for 2022, this time by $0.02 a share, to a new range of $4.36 to $4.40 per share. This, of course, assumes normal weather for the remainder of the year. And as we've discussed, this allows us to fund a highly executable capital plan without any need for new equity. During the quarter, we continued to move forward on major initiatives across the enterprise, including investments in our $17.7 billion ESG progress plan. Our focus remains on building and maintaining a highly reliable infrastructure, delivering energy that's affordable, reliable and clean. These coal-fueled units have a total rated capacity of 1,100 megawatts. We based this decision on 2 critical factors: First, tight energy supply conditions in the Midwest power market; and expected delays in the delivery of solar panels and batteries, delays that will clearly affect the in-service dates of renewable projects that are now going through the regulatory approval process in Wisconsin. But even with the extension of the Oak Creek units, we remain committed to our aggressive environmental goals. Across our generating fleet, we're still targeting a 60% reduction in carbon emissions by the end of 2025 and an 80% reduction by the end of 2030. And by the end of 2030, we expect to use coal only as a backup fuel and we're aiming for a complete exit from coal by the end of 2035. Of course, for the longer term, we remain focused on the goal of net zero carbon emissions from power generation by 2050. And as you know, we're working to help shape the future of clean energy, engaging in policy discussions and on the ground, carrying out innovative projects that can drive decarbonization of the economy. For example, we've now finalized the test plans for blending hydrogen with natural gas at one of our modern gas field units in the Upper Peninsula of Michigan. Separately, for our natural gas distribution business, we're making great progress in securing supplies of renewable natural gas. Scott will update us shortly but as a reminder, our plan is to achieve net zero methane emissions from our gas distribution networks by the end of 2030. The latest data show Wisconsin's unemployment rate at 2.9%, well, of course, below the national average and we continue to see major investments from growing companies in our region. For example, Gulfstream Aerospace is expanding its operations at the Appleton Airport. That's in Wisconsin's Fox Valley, southwest of Green Bay. And just last month, Komatsu Mining celebrated the official grand opening of its new headquarters here in Milwaukee. It includes offices, a training center and state-of-the-art manufacturing space to build heavy mining equipment. During the second quarter, groundbreaking also took place for a major expansion of the Georgia-Pacific paper mill in Green Bay. So with a wide range of developments in the pipeline, we remain very optimistic about the long-term future of the regional economy. And with that, Iâ\u0080\u0099ll turn the call over to Scott for more information on our utility operations and our infrastructure segment. As Gale mentioned, we're making good progress on our capital plan. We have started work on the reciprocating internal combustion engines, or as we call them, RICE units, at our western site in Northern Wisconsin. Also, work on our liquefied natural gas storage is underway. As you recall, the commission approved 2 LNG units in Southeastern Wisconsin. On the renewable front, we've deployed $155 million towards refurbishing projects at 2 of our regulated wind farms. When completed, these projects will enhance reliability and performance at these farms. Also, we expect our Red Barn Wind Park development in Southwestern Wisconsin to come online around the end of the year. On the solar and battery front, work continues on the Badger Hollow II solar facility and the Paris Solar Battery Park. We still expect these solar projects to go into service next year, supplying more clean energy to our Wisconsin customers. However, we've informed the Wisconsin Commission that the battery portion of the Paris project is expected to be delayed until 2024. As you may recall, we have filed for approval of 2 other solar battery projects, Darien and Koshkonong. We now project them to enter service in 2024 and 2025, respectively. In addition, we now expect the retirement of Columbia Energy Center to take place in 2026. As you know, Alliant Energy operates the Columbia facility and we are a part owner. Of course, weâ\u0080\u0099ll keep you updated on any further developments. As you recall, we filed a rate review last quarter with the Public Service Commission for our Wisconsin utilities. Recently, we provided an update to our filing. This update also reflects other variables, including higher interest rates and costs associated with the completion of our solar projects. In our gas business, weâ\u0080\u0099ve discussed plans to bring high-quality renewable natural gas to our customers. Just last month, we signed our third RNG contract which will connect our distribution system to a large dairy farm in Northeast Wisconsin. Outside of our utilities, our WEC infrastructure segment was once again a positive driver for the quarter. Together, the 2 projects represent approximately $800 million of investment, keeping us well ahead of our 5-year capital plan. As you know, MISO, the Midwest grid operator, has set out a long-range plan to address transmission needs across the Midwest. And last week, the MISO board approved the transmission projects for tranche 1. At this time, American Transmission Company estimates that its investment opportunity in tranche 1 is approximately $900 million. And with that, Iâ\u0080\u0099ll turn things back to Gale. Scott, thank you very much. Now as you may recall, our Board of Directors at its January meeting raised our quarterly cash dividend by 7.4%. We continue to target a payout ratio of 65% to 70% of earnings and therefore, I expect our dividend growth will continue to be in line with the growth in earnings per share. And today, we are reaffirming our projection of long-term earnings growth at 6% to 7% a year. Next up, Xia will provide you with more details on our second quarter financials and she'll touch on the likely impact of the reconciliation bill that appears to be headed for a vote in the U.S. Senate. We view the legislation as broadly positive for customers, for the energy transition and for our future investment opportunities. On a weather-normalized basis, retail electric deliveries in Wisconsin, excluding the iron ore mines, were up 0.30%, led by our small commercial and industrial customers. Overall, retail demand for electricity is tracking our forecast. Across our regulated business, we grew our earnings by $0.05 compared to the second quarter of 2021. At our investment in American Transmission Company, earnings increased $0.01 compared to the second quarter of 2021, driven by continued capital investment. Finally, you'll see that earnings at our Corporate and Other segment decreased $0.06, primarily driven by rabbi trust performance and a gain last year on our investment in a clean energy fund that we recognized in the second quarter last year. Remember, rabbi trust is largely offset in O&M. Overall, we improved on our second quarter performance by $0.04 per share compared to last year. As you can see, we have been executing well on our capital plan. Before I turn it back to Gale, I'd like to give a bit of color on the recently proposed Inflation Reduction Act. From what we understand now, we believe the proposal would provide additional benefits to our customers from investments in renewables. So overall, we see benefits to customers, future investment opportunities and stronger credit metrics. Now, let me give you the guidance for the third quarter. As a reminder, we earned $0.92 per share in the third quarter last year which included $0.05 of better-than-normal weather. And as Gale mentioned earlier, weâ\u0080\u0099re raising our full year guidance to a range of $4.36 to $4.40 per share with an expectation of reaching the top end of the range. With that, Iâ\u0080\u0099ll turn it back to Gale. Overall, we're on track and focused on delivering value for our customers and our stockholders. Operator, we're ready now for the question-and-answer portion of the call. Let me just -- if we can touch on MISO policy for a second and maybe more specifically the generation backdrop following the PRA earlier this spring and kind of your own retirement modifications or, like you highlighted, delays. That's a great question, Shar. Based on everything we're seeing today, I don't sense that we're going to enter into any other significant extensions of plants. The dates we gave you, we feel pretty good about in terms of the retirement of the older Oak Creek units. And I think really what's going on here and MISO has said this, I think, fairly clearly, that there's been so much retirement up to date of older coal-fired units, that really they found themselves in a couple of regions in really, really tight capacity situations. Luckily, we've had the diverse supply here. And remember, Shar, these plants that we're extending, these older Oak Creek units, they're not projected to run a great deal. But as we continue to bring the units online that Scott talked about, I think our current plan is likely to hold in terms of the retirement dates. I will say this, right now, based on everything we're seeing and Xia can comment further. Based on everything we're seeing, some of the other benefits of that piece of legislation really kind of offset the minimum tax issues. So, we donâ\u0080\u0099t -- we actually think, as Xia mentioned and Xia, you might want to expand on this a little bit. Like Gale mentioned, we see very manageable impact from AMT. I think in general, probably $20 million, $30 million of increase in cash tax payment. But like Gale mentioned, we see quite a bit of sources of credit metric benefits from either the monetization of tax credits or lower -- just offset by the lower debt balance, financing costs and so forth. So I think overall, if you take into consideration all the moving pieces, we actually see a benefit to the credit metrics. And a benefit also, Shar, one other, I think, point that we'll continue to emphasize, we talk about investment opportunities here, expanding with this piece of legislation, not only at the utilities but also at the Infrastructure segment. But one of the things that comes through clear to us, this is good for our customers. So there's some broad positives here, Shar. And then just real quick lastly, if I may. Just the rate case, the procedural schedule was obviously issued last week. Right now, weâ\u0080\u0099re still pretty early in the process. So that part, the staff audit part which was kicked off by our filing, thatâ\u0080\u0099s going smoothly, going well, going on time. And as you say, the administrative law judge in the case has proposed a schedule which I think the interveners would like a little more time in between some of the dates. And just a reminder, I mean this case is very straightforward. Itâ\u0080\u0099s really all about investment in grid hardening, investment in renewables, investment in reliability and over half of the capital projects in this case have already been approved and our O&M that we proposed is actually lower than what was approved in the last order. And right now, itâ\u0080\u0099s steady as she goes. So just coming back to a couple of details here, if I can. Normalize for large C&I, just -- again, I get that, that doesnâ\u0080\u0099t move the needle as much on margin but obviously, through 6/30, thereâ\u0080\u0099s a -- versus what you guys had forecasted on the year. And by the way, I got a question for you when I'm done answering. The small decrease that we saw in large C&I as we kind of -- and remember, we serve industrial customers in 17 different sectors of the economy. We saw 3 sectors in the first half and in the second quarter that really showed a bit of a decline: food processing, food and food processing. And actually, I think they're going to make more chocolate which is a good thing, according to my wife. But anyway, so electronics, food processing and printing were the 3 categories that showed some decline. Primary metals was up but long story short, the rebound in small commercial customers -- the rebound in the commercial sectors of our economy was very strong and very good. But clearly, what we're seeing is a very, very strong recovery in the commercial side of the business. So when you put it all together and take a look at it holistically, as Xia said, we feel like we're very much on track with our sales forecast for the year. Okay, back half it is. And before I answer your question, let me just  in one more here. Xia, if I can put you on the spot a little bit here. We really don't have a number yet because there's so many moving pieces, as you know, that qualification of production tax credit versus investment tax credit could change the dynamics among just the regulated businesses. So we updated the calculation based on the new methodologies, nothing more than that. It's pretty formulaic, yes. We bought a house, weâ\u0080\u0099re keeping going. All right, all right. Just I wanted to sort of -- sorry, Xia but Iâ\u0080\u0099m going to put you on the spot again and this is just knowing how well you know this topic. Just on the concept of this, the monetization of the tax credits and transferability. So obviously, this bill doesnâ\u0080\u0099t include direct pay which is part of the Build Back Better. I think that like I touched in the formal remarks, we see this overall bill with benefits for customers, for future investment opportunities and credit metrics. So in terms of the sources of customer benefits, obviously, PTCs versus ITCs from solar projects would be one. So that could be beneficial for customers, extension of tax credits. And then, like Gale touched in terms of future investment opportunities, WEC, for example, right now, we're looking at the tax appetite to try to match our investment opportunities with our tax appetite. Obviously, with marketability of tax credits, that goes away. So I think overall, I think we see this as a potential positive. Having said that, our current capital plan isnâ\u0080\u0099t relying -- built on any of these. So I think we would see some tailwind from this, this was passed. If not, weâ\u0080\u0099re just fine. She's exactly right, the $17.7 billion 5-year capital plan that we've outlined for you doesn't envision any of these potential benefits. I would say just personally and this is just my own view, the idea of the transferability of tax credits, basically creating a market, I think, is actually a superior solution than direct pay, frankly. But just so I understand, Gale, am I right in thinking about this transferability as that you donâ\u0080\u0099t need ownership unlike tax equity where you actually need an ownership in the project, you donâ\u0080\u0099t need ownership as an investor or buyer of these tax credits. So essentially, the market or interest in these tax credits is going to be much larger than just those select banks or those specific tax equity investors. Yes, I think you're right on. I think you're dead on, Durgesh. And in fact, a little bit of background. And the idea that this really opens a much broader opportunity for these tax credits, not just with a tax equity investor, that was a major selling point, a major selling point, period, to all those who were crafting the bill. Thank you for attending the fireside chat, it was great. Just want to come back to the coal retirements a little bit, if I could, as it relates to the Wisconsin rate case. Certainly, the Governorâ\u0080\u0099s office which we communicated well with prior to the announcement was very supportive. The staff at the Public Service Commission, obviously taking its responsibility to help ensure reliability was very positive. And overall, Scott, this really is not a big factor in changing the revenue requirement. No, not at all, Gale. And when we factored everything in, factoring and keeping these units running a little bit longer, extending those lives, factoring in the delay. And remember, we delayed these due to some supply chain challenges, building the solar and the batteries. Factoring those delays in, it was relatively revenue requirement neutral. And remember, for this particular case then, just in this case, youâ\u0080\u0099re avoiding those additional capacity costs. And in addition to that, Jeremy, we were able to reassure, as I mentioned in the script, we were able to reassure everyone that our commitment to really aggressive environmental improvement is unchanged by this action. And I just want to come back, if I could, to IRA and tax credits and whatâ\u0080\u0099s possible there. At this point in time, Jeremy, it's probably too early to give you how much bigger than a breadbox answer but I will say this. Right now, our significant investments that we've made which as we reported to you, are performing very well in the Infrastructure segment, those have all been wind projects. I think we have 8 wind projects that were committed to and some of them operating already, a number of them operating already. I will add, though, we have the 10% total investment as a portfolio from  so we don't see that change even with this bill passing. Yes, thatâ\u0080\u0099s a good point. So -- but yes, we intend to keep the Infrastructure segment at around 10% of earnings going forward. I wanted to start with the -- I know itâ\u0080\u0099s a shoulder quarter for the gas business but sales trends remain pretty strong there, looking at the first half of the year. Actually, it's -- you're asking an interesting question. One is and you've heard me say this a gazillion times, weather normalization is more precise than accurate. So I'm not sure that our weather normalization techniques picked up all of the weather impact that we saw, particularly in Q2. But the other thing that we're seeing and this is not surprising but positive, a big chunk of the increase that we're seeing and it is a strong increase, is in industrial processes for gas. When you look at the segments of our gas customers, actually, the biggest increase in Q2 is coming from industrial process used for gas. And again, that reflects back on the strength of the economy and we see that as pretty positive. So, I hope that's helpful. It has been a very strong 6 months, no question about that. And throughout the quarter, the increased use of gas by our large industrial customers for process purposes. I think thereâ\u0080\u0099s been like a little bit of a cost pickup on some of the nearer-term stuff, whereas the longer term has been pretty steady thus far. I will say this, the nearer-term cost changes, we fully anticipated and had communicated with our regulatory folks. In fact, the last filing on the solar, the first project we came in were about $1,300 a kW -- kilowatt. And then now it's about $1,540. I think the last one is about $1,640. So they're moving up a little bit, still in line with what we're seeing across the country. In the future, we'll have to see where things go but we said it could be 30% to 40%. But once again, there's a lot of supply chain here and you're looking multiple years out. So right now, there the cost we did see go up but really in line, in fact, a little bit lower than what we see across the country. Married life is going well for me also, if you've just been checking. But hopefully -- just in case my wife sees someone in EEI, I don't want any problems. Hopefully, two easy questions. One is, I guess, guiding to 6% to 7% in one of the slide decks, I think, from the July presentation, historically, itâ\u0080\u0099s been 9% CAGR. Remember, our projection is 6% to 7%. And certainly, what we have in the pipeline in terms of approved capital investments and simply our continued efficiency and driving best practices through our operations. No, I agree, Gale. The storms that weâ\u0080\u0099ve seen this summer and last summer, it makes a lot of sense to go as we do that, the additional transition to renewables. And as we look at the fall and we pull into the capital projects, weâ\u0080\u0099ll continue to look at it. And Anthony, when I see your wife at EEI, I'll just say, what goes on in Boston stays in Boston. If I look at on the cost side, so far, first half of the year, O&M is down 4% roughly when I look at the slides you put out. Well, I can give you an initial thought on that. Well, certainly, Scott and Xia are very close to the numbers as well. But you just think about the gasoline that our fleet, our trucks, our service trucks, our bucket trucks. When you think about the cost of gasoline having more than doubled, thatâ\u0080\u0099s certainly a big factor and we got -- we are rolling as few trucks as possible. But when you have a storm, you got to roll trucks. When you have an outage, you got to roll trucks. No, you're exactly right, Gale. And when you look at the O&M, just to correct where we're at here, some of those decreases that we're seeing on the top level of the income statement are some of the items that we had in our rate review last year for transmission. But overall, when we look at our forecast, weâ\u0080\u0099re still projecting to be down about 1% flat to 1% in total O&M. Xia, anything youâ\u0080\u0099d like to add? No, I think you covered it very well. Anthony, I hope that's responsive to your question. Your own fleet, you mentioned gasoline prices or maybe municipal fleet, etcetera. If you could just elaborate on what is beyond, I guess, wind and solar. So batteries, certainly and that's in our plan already and probably will be even more greatly in our plan going forward. As far as small modular reactors, I mean, weâ\u0080\u0099re tracking the progress. I will say this, we are not in the business of serial number one. But certainly, down the road, particularly if this kind of tax credits apply, that certainly could be an option down the road, not in our 5-year plan, probably not in the next 5-year plan but certainly down the road. Xia, anything youâ\u0080\u0099d like to add? No, I think the only thing is we are going through the hydrogen test process to learn more on that. And as part of this IRA, there's new clean hydrogen production credit. So that's something that if it indeed is making sense, that would be something we would be happy to look into. And I think the other point, you mentioned EVs. And we really see it more as not that but the adoption of EVs, how does that even expand our grid hardening as more and more EVs come onto the system. And like Gale said, we've got a robust program already, we see a lot of traction. But remember, we didn't put any of this in our future 5-year forecast that we talked about it in our third quarter call. And Sophie, you probably heard our rule of thumb that for every 2 new EVs put onto our system, itâ\u0080\u0099s probably the equivalent, the energy equivalent of a single household. So when you think about -- and we just saw some statistics the other day from the State of Wisconsin projecting the trajectory of EV adoption in the state, if itâ\u0080\u0099s even close to right, Scottâ\u0080\u0099s point will be borne out in really, really fully because, I mean, we only have a few thousand, a couple of thousand EVs in the state today. Actually, I have two questions that Iâ\u0080\u0099ll do sequentially. Can you talk about what you think is the long-term role of the utility, the electric utility is and the potential ownership of charging stations relative to kind of the various market models we have today in this country where the utility is generally not the owner of charging stations or is a very small component of that. Well, that's a great question, Michael. I think you've hit on it earlier, there's a lot of different models floating around the country, state by state, even the federal government now with the charging plan. So we're very, as you know, very, very early in the development of the whole infrastructure that would support a massive transition to electric vehicles. I will say this though, when you think about and it goes back to Scott's comment on grid hardening. If you think about neighborhood, let's say, a cul-de-sac with, I don't know, 8 homes, for example. If 2 or 3 of those homes adopt EVs, well, we're going to have to put in a much larger transformer in that neighborhood. And that, I think, will open up again tremendous capital opportunity for a company like ours but also the need to be able to have the grid that really supports that kind of transition to a massive, massive number of EVs. So again, none of that's in our forecast. So, I hope that answers your question to some extent. It all comes down to -- it all comes down to one word, reliability. Affordability, yes but reliability is the key. I mean, whenever we have discussions with legislative people when -- with the public service commissioners, with the governor's office, it is really all revolving around reliability. Itâ\u0080\u0099s reliability, not only on electric but also on natural gas, keeping the houses warm here in this cold environment in Wisconsin. Again, it was all about assuring reliability. It might shift from year to year but I mean, we have so much flexibility in that capital budget that, Scott, I don't see any major impact. Weâ\u0080\u0099re really looking at the numbers but every year, thereâ\u0080\u0099s a few things that we have to move around a little bit. So first, in terms of the O&M impact between delays to solar coming on solar and battery and the decision to move some retirement dates around -- youâ\u0080\u0099ve talked about the benefits of nonfuel O&M savings in the future. Well, I think we basically said there'd be about a $10 million uptick in the O&M to use these older Oak Creek units as capacity machines offset by the other factors that Scott mentioned. But when you think of ongoing, when you go back a couple of years, when they were really full-on baseload plants, probably the O&Ms come down maybe $10 million when you think about it overall, so we're still trying to -- about $10 million. Still looking at the efficiencies, you're not running them quite as much. You can utilize the staff and a variety of projects, trying to make the workforce as efficient as possible. Right, that makes sense. No, it all depends -- I mean, as you know, in the MISO market, we basically let the Midwest grid operator know what units we have available and at what marginal cost all the time. I mean day ahead, hour ahead, etcetera. No, that's exactly right. Yes, just like every other unit. So basically, this just becomes an asset in our portfolio that we offer to MISO every day. I know youâ\u0080\u0099re in the midst of a rate case and you talked about pressures from inflation, from storms. Well, the short answer is we have had, particularly in July, we've had some pretty serious storms, so we've had some additional operating costs in July that you're not seeing in our numbers yet, obviously. Power plant maintenance, other maintenance. So just last but not least, hopefully but good talking to you. At least from what Iâ\u0080\u0099ve been reading in the local press, it seems like thatâ\u0080\u0099s associated with renewables. And to clarify, there are really two elements to it and we'll let Scott cover the details. And then I think, Scott, you mentioned during the prepared script, there are 2 solar projects that we are now going through the regulatory process on and theyâ\u0080\u0099re not going to come in on the original dates. And with that uncertainty in the capacity, it just did not make sense to pull the trigger on those retirements. Paul, just to kind of put all that in perspective. We're going to be running those older Oak Creek units over the next couple of years here as we extend their lives just a little bit, we're going to be running them as capacity machines. And then weâ\u0080\u0099re seeing around different parts of the country, sort of constraints. So far in Wisconsin, very little. However, in our Infrastructure segment, we've seen some lengthy transmission maintenance outages in the Dakotas, for example. So sporadically, yes, we have seen some transmission issues and there's no question that we have got to, as a nation, move forward with transmission projects. And thatâ\u0080\u0099s why weâ\u0080\u0099re pleased that MISO has gotten to the point where theyâ\u0080\u0099ve gotten to and you probably heard Scott, actually, itâ\u0080\u0099s $100 million higher than we thought originally. All right, sports fans. Well, I think that concludes our conference call for today. If you have any more questions, feel free to contact Beth Straka. Thanks, everybody, so long."
}