{
    "symbol": "BITF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 15:30:11",
    "content": " And for the last two years, we have kept our direct cost of production under $10,000 per bitcoin and in fact lowered these costs by $500 in the most recent quarter. We ended the third quarter with cash of $36 million and 2,064 bitcoin valued as at September 30 at $40 million for a total liquidity of $76 million. Our quarterly revenue were $33 million, compared to $42 million in the second quarter of 2022, reflecting a 21% increase in the bitcoin mine offset by the 35% decline in the average bitcoin price quarter-over-quarter. And we achieved adjusted EBITDA for the third quarter of $10.3 million, representing a 31% margin as compared to adjusted EBITDA of $18.7 million for a 45% margin in the second quarter of 2022. As illustrated in slide 10, Bitfarms direct cost of production for bitcoin in the third quarter averaged $9,400 and as Geoff noted, is among the lowest reported in the industry. This is a $500 or 5% decrease in production costs from $9,900 per BTC in the second quarter. The $14,300 per bitcoin total cost of production represents a $2,700 decrease or 16% from $17,000 per bitcoin in the second quarter and went well below the current price of bitcoin. The drivers of the lower total cost of production with a lower direct mining cost and a 15% decrease in cash G&A expense or $1.1 million, reflecting management actions expressly taken to reduce discretionary spending, including professional services, travel and other overhead costs. We recorded an operating loss of $98 million during the quarter, which included a $44 million realized loss in disposition of digital assets, a $46 million change in unrealized gain on revaluation digital assets and an $84 million impairment charge to our property, plant and equipment. This compares to a second quarter 2022 operating loss of $173 million, including a $78 million realized loss in disposition of digital assets, a $70 million change in unrealized loss of revaluation digital assets and an $18 million impairment from goodwill. Returning it out to our reported results, net loss for the quarter was $85 million or $0.40 per basic and diluted share, compared to a second quarter 2022 net loss of $142 million or $0.70 per basic and diluted share. Most importantly, we continue to generate cash, mining operations during the quarter and achieved adjusted EBITDA of $10.3 million. In summary, despite a 35% lower average B2C price for the third quarter, compared to second quarter, we continued during the quarter as we put positive cash flow from operations with an adjusted EBITDA of $10.3 million or 31% of revenue. During the quarter, we executed the following: we sold a total of 2,595 bitcoins, comprised of 1,515 bitcoins from production and 1,080 bitcoins from treasury generating proceeds of $56 million, reducing indebtedness, further deleveraging our balance sheet and lowering our interest expense. During the quarter, we paid off in full two of our oldest highest interest rate facility and we raised $13 million in net proceeds from our ATM program that we launched over a year ago. So to repeat, we ended the third quarter with total liquidity of $76 million, comprised of $36 million of cash and 2,064 bitcoin valued at $40 million. Secondly, we raised another $1.9 million net of expenses under our ATM; and third, weâ\u0080\u0099ve reached an agreement to sell a  property for $3.6 million of which we expect to receive net proceeds of about $3.5 million to supplement our cash balance that being during the fourth quarter. But separate from that, for the other 36,000 we paid for roughly 93,000 of those in full and it is remaining about 3,000 or so or 4,000 or so for which we have a balance of around 40%, which is about $6 million and that we have reflected in our payment schedule on our financial statements that you see for the fourth quarter that is in quarter right now, whether we actually make the payments in or whether it gets pushed off a little bit in the first quarter. Two, benefiting from stable low energy costs, we've maintained profitable mining operations each quarter as evidenced by our generation of $10 million in positive adjusted EBITDA in the third quarter of this year."
}