{
    "symbol": "CMI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 14:10:01",
    "content": " Revenues for the second quarter of 2022 were $6.6 billion, an increase of 8% compared to the second quarter of 2021. EBITDA percentage declined in the second quarter as strength in sales and increased gross margin were offset by a 31% drop in joint venture income from the second quarter of 2021, driven primarily by the slowdown in China markets. Our second quarter revenues in North America grew 15% to $4 billion, driven by improved pricing, higher volumes and higher aftermarket demand. Industry production of heavy-duty trucks in the second quarter was 62,000 units, up 9% from 2021 levels, while our heavy-duty unit sales were 26,000, up 12% from 2021. Industry production of medium-duty trucks was 30,000 units in the second quarter of 2022, an increase of 5% from the 2021 levels, while our unit sales were 27,000, up 21% from 2021. We shipped 38,000 engines to  for the use on the Ram pickups in the second quarter of 2022, down 9% from 2021 levels due to supply chain issues, which temporarily limited truck production. Second quarter revenues in China, including joint ventures, were $1.2 billion, a decrease of 43% due to lower sales in the on-highway and construction markets. Second quarter revenues in India, including joint ventures, were a record $594 million, an increase of 51% from the second quarter a year ago. We are maintaining our full year 2022 EBITDA guidance of approximately 15.5%, excluding the impacts of the indefinite suspension of our operations in Russia, the costs associated with preparing for the expected separation of our filtration business and the expected costs associated with the pending acquisition of Meritor. During the quarter, we returned $240 million to shareholders in the form of dividends and share repurchases, consistent with our plan to return approximately 50% of operating cash flow to shareholders for the year. For the Engine segment, second quarter revenues increased 11% from a year ago, while EBITDA decreased from 16.1% of sales to 15.2% of sales, as the benefits of stronger volumes and pricing actions in our consolidated earnings were more than offset by lower joint venture income in China. In the Distribution segment, revenues increased 17% from a year ago to $2.3 billion, a record quarter for the segment. EBITDA increased as a percent of sales to 11.2% compared to 10.5% sales a year ago, primarily due to stronger parts, whole goods, and sales and pricing actions. We expect 2022 Distribution revenues to be up 11% year-over-year and EBITDA margins in the range of 10.5% of sales, both in line with our prior guidance. In the Power Systems segment, revenues increased 5% and EBITDA decreased from 12.2% to 10.6% of sales, as the benefit of stronger volumes and pricing were more than offset by higher material and logistics expenses. In 2022, we expect revenues to be up 8% and EBITDA is projected to be approximately 11% for Power Systems, unchanged from our prior year guidance. In the New Power segment, revenues were $42 million, up 75% from a year ago due to stronger demand for battery electric systems. We continue to advance our strategy in the second quarter, delivered record quarterly revenues and earnings per share, and recently announced an 8% increase in our quarterly cash dividend, the 13th straight year of dividend increases. Our material cost in the second quarter increased by 1.9% of sales year-over-year, just to -- what is temporary and what's -- we're always working to make changes to products, redesign things, take costs out."
}