{
    "symbol": "DASH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 21:00:06",
    "content": " And so when I square, I think, the fundamentals, both in terms of the leading industry retention and order frequency in the U.S. business, the industry-leading retention order frequency in the European business, particularly with Volt, who grew at 60% on a euro basis, significantly faster than its peers, and then I square that strong fundamentals with the future potential and runway in these categories, I think that's why you're seeing the resilience as well as what was reflected in our guidance. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And if I could, I'll just add a bit to this before heading into the DashMart question, which is -- I think one of the things I'm most proud of the team for accomplishing is that in the last 2.5 years, even though we stated in the shareholder letter, all of the growth that we've seen both top and bottom line in our business. Your line is now open. We're at a point where these investment areas are getting -- exhibiting margin improvement, and so the investment dollars don't perfectly offset the increase in the contribution profit in the restaurant business, and that's going to create some flow-through impact to EBITDA. And so what we've seen is outside of a handful of cities, and it's been the same count of cities that have, I would say, frankly, perhaps abuse their power and are trying to overregulate the industry, by and large, I think lawmakers, regulators, anyone in policy that we've spoken to has been very productive in terms of making sure that we can serve Dashers together. Your line is now open. And I mean, I think even when I think about the last 10 quarters, basically from when we've become public to where we are now, what we outlined in the S-1, we've kind of just continued marching towards that drumbeat of telling the narrative of how we want to be the local commerce company, both building the largest local commerce marketplace, the largest local commerce platform and how we're making investments in towards doing that. Your line is now open. We're at a point right now where the investments are getting better from a margin perspective, while the U.S. business continues to grow and therefore throws off more dollars and as continuing improvements in the margins, and it's not a perfect offset anymore."
}