{
    "symbol": "DASH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 22:30:38",
    "content": " Your line is open. Your line is open. Your line is open. Your line is open. And that -- and one of the things we've been fortunate to see, I'll echo a little bit of what Prabir said and then I'll take your question on merchants and Dashers which is, it's just the resiliency of the core business of U.S. restaurants where I think it's because when I take a look at all the possible areas where consumers could spend and consume, eating is still be one of the largest and certainly the highest frequency categories where people eat three times a day, 90 times a month. It was the right thing for us to do, given that we had a very fortunate position of having a U.S. restaurants business that's not only grown 250% over the last couple of years but that have materially also increased its profitability such that we can choose to reinvest those cash flows into serving all of audiences and that's what we did. Your line is open. Your line is open. Your line is open. Take for example the wait times we still see at stores, I mean especially given some of the labor challenges that you're seeing at, whether it's restaurants or whether it's grocery stores or convenience stores, everyone in the service industry is certainly feeling this. Your line is open. And so drive obviously has played a big part of that where it's effectively now diversified from starting with large enterprise restaurants only to now serving everyone from non-restaurants, convenience stores, pet stores, liquor stores, grocery stores, retail stores and it has a large runway, both in the U.S. as well as globally, but it also has a big runway in serving small businesses as well. And so there is a lot of work we have to do in order to build an end-to-end system to really power the first party digital operations of these businesses, but it's an opportunity that you're absolutely right within restaurants, outside of restaurants and globally. Your line is open. And that really goes back to the investment philosophy that we kind of outline from how we launch businesses in the first place, which -- and this is true for all of the businesses at DoorDash whether it was the restaurant's marketplace, the platform business with products like Drive and Storefront for the convenience business, or all the -- or the ads business that we're launching and the international markets, which really is how do we build the best possible product actually meet or ideally exceed the customer expectation and keep doing that. Your line is open. I think from a building businesses and products perspective, I think it's really important that we have to achieve product-market fit first, right, before we deploy capital to actually scale those businesses. M&A as I'm sure you know, it does not have a historical track record for success, and I think for us, we keep that bar very, very high and only really consider acting upon it if we see two things, one, obviously if it's accretive to our business in terms of giving us the advantage of investing more efficiently in an area that we find very attractive for years to come. And so I think that's really how we think about making these investments whether it's organic or inorganic, but I really do think there are times where capital certainly is a privilege we have now, given the fact that we built a cash flow positive business as well as have a lot of money on the balance sheet with no debt. Your line is open. Your line is open."
}