{
    "symbol": "DASH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 22:20:03",
    "content": " Your line is open. Your line is open. Your line is open. And where we're at in terms of the investment cycle, the bull markets are relatively new, both in terms of merchant adoption, as well as user adoption, as an example, even in its oldest market, adoption levels are less than 10% of the population, that test drive, there's a lot of room to grow, just as you grow your footprint within these countries, as well as you grows merchants selection, and grow the consumer base. And so, how was it possible that a, 'subscale company' was able to rise to market leadership, while it really was mastering the order level execution of the business, and again, you know, this is a hyperlocal business for order density, and achieving minimum efficient scale, through leading a retention order frequency, which is really, you know, measured in whether or not you build a superior product of selection, quality prices, and service. Your line is open. Your line is open. Your line is open. If you look at selection, for instance, in the 12 months, leading up to the end of the second quarter, we've added 80,000, net new stores onto the platform, we've made improvements to many quality metrics, in terms of our delivery experiences, whether it's speed, or accuracy, and other types of improvements, we've made many improvements to the shopping experience to lower the friction for consumers. Your line is open. And so that's something that we expect to continue to help grow our platform services business, whether they're large merchants, like some of the ones you mentioned, who participate with products like DoorDash Drive or smaller merchants that really need help getting online for the first time and growing their kind of same-store sales off-premise with products like DoorDash Storefront. Your line is open. And so what's driving that is not just enhanced order frequency, which has continued growing on a year-on-year basis, as a result of improvements in selection, quality and price as well as the new categories that weâ\u0080\u0099re adding, but also improvements in terms of the core margin structure of the product. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}