{
    "symbol": "GLW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 12:21:03",
    "content": " With me today are Wendell Weeks, Chairman and Chief Executive Officer; Ed Schlesinger, Executive Vice President and Chief Financial Officer; and Jeff Evenson, Executive Vice President and Chief Strategy Officer. You should also note that we'll be discussing our consolidated results using core performance measures, unless we specifically indicate our comments related to GAAP data. For the third quarter, the primary difference between GAAP and core EPS was from primarily noncash charges associated with capacity optimization and noncash mark-to-market adjustments associated with the company's currency hedging contracts. Today, we reported solid third quarter results that demonstrate strong execution. Sales were $3.7 billion, up slightly versus a strong third quarter last year, and EPS was $0.51. While we believe that display panel maker production bottomed in September, we would like to see additional positive evidence before guiding a significant recovery in glass demand. Before we get into the details, I wanted to set some context on what we're facing across our markets. On our last call, we told you that end markets in multiple businesses were down. A smartphone sales in the second quarter declined 8% year-over-year, panel maker utilization in June 2022 was at its lowest level since 2009. And yearly, automotive production was 10 million to 15 million vehicles below its pre-COVID rate. A smartphone unit sales declined 14% year-over-year in the quarter, with tablet and notebook demand down 17%. We continue to benefit from infrastructure investments in broadband and clean energy, two secular trends we're strategically positioned to address. We delivered 16% year-over-year growth in Optical Communications, and we captured ongoing demand in the solar market, which contributed to 33% year-over-year growth in Hemlock and Emerging Growth Businesses. What we're seeing in some of our key markets, how we're responding. In the third quarter, the glass market and our volume both decreased almost 25% sequentially and which significantly reduced our sales and profitability. In September, panel maker utilization reached the lowest level since the fourth quarter of 2008. More than a year ago, we said we expected a correction in the display industry during 2022. In the second quarter, panel makers began reducing production levels with accelerated reductions in June. In the third quarter, panel maker production reached an even lower level. Consequently, we expect our volume and profitability to increase sharply when panel maker utilization rebounds and we expect to exit the correction with strengthened customer relationships and importantly, a refreshed manufacturing fleet. In mobile consumer electronics, customer product launches and strength in semiconductor drove sequential growth in Specialty Materials. As I noted, smartphone and IT retail unit sales declined significantly in the quarter. We expect the year-over-year decline in smartphones, notebooks and tablets to be greater in the second half than in the first half. Now that said, we continue to outperform the market through our product leadership, our more Corning approach and our ongoing collaboration with industry leaders. Over the long term, our content strategy in mobile consumer electronics will help us grow. As we continue to develop and launch premium glasses and optical treatments,for existing and new form factors. Additionally, we're executing our more Corning approach in the semiconductor industry. In July, Senator, Chuck Schumer and New York Governor, Kathy Hochul, joined us to announce government funding that supports an expansion of our advanced optics facilities, which made equipment and materials vital to semiconductor manufacturing. We've helped advance the industry for more than 50 years, and our expansion will keep us well positioned to support nearly every step of the chip manufacturing process and to respond to new customer needs, including products for EUV technology. In Environmental Technologies, we delivered sales and profit growth despite the constraints on vehicle production, and we're outperforming the market for the year. During the quarter, CarUX, a leading car display company owned by Innolux, announced its use of our patented cold-form technology to help drive the future of auto interior displays. Corning continues to be well positioned to further grow its automotive business as the industry offers more advanced, designed-oriented cabins and enhanced driver assistance features. Let's move to Optical Communications, which was the largest contributor to third quarter sales. The industry continues to experience a large multiyear wave of growth for passive optical networks, and we continue to increase our capacity to support this growth. In August, U.S. Secretary of Commerce, Gina Raimondo, joined AT&T CEO, John Stankey, and me to announce a new manufacturing facility in Arizona. In September, we opened a new optical fiber manufacturing plant in Poland to serve committed demand. In the quarter, we announced additions to our Evolv connectivity portfolio which helps operators streamline permitting, accelerate field installation and optimize network testing. Optical sales have grown 22% and for the first 3 quarters of the year, setting us up for another strong year of growth. However, we expect fourth quarter sales to be down sequentially due to the timing of customer projects. The renewable energy industry is evolving rapidly, and our ongoing growth continues to indicate that the market's behavior is more closely tied to a global imperative than the current economic trends. Third quarter sales grew significantly year-over-year, and we will benefit from the state of Michigan's infrastructure investment program, which will help us expand operations to meet increasing global demand for polysilicon. We believe that Corning's broader technical and manufacturing capabilities, our 3 and 4, will prove to be highly relevant and helping advance the renewable energy industry, and we see excellent growth potential in solar. Now as I conclude my remarks, here's what I'd like to leave you with today. We've been leading in the automotive and life science markets for 100 years, display for 80 years, telecommunication for 50 and mobile consumer electronics since the inception of smart devices. In the past, what enables us to power through moments like the present while maintaining an attractive long-term growth trajectory. Sales were $3.7 billion, up 1% from a strong third quarter in 2021. Optical Communications, Environmental Technologies, Life Sciences and Hemlock and Emerging Growth Businesses all delivered year-over-year growth. In September, Display Technologies experienced the lowest panel maker utilization levels since 2008, resulting in a 28% year-over-year decline in sales for the segment in the third quarter. In Specialty Materials, we outperformed the smartphone market, which was down double digits year-over-year. Gross margin was 36.1% and operating margin was 16.9%, down sequentially 140 and 190 basis points, respectively, driven by the lower volume in display technologies. In the third quarter, free cash flow was $255 million, and year-to-date, it was $866 million, keeping us on pace for another year of healthy cash generation. And despite the challenging environment during the quarter, we were able to offset significantly lower volume in display technologies, and we outperformed our underlying markets overall. In Optical Communications, sales grew 16% year-over-year, reaching $1.3 billion. Our year-over-year growth was driven by network operator investments in 5G, broadband and the cloud. Net income was $183 million, up 32% and year-over-year, driven by leverage from strong incremental volume. We continue to secure customer commitments, and we're investing to appropriately scale production to serve our incremental demand from current and new customers. As we've mentioned in the past, this business can be lumpy from quarter-to-quarter, and you'll see that play out in the fourth quarter as we expect optical sales to be down sequentially based on the timing of customer projects. As we updated you in September, panel makers reduced their production levels below our already low expectations. The lower volume resulted in display sales declining 28% year-over-year and 22% sequentially, and we saw a 46% year-over-year and 41% sequential decline in net income due to the high fixed cost nature of glass manufacturing. In the third quarter, glass price was once again consistent sequentially. And we believe the glass pricing environment will remain favorable and factors that continue to drive that favorable pricing include glass supply-demand balance as panel makers reduce production, Corning and other glass makers took additional tanks offline for maintenance and repairs after an extended period of glass tightness. So overall, we continue to operate from a position of strength in the display market. And as Wendell noted, while we believe that panel maker utilization reached the bottom in September, we would like to see more evidence before we got a significant recovery in glass demand. But when glass demand grows, we expect our volume to increase and our profitability to improve. In Specialty Materials, the market for smartphones was down 14% and tablets and notebooks were down 17%. We outperformed the market with sales down only 7% year-over-year, driven by strong demand for premium glasses, and strength in semiconductor materials. Third quarter sales were up 7% sequentially, driven by demand for our premium cover materials to support customer product launches. And adding to our resilience in the segment, Advanced Optics delivered record sales for the second quarter in a row, and we are bringing additional capacity online at our facilities in Fairport and Canton, New York. Net income for the segment was $96 million, down 10% year-over-year due to lower volume and continued development expense related to next-generation products. The weakness in the smartphone tablet and notebook markets intensified in the quarter, and we expect fourth quarter sales and profitability to be down sequentially and year-over-year. Long term, we expect to outperform the market as we continue to develop and launch new premium glasses and optical treatments. In the third quarter, sales were $425 million, up 10% year-over-year and 19% sequentially. However, vehicle production remains constrained due to the continued component shortages. In addition to our sales growth, we improved profitability with net income up 45% year-over-year. Our content-driven strategy is working, gasoline particulate filters remain a critical component of that strategy, driving revenue even in a weakened market. In Life Sciences, sales were $312 million, consistent sequentially and up 2% year-over-year. And looking ahead, we expect to see continued growth in both research and bio process. Finally, in Hemlock and Emerging Growth businesses, sales were $407 million, up 33% year-over-year and down 3% sequentially. We continue to see increased demand for semiconductor grade polysilicon and strong demand for solar materials, and we continue to ramp solar capacity and sign up new customers with long-term take-or-pay contracts. In September, Corning Pharmaceutical Technologies announced that it was awarded $104 million in additional funding from BARDA to support our planned capacity expansion for advanced, high-quality pharmaceutical glass tubing and vials. In Optical Communications, pacing of customer projects will impact sales for the quarter. In Specialty Materials, we expect a sequential decline driven by lower demand in the smartphone, notebook and tablet markets. As I noted, we do not yet have enough positive evidence to guide significant improvement in glass demand from September levels. And for the full year, we expect free cash flow in the range of $1.3 billion to $1.5 billion. As I noted at the opening of my remarks, we're executing well. And because of our inherent balance of our cohesive portfolio and our More Corning approach, we're built to be resilient even in a downturn as evidenced by the performance of Specialty Materials and Environmental Technologies this quarter. Our long-term growth drivers all remain intact, and we're well positioned to continue capturing growth tied to key secular trends such as Optical Communications and solar. In the meantime, we will continue to maintain our strong balance sheet and employ a highly disciplined approach to capital allocation. Given the external environment, we're taking actions to preserve profitability, tightly manage capital expenditures and prioritize cash flow. Crystal, we're ready for the first question. Mehdi, what I would say on OpEx, we're certainly taking actions to pause spending in this current environment. I don't think, given the fact that we feel good about our long-term growth drivers, we're going to take significant actions at least at this point in time. And with respect to capital, we're definitely pausing spending here as we go into the fourth quarter, and you should see the rate of our spending coming down a little bit. And then secondly, can you give us a sense for how the ramping of the plants, the new plants for Optical has helped -- I assume it helped margins during the quarter and how that helps into next year and what the offset is with the build-out for Arizona. But as you know, what we do is we try to make sure that we're supporting those customers that will be big, long-term players and the nature of telecommunications is that there is -- it's a pretty concentrated industry. And as you know, I tend to be pretty pessimistic on Opto but just sort of overwhelming evidence that demand is very strong. And that's legitimate, whether in the last 3 months or a little longer than 3 months, that's hard to tell. We'll be able to use that as we go forward, but it takes a little while for all the cost drag to kind of go away and we should see that sort of fully ramped and the financial impact in 2023. So our analytics are really good at being able to say, for instance, last year, we said there was going to be a correction in 2022. And then they're very good at doing things like calling a bottom because we can tell sort of where our panel makers are operating, and what exactly is happening with their inventory, et cetera. So for instance, our analytics would have said the panel maker industry should have started. It's correction in a much more robust way in quarter 4 of last year in quarter 2, but they didn't actually start until quarter 2 and then accelerated into quarter 3. So though we're really comfortable with our analytics, they we're a bottom. And so the way we tend to try to do that, it's a little softer but we do take a look at panel price inflection points. So that's where the absolute level is, but when do they turn and that is actually a buy signal for buyers, right, and it makes signal for panel makers. Wendell to follow up on that prior question, would you say -- you guys have disclosed in the past levels of weeks of inventory in the display supply chain. And Ed, if I could, I appreciate the fact that you guys are largely hedged for 2023, but the yens obviously moved to . Value chain inventory, we would say right now is at the healthy range and is starting to approach sort of a little bit tight for healthy. So that's like one of the analytics where we can say, \"Okay, right, that the correction has done what it is it's supposed to do. I was just wondering if there was any -- like I think you guys have mentioned in the past 10 to 15 weeks, depending on various times in various cycles. We do have some hedges in place beyond 2023 and the farther out you go, the spot rate or the forward rate -- sorry, the forward rate is below where the current spot rate is, and that affords us some opportunity to do things further out. We understand how people are thinking about it, and we're going to be opportunistic and try to protect ourselves at this current core rate level. First, could you talk a little bit about -- you talked about the timing deals happens a lot in this industry. And then on the telco side, we're increasingly hearing throughout the world about pressures on macro and energy costs and whatnot potentially affecting fiber builds, which have been obviously really strong over the last few years. So then it really ends up us being able to answer from our order book, what's going on. In terms of the macro, I don't know that we're the right ones to ask because there's so much demand, and we're still short especially in fiber and cable, that we'll tend to get more signals that they want more and more and they share how aggressive their plans are. So we're probably getting a lot more of that than we are the sort of macro, are they cautious. The combination of major government programs around the world that don't really start to kick in for almost another year, right, as well as catching up to all the demand that happened during the pandemic and how much of their capacity basic their guardrail capacity got consumed by demand as well as the 5G, cloud, all the broadband initiatives, all these things still a really sort of positive bullish signal to us. So our confidence on price really has been driven by our performance throughout this correction and going into where our prices have been up to stable throughout every single stage of it, including here in this last quarter. So you heard from Ed sort of the dynamics that is bit of led to this but we feel good about where we're at, and we expect pricing to continue to be stable as we exit the correction as it has been up to stable throughout going into the correction and to the bottom of the correction. So what you saw this quarter was primarily related to sort of an early-stage business, moving more towards commercialization. Our cost goes down significantly and we sort of obsolete those Gen 1 assets, and that's the primary driver of what happened in the third quarter. Because it seems to me like this could be a big opportunity for Hemlock, especially if you start bringing more capacity back to the U.S.\n Shannon, so first, I would say we feel great about our Solar business. And our orders are strong, and we continue to sign customers up and sell out the capacity we've brought online. I think as we've shared, we have more capacity that we can bring online and we're in the process of evaluating that and the exact timing of when all that will happen. I think you can all -- you can view that as all positive for us, and we'll come back over time and talk a little bit about it more in detail. Shannon, you're right to look at it and say, \"Gosh, I think this is probably really good for Corning.\" And then secondly, on pricing, I know you've talked a little bit about pricing increases, it sounds like there's a little bit more that could be coming in Optical. So as I shared in my opening that as whether it's in smartphones, notebooks, panel maker utilization, automotive, we're seeing those markets that are highly consumer electronics-related or highly consumer-related to be down significantly already. As of yet, that has definitely caused our customers so they pace. Much like us, our customers take a long time to build productive capacity and develop new technologies. On price, yes, we are saying that in Opto, we've experienced some more inflation, and we will go -- going to be approaching our customers to more appropriately share that in this coming quarter. Throughout the year, we have done actually quite a good job of being able to share the inflation we experienced with our customers with price increases really across our business base. So, so far, we've been able to do that successfully and ask me the question again next quarter, and I'll tell you how this latest round went. I guess I had a similar macro question for you, Wendell, which is, I mean, for a long time, you've been outperforming most of the underlying markets you participate in, and the driver there has been more Corning content in every end market. I'm just thinking as we sort of go into next year and the macro is tougher, have you seen in past down cycles, any change in customer willingness to sort of continue to increase Corning content, particularly in sort of a challenging macro. But at the same time, the macro is starting to worsen a bit more than expected. So in macro, I'd say, no, that we're not seeing a reduction in their capability. So on our latest set of innovations basically involve us being able to deliver totally engineered connectivity systems so that we save 40% of materials for them we can say, months and installation time. And so that in total, you give us a lot more price, a lot more revenue but it saves you money in time. That is like a typical angle for us in More Corning, and we're continuing to see good adoption of those. And some of our other mobile consumer electronics players, particularly in China, sort of have lost in that premium battle and are doing a little bit less of our key innovations. So -- and  still think that fundamental More Corning strategy is playing out well, very strong heartbeat. I know you said it was mostly within the telcos, but just wanted to get a sense is that largely concentrated within the U.S. or international? First question, North America based, right, and relatively limited in terms of its -- the number of people that are involved. And I think if you just talk to the industry more broadly, you'll see that , to refrain from almost all of our customers is we can't get enough. And so that's still the backdrop, that's still the heartbeat and it's just timing and a few key customers. And Meta, on inventory, you're right. That's what we're thinking, it will start to happen in the fourth quarter and as we go into 2023. First and foremost, just in general, the supply chain has been difficult, and we want to make sure we can serve our customers, so we're carrying a little more inventory than we might otherwise have. And as we brought our sales forecast down for the back half of the year, we need to sort of catch up and digest a little bit of the inventory that we have and that we've produced. And yes, our goal is to get it down starting here in the fourth quarter. If I were to go back to late 2019, 2020, the last time that your Display revenue were declining, the averaged 20% net income. And if I fast forward to your Q3, your revenues are about $70 million less than that period, but you're still able to get almost to 20% net margin. Or is this something else that helps with relatively better margin given the lower revenue volume, an insight would be great. So first, I'd say you're right. Very stable pricing, a very stable market position and then use our big technology lever to continue to drive our cost performance and drive up our profitability. Before we close, I wanted to let you know that we will attend the Credit Suisse 26th Annual Technology Conference on November 29 and the Barclays Global Technology, Media and Telecommunications Conference on December 8. Finally, a replay of today's call will be available on our site starting later this morning."
}