{
    "symbol": "GLW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 11:44:04",
    "content": " Building on last year's strong performance, we grew full year sales 5% to $14.8 billion and EPS 1% to $2.09. To address this, we took further actions, including raising prices again in Optical Communications and Life Sciences to more appropriately share the inflationary costs with our customers, adjusting our productivity ratios closer to historical metrics without impacting our ability to supply and capture future growth and reducing inventory by $115 million in the fourth quarter. Fourth quarter sales were $1.2 billion, down $122 million sequentially, reflecting the slower pacing of customer projects that we discussed on our last call. The strength of the first 3 quarters of 2022 drove annual sales to an all-time high of $5 billion, reflecting a 15% increase, while net income grew 20% year-over-year to $661 million. We anticipate glass price in the first quarter of '23 to be consistent with the fourth quarter, and we expect the favorable glass pricing environment we experienced over the last few years to continue, driven by 2 factors: first, glass makers continue to align supply to demand. In Specialty Materials, fourth quarter sales of $505 million were down 3%, but we outperformed our markets driven by customer product launches and continued strong demand for premium glasses and advanced optics products. Full year net income was $340 million, down 8% year-over-year due to continued investment in next-generation materials for consumer electronics and semiconductor equipment as well as new markets, such as bendable devices and augmented reality. In Environmental Technologies, fourth quarter sales were $394 million, up 12% year-over-year. Fourth quarter sales were $294 million, down sequentially and year-over-year, impacted by lower demand for COVID-related products. Full year sales of $1.2 billion were consistent with a strong 2021, while net income was $153 million, down 21% as the unexpected shift in demand away from COVID-related products led to a significantly lower productivity in our manufacturing operations. And finally, in Hemlock and emerging growth businesses, sales in the fourth quarter were $462 million, up 22% year-over-year and 14% sequentially. And full year sales were $1.7 billion, up 34% year-over-year, reflecting strong demand for polysilicon as we continue to see robust demand for both semiconductor and solar grade polysilicon. So to the first question, what we've tried to do with our profitability actions is that to have that sort of run rate in EPS that you're talking about, that's a $2 run rate to be when we hit revenues that are like quarter 4, sort of 3,6, 3, 7 level."
}