{
    "symbol": "ESS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 18:00:25",
    "content": " Year-to-date, the economy on the West Coast has shown resiliency with job growth as of September 2022 of 4.3% in Southern California and significantly higher in the tech markets of Northern California and Seattle. Job growth is expected to be new next year, growing at 0.4% overall in the Essex market, with the best job growth expected to be in San Francisco at just over 1%. As a result of these demand and supply assumptions, we expect net effective new lease rents to increase 2% in 2023 with our California markets expected to marginally outperform Seattle. Starting with the third quarter, during much of this period, we capitalized on the strength of the underlying fundamentals in our markets by pushing rents and achieved 10.3% year-over-year growth in new lease rates in the third quarter. Although this is a deceleration compared to the 20% growth in the second quarter, keep in mind that new lease rates in the first half of last year declined by about 6%, but in the second half new lease rates surged to positive 17%. And then maybe just on the transaction market, given kind of the expected rent growth and where debt costs are today, does the 4.5% cap rate make sense for most buyers, or how are they thinking about getting to their unlevered IRRs, given maybe the negative leverage situation initially right now? So first thing is that Angela, she thinks for next year the kind of proxy formula is that 3.5 plus half the growth of next year, which is the 2%, which is the pretty dire scenario. Mike or Angela, I know you guys are talking about that 2% market rent growth feeling a bit dire, but I guess how do we get comfortable with the fact that the loss-to-lease was 7% in September of this year versus a historical level of 3%. When I think about this 2% number that weâ\u0080\u0099re all talking about, if you were to go back and say in a normal time and you were to look at S-17, and you look at the supply number that youâ\u0080\u0099re referencing of 0.6, and the job forecast at 0.4, and itâ\u0080\u0099s a normal time, what would what would be the number."
}