{
    "symbol": "ESS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 18:05:28",
    "content": " We are pleased to announce our fourth consecutive quarter of improving results with core FFO up 21.1% from the same quarter last year, exceeding the high end of our guidance range and achieving the second best quarterly growth since the Company's IPO in 1994. This resulted in same-property revenue growth of 12.7% on a year-over-year basis and a 4.8% on a sequential basis, which are some of the highest growth rates achieved in the Company's history. This region generated a 20.7% year-over-year net effective rent growth on new leases for the second quarter, which was led by Eastside Seattle, where the majority of our portfolio is located. This region generated 17.5% year-over-year net effective rent growth on new leases for the second quarter, which was led by Santa Clara County at 24%, primarily driven by the robust demand from large tech employers in Silicon Valley. Moving on to Southern California, which has been a strong performer with 22.4% year-over-year net effective rent growth on new leases for the second quarter. Healthy job growth has continued to drive incremental demand in Southern California, which is built upon the significant rent growth achieved last year and resulted in our highest level of loss to lease at 12.1% in July. And then, Steve, as it relates to guidance, as what Angela said earlier, the first half of the year, we had much easier comps, but given the surge in rents we saw last year, we have much more difficult comps in the second half of the year, which on new leases, we're assuming in the second half of the year 7% new lease growth, it was 15% in the first half of the year, so a significant reduction just because of the comp issue. But, I'm really trying to understand with that backdrop of strong job growth, growing market rents still through July and the healthy loss to lease in place, why do we get to 7% new lease rate growth versus the 14%, I think you achieved in July for the back half of the year."
}