{
    "symbol": "KPTI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 11:49:05",
    "content": " Second, we continue to advance our focused clinical pipeline comprised of mid and late-stage clinical development programs that is being purposely built and strategically focused on targeting cancers with high unmet need, where our science enables us to make the biggest difference in the lives of patients and where we believe we'll have the highest probability of success. Turning now to Slide 9 on our commercial highlights for the second quarter of 2022, we grew net product revenue by 44% versus the same period last year, and continued to make progress across key indicators since our second line plus launch at the beginning of 2021. We continue to make progress with our primary growth driver and what we believe is most important to patients, which is a continued shift of XPOVIO into early align and the community setting with over half of our patients in the second to fourth line. We continue to see a positive shift in perception of XPOVIO in the second to fourth line per the intent to prescribe data due to the growing confidence among our physicians in using the lower dose once weekly exposure based triplet regimen, with over 90% of patients now starting on a hundred milligrams weekly dose or less. For the second half of this year, my team and I remain laser-focused on continuing to drive the shift into earlier lines and expanding our growth in the community with an unwavering passion to improve the lives of these patients. Number one, accelerating growth in the second to fourth line to offset erosion in late lines from late line competition, and secondly, to expand further into the community where a majority of the earlier line patients are treated and these community physicians prefer a convenient oral regimen that's manageable, easily combinable post an anti CD-38. Secondly, as I mentioned, we are seeing this continued positive shift in use of XPOVIO in the second to fourth line over half of our patients are in this setting. So, yes, we're seeing a continued increase in the use of anti-CD38 in the front line, which in turn continues to leave that unmet need open in that middle section of the treatment journey between second to fourth line, where there is no clear standard-of-care, and XPOVIO has proven data post anti-CD38."
}