{
    "symbol": "CSWI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-18 14:05:02",
    "content": " Today, we reported record revenue of $626 million, nearly a 50% growth over the prior year. Our Contractor Solutions segment achieved record sales of $416 million, including record HVAC/R end market sales of $335 million, a $159 million or 91% total increase, including organic growth of $56 million. Our consolidated revenue during fiscal fourth quarter 2022, was $173 million, a 30% increase compared to the prior year period. Consolidated gross profit in the fiscal fourth quarter was $72 million, representing 32% growth, with the incremental profit resulting predominantly from the Shoemaker acquisition, increased organic sales volumes, and pricing initiatives. Reported net income attributable to CSWI in the fiscal 2022 fourth quarter, increased to $18 million, or $1.17 per diluted share, compared to $10 million or $0.66 in the prior year period. Transitioning to a discussion of our segments, our Contractor Solutions segment, with $120 million of revenue, accounted for 69% of our consolidated revenue, and delivered $33 million or 37% of total growth, as compared to the prior year quarter, comprised of organic revenue growth of $25 million, and inorganic growth of $8 million from the TRUaire and Shoemaker acquisitions. Quarterly segment adjusted EBITDA was $35 million or 29% of revenue, compared to $29 million or 33% of revenue in the prior year period. Continuing to our Engineered Building Solutions segment, EBITDA was $2.2 million or 9% of fiscal 2022 fourth quarter revenue. Our Specialized Reliability Solutions segment, posted another solid quarter of organic revenue growth of $9 million or 43%, due to incremental sales volumes, driven by improving end market dynamics and numerous price initiatives over the past fiscal year. Segment adjusted EBITDA margin improved to $5.3 million and 17% in the fiscal 2022 fourth quarter, compared to $3.5 million and 17% in the prior year. We achieved record consolidated revenue of $626 million, representing 49% growth versus the prior year, with all segments reporting organic growth. In the current year, we reported a 46% increase in adjusted EBITDA to $133 million, equating to an adjusted EBITDA margin of 21% as compared to $91 million and 22% in the prior year. As compared to the prior year, our Contractor Solutions segment, with $416 million of revenue, accounted for 66% of our consolidated total, and delivered $171 million or 70% total growth, comprised of organic revenue growth of $68 million, and inorganic growth of $103 million from the TRUaire and Shoemaker acquisitions. Continuing to our Engineered Building Solutions segment in the current fiscal year, this segment accounted for approximately 16% of our consolidated revenue at $97 million. Our Specialized Reliability Solutions segment posted organic revenue growth of nearly 50% or $38 million, due to incremental sales volumes, driven by strengthening end market dynamics, numerous price initiatives during the last year, and improved execution. Segment adjusted EBITDA and adjusted EBITDA margin improved to $15 million and 13%, compared to $9 million and 11% in the prior year. We ended fiscal 2022 with $17 million of cash and reported cash flow from operations of $69 million, a 4% increase over the prior year period."
}