{
    "symbol": "CSWI",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-06 19:18:05",
    "content": " For additional perspective, if we compare this quarter's results to this quarter two years ago which was our fiscal 2020, top line growth was nearly 54%, including organic growth of 19%; adjusted EBITDA growth was a compelling 50%, 5-0 and adjusted earnings per share increased 24%. Our consolidated revenue during the fiscal second quarter of 2022 increased 48.3% to $155.6 million, with higher revenue across all three segments compared to the prior year period. Consolidated gross profit in the fiscal second quarter was $63.1 million, representing 29.4% growth, with the incremental profit resulting predominantly from the TRUaire acquisition and increased organic sales volumes and pricing initiatives. Reported net income attributable to CSWI in the fiscal second quarter of 2022 was $18 million, or $1.14 per diluted share compared to $16.4 million, or $1.10 in the prior year period. As compared to the prior year quarter, our contractor solutions segment accounted for 66.4% of our consolidated revenue and delivered $40 million, or 63.1% total growth, comprised of organic revenue growth from pricing initiatives of $4.8 million, or 7.6% and inorganic growth from the TRUaire acquisition. With this year-to-date comparison, our contractor solutions segment delivered $100.3 million, or 88.6% total revenue growth comprised of 27.9% organic growth due to increased sales volumes and implemented pricing initiatives and inorganic growth from the TRUaire acquisition of $68.8 million. During the fiscal first half of 2022, strong segment revenue growth was partially offset by significantly accelerated inflation in material and freight costs, $1.4 million of costs associated with the reduced production at our TRUaire Vietnam facility as well as the increased headcount, depreciation and the optimization of expenses related to our ERP system. Segment adjusted EBITDA in the fiscal first half was $71.8 million, or 33.6% of revenue compared to $40.4 million, or 35.7% of revenue in the prior year period as the increased expenses discussed above and the inclusion of TRUaire outpaced revenue growth. Segment EBITDA was $3 million, or 12.6% of fiscal 2022 second quarter revenue. In evaluating fiscal 2022 first half performance, revenue improved $3.6 million, or 7.9% as compared to the prior year period. Our specialized reliability solutions segment posted another solid quarter of organic revenue growth of $10.4 million, or 58%, due to incremental sales volumes as the end-markets we serve continue recovering from the COVID-driven lows of last fiscal year and price initiatives, the fourth of which we successfully implemented last week. We ended fiscal second quarter with $17.3 million of cash and reported cash flow from operations of $42.8 million, a slight decrease over the prior year primarily due to increased investment in working capital to support growing sales which resulted in higher accounts receivable and higher inventory levels. In light of current economic volatility due to persistent, rapidly rising material and freight costs, combined with the lag in the effectiveness of some of our pricing initiatives, CSWI is providing consolidated guidance for the fiscal 2022 third and fourth quarters as follows: For the third quarter, we expect an EBITDA range of $17 million to $18.5 million and an EPS range of $0.40 to $0.45."
}