{
    "symbol": "CSWI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 15:06:02",
    "content": " In addition to the inorganic growth from the TRUaire and Shoemaker acquisitions, the Contractor Solutions segment drove $42.8 million of organic revenue growth, primarily into the HVAC/R and plumbing end markets. In fact, in the year-to-date period, Specialized Reliability Solutions revenue exceeded its revenue in the same period in fiscal 2020 of 2 years ago by 7.3% or nearly $6 million. Consolidated revenue during our fiscal third quarter 2022 was $136.3 million, a 51.5% increase as compared to the prior year period. Consolidated gross profit in the fiscal third quarter was $50 million, representing 27.2% growth with the incremental profit resulting predominantly from the TRUaire and Shoemaker acquisitions, increased organic sales volumes and pricing initiatives. Consolidated operating income was $12.1 million, equating to an 8.9% margin, a 450 basis point decrease as compared to adjusted operating margin in the prior year period as the decline in gross profit margin was only partially offset by an improved operating expense margin. Transitioning to a discussion of our segments, as compared to the prior year quarter, our Contractor Solutions segment accounted for 60.5% of our consolidated revenue and delivered $38 million or 85.6% total growth, comprised of organic revenue growth of $11.2 million, or 25.3% and inorganic growth from the TRUaire and Shoemaker acquisitions. Segment EBITDA was $3.6 million, or 15.1% of fiscal 2022 third quarter revenue. Our Specialized Reliability Solutions segment posted another solid quarter of organic growth of $11.5 million or 57.9%, due to incremental sales volumes driven by improving end market dynamics and numerous price initiatives during the last year, the latest of which we successfully implemented in January. Transitioning to the strength of our balance sheet, we ended fiscal 2022 third quarter with $16.2 million of cash and reported cash flow from operations of $69.5 million, a 28.5% increase over the prior year period. This is approximately $25 million lower than the end of the prior year period, providing us approximately $179 million of revolving borrowing capacity as of the end of fiscal 2022 third quarter. For the fiscal 2022 third quarter, CSWI reported $19.9 million of adjusted EBITDA and $0.52 of EPS, exceeding the previously provided quarterly guidance range for both metrics of $0.40 to $0.45 of EPS and $17 million to $18.5 million of EBITDA."
}