{
    "symbol": "SNBR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 21:02:06",
    "content": " Demand for the quarter was down 3% year-over-year, net sales declined 7% to $527 million and earnings per share were $0.09. While the if -- while the external environment is certainly more challenging than we expected, we are effectively managing near-term risk and simultaneously creating long-term value by capitalizing on our competitive advantages, including introducing new innovations that support smart sleepers changing needs and provide the highest quality sleep; sustaining Sleep Number's sleep innovation, health and wellness and sleep science and research leadership position; completing the transition to our more responsive and flexible enterprise supply network, strengthening our digitization efforts to improve operating efficiency and customer experience; managing price elasticity in an environment with rising costs and promotional intensity; and proactively managing our capital and liquidity with disciplined metric driven decisions. Pressures causing the 530 basis point decline versus the prior year included the absorption of $140 million of annualized cost increases, lower overhead absorption on 5% fewer smart beds delivered and 25% fewer adjustable bases delivered in the quarter than the prior year due to current year chip supply constraints. Your line is open. We -- the other factor was the demand that we did generate skewed very high end, and that ended up in the backlog and contributed to what I highlighted, the 20% increase in our backlog since December and the addition of $50 million net sales equivalent to our excess backlog at the end of the quarter. Your line is open. We also -- we do expect lower net sales for the year, but the benefit of backlog will help support that to be low double-digit growth over the prior year, whereas in our previous guidance, we were expecting high enough demand during the year that we wouldn’t actually use the backlog to benefit the current P&L. Thanks a lot, Bobby. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Thanks a lot, Bobby. Your line is open."
}