{
    "symbol": "XPRO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 16:41:08",
    "content": " Excluding $5 million of commissioning costs on a subsea project, which Iâ\u0080\u0099ll come back to in a moment, adjusted EBITDA in Q4 was $75 million or 21% of revenue, primarily driven by increased activity across the majority of our operating segments at a more favorable activity mix. To recap, we reported revenue of $351 million for the December quarter, which was up sequentially $17 million or approximately 5% relative to the third quarter of 2022. Adjusted EBITDA for the fourth quarter of 2022 was approximately $70 million, representing a sequential increase of approximately $22 million or 46% relative to the third quarter of 2022. Excluding the $5 million impact of the commissioning costs and the previously referenced subsea project, adjusted EBITDA would have been $75 million and adjusted EBITDA margin would have been approximately 21%, reflecting a more favorable business mix and lower support costs as a result of merger-related synergies, resulting in higher fall through an incremental revenue. Excluding the $5 million impact of the commissioning costs and the subsea project in the fourth quarter of 2022, adjusted EBITDA would have been up $24 million or 47%. Adjusted EBITDA on a combined company basis for the full year was up $48 million or 31% year-over-year to $206 million, primarily due to a combination of more favorable business mix and lower support costs as a result of merger related synergies. Excluding the $28 million impact of the commissioning costs on the subsea project in 2022, adjusted EBITDA would have been up $76 million or 48% year-over-year to $234 million. Fourth quarter contribution margin of 39% was up approximately 6 percentage points sequentially, primarily reflecting more favorable activity mix and the impact of lower commissioning costs associated with the previously referenced subsea project in the current quarter. Quarter-over-quarter contribution margin relative to the fourth quarter of 2021 was flat, excluding the $5 million impact to the commissioning costs on the subsea project in the fourth quarter of 2022. For the full year, on a combined company basis, contribution margin decreased 1 percentage point year-over-year to approximately 37%, excluding the $28 million impact of the commissioning costs on the subsea project in 2022, contribution margin was up 1 percentage point year-over-year to approximately 39%. Fourth quarter support costs of $71 million totaled 20% of group revenue, which has a percentage of revenue is flat relative to the third quarter of 2022 and was down $7 million or approximately 11 percentage points relative to the combined company support costs of Expro and Frankâ\u0080\u0099s in Q4 2020, which was the last full quarter prior to the announcement of the merger. ESSA segment EBITDA for the fourth quarter was $30 million or approximately 26% of segment revenue, a sequential increase of 12 million. Through the fourth quarter of 2022, we have realized the annualized merger related cost synergies for approximately $66 million, thereby achieving the companyâ\u0080\u0099s target for total support costs as a percentage of revenue of 20%. When we announced the proposed combination of Expro and Frankâ\u0080\u0099s in early 2021, I indicated that we believe that combined company had a â\u0080\u009cclear path to $1.5 billion revenueâ\u0080\u009d, more than 20% adjust EBITDA margin and an excess of $150 million of free cash flow generation. The project that we talked about in Q3 and we gave a little more commentary on here today, the E&I project in Congo very much production related you know, very much tied to the concerns around energy security in Europe and really around the kind of strengthening fundamentals of L N G. So long answer to say, weâ\u0080\u0099re really seeing good growth in all four of the main business lines, but for different drivers, but weâ\u0080\u0099re kind of seeing that all kind of move to the â\u0080\u0093 kind of up and to the right, so to speak, in all four of the business lines, different drivers for each, but just continues to be very positive momentum, especially when youâ\u0080\u0099re offshore and youâ\u0080\u0099re international, weâ\u0080\u0099re 80% of our activities international."
}