{
    "symbol": "MCG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-18 15:12:08",
    "content": " We saw continued growth in recurring membership revenues, up 45% versus Q1, 2021, and 12% versus the prior Q4 2021. To give you an example, both Nashville and Brighton houses we opened in Q1 had a very strong CWH membership, which ensured we open the house is perfectly tailored to what our members want in each of those cities and achieving our opening membership goals. We saw continued growth in recurring membership revenues, which were up 45% versus Q1 2021 and 12% higher than Q4 2021. In the quarter, membership revenue, our recurring revenue income stream increased to $58.8 million or 45% above Q1 2021 levels and accounted for 31% of total revenue in the period. Other contribution also improved strongly from a loss of nearly $12 million in Q1 2021 to a positive $4.6 million in Q1 2021, predominantly due to growth in our retail offering year-on-year and improved performance in our restaurants and townhouses following reduced restrictions. Membership revenue growth was driven by 19,819 new adult paying members in existing houses since Q1 2021. The in-house revenue increase of 440% versus Q1 2021 to $87.8 million was aided by our new house openings in Nashville and Brighton, the fact that we experienced fewer COIVD closures and restrictions overall versus Q1 2021, leading to increased footfall through the houses. Firstly, increased membership revenues were volume driven, with significant increase in full paying Soho House members year-on-year as well as membership fees from new houses. And together with our high level of member retention, record waitlist numbers and growth from new houses, membership continues to be a very valuable recurring revenue stream. So, if you think about North America, our largest region, which is seeing a huge amount of growth, we're going to add a lot more of the experiential houses into North America, which will again increase the value of our membership, because most of the folks -- our members in North America are every house. Then your 2018 houses up until 2021, they're the houses that we've opened recently, and we -- that's where we can ramp up the membership a lot more this year."
}