{
    "symbol": "SJW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 17:39:17",
    "content": " Some of our achievements include reaching a settlement agreement in San Jose Water's 2022 general rate case with the Public Advocates Office and receiving approval from the Maine Public Utilities Commission on the settlement agreement between Maine Water Company and the Public Advocates Office for the Biddeford-Sacos division new $60 million drinking water treatment facility. Building on our successful program at San Jose Water, our diverse spend across all four states continues to increase with more than $55 million placed with diverse suppliers in 2021, which is 21% of our addressable spend, great progress and our strong commitment to continue this important work. First quarter revenue was $124.3 million, an 8% increase over the first quarter of 2021. Net income for the quarter was $3.7 million or $0.12 diluted earnings per share, which is a 43% increase over the first quarter prior year net income of $2.6 million or $0.09 diluted earnings per share. The net change in diluted earnings per share for the quarter was primarily attributable to cumulative rate increases of $0.06 per share, new customers of $0.03 per share and increased customer usage of $0.02 per share. Our first quarter revenue increase was primarily the result of $5.2 million in cumulative rate increases, $2.5 million from new customers and $1.8 million increase in customer usage. The increase was primarily due to $4.5 million in higher average per unit cost for purchased water, groundwater extraction and energy charges, partially offset by a $1.8 million increase in surface water supply production. Other operating expenses increased $3.3 million or 3% for the quarter, primarily due to $4.2 million in higher depreciation related to utility plant additions and our California concession assets. Higher administrative and general expenses of $3.3 million, primarily due to increases in labor and pension expenses and increases in maintenance and taxes other than income taxes totaling $1.2 million. These increases were partially offset by the recognition of a $5.5 million gain on the sale of non-utility property, no similar gain occurred in the first quarter of 2021. Payments of amounts previously invoiced and accrued increased $5.2 million and other changes increased a net of $2.8 million, primarily due to funds received from the State of California Water and Wastewater Arrearages Payment Program. In Connecticut we filed an application with the Connecticut Public Utilities Regulatory Authority on April 26, 2022 requesting recovery of approximately $10 million in completed projects through the Water Infrastructure and Conservation Adjustment Mechanism. In Maine on April 5, 2022 the Maine Public Utilities Commission approved a stipulated agreement between the company and the office of Public Advocate that recognize all project costs set a 9.7% return on equity across all of Maine Waters division and a $6.3 million increase in annual revenues in the Biddeford-Saco division July 1, 2022."
}