{
    "symbol": "SJW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 17:22:05",
    "content": " Yesterday at the close of business, we released our second quarter 2022 operating results reporting net income for the quarter of $11.6 million, or $0.38 per diluted share on revenues of $149 million. Our quarterly operating results reflect the impact of a change at our Connecticut water utility, Connecticut Water Company or CWC and its approved water revenue adjustment mechanism or WRAM (ph) to update the timing of consumption resulting in a shift of $3.8 million from the second quarter of 2022 to the second half of the year. The change in diluted earnings per share for the quarter was primarily driven by cumulative rate increases of $0.27 per share, a $0.25 per share production cost savings due to lower customer usage and $0.07 per share from an increase in California surface water production. These increases were offset by production cost increases of $0.24 per share, a decrease of $0.24 per share due to lower water consumption, a $0.16 per share decrease as a result of changes in the WRA in Connecticut and $0.09 per share related to the TWA holdback release that was recognized in the second quarter of 2021. The $3.2 million decrease was primarily attributable to $7.5 million in cumulative water rate increases and $400,000 due to new customers, offset by a $6.6 million decrease in customer usage and a decrease of $4.6 million related to Connecticut's WRA mechanism. Other operating expenses increased $4.4 million during the quarter, primarily due to an increase in depreciation expense of $1.7 million and a $1.9 million increase in general and administrative expenses, primarily due to increases in labor and group insurance costs. In addition, had a decision in our California rate case been approved by the CPUC consistent with terms of our settlement agreement with the California Public Advocates Office, year-to-date revenues would have increased between $12 million and $13 million. The change in diluted earnings per share for the first half of 2022 was primarily due to cumulative rate increases of $0.50 per share, a $0.28 per share in production cost savings attributable to lower usage and a non-recurring gain on the sale of non-utility property of $0.21 per share. Our 2022 first half revenue increase was primarily due to $12.7 million in cumulative rate increases, $2.9 million dollars in revenue from new customers and $754,000 in balancing the memorandum accounts changes. Other operating expenses increased $7.6 million in the first half of 2022, primarily due to a $5.9 million increase in depreciation expense, $5.2 million in higher general and administrative expenses, including $1.6 million related to cost recovery, balancing and memorandum accounts and taxes other than income taxes, which increased by $1.2 million. SJWC received authorization effective July 1, 2022 to increase revenue requirement by approximately $25 million or roughly 6%, the majority of which related to an annual increase in purchased portable water charges. On April 6, 2022, Maine water entered into a credit agreement with a commercial bank pursuant to an existing master loan agreement under which the commercial bank issued Maine water, a promissory note on the same date to an aggregate principal amount of $15 million, at a fixed rate of 4.54% due May 31, 2042. Proceeds from the borrowings were received on May 13, 2022 and on June 28, 2022, Connecticut Water entered into a no purchase agreement pursuant to which Connecticut Water sold an aggregate principal amount of $25 million, a 4.71 senior notes due December 15, 2052."
}