{
    "symbol": "GILT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 12:59:05",
    "content": " Third quarter revenues were $60.4 million, 21% above the third quarter of last year. Adjusted EBITDA improved to $7.3 million, 88% above our adjusted EBITDA of $3.9 million in the third quarter last year. Our revenue expectation are adjusted to between $240 million to $245 million, representing year-over-year growth of 13% at midpoint. GAAP operating income expectations are narrowed and adjusted upward to between $8 million to $10 million and adjusted EBITDA expectations are narrowed and adjusted upward to between $23 million to $25 million, representing year-over-year growth of 56% at midpoint. We have narrowed the revenue guidance and adjusted it slightly downward, now expecting revenues to be between $240 million to $245 million, which is 13% year-over-year growth at midpoint. In terms of financial results, revenue for the third quarter was $16.4 million 21% higher of those of the third quarter of last year, which were $49.8 million. In terms of revenue breakdown by segment, Q3 2022 revenues of the Satellite Network segment, which provides advanced broadband satellite communication networks and associated professional services, turnkey solutions and managed services in the cellular backhaul enterprise, IFC and defense market were $32.4 million, compared to $23.2 million in the same quarter last year. Q3 2022 revenues of the Integrated Solutions segment, which provides equipment, products systems and solutions for mission-critical difference broadcast advanced on the move and on the pole satellite communication solutions including for airborne and ground mobile were $15.7 million, compared to $14.7 million in the same quarter last year. Q3 2022 revenues of the networkâ\u0080\u0099s Infrastructure and Services segment, which provides mainly terrestrial and satellite network construction and operation services were $12.3 million, compared to $11.9 million in the same quarter last year. GAAP operating income for the quarter improved to $3.4 million, compared with $0.8 million in the same quarter last year. Non-GAAP operating expenses in Q3 2022 were $18.7 million, compared with $16.2 million in the same quarter last year. Non-GAAP operating income for the quarter improved to $4.4 million, compared to an operating income of $1.3 million in the same quarter last year. This is compared with a net income of $0.6 million, or income of $0.01 per share in the same quarter last year. Looking ahead, as Adi already mentioned, we adjusted and narrowed the range of our 2022 revenue guidance with expectations of between $240 million and $245 million, representing year-over-year growth of approximately 13% at the midpoint. We also increased and narrowed the adjusted EBITDA range to between $23 million to $25 million, representing year-over-year growth of approximately 56% at the midpoint."
}