{
    "symbol": "HUYA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 10:55:20",
    "content": "  Operator: Hello, ladies and gentlemen, thank you for standing by for the First Quarter 2022 Earnings Conference Call for Huya, Inc. At this time, all participants are in a listen-only mode. Hello, everyone, and welcome to Huya's first quarter 2022 earnings conference call. Please also note that Huya's earnings press release and this conference call include discussions of unaudited GAAP financial information, as well as unaudited non-GAAP financial measures. Despite macro challenges that continued to impose near-term pressure on health  and the entire industry, we delivered a healthy user growth and standard financial performance in the first quarter of 2022. Total net revenues were RMB2.46 billion and non-GAAP net income reached approximately RMB47 million for the first quarter, in line with our expectations against the backdrop of the evolving market environment. Our user base sustained its expansion trend with Huya Live, mobile, and mails increasing by 8.5% year-over-year to $81.9 million in the first quarter. Meanwhile, our user engagement level also improved as we remained diligent in our efforts to provide quality, content and optimize user experience through product innovations, specifically in the first quarter, users' time spent on our platform recorded double-digit growth on both our year-over-year and quarter-over-quarter basis. By participating in this task type activity, users can claim virtual rewards from both game studios and our platform, once they complete specific combinations of tasks, such as viewing game streaming for a certain period of time and sending certain voice chats. We introduced the feature during our live broadcaster, our Peacekeeper Elite late last year and have now added it to over 10 game titles such as Honor of Kings, LoL Wild Rift, Call of Duty Mobile and Genshin Impact as we continue to deepen our relationships with a variety of game studios. Excitingly, more than 10 million users on our platform engaged with this interactive feature during the first quarter. In addition to improving user interacting metrics on our platform, more than operating team have noted that the feature encourages turn players to return to games, bolstering user activating rates. During the 12 month period our sales produced HUYA CFM championship long-term kappa HUYA CFM  by connecting their CFM game ID with HUYA account, users secured a free membership, which allowed them to complete game play and tournament-related tasks to unlock away our privileges on both the game operators and Huya’s platforms. In addition, all long-term cup measures  were live broadcasted on Huya’s platform and were also made available on the CFM  in game tournament streaming channel, increasing this self-produced events popularity and reflecting our continuous efforts to connect Huya’s live streaming content with the Tencent ecosystem. For example, at our January annual gala event, Huya Boom Night we debated as extraordinary music movement  an online real-time interactive musical game play feature designed to make the events’ broadcast distinctive and captivating. Merging live musical performances and interactive activities, this new feature created a truly immersive viewing experience, bringing the unique feeling of live performance to users fingertips and broadening the boundary between reality and virtuality. Given the rapidly changing business environment, both domestically and internationally, we have strategically implemented some adjustments and refinements with respect to Nimo TV's operations, concentrating our resources on future key geographic regions. As our high-quality content portfolio and the technology and the product advancements solid define, our leadership in the game live streaming market, we will remain committed to serving our growing user base and creating more value for our broadcasters, business partners and all other stakeholders. We were glad to see that during the first quarter, total viewership of licensed E-sports tournaments reached more than RMB700 million, exceeding the previous quarters viewership, despite the fact that, due to seasonality, the first quarter of the year is typically not a strong period for E-sport events. In addition to licensed E-sports content, we broadcasted 26 self-organized E-sport tournaments and entertainment PTC shows during the first quarter, generating approximately 86 million total viewership. During the Chinese New Year holidays, we have Huya Live league event, which feature popular streamers from different categories as participants in several online games, offering our users in closing content and entertaining festival experience. The Huya, CFM Championship Long Term Cup, which Mr. Dong mentioned earlier, and The Huya Super League, a tournament for PC and Solo games were also well like Huya branded E-sports events in the first quarter. We've been a specific game or tournament forum users can upload videos of game plan, or tournament highlights to share, watch and discuss with their peers, helping to create a dynamic content ecosystem on our platform. Live streaming revenues were RMB 2.15 billion for Q1, compared with nearly RMB 2.5 billion for the same period last year. The decline was mainly due to lower average spending per paying user on Huya Live, as the macro softness continue to adversely affect paying users sentiment. The number of paying users for Huya Live was 5.9 million, relatively flat compared to the same period last year and representing a net addition of 0.3 million compared to Q4 last year. Advertising and other revenues increased by 47.2% year-over-year to RMB 313 million for Q1, primarily driven by the increase in content licensing revenues. Cost of revenues increased by 1.9% to RMB 2.1 billion for Q1, primarily due to the increase in revenue sharing fees and content costs. Revenue sharing fees and content costs increased by 3.4% to RMB 1.8 billion for Q1, primarily due to the increase in spending on e-sports content and the increase in revenue sharing fees in relation to certain broadcaster incentive programs. Bandwidth costs decreased by 7.3% to RMB 168 million for Q1, primarily due to improved bandwidth cost management and continued technology enhancement efforts. Gross profit was RMB 334 million for Q1 compared with RMB 514 million for the same period of 2021, primarily due to lower revenues and increased cost of revenues, primarily driven by higher revenue sharing fees and content costs. Excluding share-based compensation expenses, non-GAAP gross profit was RMB 347 million, and non-GAAP gross margin was 14.1% for Q1. Research and development expenses decreased by 1.4% to RMB 196 million for Q1, primarily due to the decrease in share-based compensation expenses. General and administrative expenses decreased by 3.9% to RMB81 million for Q1, primarily due to the decrease in share-based compensation expenses. Other income was RMB28 million for Q1 compared with RMB76 million for the same period of 2021, primarily attributable to realized damages received in the first quarter of 2021 from a favorable outcome in a broadcaster-related lawsuit. As a result, operating loss was RMB60 million for Q1 compared with operating income of RMB162 million for the same period of 2021. Interest and short-term investment income were RMB59 million for Q1 compared with RMB65 million for the same period of 2021, primarily due to decreased interest rates. Income tax expenses were RMB9 million for Q1 compared with RMB39 million for the same period of 2021, primarily due to lower taxable income. Non-GAAP net income attributable to HUYA Inc., which excludes share-based compensation expenses and gain on fair value change of investments, net of income taxes was RMB47 million for Q1 compared with RMB266 million for the same period of 2021. As of March 31, 2022, we had cash and cash equivalents, short-term deposits and short-term investments of RMB 10.47 billion, compared with RMB 10.96 billion as of December 31, 2021, primarily due to the increase in investments and prepayments to content providers. Please ask your question. Given the rapidly changing business environment, domestically and internationally, we have strategically implemented some adjustments and refinements with respect to Nimo TV's operations, concentrating our resources on future key geographic regions, while these adjustments could result in short-term contractions in overseas user expansion and revenue growth as we downsize our overseas presence in certain areas and might have some non-recurring expenses, but we expect to improve the overall efficiency of our international business by directing resources to regional markets with greater potential for profitable business growth at a lower cost. Please ask your question. Thank you for your question. As a downstream player of the game industry, Huya we believe that this will be helping us to enrich our content for live streaming. Also at the same time, Huya has the best operating capacity in terms of new games. In the short-term, I think people will be looking more at the business side, whether or not the new games are being released are suitable for live streaming and whether or not the new games are well received in the users. And we are also keeping an eye on the pulse of the market and given the fact that the resumption of licensing games only began in April, the impact of such on our business, especially advertisement business, is pretty much limited for now. As for the impact of COVID in terms of the traffic because some cities that implemented these lockdown measures or stay-at-home measures, well, there are some positive impact for our traffic as well as game live streaming, but because this policies are somehow normalizing. Please ask your question. Please ask your question. Thank you for your question. For instance, in the first quarter, in our self-produced CFM long-term cup, we have worked together with CFM Games for a joint membership. On one hand, it increases the exposures of Huya platform in the users and also at the same time, they would be become active -- more active in both the game and live stream platform. At the same time, Huya had some very special interactive features, for instance, gift dropping or live streaming e-commerce that have been applied to video -- that have applied to games in Tencent. For instance, for the gift dropping, it has been applied to more than 20 games in Q1 with over 10 million active users. Our content metrics are able to cater for the needs for the users, both before and after the game play, and that is positive for the promotion of games as well as retention of players and users. We will continue to do it by giving more interactions on the live streaming and having some more active community features so as to retain our users and to have better connections of our users, live streamers as well as game studios and players, so as to play a bigger role in the entire industry of game. Please ask your question. Thank you for your question. Overall speaking, it is necessary to continue to invest in high-quality content and product, because that is positive to make sure that we will continue to serve our users well and to consolidate our leading position in a competition. In terms of the margin for the short-term, because of business adjustment for the quarter, there might be some non-recurring expenses and costs for the quarter, and that would sent some turbulences to our margin level."
}