{
    "symbol": "AP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-21 13:25:03",
    "content": " As shared in todayâ\u0080\u0099s press release, Ampco-Pittsburgh recorded an operating income of $0.9 million in the fourth quarter of 2022, and a full year 2022 operating income of $2.8 million with a full year EPS of $0.18 per share. In 2022, every quarter resulted in a new record backlog as our backlog ended the year $48 million higher than 2021. The fourth quarter was also affected by an equipment outage in our forged large rolled work sale, approximately $3 million of sales into 2023 and causing unfavorable cost absorption in Q4. As shared in the press release, Ampco-Pittsburgh recorded net income for the twelve months ended December 31, 2022 of $3.4 million dollars or $0.18 per diluted share. A change from the LIFO method to the FIFO method is considered a change in accounting principle, requiring all periods to be restated as if Corporation had used the FIFO method to value its domestic inventories for those periods and with a cumulative adjustment recorded to retain deficit, net of tax of the earliest year presented, in this case, January 1st 2021 as it relates to our forthcoming Form 10-K. In terms of other significant items affecting comparability, the Corporation recorded a $2.2 million benefit in the fourth quarter 2022, related to a reduction in the estimated long-term defense cost portion of our Asbestos liability. In contrast, the Corporation recorded a $6.7 million charge in the fourth quarter of 2021 in connection with last year's revaluation of the total Asbestos liabilities and related insurance receivables. Ampcoâ\u0080\u0099s net sales for the fourth quarter of 2022 were $93.5 million, an increase of approximately 11%, compared to net sales for the fourth quarter of 2021. Net sales for the Forged and Cast Engineered Product segment in the fourth quarter of 2022 were approximately 8% higher than the prior year period, primarily due to higher pricing and variable index surcharges, as a result of higher raw material, energy and transportation costs, offset in part by an unfavorable currency translation effect. The Forged and Cast Engineered Product segmentâ\u0080\u0099s operating results declined for the fourth quarter of 2022, compared to prior year, primarily reflecting higher cost of production, not being fully offset by the effects of price increases. At the bottom-line, the Corporation reported a net loss attributable to Ampco-Pittsburgh of $0.5 million or $0.02 per diluted share for the fourth quarter of 2022, compared to a net loss of $7.4 million or $0.39 per diluted share for the fourth quarter of 2021. Backlog at December 31st, 2022 of $369 million increased approximately 11% sequentially and rose 26% from a year ago. As Sam and Dave indicated, backlog for the Forged and Cast Engineered Product segment increased approximately 11% sequentially and approximately 13% year-over-year, while backlog for the Air & Liquid Processing segment continues to be at record highs and has increased 69% versus prior year. Capital expenditures for the fourth quarter of 2022 were $3.7 million and were $16.7 million for the year, primarily for the Forged and Cast Engineered Product segment."
}