{
    "symbol": "DOX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-09 03:27:03",
    "content": "  For more information regarding our use of non-GAAP financial measures including reconciliations of these measures, we refer you to today's earnings release, which will also be furnished with the SEC on Form 6-K. On today's agenda, Shuky will recap our business and financial achievements for the fourth quarter and full year fiscal 2022 and we'll update you on the continued progress we have made executing against our strategic growth framework. Reflecting heavily sales momentum, we finished fiscal 2022 with the record high 12 months backlog of $3.97 billion, up approximately 8% from a year ago, and we achieved record non-GAAP diluted earning per share of $5.30, up 12.1% on a pro forma basis as we delivered on our targets for accelerated impossible top line goals. To further add, our earning to cash conversion exceeded 1% in fiscal 2022, resulting a better than expected normalized free cash flow of $665 million of which we return more than 100% to shareholders via share purchases and dividends. We expect to deliver full year revenue growth of between 6% to 10% on a constant currency basis in fiscal 2023, consistent with the long-term guidance range we provided previously. We expect earnings to cash conversion to remain at around 100% in fiscal 2023, supporting another year of strong free cash flow generation, the majority of which we plan to return shareholders. To summarize, we expect to deliver double-digit expected total shareholder returns for the third straight year in fiscal 2023, assuming our non-GAAP diluted earnings per share growth guidance, plus our dividend yield of about 2%. On the bottom line, we achieved double-digit non-GAAP diluted earnings per share growth of 12.1% on a pro forma basis in fiscal year 2022, driven by the strong top line performance, a slightly better non-GAAP operating margin, and the benefits of our share repurchase activity. Overall, we returned a total of $694 million to shareholders through share repurchases and dividends in fiscal 2022, equating to roughly 104% of normalized free cash flow. Overall, I believe fiscal 2022 was a remarkable year for Amdocs, which included record high revenue, slightly better profitability, strong free cash flow generation and double-digit growth in non-GAAP diluted earnings per share. With that said, we are positioned to deliver revenue growth in line with the midpoint of our long-term guidance range of 6% to 10% year-over-year on a constant currency basis in fiscal 2023. Additionally, we expect to deliver revenue growth across all three operating regions of North America, Europe, and rest of world on a constant currency basis for the full year fiscal 2023. Moving down the income statement, we anticipate quarterly non-GAAP operating margins around the midpoint of a new and improved annual target range of 17.5% to 18.1%, reflecting the benefits of our ongoing initiatives to improve operational excellence through automation, other sophisticated tools, and disciplined resources management, as well as expected cost savings resulting from our move to the new campus in Israel. Bringing everything together, we expect non-GAAP diluted earnings per share growth in the range of 8% to 12% for the full year fiscal 2023. Overall, we expect to deliver double-digit total shareholders returns for the third year running in fiscal 2023, including our outlook for non-GAAP earnings per share growth, plus our dividend yield of about 2% based on the newly proposed quarterly cash payment to be approved by shareholders at Januaryâ\u0080\u0099s annual meeting."
}