{
    "symbol": "DOX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-11 23:11:03",
    "content": "  For more information regarding our use of non-GAAP financial measures, including reconciliations of these measures, we refer you to today's earnings release, which will also be furnished with the SEC on Form 6-K. On today's agenda, Shuky will recap our business and financial achievements for the second quarter of fiscal 2022, and we'll update you on the continued progress we have made executing against our strategic growth framework. Regarding fiscal year 2022 specifically, we are now tracking at the high end of our revenue growth guidance range of 8% to 10% on a pro forma constant currency basis. Similarly, we are also tracking at the high end of our diluted non-GAAP earnings per share growth guidance range of 9% to 12% on a pro forma basis in fiscal year 2022, which fairly position us to deliver double-digit, expected total shareholder return for the second year running, including our dividend yield of roughly 2%. Our multiyear managed services engagements underpin the resiliency of our business with recurring revenue streams, close to 100% renewal rates, and expanded activities, which may also include large-scale digital transformation project with existing customers. With that said, we are tracking in line with the high end of our full year fiscal 2022 revenue growth guidance of 8% to 10% on a pro forma constant currency basis, which includes positive contributions from each of our three operating regions of North America, Europe and Rest of the world. Our annual outlook includes third fiscal quarter revenue within a range of $1.14 billion to $1.18 billion, the midpoint of which represents the most likely outcome based on our internal analysis, equating to healthy growth of roughly 9% as reported from a year ago. Bringing everything together, we expect to deliver pro forma non-GAAP diluted earnings per share growth in line with the high end of our guidance range of 9% to 12% for the full fiscal year 2022. On a reported basis, we also expect non-GAAP diluted earnings per share growth in line with the high end of our guidance range of 7.3% to 10.3% year-over-year. And definitely, the fact we are tracking already for several quarters at the neighborhood of the 10% year-over-year growth of the backlog is showing the great conversion and momentum we are seeing in signing new business in continuing to see this 100% renewal rate in managed services, everything that we talked about, which gives us strong confidence."
}