{
    "symbol": "DOX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-01 23:36:05",
    "content": " We delivered record revenue of $1.1 billion, up 10.6% on a pro forma constant currency basis, and led by our best-ever quarter in North America, where we continue to see high activities level across our top customers. Last quarter, we guided to fiscal year 2022 revenue growth in the range of 6% to 10% on a pro forma constant currency basis. Turning attention to the current fiscal year 2022, we believe revenue growth is tracking at the higher end of our 6% to 10% guidance range on a pro forma constant currency basis, given our encouraging start of the year to the year. On the bottom line, we are also on track to achieve pro forma diluted non-GAAP earnings per share growth at the higher end of our expected range in fiscal year 2022 outlook, putting us in a strong position to deliver double-digit expected total shareholder returns for the second year running, including our dividend yield. Record Q1 revenue of $1.1 billion was up 10.6% year-over-year on a pro forma constant currency basis, driven by our best-ever quarter in North America with a great momentum in our top customers. Diluted GAAP EPS was $1.07 for the first fiscal quarter, above the guidance range of $0.91 to $0.99, primarily due to a net gain of $0.06 per share from contingent performance-based consideration in the final amount of $10 million received in relation to last year's divestiture of open markets. With that said, we believe full year fiscal 2022 revenue growth is tracking at the higher end of our guidance range of 6% to 10% on a pro forma constant currency basis. Our annual outlook includes second fiscal quarter revenue within a range of $1.11 billion to $1.15 billion, the midpoint of which equates to a healthy growth of roughly 7.7% from a year ago. Likewise, we believe non-GAAP diluted earnings per share growth is also tracking at the higher end of our guidance range of 6.3% to 10.3% year-over-year on a reported basis."
}