{
    "symbol": "CHE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:45:06",
    "content": " VITAS's net revenue was $299 million in our first quarter of 2022, which is a decline of 5.3% when compared to the prior year period. The revenue decline is comprised primarily of a 4.1% decrease in our days of care, partially offset by a geographically weighted average Medicare reimbursement rate increase of approximately 1.3% Acuity mix shift had a net impact of reducing our revenue, approximately $7.1 million or 2.2% in the quarter, when compared to the prior year revenue and level of care mix. Roto-Rooter generated revenue of $231 million in the first quarter of 2022, which is an increase of $19.8 million or 9.4% when compared to the prior year quarter. Roto-Rooter branch commercial revenue in the quarter totaled $54.4 million, which is an increase of $6.9 million or 14.4% over the prior-year quarter. This aggregate commercial revenue growth consisted of drain cleaning revenue increasing 17%, plumbing increasing 17.1%, water restoration expanding 8.6%, and excavation increasing 7.1% Roto-Rooter branch revenue in the quarter totaled $157 million, which is an increase of $10.5 million or 7.2% over the prior year period. In the first quarter on a year-over-year basis, our hospital directed admissions declined 15.7%, total home-based admissions expanded 2.8%, nursing home admits increased 7.8%, and assisted living facility admissions declined 7.4%. We try to avoid parsing things in terms of internal guidance on quarters, but VITAS basically came in our revenues stronger by slightly by 100ish basis point on margin that we're pleased with Roto-Rooter beat a little bit on revenue and definitely be beat on margin not to the magnitude of VITAS, but a pretty solid quarter as well. And so from an ADC perspective, the Omicron variant in the first -- in January does have an impact to total days of care inside of the quarter, but we continue to see it as a good hopefully launching point for the remainder of the calendar year, as many of the disruption pieces inside of the pandemic are behind us and we're dealing with more of a regular referral flow and a continual shift of focus, as we look to ensure we are deploying our admissions resources to respond to the most appropriate referrals out there and go from there to bring on all appropriate and eligible patients that we respond to."
}