{
    "symbol": "CHE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 14:03:09",
    "content": " VITAS's net revenue was $298 million in the second quarter of 2022, which is a decline of 4.5%, when we compare it to the prior year period. Acuity mix shift had a net impact of reducing revenue approximately $5.2 million or 1.6% in the quarter, when compared to the prior-year revenue and level of care mix. Roto-Rooter generated quarterly revenue of $233 million in the second quarter of 2022, which is an increase of $13.2 million or 6%, when compared to the prior year quarter. Roto-Rooter branch commercial revenue in the quarter totaled $54.8 million, which is an increase of $3.8 million or 7.5% over the prior year. Roto-Rooter branch residential revenue in the quarter totaled to $159 million, which is an increase of $7.6 million or 5% over the prior year period. Based upon these metrics for the operating segments, Chemed's full-year 2022 earnings per diluted share excluding non-cash expense for stock options, tax benefits from stock option exercises, costs related to litigation, as well as the VITAS employee hiring and retention program Kevin noted earlier and other discrete items is estimated to be in the range of $19.30 to $19.50. We will be more comfortable if we were able to hold on and hire more workers and to build it and they will come to the area -- we certainly have examples of that where we cannot -- let's say, we don't -- our admissions are down 12% largely driven by hospital based admissions and we have a scarce resource labor and as we expand that -- the number of licensed health care professionals, we have those that admissions will first flatten out and then we think show growth. If you think about it, it's been our ongoing mission for over a decade we've just been very laser focused on over the last two years to help educate the community for earlier appropriate identification of hospice patients and what we're really talking about here is, we're identifying the partners being an independent hospice provider and all the communities we operate that are continuing to do a good job to do that and are looking for ways to refer patients earlier in their disease trajectory to us so that we can care for them and their families for a much longer time period."
}