{
    "symbol": "KFY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-07 15:25:28",
    "content": " In the first quarter fee revenue grows to $696 million, which was up $110 million or 19% year-over-year. Every line of business grew year-over-year in the first quarter led by Professional Search & Interim, which was up a 101%; RPO, which was up 37% and consulting, which was up 18%. In the first quarter, we repurchased about 370,000 shares of our stock using about $22 million, paid a cash dividend of approximately $7 million and we funded about $17 million of capital expenditures, most of which was directed towards development initiatives for our digital business. Global fee revenue for KF Digital was $83.8 million, which was up approximately 4% year-over-year and 10% at constant currency. The subscription and license component of digital's fee revenue continued to grow, reaching $30 million, which is up approximately 21% year-over-year and was approximately 35% of revenue for the quarter. In the first quarter, digital generated adjusted EBITDA of $24.2 million, with a 29% adjusted EBITDA margin. Fee revenue grew to $166.5 million, which was up approximately 12% year-over-year and 18% at constant currency. In the first quarter, adjusted EBITDA for Consulting grew $2.7 million or 10% to $29.6 million, with an adjusted EBITDA margin of 17.7%. Fee revenue for permanent placement was $74 million, which was up approximately $22 million or 42% year-over-year. Our interim fee revenue grew to $25 million, with quarter sequential growth driven in part by our recent acquisition of Patina, which provides senior level executive and professional talent on a project basis. Fee revenue was also strong, growing to $114 million, which was up $27 million or 30% year-over-year and approximately 37% at constant currency. Earnings per RPO continued to scale with revenue, with adjusted EBITDA at $17.7 million, which was up $3.2 million or 22% year-over-year with an adjusted EBITDA margin of 15.5%. Finally, in the first quarter, global fee revenue for Executive Search grew to $233 million, which was up 7% year-over-year and 11% at constant currency. Global new business for Executive Search was also strong in the first quarter, up approximately 9% year-over-year and 12% at constant currency. Annualized fee revenue production per consultant in the first quarter remained strong at $1.54 million, and the number of new search assignments opened worldwide in the first quarter was down 4% year-over-year to 1,682. In the first quarter, Global Executive Search adjusted EBITDA grew to approximately $62.2 million, which was up 1% year-over-year, with an adjusted EBITDA margin of 26.7%. Now on a monthly basis at constant currency, our consolidated new business without RPO and measured year-over-year grew 19% in May, 26% in June and then decelerated to approximately 7% in July at the beginning of the summer vacation season. So for our fiscal year 2023 second quarter, we expect fee revenue to range from $678 million to $708 million and our consolidated adjusted diluted earnings per share to range from $1.34 to $1.50 and our GAAP diluted earnings per share to range from $1.28 to $1.45. In calendar year 2021, ICS generated approximately $88 million of fee revenue, with about 90% being generated from IT interim services. And then follow-up question on quarterly new business growth, it was 26% year-over-year in fiscal 4Q, 17% in fiscal 1Q on a constant currency basis. And so, you look at July and August and new business in both those months was up 7%, 8% constant currency, kind of 3% actual and thatâ\u0080\u0099s probably â\u0080\u0093 thatâ\u0080\u0099s more in line with our 10 and 20 year CAGRs."
}