{
    "symbol": "KFY",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-08 15:56:03",
    "content": " As an example, our recent acquisitions in the Interim space which we believe provides real outsized opportunities for growth, they have created almost 700 additional engagement wins resulting in an incremental $43 million in fee revenue since the third quarter of fiscal year '22 when we acquired the Lucas Group. In the third quarter, consolidated new business, excluding RPO was up 5% year-over-year at constant currency and up approximately 1% at actual rates, with growth in all lines of business except Executive Search. For all of fiscal '23, through the end of the third quarter, we repurchased approximately $80 million of our stock, paid cash dividends of approximately $25 million, deployed $99 million for business acquisitions and funded about $48 million of capital expenditures, most of which was directed towards product development initiatives for our digital business. Starting with KF Digital, global fee revenue in the third quarter was $85 million which was down 6% year-over-year and approximately flat at constant currency. For Consulting, fee revenue in the third quarter grew to $162 million which was flat year-over-year and up approximately 4% at constant currency. Additionally, global new business for Consulting in the third quarter was up 9% year-over-year at constant currency. The Professional Search & Interim business -- new business increased 30% in the third quarter versus last year, driven by double-digit strength in North America, aided by the current year acquisitions. Permanent placement fee revenue declined by $10 million to $65 million year-over-year, down 13% at actual and down 11% at constant currency. The volume from these new wins offset some of the volume moderation seen over the last few quarters, positioning the RPO business for strong growth in the moderation in the base Finally, global fee revenue for Executive Search in the third quarter was $212 million and as expected, experienced a year-over-year decline of 9% at constant currency compared to the high growth rate enjoyed during the pandemic recovery last year. Now assuming no new major pandemic-related lockdowns or further changes in worldwide geopolitical conditions, economic conditions, financial markets and foreign exchange rates, we expect fee revenue in the fourth quarter of fiscal '23 to range from $690 million to $710 million."
}