{
    "symbol": "KFY",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-08 15:27:01",
    "content": " And the integrated go-to-market strategy, One Korn Ferry that's resulted in almost 30% of our revenue coming from cross line of business referrals, a new Korn Ferry that trains and develops over 1 million professionals a year on compensation and rewards advisory and digital offering would comp out on more than 25 million executives, a new interim transition management staff capability with about $225 million of annual revenue on a run rate basis. In the second quarter, Digital generated adjusted EBITDA of $27.5 million with a 29.2% adjusted EBITDA margin. For Consulting, fee revenue in the second quarter grew to $173 million which was up 5% year-over-year and up approximately 12% at constant currency. In the second quarter, adjusted EBITDA for Consulting grew 3% year-over-year to approximately $31 million with an adjusted EBITDA margin of 18%. Our Interim Service fee revenue in the second quarter grew to $55 million, driven in part by the recent acquisitions of ICS -- acquisition of ICS which primarily provides on-demand, high skilled IT professionals on a flexible or project basis. In the second quarter, adjusted EBITDA for Professional Search & Interim was up $10.7 million or 49% year-over-year to $32.5 million with a 24.1% adjusted EBITDA margin. As previously mentioned, RPO was awarded a record $290 million of new business in the second quarter, including 2 large 3-year contracts totaling almost $200 million. Finally, global fee revenue for Executive Search in the second quarter was $218 million which was down 7% year-over-year and down 4% at constant currency. Annualized fee revenue production per consultant in the second quarter was $1.41 million and the number of new search assignments opened worldwide in the second quarter was down 11% year-over-year to 1,637. In the second quarter, Global Executive Search adjusted EBITDA was $54.5 million with an adjusted EBITDA margin of 25%. Now in summary, assuming no new major pandemic-related lockdowns, further changes in worldwide geopolitical conditions, economic conditions, financial markets and foreign exchange rates, we expect fee revenue in the third quarter of fiscal '23 to range from $660 million to $690 million. And the three is the IP and the ability to integrate that solution with other things that, that particular client wants to achieve, whether that's org strategy, whether if it's compensation advice and so this integrated platform is also a major reason why we continue to enjoy success in that part of the business\n I think you described the -- correct me if I'm wrong, the cost cut is sort of substantially smaller than a classic one you might have taken  in the prior downturns."
}