{
    "symbol": "AMAL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 06:55:09",
    "content": " Additionally, PACE assessments increased $115 million, to $857 million, as compared to the linked quarter which when combined with our loan growth represents very strong asset growth in the quarter. Third, our average deposits increased by $191 million to $7.3 billion, reflecting a strong quarter for deposit attraction in an increasingly competitive deposit environment. Net income for the third quarter of 2022 was a record $22.9 million, or $0.74 per diluted share, compared to $19.6 million, or $0.63 per diluted share, for the second quarter of 2022. The $3.3 million increase during the quarter was primarily driven by an $11.1 million increase in net interest income, partially offset by a $2.5 million increase in provision for loan losses, a $2.2 million decrease in noninterest income, a $1.9 million increase in noninterest expense and a $1.2 million increase in income tax expense related to our increased pretax income. Beginning on Slide 5, exclusions related to solar tax equity investments were a $1.3 million loss on accelerated depreciation for the third quarter of 2022. Core net income, excluding the impact of solar tax equity investments, a non-GAAP measure, for the third quarter of 2022 was $24.8 million, or $0.80 per diluted share, compared to $20.9 million, or $0.67 per diluted share, for the second quarter of 2022. Turning to Slide 7, deposits at September 30, 2022, were $7.2 billion, a decrease of $130.9 million from the second quarter of 2022. Noninterest-bearing deposits represent 56% of average deposits and 54% of ending deposits for the quarter ended September 30, 2022, contributing to an average cost of deposits of 14 basis points in the third quarter of 2022, a 6-basis point increase from the previous quarter due to our decision to reprice in response to the rising interest rate environment. Deposits held by politically active customers were $1.2 billion as of September 30, 2022, a decrease of $123.7 million on a linked-quarter basis. Turning to Slide 11, total loans receivable net of allowance and deferred fees and costs at September 30, 2022, were $3.8 billion, an increase of $220.2 million, or 6.1%, compared to June 30, 2022. Core noninterest income, excluding the impact of solar tax equity investments, a non-GAAP measure, was $7.5 million for the third quarter of 2022, compared to $8.7 million in the second quarter of 2022. Core noninterest expense, another non-GAAP measure, for the third quarter of 2022 was $36.3 million, an increase of $2.3 million from the second quarter of 2022. Moving to Slide 16, nonperforming assets totaled $54.3 million, or 0.69% of period-end total assets, at September 30, 2022, a decrease of $11 million compared with $65.3 million, or 0.82%, on a linked-quarter basis. As we continue to prioritize and implement actions to improve the overall credit quality of our loans portfolio, we also improved our criticized assets which declined $22.8 million, or 16.8%, to $113 million on a linked-quarter basis. Provision for loan losses totaled $5.4 million for the third quarter of 2022, compared to $2.9 million in the second quarter of 2022. As a result, we saw a modest decline in tangible book value to $15.37 as of September 30, 2022, as compared to $15.69 as of June 30, 2022, primarily driven by a tax-affected mark-to-market adjustment to the fair value of our available-for-sale securities portfolio and largely offset by quarterly earnings and capital management."
}