{
    "symbol": "AMAL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 09:20:05",
    "content": " Second, on the heels of successfully recruiting six new bankers in the fourth quarter of 2021, we’ve continued our talent in acquisition efforts in the first quarter of 2022, also recruiting six new established bankers with relationships across our various focus regions, enabling our ability to tap more broadly into our existing footprint for opportunistic loan origination and to gain market share. Net income for the first quarter of 2022 was $14.2 million or $0.45 per diluted share, compared to $15.9 million or $0.50 per diluted share for the fourth quarter of 2021 and $12.2 million or $0.39 per diluted share for the first quarter of 2021. The $1.7 million decrease for the first quarter of 2022 from the preceding quarter was primarily driven by a $5.0 million decrease in non-interest income, which was due to the tax credits in solar equity investments, recognized in the prior quarter, partially offset by a $1.3 million increase in net interest income, a $1.3 million decrease in the provision for loan loss, and a $0.6 million decrease in non-interest expense. Core net income excluding the effects of tax credits and accelerated depreciation from our solar investments, a non-GAAP measure, for the first quarter of 2022 was $14.3 million or $0.45 per diluted share, compared to $12.7 million or $0.40 per diluted share for the fourth quarter of 2021 and $15.9 million or $0.50 per diluted share for the first quarter of 2021. Turning to Slide 7, deposits at March 31, 2022, were $7.0 billion, an increase of $617.2 million from the fourth quarter of 2021 and an increase of $1.3 billion as compared to March 31, 2021. Deposits held by politically active customers were $1.1 billion as of March 31, 2022, an increase of $159.9 million, as compared to $989.6 million as of December 31, 2021. Turning to Slide 10, including net deferred cost at March 31, 2022, loans were $3.4 billion, an increase of $158 million compared to December 31, 2021. After adjusting for $1 million in interest repaid on a reinstated loan, the fourth quarter 2021 loan yield was 3.89%. Non-interest income for the first quarter of 2022 was $7.4 million, compared to $12.4 million in the linked quarter and $4.0 million for the first quarter in 2021. Core non-interest income excluding the effect of tax credits and accelerated depreciation from our solar investments for the first quarter of 2022 was $7.4 million, compared to $7.0 million for the fourth quarter of 2021 and $7.8 million for the first quarter of 2021. Non-interest expense for the first quarter of 2022 was $34.4 million, a decrease of $0.6 million from the fourth quarter of 2021 and an increase of $1.6 million from the first quarter of 2021. The increase in the first quarter of 2021 is primarily driven by a $2.2 million increase in data processing related to the modernization of our trust department and higher overall contractual fees, offset by decreases in professional fees. Moving to Slide 16, non-performing assets totaled $61.1 million or 0.80% of period-end total assets at March 31, 2022, an increase of $6.5 million, compared with $54.6 million, or 0.77% of period-end total assets at December 31, 2021. The increase in non-performing assets at March 31, 2022, compared to December 31, 2021 was primarily driven by a multi-loan new troubled debt restructuring, totaling $10.5 million from same borrow relationship, offset by a $5.1 million decrease in residential non-accrual loans. While non-performing assets increased, overall credit quality improved with criticized assets declining $51.6 million per 22.3%, to $179.3 million on a linked quarter basis and by $155 million or 46.4% on a year-over-year basis. The allowance for loan losses increased $1.6 million to $37.5 million at March 31, 2022 from $35.9 million at December 31, 2021, primarily due to increases in loan balances. Provision for loan losses was an expense of $2.3 million for the first quarter of 2022, compared to an expense of $3.6 million in the fourth quarter of 2021 and a recovery of $3.3 million for the first quarter of 2021. The expense in the first quarter of 2022 was primarily driven by higher loan balances and a $0.4 million charge-off related to a loan that was transferred to held-for-sale, partially offset by improved credit quality. As the forward curve suggests substantial rate increases through the remainder of 2022, we are updating our full year 2022 guidance as follows: Excluding the effects of tax credits and accelerated depreciation from our solar investments we estimate, core pre-tax, pre-provision earnings of $97 million to $105 million, which includes only the effect of the 25 basis point Fed increase in March of this year, for the remainder of 2022; core pre-tax pre-provision earnings of $110 million to $120 million, which considers the effect of forward-rate curve for the remainder of 2022. Net interest income of $205 million to $215 million, which includes only the effect of the 25 basis point Fed increase in March of this year for the remainder of 2022; and net interest income of $220 million to $230 million, which considers the effect of the forward rate curve for the remainder of 2022. And I think we’ve been out there with, I think $138.5 million for the year and I would expect that we’d stay pretty close to that target, maybe increase slightly on the margin. So on the expense growth, Chris, I think we came in slightly under where we thought we’d be at - where did we come in, about $34 million on a core basis. And then on the deposit side, again, we are not really expecting much more than what we talked about maybe in the previous quarter, somewhere in the net range of $300 million to $400 million, maybe $450 million increase in deposits and on the PACE side, I think we are a little bit ahead of our plan with PACE. But we feel like our deposit franchise as has been built over the past seven or eight years in particular and the types of bankers that we have that are running these deposit relationships and the diversification of the deposits that we have, even this quarter alone, well, we had $160 million of political deposit growth that we had another $350 million of commercial and almost $100 million of consumer growth. I think if we got lower to or if our deposit beta kind of looked a lot like our historical deposit beta, you’d be at that $4.5 million range, possibly even a little bit better than that."
}