{
    "symbol": "AEYE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 21:19:13",
    "content": " Despite macroeconomic uncertainty, the fourth quarter marked the 28th straight quarter of record revenue, achieving $7.74 million, which was 19% year-over-year growth. We're guiding for revenue of between $7.7 million and $7.9 million in the first quarter, representing year-over-year growth of 13% at the midpoint. Revenue for Q4 2022 was $7.74 million, a 19% increase from Q4 2021 and up sequentially from Q3 2022. On a full year basis, in 2022, our revenue grew 22% to $29.9 million from $24.5 million and 20% growth in 2021. For the fourth quarter of 2022, our partnership and marketplace channel grew 14% year-over-year and represented approximately 55% of revenue and 58% of ARR. On a full year basis, in 2022, this channel's revenue grew 17% from $13.6 million of revenue in 2021 to $16 million in 2022. On a full year basis, in 2022, our enterprise revenue grew 28% from $10.9 million of revenue in 2021 to $13.9 million in 2022. Annual recurring revenue, or ARR, at the end of the fourth quarter of 2022 was $29.2 million, a 13% increase over ARR at the end of the fourth quarter of 2021. For the full year 2022, gross margins were approximately 76%, with gross profit increasing from $18.4 million in 2021 to $22.7 million in 2022. With revenue up 19% year-over-year, operating expenses in the fourth quarter of 2022 decreased 19% to $7.9 million from $9.8 million in the same quarter last year. On a full year basis, revenue increased 22% while operating expenses reduced from $33.9 million in 2021 to $33.1 million in 2022. On a full year basis, net loss for 2022 was $10.4 million or $0.91 per share compared to a net loss of $14.2 million or $1.29 per share in 2021. On a non-GAAP basis, in the fourth quarter of 2022, we are once again profitable with net income at approximately $200,000 or $0.01 per share compared to a non-GAAP net loss of $1.4 million or $0.12 per share in the same year-ago period. On a full year basis, the 2022 non-GAAP net loss was approximately $900,000 or $0.08 per share compared to a non-GAAP net loss of $4.5 million or $0.41 per share in 2021."
}