{
    "symbol": "PTMN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 13:39:06",
    "content": " So, I would say the competitive environment that we were hoping was going to -- the competitive environment is actually pretty robust right now, like we're losing a lot of deals and that's surprising given the volatility and quite frankly, the pond that we fish in tends to have people who have kind of just haven't been successful in the fundraising front. I'd say and then in terms of purchase prices, generally, we've seen in the first quarter is if you've a great business, people just aren't putting them up for sale because they just don't think they're going to get maximum price and so we have not seen purchase prices come down. I think you guys are in an interesting position to comment about some middle market loans, because in a lot ways, but what you're doing is cleaning up some of the underwriting histories of other teams and so one of the other things that I think about, or I worry about is rates going hires that for BDCs that have floating rate asset portfolios it puts anything Ted, you said a tailwind in your earnings, but it also would create a higher interest burden for a lot of the borrowers. Yes I think the other lesson learned is, in my 25-years of doing this, when a hospital chain begins to struggle, it's -- I'm not sure I've ever seen the ability for them to successfully turn it around like -- and I've just seen it many times where if this specific industry begins to struggle, it's very, very, very hard to turn this around because you can't cut costs because it's labor and your revenues, it's hard to drive incremental revenue, right because you can't increase prices. I think we've mentioned, we've deployed about $35 million subsequent to quarter-end and probably have another $20 million, $30 million so like very round numbers, I think you probably expect to see our cash balance again where we sit today, with our pipeline probably more in the $30 million range, something like that, that would be a drop of $50 million of cash."
}