{
    "symbol": "NBTX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-19 14:43:05",
    "content": " I’d like to remind you that this call will include forward-looking statements, which may include statements regarding the progress, success, and timing of our ongoing and planned clinical trials, collaboration, regulatory filings, dates of presentation, and future research and development efforts, among other things. In particular, we believe that given the historically low overall response rate to anti-PD-1 treatment and the significant number of patient that demonstrates either a primary or secondary resistant to therapy, pursuing a registration program, targeting patient with recurrent or metastatic head and neck cancer will have developed primary or secondary resistant to anti-PD-1 therapy I receive the area of high as unmet medical need. In the coming months, we look forward to continuing to work with our partner LianBio to advance our pivotal Phase 3 study in locally advanced head and neck cancer, NANORAY-312, by expanding our element to include both U.S. and Asia. We look forward to continued progress in our IO program, not only reporting updated data from the ongoing Study 1100 in the first quarter, but taking significant step of establishing a certain registration program in head and neck cancer by finalizing the protocol for pivotal study for recurrent and metastatic head and neck cancer. This alliance will continue to be cost efficient and operationally efficient way to characterize the broad potential benefit and future therapeutic profile for NBTXR3, complementing the rich dataset already generated by the company and its partner, including data that will be presented at ASCO in June highlighting the safety and feasibility of NBTXR3 in combination with chemotherapy in head and neck cancer and rectal cancer. Please ask your question. Now in term of the 102 amendment, so why the 24-month follow up for head and neck locally advanced patient is important, especially for the one that are ineligible to cisplatin is because that’s where you see if you could from a 30 whole perspective after transform the treatment into some curative pathway. And for us, what is important here is to look at the possibility of combining our product with radiation and chemotherapy, because as we know, this is a standard of care and many other indication and will help us to establish our treatment only as a single agent like we do in soft tissue sarcoma or head and neck cancer Phase 3 trial, but also in combination with chemo and in combination with IO. Please ask your question. Please ask your question. Please ask your question. Please ask your question."
}