{
    "symbol": "RBB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 16:54:04",
    "content": " Loan growth increasing loan yields and declining expenses drove record fourth quarter and 2022 results, with quarterly net income of $17.6 million and earnings per share of $0.92, and an annual net income of $64.3 million and earnings per share of $3.33. A $3.6 million decrease in net interest expenses from last quarter was primarily attributable to bonus reversal of $2 million and lower loan origination commissions of about $6 million, sorry, $5 million -- $500,000 as new compensation guidelines took effect. â\u0080¦ was the crude on a go-forward basis, if we were to kind of back out how the reversal, maybe thatâ\u0080\u0099s a different way of asking what a number we can build off of, because $13 million after the prior three quarters feels low, but again, you also had the wrap-up of the investigations and things like that. So, I think, again, if you look at it in the way that I have -- I still have a couple of positions open that are going to be executive level and they will be getting, again, there are going to be additional bonuses next year, not the full amount of the $2 million, but certainly, possibly significant dollars and taking us up to the holding company level instead of the bank level of pre-tax income. But one of them is a crypto company exchange and that went again with crypto winner from $250 million down to 1 -- approximately, I mean, $150 million at the end of the third quarter and then in the fourth quarter, we decided to have one of the customers we sub -- one of our -- the sub customers. â\u0080¦ we have most of our high are -- most of our people that have deposits over $25 million are either directors or former directors or also our former Presidents of banks that who left companies of banks that we have purchased, okay. Our one of our major goals is to get the gain on sale of loans back up to about a $2 million per quarter number, okay. I see what we are hoping is mortgage will take a back seat, because we have already put our mortgage portfolios now about 40%, 43% of our total portfolio, which really, if you think about it is the safest loan you can do, okay, especially at a loan-to-value of 60%."
}