{
    "symbol": "OPNT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 18:34:06",
    "content": "  Operator: Greetings, and welcome to Opiant Pharmaceuticals First Quarter 2022 Earnings Conference Call. With me on today's call are Chief Executive Officer, Dr. Roger Crystal; Chief Scientific Officer, Dr. Phil Skolnick; and Chief Financial Officer, David O'Toole. This afternoon, Opiant issued a press release announcing financial results and providing a business update for the three months ended March 31, 2022. These forward-looking statements are qualified by the cautionary statements contained in Opiant's news releases and SEC filings, including in our annual report on Form 10-K for the year ended December 31, 2021 and subsequent filings. This conference call also contains time-sensitive information that is accurate only as of the date of this live broadcast, May 10, 2022. The first quarter of 2022 marked another strong quarter for us as we move OPNT003, nasal nalmefene, closer to NDA submission. We are very excited with the recent results of the pharmacodynamic study's top line readout, which builds off the impressive data we saw from our prior clinical pharmacokinetic studies. Opiant's teams continue to execute on our other pipeline programs, while we prepare our regulated submission for OPNT003. Specifically, we are exploring the potential for OPNT002, nasal naltrexone, to reduce heavy drinking associated with alcohol disorder. I would also like to highlight OPNT004, drinabant for acute cannabinoid overdose, for which we expect to complete IND-enabling activities this year. The opioid epidemic has continued to evolve with synthetic opioids like fentanyl now accounting for almost 90% of opioid overdose deaths, which equates to about 70,000 deaths from synthetics in 2021, up from less than 10,000 in 2015. Significantly, fentanyl and other synthetic opioids are now found across non-opioid  substances, including cocaine and counterfeit prescription medicines such as Adderall and Percocet. In our efforts to develop treatment better able to confront our current opioid overdose crisis, we are very encouraged with the top line data from our pharmacodynamic study. Phil Skolnick, our Chief Scientific Officer, designed the study, working with the FDA, which requested efficacy data compared with naloxone. To understand the significance of our data for OPNT003, it's helpful to understand the unique pharmacological properties of synthetic opioids like fentanyl and how they've exacerbated this worsening public health crisis. First, synthetic opioids like fentanyl, our highly lipophilic molecules compared to opioids like heroin. Like other opioids, fentanyl binds to opioid receptors. However, fentanyl and related synthetic opioids, in addition to binding with high affinities are very potent in activating mu-opioid receptor associated signaling pathways. Both a very high potency and rapid entry into the brain, greatly increase the risk for overdose with synthetic opioids. Lastly, and adding yet another level of complexity to treating a synthetic opioid overdose, fentanyl has a plasma half-life of seven to eight hours where the plasma half-life is naloxone is about one to two hours. Renarcotization complicates the management of overdose, which can include the need to redose with a reversal agent, if symptoms reoccur to the need for an extended intravenous infusion of reversal agent in emergency room. The half-lives of opioids can vary widely because there is no information about either the opioid or the amount taken as we've seen in an overdose, a rescue agent with a longer duration of action can reduce the risk of renarcotization. Multiple reports have emerged over the past five years, indicating that more effective rescue agents are needed in an error when illicit high-potency synthetics are responsible for the majority of opioid overdoses. It is within this context that the National Institutes of Health leadership has called for the development of \"stronger, longer-acting formulations of antagonists\". Like naloxone, nalmefene is mu-opioid receptor antagonist that can reverse the signs and symptoms of any opioid overdose, including respiratory depression. However, we believe that the pharmacodynamic and pharmacokinetic properties of nalmefene may differentiate it as a reversal agent, particularly well suited to a community environment now dominated by synthetics such as fentanyl. This higher affinity results in much higher new opioid receptor occupancy than naloxone, even if similar plasma concentrations. It took nasal nalmefene 15 minutes to reach Tmax in contrast to 30 minutes with nasal naloxone, and Cmax, the total concentration of reversal agent in the plasma is twice that of nasal naloxone. Finally, multiple studies, including our own have demonstrated that the plasma half-life of nalmefene at 8 to 12 hours is substantially longer than naloxone at one to two hours. In addition to these PK data at the request of the FDA, we also designed the recently completed pharmacodynamic study. Our primary endpoint, as I indicated before, was five minutes post-administration. This is especially important in the case of synthetic overdose, where there is, in fact, a reduced window of opportunity to affect the successful rescue. I'll explain the procedure, then I will go through what we see as the primary endpoint, five minutes and also out to the first 20 minutes in this study. To start, all subjects were tight fitting face mask at time zero, which you can see on the extreme left of the graph, subjects were administered a gas mixture containing a high concentration of CO2. You can see in this graph that by 10 minutes after breeding this hypercapnic gas mixture, the minute of inflation substantially increased. At 15 minutes into the remifentanil infusion, which is time 25 on that graph, the face mask was briefly removed and the subjects were dosed intranasally with either nalmefene or naloxone. Minute ventilation was then measured over the first 20 minutes, which, of course, includes the primary endpoint at five minutes, which is indicated by the downward arrow on the graph. Working from the left of the slide to the right, the bar graph demonstrates minute ventilation in five minutes. The increases in minute ventilation were 5.745 liters per minute and 3.011 liters per minute with nalmefene and naloxone, respectively. As you can see, the minute -- the difference in minute ventilation between the two groups clearly favorsnalmefene. Nalmefene falls well to the left of the slide, indicating that OPNT003 clearly met the primary endpoint of non-inferiority. At five minutes post nalmefene, increases in minute ventilation were well within the 95% confidence interval of the minute inflation before subjects were given remifentanil. The values at 7.5, 10, 15 and 20 minutes post nalmefene are also within the pre-remifentanil values, and that should be very clear from the slides because those points actually dot that -- or cross that dotted line or come close to it. By contrast, it took nasal naloxone 20 minutes to increase minute ventilation to levels seen at five minutes with nalmefene. It is with these compelling PD data, together with the PK studies we conducted, demonstrating both rapid absorption and long plasma half-life that suggests OPNT003 represents a highly promising opioid overdose reversal agent. And if I may, at this point, I'd like to thank our government partners, the Biomedical Advanced Research and Development Authority and the National Institute on Drug Abuse for their support. I'd also like to acknowledge the contributions of my colleague, Dr. Mark Ellison and his clinical development team to the success of these studies. For the first quarter of 2022, we reported revenues of $4.5 million, of which $2.2 million of revenue was attributable to royalties from the license agreement with Emergent BioSolutions, Inc. or EBS for the sale of NARCAN Nasal Spray. This is the result of EBS applying the generic reduction clause provided for in the license agreement, a prospect that we anticipated, included in our current financial plan and discussed on our last earnings call. This provision in the agreement states that once a generic is launched in a particular country, each subsequent quarter's performance in that country is measured against NARCAN sales for the same country in the quarter immediately preceding the quarter in which the generic launched. However, based on information provided by EBS, the U.S.-specific net sales decreased more than 30% when compared to U.S. sales in the third quarter of 2021, the reference quarter. This calculation is completed separately each quarter, which means that the application of the generic reduction cause this quarter has absolutely no bearing on whether it is triggered in the remaining quarters of 2022. Operating expenses included $4.4 million in general and administrative expense compared with $2.6 million in 2021, $8.8 million in research and development compared with $4.1 million in 2021 and $2.7 million in sales and marketing compared with $1 million in 2021. The increase in investment in R&D and sales and marketing were primarily associated with the completion of our clinical work for OPNT003 and heightened precommercialization efforts, respectively. Net loss for the three months ended March 31, 2022, was approximately $12.2 million or a loss of $2.43 per basic and diluted share compared to a net loss of approximately $2.8 million or a loss of $0.66 per basic and diluted share for the comparable period of 2021. From a capital resource perspective, we ended the first quarter with approximately $51 million of cash, which puts us in a position to execute on our key commercial and R&D initiatives. Maybe just firstly, could you provide maybe something right into the feedback that we've seen so far just on that onset of action. And then maybe secondly, anything in the market currently and market dynamics that you're seeing within opioid overdose market that may not be playing out as you expected or without giving away your commercial strategy, just -- I mean you do have the ability to obviously evolve it. What we know for a successful opioid overdose rescue delivering as much of a potent opioid overdose reversal agent into the ultimately, the brain as quickly as possible is key -- and the feedback that we've had so far when we speak to our KOLs and our advisory board is that's very much what they're seeing as represented in this pharmacodynamic study. So anything that can reduce that is actually not just well received from a clinical perspective, but also from a health economic perspective as well, which is why we are confident that this product as you said, we think will be differentiated and we'll have a significant value proposition as well as from the clinical and economic angle. So when we look at some of the opioid settlements around free goods, Teva, for example, that's important to increase access to opioid overdose reversal agents and communities otherwise don't have satisfactory solutions such as some of these harm-reduction communities. But what's important when we think about the market dynamics is that, this isn't a long-term solution because innovation is here and should continue, and we should allow for that. We're seeing increasing year-on-year, quarter-on-quarter, not just opioid overdose death, but in parallel, the proportion of those deaths are due to synthetic opioids. David, if you could just to the extent you're able remind us of any interplay between the authorized generic and what you may take royalties versus sales of the branded NARCAN Nasal Spray. As far as the authorized generic and the branded, the interplay there, the branded NARCAN, under the agreement, those two amounts are combined as far as the dollar amounts, and we receive royalties based on the total of that. Obviously, we've got a strong marketing team, sales leadership, government affairs initiatives and market access. Carl Edward Byrnes Northland Capital Markets, Research Division – MD & Senior Research Analyst Congratulations on the progress. However, when we think about the overall differentiating factors of this product, we see it as faster, stronger and longer, faster in terms of the absorption, both on the PK and now the PV study as well when we look at the minute ventilation naloxone versus nalmefene. As Phil said, just to reemphasize, the response we see with nalmefene at five minutes in the PV study is achieved with naloxone, nasal naloxone until 20 minutes. The stronger is also related to that, where we look at the PD study, the 202 data points were stronger, if you like. And then finally, the longer piece, well, actually, the longer piece  from our data, although our data support this is actually in the existing label for injectable Revac, which was the original branded nalmefene in the language in that label that includes the fact that nalmefene acts for longer than naloxone. So those are the -- that's the underlying supporting data, and that's the discussion with the FDA as to how that will fit into the label itself. How should we look at SG&A and R&D spending for the balance of the year, understanding that in the current quarter or the first quarter, rather, you had $2.7 million that was related to pre-commercialization activities. And then in the R&D line, you had $2.2 million from the BARDA grant? So a couple of things on BARDA, I think that's -- and thanks, Carl, for the question and thanks for being on the call, first of all. But for BARDA, the total contract, as you remember, was $10.3 million, and we've recognized $6.8 million of that through March 31, 2022. So the R&D spend for 003 will be offset for the year, for the next quarters will be offset by the $3.5 million that we do get in revenue from BARDA. SG&A as we get closer to FDA approval towards the end of the year, the sales and marketing spend will increase. G&A, we're going to keep that as lean as possible going through the end of the year to save -- to expeditiously watch our expenses and make sure that we have all of those -- all of our resources focused on commercializing 003. And in addition, I wonder if you feel like there's going to be the need to do any additional studies to understand the risk of precipitated or abrupt withdrawal from the use of nalmefene. In terms of withdrawal in additional studies, at this point, the FDA hasn't specifically said we need to do any additional studies regarding this as well."
}