{
    "symbol": "WEN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 12:28:02",
    "content": " During the third quarter, our dollar and traffic growth ranked amongst the top performers in our competitive set, and we maintained our total day dollar and traffic share of the QSR burger category in the U.S. On the breakfast front, we launched French Toast Sticks, our first major menu innovation in the U.S., which drove a meaningful acceleration in the U.S. breakfast sales over the course of the quarter. Our international business achieved another outstanding quarter with widespread success, marking a sixth consecutive quarter of double-digit one- and two-year same-restaurant sales growth with two-year growth reaching over 25%. Our U.S. business delivered same-restaurant sales of 6.4% on a one-year basis, accelerating over 4 percentage points versus the prior quarter as we held our strong dollar and traffic share position within the QSR burger category. Our global systemwide sales grew almost 9%, supported by strong global same-restaurant sales growth across both, our U.S. and international segments and continued net unit growth. Adjusted EBITDA increased almost 20% to approximately $135 million, primarily driven by higher other operating income due to a gain from insurance recoveries, higher franchise royalty revenue and the favorable impact of our acquisition of 93 restaurants in Florida in the prior year. We're definitely very focused to get back to pre-COVID levels since, at the end of the day, from a margin point of view, since this gets us better financial returns for new builds and better confidence within the franchise system with the rest -- with the company restaurants in the U.S. posting 14.8% in the quarter, we're getting there, right? I wanted to see if there's any kind of shift that you're thinking about, especially as it relates around accelerating a variety of initiatives that you may want to get done on a system-wide basis where some of that company's capital, some of Wendy's capital could potentially be reinvested or used in the franchise community to strengthen the brand overall, or if we should expect the previous franchisees invest on their own to largely remain the case."
}