{
    "symbol": "SMAR",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-03 00:55:25",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Smartsheet Third Quarter Fiscal Year 2022 Earnings Conference Call. I would now like to introduce your host for today's conference, Aaron Turner, Head of Investor Relations. Good afternoon, and welcome, everyone, to Smartsheet's Third Quarter of Fiscal Year 2022 Earnings Call. With me today are Smartsheet CEO, Mark Mader; and our CFO, Pete Godbole. There is a slide presentation that accompanies Pete's prepared remarks, which can be viewed in the Events section of our Investor Relations website. During this call, we will make forward-looking statements within the meaning of the federal securities laws. These forward-looking statements are subject to a number of risks and other factors, including, but not limited to, those described in our SEC filings available on our Investor Relations website and on the SEC website at www.sec.gov. Although we believe that the expectations reflected in the forward-looking statements are reasonable, our actual results may differ materially and adversely. All forward-looking statements made during this call are based on information available to us as of today, and we do not assume any obligation to update these statements as a result of new information or future events, except as required by law. A reconciliation to the most directly comparable U.S. GAAP measures is available in the presentation that accompanies this call, which can also be found on our Investor Relations website. Today, I'd like to focus on 3 key areas: Our strong Q3 results, which saw an acceleration of our revenue and billings; our continuing momentum in both enterprise and SMB; and how Smartsheet is driving innovation in more departments across more industries than ever. While Pete will give you the details, I do want to highlight a few standout areas of Q3 performance. And in October, we set a Smartsheet record for licenses bought by new customers in a month. Overall, we increased our ARR 10% quarter-over-quarter. Our reacceleration, our aggressive investment posture and our new high-water marks in pipeline and large deal volume make me more bullish than ever on the prospects of the company. As many of you know, Smartsheet is a cloud-based platform for dynamic work that empowers employees and teams to transform how they work. Through a combination of a no-code platform, a global community and a broad service offering, customers unlock business value by transforming projects, programs and processes at scale. Rather than being just a task-oriented tool, Smartsheet can scale from a simple project used by a 5-person firm to an enterprise SaaS platform that enables work across critical business systems at the largest companies in the world. That momentum often gets started when a specific team or department, let's say, performance marketing deploys Smartsheet to streamline campaign management. As work is shared with other departments via Smartsheet, those departments begin to understand the value of the platform and viral growth occurs. As customers graduate from basic productivity use cases to transforming operational workflows, we see rapid uptake and acceptance across more departments. For example, in Q3, we had wins within marketing departments at companies like USA TODAY, United Airlines and Turner Broadcasting, HR departments at companies like Sonos, Avalara and University of Southern California, in sales departments at Robert Half and Juniper Networks, in legal departments at Kayrros, NetApp and Ambev, in operations at Estée Lauder and Piedmont Healthcare, and at government entities, including the U.S. Department of Agriculture, the U.S. Department of Health and Human Services and the FAA. We saw expansion at Hewlett Packard Enterprise and Aruba, an HPE company, where the marketing and sales departments are tracking events and consolidating input gathered from various sheets, Smartsheet forms and update requests into a global calendar used by field sales and executives. And at Autodesk, the legal department is using Smartsheet Salesforce Connector to pull in deal data to track negotiation points, fallbacks used and security issues. With Smartsheet, Autodesk reduces the manual effort related to inputting their deals, which allows managers to track and report on recurring issues, monitor team bandwidth and improve strategic decision-making. Q3 saw both a new quarterly record of 203 deals of more than $50,000 and a new quarterly record of 77 deals of more than $100,000, up 92% and 114%, respectively, year-over-year. And this is occurring while we invest in high potential markets like Europe, Asia Pac and the federal government. Smartsheet Regions, our regional Smartsheet offering, is now available in the EU and enables customers to establish plans with their content hosted in Germany. While gov remains a small percentage of our total ARR, the ARR growth rate coming from the government entities grew in excess of 125% year-over-year in Q3 with a significant ramp in logos landed. Beyond the numbers, I'd like to talk for a minute about our Smartsheet innovations that are driving customer uptake. With the pace of innovation quickening on WorkApps configuration and distribution, the table is setting up nicely for WorkApps to become a major driver in shaping how people interact with Smartsheet. More than 50,000 WorkApps have been created to date, providing evidence that strong demand exists for creating composite solutions across the company's Smartsheet deployment while also helping them maximize yield from existing cloud investments such as Microsoft 365 and Google Workspace. With nearly 0.25 million PDFs, images and videos proofed within Smartsheet in the quarter, new muscle is being developed around how people enroll others in content review. With the integration between Smartsheet and Brandfolder deepening, new and existing customers choosing Smartsheet for digital asset management have a more flexible and powerful way to securely store, customize and share assets. Our platform and differentiated capabilities allow us to attach to a variety of workflows, placing us in the upper right of the leaders quadrant for both the G2 project and portfolio management and digital asset management grids. The combination of providing simplicity at the end user level and flexible capabilities to manage programs at scale, plus security and governance controls required by enterprise IT is what sets Smartsheet apart. In PPM, we bring a modern approach that connects bottoms-up project and process management with portfolio level views that give senior leaders organization-wide visibility to define standards, manage resources and align on priorities. In the digital asset management space, we've unified 2 market-leading solutions, Brandfolder DAM and Smartsheet CWM. By creating one platform for marketers and creatives, shared visibility is achieved and teams are positioned to respond quickly to asset performance. Our digital content life cycle and asset management capabilities enable Smartsheet customers like McLaren Racing to accelerate content workflows for planning, creation and distribution using that single platform. For example, McLaren Racing's partners and fans will now be able to easily locate, access and share content from race days. In Q2, we launched Smartsheet Advance, a new tiered way for customers to unlock the full potential of Smartsheet at scale. At the entry tier, Advance Silver enables businesses to orchestrate sophisticated programs, projects and processes at scale using premium capabilities like Control Center. At the top tier, Advance Platinum adds capabilities for organizations that desire additional levels of compliance, governance and advanced policy management. With Smartsheet Advance now in the market for 2 quarters, we have seen that our packaging approach that enables customers of any size to benefit is hitting the mark. One notable customer win was with USA TODAY, where the marketing team's executive leadership was charged with solving challenges of cutting inefficiencies, eliminating budget overrun and reducing employee turnover in order to scale their events business. Smartsheet Advance will support the phased implementation of multiple solutions, beginning with Control Center, Data Shuttle and the Salesforce Connector. Sansone Group was able to hit the ground running with Advance Silver, migrating workloads from legacy tools into an end-to-end project and portfolio management solution. From project intake, to execution, to executive reporting, Sansone Group uses Smartsheet Control Center to ensure that construction projects are deployed with consistency and key information is automatically surfaced to executive leadership of this rapidly expanding business. Advance is resonating with customers of all sizes, not just enterprise customers with 51 of the Advance deals coming from organizations with 200 employees or fewer. One of those customers, Sofos Consulting, is using Advance to standardize their professional services offerings around client onboarding, project management and service requests. The centralization and visibility of key information has allowed the executive team to have true insight in the client projects, in particular, on resource allocation and capacity. Overall, this was a very successful quarter with 160 Advance deals closed. Before I pass the mic to Pete, I'd like to touch on the leadership appointments we announced a few weeks ago. The promotion of 3 senior executives, Jolene Marshall, Stephen Branstetter and Andrew Bennett to C-level roles brings deep institutional knowledge and proven innovation into central roles for our next phase of growth. Each of these decisions is grounded in our commitment to empower anyone to drive meaningful change and further positions us to provide clear ownership, drive operational excellence, capture the market opportunity and best serve our stakeholders. Additionally, as previously announced, Chief Product and Strategy Officer, Gene Farrell; and Chief Legal Officer, Paul Porrini, will be departing Smartsheet. Smartsheet veteran of 3 years, Praerit Garg has assumed joint leadership of the product and engineering team at Smartsheet. And on the topic of team, I'm proud of the recognition we have received for our strong company culture, including being named a Best-Led Company by Inc. magazine, being named the Best Places to Work in Australia by WRK+ and earning 7 Comparably Awards in 2021. The momentum we're seeing in so many areas as demonstrated by our acceleration in revenue and billings, driven by the best bookings performance in the company's history, motivates our entire Smartsheet team. As Mark mentioned, Q3 was a great start to the second half of the year, continuing our momentum of crisp execution against a backdrop of an improving global economy. Our Q3 outperformance relative to our guidance was a function of strong execution by our sales team, significant enterprise expansion, another record number of larger deals and continued success of our Advance offering, which is resonating with companies of all sizes. Unless otherwise stated, all references to our expenses and operating results are on a non-GAAP basis and are reconciled to our GAAP results in the earnings release and presentation that was posted before the call. Third quarter revenue came in at $144.6 million, up 46% year-over-year. Subscription revenue was $132.6 million, representing year-over-year growth of 46%. Services revenue was $12 million, representing year-over-year growth of 50%. Third quarter billings came in strong at $161.6 million, representing year-over-year growth of 44%. As you'll recall, in September of last year, we acquired Brandfolder. As a part of the acquisition accounting, we recorded onetime billings of $4.7 million associated with the acquired deferred revenue from Brandfolder's balance sheet. After adjusting for this $4.7 million, our year-over-year billings growth rate in Q3 is 50%. Quarterly, semiannual and multiyear billings represented approximately 4% of the total. The number of customers with ARR over $50,000 grew 56% year-over-year to 2,078. The number of customers with ARR of over $100,000 grew 72% year-over-year to 868. These customer segments now represent 53% and 38%, respectively, of total ARR. The percentage of our ARR coming from customers with ARR over $5,000 is now 85%. Next, our domain average ACV grew 37% year-over-year to $6,368. We ended the quarter with a dollar-based net retention rate of 131%, a 3 percentage point improvement from Q2. Q3 was the first quarter to incorporate Brandfolder, which was a headwind of less than 1%. Over the course of this fiscal year, we experienced large incremental improvements in our dollar-based net retention rate as we've replaced quarters negatively impacted by COVID with more normalized quarters. In Q4, we will complete the lapping of our COVID-impacted quarters from fiscal year '21. Now that we will be lapping more normalized quarters, we expect our dollar-based net retention rate to stabilize around the 130% level. Overall operating loss in the quarter was negative $2.7 million or 2% of revenue, an improvement from 15% of revenue a year ago. Free cash flow was negative $6.3 million, which overachieved against our guidance due to strong collections and the timing of a legal settlement, payment of which is now expected to occur in Q4. For the fourth quarter of fiscal year '22, we expect revenue to be in the range of $151 million to $152 million, billings to be in the range of $204 million to $205 million, non-GAAP operating loss to be in the range of $20 million to $18 million, and non-GAAP net loss per share to be between $0.16 and $0.14 based on weighted average shares outstanding of 126.5 million. Given our strong Q3 results and continued momentum in our business, we are raising our full fiscal year '22 revenue and billings guidance. We now expect our revenue to be in the range of $544 million to $545 million, representing growth of 41%. Billings are expected to be in the range of $641 million to $642 million, representing growth of 42%. As such, we are providing initial billings for year-over-year growth guidance of 37% to 40% for fiscal year '23. The acceleration in revenue and billings, the success of Advance with the opportunity for it to be a significant future driver and the net expansion rate that has crossed 130%. Mark, you called out record net new client wins. I think part of it was in the last 2 quarters, we really have had an opportunity to balance our investment across a couple of investment areas. One being at the very high end sort of capable Advance Platinum, serve the most, I guess, assertive companies in terms of their policy management and enterprise side. And then on the other end of the spectrum, it's the antithesis of that. And in Q3, we refactored our entry-level plan called Pro Plan. And what we found was that by removing some of the restrictions on things like sheet capacities and limits, it gave people a lot more freedom to get started and gain confidence and that has started to play out. We think that serves us well to take care of the incremental demand, whether it comes from enterprise expansions or it comes from these new customer additions and new license additions. So Mark, I believe Smartsheet is several years ahead of the field in terms of the FedRAMP certifications and I noticed the Federal News Network was highlighting Smartsheet for the rest of the agencies. And when you land at an agency, I mean, I'd love to be able to say, Mark, we're closing huge 7-figure contracts at every agency. And I do expect in the out-years, as we talk about this being a highly sticky category, once you're in, we think and what we're observing is that the growth within those agencies absolutely exist. And Pete, I was curious about the Advance version of the product. I mean, obviously, there's a lot of strength. When we introduce new product and innovation, you always hope that each of them are going to be a home run. And when they're actually in-market and you see what the customer uptake is, then you really get to see it play out. However, it is a component, which is a capability, a premium capability that people are really latching on to. So the more people we can get exposed to these things, the better. The second one I would point to is relatively new, and we just turned on for our enterprise customers, which is a Snowflake-powered analysis capability within the product that allows people to do things like time series reporting. And when I look at in a matter of 1.5 months, more than 50% of the enterprise customers have utilized that capability. And thank you, Snowflake, for putting us in a position to deliver that to our customers. But those are the kinds of things you look for in the portfolio that really, I think, help drive the strength and I think give us confidence for the out-year. I mean, there are multiple things that give us confidence for the out-year, but those are 2 things that have really landed. And I think the better you can present your offerings and get them to discover them, utilize them, promote them, the better. I think there's another part of the approach, though, which is quite opposite to that, which is helping somebody understand how your innovations will drive value realization after which you have the right to monetize. So when I think about how we're going to some of these large brands and doing discovery sessions with them to help them understand how to unlock value on more of a strategic level, that is quite useful as well. How do you let discovery occur and self-directed growth to occur combined with more of that consultative approach, which really plays out well in those scaled environments. An endpoint, an end user is going to have a different journey expectation than maybe an executive. And then, Pete, just quickly on gross margins, it looks like you've raised the level of expectation from, I think, 79% to 81%, to 81% to 82% for the year. I think the reason we've raised the margin by the amount you mentioned is because we've only got 1 quarter to go, and we've seen the trend of how we've sort of worked on gross margin and maintained and raised that. I think when you look at change and opportunity, I often look at how you apply risk to change. And one of the things I'm very grateful for is that of the new appointments, we have existing institutional knowledge. We have existing cultural alignment, which allows you to really move forward swiftly and with great confidence. So as I look at the unification of marketing with Andrew as our CMO, looking after the demand gen, the brand, the product marketing and other elements that constitute marketing, we have a much, much faster decision flow than we had prior, where we had elements of marketing existing within 3 different parts of our business. When I look at Praerit taking on engineering and I look at the ability to have a unified product and engineering person help be the arbiter in the moment, that lets us make faster engineering decisions. When I look at Jolene taking on things like procurement and risk and working with our CISO, I look at the scope of legal also expanding. And when I look at having, what, 2,600 roughly people on the roster now, it's also an amazing thing to be able to point to someone growing their career within the business. So I think it's a really, really neat composite there. And I think on the Stephen front, on the COO, Stephen as our SVP of Ops, just prior to getting the appointment of COO, he's been running the rhythm of the business. And he is, as we look at really formalizing our approach to expanding international, I really look forward to Stephen taking that institutional knowledge and applying it in our new markets. I think the neat thing about seeing strength is that when you see strength, you want to invest more behind it. So as we look at improvements to how people land and how they procure and how they expand, it just causes you to want to put more both engineering and go-to-market dollars behind it. So as we paired the launch of our new Pro Plan, we absolutely flexed in terms of making sure it was in front of more people. And when we think about our marketing investments heading into next year, we look at top of funnel, we look at mid funnel and we look at bottom of the funnel. As I think about the rest of the year and heading into next year, I think the awareness of mainline individuals within lines of business being able to serve themselves and derive great value, like that is hitting mainstream now. Pete, I think you mentioned that you're expecting net retention to stabilize around the 130% range going forward. I think if you looked at the cut down of the net dollar retention rate, we're seeing strength across all verticals. First of all, it's coming all across every vertical, every customer segment. Mark, you pointed out or you provided a handful of stats that point to the diverse kind of uptake we're seeing across the base. I'm curious, is there a difference you're seeing yet in the size of a deal that includes Advance versus one that doesn't because I would assume that those customers are a little bit more sophisticated, I'd say, in their usage of Smartsheet, but curious what you're seeing in terms of deal size. Of our top 10 deals in the quarter, 6 of them did have Advance elements to them. So when I think about someone being prepared to take on more, in the past, we often talked about maybe a $1,500 or $3,000, let me just dip my toe in and get a couple of licenses. So yes, I think it's really setting up nicely. Just wondering if there's any recent customer reaction on the new platform announcements that you guys made at the ENGAGE event, including the customer-managed encryption keys, enterprise plan manager and the data retention controls that you guys announced. But if you don't have some of these things and it's a hard requirement, you don't get to pass go, then you stop. And getting boxed out on one of those, I'll call it, a technicality. You've worked so hard to build, build, build, and you want to do that next big expand and you get stuck. So I just, those 3 that you mentioned are just great examples of things that are very important to some people, and now we have a chance to really get past that nicely. And once you get into that scenario where like enterprise plan manager, it's less about a new discrete feature function for the end user. Part of the unification I spoke to in a prior answer was about aligning that demand gen, the brand, the product marketing under one leader. And as it relates to our worldwide field operations on the sales side, very strong leaders in the U.K., Australia, East, West U.S., and they're working directly with our CRO right now. When I look at the confidence that we've seen in the last few quarters, we're very bullish in fiscal year '23. You've seen momentum in our, what I call, Advance sales. And when you couple that with our ability to add in higher sales capacity, we see that as a natural extension of the plays we've run this year. And when I think about the deepening of Brandfolder and Smartsheet coming together, it's about how do things like proofing in Smartsheet parlay into brand distribution via Brandfolder. These are all things that are starting to be realized now, and that's the yield you get. Right after an acquisition is done, right, you have 2 basically independent products. And as we head into next year and we look at our hundreds of quota-carrying reps, they're going to be in such a better position to talk about a unified DAM and CWM product versus last year that, again, it's another one of those things that gives us great confidence heading into next year. And I would say in this, with this persona type, the marketing persona type, I would say they're maybe even a little bit more particular about things working well. And again, one of the reasons why we're investing so much in the integration of these 2. I wanted to focus on two parts of that, if I could, and then I was going to follow up with just a quick clarification. In terms of just a philosophical, you're guiding to kind of 130% on the net retention rate. And so therefore, if we look at 37% to 40% kind of billings growth, I assume that we should just philosophically think about kind of 30% from existing customers and the 7% to 10% from new logos, so to speak. And then the other question, if you could just describe a little bit on WorkApps. So Keith, I'll take the first part of your question, and then I'll let Mark answer the WorkApps part of your question. So as we described the stabilization of 130%, you should think of it as being, here's the rough numbers that I would build my models on. And then as you think about the additional pieces that comes from essentially new business and other spots, which we've sort of talked about. On the WorkApps side today, WorkApps is something that is available to our enterprise customers. And so I would say, the companies who are more fluent with our product have deployed it, are now using WorkApps to come up with these more curated ways to enroll people in the product, distribute it either internally or externally. And we do hold that option card to be able to say, as WorkApps becomes better and better and we have ways to introduce it to other plans, maybe even a trial user, we will fully pursue that. But right now, it is really more for the existing customers, those enterprise customers to drive significant value. And just all the...\n One thing I would add though is, it's difficult to factor how the presence of something influences someone's initial decision, right? So even if you don't experience it in your trial or is a Pro Plan user and you know it exists, it may still play a role. So the one thing that I wanted to ask though as a clarification, the free cash flow guidance is a little lower than I thought. It's a onetime payment of $10 million as a part of a legal settlement, which we had previously disclosed. Unrelated to our ongoing business, it's just the cash part of the settlement, if you will. Mark, maybe if you could share some color on Smartsheet Regions. Yes, much similar to the conversation we had about some of those enterprise capabilities like the managed encrypted keys and such. And we have, there are examples of people in the first week that we had it available elected to deploy their Smartsheet environment in that area. I think as quarters go on, we'll have a really good sense for what the economic impact is, how we decide to go into other regions and how quickly. But it's really, really proud of the team for having gotten it ready, ahead of schedule and in market and activated. Again, I think the ability for the, both the initial customer experience, that person who's considering pro or business or the enterprise, it actually is relevant to both populations. So we see it as still, I think this market is so fascinating because I think it is one of the most diversified TAMs in SaaS. That results in many, many buying decisions happening in an uncontested way where an individual is considering it for their business unit, their team or their division. And so how I describe the new environment, very lightly contested, people graduating from the way they've done work over time. In accounts of significance, you do start looking across other divisions, other teams and seeing other tools used and such, so the importance of having diversity in your user base, critical. And when we look at some of our biggest accounts and we see like 60 nodes of Smartsheet across 6 divisions, I would actually prefer that hand over being super deep in one division. So I think that diversity does create a lot of greenfield for a lot of companies and then just make darn sure you don't become known as, oh, they are a pure fill-in-the-blank division type company. If there are any use cases that you'd call out that's done particularly well since you updated last quarter guidance, that would be helpful. On the PPM front, I would say people are growing less satisfied with the old approach. And the old approach would be, give me a planning tool and then I'll execute it in some other way. So this notion of totally disconnected, I'm going to plan and allocate capital in one area and then just sort of have my team get it done in another way, that is feeling quite antiquated. And I think that, again, the market is getting more deeply familiar with the modern way of doing it, which is what we're really driving. So even though we do experience as we talked about, legal departments, HR departments, sales departments, service departments, really the bow wave of a lot of demand remains centered on the project and process and program orientation and then it vectors from there. So it's interesting that you highlight the PPM realm because it's still a very, very common theme of someone's initial buying criteria and decision. And so when we look at how people are executing events, people are doing them still virtually. We are starting to see people execute events in-person as well, as well as in that hybrid mode. And I think that will, I think people, again, their confidence is growing in that. But people are not sitting still, they're making decisions. The last quarter, you touched on the increase in partner deals, especially with partners that had like specific expertise in specific areas like health care and manufacturing. Some of these are focused on individual verticals like manufacturing, et cetera. In terms of numbers, the partner collaborative bookings represented what I call low teens of our business and really strong year-on-year growth. And thanks, everyone, for joining us today, and we will see you out on the road and talk to you next quarter."
}