{
    "symbol": "SMAR",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-07 20:24:05",
    "content": " Billings grew 47% to $142.9 million; and our dollar-based net retention rate, which incorporates all of our customers, improved by 3 points to 128%. An expansion within our base included 143 customers increasing their ARR by more than $50,000, up 81% year-over-year and 49 customers, a Smartsheet quarterly record, increasing their ARR by more than $100,000, up 158% year-over-year. As previously mentioned, second quarter revenue came in at $131.7 million, up 44% year-over-year. Second quarter billings came in strong at $142.9 million, representing year-over-year growth of 47%. For the third quarter of fiscal year '22, we expect revenue to be in the range of $138 million to $139 million, billings to be in the range of $149 million to $150 million, non-GAAP operating loss to be in the range of $15 million to $12 million, and non-GAAP net loss per share to be between $0.12 and $0.10 based on weighted average shares outstanding of 126 million. Among them: The resonance of our Dynamic Work platform offering that is apparent by our early success with Advance; our billings outperformance, which indicates a strong demand environment in the quarter across segments and geographies; and enterprise traction, evidenced by record number of expansions greater than $100,000; and the sequential increase in customers with ARR of over $1 million. Now in terms of your specific question about Q3, if you recall, in Q3 of fiscal year '21, we had a $4.7 million onetime acquired deferred revenue pickup, which when you sort of put into our guidance or factored into our guidance, would make our guidance about a 38% to 39% year-on-year growth. And I think that's part of why we're building bridges there and alliances because we hear that signal from customers that it's being part of that strategic software stack really requires you to be able to interact with RPA and the other big systems of record, whether it be ERP or your HR systems."
}