{
    "symbol": "MTSI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-27 14:11:05",
    "content": " I would like to remind everyone that our discussion today will contain forward-looking statements, which are subject to certain risks and uncertainties as defined in the Safe Harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. A reconciliation of GAAP to adjusted non-GAAP results are provided in the company’s press release and related Form 8-K, which was filed with the SEC today. When Jack has finished, I will provide revenue and earnings guidance for fiscal Q2 and then we will be happy to take some questions. We made incremental progress and profitability, achieving gross margins above 61% and operating margins above 30%. Over the last couple of years, our management team and employees have worked hard on numerous continuous improvement projects that have spanned the company. We are focused on execution whether it involves developing and launching new products, meeting customer delivery requests, improving our operational efficiency, or improving internal business development processes to name a few. Similar to prior quarters, we believe that our Q1 bookings activity reflects a combination of market share gain and/or long lead orders which are being placed well ahead of required ship dates due to extended industry cycle times. Our turns business was approximately 14% of our total revenue during the quarter, which was in line with expectations. Our operations, planning and logistics teams continue to do an excellent job managing the variety of day to day challenges whether supply chain shortages of key components, temporary interruptions from offshore assembly and test or production capacity limitations within our supply base. Telecom was $55.8 million, and data center was $30.7 million. I'll also highlight the test and measurement segments is trending up, mostly supported by standard products. Today, we are working to strengthen relationships with major aerospace and defense primes, introducing them to the full scope of MACOM's capabilities in technology. As a reminder, telecom is a very broad and diverse end market for MACOM spanning numerous network architectures and topologies. These include wireless systems metro long-haul optical backbone deployments, fiber-to-the-home, cable television infrastructure, broadband satellite networks, wireless backhaul, 5G wireless, and broadcast video. I will note our long term growth vectors remained intact and include supporting 100G to 800G platforms with market leading analog CDR solutions, TIAs and drivers. Additionally, we're also expanding our data center product offerings to now include equalizers, photo detectors and lasers. And lastly, we are seeing growing interest in MACOM's linear drive solutions, which will compete with DSPs in certain applications and interconnect architectures. Our long term growth strategy is built upon offering our customers unique products based on our compelling semiconductor process technologies, innovative analog and mixed signal designs, which will use world class silicon semiconductor processes and offering solutions to customers which utilize advanced packaging and proprietary subsystem designs. For example, we estimate the market opportunity for MACOM and high frequency gain mimics to be around 300 million. And lastly, over the past two and a half years, we have made significant progress bringing to market our indium phosphide 25G FB and DFB laser product line. Last quarter, we announced the release of our new high performance linear equalizer product line for use in backplane and data center applications that require high speed data paths over short distances. Our initial products include two channel and four channel PAM4 equalizers, running at 56 and 112 gigabits per lane respectively. MACOM linear equalizers can double the reach of existing passive cables in short reach 200G, 400G and 800G applications. We believe this chipset can provide comparable performance to DSP based PAM4 solutions at lower cost, lower power and lower latency for short reach multimode applications. Further, adding employees with different skills, experiences and backgrounds helps to further create a diverse and inclusive workforce, which makes MACOM stronger. Some of our product lines like diodes, mimics and lasers rely on our internal process technology to provide a competitive advantage. Other product lines like CDRs, network products and crosspoint switches rely solely on our industry leading high speed analog and mixed signal circuit design capabilities to differentiate. Going forward, we will see not only to maximize our revenue opportunities in the market segments I've discussed, but we will also add new market segments where we will have the ability to leverage MACOM's engineering excellence to drive growth. Our fiscal year 2022 began with further improvements in revenue, gross margin, operating margin and earnings per share. On a geographic basis consistent with prior periods, domestic customers represented approximately 47% of our fiscal Q1 results. Adjusted gross profit was $98 million, or 61.4% of revenue, up 30 basis points sequentially. During fiscal 2022 and beyond, largely as a result of the numerous operational improvements that Steve noted in his prepared remarks, we expect further gross margin improvement, albeit at a slower rate compared to prior periods. Total adjusted operating expense was $49 million, consisting of R&D expense of $31.2 million and SG&A expense of $17.8 million. Total operating expenses were sequentially up by $900,000 from fiscal Q4 2021 driven by anticipated increases in R&D staffing. Over the past few years, we have implemented new processes to assess our R&D investment opportunities and new product initiatives. Adjusted operating income in fiscal Q1 was $49.1 million, up from $46.8 million in fiscal Q4. We expect a combination of top line growth, incremental gross margin improvements and disciplined spending will enable opportunities for modest operating leverage improvements in fiscal 2022. Adjusted net interest expense for fiscal Q1 was $1.2 million, down approximately $100,000 from fiscal Q4. Our cash tax payments were $200,000 for the first quarter, unchanged from fiscal Q4, 2021. After completing our fiscal year end reporting, and updating our tax analysis during our fiscal Q1, we feel it is now appropriate to update our adjusted income tax rate at 3% beginning in our fiscal Q2 and going forward. I would also like to highlight that as of December 31, 2021, we estimate that we have more than $700 million of available U.S. net operating losses. Fiscal Q1, adjusted net income was $45.4 million, compared to $43.3 million in fiscal Q4. As you may know, we have been very focused on inventory management over the past few years and since September 2019, we have reduced our inventory balance by approximately 18% while growing our quarterly revenue by more than 40%. As we have previously noted, our expectation is that cash flow from operations will run at a comparable amount of non-GAAP net income over time. Free cash flow was $29 million for the fiscal quarter down $6.8 million sequentially, mostly due to the increases in working capital as previously noted. Next, I'd like to provide some additional information regarding the December 2021 sale of our less than 10% equity interest in Ampere Computing Holdings a $127.8 million. Our fiscal Q1, 2022 financials reflect a $118.2 million GAAP gain recorded as other income. Cash, cash equivalents and short term investments for fiscal quarter were $477.7 million, up $132.8 million from fiscal Q4, 2021. Another balance sheet item to highlight is that during Q1, based upon the adoption of a new accounting standard, we reclassified $72.2 million associated with our convertible notes from equity to long term debt. During the past fiscal quarter, our net debt decreased from $255 million to $122 million, a decrease of roughly 52%. With this reduction in net debt, along with the improvement in trailing 12 month EBITDA, we exit the first quarter with a net leverage ratio of around 1.0 times and gross leverage of 2.9 times, down from 1.7 and 3.1 respectively in Q4. Before turning it back to Steve, I'd like to highlight that MACOM team has continued to reach out to our stockholders and other stakeholders of the company to discuss the business, including environmental, social and corporate governance or ESGIs. In Q2 when compared to Q1, we expect revenue for industrial and defense and data center to be flat to slightly up and telecom to grow by approximately 5%. Our strategy is to further establish a diverse portfolio of products, customers and end markets. I guess the major question here is when you guys laid out kind of the shape of the year heading into this year, you’ve talked about a data center business that would grow high single digits to low double digits. You're guiding the datacenter business up slightly, flat to up slightly. So for today, certainly we could up date everybody to say that we are still on plan to hit at least 10% year-over-year growth for the company. Second, I would just highlight that there's really no changes to our outlook in Industrial and Defense that end market which is our largest market. And so, as we look into the rest of the year, we think telecom's going to be in the mid-teens or slightly better and we think the data center will more likely be in the low-to-mid single digits per growth year-over-year. And that will be offset by some different areas of growth and most of which are PAM-4 related, including 200G, our short reach applications, 400G DR4 and FR4 applications and then some of the work we're for many risers within the data center. And then on top of that, the only other thing I'll highlight for the data center, some of our new products and some of our existing products will have strong acceleration in Q4. So I hope that's helpful, that's sort of the 10,000 point of view of what we see going on for the balance of the year. Of course, we are still excited about lot of the different products, development activities that we have within the data center including we're starting to see traction with our lasers especially for long reach applications and so that's exciting for us. When you're looking about the group, you're seeing a lot of people talking about increased supply pressure, freight cost, et cetera. What did you build in to your guidance in terms of cautionary measures to protect against those risks and then can you just describe the supply demand environment and what you're seeing is it improving, is it worsening and just highlight areas where you can highlight importance, I guess. We tried to factor in all the things that you've talked about including supply chain risk, potential shortages of components, an area that is a little bit of wildcard of course. It's some of our customers are having problems supplying components for their builds, often times what they will do is delay, the production which of course has an impact in companies like MACOM. I would say generally speaking, the environment has not really changed for MACOM in the last three months. Your line is now open. Steve, maybe it's just my perception but I thought the laser business would probably start to ramp a little bit quicker or I was thinking maybe will ramp this year. Three maybe four years ago, all of our business was NRZ business and today we're approaching about 50% of our data center revenue being PAM4 related. Your line is now open. Thank you, for the question. And as we've talked about in the past on prior calls, from taking a big step back from 2010 to 2020, there was fiscal years MACOM had a CAGR of about a 7.5%. And when we do that, we end up at approximately a $1 billion of revenue in our fiscal year 2025. Now, we had of course as everybody knows a very strong fiscal year '20 and '21. In fact, in fiscal year '21, we had 14.5% year-over-year growth, which meant that we exited fiscal year '20 at a very high run rate because the sequential growth during fiscal year '21 was between 1% and 2%. And if you look at our sequential growth today and what we're forecasting for the back half of the year, Q1 and Q2 it’s around north of 2% and then in the back half of the year we expect sequential growth greater than 4%. And as we've talked about some of the accomplishments and we look at our business today, you -- I can tell you that this past quarter we had record bookings within on our pure carbide line which certainly supports our growth strategy for RF power. I also recently announced actually back in November, we re-org'd our China organization, we promoted one of our senior executives to be present and to make on China to emphasize the focus we have on those markets. So our growth is more than just coming from telecom, its coming from Industrial and Defense. And of course, it's the common markets that we talked about 5G PON, a variety of wireless applications, SATCOM. We believe over time, those two markets will outgrow the data center on an absolute growth basis. My gross margin growth, is that likely to come from tweaks in the business or to a greater degree from the new products that you're getting into. So, the -- you're correct, we've done the teams done a lot of work to improve the gross margins of the portfolio and that work continues. As we think about the future, we'll now start turning towards more of a dependency on the new products and their contribution to the gross margin improvement. And so, let's say over the next two to three years, the majority of the improvements will come from product and technology and making sure that we're more differentiated and our price points have more value where we can achieve higher gross margins. And just to build on that, Harsh, as I had mentioned in my prepared remarks, there is a fairly robust process that we have from an R&D perspective in terms of analyzing those projects to make sure they're coming out with higher margins. And then to your other point, there are things that we can continue to do within the business to improve the gross margins over time. And as we continue to expand our product launches as well as the SAM that Steve had mentioned, that additional revenue will also provide additional margin expansion as we go forward. Your line is now open. And the first question, I just wanted to go through a bit of the expectations for the second half of the fiscal year based on the color you've provided both of the overall revenue up 10% and the different segment commentary. Based on what you said, it would seem that the I&D would be kind of up slightly on a quarterly basis in the second half of the fiscal year. But then, telecom to get to that kind of a mid-teens growth it would see rest of it down on a quarterly basis and then data center as you said would be up pretty strongly in the second half of the fiscal year. Yes, based on the math that you're describing, that would get us to the things that we had described. But also as Steve had mentioned, you're not -- it isn’t good to be a perfect answer, the markets do continue to change and evolve but that will be our view point. As a follow-up, just about that that backlog as you go to the second half of the year. And getting some of that backend capacity you've talked about there, is that the main constraint or kind of risk factor on getting to those numbers as you go to the second half of the year. I think as I highlighted, we've had five consecutive quarters of greater the one book-to-bill a data center backlog has been growing and we are constrained in some product areas I talked about related to different package technologies. But generally speaking, as we again as we talked about making two or three quarter forecast is not as scientific as we would want. Our small market in Q1, data center, which is about 18% of our revenue is the most volatile market. But generally speaking, if we look at the growth, I&D is going to have a very good year this year, telecom is going to be as I highlighted in the mid-teens for the full year. And then the data center if we can hit mid-single digit, we'll be very pleased with the way we set ourselves up for our fiscal year '23. I just want to come touch base maybe in terms of the order trends you're seeing and how those are maybe track, obviously the book-to-bills have been good. And so, our customers and our sales force has been working very closely to make sure that we understand their demands and we tell our customers the best way to secure supply is to place orders so that we can instigate the planning. We have seen, I will say we have been messaged by some customers and they're not getting all the components they need to run production and that has an attenuating effect on our plans. And so, we -- I would say that’s probably the only sort of new dynamics that's at play right now. But again I think these are short-term issues, they're manageable and over the long-term, I think we're setting ourselves up for success. We have some end markets where the channel inventory is empty or very, very low and then we have other markets where the customers are in low and or medium volume production and they do a very good job of planning. And so, that allow -- like gives us comfort that if there's going to be changes in the future, we can plan for that because as you know our manufacturing cycle times in some instances are longer than six months. Your line is now open. You would be expanding capacity in New Hampshire, which there wasn’t much commentary on this call  90 days ago. And if we roll the map even on our last five quarters where we had greater than one book-to-bill, we -- it shows and you compare that to what we actually ship, we've actually generated over a $120 million of backlog over the past five quarters. You mentioned New Hampshire and the manufacturing site we have there in the doubling of the space, so I would just highlight that that's one example of an area that we're expanding. We're expanding in all different parts of our business including the business units, operations, planning, logistics, design engineering, and of course production. Now with that said, we like the fab-less model and we have a significant portion of our business that we run through other people's fabs. The higher growth projection you have in telecom, is this mainly Fronthaul lasers or is this also coming from PON. Thank you, for the question. So the good news is our growth in telecom is broad based, not just based on the two items that you talked about. And as we sit here today, we don’t view ourselves as having any kind of excess cash, we're still in a net debt position call. As we've mentioned, we've been making investments internally in the business over the past year and plan to continue doing that. Your line is now open. And then Steve, I guess like a couple of questions on the data center. And so we're working with some key customers to develop solutions to effectively remove the DSP function, let's say from the pluggable module and have that functionality brought into the . We have close relationships with some major companies that are looking at effectively there's different words for it, you can call it direct detector, direct drive, but the goal would be to eliminate the DSP in certain applications. And so the reason why I mentioned this when we talked about some of those legacy platforms like 100G SR4 or 25G, that's our AOCs, things will migrate to newer technologies and we are involved in those. So it's about portfolio management, making sure that we're engaged with next generation platforms. In closing, we'd like to thank our customers, suppliers, business partners and employees for their continued support."
}