{
    "symbol": "MTSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-28 15:09:05",
    "content": " Industrial and Defense was $75.5 million, Telecom was $62 million and Data Center was $34.8 million I&D revenue was up 12.5% sequentially while Telecom and Data Center were relatively flat following the strong Q2. MACOM has a very diverse product portfolio to address the Telecom markets, including our Monolithic Microwave Integrated Circuits, or MMIC product line, coherent drivers and TIAs, small signal RF products, RF power amplifiers, high performance analog ICs and lasers to name a few product lines. Your line is open. We think the strongest market on a full year comparison will be our Telecom business, again, about 29% year-over-year growth; Industrial and Defense mid-single digits around 5% year-over-year growth; and Data Center right now is trending to low-single digit or flat performance on a year-over-year basis. Your line is open. We did announce about a year ago that there would be about a $15 million decrease in our Data Center business due to legacy programs falling off, which included platforms like PowerPC and some of our networking products that were legacy AMCC product lines. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And so as weâ\u0080\u0099ve been for the last few years reestablishing and building new relationships with the major agencies that will help us as these chip dollars start to flow, because theyâ\u0080\u0099re going to be looking to not only build out and improve and expanding manufacturing, but theyâ\u0080\u0099re also going to be providing about $13 billion for semiconductor R&D, and we want to be a major beneficiary of those funds. Your line is open. And you've also talked about a lot of the opportunities that you have in new markets, you're being kind of niche, but it seems like with the potential from the CHIPS Act that this might allow you to go after, a little bit bigger, bigger markets here, and you just described I may have missed some of the, the detail here about, markets where the revenues are well under the hundreds of millions of dollars."
}