{
    "symbol": "MTSI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-03 21:23:02",
    "content": " For the full fiscal year ending September 30, 2022, revenue was $675 million and adjusted EPS was $2.82 per diluted share. fiscal Q4 revenue was generally as expected, with Industrial and Defense at $78.5 million, Telecom at $62 million and Data Center at $37.6 million. As we focus on fiscal year 2023, our priorities include taking market share in gallium arsenide and GaN on silicon carbide mimics, diversifying our high-performance analog IC business, maintaining our leadership position in coherent IT solutions for Telecom and Data Center markets, continuing to gain content and market share in 10G, XGS PON and other broadband access solutions for North American and European fiber-to-the-home markets and upgrade cycles. Second, we continue to expand our margins with our adjusted gross margin for the full fiscal year 2022 at 62%, up 240 basis points from 59.6% in fiscal 2021. Third, our fiscal year 2022 adjusted net income was $201 million compared to $152 million in fiscal year 2021. And fiscal year 2022 adjusted EPS was $2.82 compared to $2.15 in 2021, a more than 30% improvement. Revenue for the fiscal quarter was $178.1 million, up 3.4% sequentially based on modest growth from our data center and I&D markets. Our Q4 completed another year of double-digit growth for MACOM with fiscal year 2022 revenue at $675 million, up from $607 million in fiscal 2021. On a geographic basis, revenue from U.S. domestic customers represented approximately 50% of our fiscal Q4 results and 47% for fiscal year 2022, up from 46% in both fiscal Q4 2021 and fiscal year 2021. Adjusted gross profit for fiscal Q4 was $111.5 million or 62.6% of revenue, up 40 basis points sequentially. Fiscal year 2022 adjusted operating income was $211 million compared to $170.3 million for fiscal 2021, representing a 24% year-over-year increase, highlighting the operating leverage in our business. Fiscal year 2022 adjusted net interest expense was $2.6 million, down from $11 million in 2021. Our net cash tax payments were approximately $400,000 for the fourth quarter and $2.2 million for fiscal year 2022. For reference, our GAAP net income was $38 million in our prior fiscal year 2021 and $444 (sic)  million for our fiscal year ended September 2022, inclusive of the $200 million benefit from the tax adjustment I just noted and a $118 million gain associated with the Q1 sale of an equity interest. Cash, cash equivalents and short-term investments for the fourth fiscal quarter were $586.5 million, up $50.2 million sequentially and up $242 million or 70% from the same quarter in the prior year. And just to remind everybody, we had forecasted at the beginning of fiscal '22 that there would be about a $15 million drop in legacy business within the Data Center market."
}