{
    "symbol": "GILD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 21:15:14",
    "content": " Before we get started, let me remind you that we will be making forward-looking statements, including those related to the impact of the COVID-19 pandemic on Gilead's business, financial condition and results of operations, plans and expectations with respect to products, product candidates, corporate strategy, business and operations, financial projections and the use of capital, and 2022 financial guidance, all of which involve certain assumptions, risks and uncertainties that are beyond our control and could cause actual results to differ materially from these statements. We had a solid start to the year with total product sales, excluding Veklury, of USD 5 billion for the quarter, up 2% year-over-year driven by cell therapy, Trodelvy and HIV, and offset in part by HCV pricing dynamics. Descovy sales in the first quarter were $374 million, up 4% year-over-year, driven by continued PrEP market growth and partially offset by generic competition in switches to newer treatment medicines such as Biktarvy. Biktarvy sales of $2.2 billion in the first quarter were up 18% year-over-year driven by U.S. market growth, and notably, continued share gains in both the U.S. and in Europe. And on behalf of Christi and the Kite team, cell therapy sales for the first quarter of 2022 were $274 million, up 43% year-over-year and 15% sequentially. Overall, we're excited by magrolimab's potential to be the first new treatment for first-line high-risk MDS patients in 15 years and have completed patient enrollment for the first interim analysis that we expect to share in early 2023. While no final decisions have been made pending discussions with regulatory authorities, as a result of the data, we have taken a $2.7 billion impairment to reflect the likelihood of a delayed launch of Trodelvy for third-line-plus HR-positive/HER2-negative breast cancer in the United States as well as Europe and the possibility of a reduced market share in late-line patients given the emerging competitive landscape. Total product sales were $6.5 billion, up 3% year-over-year, with growth in cell therapy, Veklury, Trodelvy and HIV, offset in part by lower HCV revenue."
}