{
    "symbol": "GILD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 20:33:05",
    "content": " Turning to slide 7, we had a very strong quarter with total product sales excluding Veklury of $6.1 billion, up 11% yearâ\u0080\u0090overâ\u0080\u0090year, or 15% excluding FX and the residual impact of the HIV LOEs, with growth in each of our core franchise areas, and notable strength in HIV and oncology. Third quarter Biktarvy sales were $2.8 billion, up 22% yearâ\u0080\u0090overâ\u0080\u0090year, driven by higher demand in both the U.S. and Europe, and favorable pricing dynamics. Once again, Biktarvy continues to command a leading position in the treatment of HIV, with another record quarter growing to 45% market share in the U.S., up 4 percentage points yearâ\u0080\u0090overâ\u0080\u0090year. With these factors in mind, and also allowing for further FX impact, we expect fourth quarter HIV sales to be roughly flat on a sequential basis, noting that full year 2022 HIV growth is therefore expected to be approximately 4%, or 7% excluding the LOEs and FX headwinds year to date. HCV sales for the third quarter were $524 million, up 22% yearâ\u0080\u0090overâ\u0080\u0090year and 17% sequentially, primarily due to the favorable resolution of a prior year rebate claim in Europe and other favorable pricing dynamics in the U.S. Despite the trend in patients starts, weâ\u0080\u0099re pleased to maintain HCV market share of more than 50% in both the U.S. and Europe, and third quarter share increased on a yearâ\u0080\u0090overâ\u0080\u0090year basis. Now onto slide 14, and on behalf of Christi and the Kite team, Iâ\u0080\u0099m pleased to share that Cell Therapy sales in the third quarter were $398 million, up 79% yearâ\u0080\u0090overâ\u0080\u0090year and up 8% sequentially. For the quarter, Yescarta sales of $317 million were up 81% yearâ\u0080\u0090overâ\u0080\u0090year and 8% quarterâ\u0080\u0090overâ\u0080\u0090 quarter, driven by a continued successful launch in secondâ\u0080\u0090line LBCL in the U.S. and partially offset by FX headwinds in Europe. On slide 27, we take a quick look at our performance yearâ\u0080\u0090toâ\u0080\u0090date, which shows total product sales excluding Veklury of $16.7 billion, up 7% yearâ\u0080\u0090overâ\u0080\u0090year. With that, Iâ\u0080\u0099ll invite the operator to open the Q&A. With that, Iâ\u0080\u0099ll invite the operator to open the Q&A."
}