{
    "symbol": "GILD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 19:58:07",
    "content": " We had a very strong second quarter with total product sales excluding Veklury of $5.7 billion, up 7% year-over-year, driven by HIV, cell therapy and Trodelvy and offset in part by HCV. Sequentially, total product sales excluding Veklury were up 14%, driven by the seasonal pricing and inventory dynamics we see coming out of the first quarter of every year, primarily in our HIV business, as well as higher demand across our total portfolio. On Slide 8, HIV sales were up 7% year-over-year to $4.2 billion, primarily driven by channel mix associated with lower government utilization, leading to a higher average realized price as well as higher demand for both treatment and PrEP. Quarterâ\u0080\u0090overâ\u0080\u0090quarter, HIV sales were up 14%, due to demand and channel mix leading to higher average realized price as well as the favorable seasonal inventory dynamics that we typically see in the second quarter relative to the first. Biktarvyâ\u0080\u0099s market share in the U.S. grew from 40% in Q2 of last year to 44% in the second quarter of 2022, and continues -- by a wide margin -- to be the leading treatment for HIV, as well as the fastest growing. Cell therapy sales for the second quarter were $368 million, up 68% year-over-year and 34% sequentially, driven by a very strong U.S. second-line launch for Yescarta in relapsed or refractory LBCL, which exceeded our expectations and continued strong growth in third-line plus Yescarta. This follows the presentation of 5-year ZUMA-1 data at last year's American Society of Hematology meeting and more recently, our second-line approval in the U.S. For the quarter overall, Yescarta sales of $295 million were up 66% year-over-year and 40% sequentially. Sales for the quarter were $73 million, up 78% year-over-year and 16% sequentially, driven by continued demand and expansion into new geographies for relapsed/refractory mental cell lymphoma as well as uptake in adult acute lymphoblastic leukemia in the U.S. Christi is available for Q&A later on the call. We also highlighted positive PFS and quality-of-life data from our Phase 3 TROPiCS-02 study, demonstrating a statistically significant and clinically meaningful 34% reduction in the risk of disease progression or death in light-line, endocrine-resistant patients with HR-positive/HER2-negative metastatic breast cancer, who had received a median of three prior lines of treatment in the metastatic setting after having failed hormone therapy. Looking forward to the second half of this year, we expect to begin enrolling patients for the Phase 3 EVOKEâ\u0080\u009003 or KEYNOTEâ\u0080\u0090D46 study in firstâ\u0080\u0090line nonâ\u0080\u0090small cell lung cancer with PDâ\u0080\u0090L1 expression level of greater than equal to 50%, in collaboration with our partners at Merck. The key clinical milestones in the second half include: an update on our regulatory discussions for Trodelvy for late line HR-positive/HER2â\u0080\u0090negative patients in the US; a number of potential regulatory decisions, including for lenacapavir, Yescarta, and Tecartus; at least six more trial initiations spanning Trodelvy, cell therapy and domvanalimab; as well as several data updates with our partner Arcus, including Phase 2 data from ARCâ\u0080\u00907. Non-GAAP R&D excluding acquired IP R&D expenses, such as milestones and upfront payments, was $1.1 billion, up 6% year-over-year, primarily due to increased investment in development and timing of clinical trial activities, primarily for our oncology business. Non-GAAP SG&A was $1.3 billion, up 13% year-over-year, primarily due to increased promotional and marketing activities, including for Trodelvy as well as higher corporate expenses, including IT investments and grants. In addition to the impact in the first half, we expect continued FX headwinds in the second half, impacting total product sales by approximately $200 million in the rest of the year, compared to our initial February guidance For revenues, we now expect total product sales of $24.5 billion to $25 billion compared to our previous range of $23.8 billion to $24.3 billion. Excluding Veklury, we expect our total product sales to be $22 billion to $22.5 billion, representing growth of 3% to 5% year-over-year and compared to our prior range of $21.8 billion to $22.3 billion."
}