{
    "symbol": "STEP",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-10 22:06:07",
    "content": " Fee-related earnings for the quarter was $23.1 million, an increase of 27% as compared to the first fiscal quarter of the previous year. As Seth mentioned, we generated $40.5 million in adjusted net income for the quarter or $0.41 per share up 162% from the prior year's first quarter. We also expanded FRE margins by 100 basis points year-over-year and by 200 basis points from the fourth quarter of fiscal 2021, which positively contributed to the growth in fee-related earnings. Net realized performance-related fees, which include incentive fees were a combined $33 million in the quarter, our highest ever, up more than fourfold versus the first quarter of fiscal 2021 and double the previous peak of $16 million in the third quarter of fiscal 2021. While these sources of income tend to be less predictable than fee-related earnings, our performance fees have trended steadily up over the last two years and our accrued carry balance of $1.1 billion is more than three times the size it was a year ago, a positive signal for future performance fees. As of quarter end, we had $13.6 billion of undeployed fee-earning capital, which we anticipate will generate management fees as capital is deployed into the coming years. For the quarter, we generated fee-related earnings of $23.1 million, pre-tax adjusted net income of $52.3 million, adjusted net income of $40.5 million and ANI per share of $0.41. Gross realized performance fees, were up 440% compared to the first quarter of fiscal 2021 and all the longer-term trend shows that such fees have grown at a CAGR of 47%, since fiscal 2018. Fee related earnings of $23 million for the quarter were up 27%, relative to the same quarter a year ago. For the last 12 months, we generated fee related earnings of $94 million, representing a CAGR of 53% relative to fiscal 2018. For the trailing 12 months, we generated an ANI of $110 million, representing a longer term CAGR of 42% driven by FRE growth and strong net performance fees. On the bottom chart, our own investment portfolio ended the quarter at $83 million, up 11% from the prior quarter and up 64% over the prior year, reflecting both market appreciation and net contributions. And I think that highlights a bit of the lumpiness that can take place from quarter-to-quarter, which is really one of the reasons that point to the longer-term trends, whether you're looking at fee-earning AUM or management advisory fees or fee-related earnings, when you look at it on a year-over-year basis continue to grow at mid-20% to high 20% rates."
}