{
    "symbol": "STEP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-26 21:23:05",
    "content": " Actual results for future periods may differ materially from those expressed or implied by these forward-looking statements due to a number of risks, or other factors that are described in the risk factors section of Stepstone’s most recent 10-K. We generated fee related earnings of $35.9 million, adjusted net income of $43.7 million and adjusted net income per share of $0.38. We are encouraged by both the level of growth and the balance of contributions between asset classes with over 60% of the year's organic growth coming from a combination of infrastructure, real estate and private debt and 40% coming from private equity, including venture capital. We generated more than $4 billion of organic fee-earning asset growth for the full year, and we've been quite active to start the new fiscal year with several final and interim fund closings in the first 2 months of the quarter alone. In total, we have closed on more than $2.5 billion of commingled funds since March 31, which you will see in our next fiscal quarter's results split between our fee-earning and undeployed fee-earning asset balances. We generated $43.7 million in adjusted net income for the quarter or $0.38 per share, up 52% from the prior fiscal year's fourth quarter on a per share basis. We generated fee-related earnings of $35.9 million, up 71% from the prior year quarter as we produced strong organic growth and benefited from the Greenspring acquisition. Looking over the last 12 months and excluding the impact from acquisitions, we have organically grown fee-earning assets by approximately $12 billion, our largest year ever of net fee-earning asset growth. Slide 9 shows the evolution of our management and advisory fees, where we are generating $3.55 per share in revenues over the last 12 months, representing a 25% annual growth rate since fiscal year 2018. Gross realized performance and incentive fees were $32.9 million for the quarter, which were up 31% year-over-year, but are down 51% sequentially from the record performance fees in our fiscal third quarter. For the full year, we generated over $120 million of net realized performance and incentive fees, which is our highest year ever, driven by strong underlying investment performance and a very supportive environment for exits and realizations through most of the fiscal year. And so on the fundraising side, look, you heard from us that during this past quarter as well as in the quarter-to-date period here at the start of the new fiscal year, we have continued to see quite a bit of momentum in fundraising with the final close on our venture secondaries fund as well as the interim closings on our direct opportunities and micro funds. As we think about other strategies, we've referenced this in the past, but you continued build out across certain other asset classes as we think about the evolving for example, co-investment in secondaries markets in areas like infrastructure, our private debt business, continually looking to expand their deal flow and really either diversify that deal flow or offer clients the ability to generate different risk return."
}