{
    "symbol": "RNST",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 13:49:21",
    "content": " We also successfully closed the acquisition of Southeastern Commercial Finance, an asset-based lending company headquartered in Birmingham, Alabama, which added $28 million in loans on the acquisition date. The first quarter was another strong quarter in terms of production, with $863 million in new loan production and $588 million of advances driving net growth in nearly all categories. Net interest income declined $1.8 million quarter-over-quarter primarily due to two fewer days of interest income recognition, increased interest income from our securities portfolio helped offset the full quarter of interest expense on our sub debt issuance from November of 2021. And just on the salaries and employee benefits, I would expect that as far as the merit increases and some of the wage inflation that we're seeing, I would expect that to increase upwards of $2 million to $3 million as we go throughout -- on a quarterly run rate as we go throughout the rest of the year. So, as we look, our expenses just using it as a baseline, we expect expenses to be up maybe in that $2 million to $3 million range on a quarterly basis based on the $94 million run rate in Q1. That was up from $284 million in the prior quarter and $240 million in the prior year, which kind of plays into what we're seeing in production because the pipeline does reflect what we have experienced. If you adjust for Southeastern Commercial Finance, which came into the company in the quarter, that would bring that -- which you take out about $28 million, as we mentioned, that would bring that down to $863 million for the quarter. And then the remaining 28% in our corporate banking group, larger C&I, commercial real estate, ABL, equipment finance, senior housing all to say we continue from a production standpoint, not only geographically, but hitting on many different cylinders relative to our product types and product lines, which comes to -- part of your question was payoffs and we did see that moderate quite a bit in Q1. But albeit payoffs moderated production, as I described, continued and continue to increase quite well, which resulted in our net growth of $293 million or about 12% annualized."
}