{
    "symbol": "PRI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 15:46:07",
    "content": " Despite significant market volatility and economic uncertainty, our clients continue to invest, contributing $10 billion in new sales during 2022, and making this our second largest sales year, exceeding prepandemic levels by more than 30%. During the fourth quarter of 2022, more than 11,000 individuals obtained a new life insurance license, which represents a 20% increase compared to the same period in the prior year. We expect first quarter sales to grow around 1% versus an adjusted policy count of approximately $83,000 in the prior year period. Sales were $2.1 billion during the fourth quarter, declining 31% from a very strong fourth quarter in the prior year and ending client asset values declined 14% year-over-year to about $84 billion. Taking into consideration the current market conditions and the very strong first quarter sales last year, we believe year-over-year ISP sales to be down as much as 25% in the first quarter of 2023. Operating revenues of $430 million during the quarter grew 5% year-over-year, primarily driven by 6% growth in adjusted direct premiums, while pretax income grew 23%. Benefits and claims were a significant driver of Term Life pretax income growth, outpacing revenue fourth quarter due to weaker seasonal persistency was 56.6% versus 63% in the prior year period. The quarter also included a $4 million reduction to reserves, reflecting the positive impact of rising interest rates when we locked in new business assumptions during the current quarter for policies issued in 2022. The fourth quarter 2022 DAC amortization ratio of 1.6% reflected weaker seasonal persistency, while the prior year period ratio of 13.1% benefited from the tailwind of lower lapse rates during the pandemic. Operating revenues of $198 million and pretax income of $57 million declined 20% and 19%, respectively, driven by 35% lower sales-based revenue generating sales and 12% lower average client asset value. Senior Health's fourth quarter operating revenues were $28 million versus $38 million in the prior year period, while adjusted pretax income was over $4 million, versus adjusted pretax income attributable to Primerica of $0.4 million last year. Liquidity at the holding company remains strong, with invested assets and cash of $309 million and Primerica Life statutory risk-based capital ratio is estimated to be 475% as of year-end."
}