{
    "symbol": "WAT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 12:59:06",
    "content": " For a detailed discussion of some of the risks and contingencies that could cause our actual performance to differ significantly from our present expectations, see the risk factors included in our annual report on Form 10-K for the fiscal year ended December 31, 2021, in Part 1 under the caption Risk Factors and in our most recent quarterly report on Form 10-Q for the quarter ended April 02, 2022 in Part 1A under the caption Risk Factors, both of which are on file with the SEC as well as the cautionary language included in this morning's press release. In the second quarter, we continued to deliver excellent results, led by instrument growth of 12% with continued broad-based strength across our end markets and geographies. Now moving on to Slide 4; in the second quarter, revenue grew 5% as reported and 10% on a constant currency basis with broad strength across our end markets and geographies, as well as in both instruments and recurring revenues. In academic and government, after seeing a slower recovery than our other end markets last year, customer spending continued to be more active during the quarter with mid-teens growth for the quarter, led by strength in China, India and the Americas. Our product vitality index has grown 300 basis points versus the second quarter of last year to 15% as sales of these products have quickly ramped, with launch excellence and the impact of innovation driving strong market uptake. At current rates, a negative currency translation is expected to subtract approximately 5 percentage points, resulting in full year reported sales growth guidance of 4.5% to 5.5%. At today's rates, currency translation is expected to subtract approximately 6 percentage points, resulting in third quarter reported sales growth guidance of 2% to 4%. Demand has remained strong across our end markets as we've continued to capture growth opportunities in both large and small molecule applications, food and environmental testing and battery material analysis, which each have long-term durable growth opportunities that we're well positioned for. To reflect our strength, we're raising our full year constant currency sales growth from -- sales growth guidance from 7.5% to 9% to 9.5% to 10.5%. Your line is open. And we've just guided to a double-digit growth for the full year after printing a 6% -- 16% growth for last year and then 16% in Q1, first half of the year in the teens. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}