{
    "symbol": "TM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-11 06:54:08",
    "content": " Third, marketing efforts increased operating income by JPY 860 billion, largely due to the increase in sales volume and improved earnings in the financial services business. As for electrified vehicles, by improving our product line-up to better meet customers’ needs in each region, sales are expected to be 3,70,000 million units, which is 113.6% of the previous fiscal year. First of all with respect to the assessment of the financial results of the fiscal year just ended the sales revenue is JPY 31 trillion and the operating income is around JPY 3 trillion, both record high levels. The second question is as follows, due to the soaring raw materials prices, and cost improvement efforts, according to the information published in the period fiscal year ended the – end October, soaring raw materials prices were JPY 640 billion – JPY 1.55 trillion. With respect to the good results, so financial results of the fiscal year ending in March '22, that will be explained by Mr. Kon, EVP, assessment of that and for the fiscal year just entered as the raw materials prices soared, what are we going to do with the cost improvement efforts, Mr. Yamamoto will respond to that. So from those customers, even if the raw materials prices are soared and increased, trying to increase the prices charged to those customers who repeat them, a very difficult thing to do and as Kon mentioned earlier, for products we focus on regional differences and different product lines. And therefore, even if inflation has set in to increase price we'll simply cannot satisfy those customer needs and expectations including that aspect and as Masahiko Maeda mentioned, we will continue to improve cost not on a single year basis, but also over many years so that we can meet customers expectations as much as possible. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much."
}