{
    "symbol": "PL",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-12 21:26:04",
    "content": " The team at NASA Harvest, NASAâ\u0080\u0099s food security and agriculture program recently used the Planet data to develop country-wide assessment of the health of grain in every field across Ukraine and its effect on global supplies. Such analysis is important as Ukraine is a breadbasket of Europe and has important implications for supply chains generally and the poorest countries in particular, since an estimated 40% of grain used by the World Food Program comes from Ukraine. Another example of our data at work in Ukraine is how Maritime AI company Windward, when combining their AI-powered behavioral analytics models with Planetâ\u0080\u0099s daily imagery, found vessels engaging in dark activities and ship-to-ship operations in the Kerch Strait in June as part of what appeared to be the coordinated effort to launder grain allegedly stolen from Ukraine. To this end, we were excited to share in Q2 that Planet was selected as a partner by two companies, SES Government Solutions and Telesat Government Solutions to demonstrate real-time connectivity solutions low earth orbit satellites to other in space communications satellites as a part of the NASA funded Communication Services Project or CSP. The team at NASA Harvest, NASAâ\u0080\u0099s food security and agriculture program recently used the Planet data to develop country-wide assessment of the health of grain in every field across Ukraine and its effect on global supplies. Such analysis is important as Ukraine is a breadbasket of Europe and has important implications for supply chains generally and the poorest countries in particular, since an estimated 40% of grain used by the World Food Program comes from Ukraine. Another example of our data at work in Ukraine is how Maritime AI company Windward, when combining their AI-powered behavioral analytics models with Planetâ\u0080\u0099s daily imagery, found vessels engaging in dark activities and ship-to-ship operations in the Kerch Strait in June as part of what appeared to be the coordinated effort to launder grain allegedly stolen from Ukraine. To this end, we were excited to share in Q2 that Planet was selected as a partner by two companies, SES Government Solutions and Telesat Government Solutions to demonstrate real-time connectivity solutions low earth orbit satellites to other in space communications satellites as a part of the NASA funded Communication Services Project or CSP."
}