{
    "symbol": "RLX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 08:58:03",
    "content": " The new law imposes a consumption tax on manufacturers, importers and/or distributors of e-cigarettes in China, representing another landmark event in the legalization and standardization of China's e-cigarette industries, following the adoption of the e-cigarette mandatory national standards and measures for the administration of e-cigarette earlier this year. With the implementation of new taxation policy, alongside the relevant laws and regulations on e-cigarettes that have been rolled out over the past two years, we can see that China's regulatory framework is becoming clearer, guiding the industry to a new era of healthier development with better oversight and management. Hence supported by our industry-leading technology and research capability, we plan to introduce our new GD products on a rolling basis, as we assess the impact of the new tax regulation on sales, as well as user feedback regarding our product innovation. Amid a complex macro environment, we delivered net revenues of RMB1.0 billion in the third quarter, recording a sequential decrease mainly due to the discontinuation of older products during the transition to national standard, as well as the second quarter's high base resulting from the truck loading of sales in anticipation of that discontinuation of older products. With the application of a 36% consumption tax to e-cigarette manufacturers since November 1, 2022, we expect that the steady rollout of new products and the price hike necessitated by the consumption tax will impact both sales and profitability in the future. And so regarding the recent months sales, we understand that investors and research analysts are concerned about, how consumer demand has changed since we adjust the pricing of our products, to accommodate the change of consumption tax together with the change of our products from older generations to GB  products."
}