{
    "symbol": "RLX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-21 11:40:22",
    "content": " Beginning in the first quarter of 2022, the relevant government authorities in China have issued a series of implementing rules and guiding opinions to strengthen oversight of e-cigarette products and regulate the e-cigarette industry including the administrative measures for e-cigarettes thatâ\u0080\u0099s coming to effect in May and the new national standards that will become effective on October 1, 2022. Furthermore, in the second quarter, we collaborated with Shenzhen Institutes of Advanced Technology and Chinese Academy of Sciences and e-vapor cooling agent inhalation studies which concludes that e-vapor products containing Scope 2, 3 have lower rewarding effects than pure nicotine products, a breakthrough we believe that the court asked to deliver better, safer â\u0080\u0093 for adult smokers. However, we believe that elevated level of revenue in the second quarter was primarily due to frontloading of sales in the downstream value chain in anticipation of the discontinuation of our older products as the industry transition period neared its end in the third quarter. Due to a significant increase in share-based compensation expenses to RMB193.2 million from a positive RMB172.5 million in the same quarter of last year, our operating expenses reached RMB530.9 million in the second quarter of 2022, compared with RMB176.2 â\u0080\u0093 sorry RMB167.2 million in the same period of last year. Specifically, our selling expenses decreased by 2.7% to RMB122.6 million in the second quarter of 2022 from RMB126 million in the same period of 2021, mainly driven by a decrease in salaries, welfare benefits and branding material expenses, while partially offset by an increase in share-based compensation expenses. In addition, we generated a positive cash â\u0080\u0093 operating cash flow of RMB1.4 billion with an increase in the operating cash flow over non-GAAP net income ratio to 228% in the second quarter of 2022 from 100% in the same period of last year. So the last question is on the fourth quarterâ\u0080\u0099s outlook, as we prepared in our opening remarks, our second quarter revenue benefited from the frontloading of sales in the downstream value chain in anticipation of the discontinuation of our older products as the industry transition period neared its end in the third quarter."
}