{
    "symbol": "SD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 14:21:05",
    "content": " I'm proud to report on another strong quarter of results for SandRidge and that the company is actively capitalizing on recent commodity price tailwinds to include expanded focused, high-graded drilling in the core of the Northwest STACK and a continuation of our well reactivation, which will add incremental production this year and in 2023. Also, production from this year's drilling program will begin adding to base levels in the second half of this year and into 2023 as we finish completions on wells drilled in the first half of the year and further drill and complete new wells. As I mentioned previously, we are pleased with the results in the second quarter and have begun to further capitalize on robust commodity prices with high rate of return drilling in the Northwest STACK, continued well reactivations and further strengthened cash flow from our already producing properties in Mid-Con. This substantial owned and integrated infrastructure provides the company both cost and strategic advantages, bolstering asset operating margin to reduce lifting as well as water handling and disposal costs, and combined with other vantages, helped derisk individual well profitability for more than 70% of producing wells down to $40 WTI and $2 Henry Hub. We were able to lower adjusted G&A quarter-over-quarter even with increases in capital activity from $2.2 million or $1.35 per Boe in the prior quarter to $1.8 million or $1.09 per Boe in the second quarter, benefiting from our core values to remain cost disciplined as well as prior initiatives, which have tailored our organization to be fit for purpose. On capital, we are increasing investments to a range of $56 million to $70 million, with over half of the expansion relative to prior guidance coming from additional well reactivations and rod pump conversions and the remainder from additional high rate of return drilling in the Northwest STACK discussed previously. We project that operating cash margin of the program will increase from the first half by nearly $7 per Boe in the second half of this year at the July 25 strip despite inflationary pressures on expenses and costs driven by the combination of strong commodity prices as well as increased production associated with expanding investing, which will continue to bolster production into next year."
}