{
    "symbol": "SD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 14:41:04",
    "content": " The approximate $35 million increase over the quarter was supported by production from our new wells and while reactivation program, as well as strong commodity prices realizations, net of capital expenditures made for inventory drilling and completion activities related to our 2022 capital program. As I mentioned previously, we are pleased with the results in the third quarter and have capitalized on strong commodity prices with high rate of return drilling in the Northwest STACK, continued well reactivations and further strengthened cash flow from our producing properties and Mid-Con. PV-10 a future net discount of cash flows to prove develop oil gas and NGL reserves of these assets is $807 million based on year-end 2021 reserves and assumptions roll forward to October 1, 2022 and using 3Q '22 SEC pricing. The third is to maintain optionality to execute on value-accretive merger and acquisition opportunities that could bring synergies, leverage to the Company's core competencies, complement its portfolios assets, further utilize its approximately $1.6 billion of net operating losses or otherwise yield attractive returns for shareholders. In summary, the Company has 241 million net cash and cash equivalent at quarter end, which represents $6.52 per share of our common stock issued and outstanding, consistent production over the last three quarters with a 25% increase in oil over the last quarter from our Mid-Con producing assets. High graded capital program with infill and development drilling in a core the Northwest STACK and continuation of our well reactivation program, which will economically enhance production deliver strong rates of return, low overhead, top tier just a G&A of $1.22 per Boe no debt in fact negative leverage. Significant free cash flow and a growing net cash position supported by a diverse production profile, flattening expected annual PDP declined to an average of approximately 8% over the next 10 years, multi digit reserve life asset base $1.6 billion in NOL which will shield future free cash flow from federal income taxes."
}