{
    "symbol": "BV",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-07 23:39:04",
    "content": " Looking into fiscal year 2023, I would like to emphasize my conviction that despite the low snowfall, we intend to deliver strong organic growth and margin expansion in both our land and development businesses. Adjusted EBITDA for the quarter was $49 million, significantly above the high end of our guidance range of $44 million, driven by organic growth, pricing benefits as well as continued recovery in our development margins. While we have seen strong top line growth in our business over the last two years, total profitability has been impacted by a number of externally driven factors, including variability in our snow business, historically high inflation rates and most recently, a spike in fuel prices. Moving to Slide 11, total revenue for the first quarter increased by 10.8%, supported by 5.5% total organic growth, maintenance revenues increased by 10.3%, driven by 5.5% organic growth and M&A contributions of $21 million. Turning now to profitability and the details on Slide 12, total adjusted EBITDA for the first quarter was $49 million, up 14% compared to the prior year, and reflected adjusted EBITDA margin expansion of 20 basis points. In the Maintenance segment, adjusted EBITDA of $50.5 million was up 11.5% or approximately $5 million from the prior year, and adjusted EBITDA margins expanded by 20 basis points. For the full year 2023, as Andrew mentioned, despite the low snowfall, we intend to deliver strong organic growth and margin expansion in both our land and development business. Your line is now open. Your line is now open. Your line is now open. These landscaping projects are going to happen, and we're very confident that 10% plus organic growth in the back half of the year will happen, which will give us kind of that mid to high single-digit total organic growth for development in the fiscal '23. Your line is now open. Your line is now open."
}