{
    "symbol": "BRDS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 20:03:11",
    "content": " I will begin with a few highlights on our first half performance, including an update on our path to profitability, and then Shane and Yibo will review our Q2 operational and financial performance in more detail before we open the call up for questions For the first half of 2022, we delivered record rides and revenues, representing increases of 39% and 34%, respectively, off of a strong rebound in both metrics in the first half of 2021, while Ride Profit Margin before Vehicle Depreciation reached 48%, up from 45% a year ago. Over the past two years, weâ\u0080\u0099ve experienced dramatic shifts in consumer behavior patterns and despite so, our first half 2022 Sharing business revenues have nearly doubled compared to the first half of 2019, representing a compounded annual growth rate of 26%, while Sharing gross margin has turned from a loss of 159% to a positive 22%, a significant win for our core business with anticipated upside ahead. As previously mentioned, second quarter Ride Profit Margin before Vehicle Depreciation of our Sharing business was 53% compared to 49% a year ago driven by further progress on fleet manager revenue share. Adjusted Operating Expenses, which excludes $44 million of stock-based compensation expense, $112 million of goodwill impairment, $104 million of impairment related charges, and certain other non-cash, non-recurring or non-core expenses, increased 43% year-over-year reflecting higher expenses related to an expanded operating footprint as well as operating as a public company, in addition to $4 million of bad debt expense. We continue to expect core Sharing gross profit margins to trend into the 20s for the full year, including the expectation for trends to meaningfully increase for the balance of the year owing to our renewed focus on our core Sharing business, optimizing asset utilization and profit per vehicle, the ongoing expansion of our Fleet Manager operating model and the mix shift benefit from increased utilization of our newer Bird 3 vehicles."
}