{
    "symbol": "BRDS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 21:58:05",
    "content": " Lastly, by continuing to improve our inventory management products, investing in new methods, tools and training for repair and refurbishment, federal aligning our fleet manager partners profiles and incentives and rolling out ever more efficient vehicles, for instance, with swappable batteries and better tracking devices, we should expect to see not only a higher percentage of our fleet out on the road at any given time, but also continue to extend the useful average life of our vehicles. Earlier this year, we announced our profitability focus strategy to evolve our business to be self funding, including one, focusing on our profitable core sharing business; two, adjusting our city footprint to focus on our higher margin markets; and three, streamlining our fixed cost structure. Along with our market footprint adjustments, we are taking additional cost savings actions and expect to bring our annualized adjusted operating expense run rate to $120 million to $130 million, reducing central costs by 40% to 50% from Q2. Q3 adjusted operating expenses increased 9% year-over-year to $40 million, lower than the 19% increase in revenues and decreased nearly 30% from $56 million in Q2, achieving our annualized run rate cost savings of $80 million. Now as a result of the two accounting changes I mentioned earlier, we're withdrawing our previous fiscal year 2022 revenue guidance of $275 million to $325 million. And over time, whether we do it one year, two year, et cetera, you look at data and you start realizing that we have $67 million wallet balance here in the U.S. And if the probability suggests that a portion of it will never be touched, that's what we look at what we will call a -- what I called a one-time true up to our revenue. It's a little early for me to say what that number is, because that's something that we're still working with our auditors, but I would say high level, Tom, industry average is that breakage revenues are somewhere in the 5 -- I would say maybe 5% to 8% range on a go-forward basis."
}