{
    "symbol": "BDX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-03 13:33:16",
    "content": " As expected, in comparison to the prior year, COVID-only testing revenues declined, driven by lower antigen test pricing and volumes and a number of new entrants to the market with over 40 EUAs now granted in the U.S.  We have also continued to execute our cash flow initiatives, and we delivered strong operating cash flow of approximately $700 million. In addition to our derisked growth profile, we're also confident in our ability to improve our gross margins given the strong progress we've made to date through focused execution against our detailed plans to offset inflationary pressures and deliver cost improvements. We delivered $5 billion in revenue in the first quarter comprised of $4.8 billion in base business revenues, which had strong growth of 8.3%, and 7.8% organic, which excludes the impact of acquisitions. Excluding COVID-only testing, Life Sciences base revenues grew 17.2%, with licensing revenue in IDS contributing about 400 basis points to the segment's base growth and about 100 basis points to the total company based revenue growth. We remain on track to deliver our full year base margin goals, with our base margin performance in Q1 ahead of our expectations for the quarter and also above our full year base margin expectations, due to our ability to realize some of our inflation mitigation and pricing initiatives sooner than we previously anticipated. In addition, our Q1 base business operating margin also included a benefit of about 40 basis points from licensing revenues in Life Sciences that was included in our full year plan. As we look forward, and as reflected in our FY '22 guidance, we are well positioned for growth with excellent momentum in our base business, increased investments in our innovation pipeline, tuck-in M&A momentum, strong progress executing our balance sheet and cash flow initiatives and clear visibility to meaningful margin improvement. As you noted, there was also a strong execution against our margin enhancement objectives, actually realizing benefit earlier in some areas, which will help us going forward because certainly we're seeing continued market-driven supply and inflation pressure as you look out into the back end of the year."
}