{
    "symbol": "BDX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-04 11:40:04",
    "content": " Our results continue to demonstrate the durability of BD's performance even during an uncertain market environment, with year-to-date base business growth of 9.6%. This is evident in our year-to-date results and the proof points of our performance, which include: one, a reliable and strengthened growth profile; two, our reshaped innovation and M&A strategy; three, an improving margin profile; four, disciplined capital deployment; and five, our continued execution during uncertain times. As a result of the team's efforts, we expect continued strength in China in Q4 and for the full fiscal year, we're on track to deliver double-digit revenue growth, assuming no additional waves occur. In summary, our BD2025 strategy continues to serve as our true north, allowing us to demonstrate: one, a reliable and strengthened growth profile; two, our reshaped innovation and M&A strategy; three, an improving margin profile; four, disciplined capital deployment; and five, our continued execution during uncertain times. We delivered $4.6 billion in revenue in the third quarter, with strong base business growth of 9.3% or 8.8% organic, which excludes the impact of acquisitions. So with that caveat, on an operational basis, excluding the impact of currency, which, based on current spot rates, would be a headwind to consider for next year, we remain confident in the strong value-creating framework we outlined at our Investor Day and expect to deliver 5.5% plus base revenue growth and double-digit adjusted EPS growth. I think importantly though, the most important thing that we share, despite that, kind of COVID-only headwind, we think we can get right about a double-digit adjusted EPS growth profile as well on an all-in basis given the strength of the business, and we'll continue to drive margin improvement into next year. So both a double-digit commitment on base revenues and then what we just shared here despite the COVID only grow over, given the drop in COVID-only revenue, we're confident in right about a double-digit growth profile on an all-in basis as well, which is a great signal on the strength of our total business and the continued momentum we have as it relates to margin improvement that we've committed to as well."
}