{
    "symbol": "HRI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 11:48:06",
    "content": " And finally, based on the second quarter results and our outlook for the rest of the year, we are updating our 2022 guidance range for adjusted EBITDA to $1.195 billion to $1.245 billion, which implies a 34% to 39% increase over our 2021 results. Equipment rental revenue was $605.4 million in the second quarter, an increase of 35% or $157.4 million compared to the prior year. Total revenue grew 30% to $640.4 million, impacted by lower sales of used rental equipment, a decision we made to continue to meet customer requirements in light of a tight supply of new equipment related to supply chain issues from original equipment manufacturers. We reported an increase of 53% in net income to $72.2 million or $2.38 per diluted share in the second quarter, compared with $47.1 million or $1.55 per diluted share last year. Our ProSolutions business also continued to contribute strong double-digit growth year-over-year in the second quarter of 2022, as we continue to expand our market share in the rental of power generation, climate control, remediation and pump equipment. Given current equipment rental demand and our strategic management of fleet in this equipment constrained environment, we disposed of $64 million of fleet at OEC in the second quarter, about $7 million less than last year's second quarter when we began to hold fleet due to healthy customer demand. Adjusted net income in the second quarter of 2022 increased 57% to 74.8 million or $2.47 per diluted share, compared with adjusted net income of 47.6 million or $1.57 per diluted share in the second quarter of 2021. I mean, it all depends on the size and the shape of the   obviously going in to a downturn with this amount of momentum impacts the sort of strength of the business on the way through, but typically in a downturn, the operating leverage works against you on a fixed cost business, so you lose, you sort of head into negative leverage to a certain extent to fuel revenues are actually decreasing and your cost is staying relatively fixed, but getting from 35% fleet growth, 35% revenue growth is a negative revenue growth that's quite a big drop. And in the quarter just on Slide 16, you folks â\u0080\u0093 so it looks like utilization increased year-over-year, pricing was up 5.5%, but dollar utilization was up just 2.5% year-over-year, which suggests I think a meaningful mix headwind. Then my last question is on the way you're managing inflation and higher costs within your own business and kind of how you expect that to trend going forward, the flow through margins on our EBITDA, a little bit lower than the 50% to 60% that you targeted. And I know it's early macro can change, your thought can change, but when you think of your fleet growth potential next year from what the suppliers are telling you, is there a level of comfort they're providing or that they could give you 10% more, 15% more."
}