{
    "symbol": "MMAT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 12:55:28",
    "content": "  Robert Stone: Good morning, everyone. joining the presentation today are George Palikaras, META's Founding President and CEO; and Ken Rice, Meta's Chief Operating Officer and Chief Financial Officer. Yesterday, META filed its Form 10-Q for the quarter ending September 30, 2022, issued a press release with the Q3 2022 results and published the Q3 shareholder letter. Please note, on this call, we will be making forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. These statements reflect our views as of today, should not be relied upon as representative about views of any subsequent date, and we undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements in light of new information or future events. For a further discussion of the material risks and other important factors that could affect our financial results, please refer to our filings with the SEC, including our annual report on Form 10-K filed on March 1, our Form 10-Q filed on November 9 and subsequent filings with the SEC. On today's call, George will start with an overview of META's expanding technology platform and markets, large and growing IP portfolio and how we are enabling cleaner, safer transportation with our entry into the large and rapidly growing battery materials market. This will be followed by an update on roll to roll production of NANOWEB, META's proprietary transparent conductive film, a demonstration of an augmented reality display within an ARfusion cast ophthalmic lens followed by an update on META's glucoWISE noninvasive glucose monitoring system and upcoming preclinical human studies. And finally, a progress report on our KolourOptik, nano-optic security products for banknotes and government documents. This include aerospace, augmented reality, automotive, bandwidths and brand protection, batteries, clean energy, communication, consumer electronics as well as health and wellness. The common thread is that our products connect, protect and detect different properties, and our materials are able to achieve previously unachievable performance across a range of these kinds of applications. We are actively progressing our technologies, our applications and business plans across all of these markets. Our competitive position is supported by 472 active patent documents, of which about 292 are issued in 112 patent families, of which 63 has at least 1 issued patent. For comparison, we have added 22 patent documents since last quarter and we have nearly doubled both our active patent documents and patent families from a year-ago. Electric vehicles are the largest market opportunity that we address today with EV units, projected to grow at 22% CAGR globally, so from '21 to about '23 according to ID TechX. And to achieve this, battery makers need improved material performance, stability and particularly safety. As more energies packed into these batteries to enable longer range, the stress on the battery increases with faster charging rates, the risk of something going wrong also increases. So safety is a major issue, including fires that have started from overheated batteries. It is important to note that these components are used in every lithium-ion battery type, regardless of format, the size of it, or chemistry. The lithium-ion battery separator market was about $5 billion and uses typically 5.5 billion square meters of material, and that was just in 2021. And this translates that with each gigawatt of new battery capacity, you would require about 15 new million square meters of battery separator material. Secondly, we are using our proprietary PLASMAfusion Technology that can deposit very thin layers of copper on polyester substrates, reducing the weight of copper and current collectors by about 80% and that, in turn, extends the vehicle range while enhancing safety. The separator is a porous membrane, a nanopores membrane that can be controlled between 100 nanometers down to 30 nanometers. And what we have demonstrated is that even up to 200 degrees centigrade, it has less than 1% heat shrinkage. And as you can see in the results of the nail penetration test pictured here, we have shown that we have increased the safety aspect. Cells with the NPORE produced no smoke, no fire and did not dangerously overheat. In comparison, the standard cells exhibit thermal runway to above 600 degrees Centigrade and were destroyed. So, we've included a sneak peek of Project Arrow, concept car -- an SUV electric vehicle concept car. Today, we are expanding our space for the battery materials team, and we are adding some new office and labs in Massachusetts, where we're going to also outsource some of the coating trials, and this is underway with a partner in the East Coast, who can produce NPORE at very large scales. So PLASMAfusion, which is our branded name is our patented, high-speed energy-efficient vacuum coating technology, and it's able to quote any solid material into any substrate, including plastics. We demonstrated that the coated copper current collectors deposited on polyester substrates, with our PLASMAfusion technology through a prestigious U.K. government-funded project has been able to reduce the weight by about 80%, improving safety by regarding thermal runaway and improving sustainability by reducing copper content. This was a partnership with DuPont and a couple of universities in the U.K.  Now we are developing roll-to-roll capabilities, and we are already working on a mini roll-to-roll system, producing 12-centimeter wide webs by 20-meter long rolls that you can see pictured here. This month, we have secured key partners that are global leaders in their respective industries. Specifically, we signed an MOU with DuPont Teijin Films and Mitsubishi Electric for a multiyear, multistage project to industrialize this process. We will develop a pilot scale system, followed by industrial scale equipment and then apply PLASMAfusion to solid-state battery production. It's a platform technology with which we expect to increase productivity, not only for batteries, but also for NANOWEB and other applications. Earlier this year, we installed the world's first 300-millimeter web with roll-to-roll pilot production line for NANOWEB, transparent conductive film in our Pleasanton office in California. We have been growing our manufacturing capacity, which is the key to launching a wide range of applications for NANOWEB. For Q2, we are making 5G reflector films that were functionally equivalent to the wafer-based standard parts. I'm very pleased to tell you that we are now making beautiful, uniform 5G reflector films that you can see pictured here. Today's sophisticated ADAS, ADAS means advanced driver assistance systems help to make our safer and easier to drive using a range of cameras such as cameras, you see in electric vehicles, but also RADAR and other types of sensors like LiDAR. To efficiently service the growing number of OEMs who are interested in testing our NANOWEB, for example, the transparent heaters, the antenna or electrochromic applications we have designed a range of standardized demo kits, which use a common controller with multiple programs. So picture on the left, you can see NANOWEB heater. What you see here, you can see basically a different version of the NANOWEB demo kits. So by productizing these demo kits, our team can efficiently service a larger number of potential Tier 1 and OEM customers and move them from the application evaluation phase to custom designs and paid programs. With the 300-millimeter wide web width line, we can produce NANOWEB for sensor windows and eyewear as well as other applications. As we grow NANOWEB, the capacity and the width of the web roll, we expect to drive down the cost per square meter and address a larger number of applications. This is very exciting, has never been done before to have compact functions all within the same layer or stack on top of each other, having, for example, compact and power-efficient the icing and defogging saves battery power and frees up space within the cabin and the dashboard design. An electrochromic sunroof that would quickly adjust its transparency and it's embedded with an invisible NANOWEB antenna can offer high-speed connectivity, while at the same time, protecting you from the sun. ARfusion combines precision cast lens fabrication tools with functional META Materials and volume holograms to provide AR wearable developers with a platform, a one-stop shop for seamlessly integrating smart technologies into thin lightweight prescription glasses. On the left, you can see the ARfusion automated lens cast line, which is our Gen 5 machine, which was recently moved to its own dedicated clean room in our high-field headquarters facility. One of the things that is very high value to say here is that our displays are more efficient than the competitor displays, efficiency means that you can turn light into information far better, far easier than the competition. So let's look at some applications beyond ARfusion, for example, health care. We're transmitting signal through the skin, non-invasively to measure glucose without penetrating and drawing blood. In the second quarter, we were awarded a key U.S. patent for glucoWISE. And today, the system is covered by 16 active patents, of which 5 are issued. So the next round, what we're doing currently is a preclinical human study, which should be completed before the year-end. And we plan to have this desktop version ready for market in the next 2.5 -- 2, 3 years. As you can see in this slide, we continue to make progress in our development work when these new anti-counterfeiting security features for our confidential central bank. Since September '21, we have been working on the framework agreement for up to USD 41.5 million over the next 5 years. We announced that $4.3 million in purchase orders has been secured in September, bringing the total orders to USD 13.5 million under this agreement to date. If we are designed into a new bank note with this flagship customer, we expect that this would lead to more denominations, currency denominations as well as follow-on business with other central banks. We have already delivered 10,000 meters of material for customer trials with good test results for adhesion and durability, which is a critical gate for the product launch. As we have demonstrated, we are making progress, we have a lot of things to cover and a strong portfolio of solutions that have very meaningful positive impacts on multiple industries. In the coming years, we will provide META with a path to significant revenue and cash flows in the near future. We see these applications as catalysts and each one will enable us to gain market traction, big customer contracts and more importantly, the confidence to continue building up our production capacity. Thank you, George, and good morning, everyone. In Q3, our revenues grew meaningfully year-to-year to $2.5 million versus $600,000 in the same quarter of last year. While Q3 revenue was lower than in Q1 and Q2, it's important to remember that at this stage, most of our revenue is driven by development and nonrecurring engineering, which is generally nonlinear and harder to predict. For the 9 months year-to-date of this year, revenue grew substantially to $8.8 million. Operating expenses were just under $24 million, $23.9 million in Q3 versus $12 million in the prior year as we continue to invest and assemble a world-class team to support our many business opportunities. As of September 30, we had $32.2 million in cash and cash equivalents. META still has no debt except for $2.9 million in interest-free unsecured long-term debt from ACOA, which is the Atlantic Canada Opportunities Agency. During the third quarter, we used $19.5 million in cash for operations compared to $48 million in the first 9 months of 2022. Noncash expenses were $7.2 million in the second quarter, and we used $2.2 million for working capital. We believe that cash on hand, combined with our projected revenues and expense management capabilities will be sufficient to support our needs for the next 12 months. However, we may need to raise additional capital to expand the commercialization of our products, fund our operations and further our research and development activities. Future capital requirements may vary materially and will depend on many factors, including the timing and the extent of our research and development efforts, the capital expansion of our facilities and the ongoing investments necessary to support the growth of our business. Given management's alignment with our shareholders, we're working hard to drive the success of the business in a prudent manner. So as you can see today, in summary, META is continuing to execute on multiple applications and large market opportunities, as we pioneer metamaterials at production scale. Metamaterials enable breakthrough applications to do more with less, more performance, less energy, more sustainable materials, lower cost. In the last count, we now have 42 spoken languages within the META family, but we only speak -- as a team, we all speak the same language. We are broadening and progressing on all of our platform technologies, including PLASMAfusion, ARfusion and NPORE. I'm excited to mention that our grand opening and big catalyst of our new 68,000 square foot headquarter facility in Highfield Park, which features 12 clean rooms, will take place in November 17. However, we will -- and some other of our influencers, we will be creating content to share with all of you. In terms of time lines, we just completed our first production run yesterday. And the way it looks like we provide the chemistry that's, let's say, the special sauce and they provide the service to coat it in foil or film kind of format. So we are excited about this because as we saw yesterday, not only this was a successful production run, but there is a lot of interest from the industry, and now we can provide hundreds of kilometers to meet the needs. And the way that this cost sharing will happen, there's a typical markup on the service. And eventually, the technology can be also licensed to very large-scale Gigafactory type productions. So what we're doing with this OEM, we are seeding the market at very large scales so that they, in turn, can take this product, test the thousands, if not tens of thousands of batteries, make sure that they're happy with the chemistry. And then eventually, just doing some basic math, 140 gigawatt factory would require almost 500 million meters square of product. So there's not a single one contract manufacturer could handle all of that volume, and this is where the model -- the business model can evolve to both a licensing model. And obviously, earlier, we have roles that you can buy in the small, medium and extra large kind of versions. Different Gigafactories are coming online as we speak, and there's others that are coming online in 5 years. We have been testing with very large battery companies -- since this is an acquisition, the company that developed this technology is called Optodot, they are now part of our group. Once that customer is happy and they have taken the product and tested it, and they can -- let's say, readily put it in their factory, the tech transfer that takes place can be as short as 1 year. But just to give you an idea, if you think of the battery market being valued at around, I think, about USD 60 billion in 2021. And as you may have seen publicly, there's been a huge amount of articles from Bloomberg and other places that there's an up and coming copper sorted that could derail this energy transition to clean tech. And what I believe is that it's not just the current collectors, but all the different raw materials, the availability. And unfortunately, people think that you can just find more quarries and basically dig further and wider and mine more. But when you have a low producing mine, the cost of getting from that lower quality mine, these raw materials grows almost exponentially. So what we are proposing here, and that's part of the disruption is that we have not only invented a way to make current collectors more efficient by reducing the copper content, but we have made an actual machine, which we call PLASMAfusion, that, as you saw recently, we announced this beautiful MOU with 2 exciting companies, one of which is Mitsubishi Electric. And Together, we are trying to scale this technology to also address the next generation of batteries, solid-state batteries, where the coating process is one of the key areas of innovation. So you get what we believe will be the safest battery in the world, if you include both of our products in the same battery. Obviously, you -- I think you have some build out projections for Thurso and NANOWEB. Yes, so NANOWEB is a flagship product for us because we can -- we have shown and demonstrated that we can charge all the way from thousands of dollars per square meter for the aerospace industry, all the way down to tens of dollars for consumer electronics markets and everything in between. So there is a platform technology that can be applicable to a wide range of applications, replacing indium tin oxide as a better improved solution. So when it comes to production, we, as I mentioned, we have an operational 300-millimeter line. It's similar to our battery separator product, we are looking at how can we scale NANOWEB faster and bigger than previously thought of. If we choose to go down the path of contract manufacturing, that means that we can accelerate and go much wider in terms of web width, which will cover even more applications. We have a specific product road map with product launches next year and the year after, and we try to make sure that we have the volumes to fulfill the demand. The decision to go Thurso internal versus third-party manufacturing, does that change I would assume that changed maybe some CapEx projections. And does that decision change timing on Thurso, meaning, if you wait until Q1 or first half of next year, what have you for the third-party manufacturing to make that decision. And then Ken, you can -- it does not really change the CapEx will be for either option similar for the simple reason that Thurso has the capability to host very large machines like we have done that in the banknote business. So having, for example, a contract manufacturer with one line is not enough for an automotive application, which needs to have backup. The good news here is that if we can bring in an additional production line that is wider in web width than what we currently have, the cost will significantly reduce. And of course, the ability to take on more customers will significantly increase. I think the way to think about it, Gerry, is that we have -- our goal here is to come up with a mix of in-house and outside manufacturing. The in-house decisions about new lines and web width and such will drive CapEx, especially in Thurso because we're centralizing things there, as you know. The flip side, though, is to the extent that we minimize our reduced CapEx in Thurso because we buy a smaller line for Thurso we go with wider web with on the outside for contract manufacturing, we're very likely to have to make financial commitments to the contract manufacturers to get the best pricing. It's been one of our flagship products and -- just like NANOWEB, we have been scaling production and ramping up the quality of that product. Today, we have been sampling our product with what we call in the industry printers. There's about 20 global printers, and we are working with some of the top 3, top 5 printers as we speak. There's been already one full assessment and evaluation on the quality and durability of our product, which we have passed. And then just one question, a housekeeping question on the G&A. And our plan for next year, has that dropping back again to more rational levels. And as you know, there's some ongoing investigation from the SEC that's taking legal fees and all of that's going to drop in the '23 time frame from a cost standpoint. That's a $41.5 million agreement, and it's composed of a number of contract line items. And the way that process works, Chris, is that we -- as we progress through the process with this customer we get releases of new work to get done and as the work accomplishes internal milestones in the contract, they issue new POs to us. So the short answer is, since we've only delivered to or received orders so far for $13.5 million of that contract. The timing of that is what's difficult to predict because as we make breakthroughs in the development work we're doing with this customer, they accelerate things. And as George mentioned in his comments, what we expect to happen is that as we move the product process forward with this particular customer. First, with this denomination that will trigger the need for other denominations from one customer. And as we've done this, this is a major Central Bank, we expect that we can get similar work from other central banks in other geographies around the world. We play as we've mentioned a number of times, in very large vertical markets. One is our ability to produce materials, as George spent a lot of time talking about today at the volumes that each of the customer sets in those verticals needs. So for example, in the automotive section, we can produce material now for a number of the applications without the wide web width production capability. We can do it better with the wide web width, but we're in a position now where we expect to see some fairly interesting revenues coming out of that sector next year. The next area that we would focus on would be another area of NANOWEB, which is -- and we've mentioned a number of times, electronics and communications and then we are looking forward at this point to having some announceable events second half of next year in the augmented reality space. I think a couple -- we've had a number of our shareholders inquire over the last day or 2 about a few things, one of which is that we filed an S-1 again last night. And we were -- we filed an update to the S-1 with the SEC last evening to do one thing, which is to roll forward the financials that were in the previous filing to make them current because the financials that were in the previous filing expired yesterday, so we needed to update them to the third quarter. And then the last piece of the process is once the SEC declares that S-1 effective, then we go with FINRA, who has to help us actually implement the spin-off itself and the major thing that they need to do is ensure that when we do the spinoff, the trading in MMTLP ceases because the stock won't be there anymore. Number two, last night as well, we filed a $0.25 billion shelf registration statement. Now what I'll say at the very beginning is we said in our comments that there's a likelihood that in the future, we'll need to raise more money in the company. We don't need to do that this minute or even this quarter, but what we wanted to do was make -- take advantage of the fact that our business is really growing rapidly. It also allows us, in certain circumstances to sell stock into secondary market shares that are already issued. It doesn't commit us to do anything, but it gives us 3 years to raise money and as little or as large pieces as the market makes sense for us to do. So since the fourth quarter is always a crazy busy time for us, and we had capacity, we decided we would put the shelf up now. And once that's done, then we can use the shelf going forward for the next 3 years for whatever we need for future capital. If you have any additional questions, you may reach us at ir@metamaterials.com."
}