{
    "symbol": "MMAT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 12:31:03",
    "content": " Iâ\u0080\u0099m Rob Stone Metaâ\u0080\u0099s Vice President, Corporate Development and Communications. Joining the presentation today are George Palikaras, Metaâ\u0080\u0099s Founding President and CEO; and Ken Rice, Metaâ\u0080\u0099s COO and CFO. Yesterday, Meta filed its Form 10-Q for the quarter ending June 30 2022, issued a press release with the Q2 2022 results and publish the Q2 shareholder letter. Please note on this call, we will be making Forward-Looking Statements based on current expectations and assumptions, which are subject to risks and uncertainties. These statements reflect our views as of today, should not be relied upon as representative about views of any subsequent date, and we undertake no obligation to revise or publicly released the results of any revision to these Forward-Looking Statements in light of new information or future events. For further discussion of the material risks and other important factors that could affect our financial results, please refer to our filings with the SEC, including our annual report on Form 10-K filed March 1st, or Form 10-Q filed on August 9th, and subsequent filings with the SEC. On todayâ\u0080\u0099s call, George Palikaras will start with an update on the plan share exchange for the oil and gas assets and the filing of an S1 for next reach hydrocarbons. This will be followed by an update on roll-to-roll production of NANOWEB Metaâ\u0080\u0099s proprietary transparent conductive film, followed by an update on Metaâ\u0080\u0099s glucoWISE non-invasive glucose monitoring system, which was recently awarded a key U.S. patent. Ken Rice will review the Q2 2022 financial results, including the important contribution of our nano-optic security products for bank notes and government documents. With that I will now turn the call over to George, Metaâ\u0080\u0099s CEO. Thank you, Rob and good morning to everyone joining us on the call today. I would like to provide an update for holders on this next slide, the Series A preferred shares. The registration statement, the Form S1, which was filed on July 15th must become effective to complete the exchange. Typical timing for a first response is 45-days, but after the process becomes subject to further review and comments if any. This includes $15 million loan last year and up to $5 million in 2022. , the new management for Nexbridge is exploring financing options and we are supporting their efforts. However, there cannot be any assurances that financing will be obtained, and repayment of the debt to matter may not occur. As you may know, Meta is a platform technology company with a broad range of capabilities and related products and trademarks addressing large and growing end markets. These include, as you can see on the top, aerospace, augmented reality, automotive banknote and brand protection, batteries and clean energy, communication, consumer electronics as well as health and wellness. For comparison, this is three times as many patent documents as we reported a year-ago, when we had just 149 active patent documents and 46 patent families. One of the fastest growing industries we address is electric vehicles, which is in dire need of providing consumers with increased range and faster charging. To achieve this, battery makers need improved material performance, stability and in particular safety. As more energy is packed into the battery to enable longer range and stress on the battery increases, with faster charging rates, the risk of something going wrong increases. Safety is a major issue, including fires that have started from overheated batteries. Meta is developing new cutting edge materials and manufacturing techniques to improve safety and efficiency, as well as helping to reduce battery cost. There are two components, separators and current collectors used in every lithium-ion battery regardless of chemistry. The separator is a porous membrane, that is placed between the anode and the cathode. It must be thin and light, while maintaining thermal and mechanical stability. Demand is expected to grow at 30% CAGR, with each gigawatt hour of battery capacity requiring about 15 million square meters of separator. The PORE size is tightly controlled in less than 100 nanometers, which offers superior performance just like Meta Materials. And NPORE has less than 1% heat shrinkage even up to 200 degrees centigrade, so it does not fail during a thermal runaway. So Autodock after that was founded in 2001, it has been developing in licensing to technologies, battery separators and infrared optical coadings. Autodock has development relationships with leading OEMs and Tier 1 suppliers, innovative early states battery companies as well as the U.S. government and few agencies. We recently acquired substantially all the assets of this company including the large IP portfolio, with 107 issued and 26 patents pending, including two recently U.S. listed patterns with covering the second and third generation of the NPORE and NPORE ECS. In addition to batteries, this was a strategic acquisition as it complements Metaâ\u0080\u0099s medical Meta Materials device portfolio, and also allows us to expand in new markets such as wireless power transfer and ultra filtration. Finally, we believe that we can scale nano-PORE the production can be done quickly with minimal CapEx by working with contract manufacturing partners that we have already selected. Next, current collectors another essential component for battery performance and safety. Through a prestigious UK government funded program, reducing weight by about 80% improving safety by retarding thermal runaway and improving sustainability by reducing copper content. Importantly, PLASMAfusion is a versatile platform technology with many uses besides coated current collectors. PLASMAfusion is a unique high speed coating technology, able to coat any solid material on any substrate. It is faster and more energy efficient than any other methods and operates at low temperatures, which makes it suitable for plastic substrates. PLASMAfusion has already been used to deposit prototype lithium-ion battery anodes directly on to the separators and then deposit the copper current collector, as you can see pictured on the lower right of the slide. We are also planning to use PLASMAfusion internally for metallizing NANOWEB transparent conductors and color optic security films, increasing our capacity by accelerating line speed and leveraging our CapEx. Our work continues in our Pleasanton, California facility to scale up the worldâ\u0080\u0099s first 300 millimeter roll-to-roll pilot production line for NANOWEB transparent conductive films. Our team is busy producing NANOWEB sheeting for automotive customers to be used in sensor enclosures in windscreens, but also EMI shielding for aerospace and consumer electronic customers. In addition, we are now shipping a number of demo microwave ovens with our transparent NANOWEB on the doors to OEMs for their independent testing. As we continue to expand into new form factors for NANOWEB, our next objective is to increase the line to 600 millimeters of web  (Ph), which will be installed in the expanded production area in Thurso, Quebec facility towards the end of next year. Among all the other exciting new developments, we were recently awarded a key U.S. patent for glucoWISE, our non invasive glucose monitoring system. Picture here is Dr. Elena Cannell Garcia as our co-inventor, and glucoWISE continues to progress. Thank you, George and good morning, everyone. Turning to Slide 14, our Q2 2022 revenue grew meaningful year-over-year to 3.3 million versus 600,000 in the same quarter of 2021. A flagship win with this customer should lead to additional denominations and other new customers, but we do not yet have a target date at this point for this decision. Operating expenses were 22.1 million in Q2 versus 5.8 million in the prior year, as we continue to invest and assemble a world-class team to support our many business opportunities. As of June 30, we had $55.3 million in cash and equivalents, which includes the proceeds from a registered direct offering closed in late June. Meta has no debt except for $3.2 million dollars in interest free unsecured long-term debt from ACOA, the Atlantic Canada Opportunities Agency. We used $10.3 million in cash for operations, compared to $18.8 million Q1 2022. So as you can see, Meta continues to pioneer Meta Materials at scale. We are investing and growing a global team, attracting some very experienced key executives, including the recent additions of a new Chief Marketing Officer and Chief Business Officer. We expect to begin moving our production team into our new headquarter facility in Highfield Park in Nova Scotia in August, and then plan to have everyone else moved in before a grand opening, which is expected to take place in November. Meta is a category creating company, the first of its kind in Meta Materials on the NASDAQ. As you mentioned, George, you have a broad range of technologies. Iâ\u0080\u0099m wondering - and you spoke about how you plan on merging that, like, things like NPORE and plasma fusion. So as you know, in nano-technology things take time. But Iâ\u0080\u0099m happy to report in the last 12-months just using the Nano-Tech Security, acquisition technology. So when our software engineers and our Meta Materials scientists come up and dream about applications or a customer shows up and says, here is what I want. But it is not just the tool, it is the people. They are working on advancing things that we are kind of falling behind, like the solar program, and coming up with new ideas on the augmented reality side, helping basically the business unit advance that is already happening. What I can say is that over the next 12-months, you will see products that are being launched as a result of this collaboration between the synergies of the different platforms. The same goes for the Optodot, where the Optodot specifically was looked at, favorably, because it touched two different product lines. One was medical, our medical MRI application and the second one was our banknote where it has optical properties for covert, banknote applications separate, of course, to the battery, key applications. So that is a really found across the platforms and even just a couple of months ago, we were at a AWV, where we showed and demonstrated the worldâ\u0080\u0099s first most transparent antenna that was embedded on augmented reality eyewear. That was a collaboration between our holography team in Halifax, and our Silicon Valley office, where they basically worked together on a very unique product offering and Iâ\u0080\u0099m happy to report that there is a paying customer for that application already. So in Silicon Valley, it drives applications. In Burnaby, we are driving the originations. And once you have the design from letâ\u0080\u0099s say, one team gets to be prototyped by another team, it all comes together in production in Quebec in roll-to-roll fashion, and then it gets integrated in Halifax. On the NANOWEB, you spoke of the 300 millimeter pilot in operation and then in 2023, you will have the 600-millimeter there. So when it comes to the size of the film the web width, it definitely unlocks additional use cases. But also, in the use cases that we are currently serving like the microwave oven, the door is smaller than 300 millimeters. And that is a very nice use case and low hanging fruit, per se. Now, when you look at the 300 millimeter line, what we are going to be doing over the next few weeks, we are beefing up the team in the Pleasanton office, so that we basically have advanced manufacturing, remember, we have a wafer line there. This is our business model through selection and material selection program, that then scales to rolls of film that then scales again into high volume roles in the Thurso facility. Now, the Thurso facility is already producing amazing things for the banknote industry, they have the expertise, we have capacity for like 7.5 million meter square. So we still have a lot of capacity, what happens is the time consuming process of guiding us through a product all the way qualifying it, it is automotive, consumer electronics, each one has its own standard. And as a B2B company, we have to rely on the customer when they feel that we have reached a certain level of technical maturity. The business case is well advanced, so that that is where I kind of we rely on our partners as well. And then my last question, I think is probably for Rob on the G&A. There is just, there is that large litigation amount in there. So first off the big blip in G&A, for the first half of this year, as you observe Mac is on related to the whole SEC investigation and the litigation that is underway. I would love to be able to sit here today and say, I know what that is going to end that for the year. We are doing everything we can to cooperate with the SEC, and things are moving at a slightly faster pace now. And I think the expectation, our hope, is that this would be resolved towards late this year or at the latest early next year, we will know better at the end of next quarter as to how we are actually coming out there. As you could see, our cash burn dropped quite a bit in the second quarter over the first quarter and we are continuing to focus on that rather than on the P&L reported operating expenses, because a lot of it is non-cash in the form of stock compensation, that sort of thing. Good morning, George Kennan. So I wanted to follow-up, dig a little deeper on the battery side. I was just curious, obviously, you are making some great progress and METAâ\u0080\u0099s recent acquisitions, but interested to see if you needed to if you had a desire or need to maybe expand that the technology family around the batteries to better position the products on a go forward basis. So, Jerry, I can happily say that there is a number of third-party supporters in terms of our technology out there. Over the next two to three-months, you will see reports of how our battery is fair versus standard chemistries. So we are hoping that, once those reports are out, we will have even more support from the industry. As I mentioned, it is relatively cheap to scale the Optodot technology because it uses a slot die approach. On the Plasma fusion side, where there is some CapEx, but the good news here is that, it complements our NANOWEB production and product line. So, we have been working on expanding the technology, yes, in terms of scale. But ultimately, we see this as a licensing opportunity as we go forward, unless something else comes along the way and changes that view. So when it comes to anything in nanotechnology, there is always room for optimization. And our engineers have done a fantastic job getting the most important thing done, which is the functionality of the film for the 5G. The cosmetic side is, it is a matter of optimizing the chemistry, the process, windows. So imagine, just to give you an example, if you are baking something in your oven and suddenly you bake it at a higher temperature for a little longer, well, it makes it a little bit more crispy. Well, you need to again optimize that window to just get it right, and that is what we are doing right now. And then one more question, just really revolves around resources. Going after lots of opportunities across the battery side NANOWEB, EV and you have added some additional people, human capital. On the people side, the key additions we will see in the manufacturing department, but also in the sales department. And you have to understand that as a B2B company, we have been quite blessed. So we were not really out there pushing EMI shielding for microwave ovens, there was a major OEM that showed up at our doorstep and said, hey, can you do this. And this is a repeating formula, letâ\u0080\u0099s say that has happened to us over the years. So as we are now changing that, and we have capacity, we have products coming online. We are going to take a much more active role, basically promoting and pushing those products out and of course, partnering with the right teams to deliver. So that is kind of optimizing the team a little bit, but nothing hugely, we are not going to double the size of the team. Is there an opportunity for some quote, unquote, alternative financing. I think the approach we are taking is to take first of all, as our balance sheet has improved, especially on the heels of the financing that we did, the end of June, it is enabled us to start thinking much more seriously about pursuing additional support from the Canadian government, which is very, very lucrative for us. The second thing is, since a lot of the investment we are making now is in CapEx. For that kind of equipment, we have not historically financed our equipment using something as simple as debt. With regard to investment by strategics, we are always interested in that type of investment. And I think if we go back in the history of the company, George in particular was very successful at attracting investment from strategics very early on. And we see, over the last few months, we have attended a number of trade shows, and we are starting to see some renewed interest from a certain number of strategics in a couple of our verticals, and doing that again. Now, we will take questions from Chris Sakai of Singular Research. As we have seen some recent bills being passed in the U.S. about on climate change, and electric vehicles. And as we were working, as George said, with agencies of multiple governments right now, especially in the battery space, it is a very burgeoning space. And the governmentâ\u0080\u0099s are all interested in two things in expanding production capacity for the things that we already do which are separators and current collectors, and also to a certain degree, competing with each other to attract as much capacity to their particular geography as they can. And one thing I wanted to add is that if you look at the landscape, you will see that recently, a couple of weeks ago, or 10-days ago, Japan in the U.S. kind of join hands in the semiconductor industry. Okay, and next question I had is no other revenue for this quarter. The vast majority of it - well over 95% was from Nanotech Security, and we planned it that way. As you may recall, when we merged with Nanotech over a little under a year ago, now, they brought with them a 40 million plus frame agreement with Central Bank client that work is accelerating actually. And that is so the revenue that we are seeing is accelerated by many, many percentage points. As a result of the work on the bank notes security, we expected over the course of the rest of this year, that trend will continue. And as we go into next year, the balance will be a little bit more even between the banknote security and the other work that we are doing and then a weapon, some of the battery business. And to add one thing here, Chris, the work that has been going on under the security films business, which is the Nanotech side. When we were going through the negotiations in the summer of last year, the contract at that point in time was much smaller than what it ended up being. Now what excites me about this is and what I wrote in the shareholder letter, that this could become the highest volume blockbuster application for now in the space of optical Meta Materials, and this is a proof point that are not only you can have Meta Materials out there that are not just aerospace and defense related. On the other side, we are working in a space where price is extremely sensitive in the banknote business, volume is extremely sensitive, and more importantly, quality and accuracy at the nano-scale is very, very important. And then last for me, you have talked about your glucoWISE product. As George said, our plan is to have the first incarnation of that product on the market in two to three years with the objective trying to be faster than that. It is medical device, so it will be regulated in the geographies we launch it in. So I think the way to think about it is, if we can accelerate it will, but at a minimum, it should be generating revenues in the two to three year timeframe. It is most likely to be via a partnership with a larger medical device company, but we are not sure of that yet. Maybe just one thing, Rob. I just wanted to say that we stand by ready to maintain these assets, according to our agreement with University Brands, we are eager to make sure that, these assets produce and further develop and basically enabling the assets to be sold at the highest price possible. Timing is fantastic for these right now, as we are in kind of the super cycle for oil and natural gas in particular. If you have questions, you may reach us at ir@metamaterial.com."
}