{
    "symbol": "HR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:50:03",
    "content": " Yes, I think if you look at -- there were about half, I think if you look at where we've been running -- kind of been running on average of about 3.5%, and I think that's with the realignment that we discussed in terms of more -- giving our leasing team more building, more square footage in the market, deeper relationships and transitioning to that broker model. I think with what's going on in the market today, Rob describing sort of how we're looking at a lot of different smaller transactions in the market, looking at something that maybe is in the $250 million, $300 million range is probably not an unreasonable, spot to think about for the year. On the -- as I mentioned earlier for 2023, we're looking at about $20 million to $25 million of funding, and that's really related to the current pipeline. And for that group, that $300 million of developments and redevelopments, that's the range that we're targeting, kind of, that -- right now, that 7% to 8% initial yield, stabilized yield on those deals. I think if you use the run rate table, you can begin to, sort of, see how that's shifting a little higher in some of these later sales, but that was kind of by design, and we're very glad to have some of that lower cap rate dispositions completed behind us. I think it's going to create opportunity that these health systems may need to lean more into folks like ourselves to execute on their strategic initiatives and rely on third-party capital and operators to get things done, because there their old days of super cheap debt, which is their main source of capital just is much more expensive today like everyone. But digging behind it, if you look at it year-to-date between the two companies, we're running just under 16% -- that's the reason we use that number as well as that's what we used inside of our initial underwriting of the merger of what we expected the combined maintenance CapEx to be. I think a lot of health systems aren't looking for a lot of capital and relying on us where it's kind of split that way, whereas the physician side might be from time to time a little more elevated. And that's starting to move up to the 2% plus, and our expectation is we continue to see that improvement in occupancy that's building that you can start to move that into the mid-two's to even towards 3% on their assets, which we think being combined with what's going on in the legacy HR portfolio, can push us above the high twoâ\u0080\u0099s where we are now to 3% plus moving forward. So it's -- I think our objective here is that, we don't see a material change, but that's something we'll evaluate each quarter as we navigate this environment with interest rates and -- growth -- operational growth might take a little longer, but it's recurring and it's powerful. I think in terms of returns on new development that makes sense right now, and so we've indicated earlier that we think cap rates for MOBs right now are around 6% and kind of view that as our cost of capital if we're selling assets to rotate into new developments."
}