{
    "symbol": "VIPS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-19 14:28:09",
    "content": "  Operator: Ladies and gentlemen, good day, everyone and welcome to Vipshop Holdings Limited First Quarter 2022 Earnings Conference Call. At this time, I would like to turn the call to Ms. Jessie Zheng, Vipshop’s Head of Investor Relations. Hello, everyone, and thank you for joining Vipshop first quarter 2022 earnings conference call. Before management begins their prepared remarks, I would like to remind you that the discussion today will contain forward-looking statements made under Safe Harbor provisions of the U.S. Potential risks and uncertainties include, but are not limited to, those outlined in our Safe Harbor statements in our earnings release and the public filings with the Securities and Exchange Commission, which also applies to this call to the extent any forward-looking statements may be made. Please note that certain financial measures used on this call such as non-GAAP operating income, non-GAAP net income and non-GAAP net income per ADS are not presented in accordance with U.S. GAAP. We had a slower than expected quarter due to the resurgence of COVID-19 cases in China on top of already challenging macro environment, which steepened the general customer sentiment. In the first quarter, we continued to provide support for core brand, offering them more leverage to improve sales through our upgraded merchant platform. We also brought in many new and trendy brands, enriching product selection on our platform. We added a range of product offerings in non-apparel categories, including products for everyday use. While we remain cautious ahead amid ongoing COVID-19 flash-ups, we are strongly committed to our strategic position as a discount platform for branded products. In the first quarter, despite soft top-line performance due to macro headwinds, our margins held up relatively well, thanks to our initiatives to manage cost and expenses with greater discipline. For example, we were able to effectively improve the margin profile of many product categories after we became more focused on shifting traffic and resources to core brands, while prioritizing low-quality products – low-quality brands. Our non-GAAP net margin also stayed well above 5%, as we became more efficient in marketing spend. In addition, during the quarter, we had fully utilized the $500 million share buyback program that we announced last year. On March 31 this year, we announced another $1 billion share buyback program, which we may execute from time to time over a period of 24 months. Before I get started, I would like to clarify that our financial numbers presented below are in renminbi, and all the percentage changes are year-over-year changes, unless otherwise noted. Total net revenues for the first quarter of 2022 were RMB24.2 billion as compared with RMB28.4 billion in the prior year period, primarily attributable to soft consumer demand for discretionary categories and a worse impact on warehouse and logistics networks caused by COVID-19 resurgence in China. As a percentage of the total net revenues, total operating expenses was 15.4%, which stayed flat as compared with the corresponding period in 2021. Marketing expenses decreased by 41.3% year-over-year to RMB739.3 million from RMB1.3 billion in the prior year period, primarily attributable to more prudent marketing strategy. As a percentage of total net revenue, marketing expenses decreased to 3.0% from 4.6% in the prior year period. As a percentage of total net revenues, technology and content expenses increased to 1.5% from 1.2% in the prior year period. As a percentage of total net revenue, general and administrative expenses, was 4.2% as compared with 3.4% in the prior year period. Looking forward to the second quarter of 2022, we expect that our total net revenue to be between RMB22.2 billion and RMB23.7 billion, representing a year-over-year decrease rate of approximately 25% to 20%. Your line is open. Thanks management for taking my questions. I think till today, we still have over 1 million orders that cannot be delivered because of various reasons, including suppliers based actually in restricted regions and that actually undermined the fulfillment efficiency. Especially, we have seen other places like Beijing faced restrictions or controls and also consumer sentiment, consumer confidence has not come back. So generally speaking, we don’t feel very optimistic for the momentum for the second half, but we don’t expect it will be significantly worse as well. On the margin side, I think we are pretty confident in maintaining a healthy level of profit and margins. Your line is open. Okay, first, on standardized products. Currently, we still have 70% generally from apparel and the rest 30% from standardized products. For example, in summer, typically customers would like to buy a lot of standardized products in addition to summer clothing. And also, we approach standardized products very carefully. We try to meet customer needs, especially when they shop for clothing, they will have something else to choose from to provide them with a one-stop shopping experience. And given the COVID-19 outbreak, I think we are proactively added from our non-apparel product offering, especially including our products for everyday use to meet customer needs. But generally speaking, I think we have the ability to secure a lot of quality inventory from brands and help them to sell through these inventories very efficiently. But at the same time, some of the brand partners are also facing continued pressure, especially when they are based in restricted regions, including Shanghai. I think although the – generally speaking, the market is in a downturn, but it’s not that bad. Generally, we will not accept the product that’s with very low margin. And also, the apparel product still represents 70% of our total carrying. Your line is open. My first question is on your second quarter revenue guidance, whether that assumes a similar growth rate for May and June of what we’ve seen in the April run rates and some expectations on June 16 for us. Second is on free cash flow, we’ve seen a reduction of that. And coupled with COVID-19 cases, with related restrictions and controls are still going down and the consumption sentiment has not come back yet. In terms of cancellation rate, absolutely, actually from the middle of March, we have seen a cancellation of orders has been going up due to logistics delayed. And the cancellation rate actually went up 6 percentage points year-over-year, and it has caused very significant losses to us. In Q1, our operating cash flow turned negative, because we made a lot of payments to suppliers and for other miscellaneous expenses. The dividends, so we – currently, we don’t have a plan to pay out dividends, but we are committed to our share buyback program. Your line is open. Just wondering, can you give us more color about exactly which categories help us standardize the products you are referring to, because back in 2018 and ‘19, you have also tried some category expansion. In terms of our strategy on standardized products, actually all the categories are already on our platform, including beauty products, home goods, kitchenware, life and grocery and healthcare products, etcetera. We will manage the product offerings very carefully in each category, not necessarily as many as SKUs as you see on other platforms. We want to make sure that we can have very quality supply from brands, and sometimes, it may be unique supply from the top brands. Currently, we have 30% from standardized items. Our goal is to gradually improve the contribution to, let’s say, 33% over time, an increase of 10% on a current basis. Your line is open. Thanks management for taking my questions. This quarter, the gross margin is slightly higher than our expectation. And as I remember the SVIPs, the members, they carry lower margins, but the mix this quarter is also higher. So, this year, we have taken many cost saving measures to improve our margin. For example, we were able to improve the margin profile of many categories after we shifted our resources to the core brands that we selected and prioritize some of the non-core brands. For the coming quarters, we will continue to be disciplined and make sure that we have a healthy margin and eventually achieve a healthy bottom line net margin. And on the category mix, the apparels are still representing 70% of our total GMV, right, and then supplemented by the standardized product. And as we talked about it earlier, for the standardized products, we also carefully choose what to carry to make sure that our overall gross margin will remain stable and potentially we could improve the gross margin also. But since they spent more, they spent a lot much more and then their frequencies, their ARPU are much higher, so overall, it’s just a matter of time when they can contribute positively to the overall gross margin. And then – but in summary, we are committed to the overall improvement of the gross margin. In terms of customer growth for the second half, I think our customer growth has been relatively in line with our overall business performance and given that our ARPU has actually been tight and not stable over time. But we will evaluate our marketing spend from time-to-time, especially given the many uncertainties going on, we are apparently facing a much less favorable customer acquisition environment. Due to time constraints, that concludes today’s question-and-answer session."
}