{
    "symbol": "VIPS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 11:37:03",
    "content": " As a result, we had the most profitable quarter in two years with non-GAAP net income up by 24% to RMB2.2 billion and net margin at 7%. Total net revenues for the fourth quarter of 2022 were RMB31.8 billion as compared with RMB34.1 billion in the prior year period, primarily equitable to short-term disruptions on economic activities from the surge of COVID-19 infections nationwide. Gross profit increased by 2.8% year-over-year to RMB6.9 billion from RMB6.7 billion in the prior year period, Gross margin increased the 21.7% from 19.7% in the prior year period. As a percentage of total net revenue, total operating expenses was 14.6%, which stayed flat as compared with the prior year period. As a percentage of a total net revenues, fulfilment expenses was 6.8% as compared with 6.4% in a prior year period. As a percentage of a total net revenues, marketing expenses decreased to 3.0% from 3.4% in the prior year period, primarily equitable to more prudent marketing strategy. As a percentage of total net revenues, technology and content expenses was 1.3%, which stayed flat as compared with the prior year period. Net income attributable to Vipshop's shareholders increase by 57.9% year-over-year to RMB2.2 billion from RMB1.4 billion in the prior year period. Net margin attributable to Vipshop's shareholders increased the to 7.0% from 4.1% in the prior year period. Non-GAAP net income attributable to Vipshop's shareholders increased by 23.9% year-over-year to RMB2.2 billion from RMB1.8 billion in the prior year period. Non-GAAP net margin at buildable to Vipshop's shareholders increased to 7.0% from 5.3% in the prior year period. Net income attributable to Vipshop's shareholders increased by 34.6% year-over-year to RMB6.3 billion from RMB4.7 billion in the prior year. Non-GAAP net income attributable to Vipshop's shareholders increased by 13.7% year-over-year to RMB6.8 billion from RMB6.0 billion in the prior year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}