{
    "symbol": "FPAY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 13:42:03",
    "content": "  Operator: Greetings, ladies and gentlemen, and welcome to FlexShopper 2022 Third Quarter Financial Results Conference Call. With me today are Rich House, Chief Executive Officer; Russ Heiser, Chief Financial Officer; and John Davis, Chief Operating Officer. Before we begin, I would like to remind everyone that this call will contain forward-looking statements regarding future events and our financial performance, including statements regarding our market opportunity, the impact of our growth initiatives and our future financial performance. These should be considered in conjunction with cautionary statements contained in our earnings release and the company's most recent periodic SEC reports, including our quarterly report Form 10-Q for the third quarter ended June 30. These statements reflect management's current beliefs, assumptions and expectations and are subject to a number of factors that may cause actual results to differ materially from those statements. During today's discussion of our financial performance, we will provide certain financial information that constitute non-GAAP financial measures under SEC rules. Reconciliation to GAAP measurements and certain additional information are also included in today's earnings release, which is available on our Investor Relations section of our website. In the third quarter, we reported an EBITDA loss of $2.9 million and a net income loss of $6.3 million. Apparently, the high inflationary environment coupled with slower economic growth has impacted the demand for discretionary purchases by the traditional FlexShopper customer. In the third quarter, we observed the combination of lower response rates to our marketing initiatives, coupled with an unfavorable risk or distribution of those consumers who did respond. Last quarter, we told you we had proactively tightened our underwriting standards in order to deal with a declining economic and economic environment. However, because of lower response rates and lower approval rates, we are originating less of these assets than we anticipated. Retail partner volumes are up 20% year-over-year, and the repeat volumes continue to grow. Fortunately, the pivot to increasing our storefront partnerships that began earlier this year, feeds into the areas of our business that are currently performing well and we believe that will drive future growth. Fortunately, our new growth initiatives focused on the brick-and-mortar channel are still on track to finish the year with more than 3,000 storefronts, as we previously indicated. In the quarter ended September 30, 2022 total funding has increased 60.1% and $25.8 million from $16.1 million for the same period last year. Total revenue for the third quarter of 2022 was $26.1 million, which was down 15% year-over-year. General and administrative expenses, which includes operating expenses and salaries and benefits are $8.5 million, which is $1.5 million higher than the same period last year. Adjusted EBITDA was negative $2.9 million, a decrease of $7.8 million year-over-year. At the same time, hourly wage growth is approximately 5%, which is resulting in deterioration in customer disposable income. Unemployment rates remain low, but the significant increase in short term interest rates are predicted to slow down economic growth in the future, which puts future employment levels at risk. This economic backdrop has restricted the spending activity of our good customers as they rationalize their personal balance sheets, which has resulted in a slight drop in overall lease originations year-over-year with a 1.9% decline. When split between our marketplace and partnership channels, our marketplace originations were down over 20% year-over-year, and our partnership originations were up over 20% year-over-year. Marketplace application volumes are down 5% from last year, that approval rates this year are 52% lower than last year as tight underwriting standards remain in place. We are also observing some deterioration in the applicant credit quality as measured by generic credit scores that we obtained during our underwriting process, which is also contributing to lower approval rates. Despite this quality drift in our marketplace channel, our tighter standards do appear to be effective based on our early default trends, which are 18% better year-over-year, even with the significant difference in economic conditions. We will continue to be prudent in our approval criteria in order to maintain these default rates, which are a good early indicator of the eventual return on mature originations. As we continue to keep lower year-over-year early default rates, our bad debt reserve ratio will follow as these vintages season into the calculation. We also continue to experience nice average order value growth, stronger year-over-year conversion rates on approved applicants, and strong repeat customer leasing rates, which are partially offsetting the much lower approval rates we are experiencing. Moving on to our partnership channel, we are benefiting from more origination volume from our recent door expansion, as well as higher volume from established partnerships. Even with slightly lower approval rates, year-over-year within our partnership lease channel, we are seeing 11% application growth and 23% year-over-year growth in average order value. Also, importantly, we are seeing 10% lower year-over-year early to fall rates. The future expected growth in store accounts as well as trends we are seeing within existing partnerships, we expect that this revenue growth will continue while maintaining favorable credit quality. Looking at our loan bank partnership product, or bank partner originated approximately $10 million in Q3 of this year versus approximately $400,000 last year in the same quarter. However, bank partners originations are sequentially download from the approximately $13 million originated in the second quarter. Like all of our other originations and purchases, we are being very vigilant on our underwriting standards and are prioritizing asset quality above revenue growth in the current economic environment. Similar to our lease product, we are also seeing success with the strategy within the loan product with early pay default rates on loans originated by our bank partner in Q3, lower than both Q2 as well as Q3 of last year. Last quarter Rich spoke about introducing products on FlexShopper.com source for manufacturers and distributors to make with a retail margin, as well as our traditional margin on product financing. We are selecting products that are complementary to our existing marketplace partner selections, which allow our customers to utilize their approved spending limits more fully with a wider selection of goods. In summary, we will continue to prioritize asset quality over revenue growth as economic conditions remain challenge for customer base. And economic conditions strengthen FlexShopper will be well poised to drive sustainable, high quality growth across all of our distribution channels. Our plan was for the growth in our direct-to-consumer business to provide a bridge of growth, leading to far more future volume growth through our significant storefront expansion with retail partners. Unfortunately, the aforementioned decline in response rates and approval rates has created a gap in our near term earnings, but it does not change the fundamental strategy. We're going to continue to press forward with our retail storefront strategy, which most recently is highlighted by the announcement we made in October regarding our exclusive marketing partnership with Liberty Tax. As a reminder, this new partnership establishes FlexShopper as the exclusive financial services provider for more than 2,000 storefront locations for Liberty Tax in the United States. In addition to the storefronts, we also plan to use Liberty's growing online presence, including their website, and the Liberty Tax app that distributes FlexShopper's products. In addition to the retail partner expansion, we continue to be committed to the wholesale retail strategy John discussed earlier. Increasing our retail partners -- our retail margins through partnerships with manufacturers and distributors will enable us to improve the profitability of our online marketplace like Shopper.com, irrespective of how the needle uses or originated, either through retail partnerships, or directly to consumers. Therefore, we're going to maintain a very disciplined approach to credit risk, and we're going to reduce our costs to match the current level of fundings we are currently observing. We anticipate our base level operating costs, excluding marketing to be approximately 10% lower in 2023 and 2022. Our view is that minimizing our cost structure, maintaining credit discipline, and expanding our retail partnership network will enable us to push through the current macroeconomic environment and grow rapidly and profitably as the economy improves. We're hopeful that we get a volume boost from the holiday season, but it's certainly something nothing we can be certain about. Okay, so you're not seeing folks and kind of move down the credit chain and dig into your --\n No, we have not seen that. I think John mentioned in his commentary, we speculate that lenders above us -- in the credit spectrum will tighten and if history repeats itself like we did in the in the past recession, then that should increase our volume overtime. Because as people lose their liquidity, they may be getting from lenders above us and the credit spectrum, they wouldn't actually drift down into our space. Yep, now that makes sense. As any enterprise, would -- you look at what you're doing currently, and what you may do in the future. We're probably going to -- after the holiday season really make sure that we justify all of our marketing dollars in this environment, but that -- we're talking about -- we're not really talking about marketing cuts in this particular expense reduction. And while we're seeing significantly lower approval rates, in our direct-to-consumer marketing efforts, we're not seeing that same phenomenon in our retail partners. So as we roll out these retail partners, we believe we'll move back into a growth mode relatively quickly in the coming year. Yep, now that makes sense. If I get squeezed one more, and I just want to confirm it sounds like you guys will be up and running in all the Liberty Tax locations by the time tax season rolls around in January. Specific game plan, where Liberty Tax is because of the holiday season, you mentioned we were working very hard to enable our marketing efforts on their digital channels right now. At the same time, we have a separate team working with Liberty Tax to begin mobilizing to get into their storefronts as we move into the tax season."
}