{
    "symbol": "RNR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 16:30:31",
    "content": " The other significant driver of third quarter results was the historic increase in interest rates, resulting in a retained investment loss of $340 million driven by mark-to-market losses on our fixed income and equity portfolios. Second, our capitals partners business has the capital to take advantage of underwriting opportunities in 2023, and we are confident that management fees, which are a component of overall fees, will be around $25 million to $30 million per quarter going forward. In the third quarter, premiums were relatively stable year-over-year with a $56 million gross premium increase in property cat, partially offset by a $29 million decline in other property, which was primarily related to the nonrenewal of one large other property deal. The rated balance sheets that we manage through capital partners, namely DaVinci, Vermeer and Top Layer bring over $7.5 billion in total market-facing capital, providing an excellent platform to take advantage of opportunities in the property cat market. Continued increases in U.S. interest rates drove $453 million in retained mark-to-market losses in the quarter and $1.6 billion year-to-date, principally in our fixed maturity portfolio. We are seeing significant positive momentum across our three drivers of profit and in 2023, expect underwriting income from Casualty and Specialty to be around $200 million, the Property segment to benefit from increased rate and tightening terms and conditions, management fee income to be around $100 million, with potential upside in performance fee starting midyear. But I think this is a different animal coming into 2023 with broad changes, both across loss programs and programs without loss and then opportunities to take the precious cat capacity we can bring to the market to increase our opportunity to enhance returns within the capital the Casualty and Specialty portfolio."
}