{
    "symbol": "SLN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 13:49:06",
    "content": " 2022 was an exceptional year at Silence, where we delivered impressive clinical data with SLN360, now known as Zerlasiran for high Lp(a) and made important advancements across our broader pipeline of siRNA therapeutics. Looking forward to the rest of 2023, we have several important milestones, including top line data from the multiple dose portion of the APOLLO study in high Lp(a) and top line data from the multiple dose portion of the GEMINI II study in thalassemia. As Craig mentioned last year, we reported incredible results from the APOLLO single-dose study in healthy volunteers with high Lp(a). This chart is showing you a median reduction in Lp(a) levels after a single dose of SLN360 or Zerlasiran, we saw up to 98% of the 600 milligrams dose and 96% at 300 milligrams or half that dose. We're also looking at patients with Lp(a) levels greater or equal to 125 nmol per liter, a slightly lower threshold than in the Phase I study. But as you do work in Lp(a), what kind of MACE reduction do you think you need and if we assume it's about 20% for people to get excited and based on your data so far that you're going to have something like a 95% reduction, where do you have to start in terms of target population and is that what some of the lower dose stuff is all about to kind of understand what reductions you'll need for a MACE effect that people will be excited about? And I think the interesting thing about some Lp(a), again, compared with LDL's cholesterol, is that there is a different phenotype not only affecting the cardiovascular system that we're used to in terms of MACE but also affecting the aortic valve. First on Zerlasiran, I'm just wondering whether that population of greater than 125 nmol per liter Lp(a) would be the baseline population that you'd be thinking about in a potential outcome study and what gives you the confidence that, that event rate associated with that population, would it have you running a study for 6 to 8 years. We've gone through a high-risk population, even though the slightly lower Lp(a), it does differentiate us from our competitors and potentially would allow us to explore a slightly broader population. And the final one for me is just data that we've been picking up over the years and particularly at ACC recently in March, it does suggest that there might be elevated Lp(a) levels in females but certainly in the Black American population as well. And we clearly highlighted some of the milestones, including the top line multiple dose SLN360 data from APOLLO by year-end, top line multiple dose data from SLN124 in thalassemia and the complete enrollment of Phase II in the SLN360 ASCVD trial."
}