{
    "symbol": "EVR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 10:57:03",
    "content": " During today's call, all parties will be in a listen-only mode. I would now like to turn the conference call over to your host, Evercore's Head of Investor Relations and ESG, Katy Haber. I'm Katy Haber, Evercore's Head of Investor Relations and ESG. This conference call is being webcast live in the For Investors section of our website and an archive of it will be available for 30 days, beginning approximately one hour after the conclusion of this call. These factors include, but are not limited to, those discussed in Evercore's filings with the SEC, including our Annual Report on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K. In our presentation today unless otherwise indicated, we will be discussing adjusted financial measures, which are non-GAAP measures that we believe are meaningful when evaluating the company's performance. As we have noted previously, our results for any particular quarter are influenced by the timing of transaction closings. Since we last spoke a quarter ago on our earnings call, macroeconomic uncertainty and market volatility have intensified. The outlook from here remains clouded given numerous macro challenges including historically high inflation, supply chain constraints, rising interest rates, geopolitical tensions, and the current regulatory environment. In addition, financing markets have also continued to tighten, making it harder to access capital and now at higher rates and wider credit spreads. This is a notable change from where we were just a few months ago, all of these macro-economic and market factors have impacted our businesses as uncertainty is never good for M&A or capital raising; however, with all that said Evercore generated a solid second quarter. For the second quarter, we generated $637 million in adjusted net revenues, $576 in adjusted advisory revenues, and $2.46 in adjusted earnings per share. Consistent with last quarter, our backlogs remain strong but was more risk as we continue to face headwinds that I just noted. Looking at the overall M&A market year-to-date global and U.S. M&A announced dollar volume decreased 20% and 28% respectively, compared to the first half of 2021. For the largest deals, those above 5 billion global activity remains below the record levels in 2021 with dollar volume down 8% and the number of announced deals down 24% as compared to the first half of last year. That said, when comparing volumes to a more normalized year and not last year's record M&A activity is still quite solid. We believe we are well-positioned to address our client's need and to help them plan for the dynamics of this environment, highlighting the significant investments that we've made over time. Turning to the quarter, the previously mentioned macroeconomic and industry forces impacted investment banking revenues. However, our business diversity enabled us to achieve solid results for the firm indicative of the revenue-generating power of this franchise. In advisory, we saw continued strength in some of the largest sectors including Technology, Media and Telecom, Healthcare industrials, and the beginnings of an improved environment for energy driven both by our corporate and sponsor clients. In addition, our European advisory team had a very strong quarter as a result of investments that we've made over time and we continued to fill white spaces, both geographically and from a sector perspective in the region. In Capital Advisory, we saw continued activity in our GP-led transactions, fundraising, secondary investments, continuation fund opportunities, and Real Estate Capital Advisory. In terms of restructuring, we are starting to see an increase in dialogs as it is becoming harder for companies to access the public debt markets. That said, corporate balance sheet generally remain healthy, default rates are still low historically versus averages, and the environment is setting up differently than the restructuring cycle seen in 2020. Away from traditional IPO and follow-on activity, which has been extremely quiet, we've seen a strong uptick across our platform in aftermarket offerings, also known as ATMs as well as private placements. We continue to build our pipeline and would expect to see the conversion of the pipeline, when markets stabilize and as financing needs in some sectors become more acute into the year-end In our equities franchise while the market volatility has had varied impacts on our business and our clients, our team is deeply engaged with clients guiding them through the volatility. The firm also successfully hosted 10 conferences and symposiums in the second quarter, including our inaugural Global Clean Energy Summit that was a cornerstone event for Evercore's ISI and Advisory energy transition efforts and was well received by our clients. And lastly, in Wealth Management, long-term performance remains strong and we continue to generate new businesses in the quarter, despite some shrinkage in AUM linked to market performance. Across our advisory teams we are pleased to have added seven Senior Managing Director so far this year, all-in key strategic areas, which we have previously identified including TMT, debt advisory in placement, ECM and Europe. As it relates to compensation, we are mindful of the environment and are focused on building our franchise prudently as we continue to invest in the key areas of growth that support our medium to long-term strategy. Even in this less certain environment, we've bought back a significant amount of stock and we'll opportunistically buyback share as well maintaining a durable balance sheet. Despite today's uncertain environment, we are confident that we have the team and capabilities to serve our clients throughout all environments and we will continue to drive towards achieving our long-term goals. For the second quarter of 2022 net revenues, net income, and EPS on a GAAP basis were $631 million, $96 million, and $2.33, respectively. Second quarter adjusted net revenue was $637 million, down 8% year-over-year. Second quarter adjusted advisory fees of $576 million were 3% higher year-over-year, driven primarily by an increase in the average fee size. Consistent with market trends our underwriting business continued to be adversely affected by broad market volatility that drove a significant decline in issuance resulting in $14 million in revenue, down 72% from the year ago period. Our equities business continued to perform well with commissions and related revenue of $52 million, up 3% year-over-year, driven primarily by higher trading volumes. In Wealth Management, adjusted asset management and administration fees were $18 million, down 5% versus a year ago, primarily driven by market depreciation on AUM. Second quarter adjusted other revenue net, was a loss of $23 million, largely reflecting losses on our investment funds portfolio, which is used as an economic hedge against a portion of our deferred cash compensation program. In any given quarter, while the hedge has an impact on revenue, the change in market value does not have an immediate corresponding impact on expenses. In accordance with relevant accounting principles, our revenue includes approximately $67 million of advisory fees, driven primarily from transactions that closed in early July. To compare, we recognized $45 million in the first quarter of 2022 and $59 million in the second quarter of 2021 in accordance with the same accounting principles. Adjusted net income was $108 million for the quarter, down 30% versus the year ago period. Turning to our expenses, our adjusted compensation ratio for the second quarter was 61%. The second quarter compensation ratio is our estimate for the full year as of today, but  is subject to change depending on how the balance of the year progresses. Second quarter adjusted non compensation costs of $95 million were up 30% from a year ago, driven by several factors. First, higher travel expenses as our teams return to more normalized travel, as well as inflationary pressures on travel costs. Second, increased search and placement fees driven by our recruiting efforts as well as other operating expenses related to higher headcount, including a larger real estate footprint as we have grown the firm and costs of operating that space, as employees continue to return to office. And third, there were a couple of episodic items in the quarter, including a fee sharing agreement with sub advisers, as well as an increase in bad debt expense versus a reversal in the prior year period. Going forward, non-comp expenses will be reflective of business activity levels, as well as inflationary pressures are returned to business as usual as it relates to travel and entertainment and continued investment in our businesses. Our adjusted tax rate for the quarter was 27%, which was in part affected by the stock compensation benefit, as well as non-deductible expenses including meals and entertainment, which have increased as activity has picked up. As a reminder, our cash generation and needs are dynamic and are heavily influenced by our business needs, expected compensation obligations and timing of capital return, which can result in a fluctuation of a relative excess cash position. In addition, in the quarter, we successfully completed a refinancing of our Series B Notes that were due in the first quarter of 2023 with the issuance of $67 million. Our second quarter adjusted diluted \n Please stand by, your conference will begin momentarily. So obviously, the strength in the advisory business was particularly impressive this quarter and at least based on what we can see it doesn't look as if it was driven by M&A, just given volume levels. Well, the first thing, I'd say is that advisory did have some weight in terms of the performance in this quarter. And so for example, we had strong performance in the U. S. obviously, as always, it's an important driver for us, but also Europe had a very good quarter. And some of the things that we've done in the past, like, added a significant amount of talent into Spain really started to generate returns. In addition, our activism business has been quite active as the activists have continued to move forward. And so generally, we have a number of sources that kick in and I think that's one of the things that we have striven for, which is to try and balance out our business revenues and our capabilities. In terms of sustainability, it's a very uncertain environment. And I don't think there is any business that we have that is immune to what I think are the shocks (ph) that are being felt in the system, whether it's macroeconomic, the geopolitical concern about interest rates. And I think, frankly, a view on what's happening with respect to inflation. One moment for questions. So -- and more a macro thinking level, it is so historically unusual to see strong strategic dialogue in the face of plummeting confidence, spiking financing costs and recession expectations. Well, I think your question is a really good one and we've been thinking about this a lot as we look out into the future. There is a sense that there is a growth long-term in the market, driven by a number of the factors that we've had in the past, which could be technology disruption, it could be clean energy, it could also be the fact that we just see that companies believe that their businesses will expand over time. And as a result, I think when companies get together and when boards speak, they really are talking about what are the prospects. And I think that you've seen the slowdown because we've seen that in the merger stats, but the slowdown is not necessarily a slowdown in dialogue, it's a slowdown in actual activity. And I think that there is definitely a view in at the corporate board level, I've been in several corporate board meetings in the last two weeks where we've had this conversation, which is companies may not want to set out into something that is really out in a transaction, in a market that is so volatile. And by the way, the interesting thing is, it's hard to be really smart about this because some of this is just going to occur and we're not going to know about it. And as we all know that if we go into a significant recession, that will actually also impact M&A activity and advisory activity generally. One moment for questions. So on sponsors, after their key in stabilizing M&A activity during the COVID crisis, there is a belief that this dynamic would repeat in the next downturn. There is no question that the markets themselves, whether it's leverage loan market, high yield market, those are markets that actually have -- have actually been chilled a bit because of the activity levels and obviously there's some hung bridges out there. So on the buy side, you're seeing sponsors taking a look and watching. I would say then that you're premise, which is that there is a slowing of sponsor activity is true. There's a lot of people talking about what is the possible and a lot of the thematic investments where sponsors have a thematic point of view, they're looking very carefully at what could be happening in terms of price, especially those who are looking to purchase to see whether  the prices come down. One moment for questions. Our next question comes from Brennan Hawken with UBS. Just wanted to start on -- I guess -- sorry, I do limited to one question. So last, I believe you had indicated that you'd expect 61% comp ratio for the rest of the year. Is the market attractive, Evercore has gotten active in prior downturns and it's definitely helped in the long run even though sometimes it can add some near pressure, so any color would be helpful. Brennan, let me start with the recruiting question and then, I'm going to turn to Celeste speak specifically about how we set that comp ratio. And if we have the opportunity to hire A plus talent, we're going to continue to do that because we do believe that it's always an opportunity when there is a lull (ph) in the market to really see whether there is talent who is -- who really fit what we need to bring over. We may get more active or less active given what the opportunity set is, but we are going to stay in the market. Frankly, I'll just make one other comment and then turn it to Celeste, which is, there's more uncertainty and volatility in what we see as the outcomes for earnings then you could see in the past. So when we say, we look six months out, I think that there is just more uncertainty now that we're dealing with than it most times that we've spoken to you in our earnings calls. Brennan, look, given the environment, the comp ratio really is going to be a function of revenue. We last year had a significant amount of operating leverage to some extent, you're seeing that reverse this year. So we obviously pay for performance, but when we have really, really excellent years that accrued and we're able to reduce our comp ratio. And this year, you're seeing a bit of the reverse. I guess the one thing I'll say is just to reemphasize because I think it bears -- reemphasizing which is, we have a strong backlog, but the way we're thinking about around right now is that there is an elevated risk of conversion and that's really what needs to be evaluated. One moment for questions. You said we are consistently reviewing our expense practices, which seems like a purposeful statement, but of course, not surprising to hear in this challenge backdrop. We're not sure where the call dropped out, so I'm going to give more detail than you're asking for on these expenses just to answer that everybody is on the same page with what we think we told you. So just we've said all year non-comps will continue to run about 2021 levels, which was very much reduced by people not doing normal things because they were at home. And there are a number of factors that including the ones we talked to at the beginning of the year, but other factors that drove this quarter. So there, we are seeing an increase in travel as people are getting back to sort of business as usual post-COVID, bankers are on the road seeing clients. And that, as John said, it's really important for us to get out to see our clients. And we're also seeing the big increase -- the increases in person conferences like the Clean Energy Summit, which was really a great event for us as well as other events. Domestically our trips as a percentage of trips pre-COVID, so the same quarter in 2019 were around 69% and then as we look sort of including all the global travel, it was about 64%. They are related to the ones that you would expect like legal and things like that, but the movement from quarter-to-quarter for us is driven by -- typically driven by search and placement. And then generally, our costs associated with the growth over time drives a bigger footprint or you're seeing increase because of our bigger footprint. So that you'll see some of that flow -- you saw some of that flow through this past quarter, you see some flow through in the third quarter, they're not huge numbers, but they add up. But in this environment, we're always going back and looking at policies and data spend and areas beyond the sort of what you need to really invest in your business. So there -- we have non-comps, a lot of them are fixed and we're really focused on the ones that where we don't need to spend or we can defer or we can reduce or just do things differently, and especially as we get bigger. One moment for questions. The way we're thinking about the back half of the year as we do look at the share price and -- we'll be opportunistic in terms of buying back stock, but we really want to focus on maintaining a durable balance sheet given the uncertainty of the environment. But over time, we will invest -- we will return all of our excess capital to shareholders again, as we go forward from here opportunistically from a buyback perspective. One moment for questions. Most have been asked, but I just want to dig in a little bit more here on some of the M&A outlook commentary, hearing a lot about the elongation of deals. But I think as you announced, I mean, volumes down 20% but from a record year last year. So in absolute, it's actually still a pretty good number. So if you were able to close on kind of what's in your backlog, I'm assuming it's still a pretty good year, but there's a lot of uncertainty. So my question is, are you seeing anything break-off yet where deals are actually falling apart versus just the timing being pushed and uncertainty there. And that's this whole discussion on elongation, which is that deals come in and then there is a much longer period. Now honestly, I don't know whether when you see these things get pushed out, whether eventually they will go away. It certainly we -- the way we manage our backlog, we wouldn't allow something to stay in the backlog unless we thought it was legitimately still a live activity. At this point, the way we're looking at things and we scrub this hard, we don't see anything like that. I just -- I don't think things are going to go down unless, if we have a significant recession. But right now, I think we are at a constant place and I don't see it deteriorating from here unless there is another shock. So interest rates are going to go higher and that's something inflation is going to basically impact the way people feel about their businesses, the market volatility will be a reflection of these things and there's always the geopolitical risk. So I just think in all of these scenarios, you have to put more risk into it, which really does make it more difficult to predict. One moment for questions. John, you've been pretty constructive on the business in Europe and it looked like that delivered this quarter, you called that out. I think it is safe to say though that if you put really talented people against interesting situations, you're going to be able to create some real value for the firm by really being able to deliver value for clients. One moment for questions. Our next question comes from Brennan Hawken with UBS. As we enter a period where deal closing timeframes are elongating, restructuring outlook is picking up, increasingly important to try to think about and keep in mind these different sources of revenue because they have different drivers and different levels of cyclicality. There's just a lot of activity, but -- and we think we're really well positioned. And so we're waiting for a change there and I think we're going to see over time, what happens. And as we said there's so much uncertainty in the market right now, but we feel very well positioned there and it's a very important business for us. Obviously, our private capital advisory businesses are very important to us. Our activism business is a business that really is not necessarily market cyclical, although activists get active in different scenarios. And then, the equity capital markets business, we have a very good number of assignments lined up in our backlog there and we believe that if that market opens up, that's going to have real activity for us. Obviously, we're building our sponsors business. But building out that business I think, is going to help us also. But at the end of the day, I do want to make sure that I'm clear about one thing, which is the merger business is a very important business for us and obviously, it's very impactful for us."
}