{
    "symbol": "GP",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-14 15:15:11",
    "content": " GreenPower also has a significant number of opportunities for our all-electric school buses in California, utilizing the standard HVIP poachers which has $250 million of new funding this year, school bus set aside funding with $135 million as well as the CEC Air Quality Management District and BW Trust funding for the purchase of all-electric school buses. The Working capital included $7.9 million in AR, the majority of which was current at quarter end and $46.2 million in inventory which was comprised of over $34.6 million of finished goods inventory, primarily representing EV Star Cab and Chassis, EV Stars, EV Star Cargo and both BEAST and Nano BEAST school buses. To conclude, we've generated significant sales in our past quarter with our commercial vehicles and we expect that with our passenger as well as the school bus sales kicking in over the next several quarters to help further accelerate that along with the organic growth within the commercial vehicle group. So what I mean by that is that there's a number of states that have state contracts that have almost like buying groups, whereas others, like California, there's just a whole slate of different funding programs for school buses. And if, not to set an excuse or anything but in the school bus space, it's a little bit of a unique proposition that unlike the commercial there are more parties that need to be engaged in terms of getting infrastructure in place, getting contracts completed and signed and approved. Well, I think it's a combination but infrastructure is less of an issue on the commercial side in that it's a simpler approach in some cases compared to school buses where they're looking at everything and anything that we're well into the particular vehicle that is going to meet their duty cycle requirements and the combination of payload and what they want to achieve. On our Nano BEAST Type A, we're looking at EPA funding of $285,000 and that was higher than where we, with our various dealers, had been targeting where prior to the EPA program coming out, it was more typically in the $260,000 to $270,000 type ballpark and $265,000 tended to be a number where some of the other Type A electric school bus manufacturers had also priced their products."
}