{
    "symbol": "GP",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-15 15:19:07",
    "content": " Revenue for the first quarter included the delivery of three BEAST Type-D all electric school buses, 2 EV Star Plus, one EV Star Cargo Plus, five EV Star-22-foot-cargoes, six EV Stars, and four EV Star Cab and Chassis. As well, we had approximately $24.6 million of finished goods inventory at the end of the quarter, which was comprised of Type A and Type D school buses, a full range of EV stars and several Class 8 vehicles. We are working with the state of West Virginia and the city in terms of related opportunities, I should say, for -- such as ensuring that everybody gets their applications in with the EPA program, which the online applications close at the end of this week for the EPA funding, as well as ramping up a number of initiatives that will be talking about over the next number of weeks. But in our case, our focus has been on communicating to our prospect of customers that, getting the first number of BEAST or Nano BEASTs deployed with them and sort of working out the kinks, if you will, is much more advantageous for both parties in terms of really optimizing a full rollout of the program and being in a position with finished goods inventory helps us achieve that goal where others can't. And so the -- as Brendan said, at the end of June, we were substantially complete on the first 100, we were starting the next 100 in terms of the actual Cab and Chassis build, but we're also on the third 100 working on battery packs and the key components and the fourth 100 tranche and the fifth 100 tranche with -- in terms of supply chain on electronics and many of the other key subcomponents that go into the ultimate build. As far as deliveries are concerned, we have a delivery schedule that we've been keeping to for them, and we have a first small number of vehicles coming out that that they're getting -- that they've gotten actually already that they're starting the line with before they start kind of mass manufacturing as it were."
}