{
    "symbol": "FENG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 21:28:02",
    "content": " While we were seizing our monetization opportunities, we continue to build our brand differentiation through content production and distribution and elevate our media inputs in various industries and the communities, especially through industry standards and norms. During this quarter, we continued to demonstrate our media expertise and deliver in-depth news to our users across all platforms. We covered major national and new stories such as the escalation of the Russian-Ukraine war, the tension in the Taiwan Strait, the passing of Queen Elizabeth, II of the U.K.; and assassination of the former Prime Minister of Japan, Shinzo Abe. It was a fast news approximately, sending push notifications on more than 75% of the key updates of the event, leading to a high user reach and pleased to reach. Once the push notification is open address, our users are directed to other related highlights on contextualized contents. Besides Pelosi's flight tracker, we were also one of the first media live streaming her landing at Taiwan Airport, following up by live interviews of field experts in military affairs and international relations, who provided their professional opinions and shared their interpretation of the situation. Besides a 10% increased in the click-through rates and 20% increase in average time spent year-over-year for our news app, our news accounts on certain party platforms also gained substantial popularity. Weixin video accounts, Douyin and Kuaishou, with 65 articles generating over 100,000 new leads and over 500 videos generating over a million views. We continue to build our media influence, our new partnerships through events. Over 50 senior officials, including John Ka-chiu Lee, Chief Executive of Hong Kong Special Administrative Region, and actors and entrepreneurs gathered together to exchange ideas and look for solutions and opportunities for the economic development of the Greater Bay Area and China as a whole. The series is collaborating with journalism -- journalists and influencers located in 14 countries over five continents and employs, domestic and overseas social media as main distribution channels with the accumulated 20 million followers across all channels. As Chinese brands continue their efforts to grow their business and brand overseas, Global Insights became an effective marketing solution for them to increase the international exposure. During the quarter, we collaborated with one of the major electric vehicle brands and fueled their new models to rolling out the production line in Indonesia, showcasing their innovative technology and product development. With our global resources, operators and distribution channels, we are becoming a reliable partner for Chinese brands to build strong resilient and truly global brands. We also refined our other original content products such as the micro documentary series, The Journey. From a positive care doctors daily work caring for people living with serious illness to a young man from a remote village changing his life through education, the series tells the story about affection, courage, resilience dedication and wisdom, all of which are greatly valued by our general audience and by which brands also like to be endorsed. Specifically, we focused on increasing user engagement by improving the common feature by allowing users to collect badges. Comments can also be quoted by other users and displayed as dialogue, which stimulates more discussions and debates. Upon analyzing users' viewing history, preferences and engagements we were able to refine their profile based on their interests, standpoints, level of education and so on and distribute videos personalized to each user profile. Aside from delivering information, we increased the supply of contents that fulfill our users' interests and needs for entertainment. With these joint efforts, the average time spent per user increased by 20%. For our real estate vertical, although there have been numerous â\u0080\u0093 numerous â\u0080\u0093 numerous product for resale homes, new home sales and the marketing campaigns remain standard. Meanwhile, we are focused on growing our B2B influence through industry collaboration and content offerings. Together, we are going to refine the ESG rating system for real estate developments, complement the company profiles and drive healthy and sustainable growth for the industry. As we added the collection of important food components to our product selection, our customer service has expanded to Weixin groups with new product information and coupons are regularly shared with our loyal review customers and their needs are properly attended to which substantially increased the rate of repurchase. Phoenix upward our digital connection platform, launched last quarter, released an action featuring the virtual character Julie , a favorite landmark in celebration of The Chinese Mid-Autumn Festival. Going forward, as virtual characters emerge as a new trend in digital marketing, Julie will complement our innovative marketing solutions and future events to assist our advertising clients reach more, younger audiences. In summary, despite the macro headwind, we remain committed to strengthening our brand influence through breaking news coverage and organizing events, while continuing to enrich our offerings and upgrade our products. Going forward, we will certainly remain prudent, in evaluating business initiatives, aligning our business with shifting industry dynamics and elevating our brand influences through consistent delivery of contents with high value. With that, I will now pass the call on to our CFO, Mr. Edward Lu to provide a closer look into our quarterly financials. To elaborate, net advertising revenues were RMB172.4 million compared to RMB216.6 million in the same period of last year. Paid services revenues were RMB22.4 million, compared to RMB28 million in the same period of last year. Loss from operations in the third quarter of 2022 was RMB36.5 million, compared to RMB206.3 million in the same period of last year. This is mainly because the company recognized RMB140.4 million of allowance for credit losses in the third quarter of 2021, relating to the entire amount of accounts receivable and the notes receivable from Evergrande Group. As of September 30, 2022, the company's cash and cash equivalents term deposits short-term investments and the restricted cash for RMB 1.3 billion, or approximately US$159.4 million. Finally, I'd like to provide our business outlook for the fourth quarter of 2022. For net advertising revenues, we are forecasting between CNY 187.8 million and CNY 202.8 million. For paid service revenues, we are forecasting between CNY 15.4 million and CNY 20.4 million. In summary, our top line came under increased pressure this quarter due to the current macro headwinds. While we remain dedicated to expanding our media presence and diversifying our revenue stream, we are working to align resources to appropriate sharpening focus on a clear type of priority. Thank you for taking my question. During the recent quarters, we've seen a slowdown in ad demand, while advertisers are cautious with their outstanding. Thank you for your question. First of all, our breaking news coverage and the creation of hot topics have always been our key streams. This brings us high user traffic, and especially high user engagement, which is essential to effective marketing. Our advantage also like in creating content that resonates with users through our content advertisers establish connections with their target customers and associate their brands with universal values such as courage, resilience, persistence and love. The mini documentary we mentioned earlier, The Journey is an excellent example of this type of content marketing. We are catering to middle- to small-sized advertisers with creative and combining content marketing solutions, which in general higher in gross margin. As they tap into our total market, they often need a complete different marketing strategy to build their brands abroad with our contracted things generally and KOLs all over the world. And our global network of resources and highlights, we can promote Chinese brands and the culture more effectively from a global perspective. We have accumulated a large user base over 130 million third-party platforms including Weibo, Weixin, Douyin & Kuaishou and BiliBili, Kuaishou. Thank you for your question. Thank you for taking my question. We have set a very strict goal to bring down cash burn, by focusing on returning to profitability and specificating, a faster turnaround of our accounts receivable. During this quarter, our sales and the marketing expenses decreased by 22%, year-over-year. So overall, we will continue to manage our operation and cash position with cautious while driving to achieve perfect and positive operating cash flow."
}