{
    "symbol": "FENG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 01:07:06",
    "content": "  Operator: Thank you all for standing by, and welcome to the Phoenix New Media Second Quarter 2022 Earnings Call. On today's call, management will first provide a review of the quarterly results and then conduct a Q&A session. Before we move on to the prepared remarks, I'd like to refer you to our safe harbor statement in our earnings press release, which applies to this call as we will make forward-looking statements. Finally, please note that unless otherwise stated, all figures mentioned during the conference call are in RMB. In the second quarter of 2022, the nationwide COVID resurgence continued to exert pressure on our business. While some of our marketing executions will postpone the cancels, many of our advertisers choose to tighten their branding budget in a highly uncertain macro environment. We concentrated on expanding our media presence through offering premium content, made significant upgrades to our products and continued to explore new business opportunities to diversify our revenue streams. This year, Mrs. Carrie Lam, former Chief Executive of Hong Kong Special Administration Region and nearly 30 other political dignitaries and business tycoons gathered at our online premise to exchange and share insights and ideas on the global and Chinese economy. The summit generated an immense number of views and discussions on social platforms with 300 million views on Weibo and was reported by more than 60 media outlets, making it one of the most high-profile events during the quarter. In terms of new events coverage, we jointly planned a 2-day special coverage with PhoenixTV on the 25th anniversary of the establishment of the Hong Kong SAR. We invited scholars and actors to participate in feature interviews and discussions focusing on hot topics such as opportunities and challenges faced by the region in areas of politics, finance, innovation and education. In addition, we reacted 10 memorable moments in 25 years of Hong Kong SAR history into digital, collectibles which were not only sought after in the digital marketplace but also attracted more younger generations to our event coverage. Our investigative column, Eye of the Storm, , focused on availing and exposing relevant facts behind controversial topics and social phenomena, ranging from financial scam targeted at seniors to the pollution caused by electric car manufacturers. Our in-depth opinion column, the messages function explore trending hot topics with a focus on ordinary individuals and life stories, especially on the pandemic prevention and control. It covers these topics from different angles, such as laws and regulations, industry standards, social economy, public policy using an authoritative rational and constructive style consistent with our content strategy and differentiation. On the video content front, our newly launched original series, the Journey, , went viral across all social platforms. in our spotlight was a tech company executive suffering from ALS but is resilient and persistent, a restaurant owner struggling to support its business under the pandemic and a mid-age  navigating his life after losing his jobs. Each series episode received 10 million views across the Internet and generated over 100,000 new followers on Douyin and Bilibili. In terms of our product, we continue to refine our iFeng app during the quarter. The newly developed page, integrating all news articles in app with audio functions allow users to listen to the interactive latest update of their preferred news while performing other tasks. On the other hand, our algorithm distribute content based on nearly 60 user profiles to fulfill their news and interest-based content needs. A sentence or 2 of their own sorts or calling out a quote helped highlight the content in the news feed, which leads to more clicks and a few interactions and discussions. As we continue to optimize our traffic acquisition costs, our user traffic remains stable, while our user engagement has improved. For our real estate vertical, the aftershock of the industry regulation and liquidity concerns lingered and the macro environment remained uncertain. While driving growth in real estate advertising was challenging, our team vigorously promoted innovative solutions to our clients, including selling customized appliance packages. In the meantime, our ESG index released in the second quarter became the first comprehensive ESG ranking in the real estate industry, highly recognized by investors and property developers. As previously noted, we published a compilation of digital historical moment in honor of the 25th anniversary of the establishment of Hong Kong SAR. The first collection launched One Thousand Li of Rivers and Mountains, a 12th century painting in the collection of the Palace Museum was sold out within 1 hour of release. As such, we believe that, in addition to the sale of digital collectibles, they can complement our future events and marketing solutions. In summary, despite the macro headwinds we remain committed to strengthening our brand influence through bridging new coverage at our signature events, while continuing to enrich our content offerings and upgrade our product. At the same time, we cautiously evaluated and invested in new business initiatives to diversify our revenue streams. In the future, we will prudently manage our business operations while focusing on business development and emerging growth areas. With that, I will now turn the call to our CFO, Edward Lu to provide a closer look into our quarterly financials. To elaborate, net advertising revenues were RMB 160.5 million compared to RMB 233 million in the same period of last year. The decrease was mainly due to the reduction in advertising spending of advertisers in certain industries, the intensified industry-wide competition and the negative impact of the COVID-19 outbreak in certain regions in China in the second quarter. Moving on to our balance sheet, as of June 30, 2022, the company's cash and cash equivalents, term deposits, short-term investments and restricted cash were RMB 1.33 billion or approximately USD 198.5 million. Finally, I'd like to provide our business outlook for the third quarter of 2022. For net advertising revenues, we are forecasting between RMB 179.6 million and RMB 194.6 million. For paid service revenues, we are forecasting between RMB 17.6 million and RMB 22.6 million. In summary, our advertising business experienced continued pressure due to the impact of the COVID outbreak during the second quarter of 2022. Going forward, we will continue to investigating new business initiatives to improve our revenue stream mix. shows that from January to May, the total marketing spending decreased by over about 10% year-over-year Certain industries were affected even more. For example, the auto industry, one of our major client industries, their marketing spending dropped by around 25% from January to May. From June, however, as the economy gradually recovers from COVID impact, businesses once again started to invest in branding and marketing to help their sales growth. So for the rest of the year, given this trend continues, we hope our advertising revenue will pick up. Actually in the first half of the year, through our breaking news coverage and original content, not only did we increase user engagement in our iFeng app, but also our user base on the third-party platforms increased by 30%, reaching nearly . At the same time, we are introducing creative marketing tools such as digital collectibles and virtual characters to fulfill advertisers' need for creative marketing, also utilizing our international background and perspective. With all these joint efforts, we are hoping to see growth recovery in our advertising revenue in the second half of the year. Actually, as mentioned on our last call, our goal is to return to profitability in the next 2 to 3 years. During the second quarter, we continue to drive efficiency in all areas on day-to-day project execution level, we closely reviewed the cost structure of each project, demanding a higher gross margin. In terms of business lines, especially the new initiatives, we set clear growth and performance measurements and conduct frequent reviews. Also on a higher level, we did thorough analysis on bandwidth, marketing, labor cost and so on to drive overall cost optimization, which should pay off with better results in the following quarter."
}