{
    "symbol": "FENG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 00:55:02",
    "content": " On today's call, management will first provide a review of the quarter results and then conduct a Q&A session. In the first quarter, the nationwide COVID resurgence continued to impact the execution of some of our advertising services. In the first quarter, our coverage of a number of significant news events once again received extensive media exposure and market attention, highlighting our team's professionalism, our leading position in news reporting. In addition, we distributed tailored content catering to diverse individual user needs by offering slow livestreaming, short videos and reporting from frontline correspondents. Our livestreaming coverage of the war garnered 250 million views on our own platform and over 1 billion accumulated views on third-party platforms, including Douyin, Kuaishou and WeChat video. In addition to our breaking news coverage, we also continued to expand the monetization capabilities of our original content production. During the first quarter of 2022, our documentary series titled Mega Projects demonstrated unique commercial values as we focused on developing high-quality content related to the renewable energy industry. In the first quarter of 2022, we achieved a breakthrough in commercialization by partnering with clients in the banking and automotive industries to launch a number of original contents that support their globalization initiatives. In addition to developing original content, we continued to explore the livestreaming format while further enhancing our distribution and monetization capabilities. There are many styles of content in livestreaming and our differentiation is in live interview format, which maximized synergies between our professional media DNA, content production capabilities and extensive contact network. On the financial news front, we conducted live interviews with a number of renowned economists, analysts and business executives who shared their thoughts on global stock market trends and related financial topics. It's attracted nearly 1 million viewers during livestreaming session, received over 1.3 million playbacks across the Internet and also exceeded the milestone of 10,000 paid views for viral sharing and exposure on WeChat, which added 40,000 followers to our official account. For our live chat features, we mainly offered professionally generated content with a focus on military affairs and trending topics in various content verticals. By integrating core content production with user interactions, we attracted more users to join our live chat to discuss the topics of interest with the hosts, thus enhancing our user retention as well as lengthening users' time spend in the app. With many other online communities featuring user-generated content ecosystem, we must face the challenge of recruiting the top-tier content creators and generating high-quality and more interactive content for our users. We continued to develop our online reading segment during the quarter, collaborated with a few more online reading platforms to monetize our premium IP content and further expanded our original content IP library to lay the groundwork for developing new revenue growth drivers. During this challenging period, our team continued to increase our media influence in the real estate sector by delivering original content at event campaigns. In summary, during the first quarter, we worked tirelessly to overcome the negative impact of macro uncertainties on advertiser demand and our own off-line operations. We continue to enrich our content offerings, refine our livestreaming capabilities and enhance the user experience of our APP. To elaborate, net advertising revenues in the first quarter of 2022 were RMB 158.4 million compared to RMB 201.3 million in the same period of last year. The decrease was mainly due to the reduction in advertising spending of advertisers in certain industries, the intensified industry-wide competition and the negative impact of the COVID-19 outbreak in certain regions in China in the first quarter. Revenues from paid content in the first quarter of 2022 were RMB 4.6 million compared to RMB 10.5 million in the same period of last year, mainly due to the reduction in content spending of certain customers. As of March 31, 2022, the company's cash and cash equivalents, term deposits, short-term investments and restricted cash were RMB 1.41 billion or approximately USD 222.8 million. For the second quarter, we are forecasting total revenues to be between RMB 198.6 million and RMB 218.6 million. For net advertising revenues, we are forecasting between RMB 167 million and RMB 182 million. For paid services revenues, we are forecasting between RMB 31.6 million and RMB 36.6 million. In summary, we experienced significant volatilities from the macro environment in the first quarter, while challenges from industry-wide competition remain. As we continue to expand our presence through news coverage and original content production and monetization and in order to minimize the negative impact on our bottom line, we are taking necessary steps to adjust our operational strategy and have made greater efforts on cost control and reducing expenditures. Also, in the meantime, in order to create an engaging community for users and increase our user retention rate, we allocated more resources to upgrade product features and tried to enhance social interactions on our iFeng app. While our top line growth remains our focus, we also determined that we need to constantly review our cost structure, reduce our loss as much as we can and support business development with an effective cost structure. Our goal is to bring our core portal business, which is still our online news and content provided through our PC, mobile app and third-party platforms, to breakeven in the next two or three years and to make meaningful progress with our new initiatives, including our online reading, e-commerce and so on."
}