{
    "symbol": "WES",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 17:33:09",
    "content": " Additionally, in the fourth quarter of 2021, we recorded $26 million of unfavorable revenue recognition cumulative adjustments associated with lower cost of service rates, predominantly at the DJ Basin oil system, which we did not see in the first quarter of 2022. These new long-term agreements, along with increased producer activity levels support our need for additional gas processing capacity and solidify our decision to sanction a new 300 million cubic feet per day gas processing train at our existing Mentone plant, which is part of our West Texas complex. This decrease was primarily due to reduced throughput in the Delaware Basin due to well completion timing and instances of inclement weather during the quarter, lower expected volumes at our DJ Basin complex and on our equity method investments, and production declines in our other operated assets. Our crude oil and natural gas liquids throughput decreased by 4% on a sequential quarter basis, primarily due to lower volumes at the DBM oil system resulting from well completion timing and weather impacts as well as lower expected volumes in the DJ Basin and from our equity method investments. Our per Mcf adjusted gross margin for our natural gas assets increased by $0.08 relative to fourth quarter 2021, primarily due to strong plant performance and contract mix at the West Texas and DJ Basin complexes. In the DJ Basin, we executed a multiyear amendment to DCP’s gas processing agreement, providing an additional 60 million cubic feet per day of firm processing capacity fully backed by a minimum volume commitment with DCP retaining the right to increase their firm space by another 40 million cubic feet per day. I mean, just to highlight how significant that is for us, 400 million a day of new additions, a 30% increase on the volumes that we saw through our processing stack during the first quarter, that’s just in one quarter the additions that we were able to achieve."
}