{
    "symbol": "WES",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:38:02",
    "content": " However, we experienced reduced excess natural gas liquids volumes in combination with lower natural gas liquids pricing, lower distributions from equity investments and higher operation and maintenance expense, which were the primary drivers behind the sequential quarter decrease in adjusted EBITDA. Relative to the second quarter, our third quarter adjusted gross margin decreased slightly as increased throughput across all three products in the Delaware Basin was offset by lower distributions from equity investments and lower excess natural gas liquids volumes under our fixed recovery contracts in combination with lower overall natural gas liquids pricing. Relative to prior quarter expectations, we now expect this reduced rate of growth to have a slight negative impact on our portfolio-wide 2022 throughput for crude oil and natural gas liquids volumes and produced water volumes. Our per MCF adjusted gross margin for our natural gas assets decreased by $0.03 compared to the prior quarter, primarily due to decreased distributions from our equity investments and lower excess natural gas liquids volumes under our fixed recovery contracts in combination with lower natural gas liquids pricing. Our per barrel adjusted gross margin for our crude oil and natural gas liquids assets decreased by $0.24 compared to the prior quarter, primarily due to expected lower distributions from our equity investments that we highlighted on last quarterâ\u0080\u0099s call. From an M&A perspective, we closed on the acquisition of the remaining 50% interest in the Ranch Westex natural gas processing plant in the Delaware Basin for $41 million, providing us immediate access to 125 million cubic feet per day of incremental operated processing capacity. From a free cash flow yield perspective, WES has maintained the highest free cash flow yield relative to our midstream peers, large-cap, publicly-traded midstream companies, the S&P 500 Energy Index and by an even greater degree relative to the S&P 500, it is also interesting to note that WES has outperformed the exploration and production dominated S&P 500 Energy Index despite the fact that those companies have benefited greatly from higher oil prices over the past several quarters."
}