{
    "symbol": "WES",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 21:25:06",
    "content": " Our second quarter financial success was primarily driven by increased throughput across all three products in the Delaware Basin and higher distributions from equity investments, partially offset by higher operation and maintenance expense. We also achieved several records in the quarter including record natural gas throughput in the Delaware Basin, processing 1.5 Bcf of gas per day, record produced water throughput in the Delaware Basin, gathering 864,000 barrels per day and record adjusted EBITDA for the second straight quarter, generating substantial free cash flow. Our adjusted gross margin increased by approximately $51 million on a sequential quarter basis, due to increased throughput across all three products in the Delaware Basin, and increased natural gas throughput in the DJ Basin. Additionally, our strong plant performance in the second quarter and elevated commodity prices resulted in incremental gross margin associated with the retained excess natural gas liquid volumes under our fixed recovery contracts. Turning to cash flow, our second quarter cash flow from operations totaled $467 million, which was a material increase compared to the prior quarter due to our strong adjusted EBITDA performance and positive working capital changes from normal course of business. Our per Mcf adjusted gross margin for our natural gas assets increased by $0.02 compared to the prior quarter, primarily due to changes in our contract mix and increased throughput at our West Texas complex, which has a higher per Mcf margin as compared to our other natural gas assets. The second quarter, is probably a better run rate going forward, with the exception that in the third quarter, we're expecting to spend around $10 million, on a field level project, that's working with our transformation effort allowing us to be more efficient and proactive on the maintenance and repair side."
}