{
    "symbol": "SNA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 11:28:03",
    "content": " Our reported sales in the quarter of $1.125 billion were up $64.8 million or 6.2% versus last year, including $39.1 million of unfavorable foreign currency. And if you compare it to the pre-pandemic levels of 2029 -- 2019, you see a clear and unmistakable upward drive, versus 2019 sales we're up 3% as reported and 2.8% organically, continuing our positive trend and accelerating our expansion, demonstrating that we're only getting stronger every day. And progress to what, Opco operating income of $223.5 million increased $22.2 million from last year, and the Opco operating margin was 20.3%, up 90 basis points from last year and rising 170 basis points over 2019. Sales in the quarter of $356.8 million were up 1.5% or $5.4 million as reported versus 2021, including a $26.2 million or 7.9% organic uplift, operating progress across all divisions, which was offset partially by $20.8 million in unfavorable foreign currency. Compared with pre-virus 2019, sales were $111.4 million or 28.9%, including a $113 million or 29.5% organic gain, and this quarter's 20.6% operating margin was up 680 basis points versus 2019, coming out of the pandemic stronger indeed. RCI, RS&I operating earnings were $95.4 million, representing a $12.1 million increase versus 2021, and the operating margin was up 10 basis points from last year to 23%. And RS&I, expanding profitable volume with repair shop owners and managers, staff on overall sales rising again, 10.4% and 22.8% organically versus last year and the pre-pandemic level, respectively, continuing clear and positive growth. Net sales of $1.125 billion in the quarter increased 6.2% from 2021 levels, reflecting the 10.4% organic sales gain, partially offset by $39.1 million of unfavorable foreign currency translation. Net earnings of $223.9 million or $4.14 per diluted share increased $27.7 million or $0.57 per share from last year's levels, representing a 16% increase in diluted earnings per share. Sales of $356.8 million increased from $351.4 million last year, reflecting a $26.2 million or 7.9% organic sales gain, partially offset by $20.8 million of unfavorable foreign currency translation. Operating earnings for the C&I segment of $52.3 million, compared to $53.6 million last year, the operating margin of 14.7%, compared to 15.3% a year ago. Sales in the Snap-on Tools Group of $496.6 million increased 5.3% from $471.4 million in 2021, reflecting a 7.4% organic sales gain, partially offset by $8.9 million of unfavorable foreign currency translation. Operating expenses as a percentage of sales of 24.3% improved 70 basis points from 25% last year, reflecting the benefits from higher sales volumes and savings from RCI initiatives. Sales of $414 million compared to $364.4 million a year ago, reflecting a 17.2% organic sales gain, partially offset by $11.2 million of unfavorable foreign currency translation. Operating expenses as a percentage of sales of 19.9% improved 400 basis points from 23.9% last year, primarily due to benefits from sales volume leverage, higher activity and lower expense businesses and savings from RCI initiatives. Total loan originations of $300.2 million in the third quarter increased to $30.9 million or 11.5% from 2021 levels, reflecting a 12.5% increase in originations of finance receivables and an 8% increase in originations of contract receivables. As it relates to extended credit or finance receivables, trailing 12-month net losses of $42.2 million represented 2.41% of outstandings at quarter end, and were down 7 basis points as compared to the same period last year. The line is open now, please go ahead. The line is open now, please go ahead."
}