{
    "symbol": "CNK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 14:58:05",
    "content": " Examples include continuing to strengthen the experience and value we provide our guests through premium amenities like XD, D-Box and laser projectors as well as enhanced concession offerings; increasing moviegoing frequency through our omnichannel marketing platforms, extensive consumer reach, highly impactful loyalty programs and data-driven promotions; expanding our strategic relationships with content creators, retail partners, in-home delivery services, and new e-commerce sales channels; scaling up our recently launched Snacks In A Tap online food and beverage ordering platform, while reducing friction in theater with improved floor designs; and planograms and driving meaningful additional efficiencies and cost savings through our ongoing workforce management, continuous improvement and sourcing initiatives. Film rental and advertising expense was 56.9% of admission revenue, up 70 basis points from the fourth quarter of 2019, due primarily to a higher percentage of box office generated from blockbuster films during the quarter, partially offset by modifications in film rental terms. Please proceed with your question. Please proceed with your question. Thanks for the question, Ben. Thanks for the question, Ben. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. 1Q, as I mentioned, it's kind of the profile for the year earlier is another similar scenario to 2022 and that the year gets off to -- or getting off to a little bit slower start from a total volume perspective, fortunately though, as you called out, the actual box office results have been quite favorable with significant growth year-over-year, despite the limited volume. And so, when you look at 2023 thinking about sort of 80% wide releases versus 2019, that would sort of imply a box office of sort of plus $9 billion, which I think is above most people's expectations for the year. Please proceed with your question."
}