{
    "symbol": "RGP",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-04 19:31:05",
    "content": " In addition to our gross pipeline nearing a multiyear high, we continue to make progress with respect to pricing as well, increasing billing rates, excluding taskforce, by 4% on a constant currency basis compared to prior year quarter. Revenue for the quarter was $200.4 million, up 6% over the prior year quarter on a same day constant currency basis and excluding the impact of the taskforce divestiture. In addition to strong top line growth, we also achieved record second quarter adjusted EBITDA margin of 14.8% and record second quarter adjusted EBITDA of $29.6 million, representing 19% growth over the same period a year ago. Geographically, North America and Asia Pacific both performed well with 6% and 16% year-over-year growth on a same day constant currency basis, while Europe declined by 5% on the same basis and also excluding taskforce, largely because of delayed client buying patterns due to growing recessionary pressure. Our run rate SG&A expense for the quarter was $52.7 million or 26.3% of revenue, a 70 basis-point improvement compared to the same period a year ago and better than the favorable end of the guidance range of $54 million to $58 million. We estimate our third quarter revenue to be in the range of $181 million to $186 million, which would be the second highest Q3 revenue in the last decade despite the sale of taskforce earlier this fiscal year. At the high end of the range at $186 million compared to Q3 of last year, same day constant currency, excluding taskforce, youâ\u0080\u0099re looking at approximately a 5% decline. So, what I would say is that what weâ\u0080\u0099re seeing in terms of opportunity is because they have -- they still have enough demand in their pipeline that they can still price aggressively, thereâ\u0080\u0099s an ability for us to take on some of the work that they may have done from an execution standpoint and also for our ability to take over from where theyâ\u0080\u0099re -- where theyâ\u0080\u0099re just kind of toeing the line on pricing, and weâ\u0080\u0099re just simply a better value."
}