{
    "symbol": "PEG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 16:08:02",
    "content": " PSEG reported a GAAP net loss of under $0.01 per share, resulting predominantly from mark-to-market adjustments related to higher energy prices versus our existing forward sale contracts. We exclude these items in calculating PSEG’s non-GAAP operating earnings, which were a $1.33 per share for the first quarter of 2022. For the first quarter of 2021, PSEG reported a $1.28 per share for both net income and non-GAAP operating earnings. As Ralph mentioned for the first quarter of 2022, PSEG reported a net loss of under a penny for share primarily related to the mark to market adjustments and non-GAAP operating earnings of 1 33 per share. PSE&G’s first quarter 2022, non-GAAP operating earnings improved by $0.07 per share over the prior years’ quarter, reflecting rate based editions from our investment programs and the gas system modernization program and the implementation of the conservation incentive program. Compared to the first quarter 2021, transmission was $0.03 per share unfavorable reflecting the implementation effective August of 2021 of the settlement agreement of our transmission formula rate, including a lower return on equity, partly offset by growth and rate base. PSE&G invested $656 million during the first quarter and is on-track to execute its plan 2022 Capital Investment Program of $2.9 billion, which includes infrastructure upgrades, transmission and distribution facilities, as well as the continued rollout of the Clean Energy Future investments and energy efficiency, energy cloud or smart meters, and the electric vehicle charging station infrastructure. This compares to first quarter 2021 net income of $171 million or $0.34 per share and non-GAAP operating earnings of $173 million or $0.34 per share, which included the results of the divested fossil assets. PSEG is forecasting generation output of 21 to 23 terawatt hours for the remaining quarters of 2022, and has hedged approximately 95% to 100% of this production at an average price of $28 per megawatt hour. The forecast of non-GAAP operating earnings for Carbon-Free Infrastructure and Other is unchanged at $170 million to $220 million for 2022, and this guidance excludes results related to the fossil assets sold in February 2022, as all free cash flow generated in 2022 from the fossil operations prior to the closing were translated into an adjustment to the final purchase price."
}