{
    "symbol": "PEG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 14:43:03",
    "content": " As Ralph mentioned, for the third quarter of 2022, PSEG reported net income of $0.22 per share and non-GAAP operating earnings of $0.86 per share. PSE&G's results were $0.03 higher compared to the third quarter of 2021, driven by continued capital investments in transmission, distribution and clean energy. Compared to the third quarter of 2021, transmission margin was flat as growth and rate base of $0.02 per share was offset by the combination of the August 2021 formula rate settlement which included a lower return on equity and the timing of O&M expense first recovery. Gas margin improved by $0.01 per share over the third quarter of 2021, reflecting recoveries of our Gas System Modernization II investments and other margin primarily related to our appliance service business also added $0.01 per share, compared with the third quarter of 2021. Lower shares outstanding had a $0.01 per share benefit on third quarter 2022 results versus the year earlier quarter, reflecting the impact of the completed $500 million share repurchase program. Now turning to Carbon-Free Infrastructure & Other, which reported a net loss of $285 million or $0.58 per share for the third quarter of 2022, compared with a net loss of $1,953 million, or $3.87 per share in the third quarter impacted by the Fossil sale process. As Ralph also mentioned earlier, we've narrowed our 2022 non-GAAP operating earnings guidance to $3.40 to $3.50 per share, with regulated operations contributing approximately 90% of the total. For the full year, PSE&G's forecast of 2022 net income is narrowed to $1,545 million to $1,575 million, reflecting strong transmission and distribution margin growth in the year-to-date period. Please proceed with your question. Please proceed with your question. Please proceed with your question. Hey, good morning, team. Please proceed with your question. Please proceed with your question. Hey, good morning, team. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}