{
    "symbol": "JWN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 21:22:03",
    "content": " As a reminder, we are here today to discuss our business and fourth quarter performance, and we will not be taking questions on other matters. Participating in today's call are Erik Nordstrom, Chief Executive Officer, Pete Nordstrom, President and Chief Brand Officer, and Michael Maher, interim Chief Financial Officer, who will provide a business update and discuss the company's fourth quarter performance. For the fourth quarter, we delivered net sales of $4.2 billion and earnings per share of $0.74. Looking back on the fiscal year, revenue increased 5% from 2021, and adjusted EBIT margin was in line with last year at 3.3%. We saw customers starting to pull back in late June, primarily in Nordstrom Rack, and this trend continued through the holiday season. As a result, we are now in a much healthier position with inventory levels down 15% from last year and in line with 2019 levels. Well, this was the right strategy to better position our inventory levels for 2023, we implemented more markdowns than we had initially planned to achieve our goal. Despite this, I'm pleased that our supply chain initiatives delivered efficiency and lower per unit costs in Q4, resulting in more than 200 basis points of SG&A rate improvement even with lower sales leverage and ongoing inflationary pressures. We entered Canada in 2014 because we believed it presented a compelling opportunity, and we are grateful for the many customer relationships we have built over the years. Despite our team's best efforts, including multiple initiatives to improve our outcomes, our Canadian business has not been profitable. Canada accounts for less than 3% of our total sales, and we believe we will benefit from a sharper focus on our U.S. business. More than ever, I believe Nordstrom is uniquely positioned to meet the changing needs of our customers. We are committed to building on these successes, while delivering on our legacy of service across physical stores and digitally as the customer experience continues to evolve to be even more omnichannel. In addition to improving the customer experience, we are focused on three specific priorities to drive better financial performance in 2023. one, improving Nordstrom Rack performance. two, increasing our inventory productivity; and three, continuing to advance our supply chain optimization initiatives. We estimate that a little over half of the decrease was driven by specific actions we took to improve profitability, namely eliminating costly Rack store-based order fulfillment and raising the minimum order amount to receive free ship-to-store delivery on nordstromrack.com. These actions reduced order cancellations, simplified Rack operations and improved profitability, but negatively impacted top line growth at the Rack. We also cleared out older and unproductive inventory giving us increased open-to-buy and therefore, greater flexibility to improve our merchandise assortment as we enter 2023. First and most importantly, we are prioritizing 100 nationally recognized strategic brands to help us drive sales and grow market share. Simply put, we know we win with customers at the Rack when we deliver great brands at great prices. We believe strong brand recognition drives outsized customer engagement, and these brands are proven performers many of which are not widely available in the off-price space. By increasing inventory turns at the Rack, we can increase the flow of these great brands and give customers newness each time they visit us. Second, we are expanding our reach and convenience for customers by opening 20 new Rack stores this year. Rack stores continue to be our largest source of new customer acquisition, accounting for more than 40% of newly acquired customers in 2022. Our Rack store fleet is underpenetrated, and we have an opportunity to attract more customers and drive profitable growth through a proven model as we expand our reach with more new stores. Third, we will drive greater engagement and higher profitability at nordstromrack.com. Our digital capabilities are unique in the off-price space, and we see opportunities to leverage our digital assets to increase engagement with our Rack customers. We also have a significant opportunity to improve our earnings and returns on invested capital through increased productivity from our merchandise inventory, our largest annual investment. The substantial disruptions and volatility in our business over the past three years had a significant impact on our inventory management and outcomes, including buy plans, receipt flows, stock levels, markdowns and turns. We made great progress in 2022 on our supply chain initiatives, which drove improvement in our SG&A rate despite lower sales leverage and continued inflationary pressure. This year, we will build on our momentum to further improve the customer experience while driving greater expense efficiency. I'd like to talk about our merchandise performance during the fourth quarter, then follow up with highlights from the work streams under each of the three focus areas Erik discussed, starting with merchandise performance. we were pleased to see strength in men's apparel, which was up versus last year and at 2019 levels, particularly in dress wear as people shop for special occasions and updated the return to office looks. To illustrate our efforts to get to a cleaner inventory position, seasonal categories, including outerwear, sweaters and boots, had strong sell-through with ending inventory levels 30% less than prior year. After a robust start to 2022, our designer business softened in the back half, and we are reviewing our inventory positions to adjust where needed to improve productivity. At the Nordstrom banner, we're making progress on delivering selection, relevance and inspiration to our customers by partnering with brands in alternative ways. We grew our sales through unowned inventory models by 10% over the last year, and they now make up 12% of GMV at the Nordstrom banner. We continue to scale our Nordstrom Media Network, which grew over 50% versus last year. In the fourth quarter, we expanded our advertising offering to brands and categories adjacent to Nordstrom, launched offsite partnerships with TikTok and Pinterest and scaled on-site advertising with display ads on nordstrom.com. Our brand partners value the opportunity to connect with our highly engaged and loyal customers with a strong return on ad spend, particularly as advertisers look to diversify their media mix. As Erik mentioned, we're focused on improving Rack performance. As we previously mentioned, 90% of the top 50 brands at Nordstrom are also carried at Nordstrom Rack. Looking forward, our healthier inventory levels provide us an open-to-buy position and we are leaning into strategic brands. While these brands accounted for half of Rack sales in 2022, they make up 60% of our on order for the first half of '23. With more open to buy and access to great brands, especially in the current environment, we are well positioned to deliver a more constant stream of newness and improve inventory flow. A second initiative at Rack is to expand our reach with new stores as part of our closer-to-use strategy, we are encouraged by the results of our three newest stores, which have exceeded our expectations and performed better than the fleet average in terms of sales productivity. This proof point gives us further confidence in the product mix we're working towards and the opportunity for improvement in a Rack business through greater focus on strategic brands, newness and inventory flow. By increasing the penetration of strategic brands online and leveraging our digital marketing capabilities, we will drive traffic and sales both at nordstromrack.com and in our stores. For example, one in five nordstrom.com, buy online, pick up in store orders are actually picked up at our Rack stores after we launched this service just three years ago. We are also maintaining increased reserves against our buy plans, which enables us to be opportunistic in season, and we are planning for faster inventory turns with an increase of at least 10% over 2022 to drive newness and flow while also increasing the return on our inventory investment. It will also improve our ability to buy, allocate and track merchandise across our network provide us greater visibility in the profitability at the unit level, increase efficiency and reduce shrinkage. We made significant progress in optimizing our unit flow from suppliers to customers by both changing some of our ordering practices as well as partnering with suppliers on shipment standards, and we'll be rolling this out further this year. We improved productivity and throughput in our distribution and fulfillment centers by more than 20% through better unit flow, focusing on team member retention and leveraging data for scheduling and training. For instance, our share of orders delivered within four days or less is up 40% from last year. These actions will continue to improve the customer experience, increased sell-through and reduce markdowns by allowing us to place the right assortment with the right depth closer to the customer. In closing, we are entering 2023 positioned for increased agility and are focused on our key priorities for improving the customer experience and our profitability. For the full year, total revenue, net sales and GMV were all up 5%. In Q4, Nordstrom banner sales decreased 2% and GMV decreased 3% versus last year. Nordstrom Rack sales decreased 8%, with a little over half of this decrease attributable to the elimination of Rack store fulfillment starting in the third quarter. Gross profit as a percentage of net sales decreased 525 basis points, primarily due to higher markdowns as we prioritized rightsizing inventory to start fiscal 2023 in a healthier position. Despite lower sales than last year, total SG&A as a percentage of net sales decreased 240 basis points in the fourth quarter, primarily due to supply chain expense efficiencies. As with last quarter, we're pleased with the progress we made on our supply chain optimization initiatives despite labor and transportation cost pressures. For the year, EBIT margin was 3.1%, and adjusted EBIT margin was 3.3%. We have a strong balance sheet and financial position, ending the fourth quarter with $1.5 billion in available liquidity, including the full $800 million available on our revolving line of credit. We expect that elevated inflation and rising interest rates will continue to weigh on consumer spending, especially in the first half of the year. However, we also expect global supply chain disruptions to continue to dissipate, benefiting inbound freight costs and inventory flow. Taking these factors into consideration, for fiscal 2023, we expect revenue to decline 4% to 6% versus 2022. The first is an approximately 2.5 percentage point negative impact from the wind down of our Canadian operations, which delivered sales of approximately $400 million in 2022. The second is an approximately 1.3 percentage point positive impact from the 53rd week in fiscal 2023, which we expect will add approximately $200 million in sales to the fourth quarter. Next, I'll highlight three factors that shape our outlook between the first and the second half of 2023. Year-over-year sales comparisons will be more difficult in the first half against our stronger first half in 2022, with more favorable comparisons expected in the second half. In addition, one week of the anniversary sale will shift from the second quarter into the third quarter this year. We expect improvements in our business to build into the second half especially in the Rack as our merchandise assortment continues to improve, and we open new stores. As a result of these factors, we expect revenue to decrease by a low double-digit percentage in the first half and to increase by a low single-digit percentage in the second half versus 2022. We expect the wind down of our Canadian operations to result in onetime pretax charges of $300 million to $350 million in the first quarter of 2023, primarily related to the write-off of our investment in Nordstrom Canada. Excluding these charges, we expect an adjusted EBIT margin of approximately 3.7% to 4.2% for the full year versus 3.3% in 2022. Our forecast assumes that adjusted EBIT margin expansion will be driven primarily by gross margin improvements from our focus on inventory productivity, especially in the second half of the year when compared to the elevated markdowns we took in 2022. The wind down of Canadian operations will also improve EBIT, excluding onetime charges by approximately $35 million. Continued progress on our supply chain optimization initiatives, will help partially mitigate SG&A expense deleverage resulting from lower sales and inflationary cost pressures. Given the previously mentioned sales and gross margin trends, we expect EBIT margin increases in the second half of the year offsetting decreases from lower sales in the first half of the year. Excluding charges related to the wind down of Canadian operations, we expect adjusted earnings per share of $1.80 to $220 million. We are planning capital expenditures of 3% to 4% of net sales, primarily for investments in supply chain and technology capabilities. We are prioritizing initiatives that will drive greater profitability through improved performance at Rack, a disciplined approach to increase inventory productivity and continued progress on our supply chain optimization efforts. So first of all, on the top line, there's just a number of factors there to bear in mind as you think about starting the year off -- we are first and foremost being we're lapping a much stronger first half of last year. In the first quarter, in particular, we were up 19% year-over-year in the first quarter last year. We also have, as we've talked about, as we're building our assortment of strategic brands in the Rack, we expect to get to a place where we're targeting somewhere around the middle of the year, but we expect sequential improvement as we go through the next couple of quarters. Those will begin here in the spring, so we'll see some benefits in the first half of the year. And then finally, you've just -- you've got the impact of eliminating Rack store fulfillment, which we did in the third quarter of last year. And so that results in a step-up as well when we get into the third quarter this year, and we aren't going against that headwind any further. And as you know, maybe two years ago now, we went with a bargains a strategy that had us lowering AUR a little bit to try to see if we could gather more customers that way. In a lot of ways, what we've learned and maybe validated something we knew all the way along is the secret sauce for us in the off-prices is the quality of the brands that we're able to offer. And that's why the whole kind of great brands, great price thing is really where we're focused. We know that customers come to Nordstrom Rack because they look for the brand, they wouldn't typically find other off-price retailers. And we just were to position this last year where we had to switch inventory, and that really hurt us. So, Erik, could you elaborate on more recent trends that you're seeing maybe across income cohorts in particular, I think you cited the softening more at the lower income side. And then, Michael, -- just in terms of the phasing of the year, could you just maybe help bridge or walk through your confidence in the phasing of revenues front half down low double digits to the up low single digits in the back half of the year. When we look at our customer cohorts, it's pretty clear that the customer across the board is challenged, and there's some softness, and I think particularly in discretionary areas, we have seen that softness more pronounced in our lower income in our Rack business. The cider business for us, I mean, to put this in context, I think this may be the first quarterly call I've been on the last 10 years, what I didn't say designer was one of our best-performing categories last month -- or last quarter. And to put it in a different context, last year, we did more refiners sales than we've ever done in the history of our company. So, what happened to us though is that we had a very large double-digit increase trend going with our sales that dropped rather precipitously to more normalized levels. But I think the good news is our customers over a long period of time have showed a strong interest in the designer business, and it's something that's really important to our overall success, and we have good partnerships there. and again, continues to be an important part of our business and what our customers expect. But if you just look at the way last year progressed relative to that, in the first half of the year, we were up mid-single digits. The other thing is we've talked about is those choices we made around digital sales earlier in 2022, both Racks or fulfillment and also discontinuing our Trunk Club business. So that is together worth about 200 basis points of headwind to the first half of the year, and it essentially -- it disappears in the second half. One of them is the Rack new store openings, I mentioned will begin in the spring, but the cumulative effect of the first half won't be very big. It will be worth about 150 basis points to the second half of the year, though. So -- you put all those things together, and it gets us to a low double-digit decrease in the first half of the year and low single-digit increase in the back half. Just any color on what you've been seeing in the promotional environment exiting the year, particularly as it relates to the planned cadence of gross margin moving through the year would be helpful. But with inventory in a healthier position exiting the year, just any color on puts and takes we should be thinking about would be helpful. So, I think what you should see going forward to this next year is a more normal rhythm of how promotions impact our business. But for now, we can tell you with a lot of Confidence that we're going to return to more normal markdown cadence because our inventory is in much better position. But then just through greater inventory discipline and turns, we would expect, as you go against that elevated level of markdowns in the fourth quarter that we should see some meaningful improvement. I think you had said you could do a 4.5% margin -- operating margin if you're at least $14.5 billion in revenue, which is what your guide implies this year. And we've been driving down our buying and occupancy as a percentage of our sales as well, which, as you know, is a component of gross profit for us. So really, the last element in that equation for us is once we're in sort of a normalized macro environment where we can generate and sustain low single-digit top line growth, we believe we're positioned to achieve those long-term EBIT margin target. We started to see it in the fourth quarter, but we really weren't in a great position to chase into it because we were still cleaning up our inventory level. But again, I think it's fair to say we're open to buy going forward, and we're in a position to start receiving the newness of the brands and the balance that's going to be a good recipe for us in the Rack. The 20 new Rack stores, I guess, how much does that contribute to sales growth in â\u0080\u009823, and I guess just stepping back a little bit. It is approximately 100 basis points to the year, and that's going to be back half weighted. And then as far as digital, I could talk a little bit about the trends and then let Erik speak to just more generally the outlook for our digital business. So Yes, as you mentioned, we're comping Omicron in the fourth quarter of last year when we saw store traffic fall off in a pretty meaningful way in the middle of the quarter and a lot of that shift to digital, and so we saw the reverse of that in terms of the year-over-year trends this year. I'd expect that to continue into the first half at least as we're still -- what we saw in the first half of last year, you'll probably recall there was a strong pent-up demand for getting out again. Stores were especially showing especially strong growth, a little bit of a retreat in the digital penetration -- and then we're -- to your point, we're lapping some of the decisions that we made last year that have suppressed our digital growth, but are helping us be more profitable. I think in digital, one piece of context, we made some decisions last year to focus on profitable growth, which hurt some of our top line digitally, in particular, stopping store foot film on a rack.com order. It is about engagement with customers as we continue to see the customer want omnichannel capabilities, things like only buy online, pick up in store. But for us, -- it's been very successful and we opened up our Rack stores to the pickup point for Nordstrom.com orders. And digital is a real important part of that, of the discovery experience as more and more customers start their journeys online, even if they end up being in store. You talked about the consumer being under pressure, particularly more of the Rack customer -- so I guess trying to understand the acceleration in the Rack openings this year. It is a great use of capital -- it's low capital investments, low-risk investment on a proven model, and our most recent proof point to share would be recent store openings in Rack. So, there's just a lot of goodness all around for us open Rack stores. Eric, one of the things I would just add to underscore Eric's comment about Rack store is being a great investment. Just to highlight that, though, our cumulative investment this year in Rack new store openings is going to be less than 15% of our total capital expenditure plan. But just for context, as a reminder, they were at historically good levels last year, coming out of COVID with stimulate money and excess savings, consumers paid down balances, charge-offs and delinquencies were at historic lows. So, what we're seeing now and what we expect to see and was contemplated in our '23 guidance is that with higher balances, we'll get higher finance charge and fee income. Also, as you mentioned, there's a big opportunity to increase inventory turns. First of all, in terms of the inventory versus sales growth yes, with the 10% or better improvement in turn, you should expect inventory levels to be lower than sales. Whatever kind of change in sales we see, we should be better than that in terms of inventory. It gives us the opportunity to be much more item focused and precise in the way we're managing our inventory, which is good for customers, as you said. With turn, I mean, I think the blanket answer is we have room to improve across the board but if I'm to choose or probably the biggest opportunity is I'd say the Rack all up across all categories, I'd say probably particularly in apparel, -- there's a version of that also in the Nordstrom banner, I would say, apparel is probably the one. And what we've done is we've gone back in context through historical best and turns and how that impacts our markdown rates and our margins and really not use last year as a guide, but really kind of starting at the Belton best that we had and planning accordingly."
}