{
    "symbol": "DHI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-09 12:38:05",
    "content": " Horton team finished the year with a solid fourth quarter, which included a 20% increase in consolidated pretax income to $2.1 billion and a 19% increase in revenues to $9.6 billion. Our pretax profit margin for the quarter improved 10 basis points to 21.4%, and our earnings per diluted share increased 26% to $4.67. Our pretax profit margin for the year improved 350 basis points to 22.8%, and our earnings per diluted share increased 45% to $16.51. Over the past 5 years, we have generated $7.5 billion of cash flow from homebuilding operations while growing our consolidated revenues by 138% and our earnings per share by 503%. We will continue to focus on turning our inventory and managing our product offerings, incentives, old pricing, sales pace and inventory levels to beat the market, optimize returns, increase market share and generate increased cash flow from our homebuilding operations. Our fourth quarter home sales revenues increased 23% and to $9.4 billion on 23,212 homes closed, up from $7.6 billion on 21,937 homes closed in the prior year. Our net sales orders in the fourth quarter decreased 15% to 13,582 homes, and our net sales order value was down 10% from the prior year to $5.4 billion. In the fourth quarter, homebuilding SG&A expense as a percentage of revenues was 6.7%, down 20 basis points from 6.9% in the prior year quarter. Our fourth quarter homebuilding investments in lots, land and development totaled $1.5 billion, down 19% from the prior year quarter and down 15% sequentially. During the fourth quarter, 99% of our mortgage company's loan originations related to homes closed by our homebuilding operations, and our mortgage company handled the financing for 73% of our homebuyers. In the fourth quarter, our rental operations generated $21 million of revenues from the sale of 96 single-family rental homes and incurred a pretax loss of $13 million, which were below our expectations going into the quarter. As we look forward to the first quarter of fiscal 2023, we expect challenging market conditions to persist with continued uncertainty regarding mortgage rates, the capital markets and general economic conditions that may significantly impact our business. We currently expect to generate consolidated revenues in our December quarter of $6 billion to $6.8 billion and our homes closed by our homebuilding operations to be in the range of 15,000 to 16,500 homes. We forecast an income tax rate for fiscal 2023 of approximately 23% we expect to generate increased cash flow from our homebuilding operations in fiscal 2023 compared to fiscal 2022, and we plan to consistently repurchase shares to reduce our share count during the year with the amount of our repurchases dependent on cash flow, liquidity, market conditions and our investment opportunities. Despite these challenges and market volatility, we closed the most homes in a year in our company's history, completing our 21st year as the largest builder in the United States with record profit and returns, and we are well positioned to continue improving our operations and providing homeownership opportunities to more American families in 2023."
}