{
    "symbol": "DHI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-02 13:15:03",
    "content": " A year ago, our first quarter net sales orders were up 56% due to the surge in housing demand during the first year of the pandemic when we had significantly more completed homes available to sale and prior to the significant supply chain challenges we’ve experienced since. Thanks very much, guys. So if I think about your 56,600 homes and assume that you’ll – you assume basically a 7.5-month cycle time, that would imply that you should be able to close 45,280 over the next two quarters. And so I’m curious as to – is there anything wrong with the way I’m thinking about, how your homes on your construction should ultimately result in closings over the next two quarters, given your cycle time is 7.5 months. I know that’s your core business, but nevertheless, there is so much concern that many people have about rising rates and the impact on the entry-level buyer that I was curious as to whether you felt like there was a backstop behind that buyer for rental operators that are sort of getting in line and would love to buy the homes that you’re building for rent. Thanks very much, guys. Mike, your line is live. Mike, your line is live. The ability to get into a house, lock down your homeownership or your housing cost for the next 20 years is a significant driving force in what’s going on because as overall cost inflation, interest rates, as those continue to move up, the people that have bought a house today, even if it’s at a price that’s 15%, 20% higher than it was last year, are – I mean it’s just a great thing. And the private guys, they don’t have that ability that publics do and that’s – so when you look at new home sales decline, that doesn’t have anything to do with demand, that has to be built – 60% of the homes being built out, they’re being built by non-public."
}