{
    "symbol": "EXPO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:33:11",
    "content": "  Operator: Good day and welcome to the Exponent, Incoporated Third Quarter of Fiscal Year 2022 Financial Results Conference Call. Exponent's engineering and other scientific segments, represented 84% of our net revenues in the third quarter. Net revenues increased 6.9%, compared to the prior year period as we experienced strong demand for Exponent's services across several industries, including consumer products, energy and transportation, as well as robust litigation activity. Net revenues in this segment increased 2.7%, compared to the same period in the prior year, driven by Exponentâ\u0080\u0099s expanding scope of work in health data science and year-over-year growth in the life sciences space, driven by increased engagements within pharmaceuticals. Excluding the impact of foreign exchange, net revenue for the environmental and health segment increased 7.5% in the third quarter of 2022, as compared to the prior year period. I'll now turn the call over to Rich to provide more detail on our third quarter results, as well as discuss our outlook for the fourth quarter and the full-year 2022. For the third quarter of 2022, total revenues increased 9.3% to $127.2 million and revenues before reimbursements or net revenues, as I will refer to them from hereon increased 6.2% to $115.1 million, as compared to the third quarter of 2021. Net income for the third quarter decreased slightly to $24.4 million, as compared to $24.6 million in the prior year period. EBITDA for the quarter increased 1.6% to $34.6 million producing a margin of 30% of net revenues, which is a decrease of 140 basis points, as compared to the third quarter of 2021. Billable hours in the third quarter were $365,000, an increase of 4.8% year-over-year. Technical full-time equivalent employees in the third quarter were 958, up 8.4%, as compared to the same period one year ago. The realized bill rate increase was approximately 2.5% for the third quarter, which was slightly offset by the foreign exchange conversion for consolidation purposes. Included in total compensation expense is a loss in deferred compensation of $4.9 million, as compared to a loss of $250,000 in the third quarter of 2021. Stock-based compensation expense in the third quarter was $4.6 million, as compared to $4.4 million a year ago. Other operating expenses were up 10% to $8.8 million, driven primarily by increased employee engagement at our offices. As expected, G&A expenses were up 60% to $6.7 million for the third quarter. Interest income increased to $638,000 for the third quarter. Inclusive of the tax benefit of share-based awards Exponent's consolidated tax rate was 27% for the quarter, as compared to 24.1% in the third quarter of 2021. During the third quarter, we generated $29.4 million in cash from operations and capital expenditures were $3.2 million. In the third quarter, we distributed $12.2 million to shareholders through dividend payments and repurchase $30.4 million of common stock. At quarter's end, the company had $148.4 million of cash and cash equivalents. For the fourth quarter of 2022, as compared to the same period one year prior, we anticipate that revenues before reimbursements will grow in the mid to high single-digits and EBITDA margin will decrease 175 basis points to 275 basis points. Utilization is expected to be 68% to 70% in the fourth quarter, as compared to 70% in the same quarter last year. In the fourth quarter, we expect technical full-time equivalent employees to sequentially grow 2%, as compared to the third quarter. For the fourth quarter, we expect other operating expenses to be $9 million to $9.5 million. For the fourth quarter 2022, we expect G&A expenses to be $7 million to $7.5 million. For the full-year 2022, we expect G&A expenses to be $23.7 million to $24.2 million. As interest rates remain elevated, relative to prior year period, we expect fourth quarter interest income to be approximately $400,000. For the fourth quarter of 2022, we expect our tax rate to be approximately 27.5%, as compared to 28.9% in the same quarter a year ago."
}