{
    "symbol": "MELI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 19:36:02",
    "content": " As a result of this, our operating profit reached a record in the quarter with operating margins that were directionally in line with last years as we continue to balance investments mainly in product and technology and the credit business with cost leveraging across other operational expenses. We continue to invest in a few critical areas like product development, where we're not looking for operational leverage, but we continue to deliver solid improvements in gross profit, if you look at H1 and so I think I'm confident in our ability to continue to balance cost management with investing in growth, where there's the greatest uncertainty going forward is just what happens to the health of the consumer in Latin America. And in the current market context and as we've looked to tighten the screws and improve our efficiencies in terms of margin and also cash generation, that business falls under the bucket of businesses that we continue to believe are long-term critical, but that we will grow slightly lower -- at a slightly lower rate given the current market context, focus more aggressively on improving pure product margins and direct contributions and EBIT margins within the different 1P categories. So this is a very profitable business for us and even as NPLs have increased, and part of that is just the math, we've been able to price risk very effectively, and the margins have been very healthy and have actually been better in the second quarter than the two prior quarters, which is why we continue to remain very confident with the credit business because not only is it a significant catalyst for more sales, for better sales for more working capital for our merchants, but it's also been a great business the way we've been managing underwriting and pricing. Geoffrey Elliott, your line is open. Geoffrey Elliott, your line is open. Neha Agarwala, your line is open. Neha Agarwala, your line is open. Geoffrey Elliott, your line is open."
}