{
    "symbol": "MET",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 13:21:03",
    "content": " Net income in the third quarter was $331 million compared to $1.5 billion a year ago, primarily driven by lower adjusted earnings and derivative losses from hedges we hold to protect our balance sheet as well as investment losses from standard investment activity. We saw strong growth in U.S. Group Benefits with adjusted earnings of $399 million, up 259% year-over-year. In Retirement and Income Solutions, or RIS, adjusted earnings were $345 million which were down from a year ago, largely due to lower variable investment income. In Latin America, the region had another strong quarter with adjusted earnings totaling $171 million, up significantly from COVID-impacted $29 million a year ago. Adjusted earnings, excluding total notable items was $932 million in 3Q of '22, down 58% and down 57% on a constant currency basis. Adjusted earnings per share, excluding notable items, was $1.16, down 55% year-over-year on a reported basis and down 54% on a constant currency basis. Adjusted earnings ex notables were down 73% on both a reported and constant currency basis, primarily due to lower variable investment income and unfavorable underwriting. LATAM's top line continues to perform well as adjusted PFOs were up 21% year-over-year on a constant currency basis and sales were up 22% on a constant currency basis, driven by growth across the region, primarily from higher single premium immediate annuity sales in Chile and group cases in Mexico. As evidence of that commitment, MetLife invested $2.8 billion of capital in 2021 to support new business which was deployed at an average unlevered IRR of approximately 17% with a payback period of 6 years, generating roughly $1.9 billion in value. In regard to our statutory capital, for our U.S. companies, our preliminary third quarter year-to-date 2022 statutory operating earnings were approximately $1.6 billion, while net income was approximately $2.1 billion. Statutory operating earnings decreased by approximately $2.4 billion year-over-year, driven by unfavorable VA rider reserves, lower variable investment income and higher expenses."
}