{
    "symbol": "MET",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 12:21:07",
    "content": " In the second quarter, variable investment income of $389 million was aided by private equity investments and real estate funds, which generated returns of 1.5% and 7.9%, respectively. For Retirement and Income Solutions, or RIS, adjusted earnings totaled $388 million, which were down from a year ago due to less variable investment income, but helped by favorable volume growth. Financial flexibility was further enhanced after the second quarter's end when we tapped the debt market raising $1 billion of 30-year paper and a well oversubscribed offering, another example of the value the market attributes to MetLife's financial strength. Adjusted earnings in the second quarter of 2022, excluding the notable item were $1.5 billion, down 23% and down 21% on a constant currency basis. Group Benefits adjusted earnings were up 61% year-over-year, primarily due to significant improvement in underwriting margins aided by lower COVID-19 Life claims as well as higher volume growth. The business benefited from lower U.S. COVID deaths in the quarter and a continued favorable shift in the percentage of death under age 65, declining from approximately 23% in the first quarter to roughly 17% in the second quarter. Regarding non-medical health, the interest-adjusted benefit ratio was 73.1% in Q2 of '22 within its annual target range of 70% to 75% and favorable to the prior year quarter of 73.8%. RIS investment spreads were 116 basis points within our full year 2022 guidance of 95 to 120 basis points, but well below the prior year quarter of 224 basis points due to the significant decline in variable investment income. The LatAm's adjusted earnings in the quarter also benefited from strong investment margins, primarily due to the net impact from inflation-linked assets and liabilities in Chile that increased with higher inflation rates as well as the Chilean encaje, which had a 4.8% return in 2Q '22 versus a negative 1.5% in the prior year quarter. LATAM's top line continues to perform well as adjusted PFOs were up 26% year-over-year on a constant currency basis, and sales were up 19% on a constant currency basis, driven by growth across the region, primarily from higher single premium immediate annuity sales in Chile and group cases in Mexico. EMEA adjusted earnings were down 32% and 16% on a constant currency basis compared to a strong Q2 of '21, which benefited from a favorable refinement of an unearned premium reserve in the prior year period, totaling approximately $15 million after tax. In regard to our statutory capital for our U.S. companies, our preliminary second quarter year-to-date 2022 statutory operating earnings were approximately $700 million, while net income was approximately $1.3 billion. Statutory operating earnings decreased by approximately $2 billion year-over-year, driven by unfavorable VA rider reserves, underwriting results and lower variable investment income."
}