{
    "symbol": "QUAD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 14:17:12",
    "content": " Adjusted EBITDA was $56 million in the second quarter of 2022 as compared to $63 million in the second quarter of 2021, and adjusted EBITDA was $105 million in the first half of 2022 as compared to $133 million in the first half of 2021. These declines were primarily due to the negative impact of supply chain disruptions on our productivity, investments in hiring and training labor in advance of the peak production season during the second half of the year and cost inflation, which were partially offset by net sales growth. The decline in the year-to-date period was primarily due to the supply chain challenges, investments and cost inflation previously mentioned, partially offset by net sales growth, lower depreciation and amortization and lower interest expense due to the debt reduction. Free cash flow was negative $57 million in the first half of 2022, a $119 million decrease compared to 2021, primarily due to higher working capital and lower profitability in the first half of the year. Net debt increased by $60 million to $684 million at June 30, 2022 as compared to $624 million as of December 31, 2021, and the debt leverage ratio increased 56 basis points to 2.95 times at the end of the second quarter. During the second quarter, we paid off the remaining balance of $209 million of our unsecured 7% senior notes, resulting in a lower blended interest rate of 3.8% as of June 30 compared to 4.6% as of March 31. We anticipate our adjusted EBITDA and free cash flow in the second half of 2022 will be higher than the first half of the year, as well as compared to the second half of last year due to the strategic proactive investments we have made in working capital, talent and equipment to drive higher profitability during our seasonal peak production period. Our financial objectives remain unchanged and include: driving earnings through sales growth, effective cost management and productivity improvements, investing in our business to fuel growth, reducing debt through the generation of strong free cash flow, as well as driving shareholder value by continuing to pursue opportunities with our share repurchase program."
}