{
    "symbol": "ABCL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 00:10:04",
    "content": " Our long term strategy is to build a competitive advantage in antibody product creation and to use disadvantage, to AMAs a diversified portfolio of stakes in next generation antibody products, our business model and investments create significant value in three ways by making drug development faster, by doing things that haven't been done before and by leveling the plane field for partners and expanding the ecosystem of innovators. We believe that the partnerships that we've entered into in this last quarter are excellent addition to our portfolio, as we've previously indicated, the total number of programs under contract is the leading indicator of the longer term trajectory expected for program starts as of June 30, 2022. This result reflects the recognition of royalties on Bema, mostly offsetting our ongoing investments to expand and enhance our discovery platform and to grow our diversified portfolio of long term stakes in the next generation of antibody drugs, while running discovery efforts for our partners, looking at cash flow operating activities for the first six months of 2022 contributed $373 million to cash. I did mention that, two thirds of our efforts and our expense in R&D is on capability and platform building, and that these sort of pre-partnered assets are the benefits that result from having to work on real things, to make sure that your technology development is actually achieving ultimately the goals that you're aiming to prove out in terms of speed of being able to find antibodies being able to find antibodies that previously what had been intractable and also, making those investments to prevent, smaller companies from having to rebuild the rebuild the wheel and and be more competitive. I Don on a previous call, I don't remember which one we did present some details of our portfolio in terms of programs under contract within that presentation, there was a breakdown in terms of deals with biotech or with partners, we would characterize as large pharma roughly a quarter to a third of programs under contract are with the large integrated pharma companies, which of course means, let's say 60% to 75% are with biotech companies that pool of biotech companies spans the gamut from companies that are right out of the gate. And one of the reasons is that the complexity of doing the discovery of characterizing of doing the development work and ultimately manufacturing a therapeutic antibody presents a very formidable hurdle for a new company internally we've done some analysis and you can quickly convince yourself that when you have to rebuild all of that, even if it is a good idea, good meaning that it would stand up to the, the same problem is of success that have traditionally been seen in the industry."
}