{
    "symbol": "ABCL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 19:47:05",
    "content": " And in our view layering on successes over the last few years in CD3, in COVID-19, in moving forward programs for partners, layered on top, success in GPCR's and Ion Channels and ultimately in T-Cell Engagers, all of that reinforces our thesis that sustain investments in technology can move the needle and make it more accessible and practical to get antibodies forward for these problems. So, certainly as we begin to move towards forward integration with translational science, with manufacturing, even building out regulatory capabilities to help the smaller and less enabled partners, we're adding more value and we would expect to participate more in the success of those programs. So that's how we see partner initiated programs is, volume, I do believe it will increase, but much more I think the way in which we select opportunities the likelihood of them moving forward, the speed at which they move forward, and our economic participation are some of the big levers that we think about in terms of maximizing value. The opportunity we have is to have a renewal or repeat engagement with an existing partner once they've seen our capabilities and then we have the opportunity on the subsequent programs to negotiate again the royalty rates given the increased capabilities and whatever the increased value is that we would be doing, we would be bringing to that partner. So, in terms of pre-partner programs, we are advancing these programs primarily in connection with technology development and we believe that bringing forward ready clinical candidates is the strongest proof that the platform is working and that we're actually solving the problems. Really focused on the years of experience and 100 programs that we've worked on to work towards that clinical candidate that can actually move forward into translational sciences, CMC and GMP manufacturing and then ultimately to patients."
}