{
    "symbol": "BIOL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:25:59",
    "content": " In fact, our second best second quarter since 2013, driven by increasing demand for our industry-leading lasers, our total revenue increased 34% year-over-year and our consumable sales surpassed $3 million for the first time ever in a single quarter. Additionally, our specialist academies for endodontists, periodontists, pediatric dentists and dental hygienist continued to generate increased adoption of our laser technology in the U.S. in the second quarter with 80% of our U.S. Waterlase sales coming from new customers and over 50% of U.S. Waterlase sales coming from dental specialists in the quarter. As these efforts continue to pay off, we held 150 educational training events in the second quarter, a 50% increase from last year's second quarter and the combination of our best-in-class dental lasers backed by peer-reviewed papers is complementing our increased education and training efforts. However, this still represents less than 10% of the overall U.S. dental market and less than 3% of the dental markets outside the U.S.  As we target the remaining 90-plus percent of U.S. dentists not yet used in all tissue laser, we believe that the continued solid execution of our growth strategy will enable us to accelerate market adoption. We believe each 1% increase in adoption of our all-tissue laser technology in the U.S. will equal approximately $50 million in additional revenue for BIOLASE, assuming we keep our same 60% historical market share. By our calculation, securing EMA a small percentage of each of these dental specialist markets we are targeting could generate over $150 million in additional revenue for BIOLASE from laser sales plus higher margin revenue associated with the follow-on consumables. Our 3-pronged growth plan is generating positive results as evidenced by our sales team's great performance this quarter, which has given us continued confidence in our ability to drive sustainable and profitable revenue growth in 2022 and beyond. However, with the continuing strong demand for our dental lasers and strong consumable sales, we are currently forecasting revenue for the third quarter ending September 30, 2022, , which would represent growth of over 10% year-over-year."
}