{
    "symbol": "BIOL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 22:14:09",
    "content": " During the first quarter, we saw continued progress with our Waterlase Exclusive Trial Program, as our success rate, the percentage of dentists who purchased after the trial surpassed 50% year-to-date. This program along with the launch of our specialist academies for endodontists, periodontists, pediatric dentists and dental hygienists generated increased adoption of our laser technology in the U.S. in the first quarter with 81% of our U.S. Waterlase sales coming from new customers and 65% of sales coming from dental specialists. During the first quarter, we saw a significant increase in sales to specialists with 65% of our US Waterlase sales coming from these specialties. Securing even a small percentage of each of these dental specialists, by our calculations, could generate over $150 million in additional revenue for BIOLASE from laser sales plus higher margin revenue associated with the follow-on consumables. As I mentioned earlier, we saw Waterlase's Exclusive Trial Program success rate increase significantly from almost 40% during 2021 to an excess of 50% during the first four months of 2022. For the first quarter, we delivered net revenue of $10.2 million representing 25% growth year-over-year. We continued momentum with new customer adoption in the first quarter, with 81% of our US Waterlase sales coming from new customers and approximately 65% of US Waterlase sales coming from dental specialists. Lastly, as John mentioned, the success rate of our Waterlase Exclusive Trial Program, increased significantly during the quarter at over 50% year-to-date highlighting the success of this program. When adjusted retrospectively, for the reverse stock split, GAAP net loss per share for the quarter was $0.77 compared to $1.28 for the first quarter of 2021. When adjusted retrospectively, for the reverse stock split, adjusted EBITDA loss per share for the quarter was $0.64 compared to $0.97 for the first quarter of 2021. We are continuing to experience strong demand for our dental lasers and are currently forecasting revenue, for the second quarter ending June 30 2022, to exceed $10.5 million, which would represent growth of at least 15% year-over-year and over 21% when compared to the second quarter 2019 pre-COVID results."
}