{
    "symbol": "OMQS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 18:29:19",
    "content": " As Shai highlighted in Q3 OMNIQ reported revenue of $27 million for the quarter ended September 30, 2022, an increase of 32% from $20.5 million in the third quarter of â\u0080\u009921. Adjusted EBITDA, which means adjusted earnings before interest, taxes, depreciation and amortization, for the third quarter of 2022 amounted to a loss of $516,000, compared with the adjusted EBITDA loss $2 million in the third quarter of 2021.  improvement of $4.5 million in our adjusted EBITDA profitability. OMNIQ reported revenue of $77.5 million for the nine months ended September 30, 2022, an increase of 45% from $53.4 million in the first nine months of 2021. Total operating expenses for the nine months ended September 30, 2022 or $24.2 million, compared with $19.5 million in the same period of 2021.  spending from the consolidation with Dangot. The class for the nine months ended September 30, 2022 $9.6 million or a loss of $1.29 per basic share, compared with a loss of $10.8 million or a loss of $1.86 per basic share for the first nine months of last year. Adjusted EBITDA for the nine months ended September 30, 2022 amounted to a loss of $1.5 million, compared with an adjusted EBITDA loss of $3.6 million in the same period of 2021. AI sales in 2022 year-to-date or better say in Q3 is more than -- is about $4 million actually, compared to half of it in 2021, so basically 100% increase. And what we bring to the table, again, is a total solution, but so not only, of course, the integration of that total automation to their supply chain levels, but also we're bringing to the table our unique Machine Vision Technology together with robotics, you can really aim for 100% efficiencies and that is what makes this press release unique not only, because we were selected due to the fact we have unique technology that attracts our customers to deploy, but also -- and they want to be part of it, but also now that we have the total solution that can respond to additional needs with robotics. This capability now that we have and the partnership we created together now with our technology that should bring it to higher -- much higher double-digit, so minimum 20% -- so we should at least double the growth that we're witnessing on year-to-year basis from regular operation and regular products we offer today, which should probably double in percentages, the growth in that supply chain segment."
}