{
    "symbol": "PACW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 16:04:02",
    "content": "  Operator: Good day, and welcome to the PacWest Bancorp Fourth Quarter 2022 Earnings Call. At this time, I would like to turn the conference over to Bill Black, PacWest Bancorp. Good morning, and welcome to PacWest fourth quarter 2022 earnings conference call. With me today are; Paul Taylor, our President and CEO; Kevin Thompson, CFO; and Mark Yung, our COO and the leader of our venture banking business. Before I hand the call over to Paul, please note that we may make forward-looking statements during today's call that are subject to risks, uncertainties and assumptions. For a more complete discussion of the risks and uncertainties that could cause actual results to differ materially from any forward-looking statements, see our SEC filings including the 8-K filed yesterday afternoon, which is also available on the Companyâ\u0080\u0099s website. I'd like to turn the call over to our President and CEO, Paul Taylor. Good morning, everyone, and thank you for joining our call today. Specifically, I assume the role of President and CEO, replacing our long-time CEO, Matt Wagner, who became the Executive Chairman; John Eggemeyer has become our Lead Director; and Kevin Thompson has joined us as new Chief Financial Officer. PacWest has a long history of acquisitions that brought us great customers and talented employees, but also varied processes and different cultures. Now the time is right to focus on coming together to function even more uniformly and efficiently as one company, regardless of a business line or corporate function. Specifically, in the fourth quarter, the company made the decision to wind down its operations in premium finance and multifamily lending. In addition, the company is restructuring our subsidiary to realign its operations to improve profitability and reduce risk. These actions will help us refocus our efforts on our core businesses, accelerate our capital growth and improve operational efficiencies over time. In addition to the strategic decisions above, the company opportunistically sold $1 billion in bonds at a loss in the quarter, which was used to pay down higher cost funding and better position the balance sheet going forward. The management team has also initiated an operational efficiency strategy to control costs, reduce processing systems and define synergies across the company. We believe that the actions taken in the fourth quarter are meaningful first steps towards our goals, but it comes out across. While our capital goals remain 10% CET1, our actions in the fourth quarter will delay the timing a little, and as such, we would expect our CET1 ratio to hit 9.75% by the end of 2023 and achieve our target of 10% early in 2024. There are real challenges ahead with rising interest rates and a slowing economy, but there is  a significant opportunity for PacWest to improve our performance and return to shareholders, given our strong team, a great customer base and a plan to unlock additional value for our shareholders and employees. Strategically, the fourth quarter marks the beginning of the next chapter for PacWest. We want to highlight four main points: First and foremost, we announced a clear strategic vision around the Community Bank with an operational focus on unifying our businesses and eliminating silos to improve performance. Second, we are acting with a real sense of urgency, as you can see in the fourth quarter with the on sale and the exiting of two business lines and a significant restructuring of another. Third, we announced an aggressive operating target list to hold ourselves accountable and to set the bar what we believe this company should perform over time. Lastly, we like the industry are facing challenges in the current economic environment. We are 100% committed to managing the business through the cycle, preparing for whatever gets thrown at us. And now I'd like to turn things over to Kevin, our CFO, for some specific commentary on the financial results before we go into the Q&A session. It's a pleasure to join the talented team at PacWest, and I look forward to working with all of you. As Paul mentioned, our sale of $1 billion of available-for-sale securities resulted in a $49 million loss. As part of the efforts to restructure our Civic lending subsidiary, we recorded a goodwill impairment to $29 million. As a reminder, goodwill is a non-cash charge and has no impact on our regulatory capital ratios, cash flows or liquidity position. Finally, we are working to dramatically improve the overall operational efficiency of the bank. As a first step in this initiative, we recorded early retirement benefits and a severance expense of $5.7 million. Adjusting for these unusual items, in the fourth quarter, our earnings per share would have been $0.93, and our return on average assets would have been 1.15%. Loans and leases increased by $949 million in the quarter or by 3.4%, mostly connected to residential real estate mortgage and construction portfolios. Deposits decreased by $260 million in the quarter, driven mostly by outflows in the venture banking deposit portfolio. With the unprecedented increase in interest rates, our cost of deposits increased by 67 basis points to 1.37% while our average  increased 61 basis points to 5.73%. As a result, our net interest income decreased by $12.2 million to $323 million in the quarter. Credit metrics remained strong in all our loan portfolios, the allowance for credit losses increased by $7.4 million to $292 million in the quarter, mostly due to loan growth, with an allowance for credit loss ratio of 1.02%. Excluding the goodwill impairment of $29 million and $5.7 million related to early retirements and severance, non-interest expense decreased $3.5 million in the quarter. The decrease was due to lower services fees and lower intangible asset amortization, offset by higher customer-related expenses of $5.5 million. Looking at the full-year 2023, while we are just completing our budgeting process, I will share with you our current outlook. This will impact our deposit and loan pricing, likely resulting in a flat net interest margin to the level experienced in 2022. With our strategic focus on operational efficiency, we plan to continue the course we took in the fourth quarter to reduce expenses. This includes tightening expense controls, especially around compensation and reducing costs related to vendors, discontinued business lines, facilities and projects. As a result, we expect a full-year efficiency ratio in the low 50% area, with a longer-term goal of mid-40%. Our credit quality continues to be strong, and we presently do not anticipate any increase reserves from current levels. Hey, so Paul, I wanted to get your top level thoughts on the strategy going forward. Obviously, you mentioned youâ\u0080\u0099re not doing any more premium finance, multifamily. So as you look at our balance sheet, I mean, one thing we do very well and a lot of it is we do a lot of real estate. And then in our community bank, we do a lot of more commercial focused, more relationship type real estate that will continue on. But again, that's a nationwide business, and we'll continue to do that. This year, we really looked at each one of our business lines and the ones we've discontinued are more of a low yield, no relationship type business. And then in regard to Civic, you mentioned there is some restructuring there. So we've taken â\u0080\u0093 sort of taken all over, and we're integrated and into PacWest. And right now, we're looking at all the products that they offer and determining which ones of those products that we'll hang on to and go forward with. We've put Mark Yung, who's on the call here today in charge of Civic, and he is in Civic right now and he's helping us with those determinations. But at the end of the day, it will be a much more profitable company and lowering the risk profile of the company also. On the multifamily stuff, there's kind of two different real tranches. There's a customer base multifamily business, which we're not exiting, and we're going to continue to service our core deposit customers. So as we look forward and throughout this year, we believe that we can maintain somewhere around a 110 ROA for the year, but it's going to be ramping up. So as you look at like December ROA is going to be about a 120, but I'm going to preface that. I mean, 2023 is going to be an interesting year. But I mean, we will do well, but there could be some macro type items like that, that could cause some variation. And the actions we're taking now are in preparation, so that we're flexible and have a balance sheet that's prepared for that type of environment. I mean, quite honestly, we're looking at everything. As you look at PacWest balance sheet, it's about $41 billion. But again, that's part of the reason we sold the billion dollars in bonds. There was sort of a dip in the 10-year, and we had these groupings of bonds that we felt it was worthwhile to go ahead and sell them and take the loss, but we're looking at all those types of things. We're thinking of the long-term shareholder value here, what's the earn back. Also, there's an element of patience in our unrealized losses, if you wait and the bonds mature overtime, those unrealized losses reverse. And it sounds like that's kind of the first step, as you mentioned in the release. Yes, annualized, it's probably about the level of severance that we saw going forward. And we have other â\u0080\u0093 we have an operational efficiency focus right now, where we're looking at facilities, we're looking at projects. You talked, Paul, about the $975 million getting $10 million. What are your thoughts on â\u0080\u0093 I mean, this seems like a restructuring year. In the past week to weeks, but at levels that we've been at, it would be â\u0080\u0093 I think it'd be very tough to raise stock. But again, that is on the table, but there's no plan to do that at this point in time. And again, we'd be very thoughtful about the earn back associated with that and shareholder dilution and other options that would dilute shareholders much less. If I could â\u0080\u0093 I think I heard in your prepared remarks, you don't think you need to add reserves from here. And I guess most of your â\u0080\u0093 most...\n Well, I would preface that with this year. We really don't â\u0080\u0093 I mean, as we see it today, we don't see any need to add any substantial reserves. I just talked to our Chief Credit Officer yesterday, and there's really no signs of any issues with credit quality or any concerns at this point in time. But again, we're probably going into a recession this year, and that could elevate credit issues, but we don't know that. I get the limitations of CECL, but I'll step back. And again, I just want to make sure it's very clear that we are very comfortable with our credit position at this time. I've only been here a handful of months, but that's one of my biggest impressions is that PacWest is a very, very good credit shop. So on the runoff portfolios, Bill, that you laid out in terms of the size of premium finance and multifamily. So on the multifamily, I would agree that's a reasonable assumption coming depending upon when things were underwriting and when they mature, it will kind of ebb and flow, but it will kind of pace itself out. Premium finance is a business that, clearly, we're exiting. We have communicated that to the borrowers, and we're going to work with them. It's not going to be instantaneous, and we're going to work it out. I think we saw last year or year and a half ago or so, Texas Capital sold at their premium finance business to Truist. Well, again, I would say that â\u0080\u0093 again, everything is on the table. And then in terms of kind of the expectations on the deposit side, knowing that it sounds like the balance sheet is going to be pretty flat. Well, I can tell you, we'd absolutely love to have venture deposits increase. Venture deposits are very, very hard to estimate. As I look at this year, I mean, in the first half of the year, they seem to have sort of floored and we seem to be flat. We did have declines in the second half of the year, but they're nothing like we've seen in the past. So we'd like to see them floor out somewhere around there, and that's sort of what we're planning for. Because then that will allow us to remix the deposit base, get out of some of the wholesale deposits and really dramatically decrease the cost of funds. But at the same time, we will be very careful what assets we stack up against those deposits because of the element of volatility. And Mark, I would agree the softness kind of earlier in the year and we expected a better market towards the tail end of the year. And again, this market is very rate sensitive as well, right, the venture market. There's a tremendous amount of dry powder, but obviously, people are â\u0080\u0093 have slowed down investment cadence with all the news that we saw here in Q4, and that's carrying through earlier part of this year. You mentioned 1.1% for 2023 in December, getting to 1.2%. As Paul mentioned earlier, 2023 is â\u0080\u0093 it could be an interesting year. And so we're very focused on armoring our balance sheet, being prepared from a liquidity perspective and making some big decisions and moves in terms of our operational efficiency going forward. So 2023, you may see a lot of noise because of that, but those should set us up really well in 2024 and 2025 to have a really good chance to get back to the great profitability this bank has seen in the past. I'm not a very patient person, so we're going to push as hard as we can to get to these overall goals that we have and that we released yesterday. And should we expect any increased volatility around that target of 1.5%, given you're exiting a couple of stable businesses of multifamily and premium finance, but retaining the presumably more volatile Civic business. I mean there's going to be â\u0080\u0093 we're going to take further actions as we go throughout the year and we're trying to have any more actions earlier in the year, so we can get a better run rate. So there will be some volatility, I would think that would be in the beginning of this year, and then it should smooth out as we get into the second half of this year and then into 2024. So David, in terms of volatility, a big part of this is to build a more consistent, stable earnings profile. And then also, as Paul said, addressing the expense side as well. I mean one of our goals, too, is to take the volatility out of PacWest earnings. I think PacWest earnings typically and historically have been a little volatile and they're hard to predict, and we're trying to get a better, smoother, more predictable earnings for The Street. Did you mention â\u0080\u0093 and did you mention on the Civic portfolio, $3.3 billion, did you say what the right size, how much of that could come down over time? Well, I think you're going to see it definitely come down. Again, we just installed Mark in there about â\u0080\u0093 he's been there for about a week. And we're still trying to figure out the business PacWest had really adopted sort of a decentralized hands off method when they acquired it, and we're in there trying to figure it out and try to figure out what type â\u0080\u0093 what offerings we're going to keep and which offerings we're going to eliminate. And of course, we had bought flow from the former entity in the past and like the asset, but werenâ\u0080\u0099t as familiar with the business. But again, overall, I mean, it's around 10% of our earning assets, and we are going to shrink it below that. I think 10% is too big of a chunk, and we are also â\u0080\u0093 the markets are opening up a little better in that area, and we are also looking at trying to sell some of that portfolio just to bring it down. Hey, maybe just to start, I wanted to ask on the 30 to 89-day past due loans. And so no, we're not worried about the â\u0080\u0093 any particular fee or anything there. It's just kind of an ebbs and flow and how the month ended, Andrew. But again, ebbs and flows, some noise as you get, especially near year-end. I don't think we've disclosed the specific reserves by portfolio, but you're right. For one of the products inside of Civic, it's 12 months. So you would imagine with a very low loss experience and a short tenure, I kind of leave you were the CECL reserves come out. It's really good to see this plan announced and Paul, congrats on announcing in short order. So just maybe a bigger picture, can you help us understand how aligned you and the remainder of the management team is with kind of investors in terms of this plan, I guess, our incentive compensation targets aligned fully with this plan. So this plan was put together, I brought the executive team together and we came up with this plan together. And then also, I would tell you that some of our overall goal targets that we have announced are in our incentive for 2023. Paul, in July, you talked about there be some holes in technology given the number of acquisitions that PacWest had put together. So I mean, we're still on the same plan for technology. And Mark Yung, who's on the call, is in charge of that vision for new technology. I mean, our technology is very much centered around three values. Obviously, we are focused here on operational efficiencies. So as Kevin mentioned, we're looking and revisiting every project, revisiting milestones, et cetera. I've read a lot of the earnings announcements from other banks and deposits, liquidity are getting a little stretched in the industry. We're hoping that with mix changes, we can lower the cost. One of the things that our loan committee were requiring that you've got to have a deposit in order to get a loan, and we're challenging all of our lenders this year, and we're putting it in their incentives where they've got to gather deposits and a significant amount of deposits this year. We also have the standard CD specials, which aren't going to help rate, it will just help the volume of deposits, but that's sort of as I see deposits for 2023. We do expect two more Fed rate increases, 25 basis points each. And so we have had a cycle to date, overall deposit beta 34%. So we do anticipate some beta associated with that, some pressure in the first half of the year and then alleviate in the second half of the year. I think the bigger thing when you look at the P&L, though, Chris, is going to be the interplay between the remix on both sides of the balance sheet from both lower-yielding loans to higher-yielding loans and then on the deposit side. And I think in any particular quarter, you could see that bounce around. But the goal is obviously driving increased profitability, so to see the margin increase over time. No, that's all very helpful. And Bill, to your point, you can see that with the loan production yield just on its own this past quarter, to your point. There was once a team of folks at PacWest, several acquisitions ago, who were dedicated on just doing deposits, and we're incented as such. I mean, listen, our business has always been deposit focus. And I would tell you, if you were on the internal call yesterday, Paul was pretty clear about it, it's all about deposits, deposits, deposits. So it's not just one group, Chris. It's everybody, from the lenders to the top of the house all the way to the front line. So I mean, that's our biggest focus all the time. And we're tweaking incentive programs to be more deposit-focused as well as Paul mentioned earlier, that loans â\u0080\u0093 any loans that are approved, in general, need to have a deposit relationship. I know you mentioned obviously, recession influences some of that. So if you're talking about on the non-accruals, the bump there was, in particular, related to some Civic loans. We've already seen some of that back off, and we have an NPL sale that is being teed up. So we feel that's kind of ordinary course, Chris. I mean we did an NPL sale in, I think, last quarter, and we're not seeing anything indicative in credit. As Paul said, we feel really good about where the book is. The team has done a great job over the past years in terms of making sure that the underwriting is solid, and our team has going through everything with a fine-tooth comb. And if you were to look at our non-accruals, for example, it's really granular in there. Our top 20 NPLs, for example, averaged about $3 million. But if you look at the absolute level of non-performers at 36 basis points, it's pretty low compared to history. We don't see anything driving that, but just realize we're kind of operating at the lower end of stuff, but we're not concerned about anything in particular, although we are obviously paying a lot of attention given to where we think things are going. Kevin, on the margin guide, I think you talked about 2022 as the baseline. And then with the flat loan guide, are you basically saying relatively flat earning assets, but the churn in earning assets likely leads to that lift later in the year. On provision, you guys are talking about flat reserves, flat loans, lower risk loans and clean credit, which suggests to me that may not need a provision in the model for 2023, but what kind ofâ\u0080¦\n And we just got to preface that again with the year we're in, is that we could have a recession so that could be a little dynamic. We're planning, at this point in time, that it will not be dynamic, but we have to remember that. Yes, not insignificant from what we've seen in 2022. We've got very seasoned, experienced lending teams. Again, I think our core competency here is credit. And then I guess the last one of all the metrics that you laid out, the one that stands out to me is the top quartile EPS growth. I mean, Paul has been here as CEO for 28 days, I think, it is. I mean I think that there's a clear plan, a clear vision of where we want to get to. And if we can execute on that plan, I think the results are going to be pretty good for shareholders. But I think if we do what we think we can do, we think that's possible. I think if you look at the core earnings power of PacWest historically, I don't think that it's changed. And for our last question, we'll go back to Matthew Clark from Piper Sandler. So the securities we've wound down, we're yielding about 3.93%. So yes, there was a benefit there, but we also have loan growth that offset much of that, but that should be a benefit through the year that negative yield that we were experiencing. Yes, we're trying to take the DDA base up to 40%. Well, first of all, we want to thank all of you for calling in and your interest in PacWest Bancorp. Our numbers are out on our online, and we're happy to talk to you at any time. Ladies and gentlemen, that does conclude today's conference."
}