{
    "symbol": "PDSB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 12:45:26",
    "content": " The ability to more broadly overcome tumor immune suppression, while also generating potent tumor attacking T-cells presents the potential to more effectively treat a broader percentage of cancer patients, including terminally ill cancer patients as our current data suggests. The MD Anderson poster reported the induction of polyfunctional CD8 T-cells, which were shown to infiltrate the tumors when PDS0101 is administered to locally advance cervical cancer patients in combination with standard of care chemoradiotherapy. We believe the results reported at SITC support the potential of Versamune based products to successfully overcome the first critical limitation of immunotherapy by generating the right type, right quantity and right potency of tumor infiltrating killer T cells in advanced cancer patients. In the National Cancer Institute's study, using the Versamune plus IL-12 platform in the triple combination study, in a similar population of HPV positive cancer patients who are naive to checkpoint inhibitor therapy, the National Cancer Institute reported an objective response rate of 88%. However, in more advanced checkpoint inhibitor refractory disease, the data generated by the National Cancer Institute using diverse immune plus IL-12 platform in the triple combination suggest that in such advanced disease, the ability to more broadly overcome tumor immune suppression, while generating tumor attacking T-cells makes this our preferred combination to further evaluate in this patient population in a registrational trial. The outcomes that we've seen in the expanded interim data along with the SITC 2022 presentation continue to demonstrate potential induction of high quality and relevant immune responses that may be associated with clinical efficacy, durability, and safety in a very challenging patient population with very few available treatment options. But I think in terms of the cervical cancer and the potential and the combination here, I think one of the key things that we're looking at, as Lauren just mentioned, is understanding exactly how PDS0101 or Versamune is impacting the treatment regimen and exactly what PDS0101 could potentially be doing to improve the therapy for these patients. So we clearly can see that if we are able to one, have these complete responses early on, in the course of standard chemo radiation therapy, as well as potential reductions in circulating tumor DNA, we're looking to see how that will translate not only in terms of short-term immediate imaging outcomes but the longer term outcomes of delayed disease recurrence and continued survival. That's absolutely correct, Frank, and it's why with given the inherent biologic variability that there is in every patient's individual immune responses, when we're able to look at them collectively together and see these trends, where across multiple patients we see increases in these HPV16 specific granzyme-b positive CD8 T cells over the course of treatment and a corresponding decrease in the observed circulating tumor DNA. And so our approach by looking at these patients who have this large high tumor burden was really twofold: to be able to get a quick read on whether or not this is working; and also to be able to show differentiation, that these T cells are active enough to really treat the difficult to treat cancer patients that most immunotherapies won't address. But I think what we now have, from both the NCI and MD Anderson is now really explaining why these combinations have worked as effectively as we've seen today in providing some validation of the clinical data that we have been seen in terms of this is exactly what PDS0101 is doing, this is the kind of immune responses generating."
}