{
    "symbol": "HAFC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 22:21:08",
    "content": " We reported the first quarter 2022 net income of $20.7 million or $0.68 per diluted share, down from our fourth quarter, but up nicely from $16.7 million or $0.54 per diluted share in the first quarter of 2021. First quarter production volumes were $507 million, 19% lower than the record high fourth quarter and more than doubled our first quarter production last year, excluding PPP loans. Commitments on commercial lines of credit increased to $814 million at the end of first quarter, an increase of $42 million or 5.4% from the prior quarter and $210 million or 35% year-over-year. Residential mortgage production, which consists of non-QM loans, was $60 million in the quarter and represented 12% of the total loan and lease production. Given our overall solid loan and lease production in the first quarter, our loan portfolio increased 3.6% from the previous quarter to $5.3 billion and was also up 10.8% from the first quarter of 2021. As Bonnie mentioned, this portfolio has grown by 23% since last year to $663 million in the first quarter and is up 4.7% from the fourth quarter. The volume of loans sold in the first quarter declined, as expected, to $29.6 million from $36.6 million in the fourth quarter. The allowance for credit losses was $71.5 million as of March 31, 2022, generating an allowance for credit losses to loans of 1.34% compared with 1.41% at the end of the prior quarter. We recorded a provision for income taxes of $8.5 million for the first quarter, representing a more normalized tax rate of 29%, up from the fourth quarter where we benefited from charges in our deferred tax asset valuation allowance. However, our TCE ratio declined 1.7% from the previous quarter because of the $36.4 million after-tax increase in unrealized losses on our securities portfolio arising from the rapid and sizable increase in interest rates. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}