{
    "symbol": "HAFC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 20:35:04",
    "content": " Our SBA group also generated another strong year of production originating $209 million of loans for the year, driven by a keen focus on expanding market reach and securing new talent and we continue to gain solid traction with our Corporate Korea initiative, where both loans and deposits grew meaningfully. I'll begin with additional details on our loan production where fourth quarter volumes were $474 million, down modestly from the third quarter and, we believe, reflecting the current environment of higher interest rates and economic uncertainty. We achieved higher sequential production in commercial and industrial, SBA and equipment finance and while our residential mortgage production was down from its record volume in the third quarter, we originated $107 million of loans during the fourth quarter, a very good result in a challenging mortgage environment. Total commitments on commercial lines of credit increased to $1 billion at quarter end, up $56 million or 5.7% from the prior quarter and up 34% year-over-year. Our Corporate Korea portfolio is well above the level we had expected for this business as loan balances were $781 million at year-end, representing 13% of our total loan portfolio. The average rate on all new loan production for the fourth quarter was 6.85%, up 130 basis points from the third quarter. Beginning with net interest income at $64.6 million for the fourth quarter, we saw a 2.3% sequential growth from the third quarter. Turning to our net interest margin, which was 3.67% for the fourth quarter and up one basis point from the prior quarter; we saw the increase in loan yields benefited our net interest margin by 48 basis points, while the increase in the cost of interest-bearing deposits reduced that benefit by 46 basis points and there was a negative one basis point differential between the increase in yields on other interest-earning assets and the cost of borrowings and debt. The volume of SBA 7(a) loans sold for the fourth quarter decreased modestly to $40.9 million, and trade premiums, as expected, declined 10% to 5.99% for the quarter. In summary, we delivered another strong quarter with net income of $28.5 million or $0.93 per diluted share, a return on average assets of 1.56% and a return on average equity of 15.9%."
}