{
    "symbol": "HAFC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 22:40:20",
    "content": " Our SBA Group generated record production of $68 million during the quarter, driven by intense focus on our small business relationships and we continue to gain solid traction with our corporate career initiative where both loans and deposits grew meaningfully quarter-over-quarter. I'll begin with additional details on our outstanding loan production where second quarter volumes reached a record $642 million up 27% from the first quarter and 38% higher than our second quarter production last year. Commitments on commercial lines of credit increased to $902 million at the end of second quarter, an increase of $88 million or 11% from the prior quarter, and 28% year-over-year. Equipment finance or lease production was a record $95 million for the second quarter, up 33% from the first quarter. As Bonnie noted with our record loan production for the second quarter, our loan portfolio increased 6% from the previous quarter to $5.7 billion, and it grew 17% from the second quarter of 2021. The average rate on our new loan production in the second quarter was 4.35%, up 40 basis points from the first quarter. For the second quarter, deposits increased 3.4% driven primarily by a $104 million increase in non-interest-bearing demand deposits. We no longer have the interest expense on our 5.45% subordinated notes, which we redeemed in the first quarter nor did we have the $1.1 million charge related to that redemption, and we funded our loan growth primarily with lower yielding cash balances. Moving on, non-interest income was $9.3 million for the second quarter, up 9% from the prior quarter as we posted a 10% increase in our SBA gain on sales. The volume of SBA 7(a) loans sold for the second quarter increased 41% to $42 million, while trade premiums as expected declined 19% to 7.97% for the quarter. Non-interest expenses for the second quarter were favorable at $31.5 million, down just under 1% from the prior quarter. The allowance for credit losses was $73.1 million at quarter end, up slightly from the prior quarter, but lower relative to total loans at 1.29%. For July to-date, our cost of interest-bearing deposits was about 30 basis points higher than the average rate paid for the second quarter or a beta of approximately 40% when measured against the June 75 basis point increase in the Fed funds rate."
}