{
    "symbol": "CECO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 15:19:03",
    "content": " On this slide, you can see that CECO's order growth trajectory that began back in the fourth quarter of 2020 has accelerated through 2021 and 2022, with the 2 best quarters in company history posted in the first quarter and fourth quarter of 2022 respectively. CECO booked orders greater than $100 million in each quarter of 2022, a company first, and completed the full year with $527 million in net orders, a company record. On this slide you can see that CECO's revenue growth trajectory, which began in Q1 of 2021 and it showed steady improvement sequentially and over prior period throughout 2021, accelerated this improvement in 2022 as we began to convert our growing backlog, culminating in CECO delivering 3 consecutive quarters of greater than $100 million in revenue, and the best third and fourth quarters for revenue in company history. I am particularly pleased with this result as we also made investments in the range of $1.1 million to $1.2 million in the quarter in people, organic growth and systems to better position CECO to drive higher growth and performance in 2023 and beyond, investments which we will continue to make to strengthen and better position CECO. At current debt levels, CECO's available capacity to support continued investment in growth and value creation while maintaining a comfortable cash buffer is in the $74 million range. I don't know that we've set an actual -- I mean, look, I have a number that I believe that at the end of the day, we certainly -- if you index everything at a similar growth rate somehow over the next few years and our strategic plans and activities play out the way they could maybe, and strategic being organic and inorganic, maybe we wake up in a few years and all 3; air, water and energy transition are somewhere around 1/3 of our company because we expect to get really good growth in each, again, organically and inorganically."
}