{
    "symbol": "GIII",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-02 11:04:03",
    "content": " Net sales for the third quarter were $1.08 billion, an increase of 6.2% compared to last year's third quarter net sales of $1.02 billion. We believe we can deliver growth because we've built a powerful foundation and have become a well-diversified company with expertise across a range of global brands with a broad range of price points for a broad range of customers, multiple points of distribution with strong retail relationships in North America and around the world with partners that include department and specialty stores, value retailers, wholesale clubs, digital pure plays and marketplaces in addition to our own omnichannel platforms. Three of our recently acquired or launched brands, DKNY, Karl Lagerfeld Paris in North America, and the remaining global Karl Lagerfeld business have added $1 billion in annual sales to our business. Saint-Tropez founded Vilebrequin, our status swimwear brand's robust momentum continues with another quarter of strong double-digit growth and remains on track to register a record year of sales and profitability. As our bottom line net income per diluted share was below our guidance and with some uncertainties ahead, we're adjusting our order book for the fourth quarter and full-year. Net sales for the third quarter ended October 31, 2022, increased approximately 6% to $1.08 billion from $1.02 billion in the same period last year. Included in our sales for this quarter were $55 million in sales of the Karl Lagerfeld business, which became a wholly owned subsidiary on May 31, 2022. The lack of additional space in our warehouses, along with port congestion and the logistical challenges related to trucking, all contributed to us incurring approximately $27 million of demurrage charges in the third fiscal quarter, resulting in a one-time 250 basis point negative impact to our gross margin percentage. We also expect that the addition of the Karl Lagerfeld business in our results of operations will increase the percentage of net sales represented by SG&A expenses as the Karl Lagerfeld business model includes a higher amount of direct-to-consumer business, which has a higher SG&A rate. As for our guidance, for the full fiscal year 2023, we now expect net sales of approximately $3.15 billion and net income of between $147 million and $152 million or between $3 and $3.10 per diluted share. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}