{
    "symbol": "GIII",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-16 11:47:08",
    "content": " Full fiscal year non-GAAP net income per diluted share was $2.85, compared to last year's $4.20. For the fiscal 2023 fourth quarter, net sales reached $854 million, an increase of 14% from $748 million last year. Further, we sequentially decreased our inventories by $192 million from the third quarter, ending the year with inventory levels up 39% to fourth quarter fiscal 2022. Looking ahead to guidance for this coming year, with the inclusion of a full-year of the acquired Karl Lagerfeld business, our top line is expected to be $3.23 billion, flat to last year. This resulted in significantly higher sales than we would have expected in last year's first quarter, which ended up approximately 20% up to pre-pandemic Q1 levels. Our Karl Lagerfeld business had strong growth last year, reaching $400 million in annualized global sales. Net sales for the fourth quarter ended January 31, 2023 increased approximately 14% to $854 million from $748 million in the same period last year. Our gross margin percentage was 33% in the fourth quarter of fiscal 2023, compared to 33.7% in the previous year's fourth quarter. Non-GAAP net income for the fourth quarter was $20 million, or $0.41 per diluted share, compared to $52.6 million or $1.06 per diluted share in the previous year. This year's SG&A rate was expected to de-lever with the inclusion of the Karl Lagerfeld business, which added approximately $80 million in expenses. Full-year non-GAAP net income was $139 million or $2.85 per diluted share, compared to $208 million or $4.20 per diluted share in the previous year. On a non-GAAP basis, we expect net income for the full fiscal year 2023 of between $125 million and $130 million or between $2.55 and $2.65 per diluted share. For the first quarter of fiscal year 2024, we expect net sales of approximately $560 million compared to $689 million in the same period last year. This compared to non-GAAP net income of $35 million, or $0.72 per diluted share in the first quarter of fiscal year 2023. Specifically for the first quarter, we expect gross margin percentages to increase by approximately 600 basis points to last year, primarily due to freight cost reductions, the additional of the Karl Lagerfeld business, and the benefit from promotional sales that were shifted to the fourth quarter, as Morris discussed. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}