{
    "symbol": "GIII",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-07 11:15:22",
    "content": " Now turning to the quarter's results, where we continue to see significant year-over-year sales growth of our power brands, DKNY, Donna Karan, Karl Lagerfeld, Calvin Klein and Tommy Hilfiger. Net sales for the second quarter was $605 million, an increase of 25% compared to last year's second quarter net sales of $483 million. In the second quarter, net sales for DKNY's international business almost doubled compared to last year, as we continue to grow and expand our European operations. Net sales for the second quarter ended July 31, 2022, increased approximately 25% to $605 million from $483 million in the same period last year. Net sales of our retail operations segment were $31 million for the second quarter, up 14% compared to net sales of $27 million in last year's second quarter. Excluding approximately $5 million in one-time expenses associated with the Karl Lagerfeld acquisition, non-GAAP SG&A was $186 million or 30.7% of net sales in this quarter compared to $147 million or 30.4% of net sales in last year's second quarter. For the full fiscal year 2023, we now expect net sales of approximately $3.15 billion and net income of between $182 million and $187 million or between $3.69 and $3.79 per diluted share. Non-GAAP results exclude the $31 million gain on the fair value of our minority ownership in the Karl Lagerfeld prior to the acquisition, $16.7 million of expenses related to the Karl Lagerfeld transaction, and noncash imputed interest expense of approximately $6.9 million. Non-GAAP results for fiscal 2022 exclude non-cash imputed interest expense of $6.4 million, one-time expenses of $2.1 million related to the Karl Lagerfeld transaction and net asset impairment on lease terminations of $1.5 million. For the third quarter of fiscal year 2023, we expect net sales of approximately $1.07 billion compared to $1.02 billion in the same period last year. Thanks for your question, Jay. Thanks for your question, Jay."
}