{
    "symbol": "ZTS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 12:51:08",
    "content": " Our 8% operational revenue growth for the year was driven by our innovative companion animal portfolio, which grew 14% operationally while our livestock portfolio declined 2% operationally, primarily due to generic competition and market challenges, especially in the U.S. Reflecting our longstanding value proposition, we grew our adjusted net income faster than sales for the year with an operational increase of 11% for the full year and we use this performance and financial strength to continue investing in the R&D, manufacturing capacity and sales and marketing resources to support our future growth and pipeline. We are guiding to a range of 6% to 8% operational growth for revenue in 2023 and adjusted net income growth in the range of 7% to 9% operationally, which reflects our increased investment plans for R&D and manufacturing to support growth. We marked our 10-year anniversary as a public company on February 1, a decade, which saw us bring more than 2,000 new products and lifecycle innovations to market, build a diverse portfolio, featuring market-leading franchises and 15 current blockbusters generate consistent above-market revenue growth and deliver a total shareholder return of more than 500% all while increasing our market cap from $16 billion in 2013 to about $75 billion today. This growth was partially offset by our livestock business, which declined 2% operationally, primarily due to the generic competition, supply constraints as well as challenging market conditions in certain geographies. Our companion animal diagnostics portfolio declined 2% operationally in the year, with declines in the U.S., partially offset by growth internationally. Our key dermatology products, Apoquel and Cytopoint, had solid global growth in the quarter, posting $347 million of revenue, representing 14% operational growth against a robust prior year in which key derm grew 23% operationally in the fourth quarter of 2021. Simparica Trio continues to drive growth in the quarter with sales of $158 million in the U.S., growing 39%. U.S. livestock declined 6% in the quarter as expected, with sales of cattle products impacted by supply restocking for certain products in the third quarter of 2022 as well as the impact of generic competition in cattle and poultry. Our key dermatology products contributed $108 million to revenue and grew 22% on an operational basis in the quarter, with growth in Cytopoint across all key markets and continued double-digit growth of Apoquel. And weâ\u0080\u0099re almost at 10 years since Apoquel was launched and itâ\u0080\u0099s just amazing to see that we continue to expand the market, and we believe there is more room to expand not only in the U.S., where we grew 12% in 2022, but particularly in international markets, it takes longer to get to peak sales levels, and we delivered 27% growth in international."
}