{
    "symbol": "VERB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 19:34:08",
    "content": " These savings, which will have a material impact in the last part of this quarter and certainly into 2023, and reduced our normalized operating expenses dramatically, bringing our operational cash burn down to approximately $1 million a month, giving us a fair amount of runway into next year, by which time we expect to see significant revenue contributions from our MARKET.live platform, before we need to consider any additional capital raises. SaaS recurring subscription revenue, a component of Total digital revenue, was approximately $1.9 million, a modest increase, which as Rory said, virtually flat over the same period last year. Total digital revenue was $2 million, versus $2.4 million for the same period last year primarily due to the record non-SaaS digital revenue we experienced in that quarter as I just discussed. Total revenue was $2.2 million, versus $2.9 million for the same period last year, primarily due to the decrease in the low margin non-digital revenue business we continue to exit. Cost of revenue across all products was $0.7 million, an improvement of 32% over the same period last year, and an improvement of 12% over Q2 2022, reflecting planned cost reductions and a continuing shift towards the Companyâ\u0080\u0099s digital business, and away from the lower margin non-digital business. Research and development expenses were $1.4 million, as compared to $3.5 million for the same period last year, reflecting an improvement of 61% due to planned cost reductions, and continued improvement of 30% over last quarter for our SaaS business, offset by new expenditures attributable solely to MARKET. General and administrative expenses were $7 million as compared to $6.1 million for the same period last year, reflecting a modest 6% increase over Q2 of 2022, attributable for the most to one-time expenses incurred in connection with Shopfest and the launch of MARKET.live. Total revenue was $7.3 million, a decrease of 7% over the same period last year, attributable in large part to our decision to exit the low margin non-digital business discussed previously. Cost of revenue was $2.5 million, an improvement of 26% over the same period last year, reflecting the impact of planned cost reductions and a shift towards the Companyâ\u0080\u0099s digital business and away from the lower margin non-digital business. Research and development expenses were $4.3 million, as compared to $9.6 million for the same period last year, reflecting an improvement of 55% attributable to the planned cost reductions previously discussed."
}