{
    "symbol": "BIRD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 21:40:05",
    "content": " These headwinds created a drag on revenue estimated to be approximately $2 million in the quarter, which would have represented an additional 15% % year-over-year growth in our international business. More on this from Mike, but in short despite the external pressures that have changed our sales outlook for the year in our international business, we expect to deliver strong top line growth of 21% to 24% in 2022, well within our range of our medium-term revenue growth target of 20% to 30%. Based on the Q1 performance of these stores and our expectations for the balance of 2022, we continue to have strong conviction in achieving our previously shared pro forma US new store targets of $3.5 million to $4.5 million in gross sales and low 20% four-wall EBITDA margins. And three, the lower mix of sales in our margin-accretive international business when compared to Q1 2021 impacted gross margin by approximately 20 basis points year-over-year. With that estimated impact taken into account, our updated 2022 net revenue guidance target is $335 million to $345 million, which is up 21% to 24% versus 2021 including an estimated year-over-year FX impact of 150 to 200 basis points. Two, our prior full year gross margin guidance target factored in an estimated 200 basis points year-over-year impact of external headwinds on logistics and distribution center costs. Looking at our updated 2022 adjusted EBITDA guidance target of negative $25 million to negative $21 million, I'll just note that we have tightened our balance of year SG&A spending to partially offset the impact of the external headwinds. Our Q2 net revenue guidance target is $75 million to $79 million, up 10% to 16% versus Q2 2021 including an estimated year-over-year FX impact of 225 to 300 basis points. Third, in the second half total net revenue growth is targeted to be in the middle of our medium-term target range of 20% to 30% driven by a strong product pipeline more retail stores and the increased velocity of our omnichannel flywheel in the US. The performance of our US business particularly the omnichannel flywheel that's accelerating with the broader US retail recovery, our conviction that our international business will return to its historical growth rates once the external headwinds pass and the potential for third party to be a significant lever of EBITDA accretive growth. We have a clear path to hit this target through growth in our gross margin accretive retail international businesses, our strong pricing power, the continued introduction of new higher-margin products and the easing of at least a portion of the 450 to 500 basis points of logistics cost headwinds we have faced over the past two years. Your line is open. Your line is open. Your line is open. Your line is open. I'd go back to the comments you gave about the top line kind of basically getting into the media – the middle part of our medium-term range of 20% to 30% and the drivers behind that again are the product portfolio we have in place there, the retail -- having more retail stores on a year-over-year basis, that's going to certainly help the increase in the velocity of that omnichannel flywheel that we continue to see."
}