{
    "symbol": "XOM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 12:30:24",
    "content": " From a return standpoint, what I would say is, and we've talked about this before, we're insisting that the work we do here that we had positioned ourselves competitively versus the rest of industry and the thinking being that whatever incentives required for the marginal player out there to capture and store CO2 or develop biofuels or hydrogen, that we will leverage our advantages to drive a higher return. And so structurally, we would say there's going to continue to be a tight market until supply and demand comes into equilibrium, right, in that there's only 2 ways that happen, either more supply or reduced demand and supply, especially supply of LNG does take time to bring online. So once we get through this period where we're building inventories, we're short in supply and therefore, you've kind of lost some of that seasonality, that once we get to more of a balanced position, which I think is a couple of -- 3 years out, frankly, we'll start to see that seasonality show back up again when we're back in more stable markets. I think as you move outside of China, which is -- obviously, dominates demand out in Asia and move more west into the U.S. and Europe, I think Europe, obviously, with some of the energy challenges that they're facing, are going to have much slower economic activity than would be historical. So the commentary I had made is in our LNG portfolio, about 80% of our volumes would be under long-term contract and we're seeing the benefit of the timing lag because those contracts are typically -- the pricing is tied to crude, but it's lagged kind of 3 to 6 months. So what I try to tell you is if you put the price timing impacts to the side, we would start at about $5 billion in profit in energy products, and then it's going to be about what the -- how the market unfolds in the fourth quarter. But what I would say is, and I think we talked about this some years ago that we were -- when we moved to the value chain constructs, when we combined our fuels marketing organization with our refining organization and start looking at optimizing value all along the value chain, the trading organization became a much more relevant channel with respect to optimization."
}