{
    "symbol": "KEY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 11:41:03",
    "content": " In the second quarter, we raised over $36 billion in capital for our clients, retaining 22% on our balance sheet. As is our normal practice, the Board will evaluate a dividend increase in the fourth quarter. For the second quarter, net income from continuing operations was $0.54 per common share, down $0.18 from last year and up $0.09 from the prior quarter. Turning to Slide 6, average loans for the quarter were $109 billion, up 8% from the year ago period and up 5% from the prior quarter. Our consumer businesses continued its strong performance as we saw residential real estate originations of $3.2 billion, resulting in an increase in balances of 13% from last quarter. If we adjust for the sale of the indirect auto portfolio last year as well as the impact of PPP, our core loans were up year-over-year by approximately $19 billion on average or 21%. Continuing on to Slide 7, average deposits totaled $147 billion for the second quarter of 2022, up $3 billion or 2% compared to the year ago period and down $3 billion or 2% compared to the prior quarter. Turning to Slide 8, taxable equivalent net interest income was $1.1 billion for the second quarter compared to $1.02 billion in both the year ago period and the prior quarter. The current quarter reflected $14 million of net interest income from PPP, down from $21 million in the prior quarter and $62 million in the second quarter of 2021. Moving to Slide 9, non-interest income was $688 million for the second quarter of 2022 compared to $750 million for the year ago period and $676 million in the first quarter. Compared to the prior period, offsetting the decline in investment banking fees was an increase of $15 million in the other income, mostly related to larger negative market-related adjustments in the prior quarter. Non-performing loans were $429 million this quarter or 38 basis points of period-end loans, a decline of $10 million from the prior quarter. As is our normal practice, the Board will evaluate a dividend increase in the fourth quarter. Net interest income is expected to be up between 10% and 12%, reflecting growth in average loan balances and higher interest rates, partially offset by lower fees from PPP forgiveness."
}