{
    "symbol": "KEY",
    "quarter": 1,
    "year": 2022,
    "date": "2021-04-20 15:19:13",
    "content": " Total average loans were $101 billion, up 5% from the first quarter of last year, driven by growth in both commercial and consumer loans. Consumer loans benefited from the continued growth from Laurel Road and as Chris mentioned, record performance from our consumer mortgage business with $3 billion of consumer mortgage loans this quarter. Average deposits totaled $138 billion for the first quarter of 2021, up $28 billion or 25% compared to the year ago period and up 1.5% from the prior quarter. And your line is open. We talked on the call in January about we thought that with the new loans that we'd be seeing coming through with the current wave of PPP, if you take a look at the net interest income, which includes both the 1% interest plus the fee income, we thought that'd be up about $80 million year-over-year. And your line is open. And as we mentioned earlier, from the fourth quarter to the first quarter one of the drivers of why our NII was down was about $8 million lower loan fees and some of that was related to the PPP because we had higher levels of forgiveness in the fourth quarter than what we actually did in the first quarter of this year. And so, as far as the PPP impact, we would expect that the total NII level contributed for first quarter versus the rest of the year to continue to trend down a little bit, very modestly at first and thinking of $1 million or $2 million a quarter coming from that just with the impact of the forgiveness of those loans. And your line is open. And your line is open. And your line is open. And your line is open. And your line is open. As we mentioned earlier, we were starting to see in the first quarter some nice trends as far as the year-over-year growth rates in all of our card programs, whether it was consumer credit card or debit card or whether it was the commercial card products that we have. And your line is open. And so as we mentioned before, we expect the first quarter to be the low point for us for average loan balances for the year, and that's really led by the consumer growth initially. And so I would think that, that would be an expected pace of maybe deploying $1 billion to $2 billion per quarter as far as shifting out of cash and putting that into the investment portfolio in addition to the loan growth."
}