{
    "symbol": "KEY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 12:30:05",
    "content": " Revenue was up 5% relative to the second quarter, driven by higher net interest income with a 13-basis-point increase in our debt interest margin. If we were to re-price our existing short-term treasuries and swaps at todayâ\u0080\u0099s interest rates, we would have an annualized net interest income benefit of over $1.2 billion. Pre-provision net revenues was up 9% from the second quarter, with a 5% increase in revenue driven by loan growth and by the way that we positioned our balance sheet to benefit from higher interest rates. Average loans for the quarter were $114 billion, up 14% from the year ago period and up 5% from the prior quarter. Laurel Road originated approximately $200 million of loans this quarter reflecting the ongoing federal student loan payment holiday, as well as the impact of interest rates. Average deposits totaled $144 billion for the third quarter of 2022, down $3 billion or 2% compared to both the prior quarter and the year ago period. Taxable equivalent net interest income was $1.2 billion for the third quarter, compared to $1.0 billion in the year-ago quarter and $1.1 billion in the prior quarter. For example, if we were to re-price our existing $9 billion in short-term treasuries and $26 billion of swaps for todayâ\u0080\u0099s interest rates, we would have an annualized net interest income benefit of over $1.2 billion. Non-interest income was $683 million for the third quarter of 2022, compared to $797 million for the year ago period and $688 million in the second quarter. We expect non-interest expense to be up between 1% and 3% for the fourth quarter, reflecting higher incentive compensation relative to fee production, as well as $20 million of one-time charges in the fourth quarter, including a pension settlement charge, which will flow through other expense. But that -- you are right, as we look at how we are positioned with the benefit that Chris and I both referred to as far as just the short-term swaps and the short-term treasuries and those rollovers that we do believe that we are going to grow net interest income and margin even beyond that first half of 2023 and so even with this increased deposit beta. And as we think about that $1.2 billion benefit coming back, how much of that is coming from the swap book versus the securities book and over what period of time do you realize that $1.2 billion back into your net interest income? And so one -- and just a simple math for that would be taking a look at our full year net interest income and if you just layered on top of that, the $1.2 billion that we talked about for the re-pricing of the swaps and the treasuries, that clearly gets you into the mid-3s and maybe not to the 3.7% range. I donâ\u0080\u0099t see the same level of lift that -- so I think you are going to see -- we havenâ\u0080\u0099t given guidance yet for 2023, but with respect to loan growth we are targeting 2% to 4% in the fourth quarter."
}