{
    "symbol": "CCJ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 13:22:09",
    "content": " Also, let's not forget the 80 million pounds of long-term uranium contracts and the 17,000 tons of conversion services contracts added to the portfolio, making it one of the biggest contracting years we've ever had with a record number of contracts. We've reached an agreement on key commercial contract terms that once finalized, could see Cameco provide sufficient volumes of uranium and conversion to meet all of Ukraine's nuclear fuel needs through 2035. With approximately 180 million pounds of uranium and over 55,000 tons of conversion in long-term commitments, our customers are sending us clear signals that they recognize the significant challenges the supply side of our industry faces and that they see the value in securing access to Cameco's strategic proven Tier 1 assets that are in geopolitically attractive jurisdictions. With planned production of 18 million pounds per year and annual license capacity of 25 million pounds at McArthur River, Key Lake, there's an opportunity for further Tier 1 production growth. We have fully permanent and proven Tier 2 assets that don't make sense at today's prices, but when you think about them in the context of a looming supply gap, there's a potential pathway for them to add value for us in the future, but we'll continue to be very disciplined in our evaluation on that front. So we are still in supply discipline mode because strategically, we need to see continued market improvement in the form of long-term contracts, we do not produce from these assets to dump into the spot market or to build an excess inventory, that does not create long-term value. So to your point, when you -- when we're in 2030, for example, there are some folks out there that are advocating that they're going to bring production into uranium, and they say, we don't have to worry about a contract portfolio today because look, demand is going to be 200 million pounds in 2030."
}