{
    "symbol": "SOFI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-30 11:34:05",
    "content": " A few key achievements from the quarter include our seventh consecutive quarter of record adjusted net revenue of $443 million, up 58% year-over-year, which accelerated from 51% year-over-year growth in the third quarter and reflects record revenue in all three business segments. In Q4, we had an incremental GAAP net income margin of 42%, resulting in a loss of just $40 million, roughly half of the third quarter 2022 loss. Said another way, of the $171 million of incremental GAAP revenue year-over-year, $71 million or 42% dropped to the GAAP net income line. Our strategy is to continue to play out with SoFi Money, which allowed us to surpass $7.3 billion in deposits, up 46% quarter-over-quarter, and savings of 190 basis points on cost of funds versus using other sources of debt to fund loans. Of these new adds, financial services products grew by 60% year-over-year to $6.6 million, while lending products were up 24% to over $1.3 million. In lending, we generated a record of $315 million of adjusted net revenue, up 51% versus the prior year period. This is a great segue into financial services more broadly, where net revenue nearly tripled year-over-year to $64 million and grew 32% from $49 million sequentially in Q3. We finished Q4 at 6.6 million Financial Services products, up 60% year-over-year, and 4.9 times total lending products of $1.3 million. In the fourth quarter, full segment revenue of $86 million grew 61% year-over-year with a 20% margin at the segment level or 24% if you exclude Technisys. For the quarter, top line growth accelerated, and we delivered record adjusted net revenue of $443 million, up 58% year-over-year and 6% sequentially from the third quarter's record of $419 million and above the high end of the guidance provided during our last earnings call. For the full year, we delivered $1.54 billion of adjusted net revenue, up 53% year-over-year from $1.01 billion in 2021. In lending, fourth quarter adjusted net revenue grew 51% year-over-year to $315 million. For the full year, lending adjusted net revenue grew 45% to $1.11 billion, and the segment delivered $664 million of contribution profit at a 60% margin. Shifting to our tech platform, where we delivered net revenue of $86 million in the quarter, up 61% year-over-year, or up 13% excluding Technisys. Overall, annual revenue growth was driven by 31% year-over-year Galileo account growth to $131 million in total as well as sequential growth in transactions per active account. For the full year, the Tech Platform segment grew revenue 62% to $315 million, and delivered $76 million of contribution profit at a 24% margin. Moving on to Financial Services, where net revenue of $65 million increased 195% year-over-year, with new all-time high revenue for SoFi Money and continued strong contributions from SoFi Credit Card, SoFi Invest and Lending as a service. Overall monetization continues to improve with annualized revenue per product increasing to $40, nearly 2 times the $21 in the same prior year quarter and up 25% sequentially from $34. Contribution losses were $44 million for the quarter, which improved sequentially as a result of the growth in revenue as well as fixed cost leverage, but increased year-over-year, predominantly as a result of building our CECL reserves for the SoFi credit card business, which is expected as we continue to grow in scale. For the full year of 2023, we expect to deliver adjusted net revenue of $1.925 billion to $2.0 billion, representing 25% to 30% growth and adjusted EBITDA of $260 million to $280 million. Your line is now open, please go ahead. Your line is now open, please go ahead. Your line is now open, please go ahead. Your line is now open, please go ahead. Your line is now open, please go ahead. Your line is now open, please go ahead. Your line is now open, please go ahead. February marks my five-year anniversary at SoFi, and it's just very humbling what we've achieved during such an unprecedented time period, growing from less than $500 million of revenue to $1.5 billion at the end of 2022, 600,000 members to 5.2 million members and negative adjusted EBITDA to $140 million of EBITDA, plus raising $3.6 billion in capital, becoming a public company and receiving a federal bank license."
}