{
    "symbol": "SOFI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 22:03:11",
    "content": " A few of the key achievements in the quarter include another quarter of record adjusted net revenue with 49% year-over-year growth, our seventh consecutive quarter of positive EBITDA, continued strong growth in members, products and cross byline, the successful launch of SoFi Bank and our new SoFi checking and saves account offering, both of which are already contributing to our results. We achieved record total adjusted net revenue of $322 million, up 49% year-over-year and 15% higher than the prior record set in Q4 2021. Lending adjusted net revenue of $244 million increased 45% year-over-year and 17% sequentially despite the sixth extension of the moratorium on federal student loan payments, which has kept our student loan origination volumes at less than half of pre-pandemic levels. Financial Services adjusted net revenue of nearly $24 million increased 264% year-over-year with the largest contributions coming from record SoFi Money revenues and continued strength in SoFi Credit Card, SoFi Invest and Lending as a Service. Financial Services products of $4.7 million at quarter end grew 155% year-over-year, while lending products of more than 1.1 million were up 20%. Our personal loan borrowers’ weighted average income is $160,000 with a weighted average FICO score of 746. Our personal loan borrowers’ weighted average income is $160,000 with a weighted average FICO score of 746. For the quarter, we delivered record adjusted net revenue of $322 million up 49% year-over-year and up 15% sequentially from the prior quarter’s record of $280 million and $37 million above the high-end of our guidance of $280 million to $285 million. In lending, first quarter adjusted net revenue accelerated for the second quarter in a row and grew 45% year-over-year to $244 million versus 30% in Q4 ‘21 and 21% in Q3 ‘21. Growth in net interest income was driven by improvements in NIM, both yield and cost of capital, an increase in loan balances, which grew to $7 billion, predominantly as a result of holding loans for a longer period of time, a very early benefit of having the bank as well as 30% growth in funded volume. The largest contributor of funded volume growth was our personal loans business, which grew 151% or $1.2 billion year-over-year to $2 billion in originations for the quarter, a new high for us and up 23% sequentially. Shifting to our tech platform, where we delivered net revenue of $61 million in the quarter, up 32% year-over-year versus a tough comparison driven by stimulus benefits and a rapid evolution from cash to digital payments in the same prior year period. Moving on to Financial Services, where adjusted net revenue of $24 million increased 264% year-over-year with new all-time high revenues for SoFi Money, which is now transitioning to SoFi checking and savings and continued strong contributions from SoFi Credit Card, SoFi Invest and Lending as a Service. In Q1, our balance sheet grew by approximately $3 billion, and that was driven by three factors: first, cash equivalents and restricted cash increased by approximately $900 million, primarily as a result of an increase in pledge activity to capitalize the bank as well as increases in deposits at SoFi Bank, which totaled $1.2 billion at the end of the quarter. For Q2, we expect another strong quarter of growth with $330 million to $340 million of adjusted net revenue up 39% to 43% year-over-year and expect $5 million to $15 million of adjusted EBITDA. Having delivered nearly $1.3 billion of annualized revenue and our seventh consecutive quarter of positive EBITDA, we continue to make great progress against our long-term growth objectives in Q1 ‘22 and remain very well capitalized to continue pursuing our ultimate goal of making SoFi a top financial institution. Thank you for your question. Despite the rapidly rising rate environment that we’ve been going through over the course of the last quarter plus, we were still able to deliver $133 billion of contribution dollars at a 54% margin across our entire portfolio, even as rates went up 80 to 150 basis points across the curve. Thank you for your question. Thank you for your question. Thank you for your question. Thank you for your question."
}