{
    "symbol": "STTK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-26 10:53:10",
    "content": " We are very pleased to have completed the Phase 1a monotherapy dose escalation clinical trial of 154 in patients with platinum resistant ovarian cancer and achieved all of the primary goals of this first in human study including the selection of a dose of 154 to advance into our Phase 1b combination cohort, which I will describe in a moment. From a pharmacodynamic perspective, we believe that the clinical data generated through the course of the Phase 1a trial has validated one of our central hypotheses and the design of the ARC platform and shown that 154 was able to safely activate CD40 in a dose-dependent manner, including doses which saturated the CD40 receptor. Although we acknowledge that the objective response rates for the first generation of CD47 inhibitors has contracted in this patient population over the past couple of years, we are excited about the opportunity that opens for agents like 154, which provides the important component of CD40 activation, in addition to CD47 blockade and which improved antitumor immunity in preclinical tumor models and published head-to-head studies in comparison to CD47 blocking antibodies. As always, we remain focused on delivering novel therapeutics which will benefit patients experiencing cancer with high unmet medical need and look forward to the combination data in our ongoing clinical trials with SL-172154 in the coming quarters. As Taylor mentioned, we have now completed our multi-center, open-label, dose-escalation Phase 1a clinical trial intended to assess the safety, tolerability, pharmacokinetics, anti-tumor activity and pharmacodynamic effects of intravenous administration of 154 as monotherapy in-patients with platinum-resistant ovarian cancer. Following the completion of Phase 1a dose escalation clinical trial and selecting a dose, we advanced to enrolling patients in our Phase 1b clinical trial of 154 in combination with liposomal doxorubicin in patients with platinum-resistant ovarian cancer. As you heard from Lini, clinical updates from the 154 program including complete data from the monotherapy dose-escalation trial in platinum-resistant ovarian cancer patients and initial data in combination with liposomal doxorubicin also in ovarian cancer patients are expected mid-year 2023."
}