{
    "symbol": "STTK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 06:47:07",
    "content": " As you will hear from Dr. Pandite in a moment, our clinical team has made excellent progress and we completed enrollment in the monotherapy dose escalation portion of our Phase I trial for patients with advanced platinum-resistant ovarian cancer in the second quarter of this year. In the third quarter, we began enrolling patients in the first chemotherapy combination cohort in ovarian cancer, and we have selected 3 milligrams per kilogram as the starting dose level for 154 in this combination cohort. In addition to our clinical development program in solid tumors, we began a clinical study for 154 for patients with acute myeloid leukemia and high-risk myelodysplastic syndrome in the second quarter of this year, and we expect to enroll patients in the first combination cohort with azacitidine in the fourth quarter of this year. Our first clinical trial of 154 is a multicenter, open-label, dose escalation trial intended to assess the safety, tolerability, pharmacokinetics, antitumor activity and pharmacodynamic effects of intravenous administration of 154 as monotherapy in patients with platinum-resistant ovarian cancer. Enabled by our progress in the Phase I trial, I'm pleased to say that in the third quarter of this year, we dosed our first patient in a Phase Ib clinical trial of 154 in combination with liposomal doxorubicin in patients with platinum-resistant ovarian cancer. As you will recall, we have previously reported initial data through 6 milligrams per kilogram from the ongoing Phase I dose escalation clinical trial, demonstrating evidence of antitumor activity and dose-dependent pharmacodynamic activity. As you heard from Lini, clinical updates from the 154 program, including complete data from the monotherapy dose escalation study in platinum-resistant ovarian cancer patients and initial data in combination with liposomal doxorubicin, also in ovarian cancer patients, are expected midyear 2023."
}