{
    "symbol": "PNTG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 15:39:03",
    "content": " While this quarterâ\u0080\u0099s earnings didnâ\u0080\u0099t fully reflect the progress we expected as we navigated continued wage pressures, full sequestration and a softer hospice ADC, weâ\u0080\u0099re seeing notable progress as measured by revenue, admissions, occupancy and cash flow, weâ\u0080\u0099re seeing strength build in many of our markets and clusters. In our home health and hospice segment, strong top and bottom line results were led by a 10.2% increase in total home health admissions, a 10.1% increase in total Medicare home health admissions and a 7.8% increase in hospice , each over the prior-year quarter. Though there is still some temporary drag in the growth of our hospice average daily census due primarily to a shorter average length of stay were improving sequentially as we saw ADC grow 0.4% over the second quarter of 2022, which itself was an increase of 2.4% over the first quarter as our average length of stay normalizes and our local teams continue strong admissions, we expect our ADC growth to return to traditional levels. Our leaders exercise rigorous cost discipline in the face of significant increases in the cost of labor, fuel and other inflation-sensitive areas, leading to adjusted EBITDA of $14.2 million, $1 million or 7.7% above the third quarter of 2021. And in home health and hospice segment began in and has thrived through periods of uncertainty and reimbursement cuts, much like today, thanks to the scalability of our operating model built on local leadership, our commitment to maintaining a strong and flexible balance sheet and our opportunistic approach to acquisitive growth. Same-store senior living segment revenue of $32.2 million was an increase of $3.4 million or 11.8% over the prior-year quarter, while adjusted EBITDA of $1.5 million represents growth of $1.4 million over the prior-year quarter. Excluding the communities we exited year-to-date, average occupancy improved 140 basis points over the prior year quarter, and revenue per occupied room increased 12.2% over the prior-year quarter, in part due to rate increases that went into effect over the summer and better processes for tracking and billing more accurately for the level of care provided. For the 3 months ended September 30, 2022, we reported total GAAP revenue of $118.4 million, an increase of $6.4 million or 5.7% over the prior-year quarter. We are pleased to report ongoing strength in our GAAP cash flow from operations for Q3 2022 of $8.1 million, bringing our year-to-date cash flow from operations to $13 million, excluding the repayment of $6.2 million in Medicare Advance payments, which were completed in the second quarter, our year-to-date cash flow from operations is $19.2 million. Under the  model,  have led a charge to turn on -- good leaders, Michele Delve and Jamie Campbell and strong future CEO level leaders in the third quarter 2022  to a positive $534,000, growing occupancy by 6.9% to 88.5% and revenue per occupied room by 11.2% despite one of the most difficult operating environments weâ\u0080\u0099ve experienced. In the third quarter of 2022 compared to the prior year quarter, this market increased revenue by 31.7% and EBITDA by 148% on the back of hospice ADC that grew by 35% and home health admissions had increased by 11.2%."
}