{
    "symbol": "PNTG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 16:41:08",
    "content": " Collectively, our full year consolidated results reflect revenue of $473.2 million, an increase of $33.5 million or 7.6% over the prior year, and adjusted EBITDA improvement of $5.1 million or 19.5% over the prior year. In the fourth quarter, revenue increased $12.9 million to $124.7 million, and our adjusted EBITDA improved by $4.9 million or 98.3% over prior year with adjusted EBITDA margin expansion of 3.5% over the prior year. Top-line revenue for the quarter of $90.7 million increased $12.8 million or 16.4%, while adjusted EBITDA of $15.5 million increased $4.3 million or 38.5% and adjusted EBITDA margin expanded 2.7% each over the prior year quarter. The fourth quarter saw a significant improvement in hospice length of stay for the first time this year, the discharge length of stay increased nearly 10% sequentially over the third quarter of 2022. These leaders have driven improvement in our top and bottom line performance, adjusting for divested buildings, same-store senior living segment revenue improved to $126.8 million, an increase of $12.8 million or 11.2% over the prior year, and $33.2 million in the fourth quarter, a $3.5 million or 11.8% increase over the prior year quarter. Full year senior living segment adjusted EBITDA improved to $6 million, up $4.4 million or 282% increase over the prior year and $2 million for the fourth quarter, an increase of $1.3 million or 171% over the prior year quarter. Occupancy continued its steady ramp, growing for a fourth consecutive sequential quarter and reached 78.6%, a 330 basis-point improvement in our same store communities over the prior year quarter, and a 100 basis-point improvement sequentially over the third quarter of 2022. We achieved this occupancy improvement even as average monthly revenue per occupied room for the fourth quarter rose to $3,670, an increase of $282 or 8.3% over the prior year quarter, and $113 or 3.2% sequentially over the third quarter of 2022. For the full year ended December 31, 2022, we reported total GAAP revenue of $473.2 million, an increase of $33.5 million or 7.6% over the prior year, and GAAP diluted earnings per share of $0.22, an increase of $0.13 or 144.4% over the prior year. As a reminder, our 2022 full year guidance was total revenue of between $458 million and $462 million, earnings per diluted share between $0.55 and $0.60, and adjusted EBITDA of between $31 million and $33.5 million. Consistent with that guidance, revenue adjusted for startups and the domestic building was $464.1 million, $38 million or 9.1% increase, adjusted EBITDA was $31.5 million, a $5.1 million or 19.5% increase, and non-GAAP adjusted earnings per diluted share of $0.57 on shares a 30.2 million, an increase of $0.11, or 23.9% over the prior year. Key metrics for the full year and three months ended December 31, 2022 include $64.5 million drawn on our revolving line of credit and $2.1 million cash on hand at quarter-end; 1.93 times net debt to adjusted EBITDA; and cash flows provided from operations of $9 million for the year and $25.8 million excluding the impact of $6.5 million of the transfer related to the divested buildings, $4.1 million in deferred FICA payments and $6.2 million in the repayment of Medicare advance payments. As we mentioned in our press release, we are providing full year 2023 guidance of revenue of $53.5 million (sic)  to 518.4 million; adjusted EBITDA of $38.4 million to $42.6 million; and adjusted earnings per share of $0.66 to $0.76. Our 2023 annual guidance anticipates an EPS increase quarter-over-quarter consistent with our 2022 performance and is based on a ramp in home health and hospice ADC, occupancy improvements in senior living, anticipated reimbursement rate adjustments and elevated interest rates, does not include unannounced acquisitions and excludes startup operations, share-based compensation, acquisition-related costs and onetime implementation and unusual items."
}