{
    "symbol": "PNTG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 11:09:04",
    "content": " Our operating model is founded on two Pennant's fundamental to our approach to health care services: one that health care is a local endeavor where providers are most successful when key operational decision-making meets local community needs and occurs close to patients and employees; and two, peer accountability from operational and resource partners is more effective at driving clinical and financial results than traditional hierarchical or top-down accountability structures. We look for senior living communities with a quality of physical plant where our operational, sales and marketing and wellness expertise can drive revenue increases through occupancy growth, additional care capabilities and rate improvement with disciplined cost management. In our home health and hospice business, our unique operating model allows us to achieve quality outcomes as measured by many industry and value-based metrics such as hospital readmission rates in a lower cost setting, as the senior living industry continues to evolve toward more acute care, our experience as a health care provider equips us to offer our residents, a better quality of life experience at an affordable cost, thus appealing to a broader population. Our home health revenue grew a strong 15.3% over the prior year quarter as we continue to strengthen our relationships with partners across the health care communities we serve, and our acquisitions from 2021 performed better. We acquired the real estate underlying our assisted living community in Twin Falls, Idaho, reducing our liability through the use of cheaper cost of capital and acquired the operations of Barber Station Assisted Living & Memory Care, a highly strategic Class A assisted living and memory care community in Boise, Idaho, with a favorable long-term triple net lease, close proximity to our service center and strong home health and hospice partners, we are excited to welcome this community into our portfolio. Senior Living segment revenue of $31 million increased $2.9 million or 10.3% over the same store prior year quarter, while adjusted EBITDA of $900,000 represented growth of 11.1% over the prior year quarter. The momentum our senior living leaders are generating is demonstrated by occupancy improving 1.8% over the first quarter of 2022, leading to first half 2022 EBITDA that represents a $1.7 million improvement over the second half of 2021. If we continue to see modest growth over our current census levels in home health and hospice and senior living, incremental margin improvement through operating efficiencies and the impact of the hospice Medicare rate improvement in Q4, we are confident we can reach the low end of our range. Doug and Ray Allen have helped lead the Las Fuentes team to steady top and bottom line financial growth, thanks to a culture of caring and dedication to providing life-changing service to residents and employees, while being a top senior living destination for many years and consistently achieving excellent results, Doug and Ray Allen have continued to build a successful culture, leading to another year of revenue, EBITDA and occupancy growth."
}