{
    "symbol": "LIND",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 13:25:04",
    "content": " Cash generated from operations was positive $15.2 million driven by earnings at the ship level and significant guests payments for upcoming voyages and deposits for future travel, partially offset by the cost associated with further ramping operations and marketing spend to drive future bookings. The improvement was driven by the ramping operations which increased revenues to $90.9 million versus the $15.3 million in the same period a year ago, and as compared with $67.9 million in the first quarter of 2022. The current quarter included $64 million of revenue at the Lindblad segment from operating ships predominantly in the Arctic, the Galapagos and Alaska, and $26.9 million at our land experiences segment led by Natural Habitat and Off the Beaten Path trips to Alaska and U.S. national parks, DuVine's bike tours in Italy and France, and Classic Journey trips in Europe and Latin America. Sales and marketing costs increased $7.9 million versus the second quarter a year ago, primarily due to higher commissions related to the increase in revenue, and from increased search and direct mail marketing to drive future bookings. G&A spending increased $7.9 million excluding stock-based compensation and one-time items versus the second quarter a year ago, primarily due to higher personnel costs as we ramp operations and increased credit card commissions related to final payments for upcoming itineraries and higher deposits on new reservations for future travel. The current quarter also includes a $3 million increase in depreciation versus the same quarter a year ago, related primarily to the launch of the resolution in September 2021 and accelerated depreciation on the National Geographic Islander, which is being replaced later this year. In terms of the short-term booking trends, what we're seeing, actually, aside from the increase in cancellations that we're seeing a little bit in the next few months because of some of the rising COVID cases, I always feel odd saying cancellations because it's really just people pushing their voyages from, say, 2022 into 2023, or 2024. So when I think about the liquidity position of the company, given that we have $176 million of cash, given that we're seeing substantial deposits and final payments for future travel, given that all the ships are back in the water and operating, I feel pretty good about where we are from a cash perspective today, assuming that current trends continue. Yes, the only real change that we're seeing right now, more than anything else is, I would say there's a little bit more direct business versus travel agent business, not much to really call out but a little bit more direct, it's a little bit more domestic today than traditionally would be, we're always very high on the domestic bookings versus international bookings."
}