{
    "symbol": "LIND",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 15:30:20",
    "content": " The earnings potential of the company has increased considerably since pre-pandemic levels, and with strong operating momentum across our robust platform and a growing demand for authentic and immersive travel experiences, we are poised to deliver substantial positive EBITDA in 2023, while further positioning ourselves to take full advantage of our high-quality travel portfolio and deliver sustained growth in the years ahead. Total company revenue for the full year 2022 of $421 million increased $274 million versus 2021 and was $78 million or 23% higher than 2019, due in large part to our expanded fleet and additional land-focused offerings. At the Lindblad segment, revenue of $278 million increased $195 million year-on-year and $6 million or 2% versus 2019, primarily due to the ramp in operations, which included additional available guest nights from new capacity and higher pricing across the fleet. Revenue at the Land Experiences segment for the full year 2022 of $143 million was more than double 2021, as well as double 2019, as guests returned to traveling with Natural Habitat and began to experience Off the Beaten Path's immersive trips to US national parks, DuVine's luxurious bike tours in places like Italy and France, and Classic Journey's walking ventures across Europe and Latin America. The Lindblad segment EBITDA loss was a $38 million improvement from the full year 2021, demonstrating the strong operating leverage inherent in our business model as we continued to ramp occupancy levels and maintain high price points. Operating expenses before depreciation and amortization, interest and taxes increased $222 million versus 2021, led by $159 million increase in cost of tours versus a year ago, primarily related to the ramp in ship expeditions, which included higher fuel and crew costs as well as expenses related to operating additional land-based trips. Sales and marketing cost increased $33 million versus a year ago, primarily due to higher commissions and royalties related to the increase in revenue and from increased search and direct mail marketing to drive future bookings. G&A spending increased $31 million excluding stock-based compensation and one-time items versus a year ago, primarily due to higher personnel costs as we ramped operations and increased credit card commissions related to final payments for upcoming itineraries and higher deposits on new reservations for future travel. The improvement reflects a significant ramp in operations partially offset by $13 million of additional interest expense, net, associated with higher rates and increased borrowings, mostly related to the delivery of the National Geographic Resolution in September 2021 and our debt refinancing in February 2022. The current year also included a $4.5 million increase in depreciation, related primarily to the launch of the Resolution, higher tax expense of $8 million and $16 million lower other income, primarily related to costs associated with the debt refinancing in 2022 and lower income in 2022 versus 2021 from utilization of the research grant for covered expenses. Hey guys, good morning. Hey guys, good morning."
}