{
    "symbol": "LRN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-09 21:16:04",
    "content": " This year, we topped $320 million in revenue in our middle and high school business, up over 60% from last year as we supported more than 40,000 students. Career learning continues to have strong growth, reaching $412.9 million in revenue for the year, up more than 60% in the middle and high school line of revenue. I think â\u0080\u0093 so what I would say is that the way that we onboard and higher teachers is â\u0080\u0093 it has multiple facets to first, and I think probably most important is at the end of each sort of year each full year, weâ\u0080\u0099re looking to recontract with our existing group of teachers. Now â\u0080\u0093 that in the previous few years because of, I think, greater uncertainty around how our enrollments are going to play out, that created some real stress on our system, particularly in the first year of COVID, when we saw the spike happening and had spike happened at a time that was fairly sort of, Iâ\u0080\u0099ll say, late in the hiring season, and we had a lot of catching up to do. And so I think sort of the long-term trend for us, while the teacher shortage may still continue to be acute over the next several years, is that in our position, I think we have some real nice opportunities to take advantage of the marketplace and teacher hire. But I think in the back half of the year where you saw true organic growth, I think Donna mentioned, you saw that 30% type of growth trajectory, and we are seeing strength in both the technology skills training as well as the Allied Healthcare skills training. And we, I think have actually seen now tipping points where we see employers increasingly over the past year or so get on the bandwagon of opening their doors to high school graduates, increasingly looking for high school graduates with skill sets and also increasingly looking to allow for skills to be hot, trained and ladder up while in employment. And I think that we play really well into that confluence of factors, and I think you are going to see that not just in the current programs that we have had over the past few years, which has been very successful, is that we will be launching additional programs and platforms."
}