{
    "symbol": "PRGS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-17 20:12:09",
    "content": " Speaking of MarkLogic's financial impact, which Anthony will explain in more detail in a minute, we expect MarkLogic to add approximately $75 million in annual recurring revenue with high retention rates, over $100 million to the top line on a full-year basis, and expect operating margins to improve as we integrate its sales, go-to-market, engineering, and support functions into the Progress platform. Because MarkLogic's two biggest revenue months would have occurred just before the acquisition closes and our fiscal year ends in November, we will only be able to benefit from about two-thirds of their annual revenue in our fiscal year '23 and we'll only see the full-year impact on revenue in FY '24. As I'm sure you heard in Yogesh's remarks, we're very pleased with our performance in the fourth quarter and the full fiscal year 2022, and we're also delighted to have signed a definitive agreement to acquire MarkLogic, which met all our M&A criteria and provides a larger-scale opportunity for significant value creation. Revenue for the quarter was $159.2 million and represents 11% growth over the prior year, reflecting an incremental contribution from Kemp, which we acquired in Q4 of 2021, coupled with strong sales of our OpenEdge, DataDirect, Sitefinity, DevTools, and File Transfer products. Again, worth highlighting is the impact of exchange rates because revenue growth for the full year at constant currency would have increased from 10% to 12.5%, an approximately $17 million headwind from foreign exchange for the year. It is also very important to understand that MarkLogic as of January, 31  business, results in roughly one-third of all our private activity involved in  we expect MarkLogic to contribute approximately $70 million of revenue to our fiscal 2023 and to deliver margin of approximately 25%. And while our pro forma net leverage levels are expected to remain modest, increased interest rates will impact our borrowing costs, resulting in interest expense of roughly $0.20 per share associated with the MarkLogic revolver drawdown and another increase in interest expense of $0.11 per share on our existing term loan A. Hopefully, that one was a lot more clear. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question."
}