{
    "symbol": "DHR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 12:08:06",
    "content": " For the full year 2022, core revenue growth in bioprocessing was high single digits, which included non-COVID revenue growth of more than 20%. And based on these discussions, we anticipate non-COVID bioprocessing core growth will be high single digits for the full year 2023. We also expect total core revenue growth to decline mid-single digits as a result of lower demand for COVID-19 testing, vaccines and therapeutics. And we also expect total core revenue growth to decline mid-single digits for the year as a result of lower demand for COVID-19 testing, vaccines and therapeutics. We expect for our overall guide to have a base business growth of mid-single digits, and we expect COVID testing, including now vaccine and therapeutics to have high single-digit and low double-digit headwind, giving us that decline of mid-single digits in the first quarter. Now to be clear, our full year 2023 guide anticipates Q1 being the low point at low single digits for the bioprocessing non-COVID core growth. So whatever these order dynamics are revenue forecast for bioprocessing non-COVID in first quarter low single digits, we expect that to be the low point of the inventory work off or burn off and then move forward to what is high single-digit bioprocessing, non-COVID core growth for the full year. So coming back then, if you take our high single-digit bioprocessing non-COVID full year guide on the back of an approximately 30% comp from 2022, it's right in the mid-teens range, both on a two and a three-year basis. If you look at bioprocessing, ex-COVID growth, right, over the last four years, inclusive of our '23 guide, you have 7%, 8% type growth in 2020 as we are sort of moving into and away from the core bioprocessing doing more COVID work. But if you look at kind of high single digits to start in '20, high single digits as we get through the last of COVID in '23 with 20% and 25% growth in the middle in '21 and '22, that's sort of the period that we're looking back and over because I don't think you can look at just any one period or quarter, given everything Rainer said that happened in '21 and '22 with the extended lead times and what was happening with COVID. As it relates to our Diagnostics business, without COVID testing, we also expect high single-digit growth there, if you think about the growth in Leica Biosystems, Radiometer and as patient volumes normalize, supported also by solid growth at Beckman diagnostics, once again without COVID testing high single digits."
}