{
    "symbol": "SIDU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 10:46:03",
    "content": "  Operator: Good day, and welcome to the Sidus Space third quarter 2022 results and business update call. On this call, Teresa, and I, will cover our overall strategy, along with an overview of Q3 and year-to-date key business accomplishments and results, having had another quarter of strong revenue growth. With operations in Cape Canaveral and Merritt Island, Florida, and a 35,000 square foot manufacturing assembly, integration, and testing facility, we are a vertically integrated provider of space-as-a-service solutions, including end-to-end satellite support. We focus on mission-critical hardware manufacturing, multi-disciplinary engineering services, satellite design, manufacturer, launch planning, mission operations, and in-orbit support, on-orbit testing of space ecosystem technologies and hardware, and data and customer-driven analytics derived from satellite space-based data. As we look ahead at launching satellites, though, the makeup of our revenue mix is expected to shift to include more incremental revenue tied to payload and technology integration on our satellites and data and analytics subscriptions from a variety of end users. The space domain is simply massive on its way to over $1 trillion in opportunity, and more specifically, the small set manufacturing market is expected to grow 258% in the next decade, over $55 billion. However, in addition to our growing manufacturing and engineering lines of business, 2022 revenue today includes revenue related to our multi-mission constellation and our partially 3D printed LizzieSat satellite. Historically, our business has centered on the design and manufacturing of space hardware, but our expansion into spacecraft manufacturing, as well as on-orbit constellation management services, and space data applications, has resulted in multiple space-specific innovations. As described, Sidus Space is building a multi-mission satellite constellation, shown on Slide 7, using our hybrid 3D printed multi-purpose satellite to provide continuous near real-time earth observation and internet of things data for the global space economy. First, it's a multi-mission satellite that supports integration of custom technologies and multiple customer needs, leveraging space flight proven communications, power, navigation and computing subsystems, to provide both domestic and international customers with valuable data from low earth orbit. Moving to Slide 8, you can see that it's been a busy period making progress toward actualizing a cadence of launches and the associated revenue, but before we cover the recent highlights, it's important to note that we have spent the last year obtaining mission-specific licenses and developing necessary partnerships to execute a successful launch. While others are focused on data verticalization strategies specializing on a key sector or problem set, we believe that flexibility in production, low-cost bespoke design, and bringing space down to earth for consumers, will provide a scalable model for growth in all sectors. On the manufacturing side, during the quarter, we received over $1.9 million in new purchase orders for space and defense hardware and services, indicating sustained growth in this revenue stream. Looking at our results, as of the end of September, on Slide 11, you can see our third quarter sales at $1.3 million, increased 164%, up over $800,000 versus third quarter 2021. Gross margin will remain choppy when looking at it quarter-to-quarter, depending on the mix of revenue, but will smooth out when looked at over a longer period of time, as you will see in our year-to-date results on Slide 12. This increase is primarily to support the growth of our business through expansion of our staff and facilities, as well as increased insurance, investor relations, legal, and accounting fees that are associated with being a publicly traded company, and include a one-time banking advisory fee of $600,000. We ended the quarter with a net loss of approximately $3.9 million, as compared to a net loss of approximately $600,000 in Q3 2021, a function of increased operating expenses associated with being a public company, and our expanded sales and engineering operations. Revenue is currently driven largely by our space hardware manufacturing side of the business, as well as satellite-related revenue to a slightly lesser degree. They included a one-time non-cash related charge of $1.2 million in stock-based consulting fees for investor relations incurred in the first quarter, a one-time cash expense of $600,000 for banking advisory fees in the third quarter, as well as increased investment in infrastructure to support company growth, and incremental costs associated with being a public company, such as increased insurance, legal accounting, and industrial relations expense. The use of cash continues to support the growth and expansion of the business and revenue streams through increased general operating expenses, such as increased staffing to build out the management team, as well as personnel to support satellite development, and the expansion of our facilities to support the manufacture of our satellites. As we look ahead, we're excited about what lies ahead for Sidus and the space ecosystem as we continue to expand our hardware manufacturing relationships and take key steps towards serving more customers through our vertically integrated satellite production as we prepare to launch LizzieSat."
}