{
    "symbol": "ACTG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 11:47:17",
    "content": " As a result, we now have total assets of $562 million, of which $428.5 million are in cash and marketable securities. This strategy envisions building a diversified group of businesses, improving operations, and removing impediments in either growing these businesses or enabling them to generate consistent cash flow, all to create value for Acacia's shareholders. Our GAAP book value at December 31, 2022, was $269.3 million or $6.19 per basic share compared to $282.5 million or $7.33 per share at September 30, 2022 and $430.5 million or $8.80 per share as of December 31, 2021. Subsequent to the end of this year, we completed a rights offering, raising net proceeds of $79 million to Acacia. Inclusive of that offering, our book value is approximately $5.95 per share, and our capital base stood at 348.4 million, including $366.9 million in cash. Revenues for the fourth quarter of 2022 were $13.1 million, compared to $63.3 million a year ago. First, Printronix contributed $10.6 million in revenue in the quarter, compared to $12 million in the prior year quarter. Second, our intellectual property business generated $2.5 million in revenue related to patent assertion, compared to $51.3 million in the fourth quarter last year. General and administrative expenses were $15.9 million, compared to $12.7 million in the fourth quarter last year due to an increase business development and personnel expenses related to the company's transaction organization, cost for the Starboard recap, as well as nonrecurring severance costs. Operating loss was $14.5 million in the quarter, compared to operating income of $31.3 million a year ago. Realized and unrealized gains on securities totaled $13.4 million in the quarter, a reflection of the increase in share price of our security positions over the last three months. We realized $10.6 million in realized gains from the sales of securities during the quarter, primarily from the sales of the shares in our life sciences portfolio, which we continue to bring to realization. Also, we received a $27 million payment related to our share in Biomet in the quarter, bringing our total milestone income to date to $30 million. Our carrying value of Biomet is approximately $19 million, net of non-controlling interest. Once again, the net loss reflects several nonrecurring items, including; first, $10.9 million in realized gains and $2.5 million in unrealized gains related to the increase in share price of certain holdings, partially offset by the reversal of unrealized gains previously recorded for shares sold during the quarter for realized gains. Second, non-cash expense of $21.5 million related to the change in fair value of the Starboard warrants and embedded derivative liabilities, due to the increase in Acacia's stock price during the quarter, and the reduction in the exercise price of the Series B $5.25 warrant for the foregone time value of the Series B warrants and the preferred stock. Third, $9.2 million in charges related to severance, legal and other professional fees associated with the recapitalization. At the beginning of 2021, our NOL plus capital loss carryforwards stood at $286 million. As of December 31, 2022, our realized gain had reduced our NOLs to approximately $64 million for the full year. General and administrative expenses were $52.7 million compared to $35.7 million last year due to the inclusion of a full year of Printronix operating expenses, increased parent business development expenses and other one-time charges. GAAP net loss was $125.1 million, or $3.13 per diluted share compared to GAAP net income of $149.2 million, or $1.91 per diluted share last year. We also recognized non-cash income of $13.1 million related to the change in fair value of the Starboard warrants and embedded derivative liabilities, due to the decline in Acacia stock price during the year. Last year, Acacia recognized $202 million in realized and unrealized gains in the value of the life sciences portfolio, primarily related to the IPO of Oxford Nanopore in September 2021. Cash and equity securities at fair value totaled $349.4 million at December 31, 2022 compared to $670.7 million at December 31, 2021. During 2022, Acacia repaid $120 million in principal amount of senior secured notes held by Starboard and repurchased $51 million in Acacia shares. Equity securities without readily determinable fair value totaled $5.8 million at December 31, 2022, which amount was unchanged from December 31, 2021. Investment securities representing equity method investments net of non-controlling interests, totaled $19.9 million at December 31, 2022 and December 31, 2021. Total indebtedness, which represents the senior secured notes issued to Starboard, was $60.5 million at December 31, 2022. Our GAAP book value as discussed today, includes the impact of all warrant and embedded derivative liabilities on our balance sheet, which, in turn, reflects the impact of the increase in the company's share price over time, as these liabilities would be extinguished upon exercise or expiration of these warrants and convertible preferred stock. In summary, upon completion of the recapitalization transactions with Starboard, $9.3 million of cash was received, net of the early termination settlement for the exercise of the remaining Series A warrants and 5 million shares of common stock were issued. Starboard has purchased 15 million new shares in the recently completed rights offering, at $5.25 per share, for total proceeds of $78.8 million in the first quarter of 2023. $35 million in face value Series A preferred stock will be eliminated and 9.6 million shares of common stock would be issued in June of 2023, following Acacia's Annual Meeting of Stockholders. $60.5 million of liabilities attributable to the senior secured notes would be eliminated, and Starboard would invest an additional $55 million in cash related to the Series B warrant exercise, and 31.3 million shares of common stock would be issued by July 2023. Acacia would pay Starboard a total of $66 million as consideration for early exercise of the Series B warrants, and convertible preferred stock by July 2023. The expected impact of the completion of the recapitalization transaction from December 31, 2022, would be an incremental $246.4 million in book value, and an incremental $56.2 million of shares outstanding. Assuming such completion, pro forma book value would be $489.9 million and diluted shares outstanding would be $104.3 million, resulting in pro forma book value per share of $4.70 at December 31, 2022. As of December 31, 2022, our cash per share stood at $6.62. On a pro forma basis, assuming completion of all phases of the Starboard transaction, our cash per share would be approximately $3.54."
}