{
    "symbol": "ACTG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 14:20:30",
    "content": " Ultimately, this agreement will significantly streamline our capital structure with all in the money warrants exercised and all convertible preferred shares converted into common stock as well as see Starboard invest at least $78.8 million in new capital to acquire shares at $5.25 per share. Next, in the second quarter of 2023, Starboard is committed to convert its $35 million in face value of convertible preferred stock into common stock following approval of amendments to the company's Certificate of Designation and Certificate of Incorporation, expected to be put to a vote of shareholders at Acacia's 2023 Annual Meeting. Finally, in July 2023, upon the maturity of the remaining $60 million in senior secured notes outstanding, Starboard has committed to exercise its 31.5 million Series B warrants at $3.65 per share. In connection with all of these transactions, Acacia has agreed to make $75 million in payments to Starboard as compensation for its early exercise of each of these instruments; $9 million to be paid at the time of the Series A warrant exercise and the balance of $66 million to be paid at the time of the Series B warrant exercise in July 2023. Reflecting all of these transactions, Acacia's pro forma book value will be $520.1 million or $5.22 per share. The ultimate book value may vary upon additional shareholder participation in the rights offering, any incremental investment by Starboard beyond its 15 million minimum share commitment in the rights offering and of course, any changes in book value owing to earnings in our business and changes the value in our securities and private positions. If the full allotment of the rights offering were purchased, we would raise an additional $122 million of potential capital beyond Starboard's 15 million share minimum commitment. $91.5 million of warrant and embedded derivative liabilities would be eliminated, $67 million of cash would be added upon exercise of the Series A warrants sale of 15 million shares at $5.25 per share, net of the $75 million in early termination payments and also net of transaction costs. By July, we expect all of the warrants and derivatives to have been exercised and converted, by which time we will have a vastly simplified balance sheet with pro forma book value of $520 million, diluted shares outstanding of 99.6 million and resulting in a book value per share on a pro forma basis of $5.22. Thank you, ladies and gentlemen. And that transaction, while I know it's been -- it's been the primary focus of many of our conversations with you and with others interested in our company, it's important to recognize that transaction has already delivered $155 million more in capital than we put up for it, and we still have holdings at book value. And if the answer is, yes, it's important, don't you have to make some sort of acquisition to attract attention to the market, to the company and, hence, realize a higher stock price so that shareholders other than Starboard, who's committed to investing the 15 million at $5.25 will be incentivized to exercise their rights? Thank you, ladies and gentlemen."
}