{
    "symbol": "BERY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-15 16:14:01",
    "content": " And finally on today's call, we will review our fiscal year 2023 goals and commitments, which include a continued focus on organic growth inflation recovery and reducing our costs along with the opportunity to deliver strong returns on cash to shareholders through further share repurchases taking advantages of our significantly undervalued share price. We are expecting to generate between $7.30 to $7.80 of adjusted earnings per share, which at the midpoint would be another fiscal year record and our 10th consecutive year of delivering EPS growth which I'm proud to report that we have done every single year as a public company. As you can see on slide 14, we have consistently driven top-tier results in nearly all key financial metrics, including strong compounded annual growth rates for revenue, earnings and free cash flow, including growing our adjusted earnings per share every year as a publicly traded company. Your line is now open. Your line is now open. The first dividend in our 10 years as a publicly traded company really driven by the confidence that we have in our operating model and the resiliency of the portfolio and its ability to consistently deliver strong operating income and cash flow from operations, and that's given us the confidence coupled with feedback from our investors, which there's been a percentage of our customers that have been interested in the initiation of a dividend. Your line is now open. And considering that Berry is coming off of a record 2021 and on a two-year stack basis to be plus 2% given that environment, I think the model is proving itself out not to mention the resiliency of a portfolio that's 70% tied to very steady resilient businesses that people buy regardless of the economic environment that they're facing. Your line is now open. And as we said, about -- I'm going to call it about 1/4 of the improvement we're expecting in earnings next year to come from improved price cost with our customers, with the remaining coming from cost reduction efforts the company is initiating, which would include moving -- getting more efficient on material usage which could involve changing suppliers, for example. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}