{
    "symbol": "BERY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-03 18:35:28",
    "content": " From an earnings perspective, operating EBITDA was up 2% for the prior-year quarter on a comparable basis in line with our expectations, including a favorable price cost recovery of $41 million, when excluding the prior year COVID mixed benefit. Our Consumer Packaging North America division delivered a 9% increase in revenue over the prior year, which included higher selling prices from the pass through inflation and flat volumes in the quarter coming off a very strong 6% organic volume growth delivered in the prior year. The strategic choices we made, guide how we prioritize our investments in our business which is why we're investing in several markets and product categories that we expect to drive long-term organic growth, including a few of those, which we've highlighted on this slide. As you can see these recent strategic investments, expect to contribute over $300 million in revenue over the next two years and are not only in faster-growing end markets, but are largely focused in regions such as China and India, with growth rates, expected to be in the mid to high single digits. Why are you holding working capital strategically to the tune of $150 million going into next year, when raw material prices now look like they're coming down, is that just a reflection your customers see their demand now backing up and we have an inventory issue in the pipeline. I mean we've got a lot of great capital projects but that have been implemented and continue to be implemented to drive down cost to drive profit improvement, but you know it's a little bit of a moving target, but I would say all four of our segments, that made good progress, we expect that price cost relationship to improve again here in Q4. We announced and showcased in the earnings release an expansion of our post-consumer recycle capability that will be commissioning in fiscal '23, to complement what we already have to support incremental organic growth based on the value that total portfolio between both access to virgin materials that can be responsibly design and managed in addition to how we can incorporate both mechanical recycling, advanced recycling, and bio-based materials into that portfolio with the global customer base that we serve all supported by plants that are in close proximity to those end users."
}