{
    "symbol": "EXEL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 21:02:12",
    "content": " We refer you to the documents we file from time to time with the SEC, which under the heading Risk Factors, identify important factors that could cause actual results to differ materially from those expressed by the company verbally and in writing today, including, without limitation, risks and uncertainties related to product commercial success, market competition, regulatory review and approval processes, conducting clinical trials, compliance with applicable regulatory requirements, our dependence on collaboration partners and the level of cost associated with discovery, product development, business development and commercialization activities. Importantly, global cabozantinib franchise net product revenues generated by Exelixis and its partners were almost $500 million in Q2 2022; second, our emerging bicoastal development team is focused on advancing the Exelixis development pipeline to potential new cabo indications and our growing pipeline of clinical compounds, including XL092, XB002, XL102 and XL114. As we enter the second half of 2022, we're excited about the potential for the multiple growth drivers ahead of us, as we continue to move the business forward and most importantly, enable Exelixis to help many more cancer patients. And I think we're really well positioned going forward to continue to take share as well as continuing to get that growth, as I mentioned in my prepared remarks, from just the duration of therapy for those patients, which were in the trial, the PFS is in the ballpark of 1.5 years. So as I mentioned in my prepared remarks, combining with a variety of different IO agents, both checkpoint inhibitors, including PD-1 as well as potentially novel agents, really gives us a broad number of possibilities, and we are leveraging the cabozantinib data that we've seen, given the similar kinase profile to really consider where to go next with the perfect example of that is the CRC program where you saw the data at ASCO-GI earlier this year from both COSMIC-021 as well as from an IST that really provided the background data and confidence to move forward in that tumor type."
}