{
    "symbol": "PSN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 13:18:05",
    "content": " During the quarter, we achieved year-over-year double-digit organic revenue growth in both business segments and grew adjusted EBITDA by 22% and contract awards by 21%. Adjusted EBITDA of $103 million increased 22% from the third quarter of 2021, and adjusted EBITDA margin increased 30 basis points to 9.1%. I'll turn now to our operating segments starting first with Federal Solutions where third quarter revenue increased by $121 million, or 24% from the third quarter of 2021. Federal Solutions adjusted EBITDA increased $15 million, or 31% from the third quarter of 2021 and adjusted EBITDA margin increased 60 basis points to 9.9%. Third quarter revenue increased by $57 million, or 13% from the third quarter of 2021 all of which was organic. Critical Infrastructure adjusted EBITDA increased by $4 million, or 10% from the third quarter of 2021 and adjusted EBITDA margin decreased to 8.1%. We are increasing our 2022 revenue, adjusted EBITDA and cash flow guidance to reflect our strong third quarter results and our outlook for the remainder of the year. We achieved year-over-year double-digit organic revenue growth in both business segments and grew adjusted EBITDA, contract awards and operating cash flow by more than 20% each. You may now go ahead. You may now go ahead. So from a federal perspective as we've indicated in the past, we don't expect 10% continuously every single quarter because it really depends on the timing of award and incentive fees given that we're about two-thirds cost reimbursable business in federal. You may now go ahead. You may now go ahead. With respect to the Federal contracting environment, we've heard from some others that there may have been an opportunity for spending from last year's budget with some of the two-year money to flow into December -- the December quarter contracting. And in the meantime, what we're going to continue to do is, what we've been doing very well all year is driving work to our single-award contracts that is we have over $6 billion of ceiling that is unused that we haven't booked yet. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead."
}