{
    "symbol": "OTLY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 14:33:06",
    "content": " In the third quarter, we saw year-over-year sales volume growth of 16% across all regions and continue to see strong category leading velocities, the global demand remains resilient. Now moving to our business performance, on slide 10, third quarter revenue was $183 million, a 7% increase compared to $171.1 million in the prior year period. Americas third quarter revenue increased 22.7% year-over-year to $60.7 million, which was below our expectations. Revenue for the third quarter of 2022 was $183 million, an increase of $11.9 million, or 7% compared to revenue of $171.1 million in third quarter of 2021. Excluding a significant foreign currency exchange headwind of $16.6 million, revenue for the third quarter would have been $199.7 million, or an increase of 16.7% in constant currency compared to the prior year period. Moving to slide 19, sold volume for the third quarter of 2022 amounted to 126 million liters compared to 110 million liters last year, an increase of 14.5%. Consolidated net sales per liter was $1.45 in the third quarter of 2022, compared to $1.55 in the third quarter of 2021, mainly driven by foreign exchange and promotional activities in Asia, offset by the pricing actions in Americas and EMEA. Gross profit in the third quarter was $5 million, or 2.7% gross margin, compared to $44.9 million 26.2% margin in the prior year period, well below our expectation. Net cash used in operating activities increased by $66.6 million to $215.2 million for the nine months ended September 30, 2022, to compare to $148.6 million during the prior year period, driven by our higher loss from operations. Turning to the guidance on slide 22, for fiscal year 2022, we are updating our revenue outlook and now expect revenue of $755 million to $775 million based on 2021 exchange rates or constant currency, an increase of 17% to 20% compared to fiscal year â\u0080\u009821. Our previous guidance implied accelerated revenue growth in Q3 and Q4 primarily coming from the Americas and Asia, given the lower-than-expected revenue in Q3, and our current outlook for Q4, we have reduced our forecasts, $53 million to $58 million of the reduction is driven by operational challenges in Americas, which limits our ability to accelerate sales momentum, and $32 million to $37 million is driven by COVID-19 pressures, negatively impacting sales in Asia. Moving to slide 23, we continue to expect capital expenditures to be in the range of $220 million to $240 million for fiscal 2022 given the phasing of certain projects, we continue to expect run rate production capacity to be approximately 900 million liters of finished goods by the end of fiscal 2022."
}