{
    "symbol": "OTLY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 14:55:06",
    "content": " In the second quarter, we delivered strong revenue growth of 22% year-over-year to $178 million or approximately 30% growth to $190 million in constant currency. Despite this adversity and the impact, it has on our future channel, the team managed to achieve record revenue of $44 million in the second quarter, over 70% year-over-year growth in constant currency and the 52% increase compared to the first quarter. As we look towards our future capacity expansion, I'm happy to share we have adjusted our capacity phasing plan that will reduce our 2022 CapEx guidance from the lower end of the $400 million to $500 million range to $220 million and $240 million without compromising our growth. Turning to the financials, revenue for the second quarter of 2022 was $178 million, an increase of $31.8 million or 21.8% compared to revenue of $146.2 million in the second quarter of 2021. Excluding a significant foreign currency exchange headwind of $11.7 million, revenue for the second quarter would have been $189.6 million or an increase of 29.7% in constant currency compared to the prior year period. The foodservice channel accounted for 35% of revenue for the second quarter of 2022, compared to 33.2% in the same period last year. Consolidated net sales per liter was $1.47 in the second quarter of 2022, compared to $1.54 in the second quarter of 2021, mainly driven by a foreign exchange headwind in EMEA and customer and channel mix effects. As we stated on our last earnings call, we expected operating expenses as a share of net revenue to improve â\u0080\u0093 in the second quarter, total operating expenses as a percent of revenue improved to 57.6%, compared to 65% in the first quarter of 2022. As I stated a few moments ago, compared to the second quarter of 2022, we expect gross margin improvement and operating expenses as a share of net revenue to improve sequentially in the second half of this year. As Toni mentioned, for fiscal year 2022, we are updating our outlook and now expect revenue of $835 million to $865 million based on constant currency, an increase of 30% to 34% compared to fiscal year 2021 at the midpoint. At the prevailing FX rates, this implies a revenue guidance range of $800 million to $830 million, an increase of 24% to 29%, compared to fiscal year 2021."
}