{
    "symbol": "RDI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 15:02:01",
    "content": " Our third quarter 2022 global revenues were $51.2 million, representing a 61% increase versus Q3 2021 and a 27% reduction from the pre-pandemic Q3 2019 quarter, or 73% of Q3 2019 global revenues. With respect to Q3 2022, we're pleased to report that at $48.4 million, our global cinema total revenues increased by 68% versus Q3 '21 and represented 73% of Q3 2019. Turning to some specifics about the U.S., at $24.7 million, our Q3 2022, total cinema revenues increased by 45% compared to Q3 2021, and represented 66% of Q3 2019. Our cinema segment operating loss increased by 22% to a loss of $4 million from a loss of $3.3 million in Q3 2021, which is reflective of higher film costs due to the blockbusters that played through the quarter, increased occupancy costs as compared to 2021 when certain occupancy costs were abated, and increased labor and operating costs, some of which were deferred and/or abated in '21. At $20 million or Q3 2022 cinema revenues increased by 114% compared to Q3 2021, and represented 82% of the third quarter 2019 cinema revenue. Our third quarter 2022 cinema segment, operating income increased to $1.6 million, compared to a loss of $1.7 million in the third quarter of '21. And wrapping up with New Zealand, with respect to the third quarter of this year, our cinema revenues increased by 51% to $3.7 million compared to the third quarter in '21 and represents 64% of the third quarter 2019 cinema revenue. At $4.1 million, our third quarter 2022 total global real estate revenue increased 28% over the third quarter of last year. And real estate segment operating income increased by over 100% to $1.4 million compared to the third quarter in '21 In New Zealand real estate revenue increased by 70% to $400,000, compared to the third quarter of '21, and our operating loss shrank by 34% to a loss of $300,000 compared to the third quarter of '21. Consolidated revenues for the third quarter of 2022 increased by 61% to $51.2 million, when compared to the same period of prior year, which is 73% of comparable 2019 pre-pandemic revenue for the same quarter. Consolidated revenues for the nine months ended September 30, 2022 increased by 75% to $155.9 million when compared to the same period last year, which is 75% of comparable 2019 pre-pandemic revenue for the same nine months period. Net loss attributable to our company for the quarter, ended September 30, 2022 improve by $4.9 million, a loss of $5.2 million when compared to the same period in 2021. Net income attributable to Reading International, Inc., for the nine months ended September 30, 2022 decreased by $54.5 million from an income of $31.6 million to a loss of $23 million when compared to the same period in 2021. For the third quarter of 2022, income tax expense increased by $1.2 million to $0.3  million compared to the COVID impaired prior year period, primarily related to an increase in valuation allowance and partially offset by a decrease in GILTI tax in 2022. Turning now to our cash flow, for the nine months ended September 30, 2022, net cash used in operating activities increased by $8.4 million to $26.1 million when compared to the same period in 2021."
}