{
    "symbol": "ADBE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-16 20:55:07",
    "content": " Built natively on Adobe Experience platform, our real time customer data platform, real time CDP provides businesses with a single view of their customers data across every channel, allowing them to create precise segments and deliver personalized experiences, regardless of when and where a customer interacts with their brand. On the top line, we grew revenue by 14% year-over-year, or 15% in constant currency, while making long term growth investments, we delivered operating margins of 35% on a GAAP basis and 45% on a non-GAAP basis continuing to be one of the most predictable and profitable growth companies in technology  We have three strategic businesses growing into massive addressable markets, with differentiated products used by hundreds of millions of individuals every month. Success with Workfront where average deal sizes grew greater than 35% year-over-year, continued customer demand and content and commerce with significant new customer acquisition and Adobe Experience Manager as a cloud service. Digital Experience subscription revenue growth of approximately 13% year-over-year, or 15% in constant currency; tax rate of approximately 22.5% on a GAAP basis, and 18.5% on a non-GAAP basis, and GAAP earnings per share of approximately $2.35 and non-GAAP earnings per share of approximately $3.33. So I want to just make sure people recognize that the core products are playing to this incredibly large market, where we see Express filling in is that Express is additive and broadens the region, that new communicator base, because of exactly what you're saying the freemium business model, there's zero friction onboarding, it's clearly showing that we're able to attract millions of new users into the franchise. If you look at some of the new initiatives, and we've touched on that, whether it's Adobe Express, whether it's the real time CDP customer journey analytics, what we're doing with things on the web, including PDF, we feel really good."
}