{
    "symbol": "SHIP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 14:21:08",
    "content": " With regards to our financial performance, for the full year period, net revenue reached $125 million, adjusted EBITDA was $65.6 million, while net income amounted to $17.2 million. Since the fourth quarter of 2021, we delivered approximately $58.4 million of value to our shareholders in the form of dividends, share buybacks and the repurchase of convertible securities. Turning to slide two for a more detailed breakdown of shareholder returns, approximately $18.5 million in regular dividends and $4.5 million in extraordinary dividends have been declared since the fourth quarter of 2021. For the first quarter of 2023, we expect to earn daily time charter equivalent rate of $10,200, which may sound very low, but it's a premium of more than 40% over the average BCI year-to-date. For the 12-month period, net revenue was $125 million with our average daily time charter equivalent rate standing at $20,040 compared to net revenue of $153 million, and an average daily time charter equivalent rate of $27,400 last year. Concerning our balance sheet, our cash at the end of the fourth quarter remained robust and stood at $32.5 million, in a year with approximately $28 million in dividend distributions and buybacks. The senior debt outstanding at the end of 2022 was $249 million, which translates to $13.8 million per vessel, secured against an average market value per vessel of about $25.4 million in a year that we accomplished the partial renewal of our fleet, we managed to retain our corporate leverage at modest levels at around 53%, despite the market values correcting by approximately 25% during the second half of the year. Our efforts to improve the overall terms of our facilities continued this year with total financing and refinancing of $124.8 million, with the average margin of our facilities dropping further to 2.9% as of December 31, 2022 versus 3.2% the year before. The facility has a term of four years, while the interest rate is 2.9% plus SOFR and will amortize through four quarterly installments of $0.5 million, followed by 12 quarterly installments of $400,000 and a $9.6 million balloon payment at maturity."
}