{
    "symbol": "SHIP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-31 15:22:07",
    "content": " Despite the seasonal slack in the Capesize market, our fleet achieved a daily time charter equivalent of $19,400 a day, which is 19% higher compared to Q1 2021 and 31% higher than the average of the daily Baltic Capesize Index in the same period, which was equal to about $14,700. As mentioned by Stamatis earlier, our daily time charter equivalent for the quarter was $19,400, increased by 19%, when compared to $16,200 for the first quarter of 2021. Adjusted EBITDA in the first quarter was approximately $16.8 million, up from $7.9 million in the same quarter of 2021 and net income for the quarter was $3.7 million, compared to a net loss of $1.3 million in the same quarter last year. At the current FFA curve for the remainder of the year, I would expect to see full year 2022 EBITDA of about $100 million, an improvement of 28% compared to 2021. Focusing on the cash interest expense, in the first quarter of the year, the company incurred approximately $2.2 million of cash interest and finance costs. Bringing to the picture the increase of our fleet, the interest expense per operating day in the first quarter of 2022 declined to approximately $1,500 from $2,000 last year and $2,900 in the first quarter of 2021. The total debt outstanding, including convertible notes was approximately $226 million as of the end of the first quarter on a fleet of 17 vessels with a total scrap value of approximately $275 million. Overall, total debt outstanding per vessel was about $13.3 million as of the end of the first quarter of 2022, compared to $15.7 million at the end of the first quarter of 2021. Furthermore, Seanergy has cash and cash equivalents of approximately $39 million at the end of the first quarter, compared to about $47 million in the previous quarter. Total book value of shareholders’ equity as declined marginally to $231 million, compared to $244 million at the end of the fourth quarter of last year, with a decrease being mainly attributed to the adoption of a new accounting treatment on the company’s remaining convertible note. Moving on to our recent financing transactions, we have now completed the strategic $21.3 million refinancing of a previous loan facility that was originally due in the fourth quarter of the year secured by the partnership."
}