{
    "symbol": "SHIP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 02:00:02",
    "content": " During the second quarter, we recorded net revenue of $32.8 million and adjusted EBITDA of $17.3 million up 18% and 53% respectively, compared to the second quarter of 2021. On the financing front, during the first 6 months of the year, we completed new financings and refinancings of $80.3 million, out of which $59 million were concluded in the second quarter of the year. Our operating performance during the second quarter was robust for yet another period, given the prevailing freight market with an average TCE reaching $23,300 per day. As an indication, if the BCI average in the second half of the year is at the current FFA rates, we expect full year EBITDA to reach approximately $76 million. Net vessel revenue for the quarter was equal to $32.8 million, marking an increase of 18% from the second quarter of 2021, while the increase in the 6-month period stands at 30%. Our chartering and freight hedging strategy was effective once again as our 6-month time charter equivalent exceeded the average Baltic Capesize Index by 17% with this outperformance expected to sustain based on the floating to fixed conversions for 3 of our vessels during the third quarter at an average gross daily rate of $36,000. The 6-month adjusted EBITDA stood at $34.1 million with a year-over-year percentage increase reaching 77% over a 16% increase in a time charter equivalent, demonstrating once again our companyâ\u0080\u0099s operating leverage. As it concerns to the market value of our vessels, we posted another rise as of June 30, 2022, reaching approximately $584 million, which led to a corporate leverage of approximately 42%, considerably improved year-over-year. For example, in case of Time Charter Equivalent is averaged at current 2022 FFA levels, our EBITDA is expected to reach $76 million, while it can even surpass $100 million in case that our Time Charter Equivalent reaches last yearâ\u0080\u0099s average over this year."
}