{
    "symbol": "NTIC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-07 12:10:06",
    "content": " For the second quarter ended February 28, 2022, our total consolidated net sales increased 31% to a second quarter record of $16.7 million as compared to the second quarter ended February 28, 2021. Total Net sales for the fiscal 2022 second quarter by our joint ventures, which we do not consolidate in our financial statements, were $24.6 million. This is a decrease of 15.3% when compared to the same period last fiscal year, and was due primarily to reduced demand across our global joint ventures and the change in the accounting treatment for ZERUST India, which is now a consolidated subsidiary within NTIC's financial statements. Therefore we expect oil and gas sales will be significantly higher in the second half of this fiscal year compared to the first half, which we anticipated -- which we anticipate will lead to higher full year oil and gas sales compared to the last fiscal year. Fiscal 2022 second quarter Natur-Tec sales were $3.6 million, a 45.3% increase over the prior fiscal year period. Compared to prior fiscal year period, NTIC's consolidated net sales increased 31% in the fiscal 2022 second quarter to a second quarter record. The 14.4% increase over the prior fiscal year period was due primarily to incremental expenses due to ZERUST India acquisition and increased selling expenses associated with the higher consolidated sales, as well as higher wages, travel expenses and R&D investments. As illustrated in our second quarter results, the ZERUST India transaction increased our net sales and operating expenses, since it is now consolidated with our financial results, and decreased our equity and income from joint ventures in each case, as compared to the same period last fiscal year. Gross profit as a percentage of net sales was 29.8% during the three months ended February 28, 2022, compared to 33.3% during the same period last fiscal year, primarily as a result of the increased prices and raw materials and increased labor costs. NTIC reported net income of $183,000, or $0.02 per diluted share the fiscal 2022 second quarter compared to $1.3 million or $0.13 per diluted share for the fiscal 2021 second quarter. For the fiscal 2022 second quarter NTIC's non-GAAP net income adjusted for expenses related to the NTIC India transaction and amortization expenses was $392,000 or $0.04 per diluted share, compared to $1.3 million or $0.13 per diluted share for the fiscal 2021 second quarter."
}