{
    "symbol": "NTIC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-07 11:48:08",
    "content": " If we exclude that the ZERUST India contributions in order to ease comparison between fiscal 2021 and fiscal 2022 third quarter, total net sales increased 6.3%. In addition, total operating expenses as a percent of third quarter sales were 37.5% compared to 40.1% in this yearâ\u0080\u0099s second quarter and 40.9% for the prior year fiscal period. For the third quarter ended May 31, 2022, our total consolidated net sales increased 23% to a quarterly record of nearly $19 million as compared to the third quarter ended May 31, 2021. Total net sales for the fiscal 2022 third quarter by our joint ventures, which we do not consolidate in our financial statements, decreased 16.8% to $26.6 million. Now, moving on to ZERUST Oil & Gas, as expected, sales from this product category accelerated during the third quarter, increasing 47% over the prior fiscal year period, driven by higher sales to new and existing customers. Turning to our Natur-Tec bioplastics business, fiscal 2022 third quarter Natur-Tec sales were $4.5 million, a 48.6% increase over the prior fiscal year period. Compared to the prior fiscal year period, NTICâ\u0080\u0099s consolidated net sales increased 23% for the fiscal 2022 third quarter to a quarterly record of nearly $19 million. As illustrated in our third quarter results, ZERUST India transaction increased our net sales and operating expenses since its now consolidated with our fiscal â\u0080\u0093 with our financial results and decreased our equity and income from joint ventures in each case as compared to the prior fiscal year period. Gross profit as a percentage of net sales was 32.9% during the 3 months ended May 31, 2022, compared to 34.2% during the prior fiscal period, primarily as a result of price increases on raw materials and increased labor costs. For the fiscal 2022 third quarter, NTICâ\u0080\u0099s non-GAAP net income adjusted for expenses related to the NTIC India transaction and amortization expenses was $1.1 million or $0.12 per diluted share compared to $2.1 million or $0.21 per share for the fiscal 2021 third quarter."
}