{
    "symbol": "PHR",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-08 20:37:03",
    "content": " Your line is now open. You -- maybe just my next question is, you've seen a couple of quarters here now that because you're growing your new logos at such a rapid pace that your revenue per client has just lagged a little bit. So I think, I don't know if I'd call the trend, but I think it's going to stay in the range that it has been in the past couple of quarters and we're excited about some of the new larger wins and expansions that we've sold recently. Well, and frankly, Anne, we're just doing really well, like the teams been rocking it out, like, I -- like it's been all across the board, big, small expand. Like, we're just really -- I can't thank everyone enough at Phreesia for this past quarter, it's just -- and the work they're doing. Your line is now open. I'd say the most important client that they had that we've been able -- we've definitely been leveraging and working closely with is PMS, right, with -- and we were working -- we're going -- this KCC program has been rolling out very successfully, and we really appreciate that the impact it's having on kidney patients and we're really proud to be part of that work. Your line is now open. Your line is now open. Your line is now open. Your line is now open. I think it's -- the company is really just doing really -- like, as a team, we're doing really well. Your line is now open. Your line is now open. And that -- as we continue to execute, the, like, size of relief we often get -- and I think the thing that's been very nice as we've gone through it is the support we've gotten from the investor community, and I really do appreciate that and from all of you on this call. Your line is now open. It's winning opportunities, making phone calls, the SCRs, creating the demand of our pipe (ph), but also being able to then -- make sure that we could demonstrate that value and keep that client alive and work cohesively -- and a lot of that also, frankly, depends on our product organization, building great products, which we do. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}