{
    "symbol": "PHR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-02 21:09:05",
    "content": " Your line is now open. Yes, I think from the perspective of maybe talked about this in the past, where, you know, we're doing a big land and expand as we get additional clients often they come in, and, you know, the first dollar revenue comes in and we expand into other areas. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And you know, I think, the other thing, Joe, is you could look at where we were when we went public three years ago on subscription revenue per client and look at where we are at this quarter, it's grown meaningfully, it’s just sort of got that step function aspect to it. Your line is now open. Your line is now open. But you know, whether it's, you know, changing nature of the healthcare ecosystem, whether it's demand changes, you know, the reason I think we're doing well is because we got a great product and we get it in front of prospects in a very thoughtful and efficient way, and we do it with an amazing group of people. I think also from, you know, a multi-year perspective, it's like we haven't invested -- we're a remote organization. I think, you know, it depends on client mix and if they take our payments or not, you know, of course, some of the larger health systems may have treasury functions where, you know, we're unlikely to win that business, but we try with every new client to win that business, and it's been fairly stable. Your line is now open. And, you know, we -- what we found is having data has been very, very powerful in being able to best represent the needs of their organizations and how we fit in that, and it's worked really, really well for us over the last 17-years and we continue to invest in that and we hope this is a lens into how we think about our product roadmap and our investments long-term. And I would say that I'm, you know, and I don't want to speak for all of our clients, I don't think there is a rush to return back to paper and pamphlets and you know, I think everyone's questioning how many more ads you could put on, you know, network TV. Because most people aren't just streaming, so I do think we've seen I think we've seen a real change in behavior and now that, you know, we've gotten a lot of these clients using us at scale, we're starting to see the net effects of them seeing their results, and it's been very promising. Your line is now open. Your line is now open. So, yes, we’re seeing that flat throughout and I always still think, like, you know, we're generally known for intake, you know, because that's what we've been doing for so long. Your line is now open. And I think what we continuously find is that people are so busy, you know, trying to take care of their patients and run their ERs and, you know, they're stat like that -- we're -- they're not necessarily looking for solutions. No, so it's mostly just travel and, you know, and travel to see each other, because I think that is important, you know, you don't it is as much as we can, we try to make sure that we get together in person where it's, like cost effective and reasonable."
}