{
    "symbol": "PEI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 16:45:26",
    "content": " Good morning, and thank you all for joining us for PREIT's First Quarter 2022 Earnings Call. As we move to closing, on our first phase of multifamily land sales, we will be bringing Phase 2 to the market and expect to be able to execute on this more expeditiously, considering our hard foot entitlements and tenant approvals. As we execute on our capital plan, we also are pleased with our continued operating strength driven by our exceptional capabilities that are driving consumer and tenant demand for our properties. We continue to unlock value in our portfolio through the introduction of tenants and experiences that improve quality, drive NOI as well as strengthen our balance sheet and reduce our debt. We continue to be confident that we'll be in a position to exercise our credit facility extension later this year, extend our mortgage maturities and have the fashion district remargin payment resolved. We are keenly focused on extending near-term maturities, including exercising the one-year extension of our credit facility. We're currently reviewing our options for our three upcoming maturities, Cumberland Mall, Woodland Mall and Cherry Hill Mall. Our goal continues to be to improve the portfolio, taking advantage of robust sales and outsized demand for space, while reducing debt, so that we can realize appropriate value and refinance the facility at expiration while investigating our strategic options. From a capital raising standpoint, last quarter, we noted over $120 million in transactions we expect to close before the middle of the year. At this point, we have another $166 million of asset sales underway. The key point is that there is great interest in our assets, and we have and are now in various phases of negotiation for $275 million in asset sales. As it relates to land sales for hotels, we have an executed LOI for Moorestown Mall and an LOI for Springfield Town Center. And we expect to utilize the capital to reduce outstanding debt, increasing our liquidity and reducing interest expense, resulting in improved earnings. Sales per square foot have grown by 32% over five years, an indicator of the quality we've cultivated. The improving environment and our operating prowess have resulted in sequential growth in renewal spreads at 3.7% for the quarter, an indicator of improved pricing power driven by our quality portfolio. And currently, we have over 400,000 square feet of new leases executed for future occupancy, which will deliver over $6 million in annual revenue. Through April, traffic is up 10% year-to-date compared to 2021, and we are ahead of 2019 driven larger by our continual merchandising refresh. Specifically at Woodland Mall, traffic was up an impressive 41% over 2021 for the weekend after the Phoenix  data opened. Through March, core mall sales were $613 per square foot. Cherry Hill Mall sales continue to lead the way at nearly $1,000 per foot. Three of our other key assets, Mall at Prince George’s, Springfield Town Center and Woodland Mall have showed the largest sequential growth from Q4 2021. These results were driven organically, a result of 2021's robust leasing activity and continued consumer strength. We continue to see strong fundamentals in sales, occupancy and leasing volume growth, leading to NOI and FFO improvement relative to last year. When including capacity under the revolver, total liquidity was $110.5 million as of the end of the first quarter. Same-store NOI increased 18% during the quarter, compared to the same period of last year. The current balance of $37.2 million is approximately 10% less than our pre-COVID historical AR balance of $41.3 million, which was as of December 31 of 2019. Add to that, we have had no bankruptcies during the quarter as tenant performance and financial strength continue to improve. We ended the quarter with comparable tenant sales of $613 per square foot, which is a $10 increase per square foot over sales at the end of 2021. This morning, we reported first quarter 2022 NAREIT FFO of negative $1.2 million, or negative $0.01 per share and FFO as adjusted of negative $4.8 million, or negative $0.06 per share. To provide a relevant data point, a pro forma 50% reduction to normalize the above-market portion of our interest expenses would result in a $0.09 per share improvement in quarterly FFO. For the quarter, results were primarily impacted by a strong leasing and sales environment, resulting in increased rent, percentage rent, percentage sales and common area revenue, which totaled $3.5 million and a decrease in credit losses for challenged tenants of $2.1 million, compared to the three months ended March 31, 2020. Lease termination revenues have increased by approximately $800,000 over the first quarter of last year. Also in the quarter, G&A expenses decreased by $300,000, driven by a reduction in people costs. We ended the first quarter with total occupancy at our core malls of 92.7%, an increase of 500 basis points from the first quarter of 2021. This improvement includes many large format tenant openings, Tilted Magnolia Mall that replaced JCPenney, Power Warehouse at Cumberland Mall that replaced Burlington, Turn 7 at Moorestown that replaced Lord & Taylor. Looking ahead to the balance of 2022, we are up against strong comps from last year where we recovered significant revenue from deferred rents, but do expect to continue to drive organic revenue growth as a result of incremental leasing activity and improving renewal spreads. To reiterate what we have said previously, we fully expect to achieve the credit facility extension later this year. The second question is, are you still on track to sell over $120 million in land and operating parcels by the middle of this year. As we mentioned in our remarks, we now have transactions underway for $275 million in asset sales as the quality of our portfolio continues to surface interest. When including capacity under the revolver, total liquidity was $10.5 million as of the end of the first quarter. We have a healthy and growing pipeline of signed leases currently with over 400,000 square feet of new leases and a strong pipeline. Our operating performance continues to be a bright spot, and we are confident that our efforts on our capital plan will allow us to secure our credit facility extension and extend our outstanding maturities, and we look forward to presenting to you a longer-term strategic plan this summer."
}