{
    "symbol": "PEI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 15:42:03",
    "content": " At this time, I would like to welcome everyone to the PREIT Second Quarter 2022 Earnings Call. Having just celebrated 10 years as CEO, as I now reflect on how much our team has accomplished through numerous market fluctuations, weâ\u0080\u0099re now executing on our plan to reduce debt and increase common and preferred equity valuations. This is being accomplished through a strategic focus on operational performance, asset sales, mortgage refinancings, exercising our credit facility extension and addressing the upcoming Fashion District remargin payment. Itâ\u0080\u0099s noteworthy that tenant sales are growing, traffic is ahead of last year and 2019, and leasing activity remains robust, with occupancy improving by nearly 5%, all of which improves the value of our properties. Weâ\u0080\u0099ve executed 346,000 square feet of new leases so far this year. We are evolving our tenant mix, driving traffic yielding increase tenant sales, which provides the ability to drive rents. Weâ\u0080\u0099ve been able to leverage this position to attract expanding retailers to open their own locations in Harrisburg, including Rose & Remington, Lovisa and BoxLaunch. At Willow Grove Park we have over 55,000 square feet of new stores opening, including new to portfolio and new to region tenant BoxLaunch, Rose & Remington and JD Sports. As compared to June 30th of last year, weâ\u0080\u0099ve increased our non actor occupancy by 620 basis points to 94.6% and we will further evolve this asset with the opening of Tilted 10 bringing a family entertainment center featuring laser tag, bowling, mini-golf, virtual reality, pinball and over 200 games and attraction to the property, which will extend dwell time. At Springfield Town Center, weâ\u0080\u0099re underway with LEGO Discovery Center expected to open next year, the first of its new prototype in the United States, another step in transforming this property into a vibrant multi-use hub, creating the preeminent family entertainment destination in the DC market. Moorestown Mall is another great example of reshaping our traditional mall assets, creating value for stakeholders. In addition to a dining and entertainment lineup and fitness offerings, weâ\u0080\u0099ve transformed Macyâ\u0080\u0099s into a value retail hub, including HomeSense, Sierra, Five Below and Michaels. Now Cooper University Healthcare is under construction with its outpatient facility, which is expected to open its initial phase in the second half of 2023. In the past decade, weâ\u0080\u0099ve increased the space dedicated to off price and fast fashion by 250%, providing more cost efficient options for our customers during periods of rising costs. As we look ahead, weâ\u0080\u0099re turning our attention to options to refinance our credit facility at the end of 2023. Toward that end, we continue to raise capital through asset sales, which is a top priority. Since our last call we executed on the sale of our interest in Gloucester Premium Outlets, multifamily land at Morristown and several outparcels. As of June 30, 2022, weâ\u0080\u0099re going to compliance with the liquidity and corporate debt yield requirements underlying the extension are in process of conducting the required appraisals. As we move to securing entitlements and closing on our first phase of multifamily mainsails, we are bringing Phase 2 to market and expect to be able to execute on this more expeditiously considering our hard foot entitlements and tenant approvals. Traffic is strong heading into the back-to-school season of nearly 3% over last year, renewal spreads are positive and we have approximately $6 million of revenue yet to commence. With occupancy stabilizing and strong sales, we believe we can further drive rents enhancing portfolio value. We continued to see strong fundamentals in the second quarter, while at the same time monitoring the evolving landscape. Liquidity is tracking ahead of our original business plan at $128 million, up from $110.5 million at the end of the first quarter. This morning, we reported second quarter 2022 NAREIT FFO of $9.3 million or $1.72 per share and FFO as adjusted of $9.2 million or $1.71 per share. For the six month period, NAREIT FFO was $8.1 million or $1.51 a share and FFO as adjusted was $4.4 million or $0.83 per share. On a quarterly basis, the primary drivers of the variance to 2021 actuals were; the gain of $8.8 million from the sale of our Moorestown multifamily land parcel and a decrease in G&A expense of $3.8 million. On a year-to-date basis, same-store NOI excluding lease termination revenues was 3.6% higher than in the comparable six months ended in 2021. This was driven by increases in revenue as a function of our strong leasing, collections and tenant sales performance. For the second quarter, same-store NOI was 96.6% of 2019 levels. As Joe mentioned, core mall sales increased to $605 per square foot at the end of the second quarter. During the quarter, we signed 350,000 square feet of new and renewal leases. Some other noteworthy achievements, core mall total occupancy was 93.8%, as compared to 89% at the end of the second quarter of 2021. Total leased occupancy, which captures the volume of our leasing activity is at 95%, an improvement of 240 basis points over the second quarter of 2021. And renewal spreads, they were positive at 2.3% on a year-to-date basis. During June, we sold three assets, generating total proceeds of $49.6 million and gains on these transactions of $19.6 million were recorded during the second quarter. With the proceeds from these sales combined with excess property cash flow, we paid down the revolver by approximately $37.7 million and the first-lien term loan by $18.1 million. Subsequent to the close of the quarter, we used over $3 million from the sale of additional outparcels to make further pay downs. Looking ahead, we are focused on translating all of this activity into organic revenue growth and continuing to sell assets opportunistically with the goal of reducing debt and interest expense and driving earnings growth. To reiterate what weâ\u0080\u0099ve said previously, we fully expect to achieve the credit facility extension later this year. As we noted in our prepared remarks, we expect to be able to execute our credit facility extension and we are in the process of reviewing our options to refinance the facility. On a lease basis, our total occupancy is an impressive 95% and we continue to attract a wide array of tenants and experience -- experiential offerings remains a top priority for us. Along these lines, with Tilted 10 opening, it will grow later this year and LEGOLAND Discovery Center at Springfield Town Center next year in addition to several new retailers expanding in our portfolio. We are executing on our strategic plan to improve the share price by focusing on operational performance, asset sales, mortgage refinancing, exercising our credit facility extension and addressing the upcoming Fashion District remargin payment. As part of our effort to transform our assets into vibrant multi-use destinations with shop, time, play, live and work options, where that work creating value throughout the portfolio through the addition of a variety of uses, including apartments, entertainment, fitness, healthcare, workspaces and new retail. At the same time, weâ\u0080\u0099re on track to exceed our credit facility extension and looking at options to refinance in 2023. But we are pursuing all other options to raise capital including land and outparcel sales, JV interests and whole property sales. Well, we operate in strong markets and are continuing to see strong traffic and consumer spending. That said, we believe we positioned our properties well to withstand varying economic conditions, including offering an array of retail spanning traditional full price to value retail and fast fashion. We have a lot to be optimistic about here at PREIT, with a portfolio concentrated in two top 10 market in a country thatâ\u0080\u0099s well positioned to accommodate alternative uses, including healthcare, self-storage, fitness facilities and apartments. Weâ\u0080\u0099ve taken the important steps to grow asset values, replacing anchors, driving new tenants and customers to our properties, adding hotels and apartments."
}