{
    "symbol": "SMFR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 21:29:11",
    "content": " In the second quarter, our teams have continued to drive meaningful revenue growth, in fact, hitting record volumes in pediatrics, thanks to the GeneDx acquisition, while putting the company on track to deliver our target of approximately $50 million in cost savings this year. After comprehensive reviews of our business lines, we've decided to focus on an area where we're well positioned to win and can drive profitable growth, helping families make better health decisions with our panels, exomes and genomes, fueled by an industry-leading interpretation platform designed for a phenoms worth of information and a data engine built to combine genomic and clinical data to deliver better insights. With our operations team supported by Kevin's leadership, we've begun integrating the best of both Sema4 and GeneDx to drive down COGS, improve turnaround times and strengthen our approach to revenue cycle management, which is critical to ensuring we also strengthen our partnerships with payers. So first, in terms of the selling approach that we're taking with biopharma, it really was previously a group of Sema4 folks who are coming together and really ideating with different biopharma companies in the same way that we're trying to bring some commercial rigor and scale to health systems as well as the entire business. Matt has, I think, one of the -- he's uniquely capable in being able to think through vision in terms of where we're going with exome and genome and a data strategy, while also being able to sit in a business review, here is a problem and think about if I had a squad of 5 of my people, we can probably solve that issue, whether it's a revenue cycle issue or an ordering issue. So that's really the kind of shift that we want to see out of the team here at Sema4 in terms of product, technology, data science, how do all of those come together to really ensure that we're able to support a commercial stage growth company that has an incredible market opportunity in our hands."
}