{
    "symbol": "ESPR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 14:10:16",
    "content": " U.S. net product revenue for the fourth quarter ended December 31, 2022, was $15 million, up 23% year-over-year and $55.9 million for the 12 months ended December 31, 2022, up approximately 40% year-over-year. Royalty revenue for the fourth quarter ended December 31, 2022, was $2.3 million, up 188% year-over-year and $6.5 million for the 12 months ended December 31, 2022, up 81% year-over-year. Combined royalty and partner revenue was $3.9 million for the fourth quarter ended December 31, 2022, an increase of approximately 22% year-over-year and $19.6 million for the 12 months ended December 31, 2022, a decrease of 49% year-over-year. The decrease for the 12 months ended December 31, 2022, was due to a onetime milestone payment from our collaboration partners in the second quarter of 2021, partially offset by increases in royalty revenue and product sales to our collaboration partners under our supply agreement. Finally, total revenue for the fourth quarter ended December 31, 2022, was $18.8 million, an increase of 22% year-over-year and $75.5 million for the 12 months ended December 31, 2022, a decrease of 4% year-over-year. R&D expenses for the fourth quarter ended December 31, 2022, were $33 million, an increase of 20% year-over-year and $118.9 million for the 12 months ended December 31, 2022, an increase of 12% year-over-year. SG&A expenses were $24.1 million for the fourth quarter ended December 31, 2022, a decrease of 37% year-over-year and $109.1 million for the 12 months ended December 31, 2022, a decrease of 41% year-over-year. Your line is now open. Your line is now open. Your line is now open. Please standby for our next question. Your line is now open. Please standby for our next question. Your line is now open. Please standby for our next question. Your line is now open. Please standby for our next question. Your line is now open. Please standby for our next question. Your line is now open. Please standby for our next question. Your line is now open."
}