{
    "symbol": "ESPR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 13:40:21",
    "content": " I am also pleased to report that this quarter we continue to achieve year-over-year cost savings of $9.4 million in our operational expenses compared to the second quarter of 2021, as we pull forward our transformative plan announced in the fall and continue to focus on efficiently allocating our resources in advance of the top line readout of the CLEAR Outcomes trial. U.S. product revenue for the second quarter ended June 30, 2022 was $13.6 million, up 28% year-over-year and 26.9 million for the six months ended June 30, 2022, up 59% year-over-year. Royalty revenue for the second quarter ended June 30, 2022 was $1.5 million, up 50% year-over-year and $2.6 million for the six months ended June 30, 2022, up 63% year-over-year, driven by new country launches and continued growth in previously launched territories. Combined, royalty and partner revenue was $5.3 million for the second quarter ended June 30, 2022, a decrease of 82% year-over-year and $10.7 million for six months ended June 30, 2022, a decrease of 66% year-over-year, attributed to a large milestone payment of $28.1 million that was booked to revenue in second quarter 2021. Finally, total revenue for the second quarter ended June 30, 2022 was $18.8 million compared to $40.7 million for the second quarter of 2021, an increase of approximately 50% year-over-year after adjusting for the one-time upfront payment. R&D expenses for the second quarter ended June 30, 2022 were $32.4 million, an increase of 29% year-over-year and $56.8 million for the six months ended June 30, 2022, an increase of 7% year-over-year. SG&A expenses were $29.6 million for the second quarter ended June 30, 2022, a decrease of 36% year-over-year and $60 million for the six months ended June 30, 2022, a decrease of 44% year-over-year. One moment for our next question, please. One moment for our next question, please. One moment for our next question, please. One moment for our next question, please. One moment for our next question, please. Now in Europe, just getting back to your question, we actually think that, again, based upon the success that they already have, having the Outcomes study and having residual risk reduction and looking at other cardiovascular products that have launched that have outcomes in Europe, you always see an inflection post outcomes as it relates to more uptake, especially if you can show reduction of risk."
}