{
    "symbol": "GTN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 17:00:22",
    "content": " On a year-over-year basis in the second quarter of 2022, broadcast cash flow was $327 million, an increase of 79%; adjusted EBITDA was $309 million, an increase of 32%; core advertising revenue increased by 31%; retransmission consent revenue increased by 58%, and political advertising revenue increased by 1,400%. These excellent results, combined with total lower operating expenses than previously anticipated, contributed to a 231% increase in net income attributable to our common stockholders in the second quarter of 2022 at $86 million or $0.91 per fully diluted share. On a combined historical basis which gives effect to both acquisitions and disposition, our core revenue was flat year-over-year with our second quarter political revenue hitting an all-time record, and we remain on track to finish the year at a record retransmission revenue level of $1.5 billion. In fact on a combined historical basis, core revenue held strong, roughly flat from Q2 â\u0080\u009821, even though political advertising revenue rose $82 million from the second quarter of last year. In particular for the second quarter of 2022, we had guided political advertising revenue of $65 million to $70 million, then we reported $90 million of political revenue in the quarter. Consequently, we announced in our earnings release this morning that we are raising our political revenue guidance for the full year 2022 from $575 million to the same $652 million that our current group of stations received in 2020. Retransmission revenues net of network compensation were $157 million in the second quarter, which marks a 60% increase over the prior year period on a GAAP basis and a 9% increase on a combined historical basis. Retransmission revenue for Q3 of $365 million to $370 million, political advertising revenue of $193 million to $195 million, and thatâ\u0080\u0099s equivalent to the combined historical Q3, 2020 of $190 million. Turning now to debt and leverage, our trailing two quarter or two year average operating cash flow at 6/30/22 was $1.283 billion; total debt outstanding was $6.778 billion; our cash-on-hand was $162 million; our leverage ratio as defined in our senior credit agreement was 5.16x, which is down from the 5.47x at year-end â\u0080\u009921 and our first lien leverage ratio was at 2.39x. Our total operating expense before depreciation, amortization, gain loss and disposal of assets would be â\u0080\u0093 is anticipated to approximate $2.35 billion, and that would include $23 million of non-cash stock compensation. We are currently estimating full year cash interest of $340 million, which is up from our previous guide of $300 million, reflecting the rapid increase in LIBOR rates, especially since May, which is up 150 basis points or more, and we have an expectation based on the forward yield curve of further increases in LIBOR between September and December of 2022. If you include the $50 million of stock repurchased in Q2, the $15 million of required amortization on Term Loan B, and a voluntary debt repayment of $500 million, the aggregate $565 million of value transfer to our common stockholders by year-end given 93 million shares currently outstanding is approximately $6.08 per share at enhanced value."
}