{
    "symbol": "GTN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 16:08:06",
    "content": " Our total revenue in the first quarter of 2022 was $827 million, which was an amazing 52% higher than the first quarter of 2021. Moreover, excluding the transaction related expenses and non-cash stock compensation, our adjusted net income would have been $55 million for the first quarter of this year or $0.58 per fully diluted share. Likewise, we exceeded first quarter 2021’s CHB numbers, as well as our own guidance on retransmission consent revenue, political advertising revenue and production company revenue. Looking ahead, we are today guiding to a combined core revenue and political revenue for the second quarter of between $435 million to $445 million. If we land just below the midpoint of our traditionally conservative guidance, Gray Television will break all its previous records for second quarter advertising revenue in the company’s 100-year-plus history, both on an as reported and on a combined historical basis. Put this in perspective, during the first two quarters of 2020 on combined historical basis, our television station sold $79 million in political ads. In particular, our first quarter political revenues of $26 million plus a $65 million to $70 million of political revenue in our second quarter guide will produce a first half political revenue figure of $91 million to $96 million. Now for the full year, we anticipate political revenue of $575 million, which would be a 55% increase over the last midterm election of 2018 on this -- on our combined historical basis. It’s better, however, to compare again to 2020 when our current station portfolio booked $652 million in political revenue. Consequently, our political guide of $575 million for full year 2022 represents a 25% increase over 2020 CHB political advertising revenue, excluding the presidential and Georgia runoff advertising in 2020. Looking forward, we anticipate retrains revenues of $385 million to $390 million for the second quarter and we expect retrains revenues will exceed $1.5 billion for the full year 2022. As mentioned earlier, we will be filing our 10-Q a little later today and as we discussed in our fourth quarter call and you will note in our presentation beginning Q1 2022, Gray no longer segregates local advertising revenue from national advertising revenues in our income statements. As we discussed in our Q4 call and we will remind everybody today that for 2022, we expect cash interest of about $300 million, cash taxes of $190 million, routine capital expenditures of about $125 million, preferred dividends of $52 million and required term loan deamortization of $15 million and our routine quarter -- our routine dividend would be a little over $30 million. We are going to reaffirm that we currently anticipate that our free cash flow before common dividends, acquisitions, investments will exceed $800 million in 2022, and obviously, if political skews to the high side, that free cash number will skew accordingly higher. Your line is open. Your line is open. Your line is open. We don’t depend on the network’s local news, as we mentioned a few minutes ago, is where we drive our revenue from prime time is -- we are looking at about 12% of our revenue in Network Prime. Your line is open. Your line is open."
}