{
    "symbol": "GBDC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-11 13:46:01",
    "content": " Good afternoon and welcome to GBDC's December 31, 2021 quarterly earnings conference call. Before we begin, I'd like to take a moment to remind our listeners that remarks made during this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those in the forward-looking statements as a result of a number of factors, including those described from time to time in GBDC's filings with the SEC. For materials we intend to refer to on today's earnings call, please visit the Investor Resources tab on the homepage of our website, www.golubcapitalbdc.com and click on the Events/Presentations link. With that, I'll turn the call over to David Golub, CEO of GBDC. I'm joined here by Chris Ericson, our Chief Financial Officer; Gregory Robbins, Senior Managing Director; and Jon Simmons, Managing Director at Golub Capital. For those of you who are new to GBDC, our investment strategy is and since inception it has been, to focus on providing first lien senior secured loans to healthy resilient middle-market companies that are backed by strong partnership-oriented private equity sponsors. For the quarter ended December 31, adjusted NII per share was $0.31 adjusted EPS was $0.37 and ending NAV rose to $15.26 per share. Now I'll hand the floor to Gregory, Jon and Chris to elaborate on GBDC's performance for the quarter. I'd call your attention to the Golub Capital Middle Market Report, or GCMMR for December 31, which we published several weeks ago. Importantly, we believe that portfolio growth came in the form of very attractive new investments. As you can see, GBDC outearned its, now higher, quarterly dividend with $0.31 of adjusted NII per share. In addition, adjusted net realized and unrealized gains totaled $0.06 per share, reflecting the excellent credit quality of GBDC's portfolio. Slide 9 summarizes our results for the last several quarters, during which GBDC achieved consistent and expanding adjusted NII, as well as strong adjusted net realized and unrealized gains, EPS and distributions. This was another strong quarter for originations at GBDC, with new investment commitments totaling $867.7 million. After factoring in total exits and sales of investments of $661.8 million as well as unrealized appreciation and other portfolio activity, total investments at fair value increased by 5.1% or $251.9 million, during the quarter. As of December 31, 2021, GBDC had $41 million of undrawn revolver commitments and $267.2 million of undrawn commitments on delayed draw term loans. As of December 31, 94% of our portfolio was comprised of first lien senior secured floating rate loans and defensively positioned in what we believe to be resilient industries. Focusing first on the light blue line, this line represents the income yield or the actual amount earned on the investments including interest and fee income but excluding the amortization of upfront origination fees and purchase price premium. And then finally, our net investment spread or the green line, which is the difference between the investment income yield and the weighted average cost of debt increased by 10 basis points to 5%. Non-accrual investments as a percentage of total debt investments at cost and fair value remained low at 1.2% and 0.9%, respectively, as of December 31. During the quarter, the number of non-accrual investments declined from six to five due to the disposition of one portfolio company investment. As Gregory discussed in his opening commentary, as a result of continued strong portfolio company performance, the percentage of investments rated 3, meaning companies performing or expected to perform below our expectations of underwriting on our internal performance rating scale decreased to 6.6% of the portfolio at fair value as of December 31. As a reminder, independent valuation firms value at least 25% of our investments each quarter. Slides 16 and 17 provide further details on the balance sheet and income statement as of and for the three months ended December 31, 2021. As illustrated, investors in GBDC's 2010 IPO have achieved a 10% IRR on NAV since inception and a bit higher than that based on our current stock price. Slide 20 summarizes our liquidity and investment capacity as of December 31st, which remains strong with over $1.2 billion of capital available through cash, restricted cash and availability in our various credit facilities. First, on October 13th and 15th, respectively, we issued an additional $200 million of 2026 unsecured notes at a price resulting in a yield to maturity of 2.667% and an additional $100 million of 2024 unsecured notes for the price resulting in a yield to maturity of 1.809%. Second, on November 19th, we amended our revolving credit facility with JPMorgan, primarily to increase the accordion feature, which now allows us to increase the facility up to $1.5 billion from $712.5 million. In addition, we entered into a series of agreements most recently on December 17th to increase the aggregate commitments outstanding under the JPMorgan facility to $1.1875 billion from $475 million as of September 30, 2021. Slide 21 summarizes the terms of our debt facilities as of December 31, 2021. Most recently our Board declared a quarterly distribution of $0.30 per share payable on March 29, 2022 to stockholders of record as of March 4, 2022. So to sum-up, GBDC had a strong quarter for the period ended December 31st. We pointed in recent quarters to one tailwind, which is the strength of GBDC's portfolio. Our internal performance ratings are in line with pre-COVID levels, non-accruals are low and we're seeing net realized and unrealized gains rather than losses. Based on growth in private equity fundraising and the current level of private equity dry powder, we think the private equity ecosystem is on that flight path to double in size over the next three to five years. In other words, we think Golub Capital is a leader in an attractive growing market. Finally, we believe the changes in the private equity ecosystem play to our competitive advantages. But we're optimistic based on the strength of the Golub Capital platform and the proven resilience of GBDC's portfolio that we're going to be able to continue to serve shareholders well over the course of the coming period. So to give context for those who are on the phone who may not be as familiar as Jordan is, when we talk about our late-stage lending or growth lending business, we're talking about loans to software companies that are in a rapid growth mode and have made the decision to invest heavily in selling and marketing expenses at the expense of profitability during a period of rapid growth. When the venture market and the IPO market are particularly strong, it puts a damper on our late-stage lending business because the companies that we're lending to have choices and among the choices they have are issuance of equity as an alternative to issuance of debt. So during periods in which valuations are really high and venture firms are eager to deploy capital, it's harder to find attractive late-stage lending opportunities. It was a period of relatively high stock prices, relatively robust, venture fundraising and venture deployment. First quarter always tends to be a bit seasonally slow, but it looks like we're headed into a period that's more favorable for this piece of our business. I would tell you that in my mind a key part of our fee structure is that, we think is really important in addition to the features you mentioned is the hurdle rate. First one, there's been a lot of investor interest recently on the impact of rising rates on BDC's operating earnings. Right now today they're facing this is from a high-level standpoint obviously, but facing higher labor costs, facing higher raw material, input costs. And so to the extent that the Fed -- and James Boller, the Fed President came out today and said they want to give rates above 1% by July. So, if we look at the world from the perspective of our borrowers right now, there are tailwinds and headwinds that they're facing. And if you look at the Golub Capital Middle Market Index results from the most recent quarter, you'll note that median company revenue and EBITDA for the first two months of the fourth quarter were well up year-over-year and over 2019 over the pre-COVID impact period. So, one of the important components of the situation that management teams are facing right now is one that includes growth and robust consumer spending. In some sectors, we're also seeing other input costs go up significantly. So, I don't think we're going to see an environment in which rising rates in and of themselves have a meaningful impact on credit performance. So, I don't think this is going to be a big factor for our portfolio, but I think it's going to be a big factor for the economy generally. So, having gone through a period where it moved too slowly, the second risk is it may move too quickly and it may reverse the recent growth in the size of its balance sheet. I appreciate the very wholesome conversation about all the puts and takes that are going on right now in our standard position, what we think. In your prepared remarks and -- which I would agree with, you talk about kind of the private equity ecosystem potentially doubling over the next three to five years and what that could mean for private credit and direct lenders and in particular those lenders who have large-scale platforms like yourselves. I'm just curious, though, in the near term, kind of, revisiting back to the comments on rising rates, we've already seen rising rates push down multiples in the public markets. And I would think, sponsors who have transacted over the last several years at certain multiples, depending on where those multiples go, if they come down meaningfully, they may want to transact much less frequent or hold those positions longer until multiples potentially resumed. Right now, there are three different principal kinds of ownership of middle-market companies in the U.S. They're family-owned businesses, they're publicly owned businesses and they're private equity-backed businesses. I think it would likely increase the amount of public to private activity, because we'd see public market valuations go down. And when we see public market valuations go down, we typically see a degree of mispricing of some companies and their stocks and that in turn catalyzes some activity. So for public companies, I think, that'd be a plus from an M&A activity standpoint. For family-owned businesses, it might be both a plus and a minus: a plus because, it might drive a need for liquidity; a minus because, families might see that they'd be better off waiting and selling in a better environment. And I kind of see the same dynamic happening in the private equity ecosystem, where it's both a plus and a minus. You're right that it might lead some private equity firms to want to hold some portfolio companies longer to grow and to, in essence, generate a better dollar return on their investment by just taking longer. On the other hand, the pressure on sponsors to show good rates of return is a mitigant to this longer holding period pattern. I come back to the main point, which is, you've got existing unused capital that the private equity firms have in their coffers and need to spend within a defined time period. There's enormous fundraising that's been going on for the last several quarters, record after record being broken. So I think, both of those argue for robust new private equity spending. So I think on balance, I still think even if we see an equity market decline, you're likely on balance still to see a robust private equity-backed M&A environment. But if I look at your guys' equity portfolio, it's still very, very small relative to the overall size of your portfolio. And if we look at the commitments, again, still a very small portion of your portfolio but commitment size on a quarterly basis as a percentage of investments in a quarter has increased pretty materially 5% two quarters ago, 3% a quarter ago and 8% on new commitments. I know it's still really small and it's not a huge change, but that was something that stood out a little to me. We plan for it to continue to be small, but we have seen some what we think are very attractive opportunities in some what we call yield-oriented preferreds. On the PE ecosystem, I mean we have seen a lot of growth. But at relatively large element of that is, of course, bigger funds or bigger platforms doing larger and larger funds, which kind of necessitates larger and larger deals for them. So do you think there's -- I mean, obviously, the private credit market is growing gaining share doing more. While Golub Capital is a market leader in these mega unitranches, I think in 2021, calendar 2021, we were lead or co-lead in roughly half of them. If you were to do a carving of the GBDC portfolio by level of EBITDA, the vast preponderance of the portfolio in the neighborhood of 80% is in the form of loans to companies with less than $75 million of EBITDA. When we see attractive opportunities in that area, we're going to take advantage of them. But if that market got overheated, if that market shrunk in size unexpectedly, it's really not a big problem. The question's whether it's going to grow rather than how significant it is today, but I appreciate that color. You guys have built a very high-quality mousetrap, tremendous stable results over many cycles, high-quality credit portfolio. We have one of the largest, if not the largest investment team over 160 people that enables us to have really deep domain expertise in a wide variety of different industries. We have market leadership in this one-stop or unitranche product, where we were a pioneer and we've proven time and again that it's really effective way for sponsors who want to do buy-and-builds to scale up their right-hand side of the balance sheet through a series of transactions as they're growing. So, there's a whole series of things that we can do that in many ways are a result of or are enabled by our scale. And so if you think about what's important to them, it's about partnership orientation, it's about reliability, it's about reputation, it's about track record, but it's also about capabilities. So, I think that trend is very likely going to continue going into the future. Now, we're not going to do anything super-fast. We're big believers in methodical growth in planned, careful, disciplined, methodical growth."
}