{
    "symbol": "GBDC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-23 17:28:03",
    "content": " For those of you who are new to GBDC, our investment strategy is, and since inception it's been to focus on providing first lien senior secured loans to healthy resilient middle market companies that are backed by strong partnership oriented private equity sponsors. The increase in adjusted NII per share was driven by higher base rates, continued credit stability, and GBDC's low cost of funding. And there's even more good news: given rising base rates and spreads, and given GBDC's funding structure, there's potential for further increases in NII in coming quarters. We announced in our press release a 10% increase in GBDC's quarterly base dividend from $0.30 a share to $0.33 a share, which equates to an 8.9% dividend yield on our 9/30/2022 NAV of $14.89. On the asset side of the balance sheet, GBDC's portfolio, which is almost all floating rate loans, it's generating more interest income due to higher base rates and higher spreads. This means that as our portfolio continues to reset today's higher base rates, and as we benefit from further base rate increases, 80% of incremental returns will increase GBDC's NII. GBDC's investment income increased by 170 basis points, primarily from a combination of rising interest rates and accelerated discount amortization from higher payoffs compared to last quarter. The middle bar looks at what GBDC's adjusted NII per share would have been in the 9/30 quarter if all of its floating rate assets and liabilities had been based on the LIBOR rate of 375 basis points, the rate at quarter-end. The bottom line is that we think GBDC's NII per share has a lot of built-in momentum just from higher LIBOR rates that have already occurred, but have not yet flowed through GBDC's results. I don't think we're seeing the full impact yet because we're still early in this credit cycle and because the increases in rates have been reasonably rapid, but all of that's coming. So, it just seems like right now that despite the fact that we're coming into a bit of an economic slowdown, recession or muddling either way, that despite that that being apparently in front of us that relative to other points in the cycle of return and risk, the asset class of middle market lending seems â\u0080\u0093 it sounds like it's marginally better than most of the time. I definitely think that if you look at institutional investor sentiment right now, there's a wide view that relative to traditional fixed income, which has performed terribly relative to public equities, relative to a variety of different alternative categories that that middle market lending has performed well and has good prospects from here."
}