{
    "symbol": "ECVT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 16:13:01",
    "content": " I would now like to hand the conference over to Mike Feehan, Chief Financial Officer. Welcome, everyone, and thank you for joining us for our first quarter 2022 earnings call. I would first like to introduce Kurt Bitting, our new CEO, who will be joining me today. In addition, Tom Schneberger, our new President of Ecovyst, will also be joining us and available during our Q&A session should any questions need to be directed his way. Please note that some of the information shared today is forward-looking information, including information about the Company's financial and operating performance, strategies, our anticipated end-use demand trends and our 2022 financial outlook. First, I'd like to say how excited I am to be taking the reins as CEO of Ecovyst. I have been with the Ecoservices business for more than 15 years, serving in several capacities, most recently as President of the business, but I had never been more confident in the growth potential of this company than I am today. Ecovyst provides products and services critical for the production of clean fuels, polymers and the growing technologies that will aid in decarbonization efforts. As you have seen in today's press release, the Ecovyst Board has decided to make a leadership change to accelerate the growth of the Company. As you know, we are a critical supplier for the production of transportation fuels and many industrial applications. In fact, we provide critical materials and services that support sustainability enabling technologies, including sulfuric acid supply into mining for metals and minerals production essential to electrification as well as catalysts and activation services used for renewable fuels production. I am very proud of the Ecovyst team's ability to deliver strong sales and adjusted EBITDA this quarter, following closely on the heels of our stellar financial performance in 2021. The confidence we have in our growth momentum gives us the flexibility to continue to pursue accretive bolt-on acquisitions similar to the addition of Chem32, while returning value to our shareholders through the share buyback program we have announced. I would like to highlight several key financial, operational and safety metrics that we track closely. Our strong performance this quarter on all fronts is a testament to the team as well as the key strategic partners that we have built, our long-term customer contracts for critical products and services and our robust production and logistical operations that allow us to reliably deliver our solutions to our valuable customers. We continue to outpace industry growth rates and peers as evidenced in our Q1 2022 results, with year-over-year gains of 34% in sales, 40% growth in adjusted EBITDA and a strong 74% cash conversion ratio. Profitability also increased amid inflationary pressures as we were able to pass through rising raw material, freight and energy cost to customers. With the need for sustainable solutions front of mind for many investors, customers and employees, we continue to invest in technology that supports and advances these trends, with 85% of our research and development focused on sustainable solutions. First, Ecovyst has had success in more than offsetting the inflationary pressures in raw materials and transportation as a result of contractual cost pass-throughs and price increases to our customers. From a demand standpoint, many of our customers are located in the U.S., particularly on the Gulf Coast, and their advantage to access to energy and raw materials has allowed them to benefit from a strong global pool for their refined products and petrochemicals, which rely on supply from eco services and catalyst technologies. And finally, because of order timing and transportation issues, primarily in catalyst technologies, we have built up an order backlog that we will fulfill in the coming months, which gives us confidence for the remainder of the year. I would, again, like to highlight that Ecovyst supplies numerous customer segments that have proven critical in today's geopolitical environment, including clean fuels, industrial and polymers. This alignment, along with our support of sustainable technologies, has enabled us to deliver strong results. The return of U.S. gasoline demand, coupled with the global demand for U.S. gasoline exports, has led to healthy refining margins and increased refinery utilization in the U.S., which is projected to increase by 5% in 2022. On the industrial side, we see strong sentiment continuing for the materials that are used in the automotive industry, such as lightweight vehicle parts, fuel-efficient, low-rolling resistance tires and lead acid batteries. As a reminder, the expanding production of renewable fuels benefits both catalyst technologies and our Chem32 catalyst activation business because renewable catalysts generally require more frequent catalyst bed change-outs. With the current geopolitical uncertainties, demand for polyethylene remains strong, similar to what we experienced during the pandemic. In traditional fuels, where hydrocracking units are operating at high production rates, our sales of HCC catalyst materials increased by more than 90% versus prior year. On our previous quarterly call, we talked about our sustainable solutions in three key areas: clean air by reducing sulfur and nitrogen oxide emissions in heavy-duty transport; plastic circularity, enabling the reuse of lightweight durable plastics; and renewables to transform biomass into fuel and other materials. In fact, our sales to renewable fuels tripled in 2021 and represent more than 10% of sales at our Catalyst Technologies business. As mentioned during our fourth quarter earnings call in late February, we expected the strong sales and adjusted EBITDA growth that we experienced in 2021 to continue into the first quarter. During the quarter, total sales, including our 50% share of ZI, increased 34% year-over-year, with adjusted EBITDA increasing by 40%. Demand for regeneration services and virgin sulfuric acid in our Ecoservices business led the way, along with strong demand for polyethylene catalysts in our Catalyst Technologies segment. We continue to implement price increases, which more than offset higher variable costs such as sulfur, natural gas and freight, allowing strong earnings growth to continue despite cost pressures. Moving to the next slide, we'll take a look at the key components of our earnings growth in the quarter. First, strong demand in various product lines led to higher volumes. Second, our business fundamentals have allowed us to raise prices to offset the impact of inflation on input costs, creating a positive price to cost dynamic. In Ecoservices, changes in sulfur costs are passed through in price on a dollar-for-dollar basis. Sales increased $54 million, or 54%, driven by higher regeneration services and virgin sulfuric acid volume and increased pricing to cover higher input costs, including the pass-through of $21 million of higher sulfur costs. Adjusted EBITDA increased $16 million, or 50%, on the drop-through of favorable pricing and higher volume as well as the impact from the Chem32 acquisition. However, margins were negatively impacted by 510 basis points related to the pass-through of higher sulfur costs. Adjusting for the impact of the higher sulfur cost pass-throughs, adjusted EBITDA margins for Ecoservices would have been just over 37%. In our Catalyst Technologies business, silica catalyst sales were down slightly, while sales in our Zeolyst joint venture were flat with the prior year. While demand for polyethylene catalyst continues to remain strong, we experienced delayed shipments and an impact from the timing of niche custom catalyst sales. Within the Zeolyst joint venture, sales growth in both hydrocracking catalyst and niche custom catalysts were offset by order timing within the year for our pressure product catalysts. Given the strong demand environment across our key markets, we expect improved performance in the second quarter. On this next slide, we are reiterating our guidance for nearly all of our metrics as we continue to benefit from the strong growth momentum experienced by our key demand drivers. With the recent spike in sulfur costs, we're increasing our GAAP sales guidance by $80 million from a range of $730 million to $750 million to a range of $810 million to $830 million. As a reminder, this contractual pass-through of higher sulfur cost does not impact our adjusted EBITDA, but would have a negative impact on adjusted EBITDA margins. We are reiterating our adjusted EBITDA guidance, which is expected to be up 16% at the midpoint of our range compared to the prior year, and our adjusted free cash flow expected to improve 30% year-over-year. With respect to the second quarter of 2022, we anticipate continued sales and adjusted EBITDA growth in both businesses. Earnings are expected to be up compared to the prior year and the first quarter of 2022, but slightly lower than the fourth quarter of 2021 in both businesses. On the top line, Ecoservices sales in the second quarter are expected to continue to increase related to the pass-through of higher estimated sulfur costs and other input costs. Since the recent sale of our Performance Chemicals segment in August of 2021, we have reduced our leverage by more than half of a turn and are now just above 3x. During the same time frame, available liquidity, which we define as cash on hand plus the availability under our revolving credit facility, has increased 24% to more than $200 million. With our strong cash generation and lower leverage position, Ecovyst is positioned to increase shareholder value through return of capital and opportunistic bolt-on acquisitions. We will continue to use cash from operations to support organic growth initiatives, then look for opportunities to target accretive and strategic M&A with a focus on sustainable technologies, aligning our goals to create a more sustainable future. This flexibility allows the Company to return capital to shareholders, including negotiated transactions with our sponsors, while keeping our leverage level in an appropriate range. In summary, our business has delivered great results in the first quarter. This, along with a strong balance sheet, gives us the confidence in our new capital allocation strategy, including our newly approved stock buyback program, which we believe will increase shareholder value. Congratulations on the new role, Kurt. I think, look, it's great to see you kind of in the seat at this point. As President of Ecoservices, I really heavily participated in the development of our current strategic plan. And as you know, Ecovyst plays a key role in the production of clean fuels and sustainable technologies. And really, our portfolio, our technology assets and the really great, highly capable team we have are really well positioned to capture the growth in those sustainability trends. So we like -- we're going to continue to look at our organic opportunities, which we have a rich pipeline, as well as bolt-on M&A opportunities. I guess can you help us to frame your comfort with leverage and what you think kind of the right leverage level would be given that you do have -- you have a large buyback program in place, but it's over a four-year period. Just in the last six months, from the end of the third quarter, we've reduced leverage over 0.5 a turn. So we're starting to get into that sweet spot where we have a lot of flexibility and knowing the cash on hand that we have today, the available liquidity that we have under our credit facility and the ability of free cash flow generation in the future that will be very adequately set to do a few things. One, first, take any excess cash that we have and reinvest it back in the Company through growth projects. As Kurt mentioned, we do have a pipeline of great organic growth opportunities. Then we'll look to see what do we want to do next, whether it continues with another bolt-on acquisition like a Chem32, something that's accretive or strategic or has the right technology. So we're very comfortable with our plan, our forecast and what we'll be able to do to support this program. Yes, I think the plan is if you just look at kind of the mechanics behind our capital allocation strategy, like I said, any initial cash from operations, we're going to try to reinvest in -- that first dollar goes back into organic growth opportunities. And just on the results, it sounded like there were some delayed shipments in various areas in Qi. As you know from past calls, our hydrocracking catalyst does have some potential shift between months, and we did see that go from March to April. There were some shipping delays, supply chain challenges that created an order backlog, but that backlog is set to unwind over the next several months. So we're very comfortable with our plan, and as I mentioned, we're reiterating our guidance for the full year. So yes, I mean, if leverage can -- if we can get leverage down below 3x, that's the goal, that's our intention. And again, we'll keep it in the time -- the sweet spot, say, of in the 3s, 3x lever. I'd also like to add, our business is really highly consistent if you look at the consistent cash flows that's generated over the course of the year, over the course of time. And Kurt, I think you mentioned maybe that growth has lagged in certain areas of the business. There's some that, particularly in the areas that focus on sustainable technologies and green infrastructure, that are probably growing faster than the others. It's really -- we kind of have a double investment in there right now, right, with our catalyst technologies, which are making great innovations and great progress in that area as well as our recent investment in Chem32, which does a lot of catalyst activation in that space. We mentioned mining, which obviously metals and minerals are going to play a huge part in green infrastructure going forward. And our position in the market there is fantastic, where our plants are and our ability to service those customers. Congratulations on the new role, Kurt. I was wondering if you could give us a little bit more color as to what you're seeing in some of these -- you mentioned good demand in the kind of packaging, but also in MMA and some of the other kind of more niche areas of your kind of Catalyst business, and just more color there would be helpful. The -- I'm going to actually pass that question to Tom Schneberger, who runs our Catalyst Technologies business. In terms of polyethylene, we're seeing polyethylene as a clear choice as the material -- preferred material in packaging and films as we saw even during the COVID downturn consistent mid-single-digit growth overall for polyethylene. And because they're trying to get to circular plastic, polyethylene is being used more so with the intent to recycle. So we've got good tailwinds, not only in polyethylene, but in some other areas in our business as well. And then I don't know if you mentioned this, but -- so you have a very good pass-through on raw materials. We've had -- on how we pass through, the businesses do a really good job of passing through transportation costs. In a lot of cases, prepaid and ad-type situations with customers or customers are paying the freight directly. There's a paragraph in today's release where I think Kurt is quoted as saying, you're supportive of increasing the float and the liquidity for the stock. So from our strategy with the capital allocation, I mean there's a couple of different mechanisms to use with the buyback program. And then down the road, we would have more open market traditional buyback programs that we would decide whether that's the optimal use of cash at the time given all the market dynamics and the power. I'd like to maybe ask Kurt a question about the sulfur market, not so much Ecoservices but sulfur. And with this release, you put a -- meaningfully increased your revenue guidance, but it was solely due to the assumed increase in the pass-through cost of sulfur. And I think, Kurt, if you go back to your early days with Ecoservices, you said 15 years plus, I think you were there the last time the sulfur market kind of froze up. It's my opinion that the sulfur market is going to get as tight or tighter this time around, I could make the case. The demand side for fertilizer is going to outpace the supply side for fuel -- from fuels for quite a few quarters, maybe a couple of years. I always appreciate questions on sulfur because not a lot of people talk about it, and I've got a lot of experience in that area. So clearly, what's -- you're spot on. One, a lot of our regeneration customers are actually our sulfur suppliers. We have lots of multiple suppliers, and we're probably better positioned than maybe some others that are hundreds of miles away from their sulfur source or something like that. And we do have obviously -- our virgin acid business has a very high degree of pass-through on sulfur, where 90-plus percent of the contracts where it's just automatic or it's passing whatever the sulfur change is through to the customers. But under your standard supply -- under your standard contracts where sulfur handling and whatnot for your customers, is -- are there restrictions or are they outs, outed -- I'm doing a terrible job. Well, I would say most of our customer agreements, the overwhelming majority of them are 100% requirements agreements, so we match what their requirements are. But I would also state that there is a very healthy opportunity to sell excess sulfuric acid elsewhere if our customers aren't taking it because, again, the market, the supply is, I would say, has been impacted with numerous things, so the supply is not great. You've got, again, mining, which is heavily linked to the green infrastructure that I talked about before with copper and different minerals drawing a lot of sulfuric. A lot of the industrial segments, things like polyethylene or PVC, lead acid batteries, really everything is a strong pull on it right now. But really, I'd just like to say that we're delighted -- I'm delighted to have the opportunity to lead this great company. I would like to highlight, we have a really highly experienced executive leadership team that we really have confidence in going forward and executing the strategic plan that we've laid out and really delivering, at the end of the day, delivering strong shareholder value. I think -- from our standpoint, we're agnostic probably to the feedstock, the type of feedstock. The -- there's clearly -- as renewable fuels is picking up pace, not only with greenfield sites, but converted refineries, and where that benefits our business is those renewable fuels plants tend to use a lot more catalyst. It has to get changed out a lot more, which benefits not only the sale of new catalysts into the units, but our Chem32 business, which activates the catalyst before it goes in. But clearly, it's a real high growth area. The order backlog was really a result of some of the supply chain challenges that we saw in the last few months, but it's starting to already unwind, and we're expecting that to come back over the next couple of months."
}