{
    "symbol": "BCDA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-29 22:38:02",
    "content": " Our efforts to complete the CardiAMP Autologous Cell Therapy, pivotal clinical trials for the indications of heart failure or BCDA-01 and chronic myocardial ischemia or BCDA-02 are furthest along clinically with an estimated combined 1.6 million patients in a reachable US market. The CardiAMP Cell Therapy Heart Failure Trial, or BCDA-01, is a Phase III 260-patient randomized controlled clinical study, intended to provide the primary data to support safety and efficacy in pursuit of market clearance. As the CardiAMP Cell Therapy trial in heart failure was over 90% powered for success with a range of 86 patients to 126 patients, there is potential that the trial could meet its primary efficacy endpoint on the patients that have all -- have been enrolled to date. The trial is designed for patients with New York Heart Association Class II and III ischemic heart failure of reduced ejection fraction, whose own cell composition makes them ineligible for the company's Phase III CardiAMP Heart Failure Trial studying autologous cell therapy or BCDA-01. R&D expenses modestly to $8.8 million in 2022 compared to $8.6 million in 2021, primarily due to increased expenses in support of the CardiAMP cell therapy heart failure trial, particularly as our clinical sites continue to emerge from the effects of the pandemic. Joe, thank you for -- no, Joe, great question and that's something that it always makes it difficult to compare one trial to another, but in our population as we look at the data sets, we're looking at New York Heart Association Class II and III ischemic etiology heart failure with reduced ejection fraction patients. So again, this is, to have a heart failure trial and this early is -- would be very exciting, but at the same time, it's a success if the DSMB with the number of patients we have in all the additional follow-up data set keep going. Also as we're pushing all these elements on the CardiAMP heart failure trial, the third program of the neurokinin-1 selected mesenchymal, excuse me, the neurokinin-1 receptor positive mesenchymal stem cells that we're advancing, those we think are actually an enhance enrolment in the lead program as well."
}