{
    "symbol": "ASAN",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-01 18:07:06",
    "content": " We had 493 customers spending $100,000 or more in annualized GAAP revenue, up 78% year-over-year and continue to be the work management solution of choice at some of the world's leading enterprises. And the net retention rate of our customers spending $100,000 or more continues to be very strong at over 140%, and we'll talk more in a moment about some of these large customers who represent some of the world's leading companies and best-known brands. I think what I'm really encouraged about is like even when we go deep into the data, like one of the things that's really -- that continues to be strong is kind of like if you look at our 500 customer, that revenue base continues to grow at a very healthy clip. But I do think the conversations that we're seeing, the types of engagement we're having is while the pipeline isn't like going away, I think many of our customers are just like taking a beat and saying, 'Hey, what's going on in the market, everyone is trying to rightsize their own cost structure, trying to understand their own outlook based on the macro environment.' And really, what we're seeing that drives that growth is that their â\u0080\u0093 it's really how many of the organizations work and how they onboard new employees, how they train their employees, how they deploy even for their end customers. And so we're excited to see that, because I think that really is playbook that we feel we can replicate in a lot of our large enterprise customers that are starting to see that similar behavior, where it's across multiple departments, it's across multiple divisions, and it's really facilitating those cross-team initiatives that are so critical right now. So, I think we're relatively well aligned when the market is ready to grow when our customers are ready to grow, that's the right time for us to be spending more aggressively. So I think we feel like we're early on that, but it's been really helpful, both including Norton as well as a number of other global healthcare customers. I think it's very clear to our large customers because they're living it and getting the value proposition and experiencing the increasing returns to scale, but we need to be able to replay that story for investors and for new customers and for analysts, and I think we're getting better at it all the time, but there's a long way to go there. To your question on how we think about it, if there's incumbent technology, I think what our teams are still doing is really focusing deeply on understanding our customers' most pressing business problems and how Asana can differentially solve those problems because in the end, that's where they want to make the investment, there might be existing applications, but a lot of the execs also recognize that those are not being adopted even if they're available."
}