{
    "symbol": "FCNCA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 14:44:02",
    "content": " Number three, pre-provision net revenue continued to be a bright spot, growing by 21.3% over the second quarter indicative of significant margin expansion, solid fee income growth generation and good expense management. Fourth, net interest margin expanded by 36 basis points during the quarter due to higher interest rates and strong loan growth, only partially offset by higher funding cost and borrowings. Interest expense increased by $54 million due to higher funding costs as the rate paid on interest-bearing deposits increased by 24 basis points, and we added wholesale borrowings to cover the decline in deposits since the end of the first quarter. I will focus my comments on the change during the linked quarter where the 36 basis points margin expansion was due to a higher yield on earning assets and loan growth, partially offset by a higher cost of interest-bearing deposits and the impact of additional borrowings. Despite this, we feel confident in our ability to maintain our efficiency ratio in the lower 50s in the coming quarters as we removed another estimated $70 million out of our cost base helping to neutralize natural non-interest expense growth that exclusive of merger cost saves would be closer to mid-single-digit range for this year. We anticipate mid-single-digit percentage points increase in loans for the full year 2023, driven by continued momentum in our business and commercial lending and the branch network increased hiring and expansion of our middle market business, continued expansion of our wealth business through adding bankers that expanded presence outside of the Carolinas market and further growth in both our industry vertical and Business Capital segment. Our expectation for the fourth quarter is mid-single-digit percentage growth, bolstered by continued growth from our branch network, in addition to a focus on adding balances in our direct bank through competitive product offering as well as increasing our broker deposit position."
}