{
    "symbol": "FCNCA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 00:43:11",
    "content": " We saw positive momentum in net interest income as a result of the recent increases -- recent rate increases, as well as an improved mix of earning assets driven by a solid quarter of loan growth, all leading to another quarter of positive operating leverage. Focusing on the adjusted results at the bottom of the page, net income available to common shareholders was $270 million for the second quarter, down from $299 million in the first quarter and $286 million in the second quarter of the prior year. The increase in provision expense was largely offset by PPNR growth, which increased by $60 million or 16.8% over the linked quarter and by $114 million or 37.6% over the comparable quarter a year ago. Net interest income totaled $700 million for the quarter, up 7.9% over the first quarter, and 14.4% over the second quarter last year. The 31 basis points increase in margin from the linked quarter was due to the impact of higher loan yields and strong loan growth, the impact of the debt redemption and expanding yields on investment securities and overnight investments, partially offset by a small decline in SBA-PPP income and slightly higher interest-bearing deposit costs. NIM was up in the comparable quarter by 48 basis points, some of them exist that I stressed in the linked quarter with the exception of the timing deposit rate and a higher investment securities balance, both of which provided for additional expansion, partially offset by a $1.1 billion decline in average loan balances, lower purchase accounting accretion and SBA-PPP income. Core noninterest income increased by $37 million as compared to the second quarter of last year, led by increases in net rental income on operating leases, service charges on deposits and wealth management income, all partially offset by a decline in mortgage income. Noninterest expense adjusted for depreciation and maintenance on operating leases was $609 million, a $77 million decline from the linked quarter and a $55 million increase over the second quarter last year. The $77 million decline from the linked quarter was due to a $101 million decline in merger-related expenses, partially offset by a $27 million reversal of expense in the first quarter related to the termination of two legacy retiree benefit plans and a $6 million decline in core noninterest expense. The $6 million decline in core noninterest expense from the linked quarter was primarily related to an $11 million reduction in personnel costs driven by lower benefit expenses, lower incentive compensation and higher deferred origination costs. Total loans increased $2.2 billion over the linked quarter or by 13.5% on an annualized basis, exceeding our single -- our mid single-digit guide last quarter as our teams generated production above target levels and prepayments reduced due to increasing interest rates. These declines were offset by -- partially offset by growth in noninterest-bearing deposits of $747 million or 11.6% annualized rate, primarily from our branch network. The net charge-off ratio was 13 basis points, well below historic norms, deterioration in the CECL macroeconomic forecast and strong loan growth, partially offset by improved credit quality led to a $42 million provision for credit losses compared to a $49 million benefit in the prior quarter. For net interest income, we expect increases in the high single-digits from the second quarter to the third quarter as the full quarter impact of second quarter loan growth is recognized and asset yields continue to improve. For the year, we expect noninterest expense percentage growth to be low single-digits, this represents the core expense growth rate is driven by inflationary pressures in the range of 5% to 6% being offset by the $100 million in additional cost saves, we estimate to be recognized throughout 2022."
}