{
    "symbol": "EVC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 18:21:06",
    "content": " Digital revenue was $230.1 million for the fourth quarter, improving 30% year-over-year. Television revenue was $45.8 million in Q4, up 14% compared to the prior year's period, benefiting from strong political advertising revenue. Retransmission revenue for the quarter totaled $8.9 million, which was down 1% year-over-year, mainly due to the discontinued Univision affiliates. Political revenue totaled $19.1 million in the fourth quarter, bringing our total political revenue to a record $32.1 million for the year. Audio revenue totaled approximately $20.4 million for the fourth quarter, an increase of 26% year-over-year, again, largely driven by political ad revenue. Excluding incremental political revenue of $4.2 million in the fourth quarter of 2022, core audio revenue increased 2% versus the fourth quarter of 2021. Revenue for Q4 2022 totaled $296.3 million, an increase of 27% from the fourth quarter of 2021. As Jeff just mentioned in the segment breakouts, for our Digital segment, revenue totaled $230.1 million in the fourth quarter, up 30% year-over-year and up 20% on a pro forma basis as compared to Q4 of 2021. For our TV segment, total revenue was $45.8 million in the fourth quarter, up 14% year-over-year. Lastly, for our audio segment, revenue totaled $20.4 million in the fourth quarter, which was up 26% compared to Q4 2021. Operating expenses in the fourth quarter of 2022 totaled $57.2 million, up 19% from $48.1 million in the prior year period, primarily due to our variable expenses related to revenue growth and increases in salaries. Consolidated adjusted EBITDA totaled $36.5 million for the fourth quarter, up 11% from $32.9 million in the prior year period. Free cash flow, as defined in our earnings release, was $19.3 million compared to $30.9 million in the prior year quarter or a conversion rate of 53% of adjusted EBITDA. These charges included the following: an increase in fair value contingent consideration of $7.4 million for the quarter and $14.2 million for the full year, resulting from the outperformance of our various digital platforms compared to original expectations; $4.6 million in noncash charges related to the acceleration of Mr. Ulloa's unvested RSUs upon his death; $4.3 million in cash severance charges also primarily relating to Mr. Ulloa's passing; $1.6 million in noncash impairment charges relating to our broadcasting assets; and finally, foreign currency losses of approximately $900,000 in the quarter and $3 million for the full year."
}