{
    "symbol": "DESP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 13:30:56",
    "content": " Nevertheless, our operating expenses fell over five percentage points year-on-year to nearly 8% of gross bookings higher ASPs and an improving revenue mix, combined with the operating leverage we have built into the business resulted in over $10 million in EBITDA, our highest profit level since the outbreak of COVID-19. Gross bookings grew 129% year-on-year to $1.1 billion and as I said, was slightly above second quarter 2018. We successfully capitalize on recovering travel demand across Latam, with our domestic gross bookings exceeding those in last year's compiled quarter by 28%, while our international gross bookings grew 200%, which is 85% of comparable 2018 level. Brazil accounted for 32% of total gross bookings, up 345% year-on-year, aided by 106% increase in ASPs and reaching 37%  of second quarter 2019 levels. The rest of Latam accounted for 46% of our gross bookings, which decreased 160% year-on-year, but was slightly lower than the second quarter 2018 despite an 11% increase in ASPs. We would also like to point out that gross profit increased 15% versus second quarter 2019, when gross bookings were essentially at the same level, which evidences the significant amount of operating leverage we have built into the business since then. Most of the 37% year-on-year increase in our operating expenses was due to the 120% increase in sales and marketing spend, specifically the price promotions that we implemented taking advantage of the spike in travel demand and helping drive gross bookings nearly 130% higher. In addition to falling 516 basis points year-over-year as a percentage of gross bookings, our operating expenses decreased 4% relative to second quarter 2019. We generated $4.2 million in operating cash flow, which compares to negative $0.7 million in last year's quarter and a positive $9.5 million in second quarter 2019. That enable us to capture additional near-term growth opportunities arising from the recovering travel demand, with gross bookings within second quarter 2019 levels and revenue surpassing that quarter's revenues by 18%. With regards to profitability at Koin okay, in the first quarter, I think we shared around $5.5 million of loss at Koin and we stated that we expect by the second half of next year 2023, Koin to be EBITDA breakeven."
}