{
    "symbol": "VMW",
    "quarter": 3,
    "year": 2022,
    "date": "2021-11-23 21:24:04",
    "content": " Customers continue to choose VMware as their trusted digital foundation to accelerate their innovation, and we continue to expand and advance our portfolio to meet their needs in these three ways: One, deliver a cloud-native app platform for building modern applications in a public cloud-first world; two, migrate enterprise applications to a cloud-agnostic infrastructure; and three, build out the secure edge to optimize across our workspace and edge-native applications. As a continued commitment to helping our customers at the Edge, we recently introduced VMware Edge, a product portfolio that will enable organizations to run, manage and better secure edge-native applications across multiple clouds anywhere. Together, VMware Cloud, Tanzu, VMware Edge and Anywhere Workspace offer our customers a solution for all of their applications across their multi-cloud environment. Our largest contributors to subscription and SaaS were VCPP, Tanzu, EUC, Carbon Black and VMware Cloud on AWS, which saw strong double-digit year-over-year growth in revenue and ARR. And on that, many of their – how they build their multi-cloud control plane, whether it's through our Cloud Management software, Tanzu solutions as well as cloud infrastructure to be served from multi-cloud, VMware gives them the right platform to do so. Certifications to expand us to target larger sort of federal customer base sort of expansion of services and sort of zones where the service is available across all hyperscalers, newer services that we have introduced on VMware Cloud on AWS such as Tanzu now integrated as well as VMware Cloud on AWS Outposts. For modern applications using Kubernetes across multi-cloud, we are seeing customers start with either one module or adopt our full platforms that Raghu talked about in a very, very easy-to-adopt fashion at this point of time from Tanzu. And it's a combination of that – our message resonating in the marketplace, the confidence our sales teams, and as you've heard here across the portfolio that we have – with the products we have, and in particular, the multi-cloud message that's resonating with our customers and the momentum we're seeing for the year. But as Tanzu gains more maturity and as we introduce new capabilities like Tanzu Application Platform, et cetera, we are seeing customers start to use that as well to make the task of building new applications on public clouds easier. And then last, but not the least, with the VMware Cloud offerings on the public cloud providers, we are starting to see new applications land there as well because we just recently added Kubernetes capability to the VMware cloud offerings."
}