{
    "symbol": "VMW",
    "quarter": 4,
    "year": 2022,
    "date": "2022-02-24 20:44:02",
    "content": " Total revenue for the quarter was $3.5 billion, and combined subscription and SaaS and license revenue grew 11% year-over-year to $1.9 billion. For the full year fiscal '22, subscription and SaaS revenue totaled $3.2 billion and increased to 25% of total revenue, which puts us on track to surpass $4 billion in subscription and SaaS revenue for fiscal '23. Total subscription and SaaS ARR increased to $3.6 billion in FY '22, up 24% versus FY '21. We forecast the combination of subscription and SaaS and license revenue to be approximately $7.020 billion, an increase of 11%, with subscription and SaaS revenue of $4.040 billion, up 26% versus fiscal '22. We plan for subscription and SaaS to reach nearly 30% of total revenue for fiscal '23, and we expect our subscription and SaaS ARR growth rate for FY '23 to exceed our subscription and SaaS ARR growth rate for FY '22. We forecast the combination of subscription and SaaS and license revenue to be approximately $1.555 billion, an increase of 12%, with subscription and SaaS revenue of $910 million, up 23% year-over-year. So we're encouraged by the momentum we saw in the fourth quarter and as we look to FY '23, as I mentioned, we'll have sub and SaaS revenue in excess of $4 billion, up 26% on a year-over-year basis. And you all have written about it, and we see it in our business and the trends around becoming more and more of a digital company, transforming their application portfolio, taking better advantage of the cloud capabilities where appropriate, building out the edge, supporting a remote workforce, cyber, these themes have not changed in the last -- and of course, machine learning and data, these things have not changed in the last 2, 3 years, and I quite honestly, don't expect it to change over the next 2, 3 years. And Jim, to answer your question on the term business, term business is predominantly our Horizon VDI in end-user computing, and the compute part of vCloud Suite, okay, where customers are bringing up sort of their management in the cloud, but vCloud Suite being a suite of portfolio there is percentage of the products that they're running on-premise, which is -- ends up becoming, from accounting perspective treated as term."
}