{
    "symbol": "TOST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 21:24:04",
    "content": " We also continue to drive strong location growth, adding approximately 5,500 net new locations and ending the quarter with approximately 74,000 total locations, sustaining over 40% growth in total locations even as our scale grows is indicative of our powerful go-to-market strategy and industry-leading platform. Demand for Toast across the full spectrum of the restaurant types remains strong, and our new customers continue to take advantage of more products across our platform to operate more efficiently and grow their business. After only adding it to our sales motion in Q1 this year, the percentage of locations that went live in Q3 using xtraCHEF is already in the mid-teens, and we continue to see a significant opportunity to reach customers and further develop our product suite to help restaurants manage their suppliers. Looking at what we operationally view as recurring revenue, subscription revenue and fintech gross profit totaled $224 million, up 82% year-over-year driven by our continued location growth and healthy ARPU increases across both SaaS and fintech solutions. In addition to Toast Capital, our portfolio of non-POS fintech products with nascent offerings like PayCard and payout and other products currently in development highlight the strategic benefit of our fintech capabilities and the opportunity to build products that add value for our customers while differentiating our offering and driving additional monetization. The recent Spark event and release of our Toast's invoicing products, the latest example of how our investments in research and development are driving innovation to help our customers grow their business and improve their bottom line. And in that, they're selling all elements of the platform, whether it's the guest products, online ordering, things like that as well as hardware, so it's really the breadth of products, payroll on xtraCHEF, payroll more obviously played a role, but we still have a continued opportunity with payroll."
}