{
    "symbol": "AFMD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 18:44:03",
    "content": " Overall based on the preclinical data generated, as well as our previous experience of administering AFM13 with a cord blood-derived NK cell product in our AFM13 monotherapy study, we're confident that AFM13 administered in combination with AB-101 has the potential to generate a robust ADCC response and clinical activity in patients with relapsed or refractory Hodgkin lymphoma in CD30-positive peripheral T-cell lymphoma. The second AFM13 study that is ongoing is our Phase 1/2 AFM13-104 in collaboration with MD Anderson Cancer Centre, evaluating cord blood-derived natural killer cells pre complexed with AFM13 given one infusion, followed by three single agent AFM13 treatments in patients with relapsed and refractory CD30 positive lymphomas. As you can see on Slide 11, we shows that we are continuing to enroll patients in all three ongoing studies, including the expansion cohorts of our monotherapy study and the dose escalation cohorts for the combination studies with atezolizumab, and SNK01 autologous NK cell product from NKGen respectively. Furthermore, when we looked into tumor biopsies by immune histochemistry and gene expression profiling, translating the findings from the peripheral blood to the tumor, we saw that NK cells and cytotoxic T cells increased in the biopsies of AFM24 treated patients indicating that cytotoxic cell function of both NK and T cells are increasing significantly. On Slide 13 for AFM28, we announced an abstract at ASH which will describe the preclinical in vitro models using a panel of AML lines showing efficiency and antibody dependent cell mediated cytotoxicity against CD123-positive tumor cells by a combination of allogeneic NK cells and AFM28. As shown on Slide 18, with monotherapy and NK cell and combinations, we can initially address the needs of about 3,500 patients in the U.S. only and indeed far more when developed in the EU and Japan with relapsed and refractory so you get CD30-positive Hodgkin and peripheral T-cell lymphoma. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}