{
    "symbol": "AFMD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 15:04:05",
    "content": " Our commercial analysis as well as insights from our work on AFM13 with NK cells strongly now suggest that we can deliver more benefit to CD30-positive lymphoma patients with this approach, including Hodgkin lymphoma and T-cell lymphoma patients. Today, we can share with you that the data Artiva has seen so far from the AV-101 rituximab combination study looks quite encouraging, particularly given that several patients are relapsed or refractory to prior CAR-T cells. As we show on Slide 10, at ASH in December 2022, we reported data from the Phase I/II study of AFM13 combined with cord blood-derived NK cells that we are conducting in collaboration with investigators at MD Anderson, in patients with relapsed and refractory CD30-positive lymphomas. Specifically, 63% of the 24 patients treated at the recommended Phase II dose and who had at least 6 months of follow-up at the data analysis remained in complete response for 6 months. In summary, the data from the study demonstrated that the combination of AFM13 with national killer cells is highly effective and well tolerated for patients who have limited or no other treatment options. At our company event during ASH, we already presented top line data showing that AFM13 is active as a single agent in pretreated patients with peripheral T-cell lymphomas and is well tolerated. For the monotherapy study, AFM24-101, the company expects to present data from approximately 15 patients from the non-small cell lung cancer and the colorectal cancer cohort. The second combination of AFM24 is investigating the combination of AFM24 with SNK01, the ex vivo expanded and activated autologous NK cell therapy from NKGen biotech, both given weekly to patients with non-small cell lung cancer,  neck and colorectal cancer. So the 203 study has a separate cohort that enrolls peripheral T-cell lymphoma patients, tries to -- are always looking for the response rate also in peripheral T-cell lymphoma patients. Based on the limited data that we have seen in these 4 patients at MD Anderson, we believe that also peripheral T-cell lymphoma is an indication that will benefit from the combination of NK cells and AFM13."
}