{
    "symbol": "TASK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 21:12:05",
    "content": " For the full year 2022, we achieved $960.5 million in revenue and $223.2 million in adjusted EBITDA for an adjusted EBITDA margin of 23.2%, again above the top end of our guidance ranges. If we excluded the impact from our largest client, this quarter's trust and safety revenues would have grown by 8% compared with Q4 of 2021. They have turned to us for our expertise on trust and safety research, proactive and reactive classification, flagging of transformation trends and policy enforcement AI services revenues grew 20.1% in Q4 compared with Q4 of 2021, driven primarily by expansions with existing clients in the autonomous vehicle, social media and travel and transportation spaces. We ended the year with an annual net revenue retention rate of 114%, and our current pipeline is the largest it has ever been, including opportunities for expansion with existing clients, new client engagements, and large transformational deals. In our press release issued this afternoon, we indicated revenue of $965 million at the mid-point of our guidance range, and adjusted EBITDA margin of 23% and free cash flow generation of at least $100 million, excluding the earn out payment associated with the heloo acquisition that we completed in the second quarter of 2022. At the same time, a number of our clients continue to reduce the size of our team supporting them from the U.S. decisive impact in Q1 of 2022, 33% of our revenues came from U.S. delivery. We continue to win exciting new clients for our U.S. operations like the two healthcare clients that I mentioned earlier who rely on our U.S. teams for sensitive and regulated processes, but itâ\u0080\u0099s clear that the growth engine of our business in the years to come will be our efficient offshore operations in the Philippines and India, nearshore operations in Colombia and Mexico, and our digital automation capabilities. In the fourth quarter, we earned total revenues of $242.2 million, an increase of 6.8% over the prior year, leading to total revenues for the year of $960.5 million, and growth of 26.3% higher than the top end of our guidance range. Our trust and safety business declined 5.1% compared to Q4 of 2021, resulting in $42.3 million of revenues, driven by the offshoring of volumes from our largest client. In Q4 of 2022, our top 10 and top 20 clients accounted for 58% and 71% of our revenue respectively compared to 60% and 75% in the prior year as of trend of revenue diversification continues. We expect to earn a full year 2022 adjusted EBITDA margin of approximately 23%, and we are confident we will achieve over $100 million in free cash flow in 2023, excluding the earn-out payment associated with the heloo acquisition. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Hey, thanks for taking my question. Given these trends, before we provided our guidance we did a detailed review of our entire U.S. business and we struck a cautious tone in today's guidance, taking the percentage of revenues coming from U.S. delivery in the back half of 2023, down to 15% of total revenues at the midpoint. Please proceed with your question. Hey, thanks for taking my question. Please proceed with your question. Please proceed with your question."
}