{
    "symbol": "TASK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 22:40:04",
    "content": " After going through the details of our Q3 performance and briefly highlighting our updated full year outlook, I'll discuss our current outlook for the start of 2023 given the recent strong sales performance, the current macroenvironment and our clientsâ\u0080\u0099 volume projections. Starting with growth with our current clients, in Q3, our top 20 clients increased their spend year-over-year by more than 5%. Revenues in this service offering declined 3.2% compared with Q3 of 2021, driven by the impact from our largest client moving work to our locations in the Philippines and India. If we excluded the impact from our largest client, this quarter's content security revenues would have grown 26% compared with Q3 of 2021. AI services revenues grew 21% in Q3 compared with 2021, driven primarily by expansions with existing clients in the social media and autonomous vehicle spaces and new client signings. Looking at overall signings, our engagements this quarter were again driven largely by growth from existing clients, which accounted for over 70% of total new business signings in Q3. This combined with the cost focused shift our clients continue to undertake by moving work from our onshore operations to our offshore delivery centers, will continue to weigh on revenue for the next few quarters. We've driven significant growth in all of our offshore delivery locations, signed engagements with three of the biggest technology companies in the world and expanded our addressable market by providing digital transformation to more stable enterprise clients, all while continuing to take share in our core high growth technology client base. In the third quarter, our digital customer experience offerings generated $151.5 million for a year-over-year growth rate of 20.9%. Our content security business declined 3.2% versus Q3 of 2021, resulting in $43.9 million of revenue and our AI services business grew 21% year-over-year for revenues of $36.7 million."
}