{
    "symbol": "BLBD",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-12 21:25:07",
    "content": " Adjusted EBIT was negative $15 million, but free cash flow was up $39 million year-over-year as throughput increased in the back half of the year and we drastically reduced inventories. The strength in our EV business is evidenced by the fact our bookings are up 84% year-over-year and we recently crested over 850 electric school buses on the road today, including Type A, C and D. As we have discussed in previous quarters, we have raised pricing by 25% since July of â\u0080\u009821, which is aided in doubling our standard gross margins in the backlog since the start of our fiscal year. Consolidated net revenue of $258 million was $66 million or 34% higher than prior year, driven primarily by higher mix of electric buses and pricing actions that are starting to take hold. Consolidated net revenue of $801 million was $117 million or 17% higher than prior year, driven by pricing actions that started to take hold, especially in the second half of fiscal â\u0080\u009822. The adjusted free cash flow was negative $23 million and still $39 million higher than the prior year, driven by the reduction in inventory back to normal levels by the end of Q4. Breaking down the $801 million in revenues into our two business segments, the bus net revenue was $724 million, up by almost $100 million versus prior year. In fiscal â\u0080\u009822, adjusted net income was negative $36 million or $45 million lower than last year. Starting on the left of $34 million, slightly higher bus volume of 143 units and increased parts margins generated a positive $8 million improvement year-over-year. However, the material costs, including steel increased by $72 million year-over-year and supply chain disruptions and higher freight costs generated operating inefficiencies of $51 million. SG&A and engineering expenses, excluding restructuring expenses, were each $4 million higher than last year due to labor cost increases versus extraordinary COVID related cuts in prior year and Blue Bird reinvesting in engineering projects to ensure our future growth in EV and chassis and to maintain our leading product competitiveness. If you add back the operational inefficiencies driven by the supply chain of $51 million and the year-end non-cash inventory charge of $9 million, our results have been $45 million or $11 million improvement versus the prior year. We estimate this headwind to be approximately $10 million for fiscal â\u0080\u009823, Q1 or 5% on approximately $200 million in revenues. Looking at fiscal â\u0080\u009823, Q1, our normal year historical results are around $5 million as this quarter has a lower number of production days and sometimes seasonally labor-related higher expenses related to calendar year-end. Finally, in fiscal â\u0080\u009823, Q4, with higher volume, increased EV mix, best pricing and lower material costs, we expect to generate $250 million to $280 million in revenue with adjusted EBITDA of $20 million, plus/minus $2.5 million. Putting it all together for the total year, we expect revenues in the range of $900 million to $1 billion and adjusted EBITDA of approximately $40 million with a range of $35 million to $45 million. We expect in summary, a significant improvement year-over-year in all aspects, with revenues up approximately 20% of $900 million to $1 billion, adjusted EBITDA of $35 million to $45 million and positive free cash flow of $0 to $10 million. However, if you look at the second half expected results from the prior page, it shows a full year run rate of $70 million of adjusted EBITDA on revenues just above $1 billion, which is back to the recovery top level of performance and set us up for taking it to the next level in fiscal year â\u0080\u009824 and beyond. Once the supply chain further normalizes, we expect to sell approximately 9,500 units, including 1,500 unit EVs and generate $100 million or 8% adjusted EBITDA and $1.25 billion in revenues. Looking beyond that, in the medium-term, our EV growth and operational improvement can support volumes of 10,500 to 11,000 units, including EVs in the range of 2,500 to 3,500 units, generating revenues of $1.5 billion to $1.75 billion, with adjusted EBITDA of $150 million to $200 million or 10% to 11%. The EBITDA performance, we expect to be up over 350% compared to fiscal year â\u0080\u009822 and to be approximately $40 million."
}