{
    "symbol": "ENTA",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-07 22:12:06",
    "content": " Beginning with our COVID-19 program, our lead asset is EDP-235, the clinical stage, once-daily, orally dosed inhibitor of the coronavirus 3CL protease, which is currently being evaluated in an ongoing Phase 2 study known as SPRINT. Based on the study design and previous clinical data demonstrated in our Phase 1 study for EDP-235, we aim to achieve good safety, tolerability and pharmacokinetics to support once-daily dosing. We look forward to presenting the detailed findings of our Phase 1 study for EDP-235, the results of our ferret model study and two other preclinical posters at the International Conference on Antiviral Research, or ICAR, in March, along with preclinical data at the European Congress of Clinical Microbiology and Infectious Disease, or ECCMID, in April. Again, we are thrilled with the progress of EDP-235 for the treatment of COVID-19 and plan to announce top-line data from our Phase 2b study, SPRINT, in May and pending results initiate a Phase 3 study in the second half of this year. The doses that weâ\u0080\u0099re selecting in our SPRINT study for evaluation either of those we believe can ultimately be formulated into single tablet, which could be one pill once a day based on the pharmacokinetics that weâ\u0080\u0099ve observed in Phase 1 healthy clinical trials. But I think hopefully itâ\u0080\u0099s set up to give us what we need to know about safety and tolerability between doses, look for trends in the virology between the doses and anything else we can get out of this study is gravy, so to speak, as weâ\u0080\u0099re planning Phase 3 studies. And then assuming that the data are good, you can think about â\u0080\u0093 probably, the quickest way to get any viral data would be to do a challenge study, which you can also use to check antiviral effect, you can look at symptoms, and you can also further would find any dose decisions that you might be wanting to make for other more advanced studies. So  has an ongoing Phase 3 trial now thatâ\u0080\u0099s looking at a symptom endpoint, and they had shown data from their other Phase 3 trials being run in Asia where they did see a significant effect on symptoms looking at a subset of five symptoms that were shown in their Phase 2b study to be more correlated with an effect."
}