{
    "symbol": "CCRN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 01:20:27",
    "content": " Our solid topline performance combined with improved productivity and operational efficiencies fueled another quarter of strong earnings with adjusted EBITDA of nearly $64 million representing a margin of 10%, making it the fourth quarter in a row of delivering double-digit adjusted EBITDA margins. Regarding to fourth quarter revenue of between 590 and $600 million, representing a sequential decline of 6% to 7% driven predominantly by the anticipated decline in travel bill rates, partly offset by growth in our education and the impact of our recent acquisitions from Mint and Lotus. And so, because there is such a widespread between the demand and supply imbalance, there's a lot of volatility that could happen in next year, but as of now, this $2.2 billion of revenue is the floor we see and we do think that there is potential upside to this, but we're also cautious to say that there could be some headwinds of macroeconomic trends that could impact that. A.J., this is Dan. A.J., this is Dan. I would just add that also with the acquisitions of Mint and Lotus, that's really helped us create more capacity than we've had before, and that business if we look at where that business is trending Brian, it's going to be roughly $150 million business, giving us more capacity to help us be able to bring that offering to our clients in a larger scale than we could have ever done before. And so, if you think about Intellify for example, that's set to save us millions of dollars in the last -- in part of the third quarter and going into the fourth quarter, we've already begun the conversion of a number of accounts and have gotten north of $100 million in spend, actually migrated onto the platform that's going to drive annual savings just from what we've already migrated over $1 million annually. If we look at or WSG or Workforce Solutions Group that works in the pace centers and home health, that's a business that is also going to be north of $100 million and that's a higher margin business as we continue to invest in those other peripheral businesses of ours that grow -- as we're getting them to grow at a faster rate, that will help drive gross margins."
}