{
    "symbol": "CCRN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 23:04:04",
    "content": " Turning to the fourth quarter, consolidated revenue was $620 million approximately 5% above the upper end of our guidance, while adjusted EBITDA of $57 million was at the upper end of our guidance range representing a 9.1% margin. Looking at the first quarter, we expect revenue to be between $590 million and $600 million, which remains well above the level needed for us to achieve our minimal full year revenue target in 2023. As a percentage of revenue, SG&A was 12.9%, representing an increase of more than 250 basis points over the prior year, given the decline in fill rates as well as the increased investments necessary to support the volume growth in our business. Our effective interest rate for the quarter was 8.8%, which would have been higher had we not opted to make the $50 million prepayment on our subordinated term loan at the start of the fourth quarter, bringing the full year optional prepayments to $100 million. Finally, physician staffing delivered another strong quarter with $37 million in revenue, representing an 84% increase over the prior year and 56% sequentially. Also in the fourth quarter, we've prepaid an additional $50 million on the term loan bringing the cumulative pre payments for the year to $100 million or roughly 60% of the principal balance for that instrument. And this brings me to outlook for the first quarter, we're guiding to the first quarter revenue to be between $590 million and $600 million, representing the sequential decline of 4% to 6% driven predominantly by the anticipated decline in travel bill rates, partly offset by growth in education and the impact from recent acquisitions. But the market with the demand is we've seen it starting to pull back coming into the first quarter, bill rates are down certainly on open orders is what I look at as a leading indicator relative, that's where I kind of made the comment in the prepared remarks that on the open orders, we're seeing bill rates starting to soften in that 5% to 10% neighborhood. But I would just leave you with, we look at the full year we reiterated the full year minimum guidance and that $2.2 billion number that we throw, out there we're well on pace for that certainly coming through the first quarter. We really look at it from a portfolio basis as you were saying, Brian, we're looking at locums and from the nurse and allied travel standpoint on the transactional the day to day deals that we're doing, we're not anticipating to see a large uptick in gross margin, there's a bit of some obviously room for improvement over the next several quarters of this year that will pick up. As I've said, it's probably a similar play out to Q4, which is a down low mid-single, and then that the rest of that rate decline plus the impact from the broader market is more likely to be seen in Q2, all things being equal, I don't, that, if rates do continue to decline, we don't anticipate them to have steep declines after our second quarter, I think they start to really, start to be at the near the bottom, there might be a little bit of pressure into the back half."
}