{
    "symbol": "ISPO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 14:33:11",
    "content": " These warrants have an exercise price of $2.00 per share and based on Saks successfully converting their digital and in-store customers to paying Inspirato subscribers, Saks may exercise these performance warrants to acquire up to a cap of approximately 15% of Inspirato's current total shares outstanding. In terms of total revenue, we expect to generate between $350 million and $370 million, a much more modest growth rate of approximately 4% at the midpoint compared to the 40%-plus growth in both 2021 and 2022. To illustrate the operating leverage of our existing member base and residence portfolio, we project that adding only one incremental paid travel night per subscriber would consume approximately 9% of our projected availability, while still leaving us well below our 2021 total occupancy. Assuming a 30% discount to the average paid ADR of our current 12 months forward bookings in residences, our reservations currently in place for the year, this would equate to more than $20 million of incremental in year high margin travel revenue. The $7.5 million of combined sales across these two new platforms over the past period of time is a solid start, but only part of the story considering these thousands of travelers will be introduced in Inspirato and represent a highly targeted membership conversion opportunity. After two consecutive years of 40%-plus growth, we have built a plan that projects $17 million of adjusted EBITDA improvement at the mid-point of our 2023 range and sets the table for long-term and sustainable profitability. Full year revenue for 2022 was $346 million compared to $235 million in 2021, with the 47% increase in annual revenue marking Inspirato's highest level since 2014. Travel revenue for the fourth quarter and full year 2022 was $47 million and $200 million, respectively, compared to $39 million and $135 million for the comparable 2021 periods. In terms of responding to your question on the mix of revenue embedded in our guidance derived from subscriptions and to travel, the first thing I would highlight is the emerging pipelines that Brent referenced, $7.5 million already in sales to-date in our Inspirato for Good and Inspirato for Business. And so, using that excess capacity, whether it's through Pass, whether it's through Inspirato for Good, Inspirato for Business, whether it's through loyalty programs, that's the name of the game, getting our occupancy back up to even where it was last year, which still leaves us at least two or three occupancy points where we would say kind of where efficiency and kind of like the low 80%-s and we're talking about running at 70%."
}