{
    "symbol": "OPRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 22:23:03",
    "content": " At the conclusion of todayâ\u0080\u0099s earnings call, I will provide some important cautions regarding the forward-looking statements made by management during todayâ\u0080\u0099s call. In addition, management will discuss certain non-GAAP financial measures today that they believe aid in the understanding of the company's financial results. During the year, we saw an enormous amount of market volatility, temporary headwinds, and a consolidation within our sector. While headwinds impacted our topline results, we also saw the resilience of our business and its ability to continue to maintain strong financial footing as the pharmaceutical industry continued to accelerate its digital evolution. This created unprecedented interest in our company from clients, partners, and multiple strategic parties, aligning with the opportunity and OptimizeRx's platform. I believe this is directly correlated to the tectonic shift in the adoption towards the use of digital health technologies by clients, doctors, and patients. Our gross margin of 62.4% surpassed the high end of our guidance, and we were able to generate nearly $11 million in operating cash flow during the year. Ed will go into more of the financial details shortly, but I maintain we are well-positioned for growth given the health of the business, the team, and the limited number of players who can scale, measure and report in our industry. More importantly, despite the macro headwinds that we've outlined in previous calls, we were still able to win six deals that utilize our AI-driven Real-World data or RWD-AI offering. As a result, we are favorably positioned to see revenue growth and are looking for our topline in 2023 to increase at least 10%, which should also drive improvements to our KPIs by year's end. While we are optimistic that the macro headwinds will begin to subside this year, then there have been positive trends since the mid-2022 trough, we are taking a more conservative approach to guidance this year given the macroeconomic backdrop despite having a higher revenue backlog at the start of the year as compared to previous years. Operationally, our technology investments, partnerships, and small tuck-in acquisitions have created a robust single-stop omnichannel offering that's driving a superior ROI for the brands that we serve. To complement this, we have been expanding service offerings outside of the EHR, which we believe will result in us capturing a greater portion of the available industry white space over the next three to five years. With total industry digital spend at more than $10 billion and growing, the white space in which we sell into remains fast, even for the brands with which we are currently working. While this did create a longer sales cycle in 2022, the end result is that after a short trial period, new entrants are being quickly weeded out from the ecosystem in which we compete. Initial solution evaluations of new entrants have been less than stellar due to offerings lacking meaningful connectivity and interoperability, which is really the foundation of our platform and enables us to address fundamental prescription issues facing HCPs and patients. As market demands continue to grow in complexity, along with continuous adoption of point-of-care solutions, coupled with actionable insights, our investment priorities shifted to provide our clients with enhanced reporting capabilities as supported by a recently established exclusive partnership with MMSI, an industry-leading data-enabled agency. While looking for these solutions to deliver more impactful results by not only identifying patients known to HCPs, but also pinpointing new patients for the therapies. We believe smarter solutions, such as our RWD-AI offering, will capture the lion's share of the pharma spend, particularly with legacy commercial dollars that are reallocated to digital. RWD-AI has the added benefit of moving us from being a tactical player with pharma to a bigger strategic partner where we can benefit from a top-down push by decision-makers, while obtaining stickier revenue streams with stronger margins and a greater overall growth potential. With that, I'd like to turn the call over to our CFO and COO, Ed Stelmakh, who will walk us through the financial details for Q4. As with all our calls, the press release was issued with the results of our fourth quarter ended December 31st, 2022. A copy is available for viewing and may be downloaded from the Investor Relations section of our website, and additional information can be obtained to our forthcoming 10-K, which will be filed in the coming days. Turning to our financial results for the fourth quarter ended December 31st, 2022. Our reported revenue for the period was $19.7 million, a decrease of 3% from the $20.3 million we recognized during the same period in 2021 as pharma tightened its first strength around end of year biopsy. This increase in expense is primarily due to the investment in the OptimizeRx team to enable future growth, which also includes our April acquisition of EvinceMed. Providing more color around our year-over-year increase of OpEx, $1.4 million of the $1.5 million year-over-year increase was tied to stock-based compensation and non-cash expense, with the remaining amount being primarily related to the EvinceMed acquisition. We had a net loss of $325,000 in the fourth quarter of fiscal 2022 as compared to a net income of approximately $623,000 during the same period in 2021. For further details on our fiscal 2022 results, you can refer to the MD&A section of our upcoming 10-K. On a non-GAAP basis, net income for the fourth quarter of 2022 was approximately $4.4 million or $0.25 per fully diluted share as compared to a non-GAAP net income of approximately $4 million or $0.22 on a fully diluted basis in the same year ago period. Our balance sheet remains strong with cash, cash equivalents, and short-term investments totaling $74.1 million as of December 31st, 2022, as compared to $78.8 million as of September 30th, 2022. As a reminder, we announced a $20 million share repurchase program during the second quarter and during the fourth quarter, we bought back 508,000 shares for $7.5 million at an average price of $14.68. This amounts to a nearly 7% reduction in our total outstanding shares from 18.3 million to 17.1 million, a net positive for our shareholders. In terms of our revenue outlook for the full year of 2023, the company expects revenue to increase at least 10% year-over-year and we expect first quarter revenue to come in between $11.5 million, $13 million. Now, let's turn to our KPIs for 2022. Our operating model has remained resilient in the face of 2022 challenges with the revenue per FTE coming in at $606,000. Operator, now let's move to Q&A. It looks like based on the Q1 guidance and the full year, you expect a drop in revenue of about 11% year-over-year in Q1, but still looking for 10% year-over-year growth. And then the level of conviction you have in given -- getting that 10% plus growth kind of given the slower start to the year and maybe some commentary on backlog getting you there, kind of, what's signed to be implemented or any visibility to help us kind of triangulate in there? So, as far as the cadence of concerns, as you know, the vast majority of our revenue comes in, in the second half of the year. But we're coming out of the RFP season with a backlog that's stronger than we had in the past, as Will had mentioned. We do have a line of sight to opportunities that we feel will get us to at least 10% growth rate this year, but it will definitely see more towards the back end of the year. Typically, where we sit every year and looking forward in Q1 every year is between, I would call it, between 40% and 60% range of line of sight for the rest of the year. So, somewhere within that range is our line of sight for 10% growth rate going into this year. Yes, we had one client not really drop out, but it's a part of normal churn within the smaller portfolios of certain clients. So, we had one client that was generating a small amount of revenue that's just part of the normal cycle. Sometimes clients will come in, sometimes they will come out, but there's no real drop in of our services and solutions within any declines. Just what do you see in the market in regards to pharma's view on engaging providers at the point-of-care, you know, with digital solutions. Two, there's just been so much awareness built over the last 18 months, a lot of piloting, a lot of trying and pharma is very good at getting to the companies that can scale and leading in heavy there. So, just based on the conversations we have, based on the relationships we have, the trust we've built, well, yes, we said it got cluttered for the last 18 months post-COVID. That clutter is going to start to fade away because if you can't report, scale, and do it with the type of team that delivers it in a way that is at par excellent for pharma, you just won't -- you won't be at the table. So, I would say, net-net, those conversations are all going really well, and anything we've done at that table to-date has performed and they're back with us for more. So, net-net, good macro still have the headwinds internally, their turnover is slowing, FDA is still getting back on their feet, and obviously, the macro world we're still dealing with interest rate hikes. I don't know if that's a fair statement, but love to hear on those two. On the competitive front, most of the competition, other the ones that we've talked about have come in by connecting to various different pieces, but really don't have the reach of the full network like we do. They're not directly integrated, it's always a Tier 2 relationship. That's going to -- to your second question, that's going to really limit them on measurement just because when you're going through someone who's going through someone, you're going to lose some of that data and -- or you may not get it at all. So, I think that's what we've seen. So, net-net, while it was crowded last year, still working itself through, we see a pretty clear path to being a unique data set, especially since we've layered on RWD-AI, which none of the others can do and that response from the client has just been tremendous. And those that do have scale, some of the ones that -- other ones, the companies that you cover, they generally have a pretty strong ROI and they can actually measure it. But given how we are integrated, it's very straightforward for us to do. Just going back to the guidance, maybe if you could just give us some help reconciling the statements from the Q3 call. It appears based on what you've announced, you're executing on it but guiding to less than 20%. So, you put the two together and I think it's a lot better to be conservative and work real hard to exceed, and that's our goal. But just remember, we didn't have a pipeline this time last year. I think one of the things that's driving this for us is, we've got a really solid team of clinicians, people who've got clinical experience and have practice, two of which are MDs that are driving the patient architecture. So, that's a really unique differentiator. So, most of this work is being done in the top 20 and so they're taking work that we're doing and then adding on to it. So, it wasn't all captured before, so there's more that will get converted within this year. Will, last quarter, you pointed a 20% revenue growth fueled by that RWD-AI wins alone. So, obviously, we're a little surprised by the 2023 outlook. No, we -- look, in Q3, we said we could get up to 20% growth if everything went our way. So, it's not like it's a new thing. We're closing new deals on better solutions, which basically pull in the other solutions, which make for a more strategic relationship with the client. It's taken longer for them to make decisions, but their decisions are going to be bigger. And I think it's true actually, from what I'm being when I'm with the clients -- peers. So, no drama here, being conservative, want to be able to build up the year in a good way. Yes, I think we did not only a buyback with the company's money, but also the senior team did a buyback, too. Look I should highlight everyone has choice in this market with unemployment where it is and the amount of new solutions that need good leaders, and we've had no turnover in our company. So, not that doesn't mean that everyone is hitting on everyone which they share with us. But I think that's a telltale Stephanie, that we've got a lot of conviction and we're being smart in a market that requires you to be a lot smarter and a lot more careful with what you tell that we're all going to do. So, we're going to focus on our growth drivers through the year. You're going to see the growth in other solutions because we're getting some good traction there around helping different types of client sets and we don't -- we're in no financial trouble at all, generating cash at this size business. But I was hoping maybe just to get a better sense of just the architecture of 2023, and it's just not financially, but I'm thinking fundamentally as well. And then as you kind of roll that forward, if you apply that to your base, it looks like you got to add about $15 million or so to hit your revenue guide for at least 10%. And how do you want us to think about how much of that would fall in kind of to the ordinary cadence of the business in terms of new bookings and fees that you're going to get from architecture fees from the RWD-AI deals that you've already signed, et cetera. So, obviously, with the less than stellar year in 2022, we're now capturing the full year impact of that versus 2021, which had a very strong year. So, year-on-year comparison basically is skewed by that dynamic. As the year -- as 2023 gets better, obviously, you should see an impact on those metrics and you see the recovery in that metric. I don't know if you think about it in those terms at all, but just wondering if -- because I think you had some losses right towards the beginning of the year, and just wondering if that number changed much in your mind as you were thinking about next year as the year went on as 2021. Yes, I don't know if we really kind of get to that level of detail in terms of underlying good quarters. But since that metric hits the top 20, you'll see the bulk of that decline driven within that portfolio of clients. Yes, to your second part of the question, how much of the additional revenue for growth this year is sort of ordinary. It's -- clearly, RWD-AI is going to be a piece of that growth, but we also had projects last year that were pushed into this year. So, that is part of that as well and that's already rolling. And then we've also, just given the differentiation of RWD-AI and we did some pretty aggressive marketing among the agencies that advise pharma as well as direct-to-pharma. We're just seeing, as we said, a big pipeline there building. We don't talk about the number, but it's -- we didn't have one last year. So, that gives us more confidence in the year of closing on this kind of offering because we now have measurement to put against it. So, those things combined should give us that additional revenue needed for the at least 10% growth. Yes, this year, we do not have one we're dealing with that is material to our revenue. Steve, do you have any other comment on that, but it's not something we -- it's not a headwind this year. Yes, nothing this year to impact us negatively on current programs at all, a couple next year, but they're sort of latter part of next year and not larger programs. So, great question, something we're always looking at. I guess you already fielded a lot of questions on the guidance, but maybe just there's one more here. So, there's some potential upside there from my view. But Steve, do you want to talk to the sort of the cadence of it through the year. As you've heard from Will and Ed, the pipeline is pretty robust for this particular portion of our portfolio. In terms of clocking of the deals, I think the first half will look pretty good in terms of closing out some additional RWE deals. So, those will continue to generate revenue throughout the remainder of the year. And of course, because they're being driven by the models, the messaging will be more frequent higher volume, but more targeted. We -- obviously, we've talked a lot about channel. We spent the last five, six years building it out to really focus on the physician HCP that pharma finds it hardest to reach that connects and overlaps with specialty medications, which are complicated and expensive for patients. So, the good news on this is it's a commercial execution year. That doesn't mean we're not going to add more partners, but incrementally, they won't be as dramatic as years past. Let's not just deliver information to physicians when they're a point-of-care, but let's think of social, let's think of all the other places where physicians are, and we can actually see them and track and measure. So, net-net, it's just under 30% capacity and our utilization rather and lots of new channels in terms of the omnichannel approach coming to market this year. As Will said, the environment of digital spend is a little bit more cluttered this year, meaning 2022, coming into 2023 than it has been in years past. And so that's, I think, good news for the stable companies like OptimizeRx and others. And then I think in terms of leaning in to this general point-of-care, I think it's expanding a lot more in terms of what point-of-care the definition is. We see now more companies leaning into following the doctor, which is not just in the EHR, but as Will as said, and you heard Ed say as well, giving the doctor the information that they need, where they are, wherever they are. We're in a really good place in terms of that because right now, we're the only business that's got the ability to use an RWD-AI model at point-of-care that's integrated to drive that and expect action in a real way. So, it's a good position to be in, but excellent question. Yes, I wanted to focus on the Q1 outlook here with the midpoint down about 11% for the quarter. But I just wanted to focus on kind of January, February versus January, February a year ago. Having said that, we saw a plethora of RFPs come in more than we've seen in years past. So, the initial buying signs, as you've heard on this call, are very positive, leading us to kind of an optimistic full year view. You heard us talk about the backlog, which I think we've probably shared that's a degree of optimism that we universally feel given where we're at. And so we're not looking at it just in terms of Q1 projected performance, but full year and using that as our sort of our guiding with  here on the year. But like the January, February, is there any kind of an uptick as of the end of February or beginning of March that baked into this minus 11% in the quarter. Yes, I mean we're not going to give sort of guidance on the quarter outside of what we've already done, Eric. But I think we can say we've got two components that we're looking at, right, recognized revenue as a form of what we report and the backlog in terms of forward-looking success. But I will say that the lean -- we're seeing, we're seeing it through RPs, we're seeing it through what we have in backlog, we're seeing it through conversations, and seriousness of some of our partners at the agency level looking at much bigger engagement. And then, Ed, you talked about -- I think the Q4 GAAP operating expense was $13.3 million, what should we think about for operating expense for Q1? But what I can tell you is there will be probably an uptake, just given the fact that we are setting bonuses for the year. So, we're in an industry that is truly entering a generational paradigm shift in the way technology enables and drives better patient care and outcomes. I say this as a backdrop, given the importance of our businesses move from tactical to strategic deals, which are growing increasingly larger in value. That said, we truly believe that we have the right platform in place to deliver on the promise of improved outcomes, utilizing our solutions, in particular, RWD-AI. Moreover, our robust portfolio of omnichannel services are expanding outside of the EHR, and we continue to improve patient outcomes while driving our strong ROIs for our customers. We've also built the team and a culture as a company, which gives us a distinct competitive advantage as we focus on our clients, partners, and investors. In 2023, we have our financial and operational goals firmly underpinned by our best-in-class platform and the ability to access distribute and use the next generation of real-world data-enabled insights across the largest in workflow point-of-care network in the US. As such, we look forward to making a positive impact across our pharma prescriber and patient stakeholder base for the years to come. We want to thank everyone, employees, shareholders, customers, and partners alike as we continue to build out our solutions on a one unified omnichannel platform and look forward to reporting on our progress on our next earnings call and several investor conferences. Before we conclude today's call, I would like to provide the company's safe harbor statement that includes important cautions regarding forward-looking statements made during today's call. Such forward-looking statements in this call include statements regarding estimation of total addressable market size, market penetration, revenue growth, gross margin, operating expenses, profitability, cash flow, technology, investments, growth opportunities, acquisitions and upcoming announcements. The company undertakes no obligation to publicly update or revise any forward-looking statements, whether because of new information, future events or otherwise forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Risks and uncertainties to which forward-looking statements are subject to could affect business and financial results are included in the company's annual report on Form 10-K for the quarter ended December 31st, 2022. Before we end today's conference, I would like to remind everyone that this call will be available for replay via webcast only starting later this evening, running through for a year."
}