{
    "symbol": "SPH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-04 14:45:22",
    "content": "  Operator: Good day, and welcome to the Suburban Propane Partners Third Fiscal Quarter Results Conference Call. Our conference call contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, relating to the partnership's future business expectations and predictions and financial conditions and results of operations. We have listed some of the important factors that could cause actual results to differ materially from those discussed in such forward-looking statements, which are referred to as cautionary statements in our earnings press release, which can be viewed on our website at suburbabpropane.com. Our annual report on Form 10-K for the fiscal year ended September 25, 2021, and Form 10-Q for the period ended June 25, 2022, which will be filed by the end of business today, contain additional regarding forward-looking statements and risk factors. In the face of many challenges in the broader economy, creating headwinds for our business and propane industry as a whole, we delivered strong operating performance and several strategic growth initiatives in the third quarter, both in our base propane segment and with our recently launched renewable energy platform. Tightness in the labor market, in particular, for qualified CDL drivers in service technicians, creating hiring challenges and higher labor costs, inflationary factors increasing the cost of vehicles, tanks, diesel fuel and many operating costs and the impact of overall inflation on the consumer, which is delaying collection efforts as customers are managing their household spending budgets. I'm extremely proud of our operating personnel who continue to do an outstanding job in safely meeting the needs of our customers and staying focused on our customer base growth and retention initiatives, while effectively managing selling prices power levels and expenses. Additionally, our supply investment continue to do a great job ensuring adequate supplies of inventory and managing price volatility through our risk management activities, which have supported our overall margin performance and ability to offset some of the inflationary factors. With the improvement in earnings, we used excess cash flows to reduce debt by more than $43 million, bringing our consolidated leverage ratio down to 3.64x from 3.96x at the end of the prior year third quarter. In addition to the improvement in earnings, we had a very active quarter on the strategic front as we continue to advance the build-out of our renewable energy platform in support of the country's ongoing energy transition towards a lower carbon future. Specifically, at the end of April, we had a ribbon-cutting ceremony at our customer service center located in Anaheim, California, as we launched the first-ever commercial sales of propane plus RDME, which combines a clean, versatile and abundantly available propane with low carbon benefits of renewable dimethyl ether, which is produced by over on fuels our minority-owned subsidiary."
}