{
    "symbol": "SPH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-05 12:38:03",
    "content": " Despite a challenging operating environment resulting from an erratic weather pattern, historically high commodity prices and inflationary factors impacting expenses, we were able to expand our customer base and effectively manage margins and expenses to deliver an improvement in adjusted EBITDA compared to the prior year second quarter. To be consistent with previous reporting as I discuss our second quarter results and excluding the impact of unrealized mark-to-market adjustments on our commodity hedges, which resulted in an unrealized gain of $33 million for the second quarter compared to an unrealized gain of $1.6 million in the prior year. Excluding these items, as well as the non-cash equity earnings of Oberon Fuels, which is an unconsolidated subsidiary accounted for under the equity method, and a non-cash pension settlement charge in the prior year, net income for the second quarter was $142.8 million or $2.26 per common unit, compared to net income of $126.3 million or $2.1 cents per common unit in the prior year. Excluding the impact of the mark-to-market adjustments on our commodity hedges that I mentioned earlier, total gross margin of $316.1 million for the second quarter increased $12 million or 4%, compared to the prior year. Interest expense of $15.3 million for the second quarter was $2.8 million or 15.7% lower than the prior year due to refinancing of two tranches of senior notes at lower rates at the third quarter of fiscal 2021, as well as a lower average level of outstanding debt. Total capital spending for the quarter of $11.6 million was $3.2 million higher than the prior year, primarily due to the acquisition of several properties in growth markets that were previously leased, and from the impact of higher steel prices and our purchases of tanks and cylinders to support customer growth. If you look at our trailing 12 months, we're generating over a $100 million of excess cash flow and as we've demonstrated in the second quarter, we really take a balanced approach towards deploying capital, investing in growth, but also still getting to a point where we get to our target level of leverage which is in the mid three-time."
}