{
    "symbol": "SPH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-03 15:13:08",
    "content": " Coming into the first quarter of fiscal 2022, the propane industry was faced with highly publicized concerns over lower U.S. inventories, significantly higher base commodity prices across the entire energy slate and an expectation that consumers could be facing much higher cost to heat their homes and businesses in the impending heating season. However, as our first quarter progressed, a combination of lower than average crop drying demand in the agricultural sector, lower export activity and near-record warm temperatures in the month of December 2021 which muted heat-related demand, all contributed to a near normalization of U.S. propane inventories and a pullback in propane prices by about 33% from their peak levels. At Suburban Propane, we were able to offset the impact of lower heat-related demand during the first quarter and certain inflationary factors driving higher operating costs with effective selling price management and a prudent hedging and risk management strategy in a very volatile commodity price environment. To be consistent with previous reporting, as I discuss our first quarter results, I'm excluding the impact of unrealized mark-to-market adjustments on our commodity hedges which resulted in an unrealized loss of $33.5 million in the first quarter compared to an unrealized gain of $4.9 million in the prior year. Excluding these items, as well as the noncash equity and earnings, Oberon Fuels which is an unconsolidated affiliate, net income for the first quarter was $55.4 million or $0.88 per common unit compared to net income of $33.4 million or $0.53 per common unit in the prior year. From a commodity perspective; as we reported on our last call, wholesale propane prices were elevated coming into fiscal 2022 and continue to rise for the first six weeks of the quarter as the nation's inventory levels were tracking well below historical averages for that time of the year. Overall, average wholesale prices for the first quarter were $1.25 per gallon, basis Mont Belvieu which was nearly 120% higher than the prior year first quarter and 7% higher than the prior sequential quarter. Excluding the impact of the mark-to-market adjustments on our commodity hedges that I mentioned earlier, total gross margin of $212.6 million for the first quarter increased $15.6 million or 7.9% compared to the prior year. With respect to expenses, combined operating and G&A expenses of $125.5 million for the first quarter increased $9.4 million or 8.1% compared to the prior year, primarily due to higher payroll and benefit-related expenses and higher vehicle lease and operating costs. Net interest expense of $15.3 million for the first quarter was $2.8 million or 15.6% lower than the prior year, resulting from the refinancing of two tranches of senior notes at lower rates in the third quarter of the prior fiscal year as well as a lower average level of outstanding debt. With that said, we borrowed approximately $44 million under the revolver during the first quarter which is comparable to historical levels but slightly higher than the prior year first quarter due to the impact of higher commodity prices. At the end of the first quarter, our consolidated leverage ratio for the trailing 12-month period was 4.02x which is roughly flat to what we reported for fiscal 2021 and reflects a significant improvement from where we ended the prior year first quarter and is certainly well within our debt covenant requirement of 5.75x."
}