{
    "symbol": "PATH",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-30 18:36:03",
    "content": " This afternoon's call include a forward-looking statements about future events, including statements regarding our financial guidance for the first fiscal quarter of 2023 and fiscal year 2023, our expectations regarding the acceleration of digital transformation, the impact and duration of headwinds and expectations regarding our dollar-based net retention rate and fiscal year 2023 ARR. We ended the fourth quarter with total ARR of $925.3 million, up 59%, driven by record net new ARR of $106.9 million, which grew 72% and exceeded the $100 million mark for the first time. For fiscal year 2023, we have included the impact of pausing business in Russia, which is approximately a $15 million reduction in ARR, of which $5.5 million will be in the first quarter. In addition, at current FX rates, we estimated an ARR headwind of approximately $5 million to $10 million for the first quarter and approximately $20 million to $25 million for the full year fiscal 2023. For revenue, we expect an FX headwind of approximately $10 million to $15 million for the first quarter and $25 million to $30 million for the full year fiscal 2023. Please state your question. Please state your question. Maybe sort of tailing on Raimo's question, so obviously, we're trying to wrap our heads around sort of the juxtaposition of what was a really strong Q4 and seeing even on an adjusted basis, 50% growth in net new ARR. And if I'm doing my math right, the forward guide assumes that $18 million -- or sort of 18% decline in net new ARR for the full fiscal year FY 2023. Please state your question. Please state your question. Please state your question. Please state your question. So, we crossed 1,493 customers greater than $100,000, that’s up 49% last year, that customer bases brought you know, in our minds automation continues to be a really strong, a really strong part of our program. Please state your question."
}