{
    "symbol": "PATH",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-08 23:10:39",
    "content": " We now have 1105 customers that account for at least $100,000 in ARR, up sequentially from 1002 including 104 customers at a million dollars plus up sequentially from 89. Notable new logos and customer expansions during the quarter included; first Verizon Communications, which became a customer in July 2019 to support their attended automation needs. We have expanded the platform with every release that you've seen, task mining, automation cloud, we look at these items in our product roadmap to continue to fuel, really both the acquisition of new logos, as well as the expansion opportunity that's in front of us. Going to GAAP revenue, as I've stated, we're under 606, we did not think that that is a represent -- a really good representation of our business model, as it is impacted both by deployment models, as well as total contract value, which again, we look at that as really driving -- should be driven by customer choice. I would say we still see a -- from an overall standpoint, cloud is a really fast adopting part of our platform, where customers are using cloud components, not necessarily all full SaaS but including our hybrid offering. And if you think about what customers are saying, our customers actually especially those who have previewed, it is not just the capability they want, it helps to see always internally go across departments, go across every single process to find every automated process, which further reinforces the $60 million plus TAM and which we're trying to win that unfair share of. If somebody asked earlier about Microsoft, the one that I always get and I'm sort of curious on your perspective is, the platform vendors, the ServiceNow, the Salesforces of the world is they implement additional native RPA or low code, no code capabilities, how does that impact the market versus, more of a -- sort of a player like yourself that can play across multiple clouds, the hyperscalers, or platform vendors."
}