{
    "symbol": "BEP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 12:28:06",
    "content": " And maybe just a the benefit of the global platform that we have means that we can actually focus on, let's say, if we're seeing more carbon capture opportunities in the U.S. first because they have established well-known storage reservoirs we have the ability to kind of move by geography where we're seeing those risk-adjusted returns. What needs to be done on the carbon capture side is very similar to what needs to be done on the renewable side: one, capital needs to be provided; two, you need development, construction and operating capabilities; and three, perhaps the one that's most important that we bring to the equation here is the ability to work with corporate counterparties to structure long-term contracts around these carbon offtakes that are both financeable and economic. And then now, in addition, we also have BGTF, the Brookfield Global transition fund that focuses on the development and build-out of renewable and clean energy generation and the investment in decarbonization asset classes, services and solutions. Do you see an opportunity to take some of the pipeline because you've got, I think it's the 69,000 megawatts of pipeline potential right now and maybe accelerating the development of that and having that cater to a longer duration, more yield oriented product that maybe isn't appropriate -- completely appropriate for BEP, but it presents an opportunity set as a developer of those assets. I would say, given the rapid growth of our pipeline and our increased development capabilities across asset classes and across regions, we're going to pursue all those things but it's probably going to be different. So while some of those projects that weren't contracted we might delay a little bit until there's easier access to panels, but that's being far outweighed by the increased PPA price we're seeing on the ready-to-build projects that do have panels because those are very scarce assets in the U.S. market today."
}