{
    "symbol": "BEP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 12:08:09",
    "content": " We are fortunate that with the recent acquisitions we have made this year, including Urban Grid, our U.S.-based utility scale solar and storage developer along with the recent acquisitions and growth of our DG business as well as our CCS joint venture and our green hydrogen development pipeline, that we are uniquely positioned to benefit from the bill. And despite recent pressure on development and financing costs globally, buyers of clean energy are generally accommodating of cost increases in the form of higher PPA prices given decarbonization imperatives, energy security tailwinds, as well as the still very favorable economics that renewable power presents. Additionally, with the recent $15 billion closing of Brookfield's Global Transition Fund, we have access to scale capital to invest alongside us, which is a meaningful advantage given increasingly volatile capital markets. Maybe the only thing I would just add, just to add context to the numbers is in the prior quarter, we put out a number of $120 million from the -- over the next 5 years from the benefit of doing that, and it's really 5,500 terawatt hours that we have coming off contract that's available for the benefit of pricing and locking those in on a forward basis at today's -- at the rate at the time would have led to $120 million of benefit per annum. One shift we are seeing in Europe, and it absolutely has room to run is governments are working to reduce some of the obstacles around permitting and building renewables and working to accelerate the process of bringing projects out of the ground and we've seen that across a number of markets in Europe, and that's no doubt benefiting our ability to pull some of those projects forward. So while our business is growing and we are requiring a global scale up of our operations, we're certainly not seeing bottlenecks at this point, but it's something that we absolutely need to stay on top of as we take these, call it, step changes in terms of growth."
}