{
    "symbol": "DOOO",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-01 13:02:10",
    "content": " Looking at revenues, we have adjusted our year-round product guidance to reflect the impact of supply chain constraints on wholesale and the timing in three-wheel production, which is now concentrated more in fiscal ’23 Q1 as we prioritize production capacity and component availability for snowmobiles in Q4. Building on this momentum, we are well positioned to deliver strong growth in fiscal year ’23 as we expect to benefit from numerous key initiatives and ramps, including a sustained strong consumer interest in powersport and marine, the upcoming significant inventory replenishment cycle which is expected to take place over the next 12 to 18 months, the continued robust demand for our product line-up, the first year of the Sea-Doo Switch which is proving to be very promising, and additional production capacity from Juárez 3 and Querétaro. We recognize revenue only when the final components are shipped to the dealer, so as I said in my call, any retrofit units or incomplete units that we ship to the network are actually excluded from network inventory because we haven’t recognized revenue, and we’ll be recording revenue when we ship the components, so that’s why now that we’re sitting with--well, if you compare year-over-year, minus 14% of total inventory, including incomplete units, obviously it bodes well for wholesale plan for the fourth quarter. Hey guys, good morning. Hey guys, good morning. Obviously wholesale is impacted because we have more retrofit units than we had last year, but the good news is we’re on plan in terms of production, we’re on plan on overall shipments to our dealers this quarter, it’s just the mix that’s a bit different versus what we had initially anticipated. Obviously we’ll modulate along with our inventory  retail forecast, but for sure we want to make sure that we stay relevant in the minds of the consumers, and so investments in marketing and brand awareness and product awareness are required, and we’ll certainly continue investing, so that’s why when I look at my overall operating expense next year as a percentage of sales, it should remain in line with what we saw this year, so a good percentage investment probably in the range of 6% to 6.5% of overall marketing spend would be a fair estimate."
}