{
    "symbol": "DOOO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-25 15:07:02",
    "content": " Our gross profit margin ended at 26%, a slight decline from last year’s level due to higher logistics, commodities and labor costs related to supply chain disruptions. We generated $416 million of normalized EBITDA, up 33% from last year, and our normalized net income came in at $251 million, up $89 million from Q4 last year, driven by higher volume of unit deliveries and favorable pricing, which were partly offset by higher production and logistics costs and higher operating expenses. Looking at the different product categories, year-round products are expected to grow between 30% and 35%, primarily driven by side-by-side with a continued robust demand for lineup the new product introductions and supported by additional production capacity for Juarez 3. That said, we are confident we can achieve this guidance based on sustained consumer interest in powersports and marine, our strong product portfolio, including recent product introduction, additional production capacity from Juarez 3 and Querétaro and the upcoming significant inventory replenishment cycle, which is now expected to start in the back half of fiscal year 2023 at the Juarez and will last for about 12 to 18 months. Your line is open. And we saw, like I saw in my my notes, snowmobile presales is 100% above last year, watercraft is about 25% above last year, and it’s – it was too very successful year last year, then we don’t see much change in existing customers except the customer is more ready than ever before to secure their purchase sooner than never before. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Well, obviously, we’ve reflected the – our decision to exit Russia and our guidance, and Russia was probably a business over $250 million, or 5% of – less than 5% of our revenues, call it, $200 million to $250 million. Your line is open. Your line is open. Your line is open. And last question with respect to capital deployment, obviously, if we take into account your SIB, NCIB and upcoming free cash flow generation for fiscal year 2023, you’re going to end the year with still, what I would say, a very strong balance sheet. Your line is open. Your line is open. Your line is open."
}