{
    "symbol": "EGAN",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-15 00:13:03",
    "content": " Our total revenue was a record $24.8 million, up 20% year-over-year in constant currency. Total revenue for Q1 was a record $24.8 million, up 15% year-over-year or 20% in constant currency and up 5% sequentially from Q4. SaaS revenue was $22.6 million, up 18% year-over-year or 23% in constant currency and up 10% sequentially from Q4. Total revenue from North America was $19.1 million, up 26% year-over-year. Where, in contrast, total revenue from Europe was $5.7 million, a decrease of 9% year-over-year. Gross profit for the first quarter was $18.9 million, up 13% year-over-year for a gross margin of 76% compared to 78% from the prior quarter but up sequentially from 75% in Q4. Looking at our bottom line, non-GAAP operating income for the first quarter was $1.4 million or an operating margin of 6% compared to operating margin of 13% in the year ago quarter and up from 3% in Q4 of fiscal '22. Total cash and cash equivalents at the end of the quarter was $71.5 million, up 2% from a year ago. Total RPO increased 32% year-over-year to $94.5 million, and our short-term RPO increased 27% year-over-year. So moving on to -- before moving on to our financial outlook and guidance, I want to note the share repurchase program we announced today, under which eGain may purchase up to 20 million of its outstanding common -- $20 million of outstanding common stock on a discretionary basis from time to time through open market transitions or privately negotiated transactions at prices deemed appropriate by eGain. So for the second quarter of fiscal 2023, we expect total revenue of between $25 million to $25.4 million, representing a growth of 8% to 10% year-over-year. Adjusted for constant currency, we expect Q2 total revenue of between $25.8 million to $26.2 million, representing growth of 12% to 13%. We expect non-GAAP net income of $1.1 million to $1.4 million or $0.03 to $0.04 per share, and the weighted average shares outstanding are expected to be approximately 32 million for the second quarter of fiscal 2023. For the fiscal 2023 full year, again, given the current macroeconomic environment, we are optimizing our growth and profitability targets by slightly lowering the midpoint of our total revenue guidance by $1 million, but adjusting our projected costs and expenses by a greater amount, resulting in an improvement to our previous guidance of our non-GAAP EPS by $0.04 per share at the midpoint. So for fiscal 2023, full year ending June 30, 2023, we now expect total revenue of between $100 million to $102 million, representing growth of 9% to 11% year-over-year. Adjusted for constant currency, that would equal $102.1 million to $104.2 million, representing growth of 11% to 13%."
}