{
    "symbol": "EGAN",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-14 18:40:03",
    "content": " Our total revenue was $25.6 million, up 15% year-over-year in constant currency and exceeded our guidance and consensus estimates. Total revenue for Q2 was a record $25.6 million, up 11% year-over-year or 15% in constant currency and up 3% sequentially from Q1. SaaS revenue was $23.4 million, up 15% year-over-year or 18% in constant currency and up 4% sequentially from Q1. Total revenue from North America was $19.8 million, up 18% year-over-year, where in contrast total revenue from Europe was $5.8 million, a decrease of 8% year-over-year. Looking at non-GAAP gross profits and gross margins, gross profit for the second quarter was $19.3 million, up 7% year-over-year for a gross margin of 75%, compared to 78% for the prior year quarter and 76% in the preceding first quarter. Now turning to operations, non-GAAP operating costs for the second quarter came in at $17.3 million, compared to $14.8 million in the year ago quarter and $17.5 million in Q1. Looking at our bottom line, non-GAAP operating income for the second quarter was $2 million or an operating margin of 8%, compared to an operating margin of 14% in the year ago quarter and up from 6% in the preceding first quarter. Non-GAAP net income for Q2 was $1.7 million or $0.05 per share, this compares to non-GAAP net income of $3 million or $0.10 per share on a basic $0.09 per share on a diluted basis in the year ago quarter, and adjusted EBITDA margin for the quarter was 9%, up from 6% in the preceding first quarter. Cash flow from operations for the quarter was $7.4 million, a 29% operating cash flow margin. Total cash and cash equivalents at the end of the quarter was $80.9 million, up 18% from a year ago. Consistent with our focus on selling to large B2C businesses, interested in knowledge management to improve customer experience and reduce service cost, the number of $1 million ARR customers increased 21% year-over-year. Our SaaS ARR excluding OEM increased 12% year-over-year and looking at our RPO, total RPO increased 3% year-over-year to $92.2 million. In addition, our second quarter revenue benefited from a significant uptick in seasonal volume that accounted for approximately $1 million in revenue that we do not anticipate recurring in our fiscal third quarter. With that said, for the third quarter of fiscal 2023, we expect total revenue of between $23 million to $23.5 million, adjusted for constant currency, we expect Q3 total revenue of between $23.5 million to $24 million. We expect non-GAAP net income of breakeven to $400,000 or zero to $0.01 per share and the weighted average shares outstanding are expected to be approximately $32.1 million for the third quarter of fiscal 2023. So for the full fiscal 2023 full-year ending June 30, 2023, we now expect total revenue of between $97 million to $99 million, adjusted for constant currency that could equal $100 million to $102 million. Non-GAAP net income of $4.3 million to $6.3 million or $0.13 to $0.20 per share, a GAAP net loss of $700,000 to $2.7 million or $0.02 to $0.08 per share, where we estimated share-based compensation expense of approximately $7 million for the year and depreciation and amortization expense of approximately $600,000."
}