{
    "symbol": "KTCC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-01 20:01:02",
    "content": " For the second quarter of fiscal 2022, we reported total revenue of $134.5 million compared to $128.3 million in the same period of fiscal year 2021. 01:49 Revenue for the second quarter of fiscal year 2022 related to customer reimbursements for tooling, equipment and other expenses increased approximately $10 million, when compared to the previous year. For the second quarter of fiscal year 2022, net income was $0.6 million or $0.05 per share, compared to $1.6 million or $0.14 per share for the same period of fiscal year 2021. While we continue to face the stiff headwinds from worldwide supply chain challenges in the pandemic, we're pleased with the successful ramp of new programs and our expanding customer base in the second quarter of fiscal 2022. Had it not been for the supply chain issues, we believe emerging customer demand would have driven revenue for the second quarter in excess of $160 million. We also announced a significant new program win with one of the world's leading power equipment companies, for which we expect to begin manufacturing in the first quarter of fiscal year 2023 and once fully ramped could contribute approximately $80 million in annual revenue. So our customers as an average now are willing to give us much longer binding forecasts against which we purchase components are willing to much more quickly agree to increases, I mean short-term increases in component cost whenever we find some component on the gray market used to be probably two-thirds of that time that mining that we had done would go unfulfilled because it took our customers a long time to decide if they want to spend an extra 5 times to the normal price of the component to get that component in, so that's going quite a bit better for us now. And you would have roughly 9% gross margins and otherwise and 25% tax rate and that would ultimately lead you to something like $0.23 a share has a pinpoint number, but let's just call it $0.20 to $0.25 a share of earnings in a quarter or working up between $0.80 and $1 per share for the full year at the 130 level, is that occur essentially a correct assessment of the business model or am I missing some important swing factors? Let me shift, if I could to the customer $80 million and there…\n 39:27 Before you before you do that, there is kind of a poster child case that's going on that as another chunk of change in that, it’s actually $20 million of customer reimbursements last quarter in total and this is a customer who had for years purchased their product out of China and actually it had little to no manufacturing and engineering expertise. Therefore sure stickier and there are also, what's the right word -- it's very clear to them that what we've built here in the company starts to become their only answer, when they're looking for somebody who's interested in and $80 million project, somebody who has experience learning how to build everything from toilet bowl cleaners to slot machines. CapEx was relatively low this quarter and I think that you said you guys Brett, I think you said you expected to be $6 million this fiscal year, which I think it's a slight tick down from the previous forecast."
}