{
    "symbol": "KTCC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-13 10:44:09",
    "content": " For the fourth quarter of fiscal year 2022, we reported total revenue of $126.2 million, compared to $132.6 million in the same period of fiscal year 2021. For the full fiscal year of 2022, total revenue was $531.8 million, up 3% from $518.7 million for the fiscal year of 2021. For the fourth quarter of fiscal year 2022, net income was $1 million or $0.09 per share, up from $0.2 million or $0.02 per share for the same period of fiscal year 2021. For the full year of fiscal year 2022, net income was $3.4 million or $0.31 per share, compared to $4.3 million or $0.39 per share for fiscal year 2021. Despite supply chain in COVID related production delays throughout fiscal year 2022 and the continued ramp and transfer of new programs, we managed to end the year with total working capital of $176.3 million and a current ratio of 2:1. For year, our inventory increased by $18.4 million or roughly 13%. At the end of the year, trade receivables were up by about $25.6 million from the end of the prior year and our DSOs also increased to about 88 days, up from 76 days, which reflects timing of shipments to customers with extended terms and some delays in payments from customers, who were impacted by pandemic related slowdowns and restarts in their respective markets. Total capital expenditures were about $6.8 million for fiscal year 2022, down from $10.6 million in the prior year. For the first quarter of fiscal year 2023, we expect to report revenues of approximately $125 million to $135 million and earnings of approximately $0.05 per diluted share to $0.10 per diluted share. Despite the fact the supply chain and the pandemic continued to impact our business throughout fiscal year 2022 and remain risks in future periods, we are encouraged by our prospects for growth and new customer programs for fiscal year 2023 and beyond. Despite facing continuing business challenges throughout the year, including worldwide component shortages, transportation bottlenecks, the global pandemic and government shutdowns, our annual revenue was $531.8 million, the highest in our corporate history. Once fully ramped, this power equipment program alone could contribute approximately $80 million in annual revenue. Your line is open. Industrial testing equipment was $10 million, medical diagnostics is $7 million, water treatment is $2 million, industrial robots are $8 million, lighting control $6 million, disinfection is $5 million, food production is $5 million, energy management systems is $4 million, outdoor recreation is $20 million, RFID is $4 million, industrial connectivity is $2 million, electric mobility is $2 million, audio products is $20 million, GPS devices is $10 million, utility meters is $4 million, personal safety devices is $4 million, Internet solutions is $4 million and the power equipment is $80 million. Would you please talk to those, just given the magnitude and I know you talked about the power equipment of $80 million in the past, so I will skip that one. So we got a mix up somewhere, you get the outdoor power equipment is $80 million and we had outdoor recreation that was $20 million and audio products that are $20 million. And then I believe in the opening remarks, Craig, you had said that you -- that had the supply chain difficulties not been in place that you could have shipped a $700 million of business and by my math, thatâ\u0080\u0099s $175 million per quarter. Your line is open. Your line is open. I am just going to give you brief, rough estimates of approximately $1 million in Q4, just over $1 million in Q4 and in excess of close to $3.5 million in -- for the year. Your line is open. The drivers behind that are as we stated, people trying to move out of China, people who probably shouldnâ\u0080\u0099t have been in China in the first place, because they donâ\u0080\u0099t have the big $20 million, $30 million, $40 million, $50 million programs that are going into Juarez. They could be as high as $160 million, $170 million in the next 12 months, if everything comes the past the way it should and that does make a nice bump in profit for that group of plants. Your line is open. I think if we run even close to what we could, so if we are running in the $600 million range next year for revenue, our margins should be $900 million plus. And then maybe just a last one for me, on the working capital, Brett, you talked about $176 million or roughly $180 million. If we can get the supply chain to be more predictable, so we are about ordering $20 million more parts than what we actually end upâ\u0080¦\n Yeah."
}