{
    "symbol": "KTCC",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-02 23:46:05",
    "content": " For the first quarter of fiscal year 2022, we reported total revenue of $132.8 million up 8% from $123.2 million in the same period of fiscal year 2021. While demand has remained strong for both new and existing customers, revenue for the first quarter of fiscal 2022 continued to be significantly constrained by challenges related to the global materials supply chain transportation, logistics, and the pandemic. Our DSO increased to about 83 days up from 65 days a year ago, which of course reflects both the timing of shipments during the quarter, and some delays and payments from customers who were also impacted by pandemic related slowdowns and restarts in their respective markets. We're also working closely with our customers, key suppliers, and employees to minimize the effects of delays attributable to the continued global pandemic, increased global freight and logistics costs and limited availability of key components. While our facilities in the U.S., Mexico, China and Vietnam are currently operating while following current health guidelines uncertainty as to the possibility of future temporary closures, customer fluctuations in demands and costs, future supply chain disruptions during the rapidly changing COVID-19 environment and other potential factors could significantly impact operations in coming periods. At the same time, we believe that these challenges will continue to force our customers to wait carefully the degree to which they concentrate their supply chain on any one region and see their design control to their outsource partner. That's an interesting question to answer because what we've been able to do is convinced a number of our customers that they should sign up to covering us in the event that the vast majority of the parts that we need for their product are available, but one or two of them or not. So two quarters ago, we were probably buying at around $160 million equivalent revenue worth of parts because we thought we were going to be able to convince our customers to pay PPV for parts that we found on the gray market. So in essence we're going back and getting agreements with certain customers that state that during this time of horribleness in the supply chain, instead of 180 day period that we have to hold it, I guess the new norm is that the amendment to the contract says that day that we would have been building, and we can't build that today that we're allowed to invoice for all the parts that are sitting in our dock."
}