{
    "symbol": "KTCC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-07 16:29:03",
    "content": " For the third quarter of fiscal 2022, we reported total revenue of $138.4 million, up 3% from $134.6 million in the same period of fiscal year 2021. Additionally, our legal costs related specifically to the SEC's review of last year's whistleblower complaint totaled approximately $0.06 per share during the quarter and we expect legal cost to potentially continue at a similar pace in coming periods. For the third quarter of fiscal year 2022 net income was $1 million or $0.09 per share, up 16% from $0.9 million or $0.08 per share for the same period of fiscal year 2021. Despite growing customer demand and backlog, we expect that the ongoing disruptions from the global supply chain and COVID-19 issues will continue to significantly limit production and adversely impact operating efficiencies, particularly for our China-based facilities For the fourth quarter of fiscal 2022, we expect to report revenue of approximately $125 million to $135 million and earnings per share of approximately $0.04 to $0.10 per diluted share. While our facilities in the U.S., Mexico and Vietnam are currently operating and our China facility is expected to reopen soon, uncertainty still exists as to the possibility of future temporary closures, customer fluctuations in demand and costs, future supply chain disruptions during the rapidly changing COVID-19 environment and other potential factors that could significantly impact operations in coming periods. Despite the fact that supply chain disruptions in the pandemic continued to impact our business during the third quarter and remain risks in future periods, we are encouraged by our prospects for the growth for the coming fiscal year and beyond. While we continue to face the stiff headwinds from worldwide supply chain challenges and pandemic-related shutdowns, we're pleased with the successful ramp of new programs and our expanding customer base in the third quarter of fiscal 2022. Had it not been for the supply chain issues, we believe burgeoning customer demand would have driven revenue for the third quarter in excess of $160 million. As you will recall from Q2, we previously announced a significant new program win with one of the world's leading power equipment companies, for which we expect to begin manufacturing in the first quarter of fiscal year 2023, and once fully ramped, could contribute approximately $80 million in annual revenue. Other, in the long-term assets, there's the other line item, which a year ago was about $1.4 million, but it's been growing, I think last quarter or two quarters ago $8.2 million, in this quarter its $11.3 million."
}