{
    "symbol": "RLGY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 19:43:06",
    "content": " Now I will briefly highlight our business unit results, Realogy franchise group, which includes lease and relocation delivered one of the best first quarters on record with Q1 revenue of $267 million, an increase of $13 million versus prior year and net royalty per side of $413 was an increase of $31 versus prior year. Your line is open. So I guess reading between the lines, do those comments generally imply that the embedded outlook for volume at the brokerage and franchise has not changed much since last quarter, even with higher rates and it’s more so just the – again the mortgage and split dynamic. To be blunt, I did literally say our volume guidance is currently unchanged at mid-single digit growth, because we looked at what happened in the first quarter, what’s happening in April, our mortgage business and the whole mortgage industry took a pretty tough hit. It does incorporate a few other things around the margin, but we’ve kept the volume guidance where it is really given the frankly quite strong demand that we’re seeing out there in the market, especially in the kind of $500,000 , which is where our business does kind of skew. And obviously, we’ll see where it’s going from here, but the rate and margin dynamics and mortgage took a really big hit at our mortgage business in the quarter, as you saw with the $8 million loss. Your line is open. Your line is open. Your line is open. But the one thing you can't which is a variable that we're just all stuck with, and it's sort of like a feast of riches here but when your volume is high and you're growing volume on top of already high volume that you had in the prior year, this is driving agents to be at the higher end of their table, and they stay at the higher end of their table until the volumes sort of fade away. Your line is open. I mean, our own brokerage business like I talked about is architected to be in the higher growing, higher price, more luxury skewing geographies, as is our Sotheby’s franchise business and our Corcoran franchise business and so, those parts of our portfolio, which are quite large, I mean, by far the majority, do skew much more luxury and are, I think, a little less rate sensitive. So, we got rising rates in a supply constrained environment where demand is very high and while our mortgage business, I think, is going to take some pain, given what's happened in the mortgage market, part of the reason we haven't changed our volume outlook is what we actually see on this demand thing happening even with rising rates. Your line is open. So I think we actually have a bit of a kind of social problem with just not enough housing here, but I do want people to remember that it's not that people aren't putting their house on the market, it's that demand is so high that they're not staying on the market for as long, because again, 5.6 million units and again that's just somebody's forecast, but I think it's reasonable."
}