{
    "symbol": "ASPU",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-13 22:05:04",
    "content": " These statements include anticipated future declines in instructional costs in the second half of fiscal 2023, future tapering of gross margin pressures in late fiscal 2023 and in fiscal 2024, reductions in cash use in operations to position the company to generate positive operating cash flow in the second half of fiscal 2023, our future financing efforts including closing an accounts receivable facility, future savings from reduced marketing, restructuring savings and our liquidity. Revenue for the fiscal year 2023 first quarter, which is typically our seasonally slowest quarter, was $18.9 million, a modest year-over-year decrease of 3%, which reflects the enrollment stoppage at our BSN pre-licensure campuses in Arizona and the effect of the $1 million sequential reduction of marketing spend in the prior quarter. AU's revenue decreased by $1.3 million or 10% in Q1 fiscal 2023, compared to Q1 fiscal 2022 with the Phoenix pre-licensure program accounting for $800,000 of the decrease, USU's revenue growth of 12% primarily due to demand for the MSN-FNP program helped to offset the AU decrease. As we discussed in our last earnings call in the fourth quarter of 2022, we temporarily decreased our market spend sequentially by $1 million primarily to ensure sufficient collateral for a surety bond. Another factor affecting the first quarter gross margin was higher instructional costs, which increased by $0.5 million from the prior quarter and $1.2 million year-over-year. New student enrollments to AU were primarily impacted by the enrollment stoppage at our Phoenix Pre-Licensure campuses and the overall company reduction in marketing spend by $1 million in Q4 2022 over the prior quarter. On August 18, 2022, we entered into an equity distribution agreement that enables us to issue and sell shares of Aspen Group common stock for aggregate gross proceeds of up to $3 million. Total net loss was $3.7 million or $0.15 per basic and diluted share compared to a net loss of $871,000 or $0.03 per basic and diluted share in the prior year quarter. From a unit perspective, Aspen University's net loss for the quarter was $209,000 compared with net income of $2.3 million. Consolidated EBITDA for the quarter was a loss of $2.2 million as compared to positive EBITDA of $92,000 in the prior year period. Consolidated adjusted EBITDA was a loss of $1.2 million compared to positive adjusted EBITDA of $506,000 in the prior year quarter. First, in the second quarter we scaled back marketing ad spend to maintenance spend levels of $150,000 per quarter which will result in savings of $3.6 million in Q2 and $3.8 million in each of Q3 and Q4. So again, the reason why we had a decrease in enrollments in each of our units is primarily a result of us spending $1 million less from â\u0080\u0093 in Q4, right versus the previous Q3."
}