{
    "symbol": "V",
    "quarter": 3,
    "year": 2021,
    "date": "2021-07-27 21:32:11",
    "content": " Payments volume was a 121% of 2019, which is up 5 points from the second quarter and represents a 34% year-over-year growth rate. Cross-border volume, excluding  was 82% of 2019, 7 points better than the second quarter, and up 53% year-over-year. Fiscal third quarter results exceeded our expectations with net revenues up 27% driven by robust growth in both credit and debit in the U.S., higher cross-border volumes from a faster-than-anticipated recovery in travel, as well as a spike in cryptocurrency purchases and low client incentives largely due to deal timing. Compared to the third quarter of 2019 global payments volume was 21% higher of 5 point acceleration from the second quarter, with debit and credit improving by 5 points and 4 points respectively. Excluding China, total payments volume growth was 38% or 25% higher than 2019 and the 5-point acceleration from the second quarter. Debit growth accelerated 4 points up 48% from 2019, remaining strong throughout the quarter as the trend towards accelerated cash digitalization and e-commerce was sustained, even as the economy reopened. Global profits transaction growth was 20% over 2019, improving 4 points from the second quarter as transactions increase with volume across every region, except the U.S., where transaction growth still large payments volume growth due to higher ticket sizes. Constant dollar cross-border volume, excluding transactions within Europe, was at 82% of 2019 volume, a 7-point improvement from Q2, led by a steady increase in travel, as well as the spike in cross-border cryptocurrency purchases from mid April through the end of May. Cross-border Card Not Present volume excluding travel, continued to be very strong, up 56% from 2019, improving 12 points from the second quarter, with cryptocurrency purchases representing most of that acceleration. Service revenues grew 17% led by 11% growth in the second quarter, constant dollar payments volume helped further by favorable exchange rates and mix, as well as small pricing modifications. U.S. payments volume growth was 31% about 2019, consistent with the third quarter, with debit up 46% and credit up 17% versus 2019. Cross-border volume, excluding transactions within Europe on a constant dollar basis, were 81% of 2019, which is 1 point below the third quarter in June. You may go ahead, sir. You may go ahead, sir. You may go ahead, sir. You may go ahead, sir."
}