{
    "symbol": "OSS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 22:30:25",
    "content": "  Operator: Good afternoon, and thank you for joining us today to discuss One Stop Systems' Financial Results for the First Quarter Ended March 31, 2022. With us today are the Company's President and Chief Executive Officer, David Raun, and Chief Financial Officer, John Morrison, as well as the Company's Chief Sales and Marketing Officer, Jim Ison. Then before we conclude today's call, I will provide some important cautions regarding the forward-looking statements made by management during the call. Now I would like to turn the call over to OSS' President and CEO, David Raun. Revenue grew 28% year-over-year, setting a record for Q1 at $17.1 million. For the second year in a row, we minimized the seasonality from Q4 to Q1 to about 4% as compared to the 30% plus drops in prior years. Bressner, our European team, also performed exceptionally well, with revenue growth at 37%. The growth increased our gross profit to $5.1 million from $4.4 million, while also pushing our gross margins back over the 30% mark. While revenue increased 28%, our operating expenses increased only 8%. Execution to the plan and the quarterly performance just outlined, increased GAAP net income to $579,000, non-GAAP net income to almost $1 million, and adjusted EBITDA to $1.4 million. All significant improvements over last year, as John will provide additional color on shortly. It seems that there is no one in the industry that's been untouched by the disruption of the critical supply chain, and we are no exception. Long lead times, price increases, supply shortages, higher shipping costs and missed shipments by our suppliers continue to make the business more challenging. Our procurement and our engineering teams have been working closely with our sales team to ensure we anticipate our production needs on a constant basis and if needed, find alternatives or pursue other options to meet our revenue objectives. Fortunately, we have been able to leverage our strong cash, limited debt and positive cash flow position to bring in the right products to support our continued growth. More importantly, we have continued to see an acceleration in multiple verticals within the AI transportable market, further validating our strategy implemented last year, including the development and introduction of more scalable standard products. Our flagship Rigel product, a compact and rugged supercomputer introduced last year, and our recently introduced Centauri storage accelerator have been well received. Although these products have generated interest in multiple AI transportable markets, Centauri was co-defined with multiple autonomous truck partners to help address a need in the fast-growing market. Progress in this area includes four confirmed program wins in Q1, bringing the total to five for OSS storage and compute platforms in this developing multibillion-dollar vertical. We are currently shipping products to three of the market leaders, and we hope to expand that number as the year progresses. Before I get into the outlook of the rest of the year and provide additional color on further validation of the AI transport strategy, I'd like to turn the call over to our CFO, John Morrison, who will take us through the financial details for the quarter. Then, our Chief Sales and Marketing Officer, Jim Ison, will provide additional insight into our new product introduction, program wins and building pipeline. Earlier today, we issued a press release with our financial results for the first quarter ended March 31, 2022. As David mentioned, for the first quarter, we reported revenue of $17.1 million, which was up 28% from the prior year period. Our core OSS revenue increased 23% to $10.6 million, representing 62% of current quarterly revenue. With the revenue from Bressner, our European subsidiary, increasing 37% to $6.5 million, representing 38% of total quarterly revenue. Gross profit in the first quarter of 2022 increased $708,000 to $5.1 million. The gross margin for our core OSS business sequentially improved from 33.2% in Q4 2021 to 35.7%, but a decrease of 2.2 percentage points from the prior year due to continued growth and success of our media and entertainment customer. Bressner's gross margin percentage sequentially improved from 19.4% in Q4 2021 to 21%, but reduced from 24.9% in the prior year due to exchange rates and increases in material and transportation costs. Overall, gross margins were 30.1% for the quarter, a sequential improvement from 28.3% in Q4 2021, but a 3.2 percentage point decrease compared to the prior year of 33.3%. Historically, the predominance of these shipments has occurred in Q3 and Q4 and will be consistent with our shipping schedule for this year. However, in the prior year, there were strong shipments in Q1 2021 due to deferred shipments from Q4 2020. We are continuing to take action to improve margins through price increases, improved quoting capabilities reflecting real-time parts pricing, manufacturing efficiencies, introduction of higher-value standard products, and management's focus on this company imperative. As such, the Company has returned to participating in trade shows, business travel, marketing activities and adding certain strategic employee hires. GAAP net income totaled $579,000 or $0.03 per basic and diluted share, increasing from net income of $41,000 or $0.00 per basic and diluted share. Now on a non-GAAP basis, net income was $978,000 or $0.05 per basic and diluted share for the quarter, up from $643,000 or $0.03 per basic and diluted share. Adjusted EBITDA, a non-GAAP metric, was $1.4 million or 8.3% of quarterly revenue as compared to $1.1 million or 8% of quarterly revenue in the prior year. Now turning to our balance sheet, on March 31, 2022, cash and cash equivalents totaled $2.2 million with short-term investments of $13.6 million, combining for $15.8 million. This compares to cash and cash equivalents and short-term investments totaling $19.6 million on December 31, 2021. While OSS is cash flow positive, we are purposely putting our strong cash position to work with carefully sought out inventory investments. And now I'd like to turn the call over to our Chief Sales and Marketing Officer, Jim Ison. In Q1, we generated six new major program wins, including four in autonomous trucking, further validating the value OSS brings to this market. We also added 10 new pending major programs during the quarter, which is the largest increase ever in a single quarter. Six of these 10 opportunities are AI transportable programs for autonomous trucks, military aircraft and maritime applications. Now turning to our thought leader products, our flagship Rigel edge supercomputer continues to provide pull in autonomous truck and military AI applications, adding opportunities at the high end where according to our customers, only our products have both the AI performance and ability to survive at the edge. To complement our Rigel compute system, we have recently introduced the Centauri rugged storage accelerator designed in lockstep with the needs of our autonomous trucking customers. While an autonomous truck is on the road, vast amounts of data are generated from the numerous sensors deployed around the vehicle, including LiDAR, radar, telemetry and video. Centauri is a rugged storage accelerator system that uses the highest performance PCI Express Gen 4 NVMe memory while providing high capacity in a compact, hot-swappable canister that slides into the Centauri chassis. Since Centauri is designed to be remote-mounted in an externally accessible compartment, or the saddle bag of a long-haul autonomous truck, the data canister can be quickly removed, replaced and transported to the truck depot, keeping the truck on the road as much as possible. The previously mentioned products are currently based on Gen 4 PCI Express technology, but we are well underway with the next generation. PSI Express Gen 5 doubles the bandwidth of our current leading-edge Gen 4 products for compute, NVMe storage and accelerator systems such as Rigel and Centauri. We recently posted through social media channels the industry's first known successful Gen 5 PCI Express over 2-meter copper cable data transfer test and look forward to official product releases, demonstrations and product shipments for this leading-edge technology throughout the year. Our talented engineering team is progressing on multiple advancements in system management, power and disruptive liquid cooling technologies, allowing our products such as Rigel and our SDS product line to be deployed in more AI transportable applications. On the marketing front, we have exhibited at the Navy Sea Airspace Show and the AUVSI Exponential Autonomous Vehicle Conference this quarter where we also moderated an expert autonomous truck panel. Many of the same challenges exist in our other AI transportable verticals, including mining, drones and watercraft, where OSS can help customers in these markets generate an immediate and strong ROI. Although our value proposition in some of these historic businesses, like media and entertainment as well as Bressner in Europe, may not generate the margin percentages that we seek in the future years, they generate positive margin dollars and income for OSS. We identified, put together a new strategic plan and have more recently been able to validate this multibillion-dollar opportunity while remaining cash flow positive, profitable and not taking on debt. We have done this during a crazy time in history, and our cash position has allowed us to invest in higher inventory levels to ensure growth and prosperity for OSS. Our objective is clear, leadership in the fast-growing AI transportable market. This enablement is just the beginning as we have every intention, and we're starting to lay the foundation to be the supplier not only in the early stage, but also when the market develops and high-volume shipments are made. Like my thoughts prior to this crash course NDA on autonomous trucks, most new to the story assume that autonomous trucks are some futuristic looking things that may or may not ever develop and surely will be after autonomous automobile market develops. What they find is just the opposite, for one fundamental reason, pure economics of the autonomous truck market wording stumble. Like a commercial airline, where it only makes money when it is in the air, a truck makes its money being on the road, not sitting in front of the Ramada Inn when its driver is sleeping. Unlike your autonomous automobile, these strong economics create pull for solutions to be implemented as soon as possible, even if not at the fully autonomous Level 5 capability. For example, the hub-to-hub model being deployed by several of our customers only tackles autonomous capabilities on the highway. Although we elected not to provide too much information on this front until our earnings call seven weeks ago, OSS products have also traveled over 100,000 miles as the compute and/or storage functions in some of these trucks. While these extremely innovative companies focus on enormous demand of the software to enable a truck to go coast-to-coast without a human in the driver seat, our mission is to make sure we are bringing the right hardware solutions to the market today and down the road when a million of these trucks are hitting the road in production. Our compute storage solutions work directly with autonomous trucking software to gather data from the multiple sensors embedded around the vehicle, including LiDAR, radar, telemetry and cameras. When such software is combined with OSS technology, vast amounts of data can be captured from the sensors, processed, analyzed and stored on OSS' compute or storage platforms. Although these innovative market leaders with names like Kodiak Torque, Embark, TuSimple may or may not be familiar to you, they are backed by some of the largest and wealthiest companies that can benefit from this deployment. Although the cost of a compute and storage system for these trucks today is very high, we expect the volume, eventual competitive pressures and normal market dynamics will drive the overall solution down in price as with any market like this. Even with these lower price points, the market size for these types of products will offer a range between $0.5 billion and $10 billion over time per year. Our revenue outlook is $17.3 million for the second quarter, which represents 15% growth over Q2 of last year. We would like to remind our investors of our upcoming shareholder meeting on Wednesday, May 18 at 11:00 A.M. Pacific Daylight Time. As an alternative, you can go to our standard web page at onestopsystems.com followed by selecting the Investors section in the menu at the top of the page and then clicking on presentations. Now with that, I'd like to open the call to address your questions. It's really, as you said, the timing of the military primarily and then it's just a matter of time getting the AI transport automotive business going. And we touched on margins and things like that, and what I want to stress there is that we wish they were higher, but the bottom line is we're making money and it's funding this AI transportable strategy that we feel really good that we're validating. Let me -- first of all, we're working on a number of different things there, but what I'd like to focus on is personally, the AI transportable stuff. It's a little premature to give you a lot of details, but we're doing some exciting and disruptive things on that front. We just have had additional shipments to some of these diverse Raytheon programs that still fall under Raytheon, GPU-based systems, things like that, that are not under I'd say a five-year contract, but do get funded as they go. Yes, one of the things, let me just add a little color about my comment on the verticals is that there are multiple markets and multiple very large well-known opportunities in the market that we have not been able to participate in. We're feeling good about that because, again, people that did not talk to us before, we couldn't get in, we're inside the door. On the autonomous truck front, you said you're shipping I think to three. So first of all, the three we're shipping to, we're not waiting for orders. And it is multiple products, and it's kind of like these guys use two or three of our products here, and the next one might be one of the same products or two of them and maybe one is a little different. It's not five customers, but we're working with additional ones. You talk about the entertainment customer, again, and we're seeing a return to some of the outdoor events or in-person events let's call them, and that's being layered upon other products, and you're thinking that you should still see continued growth through the rest of the year. First of all, I'd say it's steady growth. It's not like double or triple or anything like that, but they're doing extremely well at the bottom line. And the fact that the virtual product lines, which range anything from creating a virtual like newsroom to virtual music video, to doing some filming or whatever, that continues to do well. And then with the large gathering coming back, that gives us a lot of potential for growth, and that's why we're very comfortable. Look forward to seeing what's going forward here, and I will get back in queue. I guess not to beat this into the ground here, but just kind of thinking about the margin side, I know last -- and you talked about this in your prepared remarks, but last quarter, you seemed a little more confident in the snapback of the margin, thinking that business might level off some after the very strong 4Q. And if I recall correctly, the media business was about a 600-basis point impact to the margin. We've done some work on that, and we have some opportunities by being more efficient basically in the production line, and we are putting things in place to do that. That business is what it is, and we can't drive it up significantly. But like I said, it's a good business for the Company other than when you put a percent mark next to some number. No, you're good, understandable. The one portion there is that obviously as our media and entertainment customer becomes a greater proportion of our revenue, it does put downward margin pressure. We have our media and entertainment that represents 1/3, and then we have our AI transportable, more military-type business that represents 1/3. But when you're looking at 66% of your business or 2/3 that are operating more in those lower margins of 20% to 23%, it has an effective on an aggregate basis of reducing that margin on an overall basis. However, that 1/3 portion of the business is where we're really focusing on, where we look like we have margin expansion, and so they have that. Those are purchase orders that are in hand, but you won't see the margin improvement significantly until you see that revenue coming into Q3 and Q4. Yes, we said we thought we'd snap back to above the annual level, which our annual level last year was I think 31.7%, so we did fall short of that. We're already looking at that, and we're already engaged and having conversations on many different fronts with many potential different partners and also, maybe down the road, M&A targets. Most of the time when you're putting a system in a vehicle, there's -- it's doing several things, not just driving. As those applications get larger, you can see maybe a three-year cycle where you'd need refreshes of the technology as it moves forward and adding more of those capabilities in there. Well, just to be clear, I may be misinterpreting your question, but we are shipping today to three of them. We are engaged with two more pretty seriously, meaning proposals back and forth, multiple meetings, good dialogue. What I'm saying is, we're already in revenue with three of them, and we'll have most likely multiple autonomous truck people be in our top 10 list in 2022. I think to add to that, kind of the standard -- it usually takes from a win to production about 12 months to 18 on the military side. On the commercial side, it's more like six to nine months. And some of these are happening really fast to get to its preproduction, but that six to nine months probably stays steady with this market as compared to our rest of their commercial market. But the autonomous truck market, they're expecting something like a million trucks in 2030, right, and then 100,000 in 2025. But the modeling we've done and looked at, the business looks very attractive between now and then, but that's when we could, if we do this all right, we could have explosive type growth. And regarding that, may you also please provide a bit of insight on the estimate sales cycle timing. First of all, I would say we view both agriculture and mining as future verticals that are not quite developed and ready for that kind of sophistication we have. Wo we could see a repeat of what we're seeing in autonomous trucks, but we see it out in time. That doesn't mean we're not engaged with them, but we just think the type of level of autonomy that they're going to want is further out. So yes, it's more of a 2023 type target. Yes, I would say what you're looking for is we're not in the tens of thousands or twenties of thousands of trucks in production type space. We're doing -- when you say testing, we're doing actually on-the-road testing, on-the-road autonomous driving within fleets. To give you an idea, it might be they're deploying 25 trucks next month kind of thing, and they plan to do 25 more several months from now. And it sounds like, Dave, you're not seeing much if any cannibalization with live events versus virtual. They're just different markets, so they really don't cannibalize each other. That's a wild number, but it's not obviously anything greater than that. And John, on the gross margin front, I just want to clarify, I know there's some near-term headwinds. On the first question on where we are on the revenue, I will tell you, we have probably one of the strongest backlogs we've ever had, and we are having to pull or push out things in order and consistent with when these supplies are available. We do look at our parts availability, but we do get surprised, and we know those surprises that come. It's an active management on a daily basis, on a weekly basis, based upon availability of product. Yes, Scott, I would add to that, I think I said it before, that going into the quarter, we had extremely good visibility on backlog. The supply we have -- it looks like we have really good visibility on supply, but what's getting companies like us is all of a sudden out of the blue, something doesn't show up, and then they say, you're going to see it in three months. We say look, guys, we'd love it to all come in this way, but we're going to assume that like every other quarter, we're going to get surprises, so we bake that into what we communicate to you guys. It always does, but the customer base is more flexible on that than they've ever been in the history of my too many years in this industry. Because they know if they don't, they're not going to get it. What's crazy about it, it can be a $0.50 connector that's holding up a shipment of a $10,000 system, right? One of the things we'll do, identify it, get engineering to start working on that connector, start talking to the customer and say, look, this is the deal, we can either ship it four months from now or a month from now, let us know what you want to do. And your second question about margin, we shared with you today that that Bressner business grew at 37%. What's happening is, these two components on an aggregate basis and a percentage calculation on margin is having an impact. If you were to look consistently on the volume -- if you left volume static, you would see growing margins, but you are not seeing that on an aggregate basis because there's more and more as a proportion of this 20% to 23% business coming into the Company. Scott, there's so many dynamics. For example, one of the things that hit cost of goods was some of our shipping costs tripled on the portion that we bring in because of the dynamics in the Ukraine and all the different things in China. Where there's only one way to get the product here, maybe ship it by air rather than normally go by ship, or because they can't fly over, it can't go through Ukraine, it has to go somewhere else. Those things we don't get in a lot of detail on, but there's so many of those little dynamics that we deal with every day. And lastly, if I could, on the AI transportables front, I really appreciate all the color, David, Jim, on autonomous trucking. And then, Dave, you had indicated you expect multiple autonomous trucking companies to be 10% plus customers this year. And others, then you'll talk to someone else and they'll it's '25. Inside of -- if you just take autonomous trucking, but this can go to military vehicles and things like that, there's at least five different places that we can wind up into an autonomous truck. Whether it be the compute that connects to the sensors, the compute that does the autonomous driving, so that's the compute acceleration. There's also two storage elements, the same, inside the truck when we show you the server and the Centauri that can be the removability. And there could be 20, 30, 40 depots around the country full of systems that need to put that storage into a server. Well, I guess I would leave it to what I said before, which is the autonomous truck wins, some of those will pop into our top 10 this year. And at some point, assuming everything goes as planned and we're the leading guy, which we expect to be, we could see some explosive growth that happens somewhere late '23 to '25 because the size of this market is a size that is so much larger than we are as a company even. And then the other ones, we've already got pretty good revenue from those wins from last quarter, right, Jim, so we're already seeing revenue from those guys. One point I think I'd like to clarify is that right now, we are in the prototype and test space. We are also ensuring that our products that we have, have the capability and the price points to be in the production phase. And then my just last one, I know you guys were looking to invest in headcount after last quarter. For example, if we see an opportunity where hiring some people would accelerate the stuff we're working on, I won't hesitate to do that, without going crazy and throwing the P&L upside down. With no more questions, I'd like to turn the conference back to David Raun for closing remarks. Thank you, Laura, and thank you, everyone, for joining us today. Now, before we conclude today's call, I would like to provide the Company's safe harbor statement that includes important cautions regarding forward-looking statements made during today's call. One Stop Systems caution you that statements in the presentation are not a description of historical facts, are forward-looking statements. Such forward-looking statements include those regarding the Company's expectations for revenue growth generated by new products, design wins or M&A activity. Actual results may differ from those set forth in the presentation due to the risks and uncertainties inherent in our business, including without limitation, that the market for our products is developing and may not develop as we expect. Global pandemics or other disasters or public health concerns, including COVID-19 in regions of the world where we have operations, customers or source material or sell products may affect such market. Our operating results may fluctuate significantly, which would make our future operating results difficult to predict and could cause operating results to fall below expectations or guidance. Our ability to successfully integrate the operation systems, technologies, product offerings and personnel with acquired companies may prove difficult and adversely affect our financial results. Our products are subject to competition, including competition from the customers to whom we may sell and competitive pressure from new and existing companies, may harm our business sales, growth rates and market share. And if we cannot protect our proprietary design rights and intellectual property rights, our competitive position could be harmed or we could incur significant expenses to enforce our rights, our international sales and operations objectives to additional risks that can adversely affect our operating results and financial condition, and we fail to remedy material weaknesses in our internal controls or financial reporting. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of the conference call, and we undertake no obligation to revise or update this information to reflect events or circumstances after this date hereof. All forward-looking statements are qualified in their entirety by this cautionary statement, which is made under the safe harbor provision of the Private Securities Litigation Reform Act of 1995. Before we end today's conference, I would like to remind everyone that this call will be available for replay starting later this evening through May 26, 2022."
}