{
    "symbol": "OSS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:28:30",
    "content": " Q2 was another good quarter for One Stop Systems as we achieved record Q2 revenue of $18.3 million, up 7% sequentially and up 23% over the same year-ago quarter. The strong growth of Q2 was largely attributable to 2 factors: continued strength of our customer and media and entertainment space, the revenue from which grew 135% to a record $6.4 million, and our European unit Bressner, also performed exceptionally well. That resulted in gross profit from the quarter totaling $5.2 million, which is up 12% from the year ago quarter, yielding a gross margin percentage of 28.4%. The higher overall revenue and margin dollars enabled investments in increased R&D and marketing for our higher-margin businesses, namely AI Transportables, in both the commercial and military markets throughout the world, including additions to the sales team and our new advisory board made up of industry experts. As David mentioned, our second quarter revenue was $18.3 million, which was up 23% from the same year ago period. Our core OSS business revenue increased 18% to $10.7 million in the second quarter, representing 59% of total revenue. Bressner's gross margin percentage also decreased slightly to 21.9% in the second quarter compared to 22.6% in the same year ago quarter, primarily due to increased material and transportation costs. As David mentioned previously, our aggregate 2.8 percentage point decrease from the prior year quarter was primarily due to increased revenue from our lower-margin media and entertainment customer and strong Bressner revenue. We are enhancing our quoting capabilities that reflect real-time parts pricing and greater manufacturing efficiencies Our overall quarterly operating expenses increased 16% to $4.8 million, while operating expenses as a percentage of revenue improved to 26.2% compared to 27.7% in the same year ago quarter. GAAP net income totaled $323,000 or $0.02 per diluted share, decreasing from net income of $1.7 million or $0.09 per diluted share in the same year ago quarter -- same year ago period that included a onetime benefit of $1.5 million or $0.08 per diluted share for forgiveness of our PPP loan and related interest. Adjusted EBITDA, a non-GAAP metric, was $1.2 million or 6.5% of quarterly revenue as compared to $1.4 million or 9.3% of quarterly revenue in the same year ago quarter. And -- but we expect them to remain strong the rest of the year, but we'd say that quarter is an anomaly probably go back more to the kind of things we've seen in the quarters before that.There -- I will give you a little more color on it as we understand it, their virtual products, which was driving all the revenue last year, it continues to be the strongest growth. And then maybe from a market perspective, just kind of give us some of the dynamics where we've seen -- it seems like at least the end market demand is slowing on the consumer side, are you starting to see maybe a little better availability of products and maybe just how you think about how that's going to play out the rest of the year for you."
}