{
    "symbol": "AMTX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 18:14:07",
    "content": " Cost of goods sold increased from $51.7 million during the fourth quarter of 2021 to $67.9 million during the fourth quarter of 2022, resulting principally from delivered corn price increasing from an average of $7.23 per bushel during the fourth quarter of 2021 to $10.05 per bushel during the fourth quarter of 2022 and the incremental sales in our India biodiesel segment. For 2023, we are excited about the strong and growing positive cash flow expected from biogas, biodiesel and renewable oil feedstock refining facilities coming into full production this year, driving the strong growth in revenues and cash flow planned for the next 5 years. Last month, the California Air Resources Board held an LCFS scoping plan webinar, where their staff stated that CARB plans to significantly increase the number of credits required under the low carbon fuel standard program starting in 2024, with sufficiently expanding the -- by sufficiently expanding the LCFS mandates to increase the price of credits to more than $240 per credit in the next 2 years from about $60 a day. During the next 5 years, we expect to receive more than $820 million from the sale of investment and production tax credits generated by the construction and operation of renewable fuel plants, renewable hydrogen production facilities and CO2 sequestration facilities. Our overall plan is to fund growth by using positive cash flow from our ethanol, Biogas, India Biodiesel, glycerin and India refined tallow feedstock production facilities, enhanced by up to $100 million of working capital and project development financing from the credit facility that was signed with Third Eye Capital in March 2022. With the recent closing of our first $25 million financing utilizing the USDA Renewable Energy for America program, the Aemetis Biogas renewable natural gas business in California delivered in-service dates in Q1 2023 for several projects. To date, Aemetis has been awarded $23 million worth of grants related to the biogas project from the Department of -- California Department of Food and Agriculture, California Energy Commission, PG&E and other government agencies for the dairy Biogas project and the production of renewable natural gas. The ZEBREX unit reduced our natural gas use by almost 25%, which when annualized is expected to save Aemetis millions of dollars in energy costs and reduce the carbon intensity of our ethanol thereby increasing the value of our biofuel. Currently, natural gas costs for the Keyes plant exceeds $10 million per year, so a 65% savings in natural gas costs and a significant reduction in ethanol carbon intensity is expected after the MVR system is operational. In October 2020, the Aemetis ethanol plant in California was identified in a study issued by Stanford University Center for carbon capture as 1 of 3 ethanol plant CO2 sources in California that have the highest potential return on investment from building a carbon capture and sequestration facility compared to the oil refinery cement plants and natural gas power plants that comprise the 61 largest CO2 emission sources in California. In Phase 1 of the Aemetis carbon capture project, we plan to inject up to 400,000 metric tons per year of CO2 emissions from our own biogas, ethanol and jet diesel plants into 2 sequestration wells, which we plan to drill near our 2 biofuels plant sites in California. The planned 2 million metric tons of CO2 per year from the Aemetis carbon capture project, which generated an expected $170 million per year from the Federal direct pay tax credit as well as an estimated $400 million per year and a projected $200 per ton of sequestered CO2 from the low carbon fuel standard. In summary, Aemetis is expanding a diversified portfolio of negative carbon intensity projects, dairy renewable natural gas, biodiesel in India, sustainable aviation and renewable diesel fuel, low carbon ethanol using zero carbon intensity electricity, renewable hydrogen and CO2 sequestration."
}