{
    "symbol": "ATI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 16:02:06",
    "content": " At this time, I would like to welcome everyone to the ATI Q4 2022 Earnings Call. After the speaker's remarks, there'll be a question-and-answer session. At this time, I would like to turn over the call to Tom Wright, the Vice President, Investor Relations and FP&A. Participating in today's call are Bob Wetherbee, Board Chair, President and CEO; and Don Newman, Executive Vice President and CFO. Before starting our prepared remarks, I want to draw your attention to the supplemental presentation that accompanies this call. ATI's quarterly revenue, once again topped a $1 billion. That's the second quarter in a row, we achieved this milestone. We ended the full year at a run rate of $4 billion in revenue, 37% higher than 2021. In the fourth quarter, we delivered adjusted EBITDA of $140 million. On a full year basis, ATI adjusted EBITDA was $549 million or 14% of sales and almost 400 basis point increase over 2021. It comes down to our team, our capabilities and optimizing our business with discipline. As 2022 began, we were on the frontlines of the war for talent, hiring nearly 1,000 new team members during the year. Now with our workforce largely in place, we're focused on accelerating. We look forward to performing together and to our entire team, thank you for your hard work and focused efforts. Next up, our capabilities; we're optimizing our existing footprint to increase opportunity. When it comes to titanium and nickel melt, we're focused on two things; first, operational efficiency to increase output, and second, increasing inventory velocity. Titanium product lead times have grown from eight weeks, just a few quarters ago to 60 weeks to 70 weeks today. Last quarter, we shared our plans to increase near-term titanium melt capacity for aerospace and defence applications by 25% using our existing assets. Now we're revising this plan upward based on overwhelming customer commitments here in that the word contracts, we're increasing near-term capacity, not just by 25%, we'll increase by 35%. It requires only nominal CapEx, less than $10 million, which is included in our CapEx guidance. Clearly, demand is growing and the team is responding and we're responding quickly. We've restarted a melt shop in Oregon, melting the first ingots a few weeks ago. On top of that, our previously announced brownfield investment to further increase long-term titanium milk capacity is on track to produce first ingots by the end of 2024. Those of you listening to this call likely aren't the people placing orders for titanium these days, but you probably know some people that are and if you're speaking to anyone about it, my advice is to get those remaining contracts signed up soon. We're on track to produce first coils at the new bright anneal furnace in Vandergrift, Pennsylvania, in the next 90 days. My third headline today; we're performing in growing markets, especially our aerospace and defence core. In the fourth quarter, our overall product mix attributed to aerospace and defence increased to 53% of total sales, up 12 points over the same period last year. In reality and for clarity, I think we have a good shot to see our A&D product mix go north of 60% by the back half of 2023. In our HPMC segment, Q4 sales of commercial aerospace products increased by 85% compared to the prior year. Year-over-year, total HPMC segment sales climbed by over 40%. In the AA&S segment, commercial aero sales grew by 113% versus the prior year. This mix improvement, along with the ongoing efficiency benefits of our transformation, drove a 30% increase in full year total AA&S sales. EBITDA margins improved by over 300 basis points versus 2021, a clear indication to me, and hopefully to you, that our transformation is paying off. Headline number four, the modest headwinds we're experiencing impact only a minor portion of our business, and that portion continues to get smaller. We see some recessionary softness in construction, mining and general industrial end markets. The good news, due to our transformation, a little more than 15% of our AA&S segment is exposed to those headwinds. While we see some positive signals, we're forecasting this business to remain at current levels or even modestly contract until we see a clear upward trend. What I can say for sure, we'll be ready when Asian demand picks up. In commercial aerospace, as I mentioned earlier, we're in the most significant production ramp this industry has seen in several decades. ATI's 2022 jet engine sales doubled from the prior year, an astounding ramp rates. But looking ahead, that's changing. On the narrow-body side, we've been awaiting increased clarity on future 737 MAX demand. United Airlines order of 100 Boeing 787s was clearly good news on this front and reinforces exactly what we've been anticipating, even a little earlier than we expected. In our other core markets, defence, growth in global spending continues to create significant opportunities for ATI. In the near term, we're seeing a record level of demand for products like titanium armor going into new military vehicles. In the fourth quarter of 2022, ATI Defence sales grew 18% versus Q4 of 2021. In addition to our core A&D markets, we leverage our expertise to critical adjacent applications with aero-like characteristics. We're seeing growth in these markets, too. Today, I'll share details on 3 areas of ATI's performance. One, our 2022 Q4 and full year results; two, the 2023 outlook; and three, updates on the 2025 targets shared during our investor conference. As Bob noted, Q4 marked our second consecutive quarter with over $1 billion in revenue. Not only are sales up, we're on track with our strategy of shifting product mix to value-add. Aerospace and defence sales were 53% of total revenue in Q4, that's up from 51% in Q3 and up 1,200 basis points from Q4 2021. Value-add sales mix, increased production levels and diligent cost management all contributed to the margin percentage expansion. Fourth quarter EPS was $0.53, $0.01 higher than the midpoint of our guidance range. As we dig further into our performance, I'll highlight a few of the key takeaways as we see them. First, as you can clearly see in our numbers, sales are growing in the differentiated markets where we are valued the most. Secondly, we're improving profitability. Full year 2022 adjusted EBITDA was $549 million, an increase of $258 million and 89% from 2021. Compared to full year 2019, EBITDA increased 25% on revenue that is nearly $300 million below 2019 levels. These significant improvements reflect the impact of our transformation, structural cost reductions and continued focus on mix and price improvement. What else contributed to the year-over-year gains volume growth, increased metal prices, $34 million in COVID incentives and $10 million in tariff refunds. Those COVID incentives, by the way, helped to offset operating efficiencies as we hired and trained nearly 1,000 new workers. Otherwise, we would have delivered even better margin percentages in 2022. 2022 adjusted EPS was $1.99, up from $0.13 per share in 2021. In 2022, we generated $148 million of free cash flow compared to our guidance of greater than $90 million. Third, I want to share progress on two contributors to value creation, working capital and CapEx. Last quarter, I shared that we were targeting working capital to be in the low 30s by the end of 2022 and expected to hit our 30% target in 2023. The operating teams continue to amaze, outperforming expectations and hitting the 30% working capital target sooner than planned. It benefited 2022 cash generation and liquidity, and positions us for additional future improvements. In Q4, customers made advanced payments to lock in their 2023 production slots. Even so, we expect to keep 2023 CapEx within the $250 million target we set in our last February's investor conference. The fourth key takeaway to highlight our strong balance sheet, which provides a stable foundation for value creation. The net debt ratio was 2.2x at the close of 2022, down from 4x at the beginning of the year, great headway on our goal to delever the balance sheet. When it comes to pension, we are now 88% funded on a GAAP basis. Our net pension liability at the end of 2022 was $219 million, down from $396 million at the end of 2021. Increases in discount rates and company contributions, offset by negative asset returns. Asset returns and discount rates can change from period to period, but I want to be clear, we remain focused on executing the pension glide path. In 2022, we repurchased 5.2 million shares for a cash cost of $140 million at an average price of roughly $26.92 per share. Bottom line for 2023, it will be another year of robust, meaningful growth driven by strong and growing markets. While inflation and supply chain challenged us, we successfully offset the impact in 2022 through pricing actions, pass-throughs and capturing offsetting efficiencies. While inflation seems to be slowing and the supply chain is normalizing, a degree of uncertainty is still expected in 2023. With the team well practiced and taking quick and deliberate action, we believe we can achieve similar success in offsetting negative factors. Postretirement benefit costs, which include pension and OPEB expense, will increase the net $36 million in 2023. As a matter of fact, we made our 2023 voluntary contribution of $50 million earlier this week, planned on another $50 million contribution in 2024 as planned. Since 2013, total plan participants have declined more than 62% and there are now fewer than 900 active participants. We have also worked out net liabilities, executed numerous annuitization transactions and made voluntary contributions to the plan. Removed from the equation impacts of COVID incentives, tariff refunds and the incremental postretirement expense, the result, underlying EPS is increasing roughly 40% year-over-year at the midpoint of our 2023 guidance. As I shared, we generated $148 million of free cash in 2022. That brings our 2022 free cash flow to roughly $120 million, closer to where we previously guided. Again, let's remove the noise to understand the underlying growth. We made solid progress improving working capital efficiencies in 2022, hitting our 30% target during a dynamic growth period. In 2023, we expect to make incremental improvement on our 30% working capital level. Overall, we expect managed working capital to be a $100 million use of cash in 2023, give or take. We anticipate 2023 capital expenditures will be in the range of $200 million to $240 million, including the $38 million carried over from 2022 into 2023. And as a reminder, we target returns of 30% or greater on growth projects. For the first quarter, we see continued strength in our core markets and continued softness in industrial and consumer demand. Excluding the incremental postretirement benefit expense, the EPS range is modestly better than Q4 2022. Performance is obviously expected to ramp as the year unfolds, reflecting continued sales growth, added capacity and recovery in our Asian Precision Rolled Strip business in the second half. Before I go into the extended outlook, let me give you some context related to metal price pass-throughs to customers. Remember, pass-through revenues typically generate minimal profits and are generally dilutive to overall margin percentages. In our investor conference, we shared that we expected to see revenue grow at a compound annual rate of between 9% and 11% from 2021 to 2025. Last quarter, I shared that we expected to be at the top end of that CAGR range. We see many positive indicators in our business, including continued strength in our key end markets, pricing opportunities and added capacity. While we are not going to update our targets, I will share that we foresee potential upside to a 12% CAGR for the 2021 to 2025 period. Note that this growth assumes moderated metal prices, not the elevated levels that we've seen lately. I can save you the math on that additional growth potential, a 12% CAGR from the 2021 levels will result in 2025 revenue of roughly $4.4 billion. Benefits of our ongoing transformation as well as growth in defence, energy, and/or advanced alloys and ultra-performance materials are expected to be accretive as well. These forces should drive growth well beyond 2025, but we'll save that discussion for another day. Given our growth trajectory, coupled with disciplined capital allocation, we see significant opportunity to create value for our shareholders. The markets, ready; orders, in capabilities and equipment, running faster every day with capacity increasing and the team already hard at work. Operator, we're ready for the first question. Bob, I wanted to follow up on your opening continue remarks, Don, this may also be for you as well. And from what I'm gathering based on what you said, and correct me if I'm wrong, it looks like the impact is going to be in some time in '24, if not '25. Yes, as titanium increases in our mix, we would expect that to be accretive to our margins. And as far as timing goes, we're seeing it unfold now and it will continue to build momentum through 2024 and 2025. And second here, on your comments about defence, I wanted to know if you could take a little bit longer view on defence growth, how you're thinking about that and how you think that's going to reshape the portfolio and impact your mix. And since you're selling materials, where you own the IP, I'm just wondering how defence margins might compare with commercial margins. I think over time, defence margins will approach commercial aero margins for the same basic metal units commercial aerospace tends to have more differentiation in some of the more exotic titanium grades and nickel grades. But over time, for the common specifications, I think they'll be about the same because that's how we're going to manage our capacity. In terms of the opportunities, we are excited about what's going on in defence other than the tragedy in Ukraine that's driving ground vehicle sales. We feel well positioned with naval carriers, submarine fleets, we're benefiting, and we expect to see the benefits of the ACAS program, and those are huge long-term programs. We've gotten some awards from the next-generation military vehicles, the Mobile Protected Firepower activity that's out there. Certainly, the Abrams tank is a heavy titanium user for lightweight reasons, and that's exciting and then all kinds of things, including more space. So you put all those things together, it's a double-digit mid-teens kind of growth for the long term and again, based on differentiated materials that really bring value to the end product. So we feel well positioned and bottom line, lots of mission-critical platforms for the U.S. and all. Is this titanium debottlenecking, the 35% from 25% you had mentioned a couple of months ago. So you're right, our total capacity is actually -- is going up to closer to 70%. We're happy actually that the demand has been so strong and the customer commitments have really been strong, which is why we raised the short-term demand or capacity number from the 25% to the 35%. And we were out there last week, put our hands on them, and it's pretty exciting to see the ramp is underway. I think probably the last 90 days, the reality of the demand in 2023 is coming to the market, and we're seeing lots of interest and our lead times are stretching out to show it. We feel the customers are committing and have committed in many cases, to the capacity. Well, the way I would look at it, Phil is, number one, the indicator as to how strong the demand is in the market. Clearly, when you look at our cash flow guidance for 2023, we didn't take that down by respect excuse me, $30 million. So that's the way to look at it and I think that, again, the strongest takeaway that you can make on that -- those advanced payments are the demand, which we keep. We said it 50x already in the call, but demand is truly strong and our customers, this is not a blip. Our customers are seeing a sustained need for our materials, and it's going to increase from here. How to think about that progression, whether it's kind of back-end weighted or more even across the years. I think the easiest way to think about it is, we've talked about incremental margins going forward north of 30%, I think is what I've shared. We did note that with the additional $36 million of postretirement expense in 2023, that's going to create some earnings headwinds. Now when you think about HPMC, there's strong growth that we're seeing in that business. So I think you should expect to see continued expansion into the kind of range that we talked about in our investor conference, which I believe we said expect for HPMC margins in the 20 -- kind of low to mid-20s, and we still see ourselves on track to accomplish that in that time frame. And then on -- or I guess on the titanium, we think about the incremental titanium growth coming in 2023 -- on the airframe side. So we're going to be ramping up here in the first half, and it takes a little while to go from melt to final product in the back half. So from a top line perspective, we'd expect $50 million, $60 million of top line revenue from this additional melt in 2023 is probably a good estimate that Don would let me get out there for you. And then in the second half, yes, clearly, in the second half, you asked about AA&S and HPMC, I think it could probably be 50-50 between the 2. So if you're modeling it, I feel comfortable 50-50 between the 2 segments. People still have material flowing from Russia, and they're working hard to get their supply chain resort or reaffirmed up for what they want. So there's still a lot of work to be done, I think, in that supply chain. The widebodies in general, we've repositioned our mix that we're more and more agnostic as to which OEM we're supplying. And certainly, the wide-body phenomenon in the short term has been in the U.S. in terms of the shortfall, but Europe's been good. So I think the catalyst that I would say is, yes, 87 demand, wide-body in general, realignment of supply chains. But I think that catalyst is coming very, very quickly, probably in the 2024 time frame given the long lead times that we see. And our long-term guidance when we did our 2025 guidance of about 100 narrow bodies, 20 wide bodies by 2025, those estimates are looking a little more conservative than we thought. So the last six months, good question, so one thing that's kind of gone on for us during the COVID pandemic was a shift from distributors as a key part, they're still important distributors, are a key part, but the team has done an excellent job of aligning more closely with OEM demand. I would say, today, depending on the part and the flow path, customers are willing to commit orders and some products into Q1 of 2025, believe it or not, so we do have a fairly controlled order entry program against those commitments. But -- and then the general more specialized alloy mill products that come out of our North Carolina melting probably into 2024, early 2024 if not Q2 of 2024. So that was 8 -- 6 to 8 weeks, and that was obviously in 2020, 2021, and those days are gone. So yes, really I would say the average lead time is 50, 60, 70 weeks depending on the product. And I'm just curious like how pricing -- it sounds like this is a good environment for pricing to move higher, even on LTAs as they come for renewal. We don't have any -- yes, I don't believe we have any major ones in 2023. So 2024, 2025, probably 2025 will be the first major transition year to other contracts. Most of the big OEMs are out, we have quite a few that go to 2030, 2035, those kinds of numbers and most of those have inflationary or pricing pass-throughs. I would say for people who don't have contractual commitments or don't have long-term relationships, spot pricing is up significantly in the market. It's not as simple as just redirecting, Oh, yes, we'll buy this stuff over here and everything is going to be fine. It's a complex supply chain, complex and very important specifications. But I do think over the last 6 months, I think they have started. Anytime I get a phone call from a customer there's a reason for it, but we're in a great position to be able to take advantage of it. And I've been talking to more customers along with our Chief Operating Officer, Kim Fields. We talked a lot about to customers on a regular basis, and that's really trying to get clarity of demand, and they're working on it with urgency. One, of course, when we think about capital deployment, we kind of have 3 legs to that stool. That's, for us, primarily focused on the CapEx. We've talked about our CapEx guide at $200 million to $240 million in 2023 and then the second leg on that stool is about delevering and so to us, there's 2 things that come to mind. One is the pension and first and foremost, we're making voluntary contributions to the pension plan. This year, we have a $50 million contribution. And then in terms of other debt actions, we really don't have any imminent debt maturities that we're going to have to deal with. In 2020, we -- excuse me, 2022, we repurchased about $140 million of shares. And then, of course, we're expecting that we're going to generate a healthy amount of cash flow as the aero ramp unfolds. And our expectation is that we're going to put that money to work and returning capital to shareholders continues to be a very, very important thing to us, and so it will continue to be a feature. So at this point, the board has not approved additional share repurchases beyond the remainder of the existing program, but I wouldn't read anything into that fact because of the timing of an approval would be after we finish up the existing program. So looks like in 2023, you're targeting somewhere around 50% free cash flow conversion on net income close to the -- probably 25% or so, 20% on EBITDA. I think before you've talked about 90% free cash flow conversion, is the target in 2025, where it looks like you're targeting somewhere around $800 million or so, some $750 million, $800 million of EBITDA. If you do -- you take the EPS guidance and you back into cash and cash conversion, we're in that 50% range right now. We've made a significant improvement, by the way, in that metric over the last couple of years. And what's going to happen is, of course, everything on cash generation starts with profitability. Another important part of it is going to be CapEx, capital spending. And so this year, our capital spending range has a midpoint of about $220 million. And what I shared previously still holds as you look at between now and 2025, what I expect is our CapEx spend is going to edge down. And by the time we get to 2025, I would expect our capital spending to be close to our depreciation rate and our depreciation rate at that point will be somewhere between probably $150 million and $170 million. I also expect, by the way, that when we're out in the 2025 time frame, I still expect to be a limited cash taxpayer, which is going to be helpful in -- at least in that period when it comes to cash conversion. And then on the more cautious side, your industrial headwinds contrast with what we're hearing from others. Do you want to take the first one, Don on the China, or you want me to do. We're just -- based upon the current pace of things, our expectations is that it's going to be with us in the first half. But in an abundance of caution for how we view the business and the trajectory, our sense is it's going to take us the first half. I think your other question, Timna, was around oil and gas and energy in particular. I think we see strength specialty, specialty energy, yes, we definitely see the oil and gas side with the subsea, the offshore and the subsea systems, Nickel clad, various things, specialty alloy things for the deepwater or subsea systems. We continue to see in the specialty side, lots of activity in next-generation technologies, civilian nuclear is actually coming back. And I would say, we've had a long history with fuel gas desulfurization of coal plants in Asia. But bottom line is we feel pretty good about those markets with continued growth, I would say, high single digits, low double-digit kind of growth through 2023 and you asked about inflation reduction act impact and timing. I just wonder if you can explain a little more what that means and along those same lines, I know in the past, you've talked about moly prices, molybdenum is exploded. There's a couple in there, Timna, you're getting like 6 today. But I think with the material pass-through, we work hard to pass it through and not take that risk. Second and less obvious one is in the medical space over the last few years, we had seen material purchases that were more common purchases. I wouldn't say commodity, but we're more standard moving to places like Russia, China, various other sources. Obviously, there's a huge activity if you're -- if you have been to Phoenix lately, you'll see a lot of building of chip manufacturing and we actually provide some specific materials that go into the precursors that go into chip manufacturing. And I think it's the surety of the supply chain, the surety of the quality. So between electronics and medical, I think those are probably 2 other good examples. And I think the growing sensitivity to near-term supply chains of input materials -- everything we make is alloyed in one shape form or another, and those alloying ingredients come from all over the world. So hopefully, that's a couple of good examples to give you some color on where else that's going on."
}