{
    "symbol": "ATI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 21:48:09",
    "content": " Our growing end markets, solid execution, and the team's proactive and creative efforts to address challenges as they arise are driving results and beyond the second quarter, we have great long-term opportunities to profitably expand our business. Now, one thing to keep in mind when you do you think about the pass-through mechanisms under the LTAs is there -- does tend to be a bit of a time lag where there is about a one quarter lag between when the inflation is seen in our cost structures and when the adjustment mechanisms within the LTA allow for the recovery in the prices, so that as you're thinking about the incremental margins in quarter-to-quarter margins, that's one way that you're going to want to think about it. So a lot of good news, a little bit of noise in the current quarter, but the noise I think as you consider the things I shared, the noise will be -- once you adjust for that, I think it's clear that this underlying performance -- the underlying performance of the business is quite strong. So I think you'll see people in the industry today that they're looking at some of the, I'd call it bottleneck management 101 techniques, or you look at the product mix that you have, are you optimizing through the bottleneck, and for us, I think it will be -- and the industry, it's going to be the melt side. We're probably as a percentage seeing much higher MRO business to the tune of 50%, 60%, 70% depending on the hard, depending on the program, depending on the supplier, but it's been strong coming into ‘20 -- started in 2021, it's been strong through 2022, and every indication is it's going to be strong through 2023. So trying to be very thoughtful and strategic, and that's what you're seeing in terms of our current working capital balances and why we decided that at this point, we kind of hit the pause in terms of giving updated cash flow guidance and like Q2 play out a little bit."
}