{
    "symbol": "CTS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 13:48:02",
    "content": " Good morning, and welcome, everyone to our third quarter 2022 earnings call. Sales in the third quarter were a $152 million, up approximately 24% compared to the third quarter of 2021. Third quarter adjusted gross margin was 36.6%, down 70 basis points from 37.3% in the third quarter of last year. Last quarter, we completed the Ferroperm acquisition. Our recent acquisitions TEWA and Ferroperm added nearly $9 million in sales during the quarter, and the businesses are performing well. Demand was solid across medical and defense markets with mixed demand across the industrial market, where we saw softness in consumer facing products linked to computing and entertainment, which make up a smaller part of our portfolio. Adjusted gross margin for the third quarter was 36.6%, down 70 basis points from 37.3% for the same period last year. We continue to operate in a very dynamic environment as we are impacted by commodity prices, supply chain headwinds, and other macro challenges, which are pressuring margins. We are moving forward to consolidate our two Denmark locations, and we expect the process to be substantially completed by the end of June, 2023. We are also gaining momentum with our CTS operating system, which continues with continuous improvement projects supporting margin performance. Adjusted EBITDA margin was 22.3%, up 60 basis points from 21.7% in the third quarter of 2021. As a company, we remain focused on driving profitable growth through diversification and leveraging our capabilities in the electrification of mobility to enhance the quality of our earnings. Solid transportation, electrification, medical and defense wins drove new business awards in the quarter to $159 million. By continuing to focus on growth and diversification, we added five new customers in the quarter, two in industrial, one in electrification, and two in defense. Additionally, we rewarded several new sample contracts and funded pre-development awards in key strategic areas of our business. Customers view our leading-edge technologies, deep industry experience and vertical integration over several end markets as key differentiators, helping us deliver long-term value. Our in-house know-how and proprietary processes along with the competencies across three leading piezoceramic technologies are a key competitive advantage, enabling us to develop new material formulations such as textured and lead-free. With the completion of the Ferroperm acquisition, we enhanced our medical product portfolio offerings as well as industrial and defense capabilities. In the industrial market, demand for micro actuators used in industrial printing applications were down marginally from prior quarters. Across temperature sensing, hot and cold applications, we continue to see good momentum with awards for HVAC and demand for industrial appliances. We added two new customers in industrial applications, one for nanopositioning and another for an EMC application in rail transportation. While distribution sales were up year-over-year, sales were down low single-digit sequentially, which we expected after the higher demand periods we have seen for several successive quarters. Across medical, we see continued momentum and long-term growth opportunities building. We were awarded two new pre-development ultrasound contracts, one for application and drug delivery for liver ablation and another for minimally invasive surgery. The precision insulin pump application previously discussed gained customer approval, and we expect the first shipments to begin early in 2023. Further, we received multiple temperature sensing awards from existing customers ranging from incubator to critical freezer monitoring and disposable applications. In aerospace and defense, we remain confident in the long-term prospects for this market, driven by the geopolitical environment and our enhanced capabilities with new material formulations. For unmanned underwater vehicles, we received a new customer contract for a single crystal product and expect to build on this win to advance our growth momentum in new defense applications. We continue to advance our M&A strategy, which is focused on expanding our geographic reach, diversification of our end-market profile, and increasing the broadness of our products and customer base. We continued to focus on complimentary materials, Sensor and Transducer acquisition opportunities to increase our non-transportation growth, while at the same time seeking to expand the portfolio of electrification products for broader mobility applications. As already mentioned, our goal remains to accelerate inorganic revenue growth by deploying capital in a disciplined way to expand our range of technologies, products, customers and geographic reach. Our acquisitions of QTI, SSI and TEWA, demonstrate the execution of our strategic plan and track record of thoughtfully expanding ceramic technology to support diversification, while at the same time leveraging our ceramic expertise to build and scale our temperature sensing platform. We continue to focus on acquisition targets in the range of up to $50 million a year in sales, but we remain open to the right larger opportunities that will advance our long-term strategy as our team continues to develop our pipeline of prospects. In transportation, we continue to perform in an environment where OEMs and Tier 1 suppliers are navigating challenging supply issues. We continue to see robust demand in commercial vehicles, and while headwinds are already visible with a slowdown in freight, aged fleets still require replacement and are increasing backlogs. On the light vehicle front, volume growth remains a challenge given the supply side issues across the industry. We also remain cautious on light vehicle demand going forward due more to weakness in consumer sentiment than supply disruptions, and view demand trending flat going into the end of this year and into next year. However, longer term, we see the need for a growth cycle, given the recession level industry volumes of recent years. We continue to focus on strengthening our light vehicle sensor portfolio, especially around EV platforms. Today, electric vehicle revenue ranges approximately in the high single-digit as a percentage of our total light vehicle revenue. In addition, our new current sensing product will begin shipment in the fourth quarter of 2023 to support a European premium platform. Overall, we are making solid progress towards our goal to achieve greater than 25% of our light vehicle sales from EV platforms. Our value proposition in transportation has been built on our expertise in designing and packaging, position sensing for safety, critical and harsh environments where our teams have developed deep industry experience. In the quarter, we had six EV platform wins across existing customers covering several products in our portfolio. For chassis ride height sensing, we had wins with a North American OEM and added a new EV customer in Asia. Looking ahead, we currently see good demand in medical and defense markets with some softness in industrial and distribution where we see some increased inventory levels. In the light vehicle market, the loss of vehicle builds so far this year have been driven primarily by COVID-19 lockdowns with an impact of over 1 million reduced units and the semiconductor shortage impacting production volumes negatively by 3 million to 4 million units this year. Commercial vehicle demand, as previously mentioned, remains robust. However, as I mentioned earlier, we expect some challenges in the commercial vehicle market due to a temporary issue with a semiconductor supplier, which is likely to unfavorably impact our revenues in the next two quarters. Despite the near-term economic headwinds, we feel confident in the long-term prospects for the business driven by our strategic focus on diversification, electrification and our strong balance sheet. Our teams are creatively navigating the current environment to ensure supply for our customers, while at the same time maintaining a strong focus on strengthening our go-to-market capabilities and adding new customers globally. We were able to maintain operations this past quarter, while ensuring a safe working environment for employees as we experienced continued lockdowns in the Asian market. I'm pleased to say in this very challenging environment, our teams are working and adapting with speed and agility to support our customers, demonstrating the strength of our underlying culture, leadership and core values. In terms of the financial outlook for the full-year 2022, our guidance is now for sales to be in the range of $585 million to $595 million. Third quarter sales were $152 million, up 24% compared to the third quarter of 2021, and up 5% sequentially from the second quarter of 2022. Sales to non-transportation end-markets increased 22.5% year-over-year, supported by another quarter of double-digit growth in the industrial and medical end-markets. Sales to transportation customers increased 25.7% compared to the third quarter of 2021 and increased 4.9% sequentially driven by the robustness in demand, which Kieran mentioned. Our adjusted gross margin was 36.6% in the third quarter, down 70 basis points compared to the third quarter of 2021 and up 50 basis points compared to the second quarter of 2022. Due to the significant movement in exchange rates, we saw an unfavorable impact of slightly more than a $1 million on gross margin. As previously communicated, we still expect to achieve the lower end of the $0.22 to $0.26 of savings by 2023 as we balanced growth with the completion of some of the restructuring projects. Adjusted earnings for the third quarter were $0.62 per diluted share compared to $0.46 per diluted share at the same time last year, and $0.62 per diluted share in the prior quarter. We are carefully watching our working capital, especially inventory levels across different parts of our business as a key area to improve efficiency. During the quarter, we repurchased approximately 52,000 shares of CTS stock, totaling $1.8 million. In total, this year, we have returned over $17 million to shareholders through dividends and buybacks. We ended the third quarter with a cash balance of $148 million, and our long-term debt balance was $85 million. But anything you can share on expectations by end-market, in particular auto reaccelerated in the third quarter. A few things, obviously, we had a strong third quarter, but in my prepared comments, I mentioned that we're having challenges with a semiconductor supplier impacting our commercial vehicle volumes. We are able to get some pricing, obviously not enough to offset all of our cost increases, but we are finding a reasonable balance of sharing that burden between us and our customers and maintaining long-term relationships. And Joshua, just one point to add, weâ\u0080\u0099ve got a long way to go on the material deflation from where we were two years ago, so it's still quite a bit of pressure we're carrying. Our biggest concern is that if there is a slower demand environment, we don't want to be sitting on a lot of excess inventory and we are continuing to manage that throughout our supply chain, also keeping track of inventory levels at our customers and at our suppliers. Really it's more of an issue going into next year's where we see the bigger challenge on that with our operations in Czech Republic, Denmark and some other areas as well, but more of an issue going into next year than this year. I mentioned in the prepared remarks that we had been funded for a pre-development of an eBrake product, so that's obviously not a production win yet, but doing the engineering work on this, and that's a market of maybe some $600 million, $700 million. So being a player in that market is going to add content significantly for us going forward, but we've got to turn that pre-development into a win to get that content there. And we like the new EV products that we're bringing to the market, they've got â\u0080\u0093 we've got to be competitive of course, but we don't see it, changing our profile dramatically. And so we see that improving as we go into the next year, but probably still a challenge through the first quarter because I did highlight again, on the commercial vehicle front, we have a supply issue there that impacts us in the fourth and first quarter of the next two quarters. Regarding, Ashish, the 2020 restructuring program that you've gotten $0.19 from year-to-date. So if things are a little bit softer in the first part of 2023, then I would expect us to move more quickly. If the demand environment continues to remain robust, then it might slip a little bit later on, but I would expect by Q3 timeframe, we should be done with those transitions that we were targeting as part of the 2020 plan. We feel good about certain parts of industrial and aero and defense is trending in a good direction, but it's probably at a slower pace. And then on the transportation side, it's pretty mixed where we â\u0080\u0093 I said in my prepared remarks that we see it flattening a little bit. There have been supply chain issues that I mentioned already, but it's really â\u0080\u0093 we see that more of an issue with the consumer than supply chain longer term in 2023 with the higher interest rates. We've got a strong balance sheet, that's a key part of our growth trajectory as well as organic growth. We haven't seen a softening in multiples, but we would expect a softening in multiples going forward. I think what I would like to know is, in industrials, I think there are some inventories in the channels and then there are also like end customer demands and then the two may not move in â\u0080\u0093 at the same levels, let's say. As I mentioned, we've seen some increasing inventories in certain parts of industrial and distribution as well. Number one, when we were hit by COVID back in 2020 and our automotive volumes went down by about 50%, we were able to flex pretty quickly and still maintain a profitable trajectory for the company. It varies across the different customers and the different applications, but it varies from several weeks up to three months. We haven't seen much of that, but it's something that we're concerned about and watching. I'm expecting it's in the $5 million to $6 million range and the balance coming from TEWA, but I can get back to you on the more precise numbers. If I look at CapEx, I'm wondering whether CapEx will be backend-loaded in Q4 considering that you have spent like $9.3 million in the first nine months, and I believe that CapEx will be higher than that, let's say like a normalized run rate? The Q4 CapEx will â\u0080\u0093 is expected to be slightly higher Hendi, and I'm wording it that way because we generally say we will spend and then we don't end up spending quite that much because generally the business leaders are very prudent about their CapEx spending. The other thing to watch for, which I mentioned in the prepared remarks also is, the cash that we got back from the pension plan, we will be paying $7 million out of that for excise taxes. I'd like to reiterate that CTS is well positioned for the future, and I'm confident that our diversification strategy bolstered by our recent M&A activities and the breadth of our geographic footprint will enable CTS' trajectory of profitable growth while we navigate current macroeconomic uncertainty."
}