{
    "symbol": "SITC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 14:29:02",
    "content": " And what's interesting about Shops at Boca, you think about putting $90 million to work at a property that's got an average base rent of about $38 a square foot. So I think -- I mean, Floris, if you just think anecdotally, and we're definitely working through the data, there's two input assumptions to remember, one is every time you're working from home and you order Uber Eats for lunch, somebody goes to our shopping center and is there for a whopping three minutes, and that counts as a visit. I mean it's -- I mean, I think about it sort of the size of the asset is sort of like a typical PECO grocery-anchored centers, $20 million to $25 million, $30 million or something like that, if they're relatively small, lower CapEx, as you say, more upside in terms of marking rents to market. I think what's interesting, Floris, is -- look at the two categories, street retail and convenience retail and you named a similarity, which is a little bit shorter duration, fewer options, and therefore, easier to capture mark-to-market and in general, lower CapEx because it's more of a renewals business, both for convenience and for street. I think labor is sometimes not talked about as frequently as inflation for products, but I think labor inflation is a real issue for the retailers and I think it's part of the reason we've been focusing on national credit tenants because the larger tenants that have 401(k)s and they have dental and medical programs, they're able to hire staff. And that's why I think you're starting to see a lot of the national credit get tenancies signed, get leases signed and get open because they can hire the staff in order to occupy and staff those stores. When you think about the kind of common denominators of the existing portfolio, there's three factors: credit to David's point, our national tenants are 89% of base rent. I think to Mike's question, we've got about, at the top end of the range, $2 million of potential reserve reversals that would include either just reserves we have in general or that can include the cash basis deferrals that I referenced."
}