{
    "symbol": "SITC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 14:57:04",
    "content": " There were no shortage of key deals this quarter, including the recapture and retenanting of a ground leased restaurant in LA, the releasing of all four available units, including two anchors at one of our shopping centers in Charlotte at a positive 128% mark-to-market, multiple first to portfolio shop deals across a number of different assets and continued progress on the lease up of our tactical redevelopment pipeline. Lafayette Mercantile and La Fiesta Square offer all of the attributes that we are targeting in convenience properties, including barriers to entry, excellent demographics with trade area household incomes of $223,000 and average home prices of over $2 million, convenient access and parking and site plans that offer a mix of simple, liquid, lease shops to a wide variety of national regionals and local tenants, including Starbucks, Bluemercury, and FedEx. I think given the amount of leasing demand in our submarkets, it's kind of becoming obvious that some properties have a lot of growth left and that's either from renewals or from recapturing space or from occupancy uplift. And other ones are kind of fully baked in terms NOI growth, so I do think it's reasonable to assume that for us to grow the company one of the ways to do that is to sell stable assets at a really compelling price and to take that capital and recycle it into properties that we think we can move the NOI significantly through leasing and renewals. Hey, Todd, it's Conor. And Todd for specifics, for acquisitions I think we mentioned last quarter are going yield was about a mid-five and that's consistent with this year for kind of year-to-date for the 314 we acquired and for dispositions it was just under a 6.5 blended for the year. Hey, Todd, it's Conor. Just as we think about the convenience side and these assets are targeting, David, you talked about these opportunities with the tenants and knowing those marketplace and a lot of convenience factors that, and I think you mentioned 4% internal growth rate that you're going to see from some of these assets. I mean, it's a laborious process for John and his team to build a portfolio, particularly if you buy some assets that are $5 million, and $10 million or $15 million at a time, and that's why you've seen us focus a little bit more on some chunkier ones like Northern California, and Delray Beach, and Boca and Atlanta where they have been $40 million to $100 million properties."
}