{
    "symbol": "FCPT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:56:04",
    "content": " 07:07 On a run rate basis, current annual cash base -- cash base rent for leases in place as of the end of the quarter is $178.2 million and our weighted average 10-year annual cash rent escalator remains at 1.4%. A pursuant to our credit facility agreement, as Bill mentioned, if we achieve a second investment grade rating from either Moody's or S&P, we will save at least $1 million per year in interest expense on the term loans by switching to a rating based pricing grid. 12:26 I would just say that in the last couple of weeks and literally the last couple of weeks, Nate, we found a few opportunities that I would describe as we have been hanging around the hoop on deals where they had -- the seller had gone with a more levered buyer and as that levered buyers debt repriced the original buyer dropped out, and we were able to pick up properties on the rebound. Yeah, I was going to say, it would be great to see since as Pat mentioned, it's been very competitive over the last couple of years post-COVID/\n 15:10 All right. So I would say that we've been incredibly consistent since our first acquisition that we score all our properties in a very consistent way we've taken tens of thousands of properties through our scoring methodology and term has a waiting, and so in order for us to get comfortable buying a property with less term other factors in that model need to be strong. And I would say that is exactly how we've done it from beginning and so where you have years, where the quarters where term is less, I think you should feel confident that other factors are performing strongly and that's how we look at the world. But I would also point out that what was traditional 10 years ago of non-IG being 15 to very often 20 years, an investment grade, very often being 15 years, but certainly 10 has changed over the last 10 years and I'll note that Darden obviously, IG has sold a number of properties recently in the 1031 exchange market with primary lease terms of five years. But I would say that we feel like we're being well compensated, it's helpful that we don't have to put property mortgages on individual properties that makes shorter lease term acquisitions that are very sensible harder to do. 24:29 I wouldn't say Sheila that the ability to push LTV is down perhaps slightly, what I would say is, as we were looking at the competitive environment last quarter and at the end of last year, I was very concerned that a number of private equity firms we're building that lease groups and they typically use far more leverage than we were, better than we do."
}