{
    "symbol": "BB",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-21 19:55:04",
    "content": " I’d now like to turn the call over to Tim Foote, BlackBerry Investor Relations. After I read our cautionary note regarding forward-looking statements, John will provide a business update and Steve will review the financial results. We’ll indicate forward-looking statements by using words such as expect, will, should, model, intend, believe, and similar expression. Forward-looking statements are based on estimates and assumptions made by the Company in light of its experience and its perception of historical trends, current conditions and expected future developments, as well as other factors that the Company believes are relevant. These factors include the risk factors, as discussed in the Company’s annual filings and MD&A, including the COVID-19 pandemic. As is customary during the call, John and Steve will reference non-GAAP numbers in a summary of our quarterly results. For a reconciliation between our GAAP and non-GAAP numbers, please see the earnings press release published earlier today, which is available on the EDGAR, SEDAR, and blackberry.com websites. And with that, I’ll turn the call over to John. I’m pleased to report that this quarter we delivered solid sequential billings and revenue growth in both our IoT and cyber business unit, and at these expectations. I’m also pleased that despite on our ongoing investment to grow the top line, EPS came in much better than expected. Revenue was $43 million, representing a 34% year-over-year growth, although noting that last year was heavily impacted by the pandemic. This was a very positive quarter for QNX, driven by continued strength and design wins activities. In fact, demand is so strong right now that we’re expanding our professional services team by hiring additional heads into QNX. In addition to the near-term revenue benefit, these strong design wins serves as a positive leading indicator of the longer term health of the QNX business overall. Once completed, obviously, these designs will move into production and generate royalty revenue in future quarters. In terms of production-based royalty this quarter, we saw a modest increase compared to Q2. While we expect the auto industry supply chain issues to remain a meaningful headwind to vehicle production volumes through the end of this fiscal year and as well into 2022, we see the impact on QNX gradually lessening, including an improvement in Q3 versus -- in Q4 versus Q3. Autonomous drive is the clearest example of safety critical software application in a car, which as you know is the most defensible attributes of QNX. BMW selected QNX because of our deep expertise and strong track records in safety, reliability, as well as security. In addition to licensing our technology, we will be providing a professional services team to support BMW in the aggressive development timeline. Other auto wins include a major new design for our acoustic middleware, one of our higher ASP products. We also had a number of ADAS, advanced driver assist, sorry, ADAS, gateways and digital cockpit design was with leading OEM and Tier 1. In Q3, we had 11 -- a total of 11 new auto design wins and 13 wins in the general embedded market. GEM, the general embedded market, wins included a number of medical applications, such as a infectious disease diagnostic platform, as well as the next generation robotic surgical arm. We also had wins in industrial applications as well as aviation, including an engine simulator with the leading aerospace company. During the quarter, Google, Qualcomm and BlackBerry, three of the leaders in the autonomous digital cockpit announced a collaboration to build a chipset that allows BlackBerry’s Hypervisor to seamlessly integrate with Android automotive. Previously, to develop a digital cockpit with an Android automotive infotainment system running alongside safety critical application on a single chip will require hundreds of hours of extra developer time for building custom integrations. This collaboration takes care of this for the customers, saving them both costs and time to market as well as delivering a higher quality product. The auto industry continues to move towards consolidation, particularly consolidating the digital cockpits with this -- consolidating digital cockpits. With this position, QNX is even strong -- will be even more strong in their space, given the safety requirements. This provides the potential to win additional designs that will improve overall Hypervisor and our RTOS, our QNX operating system. As a result, our outlook is for further sequential revenue growth and for Q4 revenue to be in the range of $50 million to $55 million, returning to the pre-pandemic run rate. We feel very good about the IoT business right now, but investors should keep in mind the auto industry production headwinds. This quarter, our co-development partner, AWS announced the launch of a complementary product for IVY, called AWS IoT FleetWise. While IVY is called an off take  and can work with any major cloud provider, AWS IoT FleetWise is a micro service that allows IVY insights to be efficiently and intelligently uploaded to the AWS Cloud, where they could support cloud side applications. Another significant development for IVY is Bosch, the world’s largest auto Tier 1 supplier, announced that their new software integration platform will support IVY. This platform is built on QNX RTOS and Hypervisor, showing the potential for upselling IVY and future design to the large and growing QNX installed base. Overall, we’re pleased with the progress we made. Revenue was $128 million, gross margin was 59%. ARR was $358 million, dollar based net retention was 95%. We saw continuous growth in pipeline for unified endpoint security products, and particularly our managed service offering, Guard. As illustrated by comparative wins against CrowdStrike and SentinelOne, as other older signature based players like Microsoft, McAfee and Symantec. Among these wins was another top 10 global automaker, building on the win of the top 10 OEM we told you about last quarter. Other notable competitive wins include an international banking group, a leading European financial services firm and a global marketing agency. In addition to success with larger companies, we’re seeing a lot of interest from small and medium sized business too. Endpoints are protected 24x7 and don’t rely on cloud connection, which is of course cloud connection could be very expensive. I’m sure you all heard about the major security incidence known as Log4Shell, which Caesar has classified at the maximum level 10 for severity. We can confirm that none of our core products, namely Protect, Optics, UEM, QNX, RTOS and Hypervisor, none of those products are negatively impacted by these vulnerabilities. Furthermore, our suite of cyber products, particularly our Protect, EPP and Guard managed service can help customers prevent malware and ransomware that bad actors could try to execute using these vulnerabilities. In recent quarters, we have released a number of new products and announced partnerships that expand our extended detection and response offering, or XDR. In the quarter, we were excited to announce partnership with Okta and Mimecast as well as Stellar Cyber and XM Cyber. Finally, we are pleased that during the quarter, SE Labs, an independent leading -- a leading independent cybersecurity research firm, ranked BlackBerry as the best new endpoint protection solution of 2021. Across the business units, our key vertical this quarter were government, banking and insurance. In government, we closed business with some of the world’s leading governments and government agencies, including the U.S. Navy, who became a new SecuVOICE customer. The Department of Homeland Security, the Dutch government, the U.S. Department of Education, which was -- happened to be a new logo wins for our AtHoc, the spacing of key competitors, as well as Scottish government, U.S. Central Command, the Federal Aviation Authority, FAA and the IRS just to name a few. As previously indicated, I think I said it last quarter, closing certain large government deals in Q4 will be important. In the quarter, licensing revenue was $13 million and gross margin was 54%. Should this sale reach a definitive agreement in January, we will suspend monetization activity and therefore, expect Q4 revenue to be close to zero. However, if not, then we’ll continue to expect revenue to be around the $10 million mark for the quarter. Our non-GAAP operating expenses exclude $29 million in amortization of acquired intangibles, $5million in stock compensation expense and a $110 million fair value gain on the convertible debentures. Given our ongoing investment towards driving top line growth in our core IoT and cyber businesses, the third quarter non-GAAP operating loss was $24 million, and the third quarter non-GAAP net loss was $1 million. Related to this gain, these underlying -- the investments underlying these funds represent a passive interest we had, which were sold and we received a distribution -- cash distribution of approximately $35 million during the quarter. Our adjusted EBITDA was negative $8 million this quarter, excluding the non-GAAP adjustments previously mentioned. Cybersecurity revenue was $128 million, and IoT revenue was $43 million. Software product revenue remained in the range of 80% to 85% of the total, with professional services comprising the balance. Licensing and other revenue was $13 million, given the limitations to our monetization activities due to the potential IP portfolio sale. Total cash, cash equivalents and investments were $772 million as at November 30, 2021, remaining consistent during the quarter. Again, given our investment in our core software businesses, third quarter free cash flow was negative $21 million, cash used by operations was $19 million, and capital expenditures were $2 million. That concludes my comments, and I’ll now turn it back to John. Before I move to the Q&A, let me summarize the key points for the quarter. We saw strength in design activities for our QNX business, achieving a record quarter for design-related revenue, and it looks like it will continue. Macro supply chain headwinds are still impacting vehicle production, but we see an improvement picture, heading into Q4. We made good progress with IVY, including releasing the early access version of the product. On the cyber side, we again seek the sequential growth in billings and revenue including more head-to-head wins against our key competitors. Overall, BlackBerry delivered a solid progress -- we delivered solid progress, beating both revenue and earnings expectations for the quarter. Yes, we have a positive surprise with a higher revenue came in more than we expected from Secusmart product. In the IoT side, touchwood, I think we’re all feeling pretty good about it. As I said, we’re going to get back to pre-pandemic level. So, that kind of composed the math for the guidance between $50 million to $55 million. I don’t want to jinx it, but looks okay. On the cyber side, it relies on a number of deals that are quite big from the government side from a revenue perspective because of the fact that we expect these to close a little later in the quarter. So, the revenue contribution will not be as big as it is, obviously, in the beginning of the quarter, but the buildings will look fine. As I said earlier, we’re going to use that as a basis of our demonstration or -- and our talk at CES at our booth. I hope -- I can’t promise every single one of them you will see at our booth, but we have the battery management systems, we have a car, the wallet. So, I don’t know whether every single one of them will make it to our booth, but I expect quite a number of them will. And…\n And you’ll also see a cockpit, by the way -- sorry Trip. Then also, if we look at the new generation EV players and also the old guard of automobile players, there seem to be now getting on the bandwagon of over-the-air updates. And the more important thing that I talked about earlier about the new AWS -- the new Amazon release is called FleetWise, allow a logical link between the edge of the car to the cloud. So, yes, we do both -- it’s obviously both ways from the cloud to the car and the vice versa. And so, he’s very relevant, and he brings in a lot of relationship particularly with customers and partners. So, that’s very good. So, I don’t know how to describe productivity, but I could tell you one data point that today we have 10% more quota carrier, or what we call the direct quote carrier. We have 10% more direct quota carrier than a year ago -- or the beginning of the year, sorry, than the beginning of the year. As a lot of them are new because we recently hired them, we will see those coming in the next few quarters. If you think about a sales cycle, let’s say, two to maybe three quarters, call it three, I should be seeing some results in either the second quarter or the third quarter next year. So, you noted you saw further pipeline growth within cybersecurity and you also expect sequential billings growth in Q4. So, I feel pretty good about mathematically that we’re looking for a good ARR growth next year. Within IoT, I mean, it seems like you’re quite upbeat on the design win-related revenue, like developer seats and professional services. No, there’s no -- there’s really no direct ratio. I would tell you that if you asked our folks that we’re seeing the former -- the people are more aggressive, the time line than not because whether you’re an autonomous vehicle design or whether you’re in the electric vehicle design or the combination of both, competition is heating up in the auto industry, as you all know. So, time to market is important to them, unlike the kind of the old rule of thumb that a new model come out in the last 10 years. And usually, it takes five to seven years to get the new model out from conception to production. So, there isn’t really a -- you buy more developer seats and therefore, you have a long, bigger production royalty. Now typically, as I said, we see a developer -- a win and then a developer seat licenses as well as professional service. Usually, you add about three years down, you start seeing production. Nowadays, I have seen numbers that are a little bit off -- plans, I shouldn’t say numbers. And once the royalty starts growing, usually lasts in excess of seven years. Just one follow-up question, sales and marketing, I was under the impression that you’re planning to ramp it up more significantly, it’s been flat this past quarter. We don’t do as much of marketing in QNX or IoT because especially in the auto space and some of the GEM vertical, we are already a reasonably known name and known entity. So, we don’t need to do as much. So, you would see that going -- building up and going up quite a bit, in fact. I would like to turn the call back over to John Chen, Executive Chair and CEO of BlackBerry, for closing remarks. And as we mentioned, we’re participating at CES in Las Vegas in January. No doubt, a key highlight will be the demonstration of our IVY technology, including illustrating how IVY use edge computing to create insight for sensor data, both hardware and software-defined sensor. We will be hosting a hybrid in-person and live stream demonstration of the IVY technology, followed by an investor Q&A session with Mattias Eriksson, the President of the BlackBerry IoT Group, at 8 a.m. Pacific on Thursday, the January 6th. I’d like to wrap up by wishing all of you -- thank you for joining us and wishing all of you and investors and everyone on the call here, a happy holidays and a safe and successful new year."
}