{
    "symbol": "BB",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-31 21:45:19",
    "content": "  Operator: Good afternoon, and welcome to the BlackBerry Fourth Quarter and Full Fiscal Year 2022 Results Conference Call. My name is Brent, and I will be your conference moderator for today’s call. I would now like to turn today’s call over to Tim Foote, BlackBerry Investor Relations. Good afternoon, and welcome to BlackBerry’s fourth quarter and full fiscal year 2022 earnings conference call. After I read our cautionary note regarding forward-looking statements, John will provide a business update, and Steve will review the financial results. We’ll indicate forward-looking statements by using words such as expect, will, should, model, intend, believe and similar expressions. Forward-looking statements are based on estimates and assumptions made by the Company in light of its experience, and its perception of historical trends, current conditions and expected future developments as well as other factors that the Company believes are relevant. As is customary during the call, John and Steve will reference non-GAAP numbers in their summary of our quarterly and full year results. For a reconciliation between our GAAP and non-GAAP numbers, please see the earnings press release published earlier today, which is available on the EDGAR, SEDAR and blackberry.com websites. With that, I’ll turn the call over to John. I am pleased to report that we recorded the first $50 million plus quarter since the start of the pandemic, despite the ongoing challenges for the auto industry. Revenue for the quarter came in at $52 million, which is 21% sequential increase and 37% year-over-year growth. Gross margin also increased to 85% and IoT ARR increased for the fourth consecutive quarter to $93 million, which is up 11% year-over-year. In addition to seeing a modest increase in production-based royalty, we set another new record for quarterly revenue from design activities. This strength has not only delivered near-term revenue, but also points to long-term business volume once these design enters into production. In addition, we have a good line of sight to upcoming professional services backlog from confirmed design wins and are hiring additional heads to meet the demand. Major OEMs have indicated continuous supply chain headwinds, particularly chip shortages, although they expected the situation to largely improve as the year progresses. The conflict in Ukraine has added huge -- a further disruption to an already challenging environment for the auto industry, and we will continue to monitor that impact. You may recall that over the last few years, we have seen a significant increase in the proportion of the QNX business from safety-critical foundation software, such as ADAS, advanced driver assist, digital cockpits and autonomous drive. This strategy to focus on functional safety plays to QNX strength and is validated by both, the market trends towards ECU consolidation as well as software-defined vehicle. We recorded 17, one seven, 17 new auto designs and 28 wins in the general embedded market. Once again, we won business with leading automakers and Tier 1 suppliers, including Hyundai,  (ph), Bosch, Visteon, Denso. In Jan, we recorded wins in multiple verticals, including defense and aerospace, industry, industrial that is, as well as medical, our strongest GEM segment. Like in auto, we have the highest level of functional safety certification for medical, and we’re seeing increased momentum there. The expectation is for successful POCs to lead to design wins, i.e., a commitment from customers to design IVY into vehicles. The CES demonstration also allowed us to showcase two of our many potential applications that IVY can enable, Car IQ in-vehicle payment and Electra’s AI-driven battery management application were both very well received by OEMs and are included in the IVY POCs. Billings not only grew double digits versus Q3, but they also increased year-over-year. Our Guard-managed XDR cybersecurity team, in line with other leaders in the space has seen a significant increase in threats in recent weeks. In particular, Waifu malware, though -- that aims to take the victim’s service offline is at an unprecedented level. Some of the most prominent example of this currently identified across the industry, including the Hermetic Wiper that has been seen in the cyber attack in Ukraine, Latvia and elsewhere. Blocks have shown that our product -- our Protect product, Protect EPP, has been blocking this malware at BlackBerry customers’ sites before it could execute. The same is also true for WhisperGate, another leading example of wiper malware that has targeted Ukrainian government as well as Ukrainian nonprofit and IT organizations. In fiscal year ‘22, we released 48 new products. Among the cybersecurity products, pipeline growth is strongest for the following three: Gateway Zero Trust Network Access or ZTNA, Guard-managed service and Persona behavioral analytics. On the marketing front, we’re going to leverage the strength of the Cylance brand for our Cylance products. So, let me provide you with a couple of recent wins -- recent examples of wins. The customer, like many others, was struggling to  (ph) a 24/7 security operations centers and held a competitive tender process between BlackBerry, CrowdStrike and Arctic Wolf. The second is with a leading manufacturer based in Asia that selected BlackBerry over CrowdStrike’s, Fortinet and Carbon Black. Following a detailed POC, they selected BlackBerry because of our product’s strong performance, uncovering multiple threats during the trial. Legacy secure  based vendors still account for a significant portion of the overall market, especially with SMB customers. After a vigorous assessment that included McAfee, Symantec and CrowdStrike, they bought approximately 2,000 -- 3 years license for our Guard Advanced product because we detected a number of threats that other didn’t and as well as providing a higher level of customer services. Building on the progress we made last year in ramping the sales force, we have been successful in adding further industry experience to the cybersecurity expertise we already have at BlackBerry. This quarter, we not only recruited sales leaders from direct rivals, but product development leaders also. So, we’re really pleased of our ability to attract and retain high-quality people. As stated earlier, ARR came in at $347 million. However, revenue for the Enhancing SIM-based Licensing or we call ESBL, are also ended as a result. Recently, we have seen a trend towards some less feature-rich UEM products being sold by some of our competitors as part of the bundles or enterprise license agreement. We’ve seen some smaller, more price-sensitive customers chose to use the \"free\" UEM product that’s come with a bundle to save incremental costs at the expense of security. To reinforce this point, this quarter, we secured UEM renewal with the U.S. Air Force, the U.S. Department of Defense, the U.S. National Grid as well as a number of international governments including Poland Ministry of Foreign Affairs, Northern Ireland Department of Finance and Personnel, along with Swedish and Italian governments, just to name a few. Among the major bank this quarter, we renewed with Deutsche Bank, along with well-known American, Canadian and Indian banks, two major Swiss banks, including the Swiss National Bank and a global credit card company. We also recently renewed for three years with global law firm, White & Case. During the quarter, we also successfully upsold Cylance cybersecurity product to this and other UEM customers. Before I wrap up my comments on cybersecurity, I’d like to share that going forward we will start to provide quarterly billings information for our cyber business as part of our ongoing reporting. I’m pleased to report that the transaction has successfully cleared a regulatory review stage, having received approval from the Canadian Government Investment Review Division, on March 22nd as well as the U.S. HSR approval, the antitrust approval that is, shortly before that. Following the sale of the legacy portion of the IP portfolio, we will still retain all patents related to our core IoT and cyber software businesses. We will, of course, keep the door open for future monetization, but revenue is likely to be minimal in the near term. Also, our cash position will be strengthened, enabling us to further invest for growth in our core markets, i.e., the QNX, IVY as well as cyber. In the quarter, licensing revenue was $11 million, beating expectation. As usual, my comments on our financial performance this past quarter will be in non-GAAP terms, unless otherwise noted. Our non-GAAP operating expenses exclude $22 million in amortization of acquired intangibles, $4 million in stock compensation expense, a $165 million fair value gain on the convertible debentures. As John mentioned, we are continuing to invest in our core IoT and cyber businesses, including headcount growth and new product development to drive top line growth. This quarter, non-GAAP operating profit was $8 million and non-GAAP net profit was $6 million. Our basic GAAP earnings per share was $0.25, while non-GAAP earnings per share was $0.01 in the quarter. Cybersecurity revenue was $122 million, and IoT revenue was $52 million. Software product revenue remained in the range of 80% to 85% of the total, with professional services making up the balance. Licensing and other revenue was $11 million, given the ongoing limitations to monetization activity, prior to closing the sale of the transaction that John referred to. Total cash, cash equivalents and investments remained consistent at $770 million as at February 28, 2022. Despite the ongoing investment in the business, we generated positive free cash flow of $8 million. That concludes my comments, and I’ll now turn the call back to John. For the cyber business, we expect to deliver billings growth between 8% to 12% this fiscal year, mainly as a result of increased traction from our security products. In fact, we expect to see higher billings in all four quarters when compared to the same quarter in the prior year. However, we model revenue for the year in total to be broadly flat year-over-year, factoring in the time for billings growth to convert to revenue. Despite having delivered three consecutive quarters of billings growth of cyber, we’re not satisfied with our results, particularly in ARR. We will -- we feel, however, positive about the trajectory of this business for a number of reasons: first is the cyber market is strong and demand appears to get stronger. A good proxy for this is winning awards in independent testing, example, including receiving the maximum AAA rating in the SE Lab’s recent Enterprise Advanced Security Test. Third is that we have increased the number of sales reps since the start of our fiscal year, and we’ll continue to step up and expand hiring. For the IoT business, we expect to see continued strong growth despite the ongoing headwind for the auto industry. We expect revenue for the year to be in the range of $200 million to $210 million, representing a 12% to 18% growth year-over-year. Despite the macro environment for the auto industry, we based our confidence on the following factors: first, the visibility of the backlog of professional services from design wins already awarded; second, the strong pipeline of potential new design wins this coming year; and thirdly, the upward trend in the royalty ASP in the new designs. The IoT business is executing well despite industry-level challenges, and we’re encouraged by the line of sight we have for the years to come. IVY continues to execute well with both, a new product release and strong demand for POC trials in the quarter. Our cybersecurity business is tracking in the right direction, once again, delivering solid building growth and recording some encouraged head-to-head wins. Despite our ongoing investment in the business, we generated positive operating cash flow and net profit this quarter. Your line is open. General embedded, you see the production being a lot sooner on average, probably a couple of years out versus 6 or 7, or 5 or 6 years. So, -- and typically not as big in terms of dollar on the ASP, or it is a big organization like a hospital or medical devices, then the volume isn’t as big as the car industry. Now general embedded vertical, I think we -- I mentioned medical, that’s a really good field. The IoT, a lot of them -- I mean, of course, the sales personnel, but also we have a lot of backlog in professional services. Your line is open. Like what kind of activity was, say, before the Ukraine war and while we are in the war, you’re getting a lot of interest in Cylance. So, the cybersecurity world is -- there are a lot of more threats and attack. Like everybody else in the market have seen, the raw demand is really going very fast. So, you can see the second generation, the AI/ML-based companies, like ourselves and some of the names, key names in the industry we could do a lot of -- a good success rate in replacing legacy implementation. So, that’s the second one. Cylance is particularly strong in the mid-market, small, medium business mid-market. And I think we’re seeing our activity picked up quite nicely, partly because of the Guard software that we released, probably by now, it’s about a year. And then, last but not least, remember, we’ve been hiring aggressively for over a year now in the sales headcount. And so, it’s starting to pay off in some area. And last but not least, we’ve been able to attract some very strong industry talent from the cyber world. Still have ways to go, but it’s starting to come together. Your line is open. And it’s just -- you mentioned UEM is obviously strong in large enterprise, but then Cylance is strong in SMB. Yes, it’s a great question. So, we now have three go-to-market teams that is coordinated under -- by region under one senior management, and so -- because of John G. And so, the three market -- go-to-market team are the -- think about it, strategic accounts, which are the large government as well as banks, regulated industry, the SMB market and the channel team. So, our objective of the first team is to secure our base business in the strategic accounts and then upsell them into -- with technology that could apply to that UEM base, for example, zero trust technology, which is -- the gateway is probably the most talk about right now, particularly the U.S. government. The new Biden administration budget has specific money allocated for zero trust, and they want every agency and every arm forces to do that, to be able to implement zero trust as part of the overall cybersecurity protection. So, we have that business, and we’re already in many of those institutions. One approach is through the Guard services, the managed service, which SMB typically needs that kind of help for either augment their resources or replace their resources because they can’t hire fast enough. I’m not at liberty to talk about it right now, but in 90 days, I will. So, that’s the kind of how we go in with each different type of category of customers. Because one of the things that investors look at as you look at the revenue in that segment, in the previous year, it was quite a large number. So, I would say, there’s still a lot of potential for this noncore set of patents. Although we have a very young -- we typically have, even with the noncore, somewhere around 8 to 10 years type average lifetime with the patent still remaining. So -- but the -- if you notice that -- which you pointed out, the last couple of years -- or the last few years, we have some good success. And so, now, we need to go -- the business needs to go cultivate pipeline for the smaller name, which typically takes a little longer time, a lot more back and forth. And so, I think the numbers we have done in market test the numbers, we think it’s very fair to both sides. I would like to turn the call back over to John Chen, Executive Chair and CEO of BlackBerry for closing remarks. I’m pleased to announce that -- by the way, I’m pleased to announce that on May 18, we’ll be hosting a hybrid in-person and virtual Analyst Day from San Ramon, California. In the case of Mattias, we’re also going to prepare to annually talk about backlog that will be during that call -- that meeting also. So, I really encourage investors to join us and hear about key developments of our product and strategy as well as financial focused sessions that will provide additional color on the IoT and cyber business. Ladies and gentlemen, this concludes today’s call."
}