{
    "symbol": "BB",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-25 02:57:04",
    "content": "  Operator: Good afternoon, and welcome to the Blackberry First Quarter and Fiscal Year 2022 Results Conference Call. My name is Jesse, and I'll be your conference moderator for today's call. I would now like to turn today's call over to Tim Foote, Blackberry Investor Relations. Good afternoon, and welcome to BlackBerry's first quarter fiscal 2022 earnings conference call. With me on the call today are Executive Chair and Chief Executive Officer, John Chen; and Chief Financial Officer, Steve Rai. Good afternoon, everybody, and thank you all for joining us today. The main headline for this quarter is that we have organized our software and services business around our two biggest market opportunities, mainly IoT and cybersecurity. In the past few years, we have done a good job in product development. Last year, we launched 59 new products, and the year before, over 30. Later, I'll discuss about - more about the XDR product that we have launched this quarter, and I will provide you an update on BlackBerry IVY. As you all know, at the same time, we were delivering our products, many of you know that we've been investing in our go-to-market as well. We have in a number of -- last number of years, especially the last two quarters, we have turned up the noise on our marketing, expanded our channel and partnerships, and invested more feet on the street. So my comments on our financial performance for the fiscal quarter will be in non-GAAP terms, unless otherwise noted. As John mentioned earlier, starting this quarter, we are no longer adjusting GAAP revenue for deferred revenue acquired. Our non-GAAP operating expenses exclude $32 million in amortization of acquired intangibles, $6 million in stock compensation expense and a $4 million fair value adjustment on the convertible debentures, which is a noncash accounting adjustment largely driven by market conditions. The first quarter non-GAAP operating loss was $23 million, and the first quarter non-GAAP net loss was $27 million. Non-GAAP earnings per share was a $0.05 loss in the quarter, and our adjusted EBITDA was negative $6 million this quarter, excluding the non-GAAP adjustments previously mentioned. Software product revenue remained in the range of 80% to 85% of the total, with professional services comprising the balance. Licensing and other revenue, as John mentioned, was $24 million. Total cash, cash equivalents and investments were $769 million at May 31, 2021, a decrease of $35 million during the quarter. Cash generated from operations was negative $33 million, and capital expenditures were $2 million. Bear in mind, the first quarter of our fiscal year typically has a higher cash requirement due to payment of annual bonuses and other demands at this time. That concludes my comments, and I'll now turn the call back to John. Before the Q&A, I'd like to update everybody on a few things. Although we have organized along the go-to-market lines, there are a number of future high-growth opportunities that our factory lab is working on that actually harness the power of all the entire technology portfolio. You may or may not remember at CES a couple of years ago, we demonstrated an early version of how our Persona technology that identifies inappropriate access from the user behaviors can be applied to drivers of vehicles. This applies not only to XDR, but also the increasing sensor-rich auto environment, autonomous drive and smart cities. The third area is related to the recent U.S. SBOM, stands for software bill of materials, the executive orders that aim to secure the software supply chain. This comes in light of the recent incidents, including Solar Winds and the Colonial Pipeline threat -- intrusions. Combining products from our IoT products, including our Jarvis code-scanning tools, our QNX-embedded operating system and our Certicom technology with our prevention-first AI-driven cybersecurity product and services, means Blackberry offers a comprehensive approach to this issue. So before we open the line for Q&A, I'd like to summarize the key messages again. We have organized our software and services business around our key market opportunity, strengthening our management team in the process. QNX made solid progress this year -- this quarter, sorry. We continue to demonstrate real progress with IVY with tangible steps forward, such as the launch of the Advisory Council as well as the first investment by the Innovation Fund. We launched 2 new important products that expand our XDR strategy, and the AI-driven prevention-first approach continues to be our focus. We're also increasing headcount -- sales headcount, and pipeline is growing, particularly for our new UES products. Our main focus is on growing the top line, and therefore, we'll continue to increase investments in both our software business units as we see double-digit billing growth this year. And with that, I would like to ask Jesse to open the line for Q&A, please. Participants, we will now begin the question-and-answer session. Speakers, our first question is from the line of Daniel Chan of TD Securities. Your line is now open. Typically, the highest -- it usually is four to seven years. And typically, it's peak at 4, and then it starts moving down towards the end of the life cycle of a car. But before I answer that question, let me make one more comment on the backlog because I have also gotten some feedback regarding that our backlog number is very conservative. I would tell you that it is on a conservative side, and we get it from -- directly from the OEM when we win the design win and they gave us the estimate. So in the future, when we have a very solid methodology so that we just don't kind of do much of the guessing and we get a very grounded set of math, you will see that backlog number to go up, and show you all that we're going to include that. They're there to help us to define use cases, particularly in the vertical that they operate in, that the IVY could be of great help. And I don't want to exclude any OEM, but I don't think OEM would want to do that. Your line is now open. So our strategy is continue to expand our footprint in the regulated industry, and we're on the more price-sensitive and kind of the nonregulated industries. We want to make sure that our UES platform, which is our endpoint security platform, also connect and run on it. And obviously, one of the largest installed base outside of my space here -- outside the regulated is Microsoft Intune. So this is why that we're excited about the fact that we'll have Intune released -- connected release in end of August, I believe, yes - end of August. So basically, the strategy is continue to expand the footprint that we have in the vertical like financial, healthcare and government. And then the UES is, of course, expanding on all the cybersecurity antivirus stuff. No, that's very helpful. And just my follow-up question, just on the gross margin by division. I think the best way to answer the question is that, especially with cybersecurity, we're trying to go to the enterprise software timeless model, and so we have not deviated from that. So the gross margin ought to be maybe highly competitive, but they have the high-volume growth, somewhere between 75% to 80%. I think that will be a very good target to shoot for, for the cyber business. Timeframe, I think probably a year out, if you want me to guess that, like based that on, because if you recall, we actually have a lot of increase of headcount feet on the street this quarter. In fact, our quarter ends in August. In fact, some of them have -- has committed to sign-on and is yet to start. And with that, if I give them the time for 9 to 12 months, 6 to 9 months getting up to speed and at the same time, cultivating the pipeline to make the sales cycle work, I think about a year out, I should see some good results from this class of incoming team members here. First of all, follow-up question on sales. As I said earlier, also, we just recently had a lot of increase of headcount in sales. So the booking need to be back-ended this year and then continue on for next year, obviously. We do -- on bookings, we do expect that towards the end of the year, we do expect a double-digit percentage growth. On cybersecurity revenue, in -- for this quarter, based on the numbers -- the historical numbers and GAAP numbers, I did take a step down. I mean, I imagine they purchased last year. I think it's quite -- in general, it's quite steady and stable. We didn't see the growth that we're hoping for, but it will be forthcoming because we just released the EDR products. We talked about cloud -- the cloud version, the latest Optics 3.0. Actually, a quarter ago. So we're seeing that pipeline being built up, and it's looking for them to come into being billings and business. That's our job to make sure that, that message comes across. One thing you can look at the Blackberry-Cylance product combo, none of these major viruses, yes. None of these major viruses have actually hit our user base, touch wood. And so -- anyway, that tells you the power of our product. There are three parts of the business model, they way I look at. There could be a design win, there could be a production part of it in the software, and there could also be a subscription part to the software that is running and managing the batteries. So first off, it's a little early for me to answer the question. There is a demo being put together, and it will not be available until probably the end of this calendar year, as we -- as full engineering team just started working on it. So -- and in the meantime, we'll try to figure out the question -- the answer to the question that you posed. Again, I have a strong preference for this to be either usage-based or monthly recurring based. The second question I have regarding your exceptional machine learning models you have, and definitely, currently, your Cylance, machine learning AI models work with only your products. Because your product, which is gateway security. And again, that's another incremental revenue opportunity you can get over a period of time. So I was just thinking, since you have the best training models available, just licensing them or any other business model that can give more revenues to you. And again, very good execution on the product front. We haven't thought about licensing those models to other application, maybe I would say that. However, we are licensing that -- or licensing is the wrong word, sorry. We are embedding the lightweight agent in IoT devices, including like medical equipment and industrial equipment. So -- and some of those other technology we have, like the mobile threat detection and prevention, also uses the model. From a business perspective, we didn't think about doing licensing and where I could explore that, but we are more focused on doing embedding in endpoints. Can you maybe -- either -- this one may be for both you and Steve, and I'll just make it one question. Obviously, you disclosed last quarter that you had 3,497 employees globally. And then earlier in this call, you talked about increasing the number of reps by 23% at the end of Q2. In terms of new cybersecurity products, obviously, you're talking about giving the team time to ramp up. But maybe talk to us a little bit about what you're seeing from inbound client interest because you've launched a significant number of products, been on a bit of a role here in terms of new product launches. I would say, if I think about the larger opportunities and sites that we have won, the key winning product, it is the Protect. So this is why you heard me say a number of times on this call today, we're going to try to double down on the Protect side because it's a differentiator for us. And in addition to that, the AI/ML model that we have could be embedded and it could embedded without having to be updated, it's been valid for a very long time. And now, what we're trying to do is to position the XDR product. We talked about the new one called Gateway, and that provides zero trust architecture, so enterprise, especially like government, are extremely interested in those two areas. I'll now turn the call back over to John Chen, Executive Chair and CEO of Blackberry, for closing remarks. I know it's late in the East Coast, so I want to just -- hopefully, you are doing well. And thank some of you who have attended our annual shareholder meeting yesterday, and I'm looking forward to speaking with you folks soon."
}