{
    "symbol": "BB",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-22 21:41:05",
    "content": " Good afternoon and welcome to BlackBerry's Second Quarter, fiscal 2022 earnings conference call. With me on the call today, our Executive Chair and Chief Executive Officer, John Chen, and Chief Financial Officer, Steve Rai. After I read our cautionary note regarding forward-looking statements, John will provide the business update. This call is available to the general public by call-in numbers and via webcast in the Investor Information section, at blackberry.com. Some of the statements we'll be making today constitute forward-looking statements and are made pursuant to the Safe Harbor provisions of applicable U.S. and Canadian securities laws will indicate forward-looking statements by using words such as expect will, should model, intend, believe, and similar. Forward-looking statements are based on estimates and assumptions made by the Company in light of its experience and its perception of historical trends, current conditions, and expected future developments, as well as other factors that the Company believes, are relevant. The Company has no intention and undertakes no obligation to update or revise any forward-looking statements, except as required by law. As is customary, joining the call, John and Steve will reference non-GAAP numbers. Placing the earnings press release published earlier today, it's available on the EBCA CVA, and .com website. And with that, I'll turn the call over to John. Good afternoon, everybody, and thanks for joining the call today. When you say non-GAAP numbers, it's actually the revenue number we referred to are all GAAP-based numbers. Starting with our headlines this quarter, the business performed well with revenue for all the free business beating expectations. The IOT business unit performed better than expected with strong design-related activities, partially offsetting the impact of the global chip shortage on production royalties. Licensing revenue reflects the restriction on monetization activity from the ongoing patent sale negotiations, which I will talk about more in detail shortly. This quarter, BlackBerry generated a positive operating cash flow following the strengthening of our IOT leadership team in one, we have appointed John GO. Hi, Teo to lead our cyber security business unit. Commencing October for which is, a couple of weeks from now, John with  the McAfee President and Chief Revenue Officer running the enterprise and consumer cybersecurity businesses. Revenue came in at 40 million, which is better than expected, primarily due to ongoing strength in the design activities area. Gross margin remains strong at 83%, We present IOT AR increased to 89 million as you are aware, the auto industry experienced some significant headwinds in Q2 due to the global 'til global semiconductor chip shortage. This impacts production volume, particularly in North America, Ford, for instance, major customers of ours, reported 700,000 launched units of production in calendar Q2, production base royalty, historically, the largest single component of our Q and X revenue. You know, the revenue you saw also we generated from design activities prior due to the vehicle entering production. This part of the business remains very vibrant and we continue to generate strong development , and professional services revenues. As a result, total IoT revenue in the quarter was better unexpected. Furthermore, these design wins will translate into future production base royalties. As we look ahead to the rest of the year, we continue to see the headwind for vehicle production. The problem is future has shifted from the surprise of wafers to the mall, the back-end assembly and testing issues, largely due to spike in COVID cases in Asia, as well as some of the accidents going on in Asia. For example, Diamond recently indicated they're expecting a lessening impact by Q4. Just sorry as those dragging, on the other hand, see challenges persisting in Q 2022. In terms of outlook, we continue to see depart the past quarter as the low point but significant headwinds. Are expected to continue into Q4 and -- Q3 and Q4, and perhaps even beyond that, all will be at a sequentially decreasing impact. We're comfortable with the current IoT revenue consensus, meaning the full-year revenue outlook remains unchanged. As mentioned, despite a supply chain issue, QNX QNX continued to win new designs at a very solid pace. In the quarter, we had 23 new design wins, with seven in auto and 16 in the General Embedded Market. We are the trusted go-to-supplier and market leader in auto photo malls were delighted to announce that we now have design wins with 24 of the world's top 25 electric vehicle automakers, as is measured by volume. Haven't been selected most recently by Daimler as part of their design that is as part of their, ED design business. From the 23 or 25 we had last quarter, these 20 full-year items between down represent 82% of the global EV market -- for production, sorry, 82% of global EV production. I'd like to expand on a couple of design wins to get investors more colors as to why QNX was chosen and why we are the industry leader, the friends who are the automotive Q1 bet excluding food digital comp, and Gateway solution for a Chinese EV OEM using the QNX real-time operating system and hypervisor. In the Chinese automotive industry, given this reputation for safety and security. Q and actual was chosen about software solution from both domestic, our multination and as well as multinational competitors. Production is expected in 2022, which is next year, and run for around five years. The customers select QNX for an autonomous 3D robot, robot warehousing system, and head of the leading competitors. QNX was chosen for its functional safety potentials, production is expected to start this year and continue for five years. Design wins, including medical, diagnostic, industrial process control, and a thermal control system for power plant. This is a SaaS version of our software composition and analytics 2, which was previously offered as a  book service engagement. Java's 2.0, which includes a market-leading binary  scanner, is an important part of how BlackBerry can assist the customer to achieve compliance. With the reason , software deal and materials, software viewing materials, executive orders mandated by the Biden administration. Moving to a brief update on IVY, we're pleased with the ongoing progress being made. On the product side, we are scheduled to release an early assets version of the product in October that will enable further engagement with Owens and also allow demonstration at CES in January. And speaking of applications for our IV to be embraced by automakers, we recognize that it is important to demonstrate IV value to them, management apps that we announced last quarter. This new application enables in-vehicle payments and is being delivered through a partnership with , a California-based startup. Dollar-based net retention was 95%, as we mentioned earlier, joined you will Matteo will be joining blackberry to meet the cyber security bond brings within many years of cyber security industry experience. During his six years as President and Chief Revenue Officer at McAfee, he delivered both double-digit growth and margin expansion for the enterprise, the , as well as the consumer divisions. John will be on the progress that has been made in the recent quarter with a Cybersecurity business unit, go-to-market engine. As mentioned, this was a good quarter. To realize this increased pipeline investment, if our direct sales force in particularly hiring quota-carrying sales heads, continues, we're also making further progress to the channel. the program also has significantly increased both channels driven pipeline generation and new logo buildings mainly business unit, go-to-market engine. The addition of John to the team completes the split of the software You may recall that during the Q2 earnings call a year ago, we targeted using MSSP, sorry, to quickly scale our garden-managed service offerings. Today, one of these partners I'm happy to report managed more. The customers  like at BlackBerry due to us near a 100% malware detection rate, our lightweight engine, and flexible deployment options, both in the cloud as well as the stand-alone factory networks. The second is at Fortune 100 financial services Company, BlackBerry displays, Microsoft Defender would protect and . a leading independent research firm based in London, has performed a rigorous set of tests on our EPP and EDR products  and optics. Rod and simply loading no malware onto an endpoint, which typically mastering inability of traditional nature of these vendors for preventing dude a threat that breached tests includes, instead of price real-time, real-world of hacking tactics. They have tried comprehensive techniques to evade our defense and concluded that Protect and Optics provide complete protection -- prevention complete protection, as well as 0 false-positive. This third-party validation of our product, not just our EV -- EPP, but also our EDR, demonstrates how we have successfully crossed the robotic app to competitors who have recent product launches. The market is now recognizing some of the unique differentiated abilities of our fiber products, one of which. As in the previous quarters, we're seeing new malware and ransomware hitting the headline on an almost daily basis. On AI engine, the most mature in the industry continues to provide zero-day  against a whole the strength in the quarter, our product consensually brought new profile ransomware, such as high long bid, Ragnar locker, and many more before they could do any damages. On the UEM front, we're continuing to invest in our roadmap delivering enhancement that adds, adds, that add the most value to customers, we recently announced an enterprise can now. And it's one phone Blackberry, leading security while enjoying a seamless and native user experience with Microsoft 365 productivity apps. This past quarter, we secured important new renewals. We've government agencies such as IRS the Department of Homeland Security, the U.S. Marine Corps, the US Army Corp of Engineers, the UK Ministry of Defense, the U.S. Air Force as well as leading enterprises such as General Dynamics and. We also won a number of new logos such as say, fresh national Industry, Institute for criminal research, and, uh, Tel - Aviv stock exchange. Turning now to licensing, as I mentioned earlier, negotiations to sell a portion of the patent portfolio related to mobile devices, messaging, and wireless networking are ongoing. And we are making significant progress since our last earnings call, including preliminary agreement of many of the key terms of the deal. Normal naturally, given this backdrop, we will continue to limit monetization activities for the remainder of this fiscal year. Info revenue for both Q3 and Q4 is expected to be similar to Q2, which is Had $10 million per quarter. While we expect the seller to conclude essentially, the process has taken longer than we expected or anticipated. this quarter, we will have other options, including additional interest to parties. We delivered the second-quarter total Company revenue of 175 million, second-quarter total Company gross margin was 65%. 1, 000 000 quarter operating expenses were 143 0000000. Our non-GAAP operating expenses exclude 32 million and amortization of acquired intangibles, 11 million in stock compensation expense, and 67 million. Fair value adjustment on the convertible debentures, which is a non-cash accounting adjustment prone to large swings driven by market and trading conditions. In the second quarter, non-GAAP operating loss was 30 million, from the second quarter, non-GAAP net loss was 33 million. Our adjusted EBITDA was negative 14 million this quarter, excluding the non-GAAP adjustments previously mentioned. Licensing and other revenue were 15 million, as John mentioned, our IP monetization activities remain limited while negotiations for the potential sale continue. Total cash, cash equivalents, and investments were 772 million as of August 31, 2021, an increase of 3 million during the quarter. I'm pleased with how the business performed, beating revenues expectations for all the businesses, and deliver positive cash flow. This is software business unit is already delivering results, and we're adding additional relevant industry experience. QNX  design activity remains very strong, and we are weathering the impact of the chip shortage as well. We're now also making good progress with IVY, and with that, I like actually the Operator to open the line for Q&A, please. To ask a question, you may press star one on your cellphone keypad. If you are using a speakerphone, please make sure your line isn't muted. Again, press star one to ask a question. Licensing, of course, we already explained, so I don't have to go into much detail on that, I think we're going to have a $10 million quarter for the next 2 quarters for the second half that is,  the quarter and it had something you do with the fact that we are -- we're not going to monetize. Regarding IoT, the only wildcard, so to speak, is the chip shortage and the impact of that. A good example will be Ford believes they could, they are improving and GEM also is, although they going to shut down a couple of factories in Q3. But I think for me manage you, it's improving versus the first half of the year. Euro, however, is still had about ten to 15% impact on the product until it's the Asia Pacific. So-net of all that, if we are in that range without any dramatic departure then the numbers that we expected in the second half still hold. And a big part of that, of course, is we are winning some very strong design, wins. that bring us more developers fees, revenue, as well as professional services revenue. The activities in the pipeline have been very strong in the last quarter into So putting it together, it's actually a good thing, except that it might take time to ramp up. So, the  of conversion of the pipeline with the newest sales force is the only wildcard. But the goodness in this area is, even if it takes longer, these things this business. We got a couple of large government deals with some of the government and especially in North America, some of those need to come to fruition. And then we expected and do so those, are the basis of our forecast second-half seem to be a bigger number, a stronger number than the first half that's correct. It's slightly early to tell, but I'm dying to hear his experience of growth because he was being able to grow both consumer business and enterprise business as McAfee when he was running for president and McAfee and the CRO. On the other hand, the investment that we made in the channel, the investment we made in Pipeline, the investment we make in partners and engineering, and the investment we make in hiring what's . And we have a couple of quarters ago, we hired a pretty good head of professional services. probably for this year, and I think -- I don't think in the future years it will continue to be the same. And semiconductor for the whole semiconductor industry auto, it's not really that. It is not 100%, obviously, it's -- it's probably like more like 15% of the market. And so, I expect that our royalty rate to go back into some kind of right in the last couple of two, three years. Proportion \n I -- it's more like a perpetual license, selling \n Okay. One more if I may, Cybersecurity ARR was flat sequentially. While you've been saying that the pipeline has been growing, just wondering when we were going to start seeing that metric."
}