{
    "symbol": "ADT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 12:08:03",
    "content": " We also posted improved adjusted EBITDA up 11% year-over-year, and over $550 million of adjusted free cash flow, up 20% year-over-year. Our commercial revenues grew 10% for the full year, and our solar business ended just under $800 million in revenues for 2022. Total company revenue was $1.6 billion for the quarter and $6.4 billion for the full year, up 21% versus prior year including the benefit of our solar acquisition. Our recurring monthly revenue or RMR from our subscriber base grew to $374 million or up 4% year-over-year, a record for the company and a strong reflection of the benefits of our higher average pricing, growth initiatives and improved customer retention. This stronger revenue translated into higher adjusted EBITDA, which for the full year was $2.45 billion, up 11% versus prior year. And for the full year, this segment delivered $4.4 billion in revenue, an increase of 6% or $233 million versus last year. CSB Adjusted EBITDA increased by $204 million or 10% for the full year, and was driven by the increased revenue combined with cost efficiencies. Our installation revenue, in our direct residential business, exited Q4 over $1,300 per home, up 21% year-over-year. We delivered total revenue of $328 million in the fourth quarter, up 15% versus prior year. This strong revenue performance drove adjusted EBITDA of $127 million for the year, up 32% with expanded EBITDA margins for both the quarter and full year. Adjusted free cash flow was $269 million in the fourth quarter and $558 million for the full year, in line with our guidance range and up 20% versus prior year. Following this repayment, we have no meaningful maturities left this year and will turn our focus to addressing the $750 million due next year with manageable debt maturities, limited variable rate exposure and our strong recurring revenue mix, we are well-positioned against rising interest rates. With margin expansion in all three segments, this top line growth translates to adjusted EBITDA of $2.525 billion to $2.625 billion also representing growth of approximately 5% at the midpoint and in a newly added guidance metric we are also forecasting adjusted earnings per share of $0.30 to $0.40 for the year versus $0.24 in 2022. We expect adjusted free cash flow in 2023 of $525 million to $625 million, which includes a roughly $180 million year-over-year headwind from cash interest. As a result, our adjusted free cash flow, including the benefit of interest rate swaps, is expected to be $600 million to $700 million or growth of approximately 20% at the midpoint. As an example for the full year 2022, our adjusted free cash flow grew by 20% year-over-year to $558 million while the first quarter of 2022 was negative. They're coming off the back of our rate to 2022 I think our guidance for 2023, 5% revenue, 5% EBITDA and 20% of free cash flow growth. Manav, your line is open. Manav, your line is open."
}