{
    "symbol": "BIOX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-08 14:46:04",
    "content": " We are for the first time reporting revenues associated to the HB4 technology, with $12.4 million recognized in the quarter for HB4 wheat, representing a 94% increase when compared to contributed goods reported for the HPB4 program in the year ago periods. Enrique will explain the drivers behind the current performance, but I would like to highlight that what we are seeing today is the outcome of decisions that we took many years back, only modestly reflecting initially HB4 sales and not accounting in any form for the growth we expect from our recent merger and international expansion. Enrique, the floor is yours. Enrique, the floor is yours. We expanded inoculant sales in an important target region like Brazil and we also reported HB4 wheat revenues for the first time, which represented more than half of the Seed & Integrated Products revenues in the fourth quarter standing at $12.4 million. While IAS 29 application and standard revenues about the comparable year, it has the opposite effect on gross profit constricting the reported metric by almost $5 million versus the comparable gross profit and therefore reducing margins to 34.5% on the reported metrics. This number excludes $3.2 million in costs associated with a pre-launch ramp up of inventory for the HB4 program, as we continued to target revenues well about what was reported in the current quarter and the fiscal year. I think, first on Australia and New Zealand, we have not included an update here, but we announced a few months back our intent to acquire wheat genetics business in country that is currently owned by S&W Genetics was in part the Green program that was run by Corteva in the past and that is a process that's still ongoing and we expect to be able to close before the year's end. I think that this will remain to be the lower margin business segment within all of other segments until we start seeing Marrone's or I should say, ProFarm products becoming reported there that have gross margins that are closer to 60%."
}