{
    "symbol": "BIOX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-10 14:48:24",
    "content": " We're thrilled to report a record quarter in the history of our company with quarterly comparable revenues at $9.3 million and LTM adjusted EBITDA at $61.8 million, excluding HB4 crude oil costs. However, year-to-date growth reached 72% and growth in the last 12 months showed a solid 56% increase jumping to $262.6 million, which confirms robust growth dynamics that go far beyond weak levels. As we have made headway in scaling up the HB4 program to build seed inventories for commercial launch, expenses related to prelaunch efforts have ceased to be irrelevant relative to our reporting EBITDA as they have been in the last quarter, making it necessary to have a profitability metric that grasps performance of the underlying business that generates revenues today. To the numbers following the growth in revenues, the last 12 months baseline business EBITDA reached $61.8 million in the second quarter as Federico pointed out, up 46% year-over-year. During the first half of the fiscal year, our baseline business reached $37 million in adjusted EBITDA, a 48% increase compared to a year ago. The Crop Protection segment contributed close to two-thirds of its total $17.2 million increase gross profit with an impressive 133% growth, driven by increased sales and margin expansion as I described in the preceding slide. Despite all regions nominally growing contributions to gross profit compared to a year ago quarter, Europe and North America stood out contributing jointly 73% of the gross profit growth and representing 15% of the total $42.2 million in gross profit, up to 11% in the second quarter of the prior fiscal year. Our baseline business adjusted EBITDA reached $32.7 million, up 57% from the year ago quarter, which is a weak comparable to a very strong performance as explained before. Total that has been increasing in line with the growth of the business net debt by quarter end was $147.9 million, a 2.66% ratio of net debt to LTM adjusted EBITDA."
}