{
    "symbol": "WOR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-29 11:23:14",
    "content": " In addition, in Q1, we had inventory holding losses estimated to be $2 million or $0.03 per share compared to inventory holding gains of $47 million or $0.68 per share in the prior year, an unfavorable swing of $49 million, which is $0.71 per share. In Steel Processing, net sales of $1 billion were up 26% from $823 million in Q1 of last year, primarily due to the inclusion of Tempel Steel combined with higher average selling prices. Large year-over-year decrease was driven by lower direct spreads, which were negatively impacted by the inventory holding losses I mentioned earlier, estimated to be $2 million in the quarter compared to gains of $47 million last year, an unfavorable swing of $49 million. Given the recent steep decline in steel prices, we will have meaningful inventory holding losses in Q2, which we believe could be as high or higher than the $42 million estimated loss we had in Q4 of 2022. Building products generated adjusted EBIT of $53 million for the quarter and adjusted EBIT margin was 35.1%, compared to $49 million and 42.5% in Q1 of last year. Our Building Products JVs contributed EBIT of $44 million in Q1, an increase of $1 million over the prior year quarter as higher contributions from ClarkDietrich were partially offset by a decline at WAVE. In Sustainable Energy Solutions, net sales in Q1 of $31 million were up 21% compared to $26 million in the prior year quarter, due to increase volumes and higher average selling prices. Your line is open. So the number is right, what we actually said was that they -- it could be as larger, larger than the losses that we had in Q4 of '22, which were $42 million, but your number is exactly right because in Q2 of last year, we had $42 million in gain, so that's the way that we're thinking about it, just given the really steep decline that we've seen in steel prices, as we all know, they were coming down and then the Russian invasion of Ukraine, they popped back up to $1,500, $1,600 and then -- since then, they've resumed their rather steep decline into under $800. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}