{
    "symbol": "WOR",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-21 12:01:09",
    "content": " In addition, in Q2, we had inventory holding losses estimated to be $53 million or $0.81 a share compared to inventory holding gains of $42 million or $0.61 a share in the prior year quarter, an unfavorable swing of $95 million, which is $1.42 a share. Consolidated net sales in the quarter of $1.2 billion decreased 5% from the prior year, primarily due to the lower average selling prices in Steel Processing, combined with lower volumes partially offset by the inclusion of Tempel Steel. In Consumer Products, net sales in Q2 of $154 million, up 9% from $141 million in the prior year quarter. Building Products generated net sales of $142 million in Q2, up 17% from $121 million in the prior year quarter. The decrease in EBIT and margin was primarily driven by lower equity earnings in our ClarkDietrich and WAVE joint ventures, which were down $11.4 million and $3.4 million respectively compared to very strong results in the prior year quarter. This softness was partially offset by improvements in our wholly owned businesses, which saw operating income increase $1.4 million or 31% year-over-year due to higher average selling prices and a favorable product mix. In Sustainable Energy Solutions, net sales in Q2 of $38 million were up 15% compared to $33 million in the prior year quarter due to increased volumes and higher average selling prices. The business generated adjusted EBIT of $1 million in the current quarter, which was up slightly from the prior year as the favorable impact of higher average selling prices was partially offset by higher production costs. In Steel Processing, net sales of $842 million were down 10% from $938 million in Q2 of last year, primarily due to lower average selling prices and lower volumes, which were partially offset by the inclusion of the Tempel Steel acquisition. In Q2, Steel reported an adjusted EBIT loss of $17 million compared to a $72 million gain in the prior year quarter. The large year-over-year decrease was driven by lower direct spreads, which were negatively impacted by the inventory holding losses that Joe mentioned earlier, estimated to be $53 million in the quarter compared to $42 million last year, an unfavorable swing of $95 million. Though steel prices have stabilized because of lag in price indices, we anticipate we will see moderate inventory holding losses in Q3, which could approximate or be slightly lower than the loss we reported in Q3 of fiscal year 2022, which was $25 million."
}