{
    "symbol": "EVH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 20:49:11",
    "content": " Turning to Evolent Health Services, today we announced that following the successful implementation of 330,000 new individual family plan commercial lives and Bright HealthCare on January first of this year, we anticipate an expansion to include all of Bright's IFP commercial membership in 2023. With strong revenue growth and new business opportunities progressing, let's talk about our progress towards continued margin expansion, which is the second core operating priority for Evolent Health. Going forward, we anticipate continued strong revenue growth in our Clinical Solutions, and specifically from a higher number of lives on our Evolent Care Partners and New Century Health Performance suite solutions, both from net new logos and from Technology and Services suite upsells. As discussed previously, growth of our Performance suite solutions across New Century Health and Evolent Care Partners typically will drive higher growth rates, solid year one dollar adjusted EBITDA contribution, slightly lower year one adjusted EBITDA margin percentages and higher annual adjusted EBITDA margin, dollars and percent as contracts mature. In total, our quality and cost management solutions covered 20.3 million lives during Q1 and we're well situated to grow that reach both across the remainder of this year, as well as into 2023, we outperformed the high end of our revenue range for the quarter due to stronger-than-projected performance payments within both our Clinical Solutions and Evolent Health Services segments. Q1 adjusted EBITDA from Clinical Solutions was $22.2 million compared to $16 million in the prior year, driven by continued strong performance at New Century Health. Within our Evolent Health Services segments, first quarter revenue net of intercompany eliminations to 500,000 increased to 25.9% to $106.9 million up from $84.8 million in the same period of the prior year. Adjusted EBITDA from our Evolent Health Services segment for the quarter was $8.2 million compared to $5.9 million in the prior year, demonstrating the progress we have made in driving significant unit cost reductions across our operating model."
}