{
    "symbol": "EVH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 21:40:05",
    "content": " For the quarter ended September 30, 2022, Evolent Health's total revenue was $352.6 million, growth of approximately 58.5% over the same period of 2021. Third quarter adjusted EBITDA totaled $28.1 million, an increase of $14.3 million or over 100% growth compared to one year ago. While the performance suite remains an incredibly important opportunity for us and is the highest PMPM adjusted EBITDA dollar available to the company, we believe this balanced approach where we realize earnings across geographies, lines of business and different business models is the best way to drive sustained earnings growth and shareholder value. As we have launched our New Century Performance Suite across multiple new markets, we've added more than $140 million in annualized revenue since the first quarter of this year. In dollars, this pandemic-driven impact represents a delta of approximately $10 million in shared savings and is the primary driver of the year-over-year decline in third quarter clinical segment adjusted EBITDA. As we think about cash flow, as a reminder, we have two main recurring uses of cash outside of adjusted EBITDA: cash interest, which currently runs about $6 million per quarter; and capitalized software development of about $8 million per quarter. And then, John, I think I heard you say basically that your EBITDA would have been $10 million higher this quarter if it wasn't for the adjustments in the CMS sort of calculation. So I think the main comment is just when you look across the pipeline, while we've, over time, had some very significant additions with existing customers or even large new ones, I think the way I would characterize the current pipeline is across a lot of different logos and really some new names that we haven't talked about in a while, which I think is a good thing for the company just in terms of continuing to grow from different places and having lower and lower customer concentration over time, those sorts of things."
}