{
    "symbol": "EVH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 23:29:02",
    "content": " For the quarter ended December 31, 2022, Evolent Healthâ\u0080\u0099s total revenue was $382.4 million, growth of 54% over the same period of 2021. The fourth quarter adjusted EBITDA totaled $32.3 million, above the high-end of our guidance range and an increase of $8 million or 33% growth compared to 1 year ago. Our total operating partners is defined by the number of distinct corporate entities with whom we do business, totaled 47 as of December 31, 2022, and our total live stood at 20.6 million lives, organic growth of approximately 3 million lives from the prior year. This approach contributed to our ability to expand our adjusted EBITDA margins in 2022 versus 2021, while at the same time, adding over $250 million of new Performance Suite revenue with margins that increase annually after year 1 and ramp to target margins across the 3-year period. NIA, which closed about 4 weeks ago, brings roughly $250 million in annual fee-based technology and services revenues and $50 million of additional adjusted EBITDA before any synergies. With additional contractual commitments from Centene and cost synergies, we believe NIA should contribute adjusted EBITDA of approximately $85 million in Q4 2022. As we discussed in our January investor presentation, weâ\u0080\u0099re now running the business with a focus on reaching a $300 million annual run rate adjusted EBITDA target by the end of 2024. First is the full impact of the NIA and IPG acquisitions, which after the capture of identified synergies, should add approximately $100 million in annual run rate adjusted EBITDA by the end of 2024. During the year, we went live with over $200 million in new Performance Suite revenue at New Century Health, including several launches in Q4. We ended the quarter with 3.3 million lives on the performance suite compared to 1.5 million as of December 31, â\u0080\u009821, with an average PMPM fee of $25.78 versus $32.33 a year ago. Lives and platform in our technology and services suite were 15.2 million compared to 14.6 million as of December 31, 2021, with an average PMPM fee of $0.29 and versus $0.31 in the fourth quarter of â\u0080\u009821. Assuming the inclusion of NIA and the financing impact on our financials, our year-ending available cash balance would have been approximately $182.6 million, and our net leverage ratio would have been 2.8x well ahead of our target at the time of the transaction announcement, in part due to timing as our working capital needs tend to consume cash during the first quarter of each year. For the full year 2023, we expect revenues in the range of $1.92 billion to $1.96 billion and adjusted EBITDA in the range of $180 million to $200 million, implying adjusted EBITDA margin of approximately 10% at the midpoint. Our expectations for adjusted EBITDA represent margin expansion in the base business plus approximately $48 million from NIA, again, given the close of the acquisition in late January. And so you heard us in my guide, itâ\u0080\u0099s effectively a $50 million annualized contribution from NIA just adjusted for the close timing and that incorporates both of those things, the capture of the synergies as well as the one-time investment that will fall off as we go into â\u0080\u009824. Seth, Iâ\u0080\u0099m curious, I believe you threw out in January $300 million adjusted EBITDA run rate exiting 2023, obviously, significant growth from the outlook for that you just provided for this year. And on both the MSSP piece and the broader performance piece, this is one of the key reasons, right, why we have a $20 million EBITDA range for our guidance for the year and the likely drivers of where we are in that range are where we land in those performance-based arrangements. I think from a dollar and contribution perspective, one of the reasons that you didnâ\u0080\u0099t hear me talk about that as much in my walk to the $300 million is if we go live with the new Performance suite business in Q2 of â\u0080\u009824, right, thatâ\u0080\u0099s not going to contribute a lot as we exit â\u0080\u009824 given the margin ramp."
}