{
    "symbol": "EVH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 20:09:02",
    "content": " For the quarter ended June 30, 2022, Evolent Health total revenue was $319.9 million, growth of 44% over the second quarter of 2021. We ended the second quarter with 21.9 million lives on all platforms compared to $12.2 million a year ago, a growth of 80%, driven primarily by New Century Health, across both technology and services and our Performance suite solutions. Clinical revenue composed of New Century Health and Evolent Care Partners grew 55% year-over-year, a significant acceleration as new lives came online during the quarter, particularly on the Performance suite. In the second quarter, we announced four new operating partnerships, three for New Century and one for Evolent Health Services, taking our year-to-date total to 10 new operating partnerships just halfway through 2022, exceeding our full year target of $6 to $8 million. During the quarter, we saw accelerated new partner go-lives at New Century Health, which combined with membership growth in Evolent Care Partners to drive enterprise revenue above the high-end of our guidance range. For the second quarter specifically, we had approximately $60 million in new Performance Suite revenue versus Q2 of 2021, which contributes meaningfully to our long-term earnings opportunity while weighing on margin expansion in the near term. The variance in segment profitability relative to last year in the first quarter of 2022 was driven principally by revenue mix and timing, very strong growth in new Performance suite revenue on the one hand with lower performance-based revenue recognized in the quarter on the other. Within our Evolent Health Services segment, second quarter revenue, net of intercompany eliminations of $500,000, increased 23.3% to $92.3 million, up from $74.9 million in the second quarter of 2021. During the second quarter, we finalized the data from several programs in Evolent Health Services, which translated directly into strong adjusted EBITDA performance of $15.1 million compared to $6.5 million in the prior year. With regard to the core business, the quarterly EBITDA rollout across the second half of the year will be driven by the timing of performance-based revenue, as previously discussed, along with modest early investments ahead of revenue in Q4 for our significant expansion with Bright Health going live in January 2023."
}