{
    "symbol": "CLBT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 11:26:05",
    "content": " Joining me today are Yossi Carmil, Cellebrite's CEO; and Dana Gerner, Cellebrite's CFO. A copy of today's press release and financial statements, including GAAP to non-GAAP reconciliations, as well as supplemental financial information for the first quarter are available on the Investor Relations website at investors.cellebrite.com. Some of these forward-looking statements are discussed under the heading Risk Factors and elsewhere in the Company's Annual Report on Form 20-F filed with the SEC on March 29, 2022 as amended on April 14, 2022. Please note that in the coming weeks, management will participate in a number of investor conferences as detailed in today's press release. With that, I'd like to turn the call over to Yossi Carmil, Cellebrite's CEO. And third, the substantial growth potential we have within our existing customer base. We are excited to report a strong start to the year, delivering strong growth on top of an already robust comparable quarter last year. Next, our successful execution was also reflected in a net retention rate of 128% as of the end of March. And moreover, during the quarter, we booked 18 deals larger than $0.5 million compared with 17 such deals in Q1 '21, driven by wider adoption of our digital intelligence suite of solutions. The first is providing law enforcement agencies, the broadest, deepest and most innovative digital intelligence suite of solutions on the market. Our solution provide digital evidence Collect and Review, investigative analytics, investigative management and relevant services addressing the entire value chain of digital investigations. And it has always been focused on building a suite of solutions that addresses the needs of hundreds of thousands of investigators, prosecutors and decision makers in law enforcement agencies. This digital intelligence suite, which includes Collect and Review investigative analytics, digital evidence management, case management and services, open vast opportunities in a very large market and we believe that we have only scratched the surface of our opportunity in this market. Now, given our status as the go to solution with thousands of law enforcement agencies globally, we believe we are strongly positioned to continue provide faster, high effectiveness and more accurate solutions for our broad customer base. Moving to the second topic, on today's agenda, I would like to share our perspective on the market environment. This trend continued in the first quarter of 2022, and we expect this to be the case for the rest of 2022. There is a growing pressure on governments to increase police funding to fight crime more effectively, and therefore to deal with the massive growth in digital evidence. The willingness to spend in the USA, our main market reflects an acknowledgment that the fundamental demand drivers for our solution are continuous. Clearly, the quantity, variety and complexity of digital evidence in investigations are all growing in our world, and worldwide customer landscape. For example, a few weeks ago, the FBI released its infinite crime report that revealed that the number of Internet Crime Complaint increased by compounded annual growth rate of 29% over the past 4 years. An example that reinforce this necessity is the U.K Channel 4 News investigation that revealed in late February 2022, that a total of over 21,000 devices, including mobile phones, tablets and computers are waiting to be examined in the U.K alone. Now moving to the third topic, let's talk about the substantial growth potential we have within our existing customer base. While some customers are more mature than others, essentially all of them are still at the early stages of transforming and modernizing their investigative workflow. While many agencies continue to focus on adding advanced capabilities at centralized forensic lab sites, a rapidly growing number of forward-thinking agencies are investigating significantly to empower frontline officers in the field, allowing earlier access to investigative data, enables law enforcement to jumpstart investigations. The $2 million win that we announced in early April, with the National Police Force in EMEA is an example of this type of expansion. In a deal reaching nearly $3 million, and National Police Force purchased from us multiple solutions, including investigative analytics to assist with major investigations in a division specializing in organized and drug related crime. And lastly, our domain expertise and scale of operation make our professional services, which we view as an integral part of our digital intelligence suite of solutions and additional avenue to increase wallet share. In Q1, a large municipal police force engaged with us to helps it overcome its digital device backlog through outsourcing advanced collection services at a scope of approximately $700,000. First, we continue to invest in our go-to-market as planned in order to develop close and direct relationship with an even larger number of customers. To that end, we assign senior account executives to dozens of additional, large customers. Now, this facilitates higher level of discussions with senior officers that have the mandate to implement digital transformation within the organization. In addition, in Q1, we launched customer councils, which are forums comprising senior decision makers that we intend to convene periodically to exchange ideas on digital intelligence matters. We highlighted on our last call the need to bring advanced access capabilities to the broader customer base, not just the large law enforcement agencies. As we speak, our team is at Techno Security, one of the leading trade shows in our space, showcasing our premium as a service, our cloud-based Collect and Review solution. And last, we are pleased to announce the collaboration with Chainalysis, which will bring to our customers an integrated blockchain analysis, enriching investigations with information about transactions or networks related to cryptocurrency. So in summary, we are very pleased with the performance in our first quarter of 2022. As Yossi said, ARR grew 33% year-on-year, reaching $201 million by the end of March 2022. The main driver for ARR growth is once again the expansion within existing customers, representing 33% year-on-year growth. Subscription licenses are an important growth driver for Cellebrite, if it helps create a long-term incentive to increase customer spending with us. For example, one of our largest deals in the quarter was with customer that was an early adopter of premium subscriptions when it was introduced in late 2019. In Q1, the customer renewed its subscription for the third time and extended the length of its commitment. We also saw strong growth in professional services revenue, which was up 64% compared to Q1 last year, reflecting the resumption of in-person training activity. Non-GAAP operating expenses of $49 million in the quarter increased significantly compared to Q1 last year, but only marginally on a sequential basis. It reflects our cost structure as a public company, the increased in-person interaction and related travel and our continued investment in our growth. We ended March with 920 employees, up 17% from the end of March last year. We continue to invest in our cutting-edge solutions and go-to-market efforts and expect to end the year with over 1,000 employees. Adjusted EBITDA in the quarter was $4.1 million, reflecting a margin of 7%. Historically, our revenue in the first half of the year accounted for approximately 45% of the full year revenue. Operating cash outflow in the first quarter was $10.5 million and in the last 12 months, we generated $25 million on cash inflow. We ended March with approximately $172 million of cash, cash equivalents and investments. We maintain our expectation that December 22 ARR will range between $250 million and $265 million, up between 34% and 42% from December 21. As stated, we are on track to meet our adjusted EBITDA outlook of 13% to 15%, which means $39 million to $44 million. So as we described, when we are transitioning to subscription, we expect ARR and NRR to align throughout the years towards the revenue growth. So as Yossi mentioned in the call, we have launched the Premium Enterprise last year, and just to showcase the premium as a service we started introducing customer with Premium Enterprise and we were seeing increased number of UFED connected to the premium by having more and more customer adopting the Premium Enterprise as their main advanced access solution. Just to add that, as we said last time, Premium Enterprise is main vehicle to bring advanced capabilities to the fields to all UFEDs. So we are basically very pleased with the way Premium Enterprise is performing at the moment and, as I said, remain the main -- major growth engine as part of Collect and Review activity. Given all the global geopolitical tension, there's been a lot of industry news related to open-source intelligence. First of all, I have to say that we are very pleased with the investment and very pleased with the fact that open-source intelligence is part of our offering. Q1, we can see that we have an increasing pipeline, I would say mainly in Europe, Asia Pacific and Latin America. But having an OSINT as a standard tool for investigation for policing, combined with the digital intelligence or connected to our Pathfinder, this is a key relative advantage of Cellebrite. And that resonates very well in police, and there is also expected interest in the intelligence department within the police and in some intelligence organizations. I believe you mentioned your target to increase, your quota-bearing headcount by 35% this year in order to take advantage of the healthy budget and your pipeline. We are -- we said 920 by the end of this quarter, and we do expect to cross the 1,000 by the end of the year. Last year, you announced a partnership with Axon and you recently disclosed your partnership with Chainalysis. I think that when a company like us come with a clear aim to build an end-to-end investigative flow from the context of mode of operation of customers, we do not necessarily need to offer everything ourselves. A key in such a strategy or customer approach is to know how to have an open system and collaborate with other vendors, good vendors, qualitative vendors that together with us bring value to the customer, because that's basically the end of the game. So the go-to-market of Cellebrite is not necessarily doing everything by itself, but also do partnerships work with channels. The partnership with Chainalysis is a great value to customers, because Chainalysis is the leading blockchain OS, a leading blockchain data platform. Their expertise will be, I would say, seamlessly integrated into Cellebrite suite of solutions, PA and Pathfinder, and through this partnership, Cellebrite and Chainalysis are offering customers a window, I would say, to sophisticated criminal activity that begin I would say funded through cryptocurrency and masked by the anonymity of blockchain. Customers basically are able to identify cryptocurrency related activities, track the flow, create secure trail of evidence in a single place. And part of or I would say, as part of the digital investigation. As for Axon, this is really valuable for the customers with the ability to connect between well collected investigative data from our tools and analyzed by the Pathfinder and the connectivity, the integration with evidence.com. Axon, we finished the integration and we are expecting a mutual approach to customers again to bring the value. So before we conclude today's call, I would like to thank you all for joining us and wish you all a nice day."
}