{
    "symbol": "CLBT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 13:14:04",
    "content": " A copy of today's press release and financial statements, including GAAP to non-GAAP reconciliations as well as supplemental financial information for the fourth quarter are available on the Investor Relations website at investors.cellebrite.com. Also, unless stated otherwise, our fourth quarter 2022 financial metrics as well as the financial metrics provided in our outlook that will be discussed on today's conference call will be on a non-GAAP basis only, and all historical comparisons are with the fourth quarter of 2021, unless otherwise noted. Some of these forward-looking statements are discussed under the heading Risk Factors and elsewhere in the company's annual report on Form 20-F filed with the SEC on March 29, 2022, as amended on April 14, 2022. The first, the market for investigative digital intelligence solutions remains healthy. And before I cover each of these area in more details, I'd like to quickly review our Q4 results and select KPIs that are critical to the health and success of our business. First, our ARR grew 33% year-on-year to reach US$249 million. We closed 29 large deals, greater than US$0.5 million in the quarter. We reported Q4 revenue growth of 9% to $74 million, largely attributed to subscription revenue growth of 24%. We delivered Q4 adjusted EBITDA of $16.1 million, and we also further strengthened our financial foundation, ending the year with cash and investments totaling US$206 million and no outstanding debt. So we continue to operate in a healthy market with significant growth opportunities in front of us, thanks in large part to Cellebrite's industry-leading technology. Against this backdrop, we continue to implement our growth strategy of expanding business with existing customers through upgrades, upselling and cross-selling, and by winning new logos in both public and private sectors. Just as important, customer budgets for our type of Digital Intelligence solutions are expected to remain robust in 2023, as they are generally insulated from the broader macroeconomic pressures that are currently impacting a wide range of other technology sectors. In the Americas, which, by the way, represents 52% of our fiscal year 2022 revenue, law enforcement budgets have historically grown over time and we anticipate that this trend will continue in 2023. Now Cellebrite has built a reputation as a trusted digital intelligence market leader, which is best reflected by our success in increasing our wallet share within existing customers. Over the years, we have leveraged our traditional stronghold in Collect & Review solutions to increase our footprint within digital forensics units by helping them make digital evidence more accessible, intelligent and actionable. Now we believe that our newest Collect & Review Premium Enterprise and Premium as a Service solutions are true game changers for customers, and our physical analyzer continues to be the leading review tool in the investigative fields. With ongoing investments in Collect & Review and the addition of new investigative analytics offering like Pathfinder, we are supporting the neutral expansion of our customers' operations and continue unlocking new buying centers to address a growing range of use cases. This was the 16th consecutive quarter we reported NRR greater than 120%, and we are very proud of our best-in-class retention rates, which demonstrate the power and the value of our go-to-market strategy. Furthermore, we closed 29 large deals in Q4, bringing our 2022 total to 101 large deals and this is 22% higher than in 2021. During 2022, we took important steps to further advance our portfolio of solutions, while also investing in the cloud infrastructure necessary to scale our SaaS offering like our Guardian solution. We enhanced our offering by adding new features, capabilities and functionality that help our customers extract, filter, analyze and manage data and evidence efficiently and securely. With Collect & Review, the newest version of our Premium as a Service offering was rolled out earlier in the year and we were pleased to see success in the U.S. state and local government agencies. It is development effort like this that have helped our â\u0080\u0093 us to address major pain points for customers and underpin our efforts to fortify our longstanding strengths in Collect & Review, and extend our reach into adjacent investigative analytics and case management solution. Guardian is gaining traction in the market with hundreds of new users now benefiting from the simple, secure and scalable cloud-based solution for investigative and evidence management. And we see continued growth ahead for our SaaS solutions, which appeals to a broader range of customers, who need to modernize their digital operation, but often lack the budgets, IT staff and infrastructure, which is associated with on-prem solutions. So I'd like here to briefly highlight some of our Q4 deals, all of which demonstrates how Cellebrite technology is helping these customers modernize their operation, while expanding our wallet share. So in the Asia Pacific region, we grew our longstanding relationship with a regional law enforcement agency, who is now deploying our premium enterprise solution more broadly into the field to help them accelerate their investigations. As a result, our ARR from this customer will grow by more than 50% to nearly US$1 million and help set the stage for further expansion. In the U.S., a large federal agency selected premium enterprise to augment use of our UFED solution at regional labs and leverage their AWS private cloud infrastructure to move more capability into the field and operate the mode of operation. Now, I mentioned earlier that our investigative analytics solution, the Pathfinder, is enabling us to unlock new buying centers and support customers as they modernize their digital investigative workflows. So, for example, we closed two large Pathfinder deals in Q4, one of which was a mid six figure deal with one of the largest state and local police agencies in the U.S. And the other, multi-year low eight figure deal that triples our ARR with a national law enforcement agency in Western Europe to over US$4.5 million per year. Now both deals showed Pathfinder's unique value in helping law enforcement professionals accelerate investigations by sifting through mountains of digital data to surface the most relevant evidence, discover connections and collaborate more efficiently. And finally, in the private sector, we closed four notable deals, two with service provider partners and two with Fortune 500 corporate customers. Now all of these customers purchased Endpoint Inspector to improve overall operational efficiency by remotely collecting data from mobile devices and computers, thereby substantially upgrading costly, time-consuming legacy approaches. In closing, our solid execution over the past 12 months has enabled us to enter 2023 trying to further capitalize on the vast market opportunity. Our customers, regardless of whether they are national, regional or local public sector agencies or private sector businesses, are under increased pressure to modernize their investigative workflows in the face of rising volume of increasingly complex data, operational inefficiencies and greater scrutiny around the ethics and accountability of how digital evidence is handled throughout its life cycle. Now I'm confident that from where we stand today, we have the products, the programs and the people needed to execute and deliver on our 2023 financial targets. First, we plan to deliver ongoing innovation through state-of-the-art SaaS solutions paired with on-prem offerings that will help customers modernize their digital investigation workflow. Second, we will focus on extending our leadership in Collect & Review by advancing our UFED and premium solutions that are used extensively by digital forensic labs. And third, we are broadening our reach beyond our stronghold in the labs by accelerating our progress with a high-value investigative analytics and case management solution, which helps investigative units move faster and collaborate securely to resolve complex time-sensitive cases. Now by executing against these high-level priorities, we expect to accelerate our revenue growth rate, deliver improved profitability and generate strong cash flow from operation in 2023. As Yossi mentioned earlier, ARR grew 33% year-on-year, reaching $249 million for 2022. Over the past several years, we have made tangible incremental progress every quarter to convert customers to a subscription model from traditional perpetual licensing. With software subscription services now generating a substantial majority of our revenue, we believe that 2023 will be a year in which the power of our subscription-based business model will become increasingly apparent. Our gross margins rose 84% in Q4 as compared to 82% from the fourth quarter of last year, benefiting from the increased portion of subscription sales, which carry a lower cost of goods sold. As you may recall, the fourth quarter of 2021 was the first quarter carrying full public company costs and was further impacted by the cost from the acquisition of Digital Clues. We ended the month of December with 1,004 employees, up 12% from the end of December last year and consistent with the level at the end of the third quarter. Our Q4 adjusted EBITDA result reflects the strong performance of subscription revenues in the quarter, which contributed to the higher gross margins supported by cost efficiencies, while continuing our investment in maintaining our technological and market strong position. Moving forward, we expect to deliver EBITDA growth in 2023 as an accelerated revenue growth rate, coupled with prudent spending levels is expected to produce operating leverage. Non-GAAP net income in Q4 was $15.3 million, and non-GAAP fully diluted earnings per share was $0.08. We generated cash from operations in the fourth quarter of $36 million, a result of a strong quarterly operating performance. For the full year, we reported $20.6 million of cash inflows from operations. We ended the month of December with approximately $206 million of cash, cash equivalents and investments versus $182 million at the end of 2021. Consistent with prior years, we anticipate that expansions from existing customers will fuel the majority of our growth, with a higher contribution from new logos than last year. We expect full year 2023 revenue to range from $305 million to $315 million, which represents 13% to 16% growth over 2022. In other words, our 2022 ending ARR of $249 million represents 79% to 81% of our 2023 revenue target. In line with historical trends, we expect full year revenue will be weighted towards the second half, and quarterly revenue growth rates will be higher in the second half of the year versus the first half of the year. From a profitability perspective, we expect non-GAAP gross margins to be between 80% to 82%, with non-GAAP operating costs expected to grow in the range of 7% to 11% to between $217 million to $223 million. While we anticipate higher profitability in each quarter of 2023, we believe the most significant gains will occur in the second half of the year when higher revenue will drive incremental operating leverage. In closing, I would like to echo Yossi's excitement about Cellebrite and what the new year will bring. With much of the heavy lifting associated with converting our customers to subscription licenses behind us, we expect our top line growth rate to accelerate from 2022 labels. Just as notable, thanks to the substantial investments we made last year to build out our organization, we are well positioned to convert storage revenue into improved profitability and stronger free cash flow. We look forward to helping investors gain a better appreciation for everything that Cellebrite is doing to create value over the coming months, as we make tangible progress towards the long-term targets we shared when the company went public a year and half ago. Your line is now open. So if you remember, in 2022, we've seen a continuous reduction in our perpetual and onetime revenue from licenses, especially towards the second half of the year. And as such, when we are talking about our growth expectation on our top line, if you take into consideration comparing our 2022 financials, they are around 20% or, I would say, 18% of the business came from onetime activity whether services or licenses. So, most of the revenue from subscription in 2022 came from the collection review. This is because we are seeing a very good acceptance and a huge potential with our advanced collection capabilities that have been distributed in 2022 through not only the standalone premium, but premium enterprise and in the second half is very good attraction of the Premium as a Service. Moving into 2023, and especially from Q2 of 2023, where the business is expected to be from what we are standing mainly comparing the right mix of revenue types, Q2 of 2022 to Q2 of 2023 and onwards, we will actually be able to see the growth rates also on the revenue side. There was also level of acceptance of the solutions that we brought in, I would say, Q2 and Q3 2022 into the market and how the resonates and how they grow. As you know, we always have the mix of growing with, I would say, existing products within existing logos, but to additional buying centers that we clearly identify and then adding new logos, which will become something which is much stronger, especially if I look at the U.S. markets and if I look at, what we call, the long tail sector of thousands of customers in the state and local government. I'm pretty confident also about the fact that we feel very comfortable right now when it comes to the investigative analytics with a much more focused, I would say, go-to-market and relying â\u0080\u0093 or lying on the success of Q4. So combine basically the targeted amounts of new logos that we are aiming, combine it with our well-identified buying centers within the existing, the adoption rate of the collection review so far in the second half of the year, we feel very confident, confident and comfortable with the target and the guidance that we gave. Your line is now open. The first question I had for you is really more macro in scope, and I believe it was in Yossi's opening remarks around how law enforcement agencies in Americas have historically demonstrated continued growth of budgets, and that helps give you the confidence that these law enforcement agencies in the Americas can continue to grow their budgets in calendar 2023. And really, what I'm curious is to hear how you've been communicating with your agencies and your various customers and how deep you've gone in your conversations with them to ensure that budgets are continuing to grow. And then the second question, I think, is probably more for Dana, but it's with respect to the sales headcount growth. The conversations â\u0080\u0093 we've got today only in the public sector alone more than 5,000 agencies, 5,000 agencies, 5,000 customers. I think that the number of meetings that we have done, and I'm very glad post-COVID here was something between 15,000 to 18,000 meetings that we had with customers. And I'm talking about only those accounts worldwide that we manage with a dedicated account executive, with a presale and, let's say, visit an engagement with customer success. And I can also say that we are, in those few hundreds of accounts that we are managing directly with dedicated sales force and presale, there is a very good dialogue on different levels on a DFU, Digital Forensic Unit management level, on the INI, Investigative and Intelligence level and also on decision-makers even on commissioner level. It's not overblown in terms of something that we haven't expected, but it pretty much correlates with the way we anticipated the allocation of budget to digital intelligence in that specific section because if you read our customer survey or our industry survey, you can see clearly that, and we published that by the way, the meaning of digital data within investigations is the most critical analogue of investigations in general. So basically, it's clear that if the meaning of digital data grows by more than 80% in the last three years, when it comes to investigations, investigations are basically digital, we're pretty confident about that motion, and we also see the increase in the budget by ourselves. As for the sales force, maybe I'll hand over to Dana, but before that just saying we are well equipped. And we have also sales force, which is making sure that we get, I would say, new business and recurring coming from what we call the Southern long-tail climb. We do not expect to grow substantially or in any manner, the team from a number perspective, it was really about getting the right people and the right quality to generate the revenue that we expect for this year. Your line is now open. First, I never say it on calls, but I want to congratulate you on much better tone this quarter versus two previous quarters. This was a direct result of the very well acceptance of our Premium as a Service, which contributed mainly to the ARR, lesser to the revenue because of it being a SaaS solution. And as I said on my script, we took a very hard look into our OpEx, and we have tried to execute a caution approach towards OpEx expenses, including some adjustments and the true-up of variable compensation to the actual results compared to our beginning of the year initial targets. First, can you repeat your targets â\u0080\u0093 your long-term targets that you gave it 1.5 years ago? So out of memory, our long-term ARR targets were 22% to 27%, while our revenue targets were 20% plus. What we have said is that during this transition from perpetual to subscription, we'll first see the growth coming in the ARR and later in the revenue. So for that reason, we are expecting our revenue growth to be on the 20% plus towards the end of next â\u0080\u0093 the end of this year 2023. We would see ARR getting closer to the revenue target from a growth perspective is; it will reflect basically the growth in the revenue, which is mostly subscription. Your line is now open. We've â\u0080\u0093 as we said also when we've done the Q3 earnings call, we believe that we've reached the right number of people in the company to meet our targets to end the year of 2022 and to start 2023. And the second was relating to our variable compensation costs, which towards the end of the year, realize the final results of the company. We've aligned the variable compensation of bonuses and commissions with the actual top line and bottom line results, generating some reduction â\u0080\u0093 one-time reduction of cost of $4 million in the quarter. Your line is now open. We probably or basically as a company, which is larger than the combination of these two businesses, again, and Thoma Bravo basically took two companies and I think collectively valued them in a $2 billion, that basically gives a sign or a clear mark of attractiveness to the market. We as we look, I would say to the rationale, the way it was explained, it even strengthens basically our position because the rationale for the merger for one of them was about the fact that there is a mobile extraction capability, which is the reason, something that we have, shows basically how strong the mobile and how meaningful is the mobile. And I would like to say that if I look at us at this stage, we are as a vendor, we combine in one house the offering that these two players bring right now together. We've built an international footprint to expand our business in the U.S. and also outside of the U.S. And I would say already matured, I'm talking about us in terms of the expenses which are relating to that, something that we can create, at least on our side, more efficiencies. Yossi, you announced 29 large deals in the fourth quarter, including that $14 million deal with the agency in Singapore. It's â\u0080\u0093 the number of the larger or the larger size deal is growing and will continue to grow, and this is basically a reflection of the size of the go-to-market of Cellebrite, which focuses on increasing wallet share within existing accounts. And over there, it is expanding within the account, nurturing more, growing and as we offer more and as the solution, each one of them or the total digital intelligence suite of solution resonates, we see basically more budgets, larger deals. Nevertheless, there is a dual effort here that we're doing because there is also the element of expansion within new logos, more related, I would say to what we call the 1,000 long-tail. And over there side-by-side, I would say with the collection review, within the larger accounts, there is a rather transactional collection review business with a rather shorter sales cycle. And we are still relying and facing a large amount of deals which are, I would say small, reasonable and pretty much fits our go-to-market on that dual effort, okay. And this is good, by the way, because that spread the risks of Cellebrite we are not dependent on few customers, we are not dependent on a few large opportunities, and we have the ability to balance in that environment. In principle, yes, we do see in the last two, three quarters that looking at the larger deals, those who are above â\u0080\u0093 which are above $500,000, some increase in the average mix from a dollar perspective of those deals. Again, I would like to say we are committed both to the results and the creation of shareholder value and obviously to the industry we serve."
}