{
    "symbol": "CATY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 22:18:06",
    "content": " This afternoon, we reported net income of $89 million for the second quarter of 2022, a 15.3% increase as compared to a net income of $77.2 million for the second quarter of 2021. Diluted earnings per share increased 21.6% to a $1.18 per share for the second quarter of 2022, compared to $0.97 per share for the same quarter a year ago. In the second quarter of 2022, our gross loans increased $389.5 million or 9.5% annualized. The increase in loans for the second quarter of 2022 was primarily driven by increases of $94.6 million or 13.1% annualized in commercial loans, excluding PPP loans, $161.3 million or 7.9% annualized in commercial real estate loans, $210.6 million or 20.1% annualized in residential mortgage loans. The overall loan growth for 2022 is expected to range between 10% to 12%, including approximately $646.1 million of loans from the acquisition of certain HSBC West Coast branches. During the second quarter of 2022, $25.3 million of PPP loans were forgiven. For the second quarter of 2022, we reported net recoveries of $0.2 million compared to net recoveries of $0.3 million in the first quarter of 2022. Our non-accrual loans were 0.35% of total loans as of June 30, 2022 increased by $25.7 million to $60.6 million as compared to the end of first quarter of 2022. Turning to Slide 11, classified loans increased slightly during the quarter from $219 million to $244 million as of June 30, 2022 and our special mention loans increased during the quarter from $289 million to $295 million as of June 30, 2022. We quartered a provision for credit loss of $2.5 million in the second quarter of 2022, as compared to an $8.6 million provision for credit losses in the first quarter of 2022 and a $9 million reversal of provision for credit losses in the second quarter of 2021. On Slide 12 average money market deposits increase $465 million or 38.6% annualized during the second quarter of 2022, compared to the first quarter of 2022. We repurchased 750,000 shares of our stock at an average cost of $40.78 per share following $30.6 million in the second quarter of 2022 with $94.4 million remaining in the May 2022 stock repurchase program. For the second quarter of 2022, net income increased by $11.8 million or 13.3% to $89 million compared to the second quarter of 2021. Non-interest income during the second quarter of 2022 increased by $2 million to $14.6 million when compared to the second quarter of 2021, primarily due to increases of $0.9 million in loan fees."
}