{
    "symbol": "SD",
    "quarter": 2,
    "year": 2021,
    "date": "2021-08-11 17:17:04",
    "content": " Over the last couple of years and particularly over the 15 months, the Board and management have worked to transform our company in almost all respects, this transformation focusing on asset base, streamlining our organizational and cost structures, more than full flip of net debt to net cash, have positioned the company well within the adjustment of tailwinds of recent commodity price improvements. During the quarter, our cash and cash equivalents balance excluding restricted cash increased to $90.6 million, a $14 million increase from the prior quarter, primarily as a result of higher production, commodity – higher commodity price realizations, and our continued focus on cost utilization and despite being offset by the acquisition of the ORRI held by the SandRidge Mississippian in Trust I for a purchase price of $4.9 million. Despite closing on the sale of our North Park Basin assets during the first quarter of this year, our adjusted EBITDA remained relatively flat from the prior quarter at $20.8 million compared to $21.7 million. As I'll discuss in a moment, I'd like to point out that our EBITDA has very little high and no federal income taxes effecting –commodity price realizations remain strong over the quarter at $64.73 per barrel of oil, a $1.66 per MCF for gas and $17.33 per BOE of NGLs. The team also held LOE and expense workovers to $9.2 million or $5.33 per BOE during the quarter, while also reactivating 49 wells over the first half of the year. As discussed previously during the quarter, we purchased for $4.9 million in cash, all the overriding royalty interest assets of SandRidge Mississippian Trust I, when that trust along with Mississippian Trust II ultimately liquidate, our company will no longer have any affiliated trust. As a result of this focus in Mid-Con, the company was able to increase quarter-over-quarter production from 17.5 to 19 LOE per day despite no new drilling or completion, driven in part by the reactivation of 49 wells in the first half of this year."
}