{
    "symbol": "ABNB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 19:05:24",
    "content": " And that means obsessing over every single detail, and we've listened to our hosting guests and based on their feedback, we're making a large number of upgrades to our service this year, including improving customer service, making it easier to find the right home and delivering greater value and much, much more. I mean the majority of our bookings come from past guests, and it's actually been the strong guest retention that we've had over years since the beginning of Airbnb, that's been a powerful driver of our growth. Like I said, I think the thing that I'm really pleased is that we've introduced Airbnb to millions of new guests since COVID and that they're performing similarly, not even stronger than kind of historic guests in terms of their rebooking rates. A big piece of it is some of the brand marketing that Brian kind of mentioned earlier, is just making sure we have a lot of awareness of Airbnb, but just to also make sure that we're getting strong consideration of Airbnb as a true option for them. And that's why we're building some of the tools that Brian's talked about, which are things like giving tools to host to make sure that they understand the prices that guests are paying and making sure that they are providing -- continue to provide great value to guests. It's just making sure that we're being really rigorous in our cost structure to kind of support declining ADRs, which is why we anticipate our EBITDA margins for the full year to be roughly the same as 2022 in that the headwinds from lower ADR rates will be offset by our efficiencies that we kind of drive internally. And as long as people feel like they have the best product at the best value for Airbnb, I think we're going to deliver a huge amount of growth in years to come. I think in the short run, it may have some modest impacts on ADR, but in the long run, I think what it's going to do is drive a lot more demand here at Airbnb, I don't know, Dave, do you want to add anything or take the second question. Deepak, on the supply growth, I think the best measure to look at is you just look at the growth in supply that we had versus 2019 that we grew at 26% and our nights and Experiences book grew 24%, kind of largely in line -- we're not seeing any major shifts in overall kind of utilization rate that give us any concern."
}