{
    "symbol": "NTB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 13:58:09",
    "content": " Just looking at the deposit outflows this quarter, I think, in prior conversations, it was identified that there was roughly $1.2 billion of kind of surplus deposits, saw a decline of a little bit over $800 million this quarter, $250 million of that was FX related. So I think if we were thinking about getting back to a balance sheet, there's probably another sort of $500-ish million of primarily retail pandemic-related deposits that, over a period, is going to get reactivated into pension assets. So if we kind of go back to the end of 2020, it seems like the kind of the core balance sheet was in the low $13 billion range, maybe just for rough mathâ\u0080\u0099s sake, let's say, like $13.25 billion. And if you assume kind of low single-digit growth of that figure over the last 1.5 years, that would imply you guys should be in like the, call it, $13.7 billion plus or minus range by the end of this year, which would suggest you have about $600 million of excess assets still, which seems to jive with the access deposit that you guys provided. We've obviously been talking internally about do we put -- we've got some projects that we can pull forward like the branch refurbishment in Bermuda, where we're working on some digitization initiatives as well for our customers, which is really trying to accelerate the sort of pandemic behavior that we saw from retail customers in particular, where they were kind of accelerating online because they had to, and we accommodated that. So our capital strategy really hasn't changed very much since the IPO, and I think it's proven now through the entirety of the cycle, including a low rate cycle that works given the variability of net interest income, obviously arising from the asset sensitivity side of the balance sheet. But effectively, we would look to distribute anything that we don't need for organic growth or M&A in the form of a combined payout ratio being 50% cash dividend, obviously, it's a qualified dividend and then share repurchases."
}