{
    "symbol": "GRMN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 14:40:23",
    "content": "  Any statements regarding our future financial position, revenues, segment growth rates, earnings, gross margins, operating margins, future dividends or share repurchases, market shares, product introductions, future demand for our products and plans and objectives are forward-looking statements. As reported earlier today, consolidated fourth quarter revenue came in at $1.3 billion, which is down 6% from the prior year and consistent with trends we experienced for most of 2022. Full year gross and operating margins were 50% and 9%, respectively, resulting in operating income of $105 million. Full year gross and operating margins were 65% and 37%, respectively, resulting in operating income of $556 million. 2022 was a record year for our Aviation segment with revenue approaching $800 million and exceeding the levels achieved during the ADS-B mandate, which demonstrates our ability to deliver long-term growth in core product categories, such as autopilots, GPS NAVCOM, display systems and services. Full year gross and operating margins were 72% and 27%, respectively, resulting in operating income of $213 million. The segment delivered its 10th consecutive year of revenue growth, starting from about $200 million in 2012 and exceeding in $900 million in 2022, which is a new record and represents a compounded annual growth rate of 15%, driven by both market growth and significant market share gains. Full year gross and operating margins were 54% and 24%, respectively, resulting in operating income of $215 million. Looking forward, we anticipate revenue from the Marine segment will increase approximately 5% for the year, as we leverage our strong market share position with typical marine growth patterns. During 2022, Auto OEM revenue increased 11% to $284 million, with growth driven by contributions from new programs. Full year gross margin was 32%, and we recorded an operating loss of $79 million, driven by ongoing investments to complete new programs. Based only on the business already secured, our projections indicate that we could experience a compound annual growth rate of approximately 40% over the next few years, which, if achieved, would result in 2025 revenue of approximately $800 million. For the full year 2022, consolidated revenue declined 2% with growth in the Outdoor, Aviation and Marine segments more than offset declines in the Fitness and Auto segments. For the full year 2022, we generated free cash flow of approximately $544 million, a $161 million decrease from the prior year, which was primarily due to a higher use of cash for inventory income taxes."
}