{
    "symbol": "TOUR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-09 09:50:09",
    "content": " I would now like to turn the meeting over to your host for today's conference call, Director of Investor Relations, Mary. Joining me on the call today are Donald Yu, Tuniu's Founder, Chairman and Chief Executive Officer; and Anqiang Chen, Tuniu's Financial Controller. For today's agenda, management will discuss business updates, operational highlights and financial performance for the first quarter of 2022. As a company with this experience in , Tuniu has building resilience for coping with short-term industry patients, and we are confident that the industry will resume it's recovery in the near future. During the past quarter, we continue to focus on product innovation, service quality, all of which will cost us to remain competitive as we take on new opportunities and challenges. In order to satisfy our customers' demand for travel while complying with pandemic prevention regulations, we are constantly late up working and innovating our products and sales models. In terms of our products, we have aside the development of local tour products for travel within cities and nearby destinations. Leveraging our leader hotel resources, we initiated seasonal product offerings and our hotel plus ex-product model, such as winter off screen and teen growth picking in order to provide more diverse selections of local tour products for customers. Elaborating our resources in the city travel market, we also launched a series of city work educational state tour products, which cover museums, zoos and the public gardens. During the May holiday this year, sell camping related to travel products saw significant growth. In line with our moto of this booking fixed travel, most of Tuniu's products, especially interprovincial tours, have adopted the advanced booking and travel confirmation sales model. Customers are able to make discounts bookings and later from their departure date with the option to receive a full refund increase of cancellation, which also will help drive strong infusive sales term among customers for traveling in the future. We have posted sales shows for our members gate, as well as centers around specifically regional travel products, as well as multichannel live streaming shows featuring outdoor, travel and destination reconditions in addition to our regular daily product promotions. Our customer service team has been monitoring the pandemic situation and they work closely with our local tour operators to ensure guest safety during travel, providing timely response or exchange services during spike in resurgence. Our customer service teams communicate our regular customers on a constant basis and provide tour recommendations, especially for discounting products that are available for advanced booking. Tuniu has gained a quick number of loyal customers over the years through our reputation of providing high-quality products and services, and the contribution of our repeat customers to our overall GMV has been increasing since the pandemic broke out. We collaborated with destinations in remote areas for product development and launched customized travel products, especially for the -- we also launched sales channels for local state specialty products, allowing guests to have authentic local experience while supporting the development of the local tourism economy. In order to better take care of our local employees who work in different regions in China, we made proper work arrangements in accordance with regional pandemic prevention and control guidelines, such as working remotely from home and enjoying flexible work shifts. We also implemented regular new click based testing for local staff, especially reception staff at our destinations to ensure the safety and health of the sales and our guests. Even though we are still facing many challenges on the road to full recovery, we are encouraged to see that the COVID-19 inter-province travel guidance were adjusted recently, which narrowed the restrictions from provinces to cities. While the overall travel demand in China continues to rise despite the resurgence of the pandemic, we believe that with the patients and support of our guests and customers, the days of traveling will return soon. For the first quarter of 2022, net revenues were RMB41.5 million, representing a year-over-year decrease of 46% from the corresponding period in 2021. Gross profit for the first quarter of 2022 was RMB15.8 million, down 45% year-over-year. Operating expenses for the first quarter of 2022 were RMB68.6 million, down 18% year-over-year. Excluding share-based compensation expenses and amortization of our client intangible assets, non-GAAP operating expenses was RMB65.5 million, representing a year-over-year decrease of 18%. The research and product development expenses for the first quarter of 2022 were RMB16.2 million, up 37% year-over-year. Sales and marketing expenses for the first quarter of 2022 were RMB29.8 million, down 16% year-over-year. General and administrative expenses for the first quarter of 2022 were RMB27.7 million, down 38% year-over-year. Non-GAAP net loss attributable to online shareholders, which excluded share-based compensation expenses and amortization of acquired intangible assets were RMB37.2 million in the first quarter of 2022. For the second quarter of 2022, the company expects to generate RMB32.2 million to RMB40.2 million of net revenue, which represents a 75% to 80% decrease year-over-year. Please note that these forecasts reflect Tuniu's current and preliminary review on the industry and its operations, which is subject to change, particularly as to the uncertainties brought about by the impact of COVID-19. And on the first circumstances, how do you view the future development of the tourism industry and what strategic measures will the company take in the second half of the year to deal with the risks for pandemic. The current  has negatively affected the domestic travel market, as well as our revenues in the first half of the year. In the long month, we believe the industry will continue to grow despite the impact of the pandemic, tourism demand has not decreased but has been temporarily pent-up. In terms of service, so we always insist with the customer first principle and provide full cycle service to our customers. Therefore, Tuniu is likely to be their first of choice when our customers plan to travel. In addition, the pandemic brings changes to the travel industry, and we are also trying something new. Based on our experience in the travel industry and the knowledge of our customers, we have this definition to attract more customers and develop local tourism economy."
}