{
    "symbol": "FOCS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 14:03:04",
    "content": " Despite the challenging macro environment correlated across virtually all asset classes throughout 2022, our full year performance was solid, finishing well in Q4 with strong momentum into 2023. The depths and diversification of our global partnership, our strong M&A momentum, and we are all instrumental â\u0080\u0093 are at the core of our competitive differentiation, reinforcing our leadership advantage in independent wealth management. We generated solid results in 2022, growing our revenues by 19.2% year-over-year to approximately $2.1 billion. Our adjusted net income excluding tax adjustments per share was $3.62, and tax adjustments per share were $0.77, increasing over the prior year by 7.7% and 37.5%, respectively. 2022 set another record for M&A in our industry, with transaction volumes, increasing nearly 11% over the prior year and achieving the 10th consecutive year of growth, according to economic partners. We closed 24 transactions last year, adding five new partner firms and completing 19 mergers on behalf of our partners, who took advantage of this substantial consolidation opportunity to accelerate there growth. In 2022, we increased our footprint in crucial Wealth Management markets across the US, adding excellent new partners with strong businesses, dynamic management teams, talented advisors, and long standing client relationships. We also expanded our international presence into Switzerland last year with our partnership with Octogone, further extending our partnership in countries with sizable independent Wealth Management sectors catering to high end ultra high net wealth clients remain an important priority. We are off to a strong start in 2023, with seven transactions closed year-to-date, including one partner firm and six mergers, and we assigned four mergers, which we expect to close in the first quarter. We continue to acquire high quality RIAs, and other independent wealth managers, but weâ\u0080\u0099re also selectively adding firms with unique capabilities that can benefit our partnership, such as the announced or acquisition of Origin Investments by our partner firm Kovitz at the start of this year. 2022 was another year in which the value of prudent fiduciary advice was evident, particularly in the unique challenges presented by markets and economies last year. Our partners benefited from our value added programs last year, enabling them to meet the growing and highly personalized leads of a sophisticated high and ultra high net risk client base. Our diverse recurring revenue stream, variable management fee structure, and the strong economic alignment we have with our partners have withstood the volatile macro environment over the last year. The market events of 2022 reinforce the value of experienced trusted advisors, deep client relationships, and balanced portfolio structure to deliver growth over the long-term. Our revenues were $547.7 million, up 4.5% year-over-year, and 6.3% above the top end of our guidance of $505 million to $515 million. This is primarily due to the year-over-year change in organic revenues, which were negative 3.5% versus our initial estimate of negative 10%. Our Q4 adjusted EBITDA was $136/7 million, increase in 5.9% year-over-year, and our adjusted EBITDA margin was 25%, above our estimate of approximately 23%. The remainder was attributable to variable compensation, where cash compensation and related expenses were sequentially lower by approximately $3 million. This reduction includes the impact of higher interest expense due to the 2022 increase in the LIBOR and SOFR rates, as well as a pre-tax $7.4 million increase in other expense, primarily associated with a write-off associated with an insurance receivable. Our Q4 tax adjustments for share was $0.20 cents, 25%, higher year-over-year. For the full year, our revenues were approximately $2.1 billion, a 19.2% increase over the prior year, driven partly by an organic revenue growth rate of 8.5% for the same period. Our full year adjusted net income, excluding tax adjustments per share was $3.62, 7.7% higher than the prior year. Our full year tax adjustment per share was $0.77 increase in 37.5% for the same period, reflecting the growth in our tax shields due to M&A activity. Our 2022 M&A activity reflected strong momentum throughout the year as Rudy highlighted, we close 24 transactions, including five new partner firms and 19 mergers. In Q4, we closed nine transactions, including two new partner firms that contributed approximately 3.1 million of revenue. On a full quarter basis, we estimate that these funds will contribute approximately $5 million and $1.8 million in revenue and adjusted EBITDA respectively. Management fees were $132.7 million or 24.2% of revenues, slightly up sequentially due to the Q4 revenue outperformance. Our non-cash equity compensation expense was 1.5% of our Q4 revenues, in line with our expectation, and we anticipate that this expense will be approximately 1.4% of our estimated Q1 revenues. As of December 31st, our LTM cash flow available for capital allocation was $317.7 million, reflecting the resiliency of our cash flows during a volatile market year. We paid cash earnout obligations of $32.6 million in Q4, and we estimate that we'll pay approximately $24 million in earnouts in Q1. We estimate that our year-over-year range of 1% to 3% and we estimate that our Q1 adjusted EBITDA margin will be approximately 24%, which excludes any expenses associated with a Clayton, Dubilier & Rice process. Now, turning to our balance sheet, we ended Q4 with approximately $2.6 billion of debt outstanding and our net leverage ratio was 4.19 times, slightly under our estimate of 4.25 times. We took advantage of a window in the credit markets to extend the maturity on our $1.6 billion tranche of our term loan for 2024 to 2028 and to extend the maturity of our $650 million revolver to 2027, reducing the duration risk of our borrowings. We also converted our remaining LIBOR borrowings to SOFR, $850 million of our outstanding debt has SOFR swapped to a fixed weighted average rate of 53 basis points plus a spread of 325 basis points. At year end, our new term loans together with our undrawn revolver and cash balance gives us approximately 1 billion of firepower, as we anticipate another strong year of M&A activity. Additionally, our LTM Cash Flow Available for Capital Allocation was 317.7 million last year. In closing, we delivered a solid year of growth and performance, despite the volatile macro backdrop with the hallmarks of how we invest and grow our business again clearly evident. Our partners generated strong performance and serve their clients well, positioning themselves to strong growth as markets recover. As I said before, it is environments like we have experienced last year, when they are industry leadership and the value of what they do really shows positioning them for strong growth in financial performance as financial markets recover."
}