{
    "symbol": "CANO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 23:58:03",
    "content": " We achieved full year revenue of over $2.7 billion and adjusted EBITDA of approximately $153 million, all while growing in new markets and service lines and, most importantly, providing our patients with excellent clinical care that measurably improve their outcomes. Factors negatively impacting Medicare Advantage revenue in 2022, included new members with lower than expected first year revenue per member per month or PMPM, growth in geographies with lower revenue PMPM, and a higher percentage of non-risk members with a lower PMPM. We made the decision to delve back the addition of de novo medical centers in 2023, which is expected to reduce cash used for capital expenditures by approximately $35 million. I would also like to highlight that in December of 2022, we completed an acquisition that included 9 medical centers and an MSO business in Florida for initial consideration of approximately $31 million in equity and $1 million in cash with future cash earn out payments based on achieving certain measures. The impact of these items is projected to generate approximately $70 million in cost reductions in 2023, which are offset by costs associated with the growth in our operations during 2022 and 2023. Excluding de novo loss add backs, we now expect our newly modified full year 2023 adjusted EBITDA to be in the range of $75 million to $85 million. By comparison, had we excluded de novo loss add backs in 2022, the full year 2022 adjusted EBITDA would have been approximately $74 million using the new definition of adjusted EBITDA. For reference, de novo losses, which as we said are no longer added back to adjusted EBITDA, are expected to be approximately $45 million, compared to approximately $79 million in 2022. Also, we expect capital expenditures to be approximately $15 million in 2023, compared to approximately $50 million in 2022, reflecting fewer additional de novos in 2023. In 2023, we expect cash used in operating activities will be in the range of $70 million to $80 million compared to 2022 cash used in operating activities of $146 million, a projected $71 million improvement at the midpoint. In 2023, we expect non-Florida Medical Centers to generate approximately $100 million in revenue and approximately $40 million of adjusted EBITDA losses, excluding corporate expenses, compared to approximately $70 million of revenue and $60 million of adjusted EBITDA losses, excluding corporate expenses in 2022. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}