{
    "symbol": "EURN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 13:57:17",
    "content": "  Operator: Good day, and welcome to the Euronav Third Quarter 2022 Earnings Conference Call. After todayâ\u0080\u0099s presentation, there will be an opportunity to ask questions. Before I start, I would like to say a few words. The information discussed on this call is based on the information as of today, Thursday, the 3rd of November, 2022, and may contain forward-looking statements that involve risks and uncertainties. Forward-looking statements reflect current views with respect to future events and financial performance and may include statements concerning plans, objectives, goals, strategies, future events, performance, underlying assumptions and other statements which are not statements of historical facts. All forward-looking statements attributable to the company or to persons acting on its behalf are especially qualified in their entirety by reference to the risks, uncertainties and other factors discussed in the companyâ\u0080\u0099s with the SEC, which are available free of charge on the SECâ\u0080\u0099s website at www.sec.gov and on our own companyâ\u0080\u0099s website at www.euronav.com. With that I'll now pass over to our Chief Executive, Hugo De Stoop, to start with the content slide on slide three. Thank you, Brian, and good morning or afternoon to wherever you are and welcome to our call. I will run through the Q3 highlights before passing back on to Brian Gallagher, our Head of IR, who will then highlight some key and current trends in the winter market before I return to summarize our strategy, where we are in the current cycle and our outlook. In capital markets today, everyone is looking for a private , well, in tanker markets, especially in the larger VLCC segment we finally got ours in freight rate and this was the catalyst to drive us back to profitability. Since July, the substitution trade of VLCC ship supplying the lost seaborne barrels from Russia to the EU has really gained traction. As experienced watchers of shipping will know, the impact in our numbers is lagged as we are operating six to eight weeks ahead of the current calendar. So itâ\u0080\u0099s a very pleasing operational quarter for us, as we believe the cycle has turned and should last for the foreseeable future. Looking now at the financials, slide seven. We continue to work hard on adding additional sustainable financing, which we expect to complete very soon. The two FSOs that we operate now fully are totally consolidated for an entire quarter and this for the first time, since we acquired 50% of our partner on June 7, 2022. With that, I will now pass it back over to Brian Gallagher to give some thoughts on the current market cycle. We expect another one million barrels per day, of the EU bound exports from Russia to follow a similar pattern over the next quarter, ahead of the fifth of December deadline set without EU to ban oil, all oil shipped from the Russia to Europe. This will mean that the sale in world would travel, approximately three to four times the distance it previously did. We will continue to see the benefit of substitution trades from Atlantic to Middle East, oil being taken on a seaborne route to the EU. This latter substitution trade, will in particular benefit the larger custom sizes such with the VLCCs. The chart on slide 9, illustrates both the distances involved and also the detail of the dislocation of these crude barrels. Slide 10 is a slide we've used before, but continues to have a very strong message with the current crude transportation market. Whilst volatility in energy prices has weighing recently, we continue to see the relative price of oil being cheap in comparison to other core energy sources. All of the fuel prices illustrated on Slide 10, are represented on a per oil barrel equivalent and therefore are completely like-for-like. Oil is therefore, relatively cheap in terms of a source of fuel at the moment and power and consequently we believe that we will see not only fuel switching during this winter, but continue to see this trend well into next year. The impact of all of this on Slide 11, shows the impact on shipping itself. This shows the amount of oil and the water being transported in the dark blue line, the one-year time charter rates for VLCCs given in light blue line. Oil in seaborne transit is back to levels we have not seen in the very short spike, we saw in March 2020, just ahead of the COVID pandemic kicking in. With ton miles continue to be a key feature of the dislocation, we anticipate that we will continue to see growth in oil, in transit on seaborne routes, on similar patterns. So in summary of our market views, we continue to remain very positive on the current trends and expect to see a sustained and strong winter period. I'll now pass back to our Chief Executive, Hugo De Stoop, to speak to give some more medium-term thoughts, about where we are in the cycle on our current outlook from the traffic light perspective. I'd like to sum up before we go to Q&A, with two very general thoughts. Firstly, Slide 13, gives an indication of the parallels but also the differences we see between this current cycle set up in previous sustained multi-quarter up cycles in the tanker market. First, the valuation of the tanker sector in capital market terms, is cheaper than what we have seen in previous upcycles in 2004, 2014 and 2019. Second, the average age of the global fleet is much higher than what we have seen in previous cycle. Finally, we are in a very different era in terms of the order book expressed in absolute numbers, or as a percentage of the fleet in the larger tanker space. Those different aspects, gives a very supportive and constructive medium-term outlook. Once again, we felt the market background deserves another upgrade. The last phase of the Russian dislocation means that we expect to see further increases into miles, which bodes well for the tanker market this winter and for the coming medium term. You will have noticed on Slide 14, that our traffic lights on majority green. We still believe there is an upside as all of the recent up cycle has been delivered, without any benefit coming through from Chinese consumption or Chinese oil demand growth. With that, I will pass it back to the operator, for questions. In Q4, we expect to get approximately â\u0082¬160 million â\u0082¬159 million, so that will be added to the liquidity and then the new facility which is â\u0082¬377 million that we have a term sheet for currently in the documentation, we expect that 330-ish of that will also be added to the liquidity in that because it's replacing a facility that has already expired. So overall, we go back to â\u0082¬800 million of liquidity and that is before operating cash flow comes in and we expect those to be significant and generous in Q4. I mean when you do a merger and you calculate the economics namely the ratio, you are normally freezing the dividends. So what we have in the agreement is obviously, we can continue to pay a minimum dividend the â\u0082¬0.03 that we pay every quarter that's in the books. So there might be a little lag of a quarter and even not a full quarter, I mean probably one or two months, if you look at your calendar and when we pay dividends related to every quarter. Well, great title on Slide 13. Thank you very much. So when you have a place, which represents 65 and tomorrow hopefully, 85, potentially 90, maybe one day even 100 ships. And as far as the participants to the pool are concerned, what we are looking at is trying to optimize the voyage among the different vessels and also trying to find the appropriate vessel for the appropriate trade that we're doing because nowadays you have non-eco-ship eco-ships you have non-eco-ship with scrubber without scrubber, eco-ship with scrubber without scrubber. And then if we play the game of triangulation then normally indeed and that's one of the goals your net results should improve, but not at the detriment of your clients, which is a very big benefit again for both parties. On Slide 9, you talk about the Russian dislocation. I just wanted to ask on the Baltic loading port, how many of those can accommodate VLCCs. Very few can accommodate these and the ones that can usually you cannot load to the top, so yes there is normally -- when the oil is moving far away or further away than it used to be I mean Europe was a close destination. And as we have explained in the introductory remarks we're talking about 3 times, 4 times potentially 5times the distance that we use to perform. So far, we have seen a few operations doing that. And when you look at what exists in the world and here I'm talking a few Suezmax and then many Aframax that are cloud means that they can break the eyes, they can load the oil and then they can go to their destination. But if you use those ships to do the long voyage over the all Africa and going to India, China and whoever is interested in taking that oil, then they won't be available to go for that distance which is IC. Good afternoon, Hugo and Brian, I just wanted to ask about the latest new buildings that you have for the two Suezmaxe's you ordered recently. Well, very good question. And in fact, we hesitate in making those remark in the press release because it's very important people understand what the current picture is about shipyards in general and that one in particular. The three big ones which are Hyundai, Samsung and Daewoo, they are completely full until 2025. And when I speak about 2025, Q2 for maybe one or two ships, but it's mostly Q3, Q4. In particular, LNG is quite keen to continue to order obviously, for obvious reasons the container side is slowing down on their pace of order. Daehan which is not part of the top 3, but it used to be long to Daewoo so the quality is very good. And in fact that was -- that's very much what builds our relationship with them, because we could act very, very swiftly. I think between the time they were in trouble with their existing clients and the time we took that contract in our own hands, there was maybe two weeks or something like that. And we were relatively generous on payment terms, which was appreciated by the yard. And the first party they came to offer those slots was Euronav, because of what I just explained. We haven't announced the price, but I can tell you that that was also a very attractive price compared to what we could see being offered by other yards for what we believe is the same quality. So all-in-all, we believe it's a very good deal. I think that most of those studies are showing that it's difficult, because it's always -- I mean, it's difficult because it's down the type of ship product to crude that's relatively easy, but container to tanker or dry bulk to tanker, it's -- it requires a lot of changes. I mean, you're also evaluating making them ammonia and methanol ready. From a technical point of view, everything can be done, especially on a tanker, because we have a lot of space on our deck. I mean, there is obviously the three different lines to unload the cargo that we have, different from dry bulk, because they have hatches that need to open. So the space is more restricted completely different for container vessels, because every single space is used for loading the containers. So from a technical perspective, yes, you could imagine doing that, but then from a cost perspective that is completely suboptimal simply, because we're talking about different type of fuel. I mean, methanol will continue to be liquid at ambient temperature. On top of that some of those products are more corrosive than others, which means that the piping that you need to put in place is more or less sophistic -- by that, I mean, will be a specific type of metals to the piping. And then the way you will feel the engine is also very important, because ammonia, for instance, is more toxic than any other target fuel that we are considering at the moment. And so you really need to make sure that everything is completely water tied, because you cannot afford to have any lead no matter how small that is. So from a CapEx perspective, I don't think that you're going to see a different type of fuel or tri-fuel as you name it. Dual fuel that's the obvious conventional that we use today plus one of the new fuel and transforming the ships, i.e. in the first place, you receive a conventional then potentially you transform it into, let's say, methanol because that's the closest to what we're using today. That is also possible, but it will cost money. I mean to the extent that the weather, the temperatures are going to be that low. On the long-term, it continues to make sense from an economies of scale perspective and that's why VLCCs are usually used for long distance, Suezmax for shorter distance and Aframax for much shorter distance. So going to your red light, green light chart that you put in here, and obviously the only one that maybe not quite as constructive as demand for oil. And I wanted to get your perspective, if you think that economic dynamic is maybe as impactful to the overall market as it has been historically just given all of the other potential constraints to both capacity and also there's the ton mile multiplier here. Well, that's a great question and to a certain extent, I love some of your colleagues to give me the answer. So it's almost like a gut feeling, but we are very simple people and we are trying to look at very simple effect. And then we believe that once these restrictions are being lifted in China, China will continue to grow and you've seen it from a GDP point of view, obviously, that country has slowed down. There's certainly not negative GDP, but the complete slowdown compared to the growth numbers we used to see. And then for the remaining part of the world, I mean clearly you're talking about recession, we were talking about it in the last quarterly call. But it's true that the price of oil relative to the others and especially relative to gas is very cheap, which means that anyone who has an opportunity to switch from gas to oil will do it. The same could be said about coal, but I think that people are more and more reluctant to switch to coal because of the emissions and because of other type of pollution, not only CO2 but many types of pollution. Well, that's usually the right way to do it. Why don't we start with the last one, which is cut in production. At Euronav, I think, we believe that if the oil is cheap and certainly cheaper than what you can fetch in other place in the market it will find a home. And an oil cap and I will come back to that is another way to forcing a discount, which is already happening because obviously the freight is more expensive. So when Russia sells oil to China and India, no doubt that they sell it at a bigger discount than when they used to sell it to Europe. So from that perspective, I think, that it's more physical operational restriction that will dictate whether or not Russia will have to shut in some of their oil field. And by that I come back to the comment that we made earlier on Ice Class vessels capable of or being enough in numbers to go to Russian ports and then do the lightering, and this is obviously, a heavier operation than when you can just pick up the oil in a port and transport it to its destination without interruption. As far as the price caps sanctions, we don't think that that will stop the production of Russian oil. And I'm not even sure that the world really wants less oil being put on the market given where pricing is and given the influence or the impact it has on general inflation, which is really problematic as you know in Europe and to a certain extent in the US. Obviously, the restrictions or the sanctions are also coming up on the insurance world. They already did what many companies and banks have done, which is sort of, self sanction or imposing already a great deal of restriction on what business they can or cannot do with Russians. And for the few cases that we have tried to analyze and we have heard of this is simply being replaced by less international insurance companies, namely, insurance companies being located in Dubai, in China and Hong Kong, especially, when the destination of the oil is or are those countries. Thank you very much. Well, another one I definitely should have brought my crystal ball here. I mean, the pickup in the secondhand in the S&P market in secondhand vessels is definitely there. And when you look at the price, one cannot ignore and not imagine that some of that tonnage is not going to be dedicated to the trade with Russia. I think that, I'm not sure I would call it a shadow trade, simply because well up until 5th of December it's allowed. I mean, you obviously need to have an agreement with your finances and whatnot, but shipping is mostly private. After that, it's the destination which is a problem right and the ownership of the vessel. outside Europe, outside the US, or outside the UK, then you can continue to trade. So I'm not sure, I would call it a shadow trade like what we've seen happening with the oil coming out of Iran. So yeah, it's a little bit â\u0080\u0093 it's very peculiar. I think that, there will be a 2-tier market. It's going to be very difficult to have ships, even if you are based outside Europe to achieve that do one cargo out of Russia, and then the next one out of a place that is not under restrictions. So I think that, the fleet will be more dedicated, but difficult to tell you today how much tonnage how material how much tonnage and how much is wax, are going to be dedicated to that one. You have not made much profit in the past few years, but you are about to make big profits. Not that, we know of and you should know that on your base in Europe, which is the case of Euronav, and it will be the case of the front line very soon. And then the different countries being a member of the European Union have their own way of applying that directive as we call it, and we are based in Belgium and we have already done our analysis in Cyprus, it's a very good system that everybody likes. And I would be surprised, if they wanted to change it. And the reason why nobody is questioning that system is simply, because if it wasn't there in place in the European Union I think that very, very few ships, very few shipping companies would be based in Europe. And as you know, it's very different to ownership than it is to own a factory. I mean, the factory you can't just move it out of country overnight. I mean, the ship you decide on the flag, you decide on the registry, and you can also decide where the company is incorporated. So I understand the question, because that's very much talked about in the energy sector and we are very different animals. The reason why the energy sector is making a lot of profit is because of the characteristic of the energy market and very much what's going on, because of the Russian Ukraine crisis. As far as shipping is concerned, yes, we are going to enter an up cycle as we call it, but our business is full of up cycles and down cycles and therefore very, very cyclical. So that's, it's just a different way of taxing an industry and one that has worked for more than a decade now. I mean, very few people question. So maybe two questions, the first one is on timing. And what happened is that, we could be in a position to launch the tender offer in Q4, but that would mean that we go over the Christmas period and the holiday period which is suboptimal. So today we prefer to announce to the market that the idea is to launch the tender offer as early as possible in Q1, but then have the full period where the tender offer is open free of holidays, free of -- I would say bank holidays and people not maybe paying the same attention as they would in other periods. We're talking about a strategic delay, if I may use that term. Other things that could delay this side, well, there are things that we control and there are things that we don't control. So if there is delay, then there is very little we can do but most of the time we don't expect to see one. And then, on your last question, which is, our largest shareholder at the moment which is CMB which has indeed bought more shares and that's -- that's talking that. I suppose they believe in the business which is always great to hear, especially at those prices. create one big company, we need 75% of the vote once someone has 21 or more votes, it becomes very difficult because not everyone is voting. We will look at every single department I would say, be it on the revenue side, on the cost side, the overhead and really act as one group. But indeed in order to achieve a full merger, we will need to see what happened with CMB's stake and already how many shares we can collect in the tender offer. So that's something that we will do at the second stage of the rocket, I would say and certainly after the tender offer. I don't think that it matters a great deal to the investors, simply because for those who understand shipping they will understand that once you control a company with more than 50% of the vote, you can do already a lot, if not everything that you would have done under a merger and maybe the only thing that you cannot do is a delisting basically."
}