{
    "symbol": "SLDP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 22:37:03",
    "content": " Thank you, and thank you everyone for joining us today. Joining me on the call today are Solid Power's Chief Executive Officer, Doug Campbell; and Chief Financial Officer, Kevin Paprzycki. Before we get started, I'd like to remind you that parts of our discussion today will include forward-looking statements as defined by US securities laws. Except as otherwise required by applicable law, we disclaim any duty to update any forward-looking statements to reflect future events or circumstances. For a discussion of the risks and uncertainties that could cause actual results to differ materially from those expressed in our forward-looking statements, please see our most recent filings with the Securities and Exchange Commission, which can be found on our website at ir.solidpowerbattery.com. Looking at the first quarter, I'm happy to report that 2022 is off to a strong start, thanks to the execution and focus across the entire solar power team. I will be providing you with an update on our operational investments and cell development progress, but in short, one we are nearing completion of our EV cell pilot production line. Three, revenue came in ahead of expectations and finally four, we remain on track with all of our operational and developmental targets. In all, we believe we are well positioned to achieve our goals by the end of this year. Looking at our cell development progress during the quarter, I'm pleased to report that we remain on track with our roadmap. In addition, we are internally testing our 20 2 Amp Hour multi-layer cells. Regarding those cells while we still have some technological challenges to overcome, we remain on track to deliver those 20 amp hour cells to our OEM partners later this year. Turning to our operational investments; as we announced last quarter, we elected to accelerate investments in our operations, production equipment and product development efforts. First, our EV cell pilot line, which is designed to produce EV scale cells in a high throughput manner that mimics today's lithium ion manufacturing. In particular, I am pleased to announce that the EV cell pilot line is nearing completion. The EV cell pilot line has been designed to produce 60 to 100 amp hour all solid state battery cells, which we refer to as EV scale. Once the line is fully operational, we expect to begin producing EV scale cells on the line for internal testing in the third quarter. Second, regarding our electrolyte production facility, construction is well underway and we are still targeting completion for the second half of this year. As of today, we have made meaningful progress with building the structural framework within the facility and expect equipment will be delivered over the next several months. While these pressures introduce some complexity, they also validate our decision to execute sooner rather than later, and reduce headwinds in today's supply chain environment. I'm pleased to say our operations team has done a great job mitigating these complexities, and it is a testament to their hard work that we remain on track with the timeline we put out last quarter. With that, I'll pass it over to Kevin to take you through our first quarter results. Overall, our first quarter results reflected the accelerated investment timeline we announced last quarter. This increase was driven by direct program costs related to revenue execution, our accelerated development efforts and higher SG&A costs as we build out a solid public company platform. Looking at cash flow and liquidity, we ended the first quarter with combined cash and marketable securities of $553 million plus $10.9 million in longer-term cash investments. At a high level, we continue to expect that our total '22 combined cash investment will be in the range of $150 million to $170 million. In closing, we're happy with the progress the team delivered in the first quarter. As demand for EV batteries continues to build, we are driving towards operational and technological targets that we believe will position us to capture this demand and build upon our leadership position in the industry. As they said back in March, we are building our business for the long term, investing in a solid foundation with an eye towards long-term returns. So I'd like to sort of take you back to the update that we provided in March where one of justifications for accelerating the investments was around the expansion and optionality for, as you say to your point, bringing in potential new partners. I don't have anything formal to report today, but however, I can confirm that discussions are ongoing. As you might expect discussions with these kind of entities can take quite some time especially as you start to get into, roll up your sleeves negotiations. But again, the reason why we made the decision to accelerate the investments was to give us optionality for bringing in additional partners and to that end we continued to pursue those and those discussions by and large are going in a very positive direction. And my second question is in the past, you've mentioned that you're given the capital that you've raised, that your balance sheet is -- should -- will provide for a fully funded business plan. Assuming we execute on the business model, which we with our development plan, which we remain confident that we will be able to do so, then yes, that has remained unchanged. Again, just, if you don't mind, I'll just sort of back up a moment and remind yourself and the audience to the listeners, what we had stated back in March, and that basically was, we wanted rather than sort of releasing data in a very piecemeal fashion, which can sometimes be confusing or even misleading. One, first and foremost, we were only going to release data on relevant scale cells produced on our automated production equipment. Number two, that we are going to any data that we release will be based on fixed variables and industry standard test conditions. Three, that these are not onesies and twosies in terms of test samples that we would collect data across a reasonably large sample set and ensure that we have relatively low data variability between the samples. And then finally and this is more in parallel with the data release is, reasonably disclosing sort of a bill of materials, such that investors have confidence that as I like to refer to, we don't have quote unquote, unobtainium in our bill of materials. Why, well, because we've been building those two amp hour cells much longer than any other cell format, and then expect to see a similar data package for a 20 amp hour cell, and then again for the full scale EV cell and so again, we remain committed to doing that. So, as I said in our last call back in March, that there are still two performance metrics that for us are work in progress. They're deploying some of the quote unquote, fixes that our R&D team has done over into the production line, towards making advancements in specifically in those two performance areas. And I think we'll just evaluate it here quarter by quarter, going forward. So it's sometimes not a surprise when we come in above revenue, just because our team is so focused on execution. So, as expected this -- we expected this to be a relatively brief earnings call given the short period of time between today and our previous earnings call. I remain extremely excited about 2022 in particular, as we bring the EV line online as well as our second facility devoted to electrolyte production scale."
}