{
    "symbol": "TRHC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 13:02:13",
    "content": " Consistent with our pre-announcement on July 20, we delivered better than expected second quarter revenue of $72.6 million, which was 13% higher versus a year ago. Second quarter revenue of 72.6 million increased 13% versus a year ago, and 8% on a sequential basis versus the first quarter of 2022. In all, this resulted in product revenue growth of 19% versus a year ago and 10% growth on a sequential basis versus the first quarter of 2022. Excluding EMTM, service revenue increased 10% versus a year ago and 4% on a sequential basis, driven by our PBM services, which increased 44% during the quarter versus the year ago quarter. During the second quarter, R&D, sales and marketing and G&A in aggregate totaled 20.6 million, a decrease of 12% versus a year ago and a decrease of 9% on a sequential basis versus the first quarter of 2022. We are introducing third quarter 2022 revenue guidance as follows: Revenue   $72.5 million to $75 million, which represents growth of 7% to 10%, including CareVention Healthcare growth of 11% to 14%. For the full-year of 2022, we are raising our revenue guidance on continuing operations to a range of 286 million to 292 million, which represents growth of 10% to 12%, including CareVention Healthcare growth of 14% to 16%. So, if I look at the outperformance in second quarter, it sounds like that was â\u0080\u0093 a lot of that was driven by more favorable PACE   than maybe a little was expected, and that favorability will, sort of run out for the rest of the year, which kind of contributed to the increased guidance, but when I look at revenue on a sequential basis in Q3 and in Q4, it looks like you're kind of implying fairly flat to only a modest increase on a sequential basis. I guess then just as a quick follow-up, if I look at the disclosures in the press the quarter, it looks like growth for the PACE business was fairly balanced between enrollment growth and PMPM rate, I think sales were up by 8%, so I guess looking forward over the next couple of years, do you feel like you â\u0080\u0093 we should see kind of a similar relative mix of, kind of even contribution to growth from both the census and the sort of PMPM rate."
}