{
    "symbol": "TRHC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 10:14:01",
    "content": " In the program of all-inclusive care for the elderly or PACE market, which represents the largest percentage of our revenue base today and grew at 27% in the fourth quarter, we have demonstrated a $5,000 annual savings per person when using our MedWise platform coupled with our pharmacy services, as compared to those not using Tabula Rasa. This is evidenced by the average revenue we generate per PACE individual per month, which increased to $494 in the fourth quarter of 2022, up 16% from $427 a year ago. The most significant opportunity we have to increase the $494 average revenue per patient per month is through driving greater adoption of our pharmacy services into our existing PACE customer base, and we're making progress towards that goal. Excluding EMTM, fourth quarter technology-enabled solutions revenue increased 14% versus the year ago quarter and 6% on a sequential basis versus the third quarter of 2022. These include PACE medication census, which at the end of 2022, increased 20% versus a year ago, driven primarily by same center participant growth, as well as by new PACE clients. In addition, we have provided our PACE average revenue per participant per month for medication and for our technology-enabled solutions, which increased 7% and 2% respectively in the fourth quarter versus the year ago quarter. First quarter revenue from continuing operations of 82 million to 84 million, represents growth of 24% versus the year ago period at the midpoint of the range and adjusted EBITDA of 3 million to 4 million for the quarter compares to 1.1 million a year ago. For the full-year 2023, revenue from continuing operations of 343 million to 354 million, represents growth of 16% at the mid-point, and adjusted EBITDA of 17 million to 20 million, represents growth of 98% at the midpoint, and an adjusted EBITDA margin of 5.3%. Similar to 2022, we expect the fourth quarter of 2023 to be our highest adjusted EBITDA quarter and we project the second half of the year to account for a similar percentage of the full-year adjusted EBITDA as in 2022."
}