{
    "symbol": "PFIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 17:28:03",
    "content": " Before we get started, I'd like to remind you that any forward-looking statements discussed on today's call by our management, including those related to the company's future performance and outlook, are based upon the company's historical performance and current plans estimates and expectations, which are subject to various risks and uncertainties and could cause the company's actual results for future periods to differ materially from those expressed in any forward-looking statement made by or on behalf of the company. I would like to direct your attention to the company's press release that was released earlier, which includes the company's September 30th, 2022 balance sheet statement of operations, statements of cash flows and discussions related to the company's results for the three and nine-month periods ended September 30th, 2022 and the results compared to the same period in 2021. Havenâ\u0080\u0099t been on a call for a while, but I wanted to ask you a couple of questions about the -- just the capital allocation strategies at P&F, you have a decent balance sheet and yet you're declaring special dividends after a quarter where you didn't make any money, what's the philosophy in doing a special dividend as opposed to if you're going to do a dividend, just do a recurring dividend of a nickel per share per quarter. Some of them have to do with our expectations on a go-forward basis, how much we're borrowing in relation to our availability I think we are -- in this quarter, trying to walk a balance between certainly wanting to return money to shareholders, while at the same time, having an eye towards a relatively uncertain economy, while we feel pretty good about our operations. Logically, with the tremendous discount to book, a one-shot dividend doesn't do much deal, but the ability to -- if you're looking to create value for shareholders longer term, to be able to reduce your share base at an incredible discount to tangible book, it would seem logical, as opposed to special dividends, to be buying back stock as opposed to getting no credit for a special dividend. So we would look for -- I mean, I don't know if you're asking this kind of question, but like a 15% net to the bottom line, 10% to 15% kind of a number, that's what we look to do. And so now it's getting back more than normal times, but I'll let Joe, you go through it, but the two that we're doing right now to see that nothing almost $1 million are really layups for us and very, very good, but I'll let Joe give you the details. I think there's also -- even though the price of oil is so high, what we call the turnaround and shutdown business hasn't been nearly as robust as it would be, if you rewound the clock five years, and this was the price of oil, I think you would just be seeing more activity."
}