{
    "symbol": "NWN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:00:09",
    "content": "  Operator: Hello, and welcome to today's NW Natural Holding Company Q3 2022 Earnings Conference Call. Good morning, and welcome to our third quarter 2022 earnings call. They are based on management's assumptions, which may or may not occur. This morning, I'll walk through some economic indicators and provide summary of Northwest Natural's Oregon general rate case order. In our gas utility service territory in Oregon and Washington, we continue to see strength in employment numbers, while the housing market moderates from its highs in 2021. So far, we've seen the decline in mixed-use multifamily projects, but expect several developments to come online in the fourth quarter. In addition, supply chain issues have put customer' conversion projects on a longer runway. Despite these factors, we added nearly 8,800 new customers during the last 12 months, which equates to a growth rate of about 1.1%. Unemployment rates in our large water service territories range from 2.8% in Idaho, though 4% in Texas. Texas remains an extraordinarily -- a extraordinary market with our water and wastewater utilities, posting nearly 11% organic growth. The housing market in Ibaho is strong with our falls water utility, providing 5% growth. On a consolidated basis, our water and wastewater utilities grew over 3% over the last 12 months. In addition to this organic growth, a recent acquisition of Far West in Arizona increased our water customer base by 70% to 61,000 customers. On a consolidated basis, our collective gas and water utility customer base grew 5.3%, including our recent acquisitions. In October, the Oregon Public Utility Commission issued an order approving several multiparty settlements. Under the order, Northwest Natural's revenue requirement increased $59.4 million beginning November 1. This was based on a 50-50 capital structure, an ROE of 9.4% and an overall cost of capital of 6.8%. A number of other items were approved as part of the rate case, including full recovery of our COVID deferral, enhancements to our low-income energy efficiency program, the recovery of our Lexington RNG facility and a new automatic adjustment clause for new RNG investments. During the quarter, we filed for our annual purchase gas adjustment also in both states, which updates rates for the projected gas cost in the coming year. In October, we received approval from both Oregon and Washington for those increases in new rates for those also went into effect November 1. Despite these recent increases, it's important to note that customers are paying less today for their total natural gas service in our area than they did 15 years ago. With that, let me turn it over to Frank to go a little bit deeper into the financials. As a reminder, Northwest Natural's earnings are seasonal with the majority of revenues and earnings in the first and fourth quarters during the winter heating months. For the third quarter, we reported a net loss of $19.6 million or $0.56 per share compared to a net loss of $20.7 million or $0.67 per share for the same period in 2021. On a quarter-over-quarter basis, our gas utility provided $300,000 of higher earnings related to increased margin and lower pension expense. Net income from our other businesses increased $800,000 for the third quarter of 2022 related to higher asset management revenues, offset by higher interest expenses. For the first nine months of 2022, we reported net income of $38.4 million or $1.14 per share compared to net income of $38.1 million or $1.24 for the same period in 2021. The $200,000 increase in net income for the nine-month period reflects an improvement at the gas utility of $3.3 million, while results from our other businesses declined $3.1 million, as the prior period benefited from the higher asset management revenues related to the February 2021 cold weather event. Higher earnings at the gas utility were primarily related to customer growth, new rates in Washington and colder weather in 2022 compared to 2021. As a result of these factors, utility margin increased $6.6 million. Utility O&M increased $8.2 million, reflecting higher levels of contract and professional services and IT upgrades. Utility depreciation and general taxes increased $1.5 million due to higher property, plant and equipment as we continue to invest in our system. Other income increased $6.4 million, driven by lower pension costs. For 2022, cash provided by operating activities was $166 million. We invested $257 million into the business, most of which was for gas utility capital expenditures. Guidance assumes continued customer growth, average weather conditions and no significant changes in prevailing regulatory policies, mechanisms or outcomes or significant changes in laws, legislation or regulations. We believe climate change requires rapid innovation and collective action, which is why we're committed to reimagining the role of our system and the fuel that we deliver. In September, we filed our integrated resource plan with the Oregon and Washington commissions, outlining long-range resource plans and pathways to reduce emissions. The plan incorporates complex modeling to arrive at a variety of scenarios to achieve the lowest cost, best options to meet safety, reliability and decarbonization needs. But we are not just planning for the future, we're taking tangible steps forward. Our engineering team has completed 5% hydrogen blend test at our Sherwood operations and training center, and plans to increase to 10% blends in the coming weeks, with a goal of 15% by the end of the year, pending system and equipment testing results. This project is in partnership with Modern Electron, and we expect the project to go live in the spring of next year. For a couple of our commercial customers, we're working on a pilot using CarbinX equipment. The carbon dioxide is converted to potassium carbonate, which is blended into sell products each unit has the potential to reduce CO2 emissions by nearly 18,000 pounds annually. Several other direct capture technologies are approaching commercialization, and we expect adoption rates to continue to grow and are excited to be on the cutting edge of this innovation. As you know, through that business, we're focused on providing cost-effective solutions to help a variety of sectors decarbonize using existing waste streams and renewable energy sources. As we have discussed in the past, we strive to provide stable and growing gas and water utility earnings, while seeking to add growth opportunities that fit our conservative strategy. At the same time, most RNG projects are sized right for us to effectively transact. I'm excited to announce that we closed our largest acquisition to-date, Far West Water and wastewater utilities in Yuma, Arizona. In fact, just this past week, we signed and closed a tuck-in acquisition in Idaho and also signed an agreement for another Washington utility. And then finally, this morning, the Board approved a dividend increase for the fourth quarter, making this the 67th consecutive year of annual dividend increases. And Elliot, I think if there's any questions out there, we're ready to open it up for those. I think as we've been very vocal, we believe that there's different products that can go through our pipeline. And if you're going to decarbonizes, obviously, the first thing you work on is energy efficiency. But we also do believe like Europe has been doing for a period of time here, putting hydrogen on the system. And there's different forms of hydrogen and this area is well positioned for green hydrogen, and that's the purpose of testing what level of mix that we can put into the system and frankly, replicate what they're doing in Europe. I do believe long-term, Chris, there's going to be other investment opportunities for companies, especially after the Inflation Reduction Act was passed. There's tremendous funding from Congress now to push hydrogen forward, which is a good outcome. Well, I think overall, the transactions show that people see the same thesis that we're seeing, but this is important. If we really are going to address climate change, we have to get more renewable natural gas on the systems. I think a lot of people are trying to gain footholds, and it's really good that we've already established a small piece, and we're not going to try to compete against these bigger guys. And it's just a -- Chris, I would call it a reaffirmation that we're on the right path here. We believe that we can compete in it just because of our size, very much like what we're doing in water, that we can transact and be a little bit more nimble than maybe the big guys are doing. That is exactly what we're -- what we believe will happen, and it makes sense. If these bigger companies are spending a lot of time on the smaller projects, I'm not sure the returns are going to be what they want them to be. We're seeing a pretty steady pipeline of activity, Chris, in the water space. There's larger transactions that will occur from time-to-time, but a pretty steady flow of tuck-in acquisitions. We mentioned earlier in the call that we just signed two in the past week, and one in Washington and one in Idaho. And that's pretty indicative of what we're seeing out there just building on our existing positions and then as larger new markets -- new market-related acquisitions become available, we will execute on that. Hey, Chris, it's Frank. Yes, the RNG tracker, this is where we are able to invest in renewable net assets and put them into rate base. We will close, we will build, bring it online, and then we will incorporate it into rates each November 1 with the -- when we update rates for the PGA. So there's a little bit of lag, but it's -- in between rate cases, we can pick it up in rates every year. So to the extent we can, if there's opportunities, we would optimize that a little bit as they came online. But we'll have a little bit of lag within a year depending upon when they're ready to begin producing, so. And then every November 1, which is when we update the gas portion of our bill that rates will be adjusted to reflect the increase in rate base and the associated cost. We still under SB98 still have that 5% of our revenue requirement per year, which up $35-plus million of incremental cost. There's, a lot of projects that we're looking at in terms of development and things like that and, of course, also trying to line up customers for the product. Our long-term view, as David said, is displacing conventional gas with RNG and then, clean and renewable hydrogen. We also do believe carbon capture, utilization and sequestration are going to be really important. So we have two projects, the Carbon X is one where we're partnered with some of our bigger commercial customers. And basically, the equipment is designed to fit onto existing natural gas furnaces and boilers. As we mentioned, it has the potential to reduce emissions annually by 18,000 pounds per unit. You can -- as this proves out, you can put it on a variety of customer accounts, and it allows them to meet some of their chemicals individually along with the system. The other project that we're really excited about is, a Turquoise hydrogen so a Methane pyrolysis project. With modern electron and if you followed in the news, there's a lot of excitement about Turquoise hydrogen because it has potential to be one of the lowest cost low-carbon fuels. For our project, we are anticipating that this kind of equipment it proves out really have the flexibility to be located in a variety of areas on our system. And we're part of a consortium in North America, of other utilities that are sort of sharing the learnings on these kinds of pilots and part of HyDeploy, which is an international hydrogen consortium, again, looking both at these kinds of technologies, but also some work on our hydrogen blending, as David mentioned before. And I think it's a reflection of the versatility of hydrogen for gas networks, but also the carbon capture opportunities. I think the focus for us right now, what Kim is talking about is inside the utility. I think one of our -- I think it is one of our main goals is to decarbonize our gas utility, and we even have a net-zero view that we can get there by 2050, and this would be part of that process. The more we learn about it, just like we learned about RNG in the utility business, I think it will also provide investment opportunities outside the utility. But right now, the focus is inside the utility. So it's a great question, of course. That, too -- we've been, I'd say, slowly doing backfills and we've been monitoring and trying to keep a bit of a lid on unnecessary or non, say, mandatory cost expenditures during the year. We're up at the utility about 8% for the year, which is really not too far from where we expected to be. But it's really -- so far, what we've been. It's been driven by some inflation in our contract work and then IT maintenance and cloud costs, but it's -- I'd say, in general, it's in line with where we would expect it to be, but just kind of reflecting a little bit extra management action to keep it a little dampened from maybe where you were expecting it to be. Obviously, if you have any questions, get a hold of Nikki or media, get hold of David Roy as Nikki said in her prepared remarks. We know it's a busy day, and I hope all the -- hope you get out there and vote."
}