{
    "symbol": "ATKR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-18 10:30:06",
    "content": " Obviously, this is an estimate going forward, but we are triangulated by looking at every product line what we've sustained in the past, because some of our product lines by the way are still increasing in profit margins, you know but even as commodity costs are going down and that ties back to supply demand and also as factory and things that  our own self help, like our one order, one delivery, one invoice, and the price extra that we can get for the market for that. But avoided the last month, we're also  for one month and a month over month, all type of factors going forward, look optimistic, and sometimes in these different factors that would say like ABI or something, they don't include, which David and I covered all the megatrends, all the investment and Inflation Reduction Act and the Infrastructure Act and specifically within the Infrastructure Act, what's called  , which is $65 billion would put fiber optic lines underground. So, optimistic on market demand and the megatrends and then just supply advantages, you know what we're doing, the relationships we have with customers, the full package of products at one order, one delivery, one invoice, we're actually seeing I'll say mid-to-high single-digit price advantage even compared to Atkore, like the difference between shipping a full truckload, and ability to bundle all these products like  . But I think it's a rational, logical number that we're given at this moment, which is kind of as we move forward, we're going to start seeing a lot of our initiatives go into place that's going to drive organic growth, but we will probably still have some of that price that we  the PVC market working as a headwind. HDPE, I think there's so much demand out there that this constraint is what blue collar people can go put the lines underground, the demand, the capital that's been set aside by the funding by the government is literally expected to be very high single digit compounded growth for the next five, seven plus years."
}