{
    "symbol": "ATRA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 19:32:02",
    "content": " Leveraging our differentiated allogeneic T-cell therapy platform and Atara unique clinical experience in more than 500 patients treated, we will prioritize R&D activities over the next 18 months on three core priorities: first, the clinical development of ATA188 or potentially transformative Phase 2 asset for progressive multiple sclerosis; second, the EU and potential U.S. regulatory filings and approval for tab-cel while seeking a commercial partner for tab-cel in the U.S., including all related activities and costs, which is expected to further extend the company cash runway; finally, the anticipated Q4 2022 IND filing for ATA3219, a potential best-in-class allogeneic CD19 CAR T, which could address a significant opportunity in this field for improving durable clinical response in hard to treat B-cell malignancies. Atara's belief in top sales value proposition, has been recently supported by the CMS decision in its newly released 2023 IPPS rule to formally assign tab-cel to DRG-18, which is a diagnosis-related group that inks CAR T. Obtaining such assignment in advance of BLA filing is extremely rare and is based on compelling value arguments developed by our team for such a potentially life-saving therapy for patients with EBV+ PTLD. When considering pricing in line with tab-cel value for patients and the health care system, we believe that upsell has the potential to deliver peak sales in the use of over $500 million coming from sales in EBV+ PTLD following previous therapy or first indication that we attend - and potential label expansion from the multi-cord study. You may proceed with your question. You may proceed with your question. You may proceed with your question. And on your second question, I think the decision to look for a commercial partner for tab-cel in the U.S. is really to make sure that we have greater financial flexibility that will position us well to fully realize the value and key catalysts and milestones for most advanced and promising assets, tab-cel, ATA188, ATA3219. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}