{
    "symbol": "ATRA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 21:43:06",
    "content": " At the ASH conference in December, we will present updated interim analysis efficacy and safety results of the Phase 3 ALLELE study in relapse remeeting EBV-positive PTLD relapse refractory EBV-positive PTLD with additional patients and longer follow-up confirming the transformative potential of tab-cel. At the ECTRIMS 2022 conference, we presented new MRI biomarker imaging and open-label extension clinical data from the Phase 1 study of ATA188 in progressive MS. New biomarker imaging data addressed patients who achieved confirmed disability improvement, or CDI, demonstrated significantly less brain atrophy over time, an increased NMTR in unenhancing connected two lesions. All in all, this new ECTRIMS data from our Phase 1 study and OLE openable extension, together with the two landmark studies published this year in Science and Nature and our two fast track designations with the FDA, further support our confidence in a possibility for AT1 88 to deliver transformational clinical improvement to progressive MS patients. Please proceed with your question. Please proceed with your question. But I will say, and we mentioned this previously, but we've had constructive dialogues with the FDA about a possible path forward to BLA submission without the need for a new clinical trial and that we could use these commercially -- commercial process treated tab-cel patients. And also, do you -- just curious if you discuss with the agency or perhaps you've you thought about utilizing patients in the future or currently in the multi-cohort study if those patients were to receive the commercial product, might that satisfy FDA's requests as well as perhaps give the opportunity to potentially broaden the label a bit. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. So again, we are preparing this argument between the intended commercial treated patients as well as our very robust other clinical experience where, again, this is going to be quite an interesting Type B clinical meeting coming up, where we hope to gain agreement with the FDA on that -- the contents of that clinical package. Please proceed with your question."
}