{
    "symbol": "ATRA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 20:16:12",
    "content": " In addition, we conducted a successful EBV and MS Day in March, where we covered the MS disease landscape; the history of ATA188; an overview of EBV as a cause of MS; and very importantly, updated Phase I and open-label extension data, highlighting that a majority of patients have demonstrated either confirmed EDSS improvement or stability in up to 42 months follow-up. Second, we propose to use the clinical data being generated with the commercial product in current studies as a way to support a filing without an additional Phase III study. During our recent EBV and MS Day, the momentum for this potentially transformative product continued to grow with a presentation of updated Phase I and open-label extension data that demonstrated that 33% of patients in the high-dose cohorts achieved confirmed EDSS improvement at the 12-month time point. So again, we cannot today give you details about how much we will say about confirmation of the Phase I data or confirmation that the placebo arm is aligned with what has been seen with previous studies like the MedDay's studies you are referring to, but we'll certainly try to give as much detail as possible while preserving the integrity of the study. So just to be clear, reporting the percentage of response in terms of confirmed EDSS improvement in active versus placebo is, we believe, a level of details on the data that could jeopardize the study value or the integrity of the study in a sense that this being made public would influence the behavior of patients and physicians in a study that will still be enrolling and still be evaluating patients over time. So long story short, we believe that these proposals really reflect tab-cel's clinical and commercial product data that we've generated to date; also, the important BTD status of this product to address an urgent medical need with these patients who have really a lethal disease with no therapeutic options, and this is an ultra-rare disease state where, again, the conduct of an additional clinical trial we do not believe would be appropriate. The multi-cohort study which is currently enrolling, and we're also using commercial material obviously in the clinic for the -- for both studies and also for expanded access and compassionate use and so forth, that study is ongoing, generating data."
}