{
    "symbol": "GBOX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 20:22:07",
    "content": " Our net revenue increased by $0.8 million or 6.6% to $11.9 million for the six months ended June 30, 2022 from $11.1 million in the prior year same period. Gross profit for the six months ended June 30, 2022 was $5.2 million or 43.5% of total net revenue compared to gross profit of $8.2 million or 73.8% total net revenue in the prior yearâ\u0080\u0099s same period. Our ordinary operating expenses were $15.4 million and $5.3 million for the six months ended June 30, 2022 and 2021 respectively, an increase of $10.1 million. We ended with a net loss from operations of $15 million for the six months ended June 30, 2022 compared to $9.4 million in the same period the prior year. Other expenses decreased by $8 million to a net other income of $4 million for the six months ended June 30, 2022 from a net other expense of $4 million in the same period the prior year. Interest expense increased significantly for the six months ended June 30, 2022 as compared to the same period in the prior year due to the $100 million convertible notes issued in November 2021. We also recorded an income from changes in fair value of derivative liability in the amount of $18.7 million for the six months ended June 30, 2022 and none in the same period the prior year. Furthermore, the company recorded an income of $26.4 million from changes in fair value of derivative liability expense for Q2 2022 and none in the previous yearâ\u0080\u0099s same quarter. The company sustained a net loss of $10.9 million for the six months end at June 30, 2022 or a negative $0.26 per basic and diluted share compared to a net loss of $13.4 million or a negative $0.43 per basic and diluted share in the same period the prior year. Looking ahead to the second half of the year at our KPI, we now expect to see the following: For processing volume, Q2 2022 set another new record as our best quarter ever, almost double the volume year over year, which brings our year to date volume for the six months ended June 30, 2022 to about $1.8 billion; we look forward to a continuation of this trend during the second half of the year with new processing volume records in each subsequent quarter; we remain confident that we will process at least $4 billion for the total of 2022."
}