{
    "symbol": "GBOX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 22:47:11",
    "content": " Following up on a strong growth trajectory in 2021, the first quarter of 2022, the best quarter by volume of processing in the company's history was also highlighted by continued execution against several key strategic objectives that paved the way for long term growth. Gross profit in the first quarter of 2022 was $2.3 million, or 47.6% of total net revenue, compared to gross profit of $3.2 million, or 66.4% of total net revenue in the same quarter a year ago. Our normal operating expense was $7.8 million and $2.3 million for Q1 2022 and 2021 respectively, an increase of $5.5 million, primarily due to an increase in general and administrative expense related to payroll for increase in number of employees due to growth and also related to our heavy investment in research and development to improve our technology and headcount to support operations and sales growth. If our non cash operating expenses, such as stock compensation expense for employees and services, and depreciation are added back, we had a net loss from operations of $5.4 million for Q1, 2022 and a net income of $0.9 million for the same quarter prior year. Interest expense increased slightly in Q1, 2022 as compared to Q1, 2021 due to the $100 million convertible notes issued in November 2021 Amortization of discount, fees, and the fair value of derivative liability associated with the notes were also contributing factors. Furthermore, the company changed in fair value of the derivative liability expense of $7.7 million for Q1, 2022 and none in previous year, same quarter. The company sustained a net loss in the first quarter of 2022 of $21.3 million or $0.51 per basic and diluted shares, compared to net loss of $13.3 million or $0.38 per basic share and diluted shares in the same quarter a year ago. Adjusted net income, a non-GAAP financial measure for the first quarter of 2022 was $5.4 million of net loss. And as we stated in the beginning of this call, the first quarter of this year, which we are discussing today has been the biggest in the company's history with a total processing volume reaching approximately $750 million total."
}