{
    "symbol": "APPN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 19:38:03",
    "content": " These include comments related to our financial results, trends and guidance for the second quarter and full year 2022, the impact of COVID-19, including the emergence of new variant strains of COVID-19 on our business and on the global economy, the benefits of our platform, industry and market trends, our go-to-market and growth strategy, our market opportunity and ability to expand our leadership position, our ability to maintain and upsell existing customers and our ability to acquire new customers. In the first quarter of 2022, Appian's cloud subscription revenue grew 37% year-over-year to $58.4 million. Our cloud subscription revenue retention rate is 117% as of March 31, and our adjusted EBITDA was a loss of $3.4 million. We're also the only customer's choice for medium-sized businesses, more than $50 million, 2 years in a row. I'm incredibly appreciative to you, the Board and the founders for giving me the opportunity to join the company over 13 years ago and to help grow it from $25 million in revenues in 2008 to over $450 million based on our updated guidance for 2022. Cloud subscription revenue for the first quarter was $53.4 million, an increase of 37% year-over-year and above the top end of our guidance. Our total subscriptions revenue was $83.7 million, an increase of 31% year-over-year. Total revenue in the first quarter was $114.3 million, an increase of 29% year-over-year and also above our guidance range. Total non-GAAP operating expenses in the first quarter were $89.7 million, an increase of 34% from $67.2 million in the year ago period. For the second quarter of 2022, cloud subscription revenue is expected to be in the range of $55.8 million to $56.3 million, representing year-over-year growth of 31% to 32%. Total revenue is expected to be in the range of $102.8 million  to $104.8 million, representing year-over-year growth of 24% to 26%. For the full year 2022, we are increasing cloud subscription revenue to the range of $236 million to $238 million, representing year-over-year growth of 32% to 33%. We're increasing total revenue to the range of $453 million to $457 million, representing year-over-year growth of 23% to 24%."
}