{
    "symbol": "APPN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 20:52:08",
    "content": " These include comments related to our financial results, trends and guidance for the first quarter and full year 2023, the benefits of our platform, industry and market trends, and our go-to-market and growth strategy, our market opportunity and ability to expand our leadership position, our ability to maintain and upsell existing customers, and our ability to acquire new customers. In the fourth quarter of 2022, Appian's cloud subscription revenue grew 29% to $65.8 million. Our cloud subscription revenue retention rate was 115%, and our adjusted EBITDA was a loss of $24.8 million. For the full year, Appian's cloud subscriptions revenue grew 32% to $236.9 million. We note the large and growing size of our market, the technological advantage of our platform, the positive traction we're seeing from customers and partners, and the very attractive nature of our historical subscription revenue stream, 90% gross margin, 99% cloud gross renewal rate. Cloud subscription revenue was $65.8 million, an increase of 29% year-over-year and above guidance. Total subscriptions revenue was $93.2 million, an increase of 23% year-over-year. Professional services revenue was $32.5 million, an increase of 11% year-over-year. Total revenue was $125.8 million, an increase of 20% year-over-year and above our guidance range. Total deferred revenue was $200.3 million as of December 31, 2022, an increase of 31% from the year ago period. Cloud subscription revenue was $236.9 million, representing 32% growth year-over-year. Total subscriptions revenue for the year was $340.2 million, an increase of 29%. For the first quarter of 2023, cloud subscription revenue is expected to be between $67 and $69 million, representing year-over-year growth of 26% and 29%. Total revenue is expected to be between $130 million and $132 million, representing year-over-year growth of 14% to 16%. For the full year 2023, cloud subscription revenue is expected to be between $294 million and $296 million, representing year-over-year growth of 24% and 25%. For the full year 2023, total revenue is expected to be between $530 million and $535 million, representing year-over-year growth of 13% and 14%."
}