{
    "symbol": "VNO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 16:42:07",
    "content": " Later, we will conduct a question-and-answer session. I will now turn the call over to Steve Borenstein, Senior Vice President and Corporate Counsel Steve, you may begin. Yesterday afternoon, we issued our third quarter earnings release and filed our quarterly report on Form 10-Q with the Securities and Exchange Commission. These documents, as well as our supplemental financial information packages are available on our website, www.vno.com, under the Investor Relations section. In these documents and during todayâ\u0080\u0099s call, we will discuss certain non-GAAP financial measures. Reconciliations of these measures to the most directly comparable GAAP measures are included in our earnings release, Form 10-Q and financial supplements. Please be aware that statements made during this call may be deemed forward-looking statements and actual results may differ materially from these statements due to a variety of risks, uncertainties and other factors. Please refer to our filings with the Securities and Exchange Commission, including our annual report on Form 10-K for the year ended December 31, 2021, for more information regarding these risks and uncertainties. On the call today from management for our opening comments are Steven Roth, Chairman and Chief Executive Officer; and Michael Franco, President and Chief Financial Officer. Thank you, Steve, and good morning, everyone. As Michael will cover in a moment, we had another good quarter with comparable FFO of 14% from last yearâ\u0080\u0099s third quarter. Despite headwinds from a slowing economy and rising interest rates, we still expect this year to be up a fair amount from last year. We will feel the effect â\u0080\u0093 the full effect of higher interest rates on our numbers next year, given a full year of impact. Overall, this quarter we leased 450,000 square feet, 229,000 square feet in New York well below trend. This is a little bit growth of the slowing market, and a lot the result of timing. As Michael will explain, our New York pipeline is a robust 1.5 million square feet. The economy is clearly slowing, and capital markets are volatile. As a top priority, we have taken the following actions. Earlier this year, we extended our near-term debt maturity, so we now have no debt coming due in 2023 and a very modest $233 million on 3 assets coming due in 2024. Further, we extended our unsecured revolving lines of credit totaling $2.5 billion, with only $575 million outstanding through 2026 and 2027, providing significant liquidity for the next 4 to 5 years. In addition, we protected our floating rate debt exposure by swapping for 5 years, $2 billion of floating rate debt fixed, and a weighted average of LIBOR or SOFR as the case may be of 2.9%. Further, we have interest rate caps on an additional $2 billion providing protection above 4.2% on a weighted average basis for a weighted average term of 10 months. Please see Page 33 of our financial supplement, which describes all this activity line by line. So in effect, our only remaining floating rate debt exposure is $750 million, which is largely JV debt. The second area of our focus is, of course, the PENN District. Lastly, I want to comment on our dividend. As such, our Board of Trustees plans the right size our dividend in 2023 commensurate with our protection of taxable â\u0080\u0093 projection of taxable income. Thank you, Steve, and good morning, everyone. As Steve mentioned, we had another good quarter. While we experienced some headwinds from rising interest rates, our core business performed well. Third quarter comparable FFO as adjusted was $0.81 per share, compared to $0.71 for last yearâ\u0080\u0099s third quarter, an increase of $0.10 or 14.1%. The increase was driven primarily about rent commencement on new office and retail leases, the continued recovery of our variable businesses, and an adjustment for prior period real estate tax accruals at theMART, partially offset by higher net interest expense from increased rates on our variable rate debt. Notwithstanding additional interest expense from rising rates and a variable rate debt will result in lower comparable FFO per share growth for 2022, and we anticipate early in the year, we do still expect that comparable FFO per share will be up year-over-year. The additional interest expense and rising rates will have a greater impact next year, as the higher rates impact our variable rate debt costs for a full year. Weâ\u0080\u0099ve partially mitigated the impact of this due to significant amount of hedging we did this quarter, as Steve just covered. Excluding the accrual adjustments rate to theMART real estate taxes, the increase would have been still solid 3.4%. Our retail same-store cash NOI was up a very strong 7.7%, primarily due to the rent commencement of several important leases. Amidst the backdrop of economic uncertainty, the New York Class A office market remains resilient, stimulated by the cityâ\u0080\u0099s tight labor market for office use, job employment is now above pre-pandemic levels of $1.5 million. Year-to-date, market-wide leasing activity stands at 24 million square feet, 50% above where we were at this time last year, including 9.3 million square feet this quarter. Deal volume during the quarter was led by 16 headquarters leases signed in excess of 100,000 square feet, reinforcing the large tenants are committed in New York and are signing long-term commitments. As we enter the fourth quarter, though, caution is the word of the day. As businesses continue to reassess their space requirements, the bifurcation between high quality and commodity product is growing. Tenant preference remains strong for best-in-class newly developed or redeveloped buildings with modern amenities in collaboration spaces, and being on top of transportation is critical. Our portfolio consists largely of these types of assets, positioning us well to continue to capture tenant demand. During the third quarter, our office leasing team completed 42 transactions comprising 388,000 square feet across New York, Chicago and San Francisco. In New York, our average starting rents were very strong $89 per square foot, reflecting the breadth of our high quality portfolio. At theMART really 67,000 square feet in 19 transactions this quarter in a 50/50 mix of office and showroom activity. While the market in Chicago remains challenged, we have seen a pickup in proposal during the quarter. As expected, our tradeshow business has rebounded nicely in 2022 still not back to pre-pandemic levels yet, with NOI up $12.2 million through three quarters versus last year. In San Francisco at 555 California street, where weâ\u0080\u0099re full except for the queue, we leased 154,000 square feet during the quarter, including a large renewal with Morgan Stanley for its 132,000 square feet, and a 21,000 square foot expansion renewal with Centerview Partners. Our starting rents were very strong once again, generating a 12% positive cash mark-to-market. 555 California continues to be the premier real estate asset in San Francisco, particularly for financial tenants as evidenced by these leases. The bulk of the leasing activity incurred in the redevelop Long Island Railroad Concourse, where youâ\u0080\u0099re seeing very good activity with strong rents. However, retailer concerns about inflation in the economy, our results and them to be more cautious about committing the new leases now. Finally, let me spend a minute on sustainability, where we continue to be a leader. Vornado was once again selected as a global and regional sector leader for diversify the office and retail REITs and Global Real Estate Sustainability Benchmark or GRESB survey, ranking number one in the USA in our group, and number 3 out of all 112 publicly listed real estate companies in the Americas that responded to GRESB. In addition, we once again in GRESBâ\u0080\u0099s Five Star rating, received the Green Star distinction for the 10th time and scored in A for our ESG public reporting and for our score. Overall, the heightened market volatility and aggressive rise in interest rates is significantly impacting the capital markets and generally causing most lenders and debt investors to pause. We had anticipated the financial markets becoming more challenging this year, and focus early and dealt with our 2022 and 2023 maturities. Importantly, given the $3 billion in refinancing as we completed this summer at attractive spreads, we have dealt with all of our significant maturities through mid-2024 and are largely protected from near-term refinancing risk. Without a stable financing market, it is difficult to transact with large assets without in place that right now. Notwithstanding the market challenges, they executed a contract to sell 40 Fulton of $102 million and our negotiating sales of a handful of small assets. Finally, our current liquidity is a strong $3.3 billion, including $1.4 billion of cash, restricted cash and investments in U.S. Treasury bills, and $1.9 billion undrawn under our $2.5 billion revolving credit facilities. Michael or Steve, or maybe Glenn, can you just maybe provide a little more color on the 1.5 million feet in the pipeline? Yeah, as we look at the pipeline in terms of the 1.5 million feet, itâ\u0080\u0099s cited more towards new tenants and expanding tenants versus renewals. Itâ\u0080\u0099s a really good mix a lot from activity, financial service activity, some BD  activity. But, I would say, itâ\u0080\u0099s more sided to new tenants coming in or expanding tenants in the portfolio. Yeah, certainly financial service is heavy, less on tech, as youâ\u0080\u0099re saying. Thereâ\u0080\u0099s still some hedge fund activity also in our portfolio, at our financial buildings, 888 Seventh, 640 Fifth, et cetera. So certainly financial is busy, and law firms are definitely getting busier in the portfolio, particularly buildings like 1290 Sixth Avenue. And then secondly, Steve, in the past, youâ\u0080\u0099ve commented on your desire to sort of pursue one of the casino licenses downstate. We continue to be interested, very interested. I think, they have already announced that theyâ\u0080\u0099re going to put out their first ROIC , I think, late December, early in January. Maybe just going back to the comments on the dividend, wondering if you can frame maybe how much youâ\u0080\u0099re expecting the right size of dividend sort of heading into 2023. We really canâ\u0080\u0099t, I mean, itâ\u0080\u0099s a board prerogative. And then, for the $800 million term loan, it looks like about $250 million of those swaps are expected to still burn off in 2023. In terms of the cost of the swaps, what we laid out for you on Page 33 of the supplement, gives you the all-in swap rates so that â\u0080\u0093 thereâ\u0080\u0099s a credit charge thatâ\u0080\u0099s embedded in there, depends on that particular trade. I would say, 4 to 5 basis points is typical, sometimes itâ\u0080\u0099s a little bit less. But, I think, if you use that as a working assumption, thatâ\u0080\u0099s not bad. But again, thatâ\u0080\u0099s embedded in the numbers that we gave you. And on the term loan that you cite, these are all â\u0080\u0093 well, not all, but I would say largely corporate level swaps. So we have the ability to move those around as different loans, we pull up, where if we sold an asset, and we wanted to shift it around, which we did, for example, on Long Island City, earlier this year. We sold that asset, we moved it to a different asset. There are certain asset level swaps, but by and large, the corporate. And so, the term loan, we went ahead and forward swap 500 of that weâ\u0080\u0099re getting next year, and then we have the ability to potentially move some around. If not, the answer is weâ\u0080\u0099ll look at â\u0080\u0093 fixing that balance. Well, I think 27% not the right number to use. And â\u0080\u0093 when you look beyond that is whatâ\u0080\u0099s expose, itâ\u0080\u0099s basically loans that are coming due at the end of the year or we have JV partners where â\u0080\u0093 there was no sort of desire to collectively â\u0080\u0093 do any sort of hedging there. So, again, I think from a net exposure, weâ\u0080\u0099ve got about 7%. I want to also remind everybody, weâ\u0080\u0099ve got significant cash on our balance sheet thatâ\u0080\u0099s earning higher rates, some thatâ\u0080\u0099s been deployed in Treasury bills, some of that is just learning higher rates with our banking relationships. So on net exposure, I think itâ\u0080\u0099s even less than 7%. But, I think, itâ\u0080\u0099s a little bit more accurate in terms of what the exposure is. And just shifting to retail, we saw quite a drop in leasing spreads this quarter. I think over the last couple of calls, weâ\u0080\u0099ve communicated, we think retail has bottomed in the city, and that is our view. Youâ\u0080\u0099re starting to see vacancy decline in many of the key sub-markets, which obviously is the forerunner to start to have some pricing rebuilding, I think youâ\u0080\u0099re actually seeing rents move up a little bit slow already, but vacancy is beginning to drop in many of the sub-markets. But, overall, I think the markets bottomed, and leases that are getting done, retailers are focused on the best locations. They want to be in the highest footfall areas and the best sub-markets, our portfolio is situated there. And, when leases get done right now, theyâ\u0080\u0099re going to be reflected the fact that rents have corrected, depends on the sub-market could be one-third could be a half from where they were in peak. But, in most cases, we donâ\u0080\u0099t have exposure on â\u0080\u0093 of our big assets right now. So, it just depends on when the leases roll and where the market is the time. But, as I said, I think from a trendline standpoint, theyâ\u0080\u0099re more retailers cruising around the city looking for spaces. Theyâ\u0080\u0099re focused on the best locations, and being a little bit of caution right now, given whatâ\u0080\u0099s going on the economy. But net-net, New York is very much still top of the ranking of where they want to be and where they want to expand it. With respect to retail, we are still in a retail recovering market. If you look at the transportation numbers basically coming into the city, on the railroads, in the subways and the buses is two-thirds of what it was at debrief  pandemic, and, although, anecdotally traffic in the streets looks pretty wholesome. And our prediction is, is that the market will be very much more healthy in a couple of years. Hey, good morning, Steve and Michael. Maybe just following up on the retail, the $1.8 billion retail preferred that you guys have in the JV that you did a number of years ago. The cash flow coverage, I think, the coupon is 4.25%. And as you guys, Steve, think more about balance sheet focus, youâ\u0080\u0099ve addressed a number of the floating rate exposure. So, let me try to get all your questions. In terms of the value that referred â\u0080\u0093 we believe it remains fine, still worth par. , we donâ\u0080\u0099t think so. We build JV and our partners think, the values still left and that gave to be. So, I think, the retail preferred is front. From a cash flow coverage standpoint, again, just to remind you, the cash flow from all the assets, whether they have preferred or not, it goes to secure the payment of that preferred. And even though you assume rollover over time and some ups and downs and whatnot the coverage on that on our preferred dividends, which today is 4.25% will rise to 4.75%. Now, your last question, the ability to refinance out, if you go back to what I said in my opening remarks, I donâ\u0080\u0099t think this is any secret. The financing markets are not good right now, right, and any product category. So, banks are basically shutting it down for the rest of the year, unless youâ\u0080\u0099re a big client and great property and whatnot. So the tough market that financing if you have to, fortunately donâ\u0080\u0099t. But, retail rates remain challenging to refinance in the near-term. And so, this is not in our capital budget to get this refinance in the next year or so. Thereâ\u0080\u0099s five assets that have preferred on and, if we want to avail ourselves on 1 or 2 or 3, then weâ\u0080\u0099ll do that at the time. But, we donâ\u0080\u0099t need the cash today to go do it and pay exorbitant rates would not be prudent. So hopefully, I had everything asked, but thatâ\u0080\u0099s the current state. I think, Michael said very clearly that we think the collateral is just fine. Dividend is clearly in this very volatile, chaotic capital pocket is below what a market price and then preferred would be. So on a short-term basis, you might say that if you were a trader, and you sold it, you will get less than 5 because of the sub-market dividend, but thatâ\u0080\u0099ll change and so we still think that is a sound instrument. And then, Steve, second question, as you mentioned, dividend. You talked about the cautious environment, there was a lot more of an optimistic piece in the posts this week on New York office, and in particular, PENN 15. John, thanks for the question. A couple of things, I did say in my prepared remarks that the current environment makes round-up development very difficult, and I meant it. Regarding the taxable income next year, I know, youâ\u0080\u0099ve talked about rising rates in 220 Central Park South being fully sold. I mean, we said that we think that our budgets show that taxable income is going to go down. The primary reasons are higher interest rates, because weâ\u0080\u0099re not 100% protected. We have no income from 220, and we have a self economy. So, if you take all those three things together, weâ\u0080\u0099re budgeting that â\u0080\u0093 and weâ\u0080\u0099re not budgeting any gains from asset sales. So, I mean, I think that we are reluctant to put a number on that at the current time. For a dividend 2.12, and we havenâ\u0080\u0099t finalized taxable income. So, we think that the current dividend is within there of 100% of our taxable income for the year 2022â\u0080¦\n ...which includes, 2.12. The answer, Daniel is, there a lot of transaction activity. I think, there is â\u0080\u0093 first of all, I would say that the investor interest in New York City remains very high. Doesnâ\u0080\u0099t seem as attractive, given the issues they have. And then come back to U.S., looks very good. And New York is, I think, the question to global financial capital. So you have a lot of interest in New York, a lot of smart money thatâ\u0080\u0099s frankly scouring the market right now, looking at New York, because they see value. But, in the absence of a financing market, I think, itâ\u0080\u0099s going to stem activity for a period of time. I donâ\u0080\u0099t know if thatâ\u0080\u0099s one quarter, two quarters, who knows. And if youâ\u0080\u0099re forced to sell in this market, then youâ\u0080\u0099re picking on something larger than youâ\u0080\u0099re going to sell it a wider cap rate, right, if somebody needs financing. If they donâ\u0080\u0099t, itâ\u0080\u0099s in all cash buyer, then I think itâ\u0080\u0099ll be a little less compressed. Sure, thereâ\u0080\u0099s a cap rate impact. Is it 50 basis points, with the sort of maybe up 10%. I think is that a reasonable assumption, probably. Weâ\u0080\u0099ve seen this before many times, the economy is either entering recession or in recession. The second thing is, is that in these kinds of markets, only people that have to sell transact. And so, the only weak sellers are transacting, because the only buyers that are really trolling the market are distressed buyers. But this is not the kind of a transactional market or a capital market, where you can really make a judgment. The stocks of the office companies have corrected to the point, where in my judgment, they have gone significantly below even the distress mark-to-market of the portfolio significantly below that number. Just last one for Glen, Iâ\u0080\u0099m curious where you think concessions are trending these days. They havenâ\u0080\u0099t abated, Iâ\u0080\u0099m saying,   are still quote unquote too high, but theyâ\u0080\u0099ve stabilized. Youâ\u0080\u0099re certainly seeing more of the T eyes in terms of getting tenants into the buildings, in terms of helping them build out space more than historically, but I think that number has stabilized. Rents had really not fallen on the better buildings, if anything, theyâ\u0080\u0099re going up. Recently wrote a piece that came out recently, where basically debunked that idea, that recession, he gets higher unemployment, he gets changes the power from to the employer from the employee, and therefore the employee will scamper back into the office. I do believe, however, that the office is the workspace, as opposed to the kitchen table. And I believe that over time, the culture will change, where people will want to be back in the office, the office will be more productive. The collegial aspect of work, and being with colleagues and friends, et cetera, will overpower the temptation to sit at the kitchen table. But, I donâ\u0080\u0099t think that itâ\u0080\u0099s the pain of a recession, thatâ\u0080\u0099s going to change the marketplace. Just another big picture one, I hope you guys donâ\u0080\u0099t think this is unfair. But, Steve, youâ\u0080\u0099ve seen this movie before, but as investors really have been sidelined by this hybrid work secular concern and now we have the likely recession. Like I said, youâ\u0080\u0099ve seen this before. And there are very few assets that are on the market, certainly at distressed prices, but the distress is in the stock market. And so, I donâ\u0080\u0099t know, but I mean, from my personal family and investing, weâ\u0080\u0099d like to buy in recessions and thatâ\u0080\u0099s the time to buy. So whatâ\u0080\u0099s going to take for you guys to start realizing that these stocks are stupid, stupid, cheap. I donâ\u0080\u0099t know, but it will happen. And my guess is, is that â\u0080\u0093 just as the stock market always turns, and gallops ahead, way before the end of recessions. And just looking at your 2023 lease expirations, it seems like you have a disproportionate amount expiring in retail and office in the first quarter. As it relates to the office in 2023, itâ\u0080\u0099s really a mix of 4 of our properties, 770 Broadway, 350 Park, 1290 and 280, and thatâ\u0080\u0099s throughout the year, not only in the first quarter. Weâ\u0080\u0099re, of course, attacking all of those expirations, we have very, very good action on some and others were in the market, and trying to lease the space. I will tell you, when you look at those assets amongst our highest quality of buildings, and most unique characteristic buildings like a 770 like 350. The answer is, weâ\u0080\u0099ve got 2 or 3 key tenants rolling, and I canâ\u0080\u0099t tell you definitely, whatâ\u0080\u0099s going to happen there. Thereâ\u0080\u0099s discussion where â\u0080\u0093 all could renew and the discussions, weâ\u0080\u0099re not doing it, I said, still do fluid. I do think, net-net, even if most renewed income will be down some just given, where one may likely renew, but I just keep getting more precision, given the discussions remain pretty fluid right now,\n Okay, got it. And then just one follow-up on the March, it seems like the tradeshows are back, and I know in some years, you have the tax item. But, weâ\u0080\u0099re also â\u0080\u0093 we know that the casual business is going to be leaving, and so, probably bottoms in the low- to mid-60s, before it comes back. So that numbers probably in terms of a run rate at the end of the year, that low- to mid-60s is probably a decent run rate, before we rebuild that back. So that number in the next, itâ\u0080\u0099s called, 36 months within it gets back hopefully to north of $100 million. So based upon â\u0080\u0093 so right now itâ\u0080\u0099s about 75, we expect it to go down into the 60s, before it turns and goes back up to as much as 100, which will not happen next year, but it will happen in the future, potential for the assets. The little bit more volatile than we would like, but thatâ\u0080\u0099s the story. Thereâ\u0080\u0099s no impact on Farley, no impact on 770 relates to the recent announcements. Itâ\u0080\u0099s almost embarrassing to say, but we met a little bit of time looking at their credit, because they are a big tenant. So when you think about it, they have â\u0080\u0093 whatâ\u0080\u0099s the number $25 million of free cash flow a year after spending a similar amount or a greater amount on R&D, which is discretionary. They have cash balances in the 50s or something like that millions of dollars, billions of dollars. And so, from a financial point of view, they are a great company. Yeah, have to back that guy because look what heâ\u0080\u0099s done in the past. Even if itâ\u0080\u0099s not successful, it certainly will not impair the sanctity of that, unbelievable for this. So weâ\u0080\u0099re friends, weâ\u0080\u0099re vendors to them, and weâ\u0080\u0099re happy and honored to be so. So, I look at the NOI in the supplement and it feels like, I mean, I think Iâ\u0080\u0099m looking at this property. And then also see, I know, you did impair the investment back in 2020. But, when the original deal was struck, it was at a 4.5 cap rate, presumably, cap rates are higher today, based on everything going on in the world. So, in terms of the income on the portfolio now versus when we struck the deal, I donâ\u0080\u0099t have the exact numbers in front of me. Because of, as you may recall, forever 2021 went bankrupt, and so theyâ\u0080\u0099re still in the space, but that number is down from when the original deal was struck. So, like the signage is frankly booming right now, higher than when we struck the deal, but I think net-net is played down and touch. But, you correctly point out, the income has been very durable. Some of the leases roll, but thereâ\u0080\u0099ll be some impact. So I think in terms of the impairment, youâ\u0080\u0099re correct, in 2020, we did impaired. Again, Iâ\u0080\u0099m going from memory, Nick, I think we â\u0080\u0093 the fair value original deal was struck at 5, 4, and we impaired it south of $5 billion. I donâ\u0080\u0099t want to give you the number without having it, fine. But the answer is what we look at it every quarter, thereâ\u0080\u0099s an independent third party appraisal that is performed on behalf of the venture, which we frankly have â\u0080\u0093 we donâ\u0080\u0099t provide the assumption that they do their independent work. And we take that, and thatâ\u0080\u0099s sort of what drives that. So, theyâ\u0080\u0099ll do their work at the end of the year, and weâ\u0080\u0099ll evaluate. I think the market is certainly â\u0080\u0093 given your comments on the market, and how itâ\u0080\u0099s priced in our stock is certainly imperative significantly, but I canâ\u0080\u0099t say whether thereâ\u0080\u0099ll be any further upcoming impairments yet. Hey, a couple of quick ones for me. I certainly think, CEOs are more hesitant due to the economy, for sure. And I think, by sector, certainly the big tech is slowed. Iâ\u0080\u0099ll tell you, there is some more small to medium size tech activity, or a couple of leases signed in the market this quarter by a couple of those. But, generally, Iâ\u0080\u0099ll tell you, more caution, more hesitancy due to the economy, not so much by the hybrid specifically. I think everybody can do their own math and guesstimate, but Iâ\u0080\u0099m not do guesstimating business. I guess, just maybe bigger picture for Steve. Iâ\u0080\u0099m just â\u0080\u0093 I want to get your thoughts on what are you contemplating sort of macro wise, rates wise, and then more at a micro level with fundamentals. It just feels like things seem to have been inflecting according to last few calls, return to work was improving, leasing is improving. And so Iâ\u0080\u0099m just trying to balance all of this like near-term, you said, itâ\u0080\u0099s a 1-year issue. But it sounds like in your action, itâ\u0080\u0099s more like a 3-to 4-year issue than a 1-year issue. So letâ\u0080\u0099s see, obviously, the economy has been hyped to the tune that itâ\u0080\u0099s probably very destructive. So for whatever different reasons, and this is â\u0080\u0093 why donâ\u0080\u0099t want to get into politics, but for whatever different reasons, we have runaway inflation. And, as I said, I think the Fed is deadly earnest about doing their job and stopping it. So their number one tool, of course, is interest rates, the interest rates have had an enormous effect already. In a very rapid manner, I mean, as illustrated by the stock market, the whole market, et cetera. So, the Fed is going to win this battle. In the end, itâ\u0080\u0099s just a matter of how long it takes. We aggressively went to protect our floating rate exposure for multiple different reasons, the most important one of which was to protect against a runaway interest rate environment. So we think, we sort of had that covered. The most efficient execution for the swaps was 5 years, and so we basically did that. There is â\u0080\u0093 do not read anything into our firm view on the future, based upon this 5-year number. They generally go up at a pretty steep curve, and then they come down fairly quickly. They put the economy into recession, and then they aggressively have to fail it out. So thatâ\u0080\u0099s what we expect is going to happen this time, but we donâ\u0080\u0099t bet our life on anything. So we think we protected our balance sheet, we think to overpay our dividend is about appropriate. And so, we think weâ\u0080\u0099ve taken the proper financial actions to protect the fiscal sanctity of the company. We believe that this is going to be a 1- to 2-year event, not a 3- to 5-year event. So that 1- to 2-year is more, your comment on the fundamentals in office as opposed to the macro that you just out laid down, Iâ\u0080\u0099m assuming. Just following up on that, I know the numbers are moving aroundâ\u0080¦\n The 1 to 2 years is a macro prediction. Well, first of all, we are New York based. We believe, and anecdotally weâ\u0080\u0099ve had lots of conversations with lots of employers, and from all over the world. And we believe companies want to be here, for sure young people want to be here. Just anecdotally, Iâ\u0080\u0099ll tell you that a lot of my friends have moved back to Florida. But when you ask them, where their children are, all the children are in New York, and they want to be in New York, so thatâ\u0080\u0099s extremely talent. So we think that this will be a fairly predictable cycle, where different industries will grow with different rates. But just before that, I know the numbers are moving out. If you can model taxable income, thatâ\u0080\u0099s what the dividend is going to be approximately. And if you can model that to the penny, youâ\u0080\u0099re better man than we are. And so, weâ\u0080\u0099re in the budgeting process, we know when we over it, and we will make that decision in the first quarter. Steve, you mentioned about the valuation, and Iâ\u0080\u0099m sure, on a lot of numbers, you traded very low price per square foot, very high implied cap rate. Historically, weâ\u0080\u0099ve seen private equity come in and close gaps in sectors where thereâ\u0080\u0099s big, big discounts that persist. But, I guess, given â\u0080\u0093 where the financing markets are today, that just doesnâ\u0080\u0099t seem likely. The leveraged buyout model, which has equity and debt, may or may not work in this environment. Well, I guess youâ\u0080\u0099ve talked in the past about maybe the separation of the PENN District assets into a spin out, which I know was on hold. But you probably need to sell assets to be able to buy back stock, which seems difficult. Iâ\u0080\u0099m just wondering, are we missing anything here that you could do to help close the gap. Well, thank you all very much. The next call, the lovable Michael says is Valentineâ\u0080\u0099s Day. So, I guess, weâ\u0080\u0099ll see you in red on Valentineâ\u0080\u0099s Day. And by the way, you take up my invitations to come down to PENN. Please take advantage of our invitation, itâ\u0080\u0099s sincere ."
}