{
    "symbol": "GAME",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-14 21:14:04",
    "content": " If you pay close attention, you will quickly see how many of the same business models that succeeded in the transition from analog to digital are now shifting again to meet more targeted, hard-to-reach audiences in the live streaming and social sphere, where influencers, along with their loyal followers have the ability to drive brand awareness, e-commerce transaction revenue as well as other types of services and offerings. Engine sits at the epicenter of this groundswell through a combination of our data, discovery, influencer and audience watch tools from Stream Hatchet, where gaming publishers, agencies and brands need up-to-date, accurate, reliable audience and advertising data through live streaming platforms, including Twitch, YouTube, Meta and many other live streaming platforms throughout the world. Our focus on, Frankly, Sideqik and Stream Hatchet deemphasizes our B2C gaming endeavors at this time, increasingly defining the company as one that is data-driven, guiding gaming industry companies, brand sponsors and performance marketers as well as media sellers when it comes to their data analytics, digital advertising and marketing needs. We are finding a unique role for our Stream Hatchet services when it comes to not only measuring game play on live streaming platforms, but how sponsors can effectively drive their marketing programs through the increasingly important influencer community inside and outside the gaming world. We are also finding that our role in selling programmatic inventory can be enhanced by being able to offer digital marketing and promotion capabilities to, Frankly, advertising clients, such as through social media and gaming live streaming platforms as a combined expertise that is unique in the market. So we’ve highlighted a few customers in the past that take advantage of the Sideqik influencers sort of marketing pipeline, just a few names from some of our previous disclosure, Nike, Lululemon, HyperX to reach sort of using the influencer pipeline to not only discover and identify influencers that are compatible with their brand objectives, but they are also sort of managing sort of the pipeline to be able to reconcile downstream economic impact on the activities that they are running across the Sideqik platform. In fact, Sideqik was one of the first licensees of the Stream Hatchet API in order to gather many of the data points that Stream Hatchet gatherers in the live streaming space to offer brands that want to reach gaming influencers and the younger demographics that are surfaced through the Stream Hatchet data pipeline and that are connecting with these live streaming platforms, particularly males that are 18 to 35-year-old. So when you combine the 18 to 35-year-old demographics and the influencers in these live gaming platforms with the discovery platform and the ability to manage and monetize influencer sort of campaigns across Sideqik, there is an interesting opportunity to reach live streaming sort of influencers and their audience is that they typically sort of reach right through the content that they distribute on those platforms. The reason that we think the B2B businesses are so exciting and are able to drive growth on a less cash-intensive basis is because gaming viewership is growing 20%, the investment in influencer marketing platforms continues to grow at 30% or more on a CAGR basis, programmatic digital display ads are continuing to grow at 30% a year."
}