{
    "symbol": "QLYS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 23:54:04",
    "content": " Qualys Cloud Platform’s unified approach of bringing asset inventory, vulnerability detection, patch management and EDR together into a single agent was greatly appreciated by our old customers in helping to reduce their exposure significantly compared to a siloed toolset approach with multiple point solutions. Additionally, as shown in the study encompassing more than 150 million scans globally, over 50% of vulnerable Log4shell software was also end-of-life, again highlighting the strategic visibility provided by Qualys’ integrated Cybersecurity Asset Management capability that allowed our customers to understand their technology depth and its impact to their security for proactive risk reduction. This customer chose Qualys because we offer the only security and compliance stack available in the market today that utilizes a single agent to enable full asset visibility and context aware mapping to prioritize vulnerabilities, proactively reduce technical debt, automate patching and continuously monitor endpoints to defend against future Malware and Ransomware events across multiple environments. Your line is open. Your line is open. We also expanded the ability for us to collect network telemetry and other types of log data from multiple different partners as well, so that we can provide a more comprehensive visibility in helping customers sort of reduce the number of things that they have to put together to get the context, when they're looking at incidences are happening in their environment. Your line is open. Your line is open. Your line is open. And so today what we do see is as customers are looking to migrate potential workloads from on-prem systems into the cloud, they feel Qualys has the right capabilities as a trusted partner to help them make the move rather than, so we have capabilities in the cloud environment, so we have bunch of customers who are running stuff our agents in AWS, in Azure, we have the partnership with Azure, where there is an embedded Qualys capability in Azure environment if you take your workflow. With the early XDR customers it's again the same thing is that when they are looking at threats and they are looking at exposure that is not only in one particular environment with the Qualys platform and our context so that we are able to bring the visibility of not only maybe the cloud account that maybe seen some activity, but also that remote employee laptop, admin laptop, which may be accessing that cloud account."
}