{
    "symbol": "QLYS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 18:44:08",
    "content": " This customer selected Qualys because we offer the only security and compliance stack available in the market today that utilizes a FedRAMP authorized platform and single lightweight agent to enable full asset visibility and context aware mapping to prioritize vulnerabilities, proactively reduce technical debt, automate patching and continuously monitor endpoints with high fidelity telemetry to defend against future Malware and Ransomware events across multiple environments. While we have been very focused on helping customers secure their cloud and container environments for some time now, our recent launch of TotalCloud further flexes the power of our platform by enabling cloud native VMDR with FlexScan by pairing agent and agentless zero touch assessment options with high efficacy, vulnerability detection and prioritization capabilities, organizations can now extend the platform to continuously view all cloud assets visualize the entire external attack surface and reduce risk by rapidly remediating and preventing misconfigurations and vulnerabilities from build to runtime. With the recently announced acquisition of Blue Hexagon, Qualys can now apply cloud, scale, Artificial Intelligence and Machine Learning capabilities to the Qualys Cloud Platform and it's more than 13 trillion data points collected from over 100,000 network scanners and over 90 million cloud agents, what makes this combination so significant its ability to discover and identify relationships and patterns within our highly integrated data lake to rapidly predict and detect anomalous activities in customer environments that are invisible and undetectable in traditional security solutions. Specifically upon integration, this capability will allow Qualys customers to detect active vulnerability exploitation, identify advanced network threats and enable adaptive risk mitigation, including real time zero day threat detection across all assets applications and environments. Our LTM average deal size increased 18% as organizations continued to turn to Qualys to solve modern security challenges through cloud native platforms that aggregate and analyze data in the cloud, operate at web scale, leverage network effects to produce superior outcomes, and are easy to deploy and simple to manage. And so, as we continue to build a more holistic platform as we really think about it is customers need to know their devices, they need to be able to mitigate risk and then they need to be able to monitor the threats and that's where the combination of asset inventory, VMDR plus branch management and then EDR plus XDR from Qualys is going to benefit from the integration of Blue Hexagon into our stack."
}