{
    "symbol": "QLYS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 20:30:23",
    "content": " Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. But I think as we have provided the color with Patch Management, not just from what we see on the business from bookings, but also the fact that Qualys agents have deployed 130 million patches for our customers, it really is a testament to the fact that we are becoming a very critical for these customers to help reduce the vulnerability, right, not just report on them. And so they actually do help each other in terms of customers who are looking to get VMDR are more likely, in our opinion, to go with Qualys when they see that they can also leverage Patch Management and they see that external attack surface is built into that solution or Cybersecurity Asset Management is bringing them a lot of visibility into the asset inventory. So as Vulnerability Management continues to be critical, the surrounding functions, as I would call them, to first find all your assets and then fix all your vulnerabilities start to become more and more important than especially conversations with our customers in the current macroeconomic environment that we see they are looking for how they can get additional value, how they can get more out of the solutions that they already have. And so that's why we are quite excited and we kind of do see that Cybersecurity Asset Management and Patch Management are starting to be the area of focus for customers as they're looking to really reduce the amount of time it takes for them to find an asset to actually fix it, which today, with multiple tools and multiple teams. Your line is open. And so, with new business right now, we're seeing that our bookings in this quarter were amongst the highest that we have seen along with the increase in the average deal size, right, which is quite interesting and exciting for us because what that tells us is that when we are in a competitive situation with -- and we are talking to these customers, we're actually able to bring them, show them the value of the combined solution set that they can purchase multiple things together. And exactly for that purpose, we want to continue to stay ahead of where everybody else is in terms of the capabilities we bring with VMDR to the VM market, which is why within two years of launch, we launched VMDR 2.0 recently, which was really well received by our customers, bringing additional capabilities on risk rating, risk ranking, and really focusing on remediation along with the ability to leverage ITSM tools to really significantly reduce the time for remediation. So VMDR adoption strategy has been to get VMDR, get them to see the value of the adjacent capabilities, get more agents, which make it easier for them to adopt some of these additional capabilities and then continue to innovate with, as we did with VMDR 2.0 to add these additional capabilities, and we're excited to see how our customers can benefit from External Attack Surface Management, also which we are launching, which we just launched this week so that they can bring additional assets into their VMDR purview. Your line is open. Your line is open. I think that going in the trend of what we talked about in terms of the new product portfolio, especially focused on Cybersecurity Asset Management and Patch Management as sort of additions to VMDR, I think, for us that has been really positive."
}