{
    "symbol": "RYN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 16:40:05",
    "content": " Based on these factors, along with the expected contribution from the leased properties, we anticipate an annual average harvest level of approximately 860,000 tons from the acquisitions over the next decade and an increase in our U.S. South sustainable yield of 11% to 7 million tons per year. Putting all of this together, we expect that the acquisitions will contribute average annual adjusted EBITDA of roughly $25 million to our Southern Timber segment over the next 10 years with additional upside potential from higher and better use real estate sales and natural climate solutions. Drilling down further on our operating segments, our Southern Timber segment generated adjusted EBITDA of $37 million in the third quarter, which was 50% above the prior year period. In our Pacific Northwest Timber segment, we achieved adjusted EBITDA of $13 million, up 1% from the prior year quarter. Timber segments continued to generate strong financial performance and pricing gains in the third quarter, driven by favorable end market demand as well as localized supply tension and both segments remain on pace to achieve record full year adjusted EBITDA. In our Real Estate segment, we generated adjusted EBITDA of $8 million, down from $64 million in the prior year period, as the prior year period benefited from the closing of two significant development transactions. As Mark will discuss in greater detail later in the call, we remain on track to achieve our full year adjusted EBITDA guidance of $310 million to $330 million with our Southern Timber and Pacific Northwest Timber segments, both expected to post record years in 2022. Third quarter adjusted EBITDA was $65 million, down considerably from $115 million in the prior year period, which as Dave mentioned, was driven by an exceptionally strong real estate contribution in the prior year period. At nearly $118 per ton, our average delivered sawlog price during the third quarter was up 10% from the prior year quarter, driven by continued strong demand from domestic lumber mills as well as a favorable species mix with a higher proportion of Douglas fir volume. Meanwhile, third quarter pulpwood pricing of $51 per ton climbed 62% over the prior year quarter, reflecting strong end market demand coupled with supply constraints due to fewer residuals and increased competition from pulp mills or a limited supply of smart sized logs. The decline in adjusted EBITDA compared to the prior year quarter was largely driven by lower net stumpage realizations and higher costs, partially offset by higher carbon credit sales, higher harvest volumes and favorable foreign exchange impacts. Average delivered export sawtimber prices of $123 per ton declined 18% as compared to the prior year quarter, reflecting reduced demand from China. Overall, we continue to expect record full year adjusted EBITDA in our Southern Timber segment with results in line with our prior guidance range of $156 million to $162 million. Similar to our Southern Timber segment, we continue to expect a record year in our Pacific Northwest Timber segment with adjusted EBITDA towards the higher end of our prior guidance of $59 million to $63 million. In our Real Estate segment, we expect full year adjusted EBITDA toward the lower end of our prior guidance range of $74 million to $79 million, primarily due to the delayed timing of a few transactions as well as a modest slowdown in rural land sales activity. You may go ahead, sir. You may go ahead, sir. You may go ahead, sir. You may go ahead, sir."
}