{
    "symbol": "RYN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 18:10:25",
    "content": " Adjusted EBITDA was 13% below the prior year quarter, as favorable results in our Southern Timber and Pacific Northwest Timber segments were more than offset by lower adjusted EBITDA in our New Zealand Timber and Real Estate segments. Drilling down further, our Southern Timber segment generated adjusted EBITDA of $39 million in the second quarter, which was 27% above the prior year period. In our Pacific Northwest Timber segment, we achieved adjusted EBITDA of $14 million, up 3% from the prior year quarter. In sum, our US Timber segments continued to generate strong financial performance and pricing gains driven by favorable end market demand as well as localized supply tension and both segments are on pace to achieve record adjusted EBITDA for the full year. Second quarter adjusted EBITDA of $15 million, declined 46% from the prior year period. In our Real Estate segment, we generated adjusted EBITDA of $25 million, down from $29 million in the prior year period and significantly higher per acre values in the current quarter were more than offset by a 41% reduction of in acres sold. Moving to our Pacific Northwest Timber segment on page 10, adjusted EBITDA of $14 million was 3% above the prior year quarter with higher net stumpage realizations more than offsetting lower harvest volumes, higher costs and lower non-timber income. Meanwhile, second quarter pulpwood pricing of $45 per ton was up 56% year-over-year reflecting strong end market demand as well as the resumption of chip exports, which resulted in greater competition from pulp mills to secure supply. The decline in adjusted EBITDA was largely driven by higher costs and lower delivered log pricing, partially offset by higher carbon credit sales favorable foreign exchange rate impacts and a slight increase in harvest volumes as compared to the prior year quarter. Average delivered export sawtimber prices of $140 per ton were down 5% as compared to prior year quarter reflecting, reduced demand stemming from the COVID-19 lockdowns in China. While log markets in New Zealand have been challenging this has been partially offset by higher non-timber income, which increased to $3.8 million in the current quarter. Based on our first half results and our expectations for the balance of the year, we now anticipate full year adjusted EBITDA of $310 million to $330 million, reflecting a modest reduction in the upper end of our total full year adjusted EBITDA guidance relative to our prior guidance. With respect to our individual segments, we now expect that our Southern Timber segment will achieve full year harvest volumes of 6.4 million to 6.6 million tons, which is at the higher end of our prior guidance, reflecting strong year-to-date production. Overall, we expect to achieve record full year adjusted EBITDA in our Southern Timber segment of $156 million to $162 million, which represents a 7% increase at the midpoint from our prior guidance and roughly a 30% increase from the prior record we set in 2021. In our Pacific Northwest Timber segment, we now expect full year harvest volumes of 1.6 million to 1.7 million tons due in part to a modest adjustment in our harvest plan to reflect land sales as well as reduced China export volume. Similar to our Southern Timber segment, we are on track for a record year in our Pacific Northwest Timber segment and are now expecting adjusted EBITDA of $59 million to $63 million. Overall, we now expect the New Zealand Timber segment will generate full year adjusted EBITDA of $55 million to $60 million."
}