{
    "symbol": "RYN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:44:05",
    "content": " Our southern timber segment generated adjusted EBITDA of $48 million for the quarter, which was 53% above the prior year first quarter and represented an all time record quarterly result for this segment. In our Pacific Northwest timber segment, we achieved adjusted EBITDA of $22 million up 22% from the prior year quarter and likewise an all time record result for this segment. Conversely, financial results in our New Zealand timber segment declined significantly versus the prior year quarter as higher pricing was more than offset by compressed margins due to significantly higher shipping costs, 14% lower production volumes and unfavorable foreign exchange impacts. First quarter adjusted EBITDA on our New Zealand timber segment was $10 million, down from $21 million in the prior year quarter. In our real estate segment, we generated adjusted EBITDA of $25 million, up considerably from $5 million in the prior year period, as a significantly higher number of acres sold was partially offset by a modest decrease in weighted average prices due to the mix of acreage sold. We generated first quarter adjusted EBITDA of $98 million, which was up considerably from the prior year period due to much higher contributions from both of our U.S. timber segments as well as our real estate segment. Upward pricing also improved significantly over $24 per ton increasing 41% in the prior year quarter, reflecting robust competition across several wood baskets as customers look to secure supply and replenish low mill inventories. Also, while we expect net stumpage realizations to remain well above prior year levels, we anticipate modestly lower weighted average prices for the remainder of the year as compared to the first quarter due to higher mill inventories, a higher proportion of thinning volume and a less favorable geographic mix. We further expect that weighted average log prices will remain near first quarter levels for the balance of the year, driven by continued strong sawtimber demand and improving public markets. Your line is open. Okay, that's very helpful. Okay, that's very helpful. So in 2021 put that in context in 2021 we had a record year for EBITDA in the south about $120 million and the midpoint of our guidance for full year 2022 is up about 25% from that and obviously, we’ve gotten off to a really strong start here with Q1. Your line is open. Well, I’d say, Mark if you think about the breakdown of the quartiles we have over 60% in the top quartile, which has of our southern holdings is balanced and when it’s balanced, we believe that ultimately translates to higher price elasticity and it’s in those regions which are in kind of that coastal Georgia, Florida, South Carolina area where we’ve had very strong pricing response to rising lumber prices and that certainly contributed. But we are relatively pleased with the Q1 result, all things considered and New Zealand though, it will be kind of contingent upon what happens in China and how that export market evolves during the course of the year but at the end of the day kind of given how these different businesses are valued I trade EBITDA in New Zealand for EBITDA in U.S. South any day, because obviously, we're getting a lot more kind of valuation leverage on those earnings. And so we're obviously very encouraged by how we started the year, especially encouraged by the pricing momentum that we've seen in the South because that's far and away our highest multiple business from a valuation standpoint, our highest probably EBITDA to free cash flow conversion business across our portfolio. Your line is open. What I would add to that Mark is that obviously that transaction that you're referring to came in at a very strong price well over $3,000 an acre in the south, which is obviously well above any kind of average pricing, you might see, but again, I think it's very much reflective of what we've talked about considerably in the past that the US South is not one big homogenous market. Your line is open. Your line is open."
}