{
    "symbol": "RYN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 14:35:13",
    "content": " The strong full year results in our U.S. timber operations were partially offset by lower adjusted EBITDA versus the prior year in our New Zealand Timber segment, which contended with slower economic activity in China, as well as higher operating costs. Our Southern Timber segment generated adjusted EBITDA of $33 million in the fourth quarter, which was 1% below the prior year period. In our Pacific Northwest Timber segment, we achieved fourth quarter adjusted EBITDA of $16 million, up 18% from the prior year quarter. Fourth quarter adjusted EBITDA of $14 million increased 39% from the prior year period due to increased carbon credit sales and 7% higher harvest volumes, which more than offset lower log pricing amid continued export market headwinds. In our Real Estate segment, we generated adjusted EBITDA of $14 million in the fourth quarter, up significantly from $3 million in the prior year period. Adjusted EBITDA was $68 million in the fourth quarter, up from $50 million in the prior year period. Adjusted EBITDA in the fourth quarter of $33 million was 1% below the prior year quarter, driven by lower harvest volumes, largely offset by higher net stumpage pricing, lower leased land report station costs and higher non-timber income. Meanwhile, pulpwood net stumpage pricing decreased 1% to roughly $21 per ton versus prior year quarter, primarily due to weaker end market demand and an increase in available supply as a result of drier weather conditions. Overall, weighted average stumpage prices in the fourth quarter improved 7% versus the prior year quarter to nearly $26 per ton. At nearly $112 per ton, our average delivered sawlog price in the fourth quarter was up 14% from the prior year period, primarily driven by strong demand from this lumber mills as well as a favorable species mix with a higher proportion of Douglas for volume. Meanwhile, fourth quarter pulpwood pricing of $66 per ton increased 80% over the prior year quarter, reflecting strong end-market demand, coupled with supply constraints due to fewer residuals and increased competition from mills for limited supply of smaller-sized logs. Average delivered export sawtimber prices of $111 per ton declined 16% as compared to the prior year quarter, reflecting reduced demand from China. Fourth quarter average delivered sawlog prices declined 20% from the prior year period to $65 per ton, largely driven by a sharp decline in the New Zealand dollar, U.S. dollar exchange rate. While log markets in the New Zealand remained challenging in the fourth quarter, non-timber income in New Zealand, which primarily reflects carbon credit sales, continue to bolster our financial results during  $9.1 million of revenue in the quarter."
}