{
    "symbol": "ENLC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 12:20:19",
    "content": " Last night, we reported fourth quarter adjusted EBITDA of $337 million and 2022 adjusted EBITDA of $1.285 billion. We achieved these results despite December headwinds; severe winter weather throughout Texas and Oklahoma, along with unscheduled downtime after an earthquake in the Permian, had a negative impact on adjusted EBITDA of approximately $11 million in the fourth quarter of 2022. Let's start with our largest segment the Permian, where segment profit for the fourth quarter of 2022 came in at $89 million. Excluding plant relocation OpEx and unrealized derivative activity, segment profit in the fourth quarter of 2022 decreased 15% sequentially, but increased over 27% from the prior year quarter. Excluding the impact of unrealized derivative activity, segment profit in the fourth quarter of 2022 increased approximately 8% sequentially and 9% from the prior year quarter. Excluding plant relocation OpEx and unrealized derivative activity, segment profit in the fourth quarter of 2022 grew 8% sequentially and nearly 13% from the prior year quarter. For the full-year 2022, EnLink delivered adjusted EBITDA of $1.285 billion and free cash flow after distributions of $312 million. Consistent with our capital allocation plans to increase returns to investors, we increased our common unit distribution by 11% in the fourth quarter of 2022 to $0.50 per unit annualized. Additionally, we remain active with our common unit repurchase program and completed the $200 million plan for 2022 with $53 million spent in the fourth quarter. Accordingly, a change of plus or minus $0.50 per MMBtu impacts adjusted EBITDA by approximately $1 million and a change of plus or minus $5 per barrel impact adjusted EBITDA by approximately $11 million, in each case, assuming no change in our forecast volumes. Excluding plant relocation expenses, we forecast Permian segment profit at a mid-point of $460 million for growth of approximately 8.5%. Oklahoma segment profit for 2023 is forecast to be $425 million at the mid-point, representing an increase of approximately 8% when excluding plant relocation expenses incurred in 2022. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}