{
    "symbol": "RTL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 17:01:03",
    "content": " We had an excellent third quarter highlighted by leasing over one million square feet, including new leases and lease renewals and completing the CIM Portfolio Acquisition. The financial press has broadly touted the resilience of the U.S. retail sector, including in a featured article in the Wall Street Journal in early October that declared that U.S. retail â\u0080\u009cis enjoying its biggest revival in years.â\u0080\u009d Retail vacancy fell to its lowest level in 15 years in the second quarter of this year, while asking rents at U.S. shopping centers were 16% higher than five years ago. This includes over 500,000 square feet through 41 new leases in our multi-tenant portfolio with $3.5 million of annualized straight line rent and over 550,000 square feet on 42 lease renewals in our multi-tenant portfolio, representing $8.4 million in annualized straight line rent. Our leasing pipeline as of October 31, including leases executed after the end of the third quarter, consisted of over 368,000 square feet and $5 million in annualized straight line rent over a weighted average lease term of 11.2 years. This consists of 70 new leases, totaling almost 800,000 square feet and over $6.5 million in annualized straight line rent and 98 lease renewals totaling over 1.1 million square feet and $16.5 million in annualized straight line rent. At quarter-end, our $5.2 billion portfolio was comprised of 1,050 properties with executed occupancy plus leasing pipeline of 93.9% and a weighted average remaining lease term of seven years. Annualized straight line rent increased almost 38% year-over-year to $392.3 million and the square footage of our portfolio grew over 43% to approximately 28.8 million square feet, in large part due to the acquisition of the CIM Portfolio. Third quarter AFFO was $34.2 million or $0.26 per share, up 18% compared to the fourth quarter of 2021, the last full quarter prior to the CIM transaction. This quarter's results reflect nearly the full impact from the acquisition of the CIM Portfolio and did not include any lease termination fees, which had previously increased revenue and AFFO in both the third quarter of last year and the second quarter of this year by $10.4 million and $5.7 million, respectively."
}